{
    "title": "Has the advancement of medicine halted human evolution? - Quora",
    "tags": [
        "Evolution (process)",
        "Human Evolution",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Huestis",
                "href": "/profile/George-Huestis"
            },
            "answer_text": "If anything, quite the opposite. “Evolution” is a function of diversity, and medicine means we can sustain a much higher level of diversity than we otherwise would be able to. Diversity is tied to evolution because the way evolution works is that your environment changes. When your environment changes (say, when the world heats up by about 2 degrees F, resulting in global changes to weather patterns, sea currents, and what plants will grow where), this imposes “population stress.” In the wild (In species that do not actively predict future environmental changes and preemptively adjust to them), what happens is that critters with less fur suddenly have an easier time of it in the warmer climate… and also critters that can range farther without getting tired can move more easily between limited resources that might be getting farther apart (say, water and your preferred prey). So you might have a situation where leaner, faster, less furry versions of a species survive better than their furrier, larger, slower versions. In humans, though, we pretty much tow our entire population along with us, at least in civilized portions of the world (yes, I’m taking a potshot at my home nation, America, here, and yes that’s intentional). This means that when the next great mega-disaster strikes, we don’t just have minor varieties of fur and leanness to pick from… We have people who see differently, hear differently, think differently, feel differently. We have people of all sizes and shapes. We have strong people who can lift heavy objects and weak people who burn fewer calories. We have creative people for whom repetitive tasks are hellish and hyper-focused people who can reliably do the same work for 12 hours without losing their concentration. So when an Alien species arrives and uses light to enslave everyone except the blind people and sound to enslave everyone but the deaf people, humanity will live on, nonetheless. If that sounds ridiculous, I present to you an example presented to me by a high-school science teacher, Dr. Cohn (an excellent man, and an excellent violinist). It was part of our fruit-fly unit. Class: “But Dr. Cohn, why do flies still pass along the genes that make wings useless? It seems like evolution might have weeded that out?” Dr. Cohn: “Environments change in unpredictable ways! Can any of you think of a situation in which being unable to fly might be an advantage to a fly?” Class: “…” Dr. Cohn: “Yeah, bends the mind, huh? Look at that aquarium full of flies over there.” <we look> “What happens when I electrify the wire mesh on top?” class: “… oh.” “Now that might seem hypothetical, but what if a new super-predator invades the region? It’s an aerial hunter though, and it tracks targets that are moving. Suddenly, only flies without functional wings are able to survive, because anything that takes off immediately dies.” So medicine hasn’t halted Evolution for humans. It’s made us much, much better at it. ",
            "date": "Answered January 6, 2018",
            "views": "287",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tiny Nair",
                "href": "/profile/Tiny-Nair"
            },
            "answer_text": "It was a hectic program at South Africa with back to back medical lectures and workshops that I had to do. I reached back home tired after a long flight from Cape Town. The first thing that my mom told me once she saw me was ‘oh my son, you have become so much darker’ Since I happen to hover between ‘shade 8 to 9’; in a scale of darkness from 1 to 10; my moms comment reiterated the fact that Indian women of all ages are so deeply attached to fair complexion. Her comment also made me start thinking as to what could be the mechanism of getting dark, on sun exposure, that too just in a week’s time. Evolution Evolution is typically driven by need for survival; a biped stance made us run fast with our surveillance system mounted on top of a ‘180–degree’ rotating neck and a depth sensing stereoscopic vision to detect predators; a off-axis thumb for better grasp; a lung instead of a gill fit for land use. But human ingenuity has taken care of the need itself. Motorised transport has nullified the need for faster running. Telescope and microscope extended the reach of our vision; large array of dish-antenna searching the sky to eavesdrop on the slightest noise from the space, million times powerful than human ear. Does this mean that there is no dire need for evolution? Does it mean we will de-volute; losing our ability to run or climb and such other physical attributes of our forerunners? The answer is no. ‘Yuval Harari’ author of ‘Homo Deus’ puts it this way. ‘Phidipidis’, the Greek messenger ran 42.195 Kilometers from the battlefield of ‘Marathon’ to Athens to deliver the good news of wining the war; starting off the traditional marathon. In 1908 Johnny Hayes ran the Olympic marathon in 2 hour 55 minutes; shattering the impossible ‘3-hour’ myth. Today the minimum qualifying criteria is 3 hours to get a chance to run for Olympic marathon. The Rio Olympic record of Kenyan ‘Eluid Kipchoge’ is an unbelievable 2 hours and 8 minutes. This shows that human endurance is increasing, a point against de-volution. There is actually no ‘Need for Speed’ New ’Fast’ Evolution; Genotype to Phenotype We know that genetic code doesn’t easily change unless there is a mutation; but we have evidence that the activity of DNA changes (its ability to transcribe info on RNA and RNAs ability to sequence Amino acids and create a protein). The suppressor and promoter elements of DNA are under the influence of the environment. Such effects, may start to show off quickly in few days time, but contrary to popular belief, may not be transient; the trait may be passed on to the next generation. (scientific American 2018). (https://www.scientificamerican.com/article/what-is-junk-dna-and-what/) Sun exposure, for example, can suppress the inhibitory effect of a melanin (skin pigment) producing gene, and create darkening in a week’s time. May be this is the new evolution in the new medical and technological era; fast, efficient, self perpetuating. Bright African Sun to dark Indian Son My mom died of Alzheimers disease 5 years back. Good that she didn’t have a chance to read the cutting edge science; lest she would have been worried, not just about the colour of her son but the colour of her future grandchildren. ",
            "date": "Answered July 26, 2018",
            "views": "213",
            "upvotes": " View 801 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Keerthi",
                    "user_href": "/profile/Keerthi-189"
                },
                {
                    "user_id": "Mangren Zheng",
                    "user_href": "/profile/Mangren-Zheng"
                },
                {
                    "user_id": "Simon Asnomudo",
                    "user_href": "/profile/Simon-Asnomudo"
                },
                {
                    "user_id": "Lada PRKIC",
                    "user_href": "/profile/Lada-PRKIC"
                },
                {
                    "user_id": "Akshay Harake",
                    "user_href": "/profile/Akshay-Harake"
                },
                {
                    "user_id": "Purnabhishek Muppala",
                    "user_href": "/profile/Purnabhishek-Muppala"
                },
                {
                    "user_id": "Adu Mike",
                    "user_href": "/profile/Adu-Mike-2"
                },
                {
                    "user_id": "Robin Diaz",
                    "user_href": "/profile/Robin-Diaz-10"
                },
                {
                    "user_id": "James Rupp",
                    "user_href": "/profile/James-Rupp"
                },
                {
                    "user_id": "Ryan Hunt",
                    "user_href": "/profile/Ryan-Hunt-96"
                }
            ]
        }
    ]
}