{
    "title": "Has the technology industry always been sexist towards women? - Quora",
    "tags": [
        "Diversity in Technology",
        "Technology Industry",
        "Sexism",
        "Women"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vrinda Wakhlu",
                "href": "/profile/Vrinda-Wakhlu"
            },
            "answer_text": "The article you have referred to talks about a time when women were generally not given their due credit, and that was not particularly the case with the tech industry - it happened in almost every field. In today's times, and this is what I have heard from my male friends working in the IT sector, generally women make a lot of excuses. There are times when you have to get some work done and you have stay a bit late, but most of the women do not even sit for an extra hour, while all the men in their group have to sit through late hours in the night. The guys say it is understandable that always working late is no good at all, but some times, when you have committed to doing some work done, you should be sport enough to put in some extra effort. Second thing that I have heard is that it is very difficult for a team leader or a manager to criticise a woman's work, because most of them don't take it very well. The same thing isn't true for guys. If a guy doesn't work properly, you don't have to think twice about reprimanding him, but you can't have the same kind of talk with a girl.  So if you're saying that a few men and women worked together as a team on a project - the women are in invited to the success parties, and those who have put in a good effort are truly appreciated. But you do come across those who are believed by other team members to not deserve any appreciation, for the group could have easily done without them too. These things do create a bias in the minds of people who aren't working in any technical field. The first thing that comes to mind is that women aren't good enough technocrats.  Thirdly, and this isn't just the guys talking, even some girls would say that generally if you have a woman working on a computer to say, make receipts, they normally take forever. Either they are very slow, or they are busy talking to someone. And they are rude. So I come to think of such girls as incompetent. ",
            "date": "Answered October 7, 2014",
            "views": "261",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yousuf Farhan",
                    "user_href": "/profile/Yousuf-Farhan-6"
                },
                {
                    "user_id": "Xavier Walski",
                    "user_href": "/profile/Xavier-Walski"
                }
            ]
        }
    ]
}