{
    "title": "How hard is it to maintain a long distance relationship? - The Crush Calculator - Quora",
    "tags": [
        "Dating",
        "Crushes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bella Tina",
                "href": "/profile/Bella-Tina-2"
            },
            "answer_text": "Hello! I myself am in a long distance relationship with someone across the country. We have been for nearly two years now. Things have worked and we are due to be moving in together this summer. I am here to say it is hard, yes. However, it is very possible. First of all, both parties must be extremely compatible, flexible, and put their egos aside. In a long distance relationship, there is no physicality. This means any affection is typically expressed verbally or in other ways such a sending love letters, care packages, compliments, and so forth. For some people, this obligation is too much to handle, as they prefer to be more physical. Most people are this way, therefore you must be willing to make that sacrifice and commit to it. Both people must remain fully interested and invested in one another. Attraction and affection is the key to this. Trust is also extremely important. Without trust, there is little foundation for a relationship. Arguments will happen more often than if you were to face the person eye to eye. There is dress and frustration involved due to separation. This is understandable, natural, and can even be quite healthy. However, one must know how to approach disagreements in a constructive manner. Do you call each other names and play the blame game? You shouldn’t. Do you bring up irrelevant past events or details? That doesn’t help. Do you have an aggressive tone when speaking to the other and curse often? This isn’t the best decision. Remaining calm can be hard in tense times. Arguing with a screen can be even harder. In my relationship, I have learned to put my pride aside and apologize, see the other persons views, compromise. Compromise is very important, because chances are- you won’t always see eye to eye. All in all, communication is what needs to be upheld. It is the make it or break it factor. That is what makes LDRs so hard. People can’t talk things out. And please..DO NOT BE PETTY. Pettiness like blocking them after an argument, ignoring, making the other jealous, which ensure an ugly end to things. Money is clearly a factor that needs to exist. Visits are expensive. A round trip in the United States can cost over $800 without hotel fees. How much can you afford, and how long? How old are you? Can you realistically move out in a reasonable amount of time? That only scratches the surface. However if you remain humble, loving, patient, and generous to your partner- especially during difficult times, you will likely succeed. Share an interest in one another’s hobbies, watch videos together, share secrets, play video games..anything to bond and make sense of one another’s likes and differences. Even polar opposites can make great partners as long as they like different things for the same reasons and are flexible enough. Do you both share common goals? Ex: both want a family, a house together, etc. In the end, it all depends on you and your partner. So how hard is it? Pretty hard. Sometimes you will think of giving up. But if you love the other person, and if a future seems possible. Put your best foot forward. I am living proof that it can work. ",
            "date": "May 11, 2020",
            "views": "827",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fauzia Nr",
                    "user_href": "/profile/Fauzia-Nr"
                },
                {
                    "user_id": "Aiden McKinney",
                    "user_href": "/profile/Aiden-McKinney-6"
                },
                {
                    "user_id": "Purushottam Pyakurel",
                    "user_href": "/profile/Purushottam-Pyakurel"
                },
                {
                    "user_id": "Alex Foster",
                    "user_href": "/profile/Alex-Foster-137"
                },
                {
                    "user_id": "Rachel Pauly",
                    "user_href": "/profile/Rachel-Pauly"
                },
                {
                    "user_id": "Arin King",
                    "user_href": "/profile/Arin-King-1"
                },
                {
                    "user_id": "Sunag R Kamath",
                    "user_href": "/profile/Sunag-R-Kamath"
                },
                {
                    "user_id": "Weston Mitchell",
                    "user_href": "/profile/Weston-Mitchell-11"
                },
                {
                    "user_id": "Anand Pillai",
                    "user_href": "/profile/Anand-Pillai-39"
                },
                {
                    "user_id": "Sarah Parlett",
                    "user_href": "/profile/Sarah-Parlett"
                },
                {
                    "user_id": "Mate Pavić",
                    "user_href": "/profile/Mate-Pavić-2"
                },
                {
                    "user_id": "Luke Sloan",
                    "user_href": "/profile/Luke-Sloan-9"
                },
                {
                    "user_id": "Alyssa Shick",
                    "user_href": "/profile/Alyssa-Shick-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Florentino",
                "href": "/profile/Richard-Florentino"
            },
            "answer_text": "It is hard but all worth it! Love, commitment, understanding, respect, trust and space It’s been months since I had a relationship with my boyfriend. We live so far away from each other. We both know that we are committed to our relationship. Love? Love comes in different ways of showing it. Can be in words, efforts and any others. I am a practical person who values, and appreciates time. I am a person who don’t see where, what or who you are because what matters to me is what I believe I have the love for you. Many friends would ask me. “You’ve been together for so long, why we never seen or heard from you receive gifts from him?” 2 Reasons: I appreciate gifts but I appreciate time, honesty, loyalty, and commitment more;I understand that sometime financial problem arise and he needs it more, and I don’t see problem on it.Gifts, and any other material possessions is not a guarantee of love. Maybe for others but the reality for me and I always tell him every time is: “I don’t care if we start together for nothing. We build ourselves and our future together” If your boyfriend/girlfriend loves you despite of distance. He/she will never give you a reason to go away. Love is unexplainable. *But it’s not all about love that is needed in relationship. Commitment If you both are committed, no matter what happen or storms in your relationship. He/she will stay with you. You just need to weigh things and make it better. Recently me and him had a fight regarding my behavior about forgetting that he’s busy and I tend sometimes to disturb him, and that pisses him off sometimes most especially if it’s serious. We fight but we will talk about it, and sometimes he gives me lessons that I should learn. He says sorry for that to happen but it’s clear to me that he don’t want to make our relationship ruined just by a sudden decision and unresolved issue. So we will talk and tell each other what we want to say and what disappoints us and that makes us set boundaries. Nothing else, healthy arguments (Trust me, it works.) (Sorry big bear, I really never learn to but I am trying. I love you) There’s promises but commitment prevails. If he is not committed probably he/she will ignore and left you in just a simple problem, what more in much more bigger one. Understanding Earlier I said we had a fight, during that conversation or argument we then understand each other that sometimes, I just miss him much, he is exhausted and etc. Even how hard your attitude is, how you’re so annoying, and how you pisses him off at the end of the day he will say “It’s fine” but don’t do it again (learn from it if you don’t want to lose the most understanding creature you meet). I guess because we love, commit, and understand that’s why we easily resolve conflict but as I said make each other better to fix the relationship and grown. Respect Big word that usually we forgot. Read this book: (Love & Respect: The Love She Most Desires; The Respect He Desperately Needs was written in 2004 by Dr. Emerson Eggerichs and first published by Integrity Publishers, Nashville, TN) I admit myself, I lose respect to my boyfriends time. I became irrational and texted him messages when I feel like he ignored me, and is uninterested. But you know actually that are boys nature (Yes, i’m a boy but my heart and feeling is feminine haha). They are silent creatures (not all). You think they didn’t listen but they did. The way their brain and mind works are different. When he read that message he will ask me “What this means” he is calm but I know inside him he’s sad and pissed off coz I didn’t respect him. I know we want our boyfriend/girlfriend to be with us always and always be there every time we need them. But the reality is not all the time, we should be independent. They are part of our life but they are not ours to own. We tend somehow to control them. We talked the last time because he has conditions about how we’ll be able to work this out. I ask him “Does it feel like you’re controlling me?”. Then he told me that I was the one already in control of him cause I want his time all of it. To text me, call me and be with me. I lately realize it when he already told me that. But he says he understand coz he know how I act and show my affection. But I admit to him that he was right. Well, I can say communication really does work the relationship better. Respect is a vice-versa. The more we respect each other the more we love each other. Trust LDR or not. Trust must be there. And it is a very hard one to earn. We must not create conclusion, we must trust them on what they do. It’s normal to be possessive in a relationship but it will ruin everything. Trust me. Space Space means giving your love ones a time on their own, respect if they need time to be with just themselves, friends, family. The person who love you will come back to you. (Note: That’s all. I hope I can post my photo with him. But sadly we can’t this time. I would love too but we can’t. We both avoid conflict this time, soon when everything will be better and we can both stand on our feet. We will.) ",
            "date": "July 29, 2020",
            "views": "1",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fauzia Nr",
                    "user_href": "/profile/Fauzia-Nr"
                },
                {
                    "user_id": "Tanner Raymond",
                    "user_href": "/profile/Tanner-Raymond-5"
                },
                {
                    "user_id": "Steven Elijah Mack",
                    "user_href": "/profile/Steven-Elijah-Mack"
                },
                {
                    "user_id": "Rose Park",
                    "user_href": "/profile/Rose-Park-85"
                },
                {
                    "user_id": "Anas Muhaned",
                    "user_href": "/profile/Anas-Muhaned"
                },
                {
                    "user_id": "Alyssa Shick",
                    "user_href": "/profile/Alyssa-Shick-1"
                },
                {
                    "user_id": "Ruby Anderson",
                    "user_href": "/profile/Ruby-Anderson-64"
                },
                {
                    "user_id": "Mate Pavić",
                    "user_href": "/profile/Mate-Pavić-2"
                },
                {
                    "user_id": "Hayden Paquette",
                    "user_href": "/profile/Hayden-Paquette-2"
                },
                {
                    "user_id": "Aliah Brown",
                    "user_href": "/profile/Aliah-Brown-7"
                },
                {
                    "user_id": "Thor Hull",
                    "user_href": "/profile/Thor-Hull"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sussen Martin",
                "href": "/profile/Sussen-Martin"
            },
            "answer_text": "Many people believe that long distance relationships are never going to work out. Your family may discourage it, and some of your best friends may advise you not to take it too seriously, in case you get your heart broken. Nobody says it is going to be easy — the extra distance makes many things unachievable. Things could get complicated, and you could get sad and lonely at times. However, the extra distance also makes the simplest things the sweetest, being able to hold the other person’s hand, eating together at the same table, feeling each other’s touch, taking a walk together, smelling each other’s hair… these small wishes could suddenly mean so much more in a long distance relationship. Long distance relationships may be tough but they have their own surprises too. To keep your love alive and strong, here are 21 tips to make your long distance relationship work: 1. Avoid excessive communication.  It is unwise to be overly “sticky” and possessive. You two don’t really have to communicate 12 hours a day to keep the relationship going. Many couples think that they need to compensate for the distance by doing more. This is not true. And it might only make things worse. Soon you would get tired of “loving.” Remember: Less is more. It is not about spamming — you are only going to exhaust yourselves. It’s really about teasing at the right moments and tugging at the right spots. 2. See it as an opportunity. “If you want to live together, you first need to learn how to live apart.” – Anonymous View it as a learning journey for the both of you. See it as a test of your love for each other. As the Chinese saying goes, “Real gold is not afraid of the test of fire.” Instead of thinking that this long distance relationship is pulling you two apart, you should believe that through this experience, the both of you will be bound together even stronger. As Emma says it to Will in season four of Glee, “I would rather be here, far from you, but feeling really close, rather than close to you but feeling really far away.” – Emma, Glee Season 4 3. Set some ground rules to manage your expectations.  Both of you need to be clear with what you expect of each other during this long distance relationship. Set some ground rules so that none of you will do things that will take the other party by surprise. For instance, are you two exclusive? Is it alright for the other person to go on dates? What is your commitment level? It’s better to be open with each other about all these things. 4. Try to communicate regularly, and creatively. Greet each other “good morning” and “good night” every day — this is a must. On top of that, try to update your partner on your life and its happenings, however mundane some of the things may seem. To up the game, send each other pictures, audio clips and short videos from time to time. By putting in this kind of effort, you make the other person feel loved and attended to. 5. Talk dirty with each other.  Sexual tension is undoubtedly one of the most important things between couples. Sexual desire is like a glue that keeps both parties from drifting apart. Not only is sex a biological need, it is an emotional one as well. Keep the flames burning by sending each other teasing texts filled with sexual innuendos and provocative descriptions. Sexy puns work pretty well too. ",
            "date": "May 13, 2020",
            "views": "572",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aiden McKinney",
                    "user_href": "/profile/Aiden-McKinney-6"
                },
                {
                    "user_id": "Sagar Ghelani",
                    "user_href": "/profile/Sagar-Ghelani-4"
                },
                {
                    "user_id": "Andrew Aragón",
                    "user_href": "/profile/Andrew-Aragón"
                },
                {
                    "user_id": "Mate Pavić",
                    "user_href": "/profile/Mate-Pavić-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Snehlata Tripathi",
                "href": "/profile/Snehlata-Tripathi-2"
            },
            "answer_text": "It is very tough to maintain long distance relationship! But you cleared that stage then you both will get life time loving and caring partner! Take long distance relationship as your board exam. When you are in your boards, you have to constantly study ! Constantly pay attention on all subjects then only you get good marks followed by entering in good University and then in job! So in long distance relationship as well you have to invest daily. You both have to make time for each other ! If you stop paying attention to each other for a week then it might convert into months eventually you might looose interest in each other. Generally what happens in long distance relationship that we tend to misunderstand each other. Since we are away from each other , even a single line of message ruins the whole day and leads to fight. If we dont resolve the fight then smalls fights gets accumulated and we become insecure and thinks that other side of person doesn't care. I was into long distance relationship for 3 years we used to fight almost daily, but my boyfriend always made sure that we resolve our fight. He gave his 100% to not to create any misunderstanding. So if you guys really love each other, Dont let third person come into a picture , not even your parents or sister or friends . Because they don't a lot of things which only you guys would know. Resolve your issues among yourselves. Keep talking each other, dont sleep without talking to each other. Dont let your fight carry on for next days. And at the end make sure to meet atleast after 2,3 months. Feeel each others touch. If you don't meet kn long distance relationship , you might forget how one looks , how many moles are there in his /her face, how he or she smiles. Everything matters! Each detail matters 😉! Keep talking! Keep loving! Keep showing love and respect! Have faith ! And keep meeting once in a while! Thanks ",
            "date": "May 12, 2020",
            "views": "682",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Purushottam Pyakurel",
                    "user_href": "/profile/Purushottam-Pyakurel"
                },
                {
                    "user_id": "Evangeline May",
                    "user_href": "/profile/Evangeline-May-2"
                },
                {
                    "user_id": "Brooke Nicole",
                    "user_href": "/profile/Brooke-Nicole-133"
                },
                {
                    "user_id": "Austin Morris",
                    "user_href": "/profile/Austin-Morris-149"
                },
                {
                    "user_id": "Blade Parker",
                    "user_href": "/profile/Blade-Parker-4"
                },
                {
                    "user_id": "Stuti Dash",
                    "user_href": "/profile/Stuti-Dash-1"
                },
                {
                    "user_id": "Mate Pavić",
                    "user_href": "/profile/Mate-Pavić-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reese Gully",
                "href": "/profile/Reese-Gully"
            },
            "answer_text": "Yes it’s hard but only for the right person .. it all be worth it .. you know . If there’s no one in the world I rather be with but him or her .. then the level of difficulty is irrelevant. And when you do get together ., it be out of this world . Long distance relationships are not for the faint hearted .. but it definitely can work ",
            "date": "May 13, 2020",
            "views": "597",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael J Rhodes",
                    "user_href": "/profile/Michael-J-Rhodes"
                },
                {
                    "user_id": "Sarah Parlett",
                    "user_href": "/profile/Sarah-Parlett"
                },
                {
                    "user_id": "Ethan Wing",
                    "user_href": "/profile/Ethan-Wing-3"
                },
                {
                    "user_id": "Sarah Yue",
                    "user_href": "/profile/Sarah-Yue-4"
                },
                {
                    "user_id": "Savannah Burg",
                    "user_href": "/profile/Savannah-Burg"
                },
                {
                    "user_id": "Mate Pavić",
                    "user_href": "/profile/Mate-Pavić-2"
                },
                {
                    "user_id": "Andrew Aragón",
                    "user_href": "/profile/Andrew-Aragón"
                }
            ]
        }
    ]
}