{
    "title": "How fast can a spacecraft reach Mars with the current technologies? - Quora",
    "tags": [
        "Manned Spacecraft",
        "Space Travel to Mars",
        "Spacecraft",
        "Mars (planet)",
        "Space Travel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gene Spafford",
                "href": "/profile/Gene-Spafford"
            },
            "answer_text": "There are several carefully thought out answers by others to this question, but they are basically answering a slightly different question. The actual answer to your question is that you could probably get there in a matter of weeks using the most powerful rocket engines we have, and perhaps adding a gravity \"slingshot\" and a solar sail. However, you would either sail right by and keep going, or you would smash into the surface with a great deal of force.  In either case, you would not return to Earth.  But you didn't ask about that. The issue is not speed, per se, if we are about surviving and returning.  We need to decelerate to orbit or land approximately as much as we accelerate to get there, or else one of the two scenarios above occurs.  We also need fuel for landing, for maneuvering, etc.   That fuel has mass, and we need to change the velocity of that mass even as we use some of it, along with the mass of our ship, our food, our water, our shielding, and ourselves.  (Shielding?  Yes, outside the Earth's magnetic fields we would need to worry about all sorts of radiation that we normally don't see in near orbit or on the surface.)   To get a greater velocity means getting more acceleration…and deceleration. That generally means a bigger engine.  And more fuel for the engine…which has mass, as does its means of storage.  If we are starting from the surface of Earth, we have to lift all of that off the surface and reach escape velocity or else we meet an unfortunate end in the Earth's unrelenting embrace.   That's  lot of power, a lot of fuel, and a lot of mass. Physics imposes some limits that we don't know how to get around.  Yet.  Thus, the answers that suggest longer, slower trips that require less fuel and smaller engines. ",
            "date": "Answered October 12, 2015",
            "views": "18",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samrat Dutta",
                    "user_href": "/profile/Samrat-Dutta-107"
                },
                {
                    "user_id": "Mages Waren",
                    "user_href": "/profile/Mages-Waren-1"
                },
                {
                    "user_id": "Brendon Flanegam",
                    "user_href": "/profile/Brendon-Flanegam-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/G-A-72"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Chester Cai",
                    "user_href": "/profile/Chester-Cai"
                },
                {
                    "user_id": "Cameron Dudley",
                    "user_href": "/profile/Cameron-Dudley"
                },
                {
                    "user_id": "Ben Co",
                    "user_href": "/profile/Ben-Co-2"
                },
                {
                    "user_id": "Matt Elsen",
                    "user_href": "/profile/Matt-Elsen-1"
                },
                {
                    "user_id": "Daniel Hu",
                    "user_href": "/profile/Daniel-Hu-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Singer",
                "href": "/profile/Bob-Singer-2"
            },
            "answer_text": "The total journey time from Earth to Mars takes between 150-300 days  depending on the speed of the launch, the alignment of Earth and Mars,  and the length of the journey the spacecraft takes to reach its target.  It really just depends on how much fuel you’re willing to burn to get  there. More fuel, shorter travel time. Mariner 4’s total flight time was 228 days. The successful Mariner 7 only required 131 days to make the journey. Mariner 9, the first spacecraft to successfully go into orbit around Mars launched on May 30, 1971, and arrived November 13, 1971 for a duration of 167 days. This is the same pattern that has held up for more almost 50 years of Mars exploration: approximately 150-300 days. Even more examples:     Viking 1 (1976) – 335 days    Viking 2 (1976) – 360 days    Mars Reconnaissance Orbiter (2006) – 210 days.    Phoenix Lander (2008) – 295 days    Curiosity Lander (2012) – 253 days.    How Long Does it Take to Get to Mars? ",
            "date": "Answered October 13, 2015",
            "views": "957",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mages Waren",
                    "user_href": "/profile/Mages-Waren-1"
                },
                {
                    "user_id": "Samuel Odiba Otache",
                    "user_href": "/profile/Samuel-Odiba-Otache"
                },
                {
                    "user_id": "John Branch",
                    "user_href": "/profile/John-Branch-3"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                },
                {
                    "user_id": "John Kes",
                    "user_href": "/profile/John-Kes"
                },
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                },
                {
                    "user_id": "Brian Blood",
                    "user_href": "/profile/Brian-Blood-3"
                },
                {
                    "user_id": "Mohammad Husain",
                    "user_href": "/profile/Mohammad-Husain"
                }
            ]
        }
    ]
}