{
    "title": "How and why does RNA self replicate? - Quora",
    "tags": [
        "Self Replication",
        "RNA",
        "Molecular Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Oz Ayd",
                "href": "/profile/Oz-Ayd"
            },
            "answer_text": "While RNA does not replicate, per se, RNA viruses have a way of replicating themselves, including their genetic material which happens to be RNA. They infect the host cell and using host cell’s reverse transcriptase enzyme (which creates DNA from RNA as opposed to RNA polymerases that create RNA from DNA) generates a DNA copy (complementary or cDNA) of its genetic material. This DNA may or may not be integrated into host genome for an indeterminate time. When the time is right, the RNA is re-generated from the cDNA and new copies of the RNA virus is created using this genetic material. In this process the RNA is replicated, but it can hardly be called self replication. ",
            "date": "Answered October 5, 2018",
            "views": "364",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mircea-Dan Mitroiu",
                    "user_href": "/profile/Mircea-Dan-Mitroiu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gayatri Tripathi",
                "href": "/profile/Gayatri-Tripathi"
            },
            "answer_text": "In organisms where DNA is the genetic material, DNA replicates and transcribes to produce RNA which then make protein to achieve cellular functions. RNA never replicates in these organisms. If a particular protein is needed in larger amounts then corresponding RNA is formed in larger amounts by the virtue of a strong promoter. There is no RNA replication. But in case of organisms like viruses which have RNA as their genetic material, so in these organisms there are RNA polymerases which are involved in the genome replication. Hope it is clear. ",
            "date": "Answered February 16, 2018",
            "views": "1",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Utku Perktas",
                    "user_href": "/profile/Utku-Perktas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Saladin",
                "href": "/profile/Ken-Saladin"
            },
            "answer_text": "It doesn’t. It is produced by enzymes that follow the instructions in DNA. The original self-replicating polymer was probably more RNA- than DNA-like, but RNA as it exists today is never self-replicating. ",
            "date": "Answered June 11, 2017",
            "views": "295",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nobaudie Uno",
                    "user_href": "/profile/Nobaudie-Uno"
                },
                {
                    "user_id": "Thomas Knowles",
                    "user_href": "/profile/Thomas-Knowles-6"
                },
                {
                    "user_id": "Stephen Reed",
                    "user_href": "/profile/Stephen-Reed-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mariam Ezz El-Arab",
                "href": "/profile/Mariam-Ezz-El-Arab"
            },
            "answer_text": "RNA never replicates. But it keeps transcriping from DNA each time. For example if a specific protein is needed by large amount, RNA do not go through replication but it transcripe the same gene (on DNA) several times. ",
            "date": "Updated June 15, 2017",
            "views": "479",
            "upvotes": "0"
        }
    ]
}