{
    "title": "How many years behind, technology wise are Apple compared to companies like Samsung when it comes to the hardware in their phones? - Quora",
    "tags": [
        "Samsung Mobile",
        "Apple (company)",
        "Apple Products and Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Vogel",
                "href": "/profile/Michael-Vogel-5"
            },
            "answer_text": "The only technology that it seems that Samsung had a leg up on Apple over was display technology, most notably with OLEDs. The problem was there was a limited supply and either Apple could not use them or they could put them in limited devices. So they waited until there were more available. Samsung’s displays still tend to be a bit better. The other one that people waffle over is the camera. Samsung’s cameras have gotten really good; no doubt about it. Still, when you have two excellent cameras, one being better becomes a quibble. Really it’s hard for me to see any hardware that Samsung is ahead of Apple in. They might be able to put the fingerprint sensor behind the screen but it won’t work as well that way and we all know it. Same with a front-facing camera. No way you’d be able to get the Face ID sensors behind the screen and still have them be remotely as effective. So I’d say Apple isn’t behind at all. When it comes to the opposite though, Samsung is 2–3 years behind Apple in SoC, with the A-series chips being so far ahead it’s almost laughable. When you see current Samsung flagships barely beating out 2016’s iPhone 7, you know you’re in trouble. The other one where Samsung is at least 2 years behind is Face ID. It came out in 2017 and if we’re really lucky, we’ll see a competitor that matches Apple in 2017 in 2019, but I imagine it will be 2020 before we see one that is as good. Honestly, from a hardware perspective, I just can’t see it. ",
            "date": "Answered December 3, 2018",
            "views": "85",
            "upvotes": " View 73 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Luca Accomazzi",
                    "user_href": "/profile/Luca-Accomazzi"
                },
                {
                    "user_id": "Jim Dovey",
                    "user_href": "/profile/Jim-Dovey"
                },
                {
                    "user_id": "Sean Jackson",
                    "user_href": "/profile/Sean-Jackson-140"
                },
                {
                    "user_id": "Tamil Kazhian",
                    "user_href": "/profile/Tamil-Kazhian-1"
                },
                {
                    "user_id": "John Cao",
                    "user_href": "/profile/John-Cao-43"
                },
                {
                    "user_id": "Sergio Bendeck Paranky",
                    "user_href": "/profile/Sergio-Bendeck-Paranky"
                },
                {
                    "user_id": "Yash Tamakuwala",
                    "user_href": "/profile/Yash-Tamakuwala-2"
                },
                {
                    "user_id": "Pranav",
                    "user_href": "/profile/Pranav-723"
                },
                {
                    "user_id": "Sarul Sakulthong",
                    "user_href": "/profile/Sarul-Sakulthong-1"
                },
                {
                    "user_id": "Manisha Singh",
                    "user_href": "/profile/Manisha-Singh-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Belkin",
                "href": "/profile/Joe-Belkin"
            },
            "answer_text": "It depends on how you define it. Apple designs its own chips but does not manufacturer them. Samsung used to manufacture them for Apple but now TSMC does. Samsung makes screens and sells some to Apple but the glass was designed & made by Corning (a US company). Samsung does design nor make their own chips, they use Qualcomm chips - they also use Qualcomm’s modem chips. Apple also design their own OS and battery (battery made by others) so basically Apple designs the major components of an iPhone and finds manufacturers to make their own designs only to used on their phones. Samsung, other than the screen itself uses off the shelf parts including the microprocessor chip designed by others. Basically, Apple is the innovator, Samsung’s strength as a company has always been its ease in building plants to copy others and gain market share through distribution. They operate totally differently. ",
            "date": "Answered June 7, 2019",
            "views": "428",
            "upvotes": " Answer requested by David Waring"
        }
    ]
}