{
    "title": "How did you imagine 2020 would be like ten years ago? - Quora",
    "tags": [
        "2020s",
        "Imagination",
        "Future Scenarios",
        "2020 (year)",
        "Hypothetical Scenarios",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Todd Mills",
                "href": "/profile/Todd-Mills-7"
            },
            "answer_text": "When the 21st century arrived, I thought something big was about to happen. What invention would be as world-changing as the airplane, the car, the telephone, the electric light? Would this new century be as exciting as the Age of Exploration? What would we call ourselves? Well, twenty years later (not ten) we know. This is the Information Age. We’ve become masters of facts. Facts come faster than our brains can process. We have instant knowledge of people, places, and events. Social media means we can be in touch with our friends and keep tabs on the friends of our friends. We don’t have to imagine what someone is doing, we can spy on them like the witch in Snow White. it’s all fun, but not what I had in mind. What, then? invisibility, three-day flights to Mars; a helmet that makes us smarter whenever we want to be; houses that grow new rooms.; a machine that creates bridges and yachts; a loyal robot compassion, virtual realty that you believe is real; AI to solve problems too hard for humans. Maybe all in the NEXT ten years! ",
            "date": "Updated December 2, 2019",
            "views": "252",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muhammad Ilham Afdillah",
                    "user_href": "/profile/Muhammad-Ilham-Afdillah"
                },
                {
                    "user_id": "Lillie Jones",
                    "user_href": "/profile/Lillie-Jones-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vicki Wootton",
                "href": "/profile/Vicki-Wootton"
            },
            "answer_text": "I can’t say what I imagined because I didn’t think about it much. I didn’t think I would live this long. What I would never have dreamed of in my worst nightmares was the awful mess the world is in now. We are killing the world. Those much younger than I may not survive to be as old as I am now. ",
            "date": "Answered November 23, 2019",
            "views": "100",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Muhammad Ilham Afdillah",
                    "user_href": "/profile/Muhammad-Ilham-Afdillah"
                }
            ]
        }
    ]
}