{
    "title": "How to approach companies to sell my products - Quora",
    "tags": [
        "Sales",
        "Marketing",
        "Companies",
        "E-Commerce"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebecca Maalouf",
                "href": "/profile/Rebecca-Maalouf"
            },
            "answer_text": "As the owner of a small, successful boutique for over 13 years, I have worked with quite a few artisan vendors. I usually seek them out as they are hard to find, yet I see the challenge in your question. I’ll answer your 2nd questions 1st: Would age be a detriment? No. And I don’t know if you are 13, or 83 years old. The worst thing a vendor (a person or company that a store buys product or services from) could be is: Boring. The worst thing a vendor could offer is : A common product. Hand made wooden watches are not boring, nor are they common. You are 90% there. The other 90% is being discovered. Yes, we are going for 180%! Which brings me to your 1st question, now I know why I had trouble with it. You will not have to convince anyone of anything. You will have to: Create a very cool product. Check!Have at least 2 social media sites, with beautiful photos and your story.Take pictures of your watches, then edit them. I took my own product photo’s for years, and edited with a free online program called Gimp. It took a while on my crappy laptop, but so worth it. Your goal with this program is to remove glare and flashback, and create crisp white backgrounds for your product. I took my photo’s with an iPhone!Now you’re ready. Send an email to the owner. Introduce yourself. Link to your social media sites with great photo’s. Don’t try to be slick, your story is your currency and it has to be authentic. Ask for a meeting to see if your watches are a good fit for their store. Say you will be in the area for one week, and give dates. Allow for a 2nd meeting date if they can’t do your week without apology or explanation, we get it.When you get your meeting, thank them, show them your products, and answer their questions. Take careful notice of the questions, and consider well your answers for future store buyer meetings. Your wholesale price should be no more than 50% of the suggested retail price, by the way. Don’t even think about consignment, that’s for chumps.Be confident in your product. We need you as much as you need us. I promise. Bonus: How to get the emails: Call the store or stop by. Tell the person who answers the phone/greets you that you are a local artist, and say you create an artisan product and would like to know the best way to reach the buyer for consideration. Specifically ask if it would be OK to email them, and ask for the email. ",
            "date": "Answered April 3, 2017",
            "views": "948",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yogesh Khatri",
                    "user_href": "/profile/Yogesh-Khatri-1"
                },
                {
                    "user_id": "Ricardo Pereira",
                    "user_href": "/profile/Ricardo-Pereira-121"
                },
                {
                    "user_id": "Rahul Bhowmik",
                    "user_href": "/profile/Rahul-Bhowmik"
                }
            ]
        }
    ]
}