{
    "title": "How long will it take for 5G to cover the whole United States? - Quora",
    "tags": [
        "Wireless Communication",
        "5G (wireless communication)",
        "Telecommunications",
        "Wireless Technology",
        "Cellular Service Providers",
        "Wi-Fi",
        "The Internet",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Maria",
                "href": "/profile/John-Maria-3"
            },
            "answer_text": "If the time it took to roll out 4G, to get to the current level of coverage, is a good indicator, then expect it to take 7–8 years. 3G deployments started in 2004 and there are still areas where there is weak or no coverage. The challenges with 5G include the requirement for exponentially more radios in the radio access network to provide the same coverage as the current radios that operate at 2.6GHz or less. In rural areas operators use “boomer” radios that are placed up high, tend to use the lower frequency bands which travel further and higher power. Boomers do not typically have a lot of concurrent subscribers using them, so the operators typically use lower bandwidth backhaul connections to the tower. 5G can use lower bands, however multiple bands would need to be interleaved to provide a high bandwidth user experience. The other 5G challenge will be where the operators can place the radios. Municipalities and utility companies are already balking at providing space on poles and buildings to 5G operators that might need 12 radios per square mile, to provide full high bandwidth coverage. ",
            "date": "Answered April 9, 2019",
            "views": "553",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Blake Nelson",
                    "user_href": "/profile/Blake-Nelson-74"
                },
                {
                    "user_id": "Jean Laurent",
                    "user_href": "/profile/Jean-Laurent-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Allen",
                "href": "/profile/Mark-Allen-15"
            },
            "answer_text": "That will never happen, nor should it. Look at Verizon Wireless’ 4G LTE coverage map below. The Rockies and much of Alaska have no coverage.  There’s a simple reason for that. Nobody lives there. So the mobile network operators are not attempting to achieve the sort of spectral density necessary so that 5G NR signals propagate indoors or even outdoors in every square inch of the US, although 5G NR base stations’ ability to make use of low-band spectrum at 600 MHz will greatly improve indoor reception in urban and suburban areas. So you could instead ask, “How long will it take for 5G to cover the vast majority of urban and suburban areas in the contiguous 48 states and District of Columbia?”  ",
            "date": "Answered April 9, 2019",
            "views": "298",
            "upvotes": " View 68 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kritika Chauhan",
                    "user_href": "/profile/Kritika-Chauhan-76"
                },
                {
                    "user_id": "Jose L. Rodriguez",
                    "user_href": "/profile/Jose-L-Rodriguez-1"
                },
                {
                    "user_id": "Michael St. Marie",
                    "user_href": "/profile/Michael-St-Marie"
                },
                {
                    "user_id": "Allon Kirtchik",
                    "user_href": "/profile/Allon-Kirtchik-1"
                },
                {
                    "user_id": "Cole Southard",
                    "user_href": "/profile/Cole-Southard"
                },
                {
                    "user_id": "Dany Nafatyuk",
                    "user_href": "/profile/Dany-Nafatyuk-1"
                },
                {
                    "user_id": "Michael Odom Jr",
                    "user_href": "/profile/Michael-Odom-Jr"
                },
                {
                    "user_id": "Dhruv Bhatt",
                    "user_href": "/profile/Dhruv-Bhatt-45"
                },
                {
                    "user_id": "Angel Braam",
                    "user_href": "/profile/Angel-Braam"
                },
                {
                    "user_id": "Steve McMillan",
                    "user_href": "/profile/Steve-McMillan-19"
                }
            ]
        }
    ]
}