{
    "title": "How to sell without bill products? See details. - Quora",
    "tags": [
        "E-Commerce Sales",
        "Sales",
        "E-Commerce"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Rai",
                "href": "/profile/Abhishek-Rai-2"
            },
            "answer_text": "hello anonymous ! I hope you are in this game for a long stint. The e-commerce story has long before pivoted from an inventory problem to a customer problem. If you are selling goods which are not procured via valid invoice, essentially it's a forgery and cheating. Customers are going to find out (even before they make a transaction on your site). This would not hold you good and will not take you far. I would suggest, kindly reconsider your model and go via legal way. This is the only way to build long term business. cheersabhishek ",
            "date": "Answered April 4, 2016",
            "views": "4",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rahul Ratan",
                    "user_href": "/profile/Rahul-Ratan-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jatin Bhutani",
                "href": "/profile/Jatin-Bhutani-6"
            },
            "answer_text": "There is absolutely no problem on that.You can sell in your private label. And you dont need to register it.. Unless you feel its need.About the tax ,you can submit your tax saying that you bauught from from an unregister manufacturer or something like this. Total taxable amount= total sale- total bill you hav You dont have the bill you have to pay tax for the whole selling price.. And if you have, you need to only pay tax only on difference.Hope it helped.Peace\\U0001f60a ",
            "date": "Answered April 10, 2016",
            "views": "33",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rohan Sharma",
                    "user_href": "/profile/Rohan-Sharma-732"
                },
                {
                    "user_id": "Mánísh Gangwani",
                    "user_href": "/profile/Mánísh-Gangwani"
                },
                {
                    "user_id": "Prince Dattani",
                    "user_href": "/profile/Prince-Dattani"
                },
                {
                    "user_id": "Chetan Chandrakant Pragati Durgavale",
                    "user_href": "/profile/Chetan-Chandrakant-Pragati-Durgavale"
                }
            ]
        }
    ]
}