{
    "title": "How did culture influence the arts? - Quora",
    "tags": [
        "Influence",
        "The Arts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Juan Pablo Forero",
                "href": "/profile/Juan-Pablo-Forero"
            },
            "answer_text": "Arts are part of culture. Culture is everything we do as humans, the good and the bad things. But think about this. Only if you were an hermitage, you wouldn't be influenced by culture. Any aspect of your live is determined by the culture you live on. And now with the internet, this influence has grown at levels we are feeling right now with the work of many artists. But your culture will always be the one that will influence you the most. See any work of any artist and you will see what things interested them, for example, if they do figurative work, how they dress people? How they show a street? What objects do they show? What critics do they do if any? So culture is around us and we cannot escape from it, anything we do is a reflection of our culture because that's we have learnt about life. ",
            "date": "Answered January 20, 2016",
            "views": "56",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jane Togochakova",
                    "user_href": "/profile/Jane-Togochakova"
                },
                {
                    "user_id": "Larry John Page",
                    "user_href": "/profile/Larry-John-Page"
                },
                {
                    "user_id": "Marife Hegakit",
                    "user_href": "/profile/Marife-Hegakit"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joy Selak",
                "href": "/profile/Joy-Selak"
            },
            "answer_text": "Perhaps the question might be reversed to ask, how do the arts influence culture? In my experience, especially in film and theater, this is a space where difficult cultural issues can be addressed directly, effectively and safely. Whether it is race, the criminal justice system, prejudice against minorities or bullying, you can find a film or a play to raise awareness and open the mind of the viewer to new ways of looking at the issue. ",
            "date": "Answered December 22, 2017",
            "views": "21",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jane Togochakova",
                    "user_href": "/profile/Jane-Togochakova"
                },
                {
                    "user_id": "Precious Aboga",
                    "user_href": "/profile/Precious-Aboga"
                },
                {
                    "user_id": "Larry John Page",
                    "user_href": "/profile/Larry-John-Page"
                }
            ]
        }
    ]
}