{
    "title": "How are art and new technology connected? - Quora",
    "tags": [
        "New Technologies",
        "The Arts",
        "Fine Art",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Doug Garnett",
                "href": "/profile/Doug-Garnett"
            },
            "answer_text": "For the most part, it’s not. But there are three things I’ve seen: There are superb tech tools that are tremendous assistance creating select types of art (Photoshop, Illustrator). These are far more useful in the commercial arts than in fine art. Graphic design, game design, editing software, etc…Technology can sometimes reduce the hassle (busywork) surrounding art - duplicating work, sending out/receiving submissions, etc…There are a narrow group of entire art forms based on technology like new media formats. These have been around for a very long time and evolve as technology evolves. It’s also rare that I find them to be compelling art.That said, I’ve also seen serious harm done to art by technology. We create TV commercials. I only work with hand drawn storyboards (coloring and tweaking in photoshop is fine). The ability to express the emotions and capture the idea is far, far better than with boards done in tech tools. However, too many young storyboard artists believe that online tools are just fine. That’s sad and it makes for lesser finished work.When art is duplicated online (or in books), bad art can look good and good art can look bad. Truth is, only certain types of art carry well online. Unfortunately, I generally find it’s gimmick art which lacks the depth and complexity of really great art.As an example, consider Chuck Close. My wife and I had ignored him for years - because duplicated in a book his work looks like somebody just digitized a face on canvas. Yuck.Then we saw a tremendous show of his work in person. The incredible depth and passion present in his paint, his strokes, and the complexity of the physical work completely changed our minds about his work.But without seeing it in person, we had written him off as uninteresting.The duplication problem, in the era of social media hype, can help bad and mediocre artists out-perform the great artists.",
            "date": "Answered January 3, 2017",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arnold Limatoc",
                "href": "/profile/Arnold-Limatoc"
            },
            "answer_text": "How are art and new technology connected? Coming from an inventors perspective, art and new (innovative) technology are closely related. The invention of innovative technology, is the “ultimate expression” of art. Innovative technology is art that functions and serves a purpose (machine). Art is seeing a concept car model that is made of clay (non functional), invention is seeing the fully functioning production version. ",
            "date": "Answered September 30, 2018",
            "views": "310",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jacqueline O'Neill",
                "href": "/profile/Jacqueline-ONeill-14"
            },
            "answer_text": " Forgeries have long been an inescapable problem in the art world. By some estimates, roughly half of the artwork circulating on the international market is fake. The problem is that the current methods of authentication leave plenty of gaps in the system. Works of art disappear and then mysteriously reappear on the market. Talented forgers pass off fakes as the real thing. And collectors are left wondering whether the expensive works of art they buy are actually worth the hefty price tag. There is a solution for truly authenticating artwork and closing the gaps in the system—blockchain. Here’s how it’s to make an impact in the art world: The way we authenticate today is not effective. Authentication of art is prohibitively expensive for most people. You could easily spend $2,000 to have one piece authenticated. And that process has turned the business into something of a clubhouse for the wealthy. You have to belong to a certain group of people if you want them to take you, and your potentially valuable work of art, seriously. They simply won’t trust that a random person they’ve never heard of is in possession of a Modigliani—one of the most forged artists in history. Even if you do break into the club and spend the money to have your piece authenticated, what then? If your piece is original, how is that proven? Generally, with a physical certificate that declares your piece is real. Unfortunately, a piece of paper saying your artwork is authentic doesn’t really mean much. It can be lost, stolen, destroyed. And once it’s been separated from the artwork, it becomes meaningless. And those physical pieces of paper may not be as authentic as you think. Just look at the story of Eric Ian Hornak Spoutz, an art dealer who also specialized in forging certificates of authenticity. He defrauded art collectors of $1.45 million before he was caught. People have attempted to solve the problem—but something’s missing. There are currently a number of companies working to solve this issue. But most of them are missing the physical-digital link. A one-to-one link between the physical asset and its identity on blockchain is essential to securely authenticating artwork. That’s because a digital identify floating around online doesn’t provide the same type of security. It doesn’t give real-time information about transactions or location. Without a one-to-one link, there are holes in the system for people to insert forgeries or change the data. Even if a work or art is registered online, that doesn't stop someone from swapping it out with a fake and passing it off as the real deal. The only way to provide truly secure authentication that stands the test of time is with a one-to-one link that ties a physical work of art to a digital record. And the technology company Chronicled has developed a tamper-proof Cryptoseal that affixes to the artwork, creating a one-to-one link between the physical object and its digital identity on blockchain. As technology advances, there will be even more options to link a physical work to the digital world beyond tamper-proof seals. Today, these include the sophisticated peptide mass fingerprinting (PMF), embedded synthetic DNA, and machine technology that can recognize individual brushstrokes. Registering assets on blockchain provides an immutable link to the artwork. For now, the Cryptoseal is the missing link between the physical art and its digital record. Easily applied to artworks, it requires no battery and remains affixed to the artwork indefinitely. Trying to remove it would be akin to removing an artist’s signature. I’ve had people ask me, “Well, how do we know this system is going to be around in 20 years?” It’s a good question, but you have to understand that blockchain is here to stay. People have already registered so much data to it that we’ve moved past the point of no return. It’s anticipated that the transaction volume will eventually surpass that of the Visa network. If someone comes into possession of an artwork with a Cryptoseal in 20 years, that person will still be able to verify it on a website backed by Chronicled’s infrastructure. Blockchain isn’t going anywhere. And neither are the seals that verify the artwork. We still need experts and auction houses. This system is just offering support. There are two possible approaches to implementing this blockchain solution. One is a grassroots, bottom-up approach beginning with artists and smaller galleries. The other is a top-down approach that starts with the institutions of the art world. Truthfully, we need a mix of these two approaches. A blockchain-based system for authenticating artwork is not meant to replace existing structures in the art world. We still need someone to authenticate the works before we can put a seal on them. There will always be a place for the people who have built reputations and honed their ability to tell a forgery from a genuine artwork. Those skills are incredibly valuable. This technology isn’t intended to disrupt the art world—it’s meant to work alongside it. At Ethereum Art Collective, we’ve already begun conversations with art fairs, galleries, and auction houses about blockchain. And we’ve been pleased with the responses. People understand that there are major problems with the current process for authentication, and they’re willing to work with new technologies to find a solution. Ultimately, this is going to help the art world as a whole—artists, collectors, and buyers—and hopefully take a bite out of the market for forgeries. ",
            "date": "Answered April 30, 2018",
            "views": "721",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carylann Loeppky",
                    "user_href": "/profile/Carylann-Loeppky"
                }
            ]
        }
    ]
}