{
    "title": "How is Japan ahead of the United States in technology? - Quora",
    "tags": [
        "Japan–United States Relations",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lon Johnson",
                "href": "/profile/Lon-Johnson-4"
            },
            "answer_text": "The US is a third word country compared to Japan when it comes to technology, compare the Tokyo metro to NY subway!, everyone is connected to the internet 24/7, compare the JR system to Chicago rapid transit (basically a pile of rusted junk I’m ashamed to say), their cars are still far better built and last a lot longer than the crap turned out by Detroit, superior robotics, higher grade of silicon chips, the list goes on….. Quoting a famous american physicist: “If you think back to the early years after World War II, America was the dominant player almost right across the board in advanced industries. Now there is hardly an industry left where that can be said. Meanwhile Japan has continued to gain dominance in dozens of advanced industries.” ",
            "date": "Answered August 12, 2017",
            "views": "48",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Rodriguez",
                    "user_href": "/profile/Anthony-Rodriguez-894"
                },
                {
                    "user_id": "Gabriella Satiadarma",
                    "user_href": "/profile/Gabriella-Satiadarma"
                },
                {
                    "user_id": "Sourav Pal",
                    "user_href": "/profile/Sourav-Pal-119"
                },
                {
                    "user_id": "Mohd Abbas Zaidi",
                    "user_href": "/profile/Mohd-Abbas-Zaidi-3"
                },
                {
                    "user_id": "ZOHO",
                    "user_href": "/profile/ZOHO-9"
                },
                {
                    "user_id": "Wayne Knapp",
                    "user_href": "/profile/Wayne-Knapp-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Farnsworth",
                "href": "/profile/David-Farnsworth-18"
            },
            "answer_text": "In some areas, Japan’s technology already DOES surpass America’s. Some examples off the top of my head. Earthquake prediction. Neutrino detection (the setup at Kamiokande is REALLY cool). Hybrid cars. Road tunnel technology (who else can build a tunnel that is twice as far as the Channel Tunnel, under a deeper strait AND in a severe earthquake zone?). Ultra-fast trains. Etc. ",
            "date": "Answered May 17, 2019",
            "views": "418",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hiroyuki Kitagawa",
                    "user_href": "/profile/Hiroyuki-Kitagawa-2"
                }
            ]
        }
    ]
}