{
    "title": "How can we distinguish the art industry from the entertainment industry? - Quora",
    "tags": [
        "The Arts",
        "Fine Art"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siddharth Bhat",
                "href": "/profile/Siddharth-Bhat-1"
            },
            "answer_text": "We can't. No matter how many differences we enumerate, ultimately they're complementary to each other, aspects of the art form. Any art form, by various interactions between art and entertainment, form and content, becomes an art piece. Whether the art piece can be categorised as art or entertainment is decided mostly by the perceived purpose of the piece, not anything inherent in it. It's subjective. Still, it is possible to have some guiding factors that may inform popular understanding of the distinction between them. The most important factor, like I said, is probably the purpose. Entertainment quite simply, is intended to entertain. Entertainment may also be a baser acknowledgement of artistic styles or a parody of them. There is an element of entertainment to satire too, even though a lot of it is also quite artful (think Kubrick's Dr. Strangelove). The purpose of art, on the other hand, is more difficult to pin down because it is broad and varied. Three important purposes that come to mind are commentaries and opinions on the realities of life, depiction of the realities of life and commentary on art itself, i.e., an attempt to push its boundaries. A very important aspect that results in a lot of overlap between art and entertainment is the distinction between form and content. The average drama today has little to no directorial style or vision. It's quite straightforward recording. Not art. However, the content may include topics on various sociocultural issues, which falls in the domain of arts. On the other hand, sometimes, movies are made purely for entertainment but are incredibly artfully directed. There is art in form here but not content. Films of this kind often become classics. This is why films like Gangs of Wasseypur and Pulp Fiction are cult favourites. The ones like 2001: A Space Odyssey and Eraserhead are purely art films while a lot of mainstream films are purely entertainment films. Finally, I'd like to clear a popular misconception among art snobs. This is something they use to lure people into art territory. They say art is or can be entertaining. No sir, that is simply not what it is meant for. It is a reflection of life and is meant for reflection on life. Everything else is secondary, though not necessarily non-existent. However, entertainment can surely be artistic because a major component of artistry is aesthetics, which doesn't really have that much to do with art as a reflection of life. This is what makes Gangs of Wasseypur and Pulp Fiction entertainment films, not art films. ",
            "date": "Answered March 15, 2018",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Risna Alfianingrum",
                    "user_href": "/profile/Risna-Alfianingrum"
                },
                {
                    "user_id": "Shivaprasad P",
                    "user_href": "/profile/Shivaprasad-P"
                },
                {
                    "user_id": "Shree Lakshmi",
                    "user_href": "/profile/Shree-Lakshmi-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santhosh Soundararajan",
                "href": "/profile/Santhosh-Soundararajan"
            },
            "answer_text": "Audience: Art industries as we call them have a limited audience, they are not favored like the entertainment industry which has an audience base cutting across ages and countries.. For Example: Flamenco is an art form of Spain, but there are not much fan following for the original classic in Spain itself, but Big Bang Theory is crazily watched all over the globe. Artists: Many art forms have unique attributes to themselves, they have intricate rules to be followed and practitioners have to undergo rigorous, mind numbing training which at times takes many years to master it. For example the Sitar artiste Anoushka Shankar is reported to have trained from age 7 whereas Jayanthi Kumaresh of Veena has a total training of around 25 years. It is one of the reasons why there is less people with expertise in such fields compared to entertainment industry which is diverse with many players. Conservation: Many art forms of the past have become extinct and one of the main reasons is that they lack financial viability unlike entertainment. So there is an imminent need for Governments and civil society to conserve them which is not necessitated in entertainment. ",
            "date": "Answered July 10, 2016",
            "views": "283",
            "upvotes": " Answer requested by Kashmira Brahmane",
            "upvoters": [
                {
                    "user_id": "Valeria Mesalina",
                    "user_href": "/profile/Valeria-Mesalina"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cyrilla Baer",
                "href": "/profile/Cyrilla-Baer"
            },
            "answer_text": "There is a huge amount of overlap, and one man’s Art is often another man’s entertainment! But I think there are a couple of factors that could make one lean toward ‘This piece is Art”: It makes you think. It isn’t obvious or easy - to get something out of it one needs to engage one’s intellect or emotions.It isn’t “feel good”. It may make one uncomfortable to watch, listen, or look. It’s trying to get at a deeper part of us, or get us to look at something we’d rather ignore.It’s timeless. It moves you to tears and it moved your grandmother, too. It doesn’t rely too much on what’s just popular at the moment - it runs deeper than that.It teaches you about the human condition. This needn’t be “drama” - there are musicals, comedies, dances, paintings, etc., that can teach us about ourselves as humans.Just my 2 cents. ",
            "date": "Answered January 18, 2018",
            "views": "270",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tristan Fernandes",
                    "user_href": "/profile/Tristan-Fernandes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahmad Naik",
                "href": "/profile/Ahmad-Naik"
            },
            "answer_text": "Technically speaking - we can't. “Art” is a matter of perspective. A single dot on a blue canvas can be termed as artistic or an accidental stain by the painter. “Entertainment” is a feeling we have - consciously or sub-consciously. If we are entertained, then technically speaking a work of art overlaps with the entertainment industry. However, if we are not entertained by a piece of Art- we can still consider it to be “art”. Also - Just because we are entertained - does not mean we might perceive it as art. eg: Just saw a man try to juggle a football while wearing heels. He failed - so it was not artistic, but certainly entertaining. P.S. Add the word industry to the words “Art” and “Entertainment” to get your answer. I used it individualistically to make the answer simpler. ",
            "date": "Answered July 13, 2016",
            "views": "280",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ali-D-84"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anders Wahlberg",
                "href": "/profile/Anders-Wahlberg"
            },
            "answer_text": "Surely the arts are demonstrations of skill that serves no purpose but to enjoy and appreciate it. There are visual arts such as painting, photography etc., there are three dimensional arts such as pottery, carving and sculpture, and there are written arts - poetry and prose, and musical composition, and there are the performing arts - music, acting, singing and perhaps comedy. Art is perhaps best expressed as something created whether permanent or ephemeral, that provides pleasure, interest and other positive emotions to those who witness them. There is much artistry in providing entertainment, and there is much entertainment in the provision of the arts. ",
            "date": "Answered January 17, 2018",
            "views": "182",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martin Drew",
                    "user_href": "/profile/Martin-Drew-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victor Strawn",
                "href": "/profile/Victor-Strawn"
            },
            "answer_text": "Art is the expression and solicitation of thoughts and emotions through creative means. Art can take many forms, including painting, drawing, sculpture, music, film making, and much more. Entertainment, as I understand it, is one of those forms. Rather than being separate from, but related to art, “entertainment” is simply a form of art which is prepared exclusively for public consumption. ",
            "date": "Answered March 3, 2018",
            "views": "306",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kashmira Brahmane",
                    "user_href": "/profile/Kashmira-Brahmane-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Bhargava",
                "href": "/profile/Pranav-Bhargava-6"
            },
            "answer_text": "Money factor. The entertainment industry provides an audience with amusement or enjoyment and these days its all about entertaining a larger audience. A larger audience means more appreciators which means more money in the end. The art industry doesn't perform according to what may capture a large audience. They perform to express an idea or an injustice. These people mostly do it for themselves with no regard of what others feel. ",
            "date": "Answered July 10, 2016",
            "views": "88",
            "upvotes": " Answer requested by Kashmira Brahmane"
        },
        {
            "author_info": {
                "name": "Indrajeet Garachh",
                "href": "/profile/Indrajeet-Garachh"
            },
            "answer_text": "Every entrainment industry is a art industry, But, Every art industry is not entrainment industry.!! Hope the difference is conveyed.!! ",
            "date": "Answered July 13, 2016",
            "views": "62",
            "upvotes": " View 1 Upvoter "
        }
    ]
}