{
    "title": "How does it feel to be a hundred years old? - Quora",
    "tags": [
        "History",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabriele Kembuan",
                "href": "/profile/Gabriele-Kembuan"
            },
            "answer_text": "My great aunt (currently living in my home) was born in 1918, so she is 98 this year. I think she’s very lonely. She was not a pleasant person in her youth, so she doesn’t have any friends now… (until I realize that well, she’s almost 100, so...) But still: she was not a pleasant person when she was younger, and in hindsight I think she has borderline or maybe paranoid personality disorder. Until about 5 years ago she was still living in her own house with a maid. She still baked cakes and cookies, was still really active, and would send world’s best marble cakes to my home every month. A fall however caused her hips to be dislocated, but after the necessary surgery she refused to allow the physiotherapist into her house for…some reasons, and accused her live-in nurse who was giving light therapy to her muscles of poisoning her, so she stopped getting any therapies. She was therefore unable to walk, and her muscles have atrophied. She despised wheelchair since it reminds her of my late grandfather and “dead people”. She refused to move out of her house. So she essentially made herself bedridden. My mom finally moved her to our house and told her lies somehow so she doesn’t realize that she’s in a different house. She has a bad eyesight since long ago, and in the last few years she has started hallucinating and talking of weird things, mixing her imagination with the past and the present. Recently she has imaginary conversations with her ex-fiancee from 80 years ago (she never married), and last week she made a ruckus by angrily accusing my mom of preventing her to arrive at her wedding with her fiancee. It’s sad, really. She also often talks with her contemporaries, most of whom has passed away. When she’s completely lucid she actually still has amazing memories of so many things, but those moments are now few and far between. It must be very lonely, and even more so in her case because she’s confined in one room, with only her thoughts and regrets. This sounds selfish, but it’s not something I personally want to experience. ",
            "date": "Answered September 9, 2016",
            "views": "37",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicole Ryan",
                    "user_href": "/profile/Nicole-Ryan-107"
                },
                {
                    "user_id": "Shirley McClain",
                    "user_href": "/profile/Shirley-McClain-10"
                },
                {
                    "user_id": "Michael Price",
                    "user_href": "/profile/Michael-Price-29"
                },
                {
                    "user_id": "Michelle Petras",
                    "user_href": "/profile/Michelle-Petras"
                },
                {
                    "user_id": "Juanita Daniel",
                    "user_href": "/profile/Juanita-Daniel"
                },
                {
                    "user_id": "Listra Y. Ginting",
                    "user_href": "/profile/Listra-Y-Ginting"
                },
                {
                    "user_id": "Trey Duong",
                    "user_href": "/profile/Trey-Duong-1"
                },
                {
                    "user_id": "Shanfa Chaiyadi",
                    "user_href": "/profile/Shanfa-Chaiyadi"
                },
                {
                    "user_id": "Sohel Rayhan Lam",
                    "user_href": "/profile/Sohel-Rayhan-Lam"
                },
                {
                    "user_id": "Grayce Love",
                    "user_href": "/profile/Grayce-Love"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Manser",
                "href": "/profile/Anthony-Manser"
            },
            "answer_text": "We moved to Ireland from the UK twenty-five years ago, and we brought my mother with us when she was ninety-one years old. We gave her a room in our new house and we looked after her as best we could, but the trouble was that I was involved in engineering projects outside of Ireland and was often away for weeks, and my wife found it increasingly difficult to cope with my mother’s needs since she was basically bedridden. Mum was lucid and in command of all of her mental faculties, but she was slightly incontinent and she needed a lot of help. Eventually the time came for a nursing home for her, where she could have 24/7 care. There she shared a room with another elderly patient, which was not something I liked, but I was having to pay the nursing home €13,000 a year for her care and I couldn’t afford a single room for her. She seemed to settle in very well there, and even got involved it the homes catering by trundling about on her Zimmer frame to set the tables for dinner. She told me that she liked it there, because there were people of her age that she could talk to over meals. One day, when I visited her, she said that her room mate had passed away in the night. “I hate that when it happens!” she said quietly. How could I respond to that? How could I sympathise with her when she was woken by the carers in the morning who were as quietly as they could removing a dead body from her room? My mother passed her one-hundredth birthday in her nursing home and, being an English citizen, she received her card from the Queen and a cheque from the Irish president. All the local newspapers published photos of Mum in her chair surrounded by care staff and family A few months later my mother developed a severe kidney infection and was hosptalised. In the hospital the doctors took me to one side and said that due to her age her condition was incurable without invasive surgery, and at her age they didn’t think she would survive that. They needed me to sign a form that simply said “No invasive surgery.” I was resigned and I agreed. I sat with her for hours, but she couldn’t talk to me. She just made whimpering noises and gripped my hand until she finally fell asleep. To my eternal discredit I decided to go home for an hour of two of sleep but then, in the earlier hours, a call from the hospital — “She is slipping away.” My wife, my son, and my wife got there just too late, and I never got to hold this woman who had given me so much, as she passed on to wherever we all go finally. I will for the rest of my life wrestle with my conscious that I didn’t stay with her for those last minutes. That, I suppose, is what it is like to be one hundred years old and still living. You are a burden, financial and family. You can’t walk and need nursing care all of the time, and you can’t even go to the loo without assistance. You hope for a visit from a son or daughter on the odd weekend for a chat that lasts for an hour before son/daughter needs to go when it becomes apparent that they have become bored and don’t know what to talk about anymore. All I know is that the morning after she passed away, compulsively, I got in my car and drove down to the banks of the river in a secluded spot and, although I had always prided myself as being a strong man, I cried my bloody eyes out for that woman and how I had left her when she needed me most. ",
            "date": "Answered December 14, 2017",
            "views": "47",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicole Ryan",
                    "user_href": "/profile/Nicole-Ryan-107"
                },
                {
                    "user_id": "Shirley McClain",
                    "user_href": "/profile/Shirley-McClain-10"
                },
                {
                    "user_id": "Jurgen Lunge",
                    "user_href": "/profile/Jurgen-Lunge"
                },
                {
                    "user_id": "Sandy Jordan",
                    "user_href": "/profile/Sandy-Jordan-9"
                },
                {
                    "user_id": "Meghan Yap",
                    "user_href": "/profile/Meghan-Yap"
                },
                {
                    "user_id": "Chandra Shekhar",
                    "user_href": "/profile/Chandra-Shekhar-334"
                },
                {
                    "user_id": "Paras Gadhvi",
                    "user_href": "/profile/Paras-Gadhvi-5"
                },
                {
                    "user_id": "Kiran Padera",
                    "user_href": "/profile/Kiran-Padera"
                },
                {
                    "user_id": "Zak Ely",
                    "user_href": "/profile/Zak-Ely-2"
                },
                {
                    "user_id": "Numan Khan",
                    "user_href": "/profile/Numan-Khan-229"
                }
            ]
        }
    ]
}