{
    "title": "How does a narcissist secretly manipulate their partner? - Quora",
    "tags": [
        "Manipulation",
        "Narcissists",
        "Narcissistic Personality Disorder",
        "Narcissism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnny Do",
                "href": "/profile/Johnny-Do-47"
            },
            "answer_text": "Q: How does a Narcissist secretly manipulate their partner? This is an interesting question! I will answer it from two perspectives; firstly, how you can attempt to avoid a Narcissist and secondly, why this so often won’t work first time around! People are divided on the issue, some believe they can be avoided, many survivors will attest that it is extremely difficult……..if you have a certain predisposition, I will elaborate…..  Narcissists bury their true self-expression in response to early injuries and replace it with a highly developed, compensatory false self.” They create an alternate persona to their real self, they come across as grandiose, “above others,” self-absorbed, and highly conceited. In our highly individualistic and externally driven society, mild to severe forms of narcissism are not only pervasive but often encouraged. However, those who are real ASPD’s take this to ‘another level’. Part I: Avoiding Narcissists: Posts have already gone over the key pointers to help you repel the lure of Narco-balls so I’ll bullet list them: Go slow and Pick Your RelationshipsAvoid Being Sucked In by love bombingDo not reveal to much of yourself too quickly***Really important: Johnny Do's answer to How does a narcissist choose his supply? Know Your Rights and Set BoundariesBe AssertiveDeploy Consequence(s) to abuse For a more detailed explanation of Red Flags read: William Gorder's share of Martha Helene Jones's answer to What are the biggest signs that someone has narcissistic personality disorder? in Cluster B Unmasked Part II: Why avoiding a Narcissist may not work: Narcissism is difficult to detect for certain and that it is a process of joining the red flags. Clues which slowly build a picture that on the ‘balance of probabilities’ something is very wrong. Often it is our instinct that we ignore before we are educated. When we are awake, we rely on it like an ‘early warning system’ to identify inconsistent behaviour.  Saying you can avoid Narcissists is like telling a child in a candy store not to buy any sweets. You see avoidance sounds simple, it’s sounds rationale but it much more difficult to achieve when your targeted by a Narcissist. Normally targets are unaware of pathalogical behaviour….they still believe in ‘soul mates’, the one’, a twin flame (insert as appropriate but pass the vomit bucket while your at it!!’ Don’t get me started on the New Age Spiritual Mind washing BS!!!  You would think a simple caution would suffice such as: “If you see X,Y or Z behaviour then get out, there’s something wrong. But hey if it were that simple Why are their millions upon millions of people who didn’t avoid them? As humans we are biologically wired to avoid danger, our system is fear driven so why did we ALL get scammed! Back to the candy store….. Narcissists are ‘shape shifters’, they study you meticulously, listen astutely, list every insecurity and every doubt. They catalogue your desires, needs and wants. THEN like a 3-D printer they create the ‘perfect’ partner a sort of 3-D Hologram. The sweetest candy you ever did see!!! This illusion is designed to make you fall in love but really it’s a reflection of you; your insecurities and doubts, your likes and interests (“oh you love Origami too, I can’t believe it!!”). You cannot believe how similar you are OMG!!’ Nothing about the Narc was permanent or real except their deranged behaviour. The love bombing is one of many Psy-Ops that ASPDs use to spellbind you. They overload your senses and eventually paralyse you. Your given as much: ComplimentsAffectionAttentionSexAdulationAs you can possibly desire!!!!! Your system is saturated with feel good hormones, shutting down all objective rationale thought. Suffocating in sensual desires you lose all sense of doubt. How could this not be real? You ask. Combined with focused isolation separating you from dissenting voices of friends and family slowly you are brainwashed and your in the matrix living in virtual reality. You were plugged in and blindsided with subtle suggestive comments that create: Insecurity about your relationshipConfusionSelf doubt through gaslighting and cognitive dissonanceDissociation: you learn to ignore your esteem needs by avoiding confrontationThe matrix creates a reflection of the person you desire in your dreams…….when they appear you think your lottery ticket has come in. This is easier to do than you realise. Believe me….they had you at “Hello”. Sprinkle in some co-dependency……. To complicate matters co-dependent/ (people pleasing) characters tend to be drawn to Narcs as there is a symbiotic neurosis - which meets the emotional needs of the giver and taker. Co-dependents self esteem comes through giving and ASPDs will only entertain people who serve their needs. So it a perfect match in the beginning. However, both are emotionally disregulated and have extremely unhealthy attachment patterns. Narcissists understand very quickly whether your a ‘good fit’…….they will start off testing you quickly to assess your compliance. If you do not meet their needs, they will not invest in you. This is normally the only way you can avoid them. Q: Is really possible to avoid them? The reason why reading and listening to people who understand NPD, Bi-polar, Psychopathy etc is so important is http://because……….it helps you spot Red Flags. In time with enough reminders you will be able to spot them quicker and identify familiar behaviour patterns. However, this is difficult to do first time around. When you are nieve and innocent and your head is full of fairytales it’s almost impossible. You may slip the net a few time’s but if your a serial online dater……your chances eventually run out. Now let me ask you…..do you feel lucky!!! Well do you…….. Reality test: Questions: How long after the relationship did it take you to figure this out?How many times did you have to re-read the same message, (written a hundred different ways) IT WAS A CON for you to get it!How long did the cognitive dissonance last after you went NC and how many: He loves me” He loves me not” iterations did you go through in your head every single friggin day!!!The longer you engage with a Narc the greater the probability you will slip into a trance and lose your ability to detect abuse. So it’s a difficult balance knowing when to ‘cut and run’. You have to detect a problem quick enough before…………..your so far in you can’t get out. How come? Brainwashing changes how you think: I-believe the most damaging aspect of our engagement with ASPDs is how they damage us psychologically. Often sufferers don’t even realise until the discard……..how deep this psychological damage has been. They have been brainwashed and don’t realise how much their self esteem has crumbled, how much of their old self they have lost (it comes back in time). How do they do it? The process of brainwashing: The essence of the brainwashing process is to isolate victims from their prior connections and destabilise their identity. Then……… consolidate a new, submissive identity within a rigidly bound new framework in which the target’s behaviour is carefully monitored and controlled. From your experience, you know how ‘smooth’ a Narc can be, how mentally agile they are, how easily they can justify their behaviour and ‘shape shift’ into the victim. Looking back you realise they used gaslighting, triangulation, sweet /mean cycles / silent treatments etc……to make it appear as though your the abuser, you were at fault. These techniques are designed to make you constantly anxious (walking on eggshells) and questioning yourself and your memory. The Narc constantly said you were too: (FILL IN THE BULLET POINTS): ControllingJealousAggressiveCheapFatLazyUglyStupidNice!UntrustworthyNRC TACTICS 101: Above are only 10 points but each one could be used in different ways to break you down. Each of these words can be used to gaslight you. All the Narc has to provide is a fabricated example or ask you do something that ’sets you up’ giving them the opportunity to call you…..(fill in the blanks). Once your in the DV Stage this will be combined with a meltdown by Narcky because your now conditioned to ‘not fight back’ you just have to sit there and listen to it. There is actually a limited amount of time a Narc has to bond you to them. There is a finite number of days to cast their spell before you escape from their clutches, if it is not cast in time, then the risk of you leaving when you discover their abuse is much greater. Once its cast, you are locked and loaded, they begin to spin the barrel on this game of Russian Roulette, each discard is a pull of the trigger, with each reunion you get one step closer to that bullet with your number on. This is reason for their saturation of attention, adulation, adoration affection, sex and gifts. It is all designed to put you into a trance, (deep relaxation) and programme your mind with thoughts and ideas of a perfect future and perfect partner. That is the reason why they demand exclusive access to you, why they intimate that certain people around you do not like them…………. so they can steal you away, all for themselves. There is a limited amount of time to achieve their ends…they know when they have you…………….normally its when you finally say, I love You!!! People are naive they believe they cannot be programmed, brainwashed or put into a hypnotic state, It is much easier than you realise and the effects on your subconscious mind (which programmes most of your behaviour) is significant. This exclusive and intense contact is the same modus operandi that cult’s use. They admire you, they break you down through criticism, then they seek to rebuild you into a more compliant individual. They promise access to exclusive delights, they promise access to an exclusive club of power, knowledge, divine understanding. They tell you that you are different, better than others. They offer you a magical elixir of illusion. Ever wonder why your narc made out like you were different!! Your were special!!!! They made you feel like you two together could take on the world, that no-one else understood you like they did. You were venerated, put on a pedestal and you were “cue record scratching SEDUCED”.. When you met them you rolled the dice, you never knew it was loaded, you just knew it felt wonderful. We are not perfect, we are human and often a slave to our sensual desires. Very few things are more sensually alluring than basking in the golden light of a narcissist's hypnotic spider web. I know right! tell me about it!!! When you first meet a Narcissist your like a kid with the keys to a Candy store, you get sick on supply,. You cant get enough of the smiles, the “your Amazing”, “You have beautiful eyes” “Mwah?!!, the sex, the less than discrete touching in public. The look………you know that look……..that I am going to rip your clothes off when we get home look’!. Can I get a Hell yeah!! Looking back, be honest?, is it any wonder you fell under their spell?. I mean as rackets go this is f-ing epic, who would not fall for this sh*t, come onnnnnn!!! Like Heloooooo”. Damn straight, I got played, same as you!! Understanding how it happened and why, is very important to achieving closure and healing. Taking the next step in your spiritual evolution, breaking down and re-building, like a snake,you shed old skin, an old self, and grow into a new one through awareness understanding and recovery from trauma. This is another truth bomb, exposing the magic tricks of the Narcarati, chopping it up, strictly 100. All the best, J.R. ",
            "date": "Updated October 18, 2020",
            "views": "12",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kris Jacobs",
                    "user_href": "/profile/Kris-Jacobs-4"
                },
                {
                    "user_id": "Barbara Sasyk",
                    "user_href": "/profile/Barbara-Sasyk-1"
                },
                {
                    "user_id": "Shakira Heard",
                    "user_href": "/profile/Shakira-Heard"
                },
                {
                    "user_id": "Christine Nichols",
                    "user_href": "/profile/Christine-Nichols-59"
                },
                {
                    "user_id": "Alexandra Britainia",
                    "user_href": "/profile/Alexandra-Britainia"
                },
                {
                    "user_id": "Phoenix Rose",
                    "user_href": "/profile/Phoenix-Rose-66"
                },
                {
                    "user_id": "Chayenne Dufrense",
                    "user_href": "/profile/Chayenne-Dufrense"
                },
                {
                    "user_id": "Vickie Bellefontaine",
                    "user_href": "/profile/Vickie-Bellefontaine"
                },
                {
                    "user_id": "Grace Katz",
                    "user_href": "/profile/Grace-Katz-6"
                },
                {
                    "user_id": "Terri Patterson",
                    "user_href": "/profile/Terri-Patterson-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Tierney",
                "href": "/profile/Edward-Tierney-6"
            },
            "answer_text": "Everything they do, from the first minute, is about manipulation and control. Their favourite trick is just to lie, and tell you what you want to hear. The know what that is, because they are careful to find out as much about you as possible. You, of course, disclose it all freely, flattered that someone is taking such an interest- but in fact it is sinister, and they are fact-gathering so they can twist it and use it to their advantage. Then they can start mirroring you- your beliefs, your fears, your ambitions- so that when they say (as they will) that you are twin flames, soulmates, destined to be together because you are so compatible, it sounds right. But it is not- it is all part of the manipulation, the narc plan to lead you straight into the narc trap (loving them, and becoming so dependent you cannot leave without much pain). And the biggest lie, which they will usually tell very early in the relatiuonship, before you do, is that they love you. That underpins everything else, so when devaluation starts, which it wil, l as soon as you are committed, you think the criticisms come from a place of love, so you are liable to accept them. And that is a critical mistake on your part, because it does not come from love- it is just manipulation, and you are getting further and further into the trap. It is all fiendishly clever, and extremely dangerous, because unless you are already an expert on narcissism, you don´t even notice it happening. Your head has been turned by all the flattery and the gifts and the kindness, and the narc bowls things along so you have no time to think- is this all too good to be true? Nor do you have the time or the inclination to consult your closest friends, who are probably horrified by what they see happening to you , and know it is all false- but good old narcy isolates you from them as early as possible, so you are very much alone. And by the time the rosy glow of fairytale love has worn off, you are already in the trap. And then the narc mask will come off, and you will see the real one- who does not agree with your views at all, who is not as kind or considerate as you believed ( the narc is not either of these things) , who has no money, so needs access to yours, is selfish, and lies, and exaggerates, and has different faces in public and private, and is boring, and the passion is gone, and you are alone and lonely. And you suspect infidelity, but the narc denies it, even though the narc flirts openly and has mysterious absences. Welcome to narc world- your future if you stay with a narc. My advice to you is, read and become an expert on narcissism. This is surprisingly easy, because they are all the same. They do the same things to everyone all the time. The advantage this gives is that you only need to read one good book and you know all about them. Then you can deal with whatever they throw at you. The best book I found for this purpose was Prepare to be Tortured- the price you will pay for dating a narcissist. AB Jamieson, Amazon. It is a good general guide, without psychobabble. It covers romantic relationships but also goes into narcissism generally, and narcs as bosses, colleagues, friends, so it is a good guide to how to deal with them. Importantly, it also has a checklist of traits-red flags- so you can learn to identify them, and then you can live a narc-free life. You will never regret it ",
            "date": "Answered October 16, 2020",
            "views": "21",
            "upvotes": " View 53 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nasreen Robinson McKay",
                    "user_href": "/profile/Nasreen-Robinson-McKay"
                },
                {
                    "user_id": "Barbara Sasyk",
                    "user_href": "/profile/Barbara-Sasyk-1"
                },
                {
                    "user_id": "Missy Maxchalk .",
                    "user_href": "/profile/Missy-Maxchalk"
                },
                {
                    "user_id": "Lin Lane",
                    "user_href": "/profile/Lin-Lane"
                },
                {
                    "user_id": "Abby Blum",
                    "user_href": "/profile/Abby-Blum-1"
                },
                {
                    "user_id": "May Johns",
                    "user_href": "/profile/May-Johns-3"
                },
                {
                    "user_id": "Jay Deason",
                    "user_href": "/profile/Jay-Deason-1"
                },
                {
                    "user_id": "Tara Fick",
                    "user_href": "/profile/Tara-Fick"
                },
                {
                    "user_id": "Laura Palmer",
                    "user_href": "/profile/Laura-Palmer-160"
                },
                {
                    "user_id": "Audra Aneliunas",
                    "user_href": "/profile/Audra-Aneliunas"
                }
            ]
        }
    ]
}