{
    "title": "How does one find the highest quality information on the Internet? - Quora",
    "tags": [
        "Scientific Research",
        "Research",
        "Startups",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Kesselman",
                "href": "/profile/Jeff-Kesselman"
            },
            "answer_text": "Okay: Critical thinking 101 as it applies to the web FIRST understand that the internet is an unfiltered source. Second understand Sturgeon's Law as it applies to any unfiltered information source. So, now that you know that 90% of what you find will be crap, how do you tell the difference? Consider the sourceWho is the poster and is their identity verifiable?  Why should you trust this source?  For instance, an article that is reasonably verifiable as being by Stephen Hawking has a lot more likelihood of being a correct answer  on astronomy or astro-physics then an anonymous answer on Quora. Is this a peer reviewed source and who are the peers?If its not peer reviewed, then its really one person's opinion.  It may be an expert opinion (or not), but it is still a person's opinion.   Consider the motives of the poster and/or siteQuestions about which people have strong emotions are least likely to have solid answers.   Wikipedia is a great example of this.  If you want to know about Huffman Encoding or Human Genomics, Wikipedia is a great place to start.  if you want to know about gun violence or the effect of the national debt, forget it.  The noise level of people who will post with absolute asurence completely ignorant opinions is just too high.  The editors cant possibly keep up with it. For any reasonably interesting question, anyone who states a simple, definitive answer is talking out their ass.I myself, being an educator, often answer \"How would you explain X to a grade schooler\" questions.  But these answers are deliberately incomplete and incorrect in many bigger ways.  Even most of the science they taught you in Highschool is \"wrong\" in the bigger scheme of things.  (As an example, mass and energy are not always conserved.) Unless its a very specific information point or very specific skill you are  looking for, the complete answers  in any domain, be it science, politics, history or anything else, are too complex for the layman to easily and quickly grasp. ",
            "date": "Answered April 12, 2013",
            "views": "449",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Phúc Nguyễn",
                    "user_href": "/profile/Phúc-Nguyễn-174"
                }
            ]
        },
        {
            "author_info": {
                "name": "Magnus Lööv",
                "href": "/profile/Magnus-Lööv"
            },
            "answer_text": "Use good search strategies. There's a lot of advanced search options in google. Be clear what it actually is that you are looking for. Try to find the fewest key word to search with, often just consisting of nouns. To know the search syntax and to be able to formulate good search phrases is the key to get a good starting point.This is a good place to start to learn about advanced search strategies: Resources and Search Strategies  Use WOT (Web Of Trust) as a plug-in in Firefox or Chrome. It may warn you of sites that you shouldn't trust for different reasons. Check multiple sources for the same type of information. Like a journalist. Double check and check again! By checking references, if they exist, there are often a lot of them in Wikipedia. Check the links in the references too if possible. By using multiple media sources. First you may find out about something by a google search with a text page as a search hit. Or a wikipedia page. Then you can add more value to the information by using Youtube or other video sources. Good for tutorials on things. Or for different views on the same subject. Even podcasts can be used (lots of special interests podcasts out there)Then if you want more expertise in a certain subject, check all the forums, including Quora of course. You could add facebook and google plus to that too, off course.Don't underestimate the power of a big and well-searchable forum. There are lots of them out there (besides quora) where you can find deep expertise in almost any area of life. You often need an account on these sites (At least to write questions or answer them) so a good password manager like \"Last Pass\" is almost a requisite to make things much easier. Then there's also online education from Stanford or other universities. Complete courses for free with video-lectures! There are of course the standard services like cached results in Google and Wayback machine (in the Internet Archive) that can be valuable if you find dead links. Internet Archive, by the way, is a good resource by itself! And of course there also are a myriad of specialized databases around the world. If you are a researcher in any area these are everywhere, but you often have to have an account to be able to use the full text, otherwise you often just find abstracts (like in pubmed). And often you must be a practitioner in the field of interest to be a member of these types of sites (A medical doctor for example). ",
            "date": "Answered January 22, 2013",
            "views": "929",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dean Edwards",
                    "user_href": "/profile/Dean-Edwards-80"
                },
                {
                    "user_id": "Akash S. Patel",
                    "user_href": "/profile/Akash-S-Patel-1"
                },
                {
                    "user_id": "Agnivesh Patel",
                    "user_href": "/profile/Agnivesh-Patel"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "Abbas Halai",
                    "user_href": "/profile/Abbas-Halai"
                }
            ]
        }
    ]
}