{
    "title": "How did you overcome impostor syndrome? Tell us your story. - Quora",
    "tags": [
        "Impostor Syndrome",
        "Storytelling"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Phillps",
                "href": "/profile/Paul-Phillps"
            },
            "answer_text": "Given the syndrome is about disbelieving ones success is attributable to their own efforts and not luck then the ‘therapy’ needs to be about showing ‘in time’ evidence of their efforts. When I suffer this, and it often comes as self-doubt following coaching assignments with top managers/leaders that have had high impact, I use writing therapy; ie writing down the interventions and learning, so I can see where my efforts had an impact and it was not just luck or coincidence. I do a timeline of highs and lows, pinpointing across the timeline where positive impact occurred. There’s a view that women suffer this more. I'm not sure, I just think they are more honest about it. They are better socialised to express their feelings and thoughts. This is a personal not empirical view. ",
            "date": "Answered January 8, 2017",
            "views": "341",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emily Harrington",
                    "user_href": "/profile/Emily-Harrington-27"
                },
                {
                    "user_id": "Denis Oakley",
                    "user_href": "/profile/Denis-Oakley"
                },
                {
                    "user_id": "Maria Brandibur",
                    "user_href": "/profile/Maria-Brandibur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shaan Shah",
                "href": "/profile/Shaan-Shah-1"
            },
            "answer_text": "I recognized that there are 7.4 billion people in the world and a small percentage of people that are professionals at the field of study I am in. Also, in order to learn effectively, it is imperative to focus on progress versus current status. When I was learning software engineering I realized that .002% of the world are professional software engineers. There are 7.4 billion people in this world. It helped me to recognize that! The world is huge and we are only used to seeing a small chunk. ",
            "date": "Answered January 9, 2017",
            "views": "274",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Si Young Kim",
                    "user_href": "/profile/Si-Young-Kim-2"
                },
                {
                    "user_id": "Muhammad Shamseddin",
                    "user_href": "/profile/Muhammad-Shamseddin"
                }
            ]
        }
    ]
}