{
    "title": "How many different sensors are available inside a smartphone? - Quora",
    "tags": [
        "Wireless Sensor Networks",
        "Sensors",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rama Krishna Raju",
                "href": "/profile/Rama-Krishna-Raju-6"
            },
            "answer_text": "1. Proximity Sensor  A proximity sensor is a sensor able to detect the presence of nearby objects without any physical Scansiona il QrCode per vedere il profilo Contact di {name} e clikka per creare il tuo GRATIS is comprised of an infrared LED and an IR light detector. It is placed near the earpiece of a phone, and for a good reason – when you place the handset up to your ear, the sensor lets the system know that you're most probably in a call and that the screen has to be turned off. The sensor works by shining a beam of invisible to humans infrared light which is reflected from a nearby object and picked up by the IR detector. 2. Light sensor    A phone's light sensor is what measures how bright the ambient light is. The phone's software uses this data to adjust the display's brightness automatically – when ambient light is plentiful, the screen's brightness is pumped up, and when it is dark, the display is dimmed down. An interesting fact is that high-end Samsung Galaxy phones use an advanced light sensor that can measure white, red, green, and blue light independently. And that's not overkill. In fact, the Adapt Display feature uses this data to fine tune image representation. 3. Barometer    Higher-end phones have a built-in barometer – a sensor that can measure atmospheric pressure. Data measured by it is used to determine how high the device is above sea level, which in turn results in improved GPS accuracy.This sensor is really cool  4. Magnetometer    The digital compass that's usually based on a sensor called magnetometer provides mobile phones with a simple orientation in relation to the Earth's magnetic field. As a result, your phone always knows which way is North so it can auto rotate your digital maps depending on your physical orientation. 5.Hall Sensor:  A Hall effect sensor is a transducer that varies its output voltage in response to a magnetic field. Hall effect sensors are used for proximity switching, positioning, speed detection, and current sensing applications.The main function of this proximity sensor is to detect how close your smartphone's screen is to your body. When you use your smartphone, it detects the position of ear with respect to screen and turns off the light of screen and saves battery. Also proximity sensor stops the accidental touch, unwanted input during talk. This sensor also detects the signal strength, interference sources and amplify or filter by use of Beam Forming Technique. Thus, in a nutshell, proximity sensor detect the presence of body like cheek, face or ear and stops the web surfing, music or video during talk/calling and save the battery. After the conversation, it resumes the same function which was stopped earlier during talk. Animated Hall effect    Discovery :It was discovered by Edwin Hall in 1879.wikilink for Hall effect: Wikipedia 6.Accelerometers: Accelerometers (Gravity Sensors)are  devices that can measure acceleration (the rate of change in velocity),  but in smartphones, they're able to detect changes in orientation and  tell the screen to rotate. Basically, it helps the phone know up from  down. All accelerometers have two fundamental parts: 1. A housing attachment to the object  whose acceleration we want to measure.2. A mass that, while tethered  to the housing, can still move.  For example assume a spring and a heavy ball. If you move the housing up, the ball lags behind stretching the spring.  If we measure how much that spring stretches, we can calculate the force  of gravity.    Inside the smartphone accelerometer chip, engineers have created a tiny accelerometer out of  silicon. It has, of course, a housing that's fixed to the phone, and a  comb-like section that can move back and forth. That's the seismic mass  equivalent to the ball. The spring in this case is the flexibility of  the thin silicon tethering to the housing. Now clearly, if we can  measure the motion of this central section we can detect changes in  orientation.The motion of the springs causes a change in value of capacitance which is sensed by a sensor which scales it to current signals to communicate with the brain of the smartphone.And all of this happens in a matter of a microseconds !! :P 7.Gyroscope:   The gyroscope is a sensor that can provide orientation information as well, but with greater precision. Thanks to this particular sensor, Android's Photo Sphere camera feature can tell how much a phone has been rotated and in which direction. It is also used by Google's Sky Map for telling what constellation you're pointing a phone at. 8.Thermometer:    Some folks might remember that the Samsung Galaxy S4 bragged with a thermometer for measuring ambient temperature. However, there's a thermometer in pretty much any smartphone, and some handsets might have more than one of them. The difference is that they're used to monitor the temperature inside the device and its battery. If a component is detected to be overheating, the system shuts itself down to prevent damage. And speaking of the Galaxy S4, it pioneered the use of an air humidity sensor in a smartphone. Data provided by it was used in the S Health application to tell whether or not the user was in their \"Comfort Zone\" – one with optimal air temperature and humidity. Sensor Availability While sensor availability varies from device to device, it can also vary between Android versions. This is because the Android sensors have been introduced over the course of several platform releases. For example, many sensors were introduced in Android 1.5 (API Level 3), but some were not implemented and were not available for use until Android 2.3 (API Level 9). Likewise, several sensors were introduced in Android 2.3 (API Level 9) and Android 4.0 (API Level 14). Two sensors have been deprecated and replaced by newer, better sensors.below Table  summarizes the availability of each sensor on a platform-by-platform basis. Only four platforms are listed because those are the platforms that involved sensor changes. Sensors that are listed as deprecated are still available on subsequent platforms (provided the sensor is present on a device), which is in line with Android's forward compatibility policy.   ",
            "date": "Answered November 23, 2015",
            "views": "71",
            "upvotes": " View 81 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Girish Patel",
                    "user_href": "/profile/Girish-Patel-334"
                },
                {
                    "user_id": "Anupam Chatterjee",
                    "user_href": "/profile/Anupam-Chatterjee-18"
                },
                {
                    "user_id": "Rohit Patil",
                    "user_href": "/profile/Rohit-Patil-923"
                },
                {
                    "user_id": "Saurabh",
                    "user_href": "/profile/Saurabh-161"
                },
                {
                    "user_id": "Prajwal Gowda L",
                    "user_href": "/profile/Prajwal-Gowda-L"
                },
                {
                    "user_id": "PUTHIYAVAN L N",
                    "user_href": "/profile/PUTHIYAVAN-L-N"
                },
                {
                    "user_id": "Ayush Vikram",
                    "user_href": "/profile/Ayush-Vikram-4"
                },
                {
                    "user_id": "Pavan",
                    "user_href": "/profile/Pavan-325"
                },
                {
                    "user_id": "Murtaza Mahemud",
                    "user_href": "/profile/Murtaza-Mahemud"
                },
                {
                    "user_id": "San Rak",
                    "user_href": "/profile/San-Rak-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suchith Soman",
                "href": "/profile/Suchith-Soman"
            },
            "answer_text": "Smartphones are incredible little machines. Do you know how many different kinds go inside a smartphone?  The most commonly used sensors  Accelerometer, measures the acceleration that the handset is experiencing relative to freefall, also used to determine a device's orientation along its three axes Gyroscope is a sensor that provide orientation information with greater precision. Magnetometer, to detect magnetic fields. (compass applications use this to point at the planet's north pole) Proximity sensor, It is placed near the earpiece of a phone. During a call, this sensor lets the system know that you're most probably in a call and that the screen has to be turned off. Light sensor, measures how bright the ambient light is. The phone's software uses this data to adjust the display's brightness automatically. Barometer measures atmospheric pressure. Data measured by it is used to determine how high the device is above sea level, which in turn results in improved GPS accuracy.  Thermometer measures ambient temperature. Some handsets might have more than one of them(to monitor the temperature inside the device and its battery) Air humidity sensor to measure the \"Comfort Zone\" – one with optimal air temperature and humidity.  Pedometer is a sensor used for counting the number of steps that the user has taken. Heart rate monitor, measure one's pulse, and it does that by detecting the minute pulsations of the blood vessels inside one's finger. Not so popular ones Fingerprint sensors, the sensor is most convenient to use, as it does not require swiping in order to read fingerprint data. Detecting harmful radiation: used to measure the current radiation level in the area PS: Touch screen, GPS, Cameras and Microphones can be considered as sensors as well :) ",
            "date": "Answered November 24, 2015",
            "views": "212",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rico Velez",
                    "user_href": "/profile/Rico-Velez"
                },
                {
                    "user_id": "Jeff Harries",
                    "user_href": "/profile/Jeff-Harries"
                },
                {
                    "user_id": "Archana Sri",
                    "user_href": "/profile/Archana-Sri-2"
                },
                {
                    "user_id": "Manoj",
                    "user_href": "/profile/Manoj-1070"
                },
                {
                    "user_id": "SaNdeep Reddy",
                    "user_href": "/profile/SaNdeep-Reddy-454"
                },
                {
                    "user_id": "Sriram Vepuri",
                    "user_href": "/profile/Sriram-Vepuri"
                },
                {
                    "user_id": "Inzamamul Haq",
                    "user_href": "/profile/Inzamamul-Haq"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/VASEEM-KHAN-B"
                },
                {
                    "user_id": "Sreeresmi Sumesh",
                    "user_href": "/profile/Sreeresmi-Sumesh"
                }
            ]
        }
    ]
}