{
    "title": "How to make a better presentation on communication - Quora",
    "tags": [
        "Presentation Tools",
        "Presentations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clara Biagiotti",
                "href": "/profile/Clara-Biagiotti"
            },
            "answer_text": "Some good tips to make a better presentation are : Less information on a slide-show, don’t put everything on it! Just key words or sentences which are important.Take some notes with you, but pleaaaaaase don’t read it every time. If you just read your papers, everybody will get bored, you don’t want that right? So please, stay focus on your subject, you worked on it, so it means you know things about it.You want an interactive presentation? Ask questions to the class. For example, if you do a presentation about the use of Internet, you can ask them “According to you, what is the percentage of people who does not have access to the Internet?” They will try to find the answer you will see.More creative? I don’t really know what you mean by that, but you can include videos, graphics. Do you know what I mean? Something different than texts on a slideshow.Don’t have a monotonous voice! It’s boring af when someone is like that… Talk slowly, you’re explaining things, not gonna take the train!I hope these tips will help you! Good luck for Monday! ",
            "date": "Answered April 8, 2017",
            "views": "95",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhinav Anshul",
                    "user_href": "/profile/Abhinav-Anshul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pronit Roy Chowdhury",
                "href": "/profile/Pronit-Roy-Chowdhury"
            },
            "answer_text": "Commonly while giving a presentation people make the following mistakes:- They read out the content of the slides blatantly which in turn bores off the audienceThere is very less interaction during a presentation, now you might be wondering what I mean by interaction in the middle of a presentation. Simply put, it refers to the spontaneity which helps in connecting with people betterModulation and pitch should vary and there should be a beaming confidence continuously surfacing on the face of the person while presenting the topicBest of luck :-) ",
            "date": "Answered April 8, 2017",
            "views": "95",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amrit Varsha",
                    "user_href": "/profile/Amrit-Varsha-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Onkar K Khullar",
                "href": "/profile/Onkar-K-Khullar"
            },
            "answer_text": " I have recently given a video on this for more such ideas you can subscribe to my channel digital gandhi or my company presentation.ink my profile : www.onkar.world ",
            "date": "Answered April 12, 2017",
            "views": "11",
            "upvotes": " Answer requested by Mohan Singh Rathore"
        }
    ]
}