{
    "title": "How to unsummon a spirit - Quora",
    "tags": [
        "Spirit Science and Spiritism",
        "Spirits and Ghosts",
        "Spiritualism",
        "Spirits (ethereal)",
        "Spirit",
        "Ghosts",
        "The Paranormal",
        "Supernatural Phenomena",
        "Spirituality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Kwesi Ansah",
                "href": "/profile/Daniel-Kwesi-Ansah"
            },
            "answer_text": "Juju on summon a spirit in order for you to on somatic spirit you must first be in a higher authority number 2 you must be covered that the higher power than that spirit you want to unsummon and I would advise you that don't be like the sons of skiba who went about try and error in the book of Acts of the 16 calling upon the name of Jesus Christ who apostle Paul preached in set we command you to come out that the name of Jesus Christ home power project and the spirit says to the sons of skiba Jesus I know and Paul I know but who are you in order for you to on summon a spirit you must have an identity that spirit must know you belong to a higher power than its off before you can summon in on some of that spirit this is my piece of advice if you are not authorised by Christ who is the head of the powers there are don't try to summon on unsummon a spirit this is my advice thank you. ",
            "date": "Answered July 13, 2020",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manith Programmer",
                    "user_href": "/profile/Manith-Programmer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simo Henrik",
                "href": "/profile/Simo-Henrik"
            },
            "answer_text": "Some demons left their victim in the Acts of the Apostles by reading Scripture. The Living Word of God is Spirit. Where the Spirit of God is, there is freedom. All other spirits that do not serve God directly, are without freedom, probably leading to themselves only, being the very anti-themselves of their original purpose. Wisdom becomes madness, beauty becomes ugliness. All things, if not placed in Truth and Life (Christ), are not in their true position of meaning and outcome. It is like two transparent sheets with drawings. If not placed on truth correctly, they will still seem true, but will be a distortion of Truth. They will be separate, not serving truth anymore. ",
            "date": "Answered July 22, 2020",
            "views": "26",
            "upvotes": "0"
        }
    ]
}