{
    "title": "How to care for the eyes of a 5-year-old child with low vision - Quora",
    "tags": [
        "Child Development",
        "Eyesight",
        "Eyes",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "DrAvinash Bagzai",
                "href": "/profile/DrAvinash-Bagzai"
            },
            "answer_text": "first of all you should address the cause of low vision. For example , if he has any refractive power( glasses ) then make sure that he always uses those glasses A child vision develops in the early years of life, and thta too the younger the child.. the better the vision development … but vision development cannot occur beyond 8 to 9 years of age . If one eye has low vision it is ..amblyopic ( that is lazy eye)… that means the brain always depends on the better eye for its vision, and this lazy eye tend to remain lazy for the entire life if not treated before 8 years of age ( the younger the better ) . so if you address the cause of the low vision ( get it checked by a pediatric ophthalogist, for glasses, squint, stereopsis etc or any other defect ) and start the patching therapy …..in which you patch the better eye for few hours a day.. the vision in the lazy eye gradually improves over a few months. A paediatric ophthalmologist will guide you properly. ",
            "date": "Answered August 21, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shagun Sood",
                "href": "/profile/Shagun-Sood-1"
            },
            "answer_text": "You should meet an ophthalmologist to evaluate for the cause of low vision. Low vision in children less than 7 years of age can lead to a condition known as 'lazy eye'. Early diagnosis and management is the single most important factor in the management of lazy eye. The child may need glasses or occlusion or squint evaluation and appropriate management for a good visual outcome for the rest of his/her life ",
            "date": "Answered August 21, 2020",
            "views": "12",
            "upvotes": "0"
        }
    ]
}