{
    "title": "How to know who is listening to my cell phone conversations - Quora",
    "tags": [
        "Telephones",
        "Cellular Service Providers",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Comroe",
                "href": "/profile/Richard-Comroe"
            },
            "answer_text": "Hopefully at least the person to whom you called, or called you. But a radio conversation can be received by any radio within range of the radio waves. Think not? The six minute bedtime conversation between Prince Charles and married (to someone else at the time) mistress Camila Bowles Parker is said to be recorded by a scanner user on December 18th 1989 changed history. As of April, 1994, an FCC rule required ALL Scanners Sold in the USA to be Cellular frequency Deleted (Blocked) by the Mfgr, & all the Scanners offered in the USA therefore are cell blocked. Of course, all scanner equipment made before 1994 is not blocked. Eavesdropping on the radio communications remains popular … despite being against the law. The cost has gone up since the transition to digital, but that transition simply made it marginally more difficult. Whom else is listening? Before the age of direct-dial-long-distance (the 1950s) the general public presumed that telephone company personnel listened in to any/all phone calls. The presumption has faded with time since the average consumer heard the voice of an operator cutting in on a conversation, but nothing has fundamentaly changed that prevents the same today. Regardless of whether one side may be on a digital cellphone that is “illegal” to listen in upon, all end-to-end communications through the worlds telephone networks is clear … meaning unencrypted analog … meaning an arbitrary telephone destination might be from an ordinary analog telephone. Essentially, ANYONE can listen in with the sole protection that listening in would be “against the law”. Of course, we can rest assured that nobody illegally taps telephone lines in the United States(!). End-to-end digitally encrypted voice communications is possible but very rare today, and law enforcement has tried (at least once a decade) to try to make it illegal through legislation, although no such prohibition has yet ever become law. But listening in is simple. Law enforcement would like people to believe that intercepting telephone conversations (regardless of whether one end was on a cellphone or not … immaterially) is performed LEGALLY in the United States if authorized by a judge upon presentation of probable cause evidence. Yet, we know that [a] no FISA court has HARDLY EVER turned down an application for a surveillance warrant, and [b] that almost anyone can tap and record any analog telephone line as easily as bridging the line with another extension. Further, since the 1995 CALEA law, telephone exchanges all across the country have installed AUTOMATED intercept equipment to automate legally authorized requests. Yet, virtually all the telephone intercept interfaces are designed and manufactured outside of the United States (almost exclusively in Israel). Knowing what we know about NSA intercept capabilities granted by US companies, it defies credibility that Masad does not possess free intercept ability to virtually any telephone connection anywhere in the United States. I hope this provides a bit of insight into who may be listening to any telephone (even cellular) within the United States. ",
            "date": "Answered April 27, 2018",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Crowley",
                "href": "/profile/Paul-Crowley-26"
            },
            "answer_text": "In spite of some answers that seem a little paranoid, it is extremely difficult today to listen to cell phone conversations - cell phone to cell phone. The radio transmission is a digital signal that is encrypted. No, you aren’t going to be able to crack this encryption. As someone else pointed out, you aren’t even going to be able to receive the radio signals - scanners and other devices are required to not receive the frequencies where cell phone conversations are. If you call a land line phone from a cell phone, the voice data is encrypted until it reaches the PSTN, the regular analog phone network. Recording calls on this is fairly simple, but you need physical access to the wires. It is unlikely anyone would be doing this except at the location where the phone is - meaning a house or an apartment building. Physical security of analog phone connections is important and you need to be aware of the things that are in your area where phone connections are. If you see someone poking around a phone box they certainly may be up to no good. If you are concerned about law enforcement, forget it. You will never know. Since 1996 all telephone switch equipment in the US (and elsewhere) has been built with support for something called CALEA. This allows digital recording of phone conversations in a manner which is undetectable. Basically, the police get a file sent to them of every conversation. This also applies in cases where they are just getting call duration and the other phone number. This is authorized by ordinary judges based upon having probable cause that the information is needed to prosecute a criminal. But what about other countries intelligence agencies? If you become a “person of interest” to the Chinese intelligence agency they are likely to use a tower simulator. This is a device which pretends to be a tower that your phone connects to instead of a “real” tower. The device then forwards call data to a real tower to provide connectivity. These are large and expensive devices that must be within hundreds of feet of your phone. Several ways of defeating this sort of thing are possible but all of them involve moving around a lot. Oh, and this is pretty much undetectable as well. What is the point of this? Well, all of the “modern” ways of recording phone calls do not involve your phone at all and are pretty much undetectable. If you think law enforcement is monitoring you, get a lawyer involved - you are going to need one if they are recording your calls. Someone else is going to have difficulty and the sophistication involved means you aren’t going to know about it anyway. ",
            "date": "Answered October 13, 2018",
            "views": "93",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alfredo Torrejon",
                    "user_href": "/profile/Alfredo-Torrejon"
                },
                {
                    "user_id": "Aruna Reddy",
                    "user_href": "/profile/Aruna-Reddy-77"
                }
            ]
        }
    ]
}