{
    "title": "How to put MP4 footage into Avid Media Composer - Quora",
    "tags": [
        "Avid Media Composer",
        "Avid (company)",
        "MP4",
        "Video Editing",
        "Videos",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Emily",
                "href": "/profile/John-Emily"
            },
            "answer_text": "To solve the MP4 and Avid MC issues, the easy workaround is to adjust MP4 to a more editing-friendly format, such an Avid's DNxHD. iFastime Video Converter Ultimate can be of great help in this task for it's easy-to-use and able to convert quickly, as well as efficiently. The program can help you change MP4 into Avid native editing-friendly format- DNxHD without quality loss. You should then be able to import the new file into Avid MC 8/7/6/5 with smooth editing without any trouble. An Avid preset is included for easy access. If you are running Mac OS X, get MP4 to Avid MC Converter for Mac. Now download the program and follow the step-by-step gudie below to convert MP4 files to Avid DNxHD for smoothly editing. ",
            "date": "Answered December 18, 2015",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kim Frol",
                    "user_href": "/profile/Kim-Frol"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Brown",
                "href": "/profile/Chris-Brown-476"
            },
            "answer_text": "On Avid official website, it recommends DNxHD or XDCAM codec for editing, and DNxHD codec is the first choice. So if want to get Avid Media Composer work perfectly with MP4 videos, the easy workaround is to convert MP4 to DNxHD mov. Brorosft Video Converter for Mac can be of great help in this task. With it, you can effortlessly transcode 720p/1080p/4K MP4 files to Avid Media Composer 5/5.5/6/7 compatible DNxHD encoded MOV, and it works well and converts flawlessly. ",
            "date": "Answered September 7, 2016",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sophia Gill",
                "href": "/profile/Sophia-Gill-1"
            },
            "answer_text": "Well, Avid MC might not work with some MP4 files sometimes due to the codec issue or other reasons. To import MP4 files into Avid, you could convert MP4 to Avid Media Composer friendly format , such an Avid's DNxHD. This tutorial will give you a quick fix.  ",
            "date": "Answered April 24, 2017",
            "views": "766",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "KunIre Ki",
                "href": "/profile/KunIre-Ki"
            },
            "answer_text": "On Avid official website, it recommends DNxHD or XDCAM codec for editing, and DNxHD codec is the first choice. So if want to get Avid Media Composer work perfectly with MP4 videos, the easy workaround is to convert MP4 to DNxHD mov.  4K Converter: Edit 4K MXF/MOV/MP4 video files in Avid  ",
            "date": "Answered January 26, 2016",
            "views": "772",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Romina Morgan",
                "href": "/profile/Romina-Morgan"
            },
            "answer_text": "The Media Composer deals with the MP4 files at quite a slow speed and some files even cannot be recognized. Some MP4 videos cannot be edited smoothly. The following article will step by step introduce how to solve can’t put MP4 to Avid. ",
            "date": "Answered February 8, 2017",
            "views": "339",
            "upvotes": "0"
        }
    ]
}