{
    "title": "How much electricity does it take to harm you? - Quora",
    "tags": [
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard James Nelson",
                "href": "/profile/Richard-James-Nelson-1"
            },
            "answer_text": "201001–1830 As others have answered there are a lot of factors to consider. What do you mean by harm? Check google for people struck by lightning. The “electricity” may be AC or DC. DC is far more harmful for a given voltage - “DC traws, AC repells.” Where does the current flow? If through your heart it is low milliamperes. The current that flows through your body is dependent on the voltage, your body resistance, the frequency, source resistance (impedance), and the waveform. Taser systems use a high voltage of a special waveform to imobilize and yet not be lethal. A person with a heart condition, however, is an exception. A Plasma Ball power supply may be 2.5 KV, but at 26.6 KHz, has high source resistance, and is not harmful. You may still get a small black spot on your finger from its mild shock. This is an RF burn. Everyone has seen people near/touching a Tesla Coil (low powered one) and having sparks shoot from their fingers. Be sure to use thimbles on your fingers to avoid RF burns. A DC source that has a lot of capacitance (15 KV DC, 0.05 uF) is extremely dangerious. Here is a description of a friend who got his fingers between two electrodes of a 15 KV HV demonstration oscillator device I made. “Aauugghhh! That's the gadget that almost killed me! Some of you may not know that I borrowed transformer + capacitor contraption in this video from Richard many years ago (late 1980's?) and was demonstrating it to one of my high school classes when (through an embarrassingly stupid set of circumstances) it discharged not between its two nails but directly to my left and right forefingers. It threw me across the room, and I lost consciousness about a minute later. When I awoke, I was lying on the floor with wires attached to my chest as paramedics monitored my pulse with my students watching wide-eyed. Over the next few days, my index fingers turned black and swelled up like sausages, but over a few weeks they returned to normal and -- amazingly -- it seems that there was no permanent damage done to them or to my heart. Needless to say, I returned the gadget to Richard at my next opportunity.” The question is quite difficult to answer as we don’t have a lot of data to put numbers on all the parameters (and their combinations) involved. It is not as if someone will volunteer to have electricity applied to them until it is harmful. X < > Y, Sonoran desert Ricahrd ",
            "date": "Answered October 1, 2020",
            "views": "33",
            "upvotes": " Answer requested by David Andrew Doustou, II",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Bennett",
                "href": "/profile/Ray-Bennett-69"
            },
            "answer_text": "It’s not a definite quantity. It depends on what path it takes as it flows through your body. If it is just 1 finger to another finger, it would have to be enough to actually burn. If it is through your chest, it is enough to stop your heart. ",
            "date": "Answered October 1, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter "
        }
    ]
}