{
    "title": "How is the IRDA insurance surveyor exam? - Quora",
    "tags": [
        "Insurance Exams",
        "Insurance Surveyor",
        "Insurance Regulatory and Development Authority",
        "Insurance Companies",
        "Insurance"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandeep Singh Chandel",
                "href": "/profile/Sandeep-Singh-Chandel-1"
            },
            "answer_text": "Thanks for asking this question, Let me answer this query which can also help to the aspirants who are looking to become an Insurance Surveyor & Loss Assessor, As per the IRDA Regulation 2015 for grant of Application for, matters relating to, the grant of license to Individual Surveyors Loss Assessors 1) Every person who is a Student Member of the Institute intending to act as a Surveyor Loss Assessor in respect of general insurance business shall apply to the Authority for grant of License in FORM–IRDAI-1AF as given in Schedule II to these Regulations. 2) Eligibility Criteria a) Qualifications: (As Described in the Previous Chapter) I) Academic / technical/ professional/Insurance Qualifications given in Schedule I Annexure–1 of these Regulations. ii) Other qualifications as may be specified by the Authority from time to time. iii) Shall be a “Member” of the Institute. b) Training: I) Practical training for a period of not less than twelve months as specified in Regulation 17(1) ii) Such other training which the Authority may specify from time to time. Explanation: Any person who has undergone the requisite training for obtaining a license to act as a Surveyor Loss Assessor, as stated above may have to undergo such other training as may be specified by the Authority. c) Examination: Passing of relevant paper(s) of Surveyor Loss Assessor Examination conducted by the Insurance Institute of India, Mumbai, or any other Institute recognized by the Authority. Explanation: Any person who has, as on the date of notification of these Regulations, successfully completed the examination for obtaining a license to act as Surveyor Loss Assessor, is exempt from taking examination once again stated under Detailed Regulation 2015 wordings are described in the appendix section, Readers should refer it for complete understanding, You may also read the Regulation 2015 associated circulars on the official website of IRDA >Intermediaries >surveyorssection. IRDAI has taken an initiative of automation for the facilitation of various activities that need to be undertaken by Insurance companies, surveyors, brokers Third-Party Administrators (TPAs) for regulatory compliance. This program is called the ‘Business Analytics Project’ or BAP as referred to henceforth. All fresh and Renewal license procedures will carry out through this portal. IRDA Pre Licensing Examination is being conducted by III (Insurance Institute of India ). This examination held 4 times in a year. The study material for each section is available with III , One should definitely buy those study materials from the institute. (Online or offline). This examination has mainly 2 parts. Section 1 is the compulsory part i.e.principle & practice of General Insurance & other part consists of respective department examination like Motor, Marine Cargo, Marine Hull, Fire, Engineering, LOP, Miscellaneous. Insurance Institute of India provides study materials in the form of books for each section & department. Moving forward .. With my experience as a trainee surveyor, you have to be proactive to learn the theoretical & practical aspects of GI and claim methodologies. You should spend your time with your trainer, You must observe the survey practices, policy conditions, and claim settlement part very diligently. Because all these practical learning will help you grasp the understanding of General insurance concepts easily .practical learning with simultaneous reading of books make it easier for the candidate to pass the examination effortlessly. I would say the IRDA examination is not at all tough, It's like a normal examination for any subject. The format of the examination is MCQ with 60% passing marks with no negative marking. Nowadays some private publications houses are selling online mock tests for the preparation of Surveyor Examination. In my opinion, if you go through the III study material there is absolutely no need to refer to any other source of reading for passing this examination, of course, you want to polish your knowledge in General Insurance Sector, you can refer to many books available in the market. The bottom line is to treat the surveyor exam as a qualification test of your learning and understanding nothing else, It's not a university examination to secure higher marks and ranking.  ",
            "date": "Answered October 1, 2020",
            "views": "248",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Thomas Cayne",
                    "user_href": "/profile/Thomas-Cayne-2"
                },
                {
                    "user_id": "Vignesh Kuppuraj",
                    "user_href": "/profile/Vignesh-Kuppuraj-3"
                },
                {
                    "user_id": "Dhruvil Sharma",
                    "user_href": "/profile/Dhruvil-Sharma-5"
                },
                {
                    "user_id": "Poojan Shah",
                    "user_href": "/profile/Poojan-Shah-94"
                },
                {
                    "user_id": "Rajesh Kumar",
                    "user_href": "/profile/Rajesh-Kumar-30508"
                },
                {
                    "user_id": "Unknown",
                    "user_href": "/profile/Unknown-1338"
                },
                {
                    "user_id": "Jaimin Sapariya",
                    "user_href": "/profile/Jaimin-Sapariya"
                },
                {
                    "user_id": "Renuka Rj",
                    "user_href": "/profile/Renuka-Rj"
                },
                {
                    "user_id": "Akash Ahire",
                    "user_href": "/profile/Akash-Ahire-32"
                },
                {
                    "user_id": "Shivam Verma",
                    "user_href": "/profile/Shivam-Verma-455"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shalin Shah",
                "href": "/profile/Shalin-Shah-32"
            },
            "answer_text": "IRDA is not conducting exam its IIIA(indian institute of insurance and associate) IIIA exam is pre - licensing exam, after complition of your one year trainning you are eligible for the exam, there are total eight exams , from them one is compulsory (Principal of surveyor and loss assessor) and others are optional! Recently i have cleared motor exam with distinction in First attempt , i have scored 79 marks in Motor and 80 marks in Principal exam, but to cleared these exam i took 2 months break and i read 8–10 hours daily, only because of that i achieved that scored. These exams are really tough, you need to give full and proper attention to them, basically these are Multiple choice exam but they ask it in very detail. You have to read each and every line of the book, so my advice is to you that read whole book atleast 3 time to score 60 marks out of 100. If you want to clear the exam you should read minimum 15 days per subject with proper attention, reading and job can't be done simultaneously else you are extra ordinary person! Do one thing with proper attention. Pass the exam or Do the job but don't do both of them!! Or else try your luck!! ",
            "date": "Answered January 26, 2019",
            "views": "41",
            "upvotes": " View 20 Upvoters "
        }
    ]
}