{
    "title": "How fast Tata Sky Broadband is? - Quora",
    "tags": [
        "Broadband in India",
        "Tata Sky",
        "Sky",
        "Broadband",
        "Tata Group (Indian conglomerate)",
        "Internet Service Providers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yatindra Agrawal",
                "href": "/profile/Yatindra-Agrawal-2"
            },
            "answer_text": "I am using TATA Sky broadband for past 7 months. I didn't encounter any serious problem except the connection got down on two instances which they resolved it by next day. One of those time, the company's person resolved the connection by coming 6 in the morning, by resolving glitch coming from the main line from which fibre was coming to my house. I will say they provide great customer service, because they delivered even during lock down period. The speeds are exactly what the plan says. They provide wifi box having both 2.4mhz and 5mhz connection technologies even with 25 mbps plan. Their service net is not as much as of competitors for now, I am expecting in few months they will provide clients with more plan options and bundling of services. Currently they just give discounts of 50% on Hungama subscription, which I personally don't feel the need. ",
            "date": "Answered August 20, 2020",
            "views": "759",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubham Mehra",
                "href": "/profile/Shubham-Mehra-145"
            },
            "answer_text": "Tata Sky has recently stepped in the world of broadband services.  It claimed to provide unlimited data for a month at the speed of 16 Mbps. It offers the speed of 100 Mbps with the plan of Rs.1300/month. Apart from this, it is providing a free router and safe custody options. You will get the different speed with the level of the plan mentioned below:  For detailed information, you may check out Tata Sky Broadband page or Click here for simple yet complete information on Tata Sky Broadband services. Thank You!! ",
            "date": "Answered July 16, 2019",
            "views": "28",
            "upvotes": "0"
        }
    ]
}