{
    "title": "How much faster is 5G than 4G? - Quora",
    "tags": [
        "3G (wireless communication)",
        "Long Term Evolution (LTE)",
        "5G (wireless communication)",
        "Internet Speed",
        "4G (wireless communication)",
        "Telecommunications",
        "Wireless Technology",
        "Cellular Service Providers",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Wilkinson",
                "href": "/profile/Chris-Wilkinson-63"
            },
            "answer_text": "It’s faster, but is that better for us overall? Most importantly is the question of safety. There hasn’t been thorough testing that proves the safety of 5G. The radiation from 5G is much higher than 4G by a high factor. There is a lot of evidence suggesting it is harmful. It would be wise to be sure before it is used. Do we need the speed? Is faster better? Right now I’d say it was definitely unnecessary. You can stream a movie in good quality. Other data is easily fast enough for 99.99% of users. In the future we may need more speed, but what will happen is apps get designed to use the speed. Life gets more data intensive, and I’ll guess we aren’t happier for that, no win. And then there is the ever increasing use of data on individuals. Centralised organisations, banks, governments, corporations will have more data on us, and data that can be used to control the population. No doubt there are one or two good aspects to this but at best overall our freedom is severely compromised. ",
            "date": "Answered June 11, 2019",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Grupé",
                "href": "/profile/Jim-Grupé"
            },
            "answer_text": "The main difference is that it can use a higher frequency… 60GHz vs 5GHz, 3.7GHz or 1.8Ghz - popular cellular frequencies. Because the carrier frequency is higher, it can support a much higher data rate. Other than that, and a few tweaks to enable the use of the higher frequency, there is no dramatic change in technology from 4G. 5G cellular is an access method, not a network. The access networks supporting most cellular systems is a passive optical network (PON) out to the towers, with a fixed wired/fiber optic backbone linking central offices. Here are a couple of simplified diagrams:   One should also note that 5G cellular is NOT a replacement for 4G cellular service. The range is much too short at the higher frequencies it uses. Rather, it is a potential replacement for WiFi. The advantage is that unlike WiFi, it is cellular, which means it supports roaming. I.e., you can go from one access point to another without losing your connection. Can’t do that with WiFi. There may also be some manufacturing efficiencies because of the similarity to 4G. WiFi on a smart phone requires translation of cellular transmissions to Ethernet (WiFi). ",
            "date": "Answered March 8, 2019",
            "views": "665",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peng Teng Peter Ng",
                    "user_href": "/profile/Peng-Teng-Peter-Ng"
                },
                {
                    "user_id": "Risfan Setiawan",
                    "user_href": "/profile/Risfan-Setiawan"
                },
                {
                    "user_id": "Workrock",
                    "user_href": "/profile/Workrock"
                }
            ]
        }
    ]
}