{
    "title": "How does a fiber optic and a cable differ? - Quora",
    "tags": [
        "Fiber Networks",
        "Optical Fiber"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vijaykumar Chavda",
                "href": "/profile/Vijaykumar-Chavda-2"
            },
            "answer_text": "When it comes to broadband internet connections, most people value speed. They want to be able to access the internet and transmit data as quickly as possible. Moreover, in order to do this, people typically rely on either cable or fiber-optic broadband service. However, what many people don’t realize is that there are notable differences between the two:  (Source of an image - broadbandchoicesdotcodotuk) CABLE VS. FIBER OPTIC BROADBAND Fiber-optic broadband relies on fiber optic cables to move data around. Fiber optics cables are known for being capable of moving information very quickly, and they are much more reliable than other types of cables. Cable broadband, despite its name, also relies on fiber optic cables to move data around. This can be a little bit confusing for some people to understand, but cable broadband is quite similar to fiber-optic broadband in this way. What sets the two broadband services apart is how they actually connect to your home. There are some fiber-optic broadband providers that do it with fiber optic cables, but for the most part, fiber optic broadband companies use copper phone lines to connect to your home. Fiber optic cables run to street cabinets and carry data there before copper phone lines finish the job. Cable broadband, on the other hand, utilizes coaxial cables to create a connection between the cabinet and your home rather than copper phone lines. Coaxial cables are known to be a lot faster than copper phone lines when it comes to transmitting data. Cable and fiber optic broadband is both incredibly fast, but before you choose one over the other, it’s important to understand how they work. It’s also important to remember that they both use fiber optic cables for the most part, which proves just how vital fiber optic cables are to communications today. More information visit this site: connectedfiberdotcom I hope it will help you. :) ",
            "date": "Answered November 22, 2019",
            "views": "22",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sinjan Chakraborty",
                    "user_href": "/profile/Sinjan-Chakraborty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Grimshaw",
                "href": "/profile/Paul-Grimshaw-6"
            },
            "answer_text": "What is better, fiber or cable internet? Let’s assume that we’re talking about full fibre all the way to the house, based on what’s called a passive optical network (PON), compared with traditional cable based on a hybrid fibre/copper (HFC) infrastructure. What are the technical differences? Well whereas full fibre is optic fibre to a box in/on your building, HFC as the name suggests is a combination of fibre and copper cabling. More specifically HFC has fibre to a street cabinet in your neighbourhood, and a coaxial copper cable from there to your house. So the first difference is that last stretch of copper cable. However with it being a short stretch that’s made of a cable type designed specifically for high bandwidth, this copper wire doesn’t have as much impact as you might think. It’s hugely better than copper phone cable for example, which was designed for low bandwidth over longer distances. In fact the copper cable carries the same bandwidth as the fibre, and the only significant impact of the final stretch of copper with HFC is reliability, as copper joints tend to be more susceptible to corrosion from damp. Faults caused by this get gradually worse over time, and can be awkward to find. So very occasionally you may find that this needs repairing, but not a big deal for most people. Other than this the use of copper here is a bit of a red herring in the comparison, at least with today’s technology. Far more relevant is the design of the full fibre infrastructure compared with traditional cable. The latter is intended for broadcasting lots of TV channels. Now TV channels require a lot of bandwidth and in fact cable installations carry the equivalent of up to around 8Gbps for this purpose, which is comparable with any current full fibre installation and better than many. However this original purpose also results in some undesirable characteristics: for broadcasting TV the bandwidth is all downstream, and so cable is simply not designed for any upstream bandwidth; this doesn’t prevent it being retrofitted for internet, but upstream on cable is very restricted as a consequence and so internet upstream speeds are typically only a tenth of downstreambroadcasting means that you want to cover as many premises as possible with the same bandwidth, and so cables typically share their bandwidth over hundreds of housesTV is still the primary business for most cable companies, and so the majority of the downstream bandwidth is reserved for this; a typical cable has between around 2 Gbps put aside for internet downstreamFull fibre doesn’t have these limitations, allowing bandwidth to be prioritised for internet and equally shared between upstream and downstream, and typically shared across 10s rather than 100s of premises per section of fibre. So these are the main limitations of cable over full fibre in practice. Cable products often compete well with full fibre products for the headline bandwidth and deliver this reliably most of the time. However at peak times there’s more local sharing of this bandwidth than with full fibre, and cable upstream speeds are inherently much more restricted. On the bright side however most families are not hugely concerned about upstream speeds, and good cable companies will split cable segments in order to limit the impact of bandwidth sharing at peak periods. So in practice cable and fibre compete fairly closely for internet, and the difference often comes down to whether you also want TV. If you do then cable companies offer competitive TV/internet bundles, whereas fibre companies will focus on competitive internet only deals and fast upstream. A final point to keep in mind is that internet bandwidth within houses is limited in practice to WiFi bandwidth, and less commonly Ethernet bandwidth. Both of these in domestic routers are limited at best to under 1Gbps, and indeed the link from router to fibre termination is usually gigabit copper Ethernet. So there is almost no domestic market for internet above 1Gbps. Full fibre companies can deliver this more readily than cable, but there’s not much in it. Fibre to the house does have more potential for the future, with higher total segment bandwidths being in development for PON. But this isn’t going to affect most current customers, and is unlikely to impact the majority of the market for many years. ",
            "date": "Updated March 4, 2020",
            "views": "173",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Holly Smith",
                    "user_href": "/profile/Holly-Smith-338"
                },
                {
                    "user_id": "Mattias Gyllenvarg",
                    "user_href": "/profile/Mattias-Gyllenvarg"
                }
            ]
        }
    ]
}