{
    "title": "How much does it cost to manufacture a Tesla car? - Quora",
    "tags": [
        "Car Manufacturing Costs",
        "How Much Does X Cost?",
        "Electric Vehicles",
        "Electric Cars",
        "Tesla (company)",
        "Costs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nalin Savara",
                "href": "/profile/Nalin-Savara"
            },
            "answer_text": "The answer to the question “How much does it cost to manufacture a Tesla car?”- is a little more nuanced than the bill of materials+labour for a particular automobile.  Elon Musk - Founder of Tesla (and also of SpaceX - and associated with SolarCity also)  Tesla’s Factory in Fremont, California - Which Elon Musk says can manufacture upto a million cars an year Having faced many questions of the “How much will it take to make an Uber-like site ?” OR “What are the software development+server costs of Airbnb ?”— I strongly disagree with one of the answers which says: The average margin for a Tesla Model S right now is 23%. The actual cost of manufacturing is probably much lower than the figure above. However, questions like these dont have a simple or direct answer because: The cost of materials+labour+amortised cost of plant/factory is just a fraction of the cost of manufacturing a Tesla car. The real costs that Tesla has borne are the costs it has sunk into years and years of R&D and almost-there releases- as well as the costs of software updates and future software updates to be delivered to the owners of all Tesla cars- current, past and future. An example for R&D investments Tesla has already made: Tesla acquired the capability to make the hardware and software for touch-screen automobile dashboards- which are twice as big as the iPad Pro— years before apple launched the iPad! Depending on how you do the calculations for A+B above— Tesla is far from break-even with the 100,000 or so cars it plans to ship in 2017- but rather it would take years before it’s efforts pay off in entirety— at which time, Tesla will have a competitive advantage similar or even greater than what Apple has with it’s iOS+Mac+App Store platform OR what Amazon has. But as of today- as far as I can comment- though based on bill of labour+materials+ammortised plant costs— the cost of manufacturing each car may ensure Tesla a profit— the costs/investments/losses based on previous development costs it has paid; time spent; and ongoing and previous software expenses will really take several years before they truly pay off. It is in that direction that Tesla and Elon Musk (it’s founder) are spending billions on a battery manufacturing giga-factory. It is also for the above reasons that Tesla acquired a factory which can make upto 1 million cars per year in Fremont- on the outskirts of San Francisco and in the heart of the Silicon valley- which emphasises the importance of software and the need for Tesla to really scale the number of cars to recover already incurred R&D and Software Costs. References: (1) Hasse Holmstrom's answer to How much does it cost to manufacture a Tesla car? (2) Elon Musk - by Ashlee Vance - lots of interesting even if one reads book using “look inside” on amazon: (click to look inside book) Elon Musk: How the Billionaire CEO of Spacex and Tesla is Shaping Our Future (3) Various news articles & youtube videos about Elon Musk and Tesla seen by me over a period of last few years. ",
            "date": "Updated June 12, 2018",
            "views": "294",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mermp Mclermp",
                    "user_href": "/profile/Mermp-Mclermp"
                },
                {
                    "user_id": "Frank Zucco",
                    "user_href": "/profile/Frank-Zucco"
                },
                {
                    "user_id": "Rami Nasr",
                    "user_href": "/profile/Rami-Nasr-3"
                },
                {
                    "user_id": "David Foley",
                    "user_href": "/profile/David-Foley-37"
                },
                {
                    "user_id": "Matt Casters",
                    "user_href": "/profile/Matt-Casters"
                },
                {
                    "user_id": "V.S",
                    "user_href": "/profile/V-S-1016"
                },
                {
                    "user_id": "Justin Lanier",
                    "user_href": "/profile/Justin-Lanier-2"
                },
                {
                    "user_id": "LoveNewYork",
                    "user_href": "/profile/LoveNewYork"
                },
                {
                    "user_id": "Raymond Zheng",
                    "user_href": "/profile/Raymond-Zheng-4"
                },
                {
                    "user_id": "Lava Kumar",
                    "user_href": "/profile/Lava-Kumar-126"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Baker",
                "href": "/profile/Steve-Baker-100"
            },
            "answer_text": "THE COST OF MAKING A TESLA: We don’t know for sure - but Sandy Munro (who is an extreme expert on what makes cars manufacturable, etc) has done complete tear-downs of multiple Tesla cars - right down to the last nuts and bolts. He estimates that Tesla have about a 30% profit margin on their cars - and that for the Model Y it’s even higher - and for the CyberTruck, it’ll be higher still. But it’s complicated. For example, Tesla now charge $8,000 for their future “Full Self Driving” (FSD) software - and for their most popular Model 3 and Model Y, that’s about 20% of the cost of the car. The cost of downloading that software onto your car is probably about $0.01 - so why is FSD so expensive? THE COST OF FULL SELF DRIVING RESEARCH: The cost of this is far from small - it’s definitely billions of dollars. The AI training facility (which Tesla calls “The Dojo”) has been described in a couple of Elon’s tweets as an “ExaFlop system”. We can understand a lot from those two words. Background: A “Flop” is a measure of computational speed (it stands for “FLoating point OPerations per Second” - so it’s like the number of multiplications or additions the computer can do in a second. Calculating (3.14159 x 1.41421) is one “flop”. A typical desktop PC can manage a few billion additions and multiplications per second - so maybe a few GigaFlops. An ExaFlop is a billion GigaFlops. So the Dojo has the computing power of around a billion home computers. There are about 2 billion desktop computers in the world - many of which are kinda old - so the Dojo probably has about the same computing power as all of the desktop computers in the entire world put together!! As of June 2020, the fastest computer in the entire WORLD is called Fugaku and it manages 0.4 exaflops at the RIKEN Center for Computational Science, Japan. So the Dojo is the world’s fastest supercomputer is growing to become the fastest computer in world - by at least a factor of two. This is a photo Fugaku - and to give you a feeling of scale - those racks are about 2 meters tall. All of this is just ONE giant computer!  Fugaku cost about a billion dollars…so with more than twice the performance we might imagine that the Dojo is costing Tesla around $2 billion. So if the cost of the computer that trains the AI cost a couple of billion - the cost of developing Full Self Driving has got to be at least several billion dollars. We know that Tesla has sold 500,000 cars with the necessary equipment to run Full-Self-Driving (FSD) - but estimates from various owners clubs suggest that only about 40% of Tesla buyers bought the FSD option. So the cost of the world’s fastest computer was paid for out of about 200,000 cars - at a price of between $6,000 and $8,000 each - is between $1.2 and $1.6 billion dollars. So right now - FSD is therefore at best only a break-even proposition for Tesla. But once FSD is finished - they’ll make an extra 20% profit on every Model 3/Y/CyberTruck that has it! Other companies cannot come CLOSE to this scale of investment. Ford, GM, KIA…they couldn’t do this even if they wanted to. Toyota and VW might…but they are at least 5 years behind the curve. So do we count that as a loss or a gain? ",
            "date": "Updated September 12, 2020",
            "views": "369",
            "upvotes": " View 329 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jan Horyna",
                    "user_href": "/profile/Jan-Horyna"
                },
                {
                    "user_id": "Hughes Magnus",
                    "user_href": "/profile/Hughes-Magnus"
                },
                {
                    "user_id": "Gautam Gadgil",
                    "user_href": "/profile/Gautam-Gadgil-1"
                },
                {
                    "user_id": "Dion Sidoro",
                    "user_href": "/profile/Dion-Sidoro"
                },
                {
                    "user_id": "Mike Spalding",
                    "user_href": "/profile/Mike-Spalding-5"
                },
                {
                    "user_id": "Roy Chesterfield",
                    "user_href": "/profile/Roy-Chesterfield"
                },
                {
                    "user_id": "Calvin Koo",
                    "user_href": "/profile/Calvin-Koo"
                },
                {
                    "user_id": "Marco F.Felicio",
                    "user_href": "/profile/Marco-F-Felicio"
                },
                {
                    "user_id": "Robersy Peña",
                    "user_href": "/profile/Robersy-Peña"
                },
                {
                    "user_id": "Jacques Villemaire",
                    "user_href": "/profile/Jacques-Villemaire-1"
                }
            ]
        }
    ]
}