{
    "title": "How important is a library in your life? - Quora",
    "tags": [
        "Public Libraries",
        "Libraries and Librarianship",
        "Important Life Lessons",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jordan Forth",
                "href": "/profile/Jordan-Forth-4"
            },
            "answer_text": "My library is the most important thing to me. Hands down. Period. I have worked in both public and academic libraries for years, and they are very sacred spaces. They are safe havens for the homeless when it’s pouring outside. They have bathrooms and water fountains. The local library in my town is even next door to a park. They offer free services to the public— you can get movies, music, audio books, large print books, children’s books, research materials, laptops, e readers, you name it. They offer public computer use, so teens can come in and check Twitter after school or the man who’s just been laid off can come fill out job applications. They offer educational games, puzzles, coloring sheets in the children’s department. But even these are not the most important thing about libraries. Libraries offer something called programming. When I spent several years in a public library, I was in charge of programming for all ages, and what I saw while doing this work will stay with my for the rest of my life. We offered story times for all ages. One for babies, one for toddlers, and one for children and adults on the spectrum. Children learned ABCs and numbers, classic children’s songs, and developed a love for reading. We had a homemade puppet booth (that I built) for the children to use for imaginative play. We also offered after school programs. We had events for both school age children and teens. Some were educational, such as science-themed events, career events, etc. Some were fun— one program that I started was an annual Zombie Scavenger Hunt every Halloween. We had movie nights. We did crafts, made jewelry, origami, etc. We had book clubs for all ages. We also offered things for the adults in the community: again, book clubs and movie night, craft nights,knitting clubs, special speakers, even concerts by community performers. We offered a volunteer program for members of the community who wanted to help us with our events. The library is a space that is free. There are so many underprivileged people and people who are ashamed of where they come from. There are so many teenagers that, if they didn’t come to the library and surf the web after school, or sit through a movie night, they would be out on the streets. They could get hurt. The library offers a space that is judgement free. It is a hub of culture that everyone has access to, no matter who you are. I have seen my library change lives. I’ve seen people get clean from drugs and get jobs, find housing, turn their lives around. I’ve seen the well-to-do families in town come in for story time and sit by the poor families. I’ve even seen our local weather woman come in and check out books. Libraries change lives. They transform communities. That’s why they are the most important. ",
            "date": "Answered April 7, 2017",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Wheeler",
                    "user_href": "/profile/Bob-Wheeler-9"
                },
                {
                    "user_id": "Sphesihle Zulu",
                    "user_href": "/profile/Sphesihle-Zulu-5"
                },
                {
                    "user_id": "Lynn McAlister",
                    "user_href": "/profile/Lynn-McAlister"
                },
                {
                    "user_id": "Tristan Marajh",
                    "user_href": "/profile/Tristan-Marajh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maryanne Johnson",
                "href": "/profile/Maryanne-Johnson"
            },
            "answer_text": "Wow, that's an epic question since more and more libraries are becoming a thing of the past, less utilized by most, except for scholars and students and maybe children, it has a feel of a museum nowadays since most utilize home computers for information or have books on I-pads or in home personal libraries. However, they are important -not only for the preservation of books, but you can't beat FREE rentals -books, magazines, internet use, copiers, movies, music, newspapers, a quiet place of study -all things you can now utilize at libraries. I seldom use libraries, but I would be at a loss if they weren't available. They hold a lot of memories for me. I used to take my daughter to the library every Saturday when she was younger for crafts and she even won a turkey for Thanksgiving when she entered in the Turkey Coloring Contest. I became addicted to the internet in my college library, to the point my college professor had to consult his work associates on the best way to cite internet references since back then it wasn't documented in APA & MLA books on how to do so. My generation and future generations would be at a loss if libraries disappeared. Just think, if we were to ever become fossils -buried under layers of Earth, it's best they discover our books -our intelligence, intellect, history, talents, etc. -and not just our trash or waste. ",
            "date": "Answered April 7, 2017",
            "views": "715",
            "upvotes": "0"
        }
    ]
}