{
    "title": "How to know it's time to move in with your partner - Quora",
    "tags": [
        "Using Psychology in Relationships",
        "How-to Question",
        "Love Life Advice",
        "Dating Advice",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lou Grant",
                "href": "/profile/Lou-Grant-4"
            },
            "answer_text": "I’ve been living with my boyfriend for one year, so there are a bunch of people who have more experience than I do, but at that point I would say the important factors are in three categories: logistics, finances and compatibility. Logistics: Is moving in together going to make your commute easier? If not, how much harder is it going to be? A long commute can really wear you down over the years.Is moving in together going to make the housework lighter or heavier? Is your partner on board with splitting tasks accordingly with your work lives? (As in, if Mary is working 60 hours a week and Bob is working part-time, it makes sense that Bob does more and they should agree on that beforehand. Or if Mary wants to be a housewife, it should also be agreed upon. And if everyone works the same amount, they should also contribute equally.)Finances: How are you going to split rent and bills?If you’re buying a property together, what legal framework do you want around that?How do you split furniture ownership? Does the stuff you bring in remain your stuff? How about the things you buy together?What are your and your partner’s spending habits? If they like to buy high quality food, are you on board with that? If you like to spend money on decoration, are they ok with it?Is moving in together going to make your life expenses go up or down? Is the answer different for your partner?Compatibility: How well do you know your partner’s routine? Do they like to sleep in? Do they eat out a lot? Do they work out at 5am every day? How does that play with your own habits?How intimate are you with your partner? If they have never farted in front of you, if you’ve never brushed your teeth together, if you’ve never seen them sick and tired, moving in together is going to be a pretty big leap of faith.This list of questions is non exhaustive, but I think they accurately represent the kind of things you should take into account within each category. They are examples of the things you should discuss together before making the decision to move in. If the discussion goes well and you’re on the same page or find solid common ground, it’s a nice green flag. But if these topics bring up tension, you should be careful, especially in terms of money. We all love to think that material things are not that important and what matters most is the strength and purity of your feelings, but if things go sour you might end up heavily regretting that you did not have a plan ahead of time and that your finances are not well sorted out. It doesn’t all have to be perfect, of course. I chose to move in with my boyfriend even though it made both our commutes considerably worse, and it has made us more tired and stressed, causing some fights along the road. I also do more housework to allow him to be fully invested in his studies. But we have our finances well sorted out and have similar spending habits and principles. We knew each other very well before moving in, so we knew what to expect and the adaptation has been seamless. Deciding whether or not to move in isn’t about perfection. It’s about spotting in advance the most important pain points, and pondering the pros and cons. ",
            "date": "Answered February 19, 2019",
            "views": "704",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Avery Kae",
                    "user_href": "/profile/Avery-Kae-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kotsch",
                "href": "/profile/John-Kotsch"
            },
            "answer_text": "Your question resonates with me. The third week of October, 1979 I was seated at the bar in one of my favorite venues, the Village Inn on Tilghman street in Allentown, Pennsylvania. I felt a tap on my left shoulder and heard a soft spoken “John?”. I turned and it was a beautiful women I had briefly met in 1972, Barbara Bittner. She had dated my room-mate briefly before she realized he was not someone she wished to maintain a continuing relationship. I knew of her originally as a beautiful teen. I had thought she was unapproachable but I was a sophomore while she was a senior. She was admire/gawked at by most of the boys in her class in Whitehall High School. But that was all I remembered which was next to nothing. Anyway, we talked while the featured piano player continued with danceable favorites. I asked Barbara to dance, she complied and we then danced together for about 30 minutes. We sat and each had a cocktail (me a Martini and her a Jack Rose), and talked for about an hour. We found we had a lot in common including reading (a lot), crossword puzzles, good food, a good bottle of wine and tennis. We exchanged phone numbers. In April of 1980 we were married. The initial getting to know each others habits, quirks and nuances was unsettling at first but when we decided that it was easy to talk through the uncomfortable moments the tension eased. We were married just short of 29 years. My incredible wife died from brain cancer. She led a life of grace, humor and resolve which was cut far too short. I miss her everyday. So, we moved in together just shy of five months……and it worked. But it took work. The beginning, past the initial euphoria required the ability to communicate and compromise. If you love this person just make sure you take the time and make the effort to make this adventure something to enjoy and potentially something to cherish. ",
            "date": "Answered April 25, 2018",
            "views": "87",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexandra Dumitrescu",
                    "user_href": "/profile/Alexandra-Dumitrescu-15"
                },
                {
                    "user_id": "Maricruz Acuña",
                    "user_href": "/profile/Maricruz-Acuña"
                },
                {
                    "user_id": "Karina Rod",
                    "user_href": "/profile/Karina-Rod-3"
                },
                {
                    "user_id": "Justine Chillette",
                    "user_href": "/profile/Justine-Chillette"
                },
                {
                    "user_id": "Luccia Estribi",
                    "user_href": "/profile/Luccia-Estribi"
                },
                {
                    "user_id": "Amina Mehić",
                    "user_href": "/profile/Amina-Mehić"
                },
                {
                    "user_id": "Nelina Nedelcheva",
                    "user_href": "/profile/Nelina-Nedelcheva-1"
                },
                {
                    "user_id": "Tammy Carolia",
                    "user_href": "/profile/Tammy-Carolia"
                },
                {
                    "user_id": "Elana Schubert",
                    "user_href": "/profile/Elana-Schubert"
                },
                {
                    "user_id": "Casey Bates",
                    "user_href": "/profile/Casey-Bates-3"
                }
            ]
        }
    ]
}