{
    "title": "How old is planet Earth, or our Sun, or the Universe according to NASA? - Quora",
    "tags": [
        "Earth-Sun Relationship",
        "The Solar System",
        "The Sun",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ari Asulin",
                "href": "/profile/Ari-Asulin"
            },
            "answer_text": "\"I never cared much for studying Human History until I realized it was all lies\" QA Part 1: An Ancient History we can all agree on Q: How old is planet Earth, or our Sun, or the Universe according to NASA? The official answers are 4.543 Billion (Earth) 4.61 Billion (Sun) and 13.8 Billion (Universe). Q: How is the Age of a Star determined? The age of a star is primarily determined by profiling it's mass, luminosity & temperature against a standard chart of other stars. Q: Okay, then how is the Mass of a Star determined? There is no single way to determine the mass of a star. Q: What? You heard me. There's no way to know the mass of a star by looking at it. For example, we can't tell how big something is, how far away it is, or of gravitational lensing is affecting the reading. One has to make assumptions about it's gravitational pull. Q: Okay, so how is the Gravitational Pull of a Star determined? A star's gravitational pull is determined by observing \"slight variations\" in the Star's luminosity Q: Luminosity determines Mass, which paired with Luminosity & Temperature determines Age? This sounds like circular logic. Because it is. Q: And Radio-Carbon-Dating? The critics of this method point out that carbon-dating relies on the same circular logic as star-dating: One already has to have a reliable record of actual ages to base new findings on, and nobody has been around that long. Additionally, it's not difficult to find an article calling the entire field into question for various reasons. Q: So how old is the Universe? In all likelihood, the Universe was always there and always will be, much like the concept of 'Time'. Q: So how old is the Sun? I have no idea. Older than the Earth probably. We can only guess. Q: So how old is the Earth? Here we go! Every civilization on Earth has made monuments to events that occurred in our shared history. The similarities between these monuments (built by independent civilizations that typically never met each-other) provides the strongest evidence of the actual age of the Earth. However, the age of the Earth cannot be determined in Sun-Years. Q: Why can't the Earth's age be determined in Sun-Years? Before 202X years ago, the Sun was not visible to the Earth yet. This is why our Gregorian calendars start on this date. Before this date, it was not possible to have a Sun Calendar. Q: The Sun was not visible to Earth? Pardon me? Proponents of the Electric Universe Theory challenge the 'Gravity-Centric' model of the universe. They hold that the true story of Earth's origin is that it started out as a Moon of the planet Saturn at a time when Saturn was not yet part of our Sun's orbit. Here is a must-see documentary: Remembering the End of the World (Full Documentary) Q: That seems far-fetched. That wasn't a question, but yeah, sure! It seems far-fetched because we were sold something else for so long, so here's a counter-question: Why does the 4.5 billion year old Earth theory not 'seem' as far-fetched? 4.5 billion is pretty far! QA Part 2: A Modern History we can all agree on Q: Gotcha, so what part of Earth's History were we taught that isn't all lies? None of it, apparently. Q: What about the existence of Dinosaurs? They existed, and probably still exist somewhere. *BUT* the earth isn't 65 million+ years old any more than it's 4.5 billion. At any rate, 'The Dinosaurs roamed the Earth' narrative was constructed deliberately to erase the real history of 'The Giants', our ancestors. This conspiracy is well-known as The Smithsonian Cover-up. Think about this line: \"Giants roamed the Earth\" Q: What about the history of Civil Wars and World Wars? Easy: All Wars are Banker Wars. The victors (bankers) write the official history. It really is that simple. Read my theory on World War 2 here. Q: What about the history of Plagues and Mass Famine? Every genocide was rewritten later as a plague or famine. The most obvious example is The Irish Potato Famine. Humans aren't this bad at eating or staying healthy. Much like COVID-19, each famine/plague was planned in advance as a means to re-assert control over that population. Q: It sounds like you believe the real history of Earth is incredibly sad and evil. To me, it's more of an epic battle between forces of Good and Evil. Sadness and Evil are part of life, but they don't win. Q: Okay, who is this Great Evil that influenced Earth throughout history? Excellent question! I've been looking for the answer for a long time. I have concluded recently that the source of this evil has to be a break-away human civilization. I've ruled out the British, the Zionists, any Bug-like Aliens, and 'The Devil' as being the culprits. No, they were just the scape-goats. Instead, we're talking about a distant society of human-beings that has needed to continuously leach Earth's resources (and pretty women) over the last few milena. They are happy when we are obedient, but when we get too unruly, another 9/11 happens. Q: This conclusion still seems quite far-fetched. Truth may be stranger than fiction. Keep an open mind. Q: ...and where does your phantom scary break-away human cult live? Mars. QA Part 3: Wait, What? Q: Huh? Why? Maritime. Martial Law. Marriage. Marching. All of the bad things we know of are named after the planet Mars. Therefore it's possible that 'all these bad things' are actually systems of controls imposed upon us by humans who live on this planet. Q: How can humans survive on Mars? On the inside. All planets are hollow, remember that theory? Not Flat. Hollow. It's nicer on the inside, however resources are limited. This is why they have to leach off of Earth's resources. Q: How do they get supplies and people to and from Mars? CERN. The most mysterious human project ever constructed. Also the place where the Internet was invented in 1989. Coincidence? Nope. Q: CERN is a Star-Gate to Mars? How would that work? CERN colliders are essentially locations where an extremely high amount of energy is placed all at once. When this happens, a quantum entanglement is created between the source location, and wherever that energy ends up flowing towards. Therefore, so-called 'quantum tunnels' can be built between locations that have already experienced major inter-planetary electric discharge. The larger the CERN facility, the more stable the tunnel, and the more stuff can be brought through it. Obviously gates between planets are periodic, and depend entirely on the proximity of the planets to each-other. It shouldn't be a surprise that CERN is right now building a facility 6 times larger than the current one. Q: Do you have any other proof that Martians have influenced Earth affairs? Nope! All I have is conjecture. Here's some: Pyramids are man-made structures encapsulating naturally-forming periodic quantum tunnels:There are pyramid structures all over the Earth, not just in Egypt and South America.All pyramids were built around naturally occurring star-gates that no longer function today. The pyramid structure is built around the gate to make it stable and safe for passage.The first human story of slavery was the Exodus from Egypt. This was a high-profile event where humans on Mars lost control over humans on Earth due to changes occurring in the solar system. The story was later redacted to exclude most of humanity and add divine intervention.Egyptian symbols everywhere:London has a huge Egyptian obelisk moved there from Alexandria in 1877. The Vatican also has one. After the American Civil War, an Egyptian obelisk was constructed by slaves in Washington D.C. in 1884 to commemorate George Washington, the guy who fought a war against London, where the other obelisk stands.Why would two countries at war both have the same Egyptian obelisk?Even though the First Amendment of the US Constitution prohibits establishment of religious icons within the government, a pyramid with an 'All-seeing eye' appears throughout the federal government and on all United States $1 dollar bills.Predictive programming in Hollywood movies:Of all the Movies about Mars that came out of Hollywood, how many Mars movies depicted the planet as hostile to Earthlings? All of them.The movie Star Gate (1994) attempts to mithify the connection between real-life pyramids and perodic star gates into the realm of 'science fiction' and highlights the persistent confusion among historians as to who built the pyramids and how they were built and why. The movie differs from real-life by suggesting 'advanced technology' is required to build star gates. In real life, the pyramids themselves *were* the star gates, but they did not function as depicted in the movie.In the very first scene of Star Gate, during Robert California's lecture, a member of the audience laughingly suggests that 'The Martians' built the Pyramids. This interaction is predictive programming meant to provoke the viewer into subliminally considering and then dismissing the possibility of pyramids being built for inter-planetary purposes.History:Ever heard the saying: \"Beware the Ides of March\"? Needs no explanation, right?Bad things have happened on 3/11 throughout history.Delayed mars missions:A Human Mission to Mars was in the official NASA plans since the 1950s. Why then after 70 years are we no closer to an actual launch? The current most realistic earliest launch date is 2040 with an extra 10-30 years to get there. How old will you be when they land?Q: Neat. So how does this all end? This situation will continue indefinitely until two things happen. Firstly, the Humans of Earth need to get their act together and figure out what's real and what's not. That could take a while. The other thing that has to happen is World Peace on Earth. If either of these two conditions are not met, it is guaranteed that this situation will continue. So how does this end? Mars has victimized Earth for thousands of years, but if peace is achieved on Earth, then all is forgiven. Humans on Mars may fear retribution, much like the Zionists fear retribution by Palestinians. But there won't be any. We will all learn to share our resources (we already know how). There will be no scarcity (Sorry, Thanos). They'll keep getting lovely supplies shipped from Earth through the gates. They'll finally allow us to use advanced technology. They'll give up their war. ",
            "date": "Answered April 22, 2020",
            "views": "50",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Steve Ransome",
                    "user_href": "/profile/Steve-Ransome"
                },
                {
                    "user_id": "David Townsend",
                    "user_href": "/profile/David-Townsend-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Rosenberg",
                "href": "/profile/Dan-Rosenberg-8"
            },
            "answer_text": "NASA isn’t the be-all/end-all source of scientific knowledge. It’s the US space agency. The vast majority of researchers and scientists studying astronomy don’t work for NASA. I just want to correct your misconception. ",
            "date": "Answered April 22, 2020",
            "views": "44",
            "upvotes": " View 2 Upvoters"
        }
    ]
}