{
    "title": "How to download games into a TI-84 Plus CE calculator - Quora",
    "tags": [
        "TI-84 Plus",
        "Texas Instruments Products and Services",
        "TI Calculators",
        "Scientific Calculators",
        "Graphing Calculators",
        "Calculators",
        "Downloading",
        "Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Gomez",
                "href": "/profile/Kevin-Gomez-57"
            },
            "answer_text": "*A2A Download and install TI Connect™ CE Software from TI’s website.Connect your CE to your computer via the USB charging cable and make sure the software can find the calculator. You should be able to browse the variables and other data stored on the calculator.Find a game! There are many great resources for TI programs and games, including TI-Basic Developer, Cemetech, TI84CalcWiz, and ticalc.org. I’ll also do a shameless plug for some of my own games: FLOW, Mancala.Download the game (usually a .zip folder) and extract its contents to the MyTiData folder usually found under Documents (or the Mac equivalent); this is where TI Connect stores and loads content by default.Send the program (.8xp or .8xg file) to the calculator; you can do this by either clicking Send to Calculator on the main screen or selecting the option under Actions.If you downloaded a .8xg, you’ll need to Ungroup it on the calculator itself by pressing [2ND][+}[8] and selecting UNGROUP and the name of the group. Then navigate to the game program under PRGM and run it!",
            "date": "Answered April 18, 2019",
            "views": "3",
            "upvotes": " Answer requested by Ethan Dendulk",
            "upvoters": [
                {
                    "user_id": "Morgan Sinnock",
                    "user_href": "/profile/Morgan-Sinnock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adhitya Thirumala",
                "href": "/profile/Adhitya-Thirumala"
            },
            "answer_text": "Really Meredith? Pay attention in Geometry.  But actually. First you need to search up TI-84 Plus CE games. Go to the website that pops up first and download the file. Next you need to download the TI connect software on a PC or MAC. After this, connect your TI-84 to the computer using the charging cable. Open the TI-84 software and drag the entire file on to your calculator.  To play the game, you will need to enter the catalog, select Asm( and press enter After this you need to press prgm and select the game ",
            "date": "Answered April 5, 2019",
            "views": "887",
            "upvotes": " View 1 Upvoter "
        }
    ]
}