{
    "title": "How are computers made? - Quora",
    "tags": [
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter D'Agata",
                "href": "/profile/Peter-DAgata"
            },
            "answer_text": " Okay. When building a pc you are actually assembling parts. Tinkering with circuits doesn’t really come into play here. Building can still be hard but on budget builds it’s pretty simple. The first thing you need to do is familiarize yourself with the components you’ll be needing. Research what each part does. Here are your essential parts: CPU Motherboard Memory (ram) PSU (power supply) SSD (solid state drive) HDD (hard drive) Graphics Card (GPU) Case CPU fan/heatsink Case Fans Also, research monitors and their resolutions, response times, and refresh rates. Don't forget to buy your operating system! If you buy an SSD then put the OS on there. Okay, once you’ve researched what components do and hopefully learned about some specific types of parts (like DDR4 memory), it’s time to plan out your build. What are you going to do with your build? Workstation/CAD/Scientific Programs: get a cpu with more cores (6+). A good GPU is not as necessary. Gaming: Less cores and higher clockspeeds for CPU. A good GPU is needed. Light web browsing and Microsoft word: Get simple laptop (or just a low priced CPU with internal graphics) I’m going to focus of gaming PC this advice is still very useful. First, decide how much you’re willing to spend. I would start at $500 for entry level gaming that will be better than console at 1080p. All the parts can be bought new at this price point. $750 dollars is the sweet spot right now but you’ll see gaming performance improvements the more you spend (up until around $2500). I know it seems expensive but games are cheaper if you wait for the really common Steam sales and you don’t have to pay yearly for online. Remember that the monitor, keyboard, mouse, speakers, and operating system are NOT included in the price (not on build guides online either). USE PC PART PICKER TO KEEP TRACK OF COMPONENTS AND ORDER FROM NEWEGG.COM Next, choose a CPU. There are two main manufacturers of CPUs, Intel and AMD. If choosing AMD then go for the Ryzen lineup or newer (no matter what fanboys may tell you the FX series isn’t and will never be good). Use Userbenchmark to compare CPUs and GPUs. Then, choose a compatible motherboard for your CPU. If you have an unlocked CPU (like Intel’s K-Series or all of the Ryzen processors), than choose a motherboard that supports overclocking. For Intel motherboards it’s anything that starts with a Z or X (Z370, X299) and for AMD it’s anything that starts with a B or X (B350, X470), though you may see AB350 motherboards. Don’t worry AB350 motherboards support overclocking it’s just Asrock being stupid. Always make sure the VRM by the CPU socket on the motherboard has a heatsink for longevity purposes and overclocking performance. Take into consideration what features you motherboard has: DDR4 support, M.2 support (for M.2 SSDs), number of PCIe ports (for graphics cards and WiFi chips), etc. If you want a small PC then get a mATX or mini ITX size motherboard (instead of the standard ATX size). Now choose memory, 8gbs of DDR4 2133 MHz is the minimum I would recommend. 16gbs of DDR4 2667mhz or above is ideal. DDR3 is good too as long as it’s over 1600mhz. Don’t mix and match ram!!! Only use what your motherboard supports! 2 sticks of 8gb will be better than one 16gb because of dual channel. Choose a graphics card: I would recommend a GTX 1050ti or GTX 1060 3gb at a $500 dollar price point. The lowest I would go is a GTX 1050. Now, choose a case based on your motherboard size. See if it will fit your graphics card. See what kind of power supply it supports. Now choose a power supply based on how much power your system needs. Use any website that calculates it. Add around 150 watts to that estimation and buy that power supply for better efficiency and future proofing. Get a PSU with an 80+ rating. Based on your case, select case fans and plan out wchich ones will be intake and which will be outtake. Common sizes are 120mm and 140mm. Make sure your case has a fan hub (or buy one) since it is unlikely that your motherboard will support all those fans. DON’T plug your CPU fan into the fan hub!!! Now choose a CPU fan/heatsink based on how hot your CPU will run (overclocking will make it hotter) and if the heatsink will actually fit in the case (some block ram slots or are too tall and so the case side panel won’t go on). Make sure that the heatsink supports your CPU type (AM4, LGA 1151,…). The AMD CPU coolers that come in the box are excellent, but Intel’s are terrible. Not all models come with a CPU heatsink/fan. Acceptable temperatures for your CPU should be around 45 degrees (Celsius) idle and 75 degrees (Celsius) under load. Now watch some videos on how to assemble the actual PC, I don’t want to go into it here as a visual showing you what to do would be better.Hopefully I answered your question. Good Luck! ",
            "date": "Answered April 23, 2018",
            "views": "31",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chetan Singh",
                    "user_href": "/profile/Chetan-Singh-993"
                },
                {
                    "user_id": "Alex Wineburg",
                    "user_href": "/profile/Alex-Wineburg"
                },
                {
                    "user_id": "Mohammed Subhan",
                    "user_href": "/profile/Mohammed-Subhan-4"
                },
                {
                    "user_id": "David Mugi",
                    "user_href": "/profile/David-Mugi"
                },
                {
                    "user_id": "Zeke Levin",
                    "user_href": "/profile/Zeke-Levin"
                },
                {
                    "user_id": "Random Person",
                    "user_href": "/profile/Random-Person-549"
                },
                {
                    "user_id": "Edward Lee",
                    "user_href": "/profile/Edward-Lee-314"
                },
                {
                    "user_id": "Ian McKenzie",
                    "user_href": "/profile/Ian-McKenzie-35"
                },
                {
                    "user_id": "Prithvi Jamadagni",
                    "user_href": "/profile/Prithvi-Jamadagni-1"
                },
                {
                    "user_id": "Paul Nations",
                    "user_href": "/profile/Paul-Nations-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sai Teja",
                "href": "/profile/Sai-Teja-29"
            },
            "answer_text": "I think, Its just assembled after receieving parts/components , casings, beezels, other fittings from various vendors !  For example dell designs the laptop and gets memory components like RAM from samsung, hynix etc. , harddrives from samsung, seagate, toshiba, WD , intel etc., displays from LG,samsung... Graphics from ATI,AMD,nVidia, intel. Ethernet board from gigabit, qualcomm atheros.... Wifi module from broadcomm, intel centrino ....some laptops come with speakers made by harmon,beats, jbl. So they really dont manufacture everything they do more of assembly and design and what features to put in and what not to for a specific price range . ",
            "date": "Answered March 16, 2016",
            "views": "468",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mario Vulamparti",
                    "user_href": "/profile/Mario-Vulamparti"
                }
            ]
        }
    ]
}