{
    "title": "How did people do research before the internet? - Quora",
    "tags": [
        "Academic Research",
        "Research",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "David F. Prenatt Jr.",
                "href": "/profile/David-F-Prenatt-Jr"
            },
            "answer_text": "How did people do research before the internet? The term \"research\" is somewhat ambiguous, but prior to the widespread use of the Internet, many types of research took longer. Others types of research were not affected by the advent of the Internet. Still other types of research simply did not get done. In the context most relevant to the original poster's question, search engines were virtually non-existent prior to the advent of the Internet, and research was expedited by the widespread distribution of printed encyclopedias.  Encyclopedia Britannica (32 Book Set): Inc. Encyclopaedia Britannica: 9780852299616: Amazon.com: Books As late as the 1990s, I had a complete and current set of the Encyclopedia Brittanica at home, and whenever I wanted to bring myself up to speed on a topic, I would simply look up the appropriate article. I also spent a lot of time in libraries, and I would look for books, magazines, and newspaper articles that covered the topics I was interested in at any given moment. Browsing the \"open stacks\" at a library was nothing less than an adventure. You never knew what you were going to find. And then there were bookstores, which had all sorts of publications past and present that I could add to my personal library. Finally, when a topic became a serious interest for me, I would take college classes to give myself a familiarity with current mainstream thinking on that topic. In sum, it seldom took long for me to reach the limits of the general outline of the extant human knowledge on a topic, and the details could be filled in as needed by consulting subject-matter experts. Prior to the advent of the Internet, reading materials were predigested and packaged into bite size pieces that were used for library research. It has been decades since I have actually used it, but the Readers' Guide to Periodical Literature used to be one such staple. Virtually all resources like this have been replaced by electronic databases, as was the case with \"card catalogs.\" Meanwhile, long before the Internet became the de facto starting point for academic research, electronic databases like Westlaw and LexisNexis were already light years ahead of where the Internet is now with indexing and searching using Boolean queries. As it now stands, keyword-based searches on the Internet are now the norm and more sophisticated methods of Boolean search have been dumbed down. As a self-styled research consultant, I am frequently called upon to offer up answers to questions that my clients have and to provide coverage of topics that are not easily researched online, nor easily researched in traditional libraries. I specifically remember a dot-com startup by the name of Project Napa that asked me to provide an outline of topics based on biographical profiles back in the early 2000s, and I was shocked to find that no such outline existed at that time. As their \"chief ontologist and community architect,\" I came up with an outline format that in all modesty I must say was astonishingly novel, and that I have yet to see replicated anywhere else. The key to research before and after the advent of the Internet was and is an outline of knowledge, broken down into increasingly specific subtopics. Encyclopedia Brittanica had a lock on this until the 1990s, and Yahoo! (\"Yet Another Hierarchical Officious Oracle\") was the first truly successful online resource to provide such a hierarchical breakdown in the 1990s; the Open Directory Project took it to the next level with a community of tens of thousands of volunteers arguing incessantly about what topics belonged where, particularly with regard to a geographical scheme. (See Life After the Open Directory Project ). [As I alluded to above, I believe I was the first person to provide a comprehensive hierarchical breakdown of biographical profiles for the now defunct Project Napa.] Once such a high level conceptual outline is in place, subject-matter experts can be found to help fill in the gaps with original research, something that Quora does better than any other website I've encountered, something that had to be done through slow, arduous personal correspondence back in the 20th Century. ",
            "date": "Answered December 23, 2016",
            "views": "7",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Popescu",
                    "user_href": "/profile/Daniel-Popescu-18"
                },
                {
                    "user_id": "Ezzo Ali",
                    "user_href": "/profile/Ezzo-Ali"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MF-64"
                },
                {
                    "user_id": "Fled Flederino",
                    "user_href": "/profile/Fled-Flederino"
                },
                {
                    "user_id": "Surya Pali",
                    "user_href": "/profile/Surya-Pali"
                },
                {
                    "user_id": "Jennifer Hu",
                    "user_href": "/profile/Jennifer-Hu-1"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Troy Wiora",
                "href": "/profile/Troy-Wiora"
            },
            "answer_text": "I can answer this. I lived through it. We went a place called the “library.” It was full of “books” which have words and graphs like web pages, but they don't move around. Also, it was pretty difficult to make these “books” so most of what you read in them could be trusted. You also had to read about a lot of stuff you didn't necessarily care about to find what you needed, so you sometimes learned more than you wanted. That was rough. Also, at these “libraries” there were other classmates (and girls) who were sometimes researching the same stuff. Occasionally you had to share limited resources. That could lead to working together and even collaboration if you weren't careful. We also had encyclopedias, which were like someone printed the internet and put it together in a bunch (often 12 or more) of those “books” I mentioned earlier. Of course, encyclopedias had rather limited information and reading 50 books for a 3 page paper was overly time intensive (did I mention the girls?) we often filled our reports with opinions and critical examination instead of blindly rephrased quotes and lengthy reference sections. I will say this though, as someone who has gone to school in both epochs, research was harder back then, but we also didn't have a paper due every week. I think we may not have learned as much, but we learned it deeper, if you know what I mean. Although, I will say, nothing beats being able to sit down at your dinner table with a bowl of Captain Crunch, two hours before your paper is due, and have every reference material on Earth available to you. ",
            "date": "Answered December 17, 2016",
            "views": "37",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abdallah Mughrabi",
                    "user_href": "/profile/Abdallah-Mughrabi-1"
                },
                {
                    "user_id": "Pete Moore",
                    "user_href": "/profile/Pete-Moore-34"
                },
                {
                    "user_id": "Blake Senftner",
                    "user_href": "/profile/Blake-Senftner"
                },
                {
                    "user_id": "Daniel Popescu",
                    "user_href": "/profile/Daniel-Popescu-18"
                },
                {
                    "user_id": "Darshan Desai",
                    "user_href": "/profile/Darshan-Desai-61"
                },
                {
                    "user_id": "Fled Flederino",
                    "user_href": "/profile/Fled-Flederino"
                },
                {
                    "user_id": "Surya Pali",
                    "user_href": "/profile/Surya-Pali"
                },
                {
                    "user_id": "Tim Hanson",
                    "user_href": "/profile/Tim-Hanson-4"
                },
                {
                    "user_id": "Roger Duwe",
                    "user_href": "/profile/Roger-Duwe"
                },
                {
                    "user_id": "Rynnah Lim",
                    "user_href": "/profile/Rynnah-Lim"
                }
            ]
        }
    ]
}