{
    "title": "How to transfer from a community college to another community college - Quora",
    "tags": [
        "College Transfers",
        "Community College",
        "Advice",
        "The College and University Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joel Goldstein",
                "href": "/profile/Joel-Goldstein-7"
            },
            "answer_text": "The rules may vary by jurisdiction, but certain factors should be common to most schools:1) Meet with the Business Financial Aid Office at your old school to complete exit counseling. Address any issues related to an outstanding balance.2) Complete any classes with your current school. Focus on classes likely to transfer to the new school.3) Contact the Admissions Department at your new school. Make sure they are aware of your current school.4) Complete any required Financial Aid applications at your new school. You may need to wait until you compelte your final classes at your previous school.5) Order official transcripts from your current school and send them to your new school. You may need to do this twice to get you credit for your final classes.6) Closely monitor the transferred credit process. You want to transfer as many credits as possible. Be aware there are numerous rules; for example, my school requires students to take 6 classes at our school to complete an Associates and therefore can only accept up to 14 of 20 classes. Also be aware some schools are more cool than others. Bottom line: most community colleges are relatively cool about transferrig to other schools. It is part of their mission. You will need to jump through hoops. Both schools will have people who can help you through the process. ",
            "date": "Answered October 15, 2016",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paz Zait-Givon",
                "href": "/profile/Paz-Zait-Givon"
            },
            "answer_text": "When I was in community college there where several people who went to several community colleges at once in order to get the classes they needed. It may have been simplified by the fact that many of these community colleges where in the same district.  Also rules may be different in different places, from personal experience though just make sure that all your courses are transferable from whichever to the other (preferably both ways) and know which one you will be getting any degree or certification from so who you have to get to transfer your records to the other one. You have to apply and register for both as others here have pointed out in great detail but it is relatively common and not uncommon to be enrolled in several concurrently either. I finished off my IGETC (general education requirements transferable to most state schools) by taking several classes in a different Community College than the majority of my work was at. the most painful thing about it was double and triple checking that the courses would transfer correctly and trying to deal with different rules for residency at the other Community College Disclaimer: this is a personal experience from the community colleges around the Los Angeles area, different areas may be different. ",
            "date": "Answered October 29, 2016",
            "views": "851",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joel Dykstra",
                "href": "/profile/Joel-Dykstra-1"
            },
            "answer_text": "This is a pretty common thing. You pretty much just have to apply to the next school and transfer any transcripts and financial aid information to the new school. There may be a few additional steps depending on the two schools but there’s really no trick to it. Keep in mind though that sometimes you may end up dealing with out of district or out of state tuition depending on where you are going. Also keep in mind that community colleges only offer two-year degrees so don’t plan on being there forever. ",
            "date": "Answered October 16, 2016",
            "views": "343",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Diana Barbu",
                "href": "/profile/Diana-Barbu-3"
            },
            "answer_text": "What you’d like to do is called lateral or horizontal transfer. The problem with this is that there are several variables in play - are both CC in the same state, which agency accredits them, transfer agreeements, etc. Go here to learn more about lateral transfer and transfer agreements: www.thehighedprofessional.com/blog ",
            "date": "Answered December 9, 2016",
            "views": "844",
            "upvotes": "0"
        }
    ]
}