{
    "title": "How to get a job without a degree in the IT field - Quora",
    "tags": [
        "Jobs and Careers at Specific Information Technology Companies",
        "IT Companies",
        "Job Search Advice",
        "Job Searches",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hridaynath Pawar",
                "href": "/profile/Hridaynath-Pawar"
            },
            "answer_text": "I am assuming that you have at-least completed your graduation. Join some computer foundation courses. you can take some foundation courses online from Coursera | Online Courses From Top Universities. Join for Free or edX . This courses are totally free of cost. If you want to take certificate from them then you will have to pay some small amount of money (actually this will good for you to purchase the courses but first take all the course for free, understand all of the course and when you feel you are confident enough to chase their exams then purchase the course and link this certificates to you resume and linkedin account) after some of foundation course do research - which are the most demanding skills in market or which skill you would like to improve. Take those courses again from the same online, or if there is good institute out there take your course from them. while doing this courses or after this courses improve your skills by taking online coding challenges competitions. Start appearing for interviews you will definitely get employed. Best of luck! Upvote if you like this answer. ",
            "date": "Answered December 7, 2016",
            "views": "257",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Biplab Acharjee",
                "href": "/profile/Biplab-Acharjee"
            },
            "answer_text": "Without Degree getting a job is little bit difficult. If you are asking for reputed IT companies than I must say it’s not possible with out a strong recommendation. If you have minimum of class 12th pass qualification you may try for small IT sectors. Best way to be stable without degree do freelancing. You can check today's recruitment notification here ",
            "date": "Answered December 8, 2016",
            "views": "106",
            "upvotes": "0"
        }
    ]
}