{
    "title": "How much do humans understand about themselves? - Quora",
    "tags": [
        "Self-Awareness",
        "Humans ",
        "Understanding and Comprehension",
        "Behavioral Psychology",
        "The Human Race and Condition",
        "Understanding Human Behavior",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "That would depend a great deal on the individual human. Some folks are intensely interested in the variety of things we might learn about ourselves. The biology of our bodies. Our evolutionary history. Our characteristics and behaviors. Our psychology and the way our brains work…. Etc, etc. As well, the things we humans get up to like arts and warfare and diplomacy and exploration….. I’m interested in all these things, and I have an excellent general notion of what it involves to be a human being. But lots of folks have little or no interest in any of these things. They couldn’t tell you the most basic facets of our biology, they don’t understand (or don’t believe) our evolutionary history….. They don’t pay any attention to the arts and sciences, perhaps beyond what they watch on TV….. They may simply be involved in the daily affairs of living, of their jobs, their family life, etc…. With little room for intellectual exploration. So a lot of folks don’t understand very much about themselves at all. ",
            "date": "Answered October 15, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dorina Mans",
                "href": "/profile/Dorina-Mans"
            },
            "answer_text": "Not much! The trick is that understanding and accepting who we are comes with a lot of pain. We do not like that! But it is totally worth it. ",
            "date": "Answered October 14, 2020",
            "views": "12",
            "upvotes": "0"
        }
    ]
}