{
    "title": "How to read the latest technology news online - Quora",
    "tags": [
        "Latest News Online",
        "Tech Blogs and Websites",
        "Tech News and Journalism",
        "Latest Technology",
        "News Websites",
        "Technology Trends",
        "Website Recommendations",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arvind Kumar",
                "href": "/profile/Arvind-Kumar-12468"
            },
            "answer_text": "reading technology news in recent am is very easy if you love to read technology NEWS 10th you can follow Google news feed or you can search technology news on Google search bar there is different different site News, Technology available that provide latest technology news. if you want to love to read about smartphone then smartly search on Google technology news about smartphones are you want to read about other gadgets like laptop computer operating system you can search on Google. ",
            "date": "Answered July 19, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ngeendina Uusiku",
                "href": "/profile/Ngeendina-Uusiku-1"
            },
            "answer_text": "The rise of online publications and blogs has resulted in a flood of informatin regarding Computers mobile gadget, software and operating where can read the latest technology online. e.g social recap, the  http://netwob.com ,  The most secure collaboration platform · WireBusiness chats, one-click conference calls and shared documents — all protected with end-to-end encryption. Welcome to the most secure collaboration platform.http://wire.com ,  Gizmodo | We come from the futureWe come from the future.http://Gizmodo.com ,  MashableMashable is a global, multi-platform media and entertainment company.http://Mashable.com , the verge.com Digital Enterprise Cybersecurity Solutions and manies ",
            "date": "Answered July 22, 2020",
            "views": "17",
            "upvotes": "0"
        }
    ]
}