{
    "title": "How to register a company in Shenzhen, China - Quora",
    "tags": [
        "Shenzhen, Guangdong, China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kai Huang",
                "href": "/profile/Kai-Huang-29"
            },
            "answer_text": "I’d assume you are speaking of as a foreign national who wish to start a business in China. In Shenzhen or Generally speaking in China, every company that is controlled by a quota equal or superior to 25% by foreigners is considered a FIE (Foreign Invested Enterprise). Among the FIE there are two most common types of entity: WFOE (Wholly Foreign Owned Entity), and the Joint-Venture. WFOE (Wholly Foreign Owned Entity), that is, as the name suggests, a legal entity completely owned by foreigners. The type of WFOE used in the great majority of cases is the LLC (Limited Liability Company), where the responsibility (or “liability”) of each partner is limited to the capital they invested in the company (as in the US or in Europe). This is also the amount of registered capital required by the local government when submitting company registration application. The Joint-Venture, on the other hand, is a company controlled by both foreign and Chinese partners. If you want to operate your business in a “restricted” industrial sector considered by the government (such as mobile and data service in telecommunication,development of pieces of land in real estate industry), a Joint-Venture is your only option. Likewise, there are also industries which are “encouraged” or completely “prohibited” for foreign investment. For detailed information, please refer online to Catalogue for the Guidance of Foreign Investment Industries by the ministry of commerce in China. It is highly advised to seek the help from a trustful professional when deciding to incorporate your business in China. It’s even much more so when it comes to the corresponding legal and fiscal matters. By the way, our company China SourceLink is a company based in Shenzhen which provides professional service in incorporating business in China. Feel free also to check out the article from our blog for more detailed information regarding the procedure in company registry in China. Steps to company registration in Shenzhen Best Regards, Kai CEO and Founder Shenzhen Sourcing Agent - China Sourcing Services | China SourceLink ",
            "date": "Answered August 30, 2017",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zhengcheng Gu",
                    "user_href": "/profile/Zhengcheng-Gu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gavin Lewis",
                "href": "/profile/Gavin-Lewis-24"
            },
            "answer_text": " 1, the company name, check in shenzhen in the name of the company's registered name check requirements provided contains two or more Chinese, and the new rules are the same industry as long as the two words like cannot be registered, so Hong Kong hengye international remind everybody in preparation for the name of the company, it is best to prepare standby, prevent the first inspection found that do not conform to the requirements or has already been registered. 2, provide the company address by name after verification, you need to provide a business address for company address, civilian residential address is not allowed to used as the company's registered address, business address must be a commercial office properties, if it is registered in shenzhen agent institutions, can ask agency to provide alternative registered address, may collect some fees, but they are not high, in the absence of public address, this is the fastest way. 3, making the company's articles of association if there is a legal personnel, will start work on the company's articles of association, or can be directly in the industrial and commercial online download a copy of \"the company's articles of association\", the content make the changes to become what they need, print it out and sign in the articles of association of the last all shareholders. 4, enterprise network registration everything is completed, the net do enterprise of industry and commerce registration, including check through the joint venture company name, registered capital, a legal person shareholders proportion and position, the main information such as the company's registered address. 5, pay for results in the industrial and commercial web booking/parts and in strict accordance with the appointment time to pay, to industrial and commercial bureau need to provide the material needs to be done institutional shareholders parties, containing the above mentioned: legal person id original shareholders, the company's articles of association, the shareholders' committee resolution, the registered address proof. 6, henceforth have its official seal of the shenzhen company registration time from a start, industrial and commercial bureau to accept, after 5-7 working days can get the business license, then need to public security bureau certification seal company henceforth have its official seal. 7, the land tax registration, tax work company set up to the local taxation bureau within 15 working days after successful registration, and before the 15th of each month do declare the above process for personal registration process, all the time and you need to do to set may be more, if the time arrangement not to come over or more anxious need, we will suggest you to find a professional agent company registration institution, the shenzhen market supervision and administration, encourage enterprise or individual entrusted agency registration, this will allow you to save most of the time and improve the pass rate PCB assembly company ",
            "date": "Answered April 6, 2017",
            "views": "890",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Taiwo Imani",
                    "user_href": "/profile/Taiwo-Imani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Coco Zhang",
                "href": "/profile/Coco-Zhang-46"
            },
            "answer_text": "First, choose investor: foreign company, hk company or foreign individual. Second, prepare the investor notarization in China embassy overseas if you choose foreign company or hk company as the investor. If you use forgin individual investor as the investor, You can save the passport notarization by coming to China directly and stay here for around 3–4 working days to do the passport certification inside of China. Third, name-checking. Fourth, legal file drafting. Prepare FSR(Feasibility study report.) and fill in related registration forms. Fifth, pick up the business license and chops. Sixth, opening the bank account. ",
            "date": "Updated June 25, 2018",
            "views": "564",
            "upvotes": "0"
        }
    ]
}