{
    "title": "How often should you completely discharge a smartphone battery to maximize battery life? - Quora",
    "tags": [
        "Smartphone Battery Life",
        "Smartphone Batteries",
        "Battery Life",
        "Batteries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chuck Rogers",
                "href": "/profile/Chuck-Rogers-1"
            },
            "answer_text": "Thanks for the A2A. You should NEVER, EVER completely discharge a smartphone battery. That will shorten its life. Smartphones use Lithium Ion (or Lithium Polymer) batteries. They do not like to be completely discharged or completely charged. There are dozens — if not hundreds — of questions with answers regarding smartphone battery use on Quora. I have I get better results doing a Google search than search on Quora. Here’s a search link for you: site:quora.com smartphone battery charging Also, here are a couple of my answers to related questions: Chuck Rogers's answer to Is it true that you need to unplug your iPhone when it reached 100% and if not, will it really 'stress' the battery? Chuck Rogers's answer to Can charging an iPhone too often damage it? ",
            "date": "Answered September 25, 2019",
            "views": "258",
            "upvotes": " Answer requested by Jim Cobb"
        },
        {
            "author_info": {
                "name": "Ben Guy-Williams",
                "href": "/profile/Ben-Guy-Williams"
            },
            "answer_text": "Never. If your phone can last all day, that’s good. If it can’t, then carry a powerbank if you’re not in a position to give it a boost as it goes down below 50%, certainly by 30%. To limit stress, don’t be so keen to keep charging past 80%-90% because I think the last 10–20% charge does put just a tiny stress on the battery, but not enough to worry about. Check out the cost of replacing a battery after 4 years. I think this small cost/budget outweighs nearly everything you can do to extend the life except for avoiding obvious abuse (like fast charging in hot environments, or posting the phone against a hot windscreen in the sun when using GPS). ",
            "date": "Answered September 25, 2019",
            "views": "101",
            "upvotes": " Answer requested by Jim Cobb"
        }
    ]
}