{
    "title": "How do we ensure we're developing an app right? - Quora",
    "tags": [
        "Mobile Application Development Services",
        "iOS Application Development",
        "Mobile Application Development",
        "Software and Applications",
        "Startup Strategy",
        "Web Development"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Goodman",
                "href": "/profile/Robert-Goodman-50"
            },
            "answer_text": "My business tends to focus more on finding coders who will develop an app right, but I’ve had people hire me to “audit” their app process. Here’s some of the things you should look for: Clarity. Has the developer been given a clear plan so that there’s no doubt in his mind on what he’s supposed to do? One of the common failure points for a project is unclear instructions to the developer.Consistency. Has that plan stayed mostly the same throughout the process? Obviously there’s going to be some changes. But if your plan is constantly changing in major ways throughout development, it’s going to mean trouble.Communication. Are you talking regularly with your developer? Do you know what they’re doing? Equally importantly, do they feel able to talk to you about problems? This can be important. If there’s a feature that’s taking a long time to develop, changing it or removing it could speed up development. That’s not a decision your developer can make; he can only go by your plan. But if he talks to you about it, you can change that part of your product plan.Hiring. This is basically what I do, and I could talk a lot about it. I’ll just sum up and say that you should take your time, and don’t hire the cheapest guy. There’s a reason why he’s the cheapest guy. Hiring’s an important decision, do it right. Also, don’t hire a giant team all at once. Hire one person or a small group, and add more people ONLY if you have a reason to do so.Code Quality. I do this during my interview process. Look over the developer’s code for your app if it’s underway. If you’re hiring, look at code from their previous work. What you want to do is make sure that the developer writes clean, maintainable code. If you aren’t from a tech background, get someone who is to take a look.More Communication. This is important enough to say twice. If you’re wondering if your development process is going well, ask your developer. Obviously, if they’re dishonest they won’t tell you the truth. But there are a lot of development issues that don’t involve dishonesty, and if you know about them, you might be able to find a solution together.Hope this helps! ",
            "date": "Answered May 13, 2020",
            "views": "48",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Evangelos Stromatias",
                    "user_href": "/profile/Evangelos-Stromatias-1"
                },
                {
                    "user_id": "Ali Guillen",
                    "user_href": "/profile/Ali-Guillen-1"
                },
                {
                    "user_id": "Jeremy Ferguson",
                    "user_href": "/profile/Jeremy-Ferguson-18"
                },
                {
                    "user_id": "Shubhamkar Ayare",
                    "user_href": "/profile/Shubhamkar-Ayare"
                },
                {
                    "user_id": "Ashok Kumar",
                    "user_href": "/profile/Ashok-Kumar-12644"
                },
                {
                    "user_id": "Yatin Gupta",
                    "user_href": "/profile/Yatin-Gupta-20"
                },
                {
                    "user_id": "Devon Tingley",
                    "user_href": "/profile/Devon-Tingley-1"
                },
                {
                    "user_id": "Sandeep Mishra",
                    "user_href": "/profile/Sandeep-Mishra-13"
                },
                {
                    "user_id": "Anmol Gupta",
                    "user_href": "/profile/Anmol-Gupta-85"
                },
                {
                    "user_id": "Derek Baker",
                    "user_href": "/profile/Derek-Baker-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Garry Taylor",
                "href": "/profile/Garry-Taylor-5"
            },
            "answer_text": "If you have an app under development, and you’re not sure how it’s going, you might just want to employ a senior developer for a few hours, just to have them look over your code. In a few hours, they’re not going to transform a mess into a great app, but they’ll be able to tell you if you code at least meets a minimum quality, and if the way it’s being written is reasonable. ",
            "date": "Answered April 25, 2020",
            "views": "21",
            "upvotes": " View 37 Upvoters "
        }
    ]
}