{
    "title": "How to start in digital forensics - Quora",
    "tags": [
        "Digital Forensics",
        "Forensic Science",
        "College Advice for Careers",
        "Technology",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rosa Velvet",
                "href": "/profile/Rosa-Velvet"
            },
            "answer_text": "Unlike ethical hacking where there are a lot of great resources (blogs, books, conferences, etc.) I find that Digital Forensics is a bit left out sometimes.. SANS does great stuff (from cheatsheets to actual courses) but their material can be a bit outdated sometime (how to use log2timeline for instance). I would start with reading practical malware reverse engineering (AWESOME book), then maybe the art of memory forensics. If you want to feel how a real crisis is lived by both the analyst and the company suffering the breach, then there is probably no book better than “How to Investigate Like a Rockstar”. It sums up all the techniques available in the wild to create a captivating scenario both fun and technical. Plus it talks about investigating a Mainframe, so you can hardly top that.. https://books2read.com/u/4jDWoZ  ",
            "date": "Answered June 20, 2018",
            "views": "704",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Celina Harris",
                    "user_href": "/profile/Celina-Harris-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Cortez",
                "href": "/profile/Paul-Cortez"
            },
            "answer_text": "What you'll frequently find in the forensics career marketplace right now is that a lot of companies are in the midst of trying to learn exactly how much they don't know. They are scrambling to put forensics capabilities in place where little, to no, capability previously existed. Consequently it's not enough to hire someone who knows how to do forensics per se but what are needed are people who know how to stand up or build up forensics programs and processes in addition to the technical know how. This means a stronger candidate for a job is one who has some familiarity with either project management or program development in addition to the technical skill sets.  As much as you would probably like to be done with schooling it wouldn't hurt to look into some additional certifications that will augment your degree-related training with some familiarity in projects or management thereof. Off the top of my head I would suggest the Associate-level certification programs for Certified Information Systems Security Professional (CISSP Associate) and Project Management Professional (Certified Associate in Project Management) until such time as your CV allows you to acquire the full certifications for both. ",
            "date": "Answered November 16, 2015",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Taelur Myers",
                    "user_href": "/profile/Taelur-Myers"
                },
                {
                    "user_id": "Prasanna Karthikeyan",
                    "user_href": "/profile/Prasanna-Karthikeyan"
                }
            ]
        }
    ]
}