{
    "title": "How to get the instrumentals for a song - Quora",
    "tags": [
        "Instrumental Music",
        "How-to Question",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manuel Aguilar",
                "href": "/profile/Manuel-Aguilar-45"
            },
            "answer_text": "You can easily find hit instrumentals at YouTube. For example, fill your YouTube search with Dua Lipa New Rules instrumental or Charlie Puth Attention instrumental and you got it. Just remember that those instrumental often have copyright, that is to say that some record label is the owner of those tracks. So, you can use it for practicing, but not for releasing as a cover with your voice on top. At Youtube, there are lot of instrumentals produced by individuals that allows you to use them for free of paying a small amount of money. I know that there are a lot of programs for downloading tracks from YouTube , but it’s important to remember that downloading contents from YouTube to your hard disk is ILLEGAL. Youtube is a streaming service, and the record companies and authors have licensed them just for doing it : streaming, not downloading, that’s all. If you pay for the Premium service you can download the clips and tracks , but they remain in the app not in your hard disk. If you are planning to relase some cover of any popular song, better try to get the Midi files of the song load it into your DAW. ",
            "date": "Answered February 9, 2020",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexander Lee",
                "href": "/profile/Alexander-Lee-梅治-新太"
            },
            "answer_text": "→Where can I get instrumentals to songs?  Musescore is a great place to find instrumental arrangements and transcriptions of songs. The nice thing about it is that it’s free, and you can download sheet music, .midi files, and .mp3 files. The downside is that most of those arrangements/transcriptions are made by… teenagers. They’re not arranged or transcribed by professionals, so if that’s what you’re looking for, Musescore isn’t the best place. YouTube has its fair share of transcribers and arrangers as well, and some of them are professionals. However, many of them don’t allow you to download sheet music or .midi files for free. You could always search on Google for instrumental covers of lyrical songs, and you’ll find professionally arranged/transcribed sheet music—although, most of them are not free. ",
            "date": "Answered September 26, 2017",
            "views": "63",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carlos Silva",
                    "user_href": "/profile/Carlos-Silva-574"
                },
                {
                    "user_id": "Elena Kovacevic",
                    "user_href": "/profile/Elena-Kovacevic-1"
                },
                {
                    "user_id": "Adityaraj Singh",
                    "user_href": "/profile/Adityaraj-Singh-3"
                },
                {
                    "user_id": "Funsho Olaniyi",
                    "user_href": "/profile/Funsho-Olaniyi"
                },
                {
                    "user_id": "Mateo Candelaria",
                    "user_href": "/profile/Mateo-Candelaria"
                },
                {
                    "user_id": "Harriet Gesare",
                    "user_href": "/profile/Harriet-Gesare"
                },
                {
                    "user_id": "Isaiah Davis",
                    "user_href": "/profile/Isaiah-Davis-9"
                },
                {
                    "user_id": "Abdulilah Azzazi",
                    "user_href": "/profile/Abdulilah-Azzazi-1"
                },
                {
                    "user_id": "Frank Wei",
                    "user_href": "/profile/Frank-Wei-19"
                },
                {
                    "user_id": "Emily Cendejas",
                    "user_href": "/profile/Emily-Cendejas-1"
                }
            ]
        }
    ]
}