{
    "title": "How will industry 4.0 affect us? - Quora",
    "tags": [
        "Fourth Industrial Revolution",
        "Future of Work",
        "Industrial Revolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jayesh Pai",
                "href": "/profile/Jayesh-Pai-1"
            },
            "answer_text": "• Digital Factories will create New business opportunities • A more efficient value chain • Data-driven strategy and business models • A rising need for skills-based training and talents Other benefits: Cost savings through better use of resources of 30%,The cost savings achieved by optimizing material flows 35%,Reduction of the number of machines, tools and workplaces by 40%,Total manufacturing production growth of 15%,Reduce time to market for new products by 30%Industry 4.0 will make manufacturing more efficient and productive. By optimising factories, it will directly improve yield. On the product side, it will also extract greater value from data for usage-based design and mass customisation, which in turn will open the way to new markets. On many levels, it will completely change the business model to an outcome-based approach. Automation, connectivity and embedded software can increase production line productivity by up to 30%. The shift from selling products to selling measurable outcomes will redefine whole industry structures. This is the shift to servicitisation, whereby companies are using the Internet of Things (IoT) to find new ways to grow revenue and increase profits. Industrial equipment manufacturers sell outcomes, like machine hours or price-per-user, rather than just products. For the customer it means less disruption, increased uptime, incremented factory yield and ultimately higher satisfaction. On the marketing level, mass customisation and the interconnectivity of the products will open up new markets. On the level of monitoring and operational efficiency, sensors can enable organisations to monitor assets, from elevators to shipping containers, in near real time – analysing data still in motion, not at rest – for predictive failure prevention. Manufacturers can remotely monitor the condition of equipment and look for indicators of imminent failure – for example, vibration, temperature, or pressure outside normal limits. This means that the manufacturer can make fewer visits, reducing costs and freeing up employees. ",
            "date": "Answered February 9, 2017",
            "views": "35",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tee Yan Nee",
                    "user_href": "/profile/Tee-Yan-Nee"
                },
                {
                    "user_id": "Kie Yip",
                    "user_href": "/profile/Kie-Yip"
                },
                {
                    "user_id": "S Taylor",
                    "user_href": "/profile/S-Taylor-8"
                },
                {
                    "user_id": "Suresh Somalla",
                    "user_href": "/profile/Suresh-Somalla"
                },
                {
                    "user_id": "Gonçalo Hall",
                    "user_href": "/profile/Gonçalo-Hall"
                },
                {
                    "user_id": "Milan Matejic",
                    "user_href": "/profile/Milan-Matejic-4"
                },
                {
                    "user_id": "Serkan Unsal",
                    "user_href": "/profile/Serkan-Unsal-1"
                },
                {
                    "user_id": "Raghava Sarma",
                    "user_href": "/profile/Raghava-Sarma-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruno Forkuoh",
                "href": "/profile/Bruno-Forkuoh"
            },
            "answer_text": "Industry 4.0 will enhance production by integrating and automating processes or machines and optimising production flow, which will lead to greater efficiency. It will also change traditional relationships among suppliers, producers, and customers as well as between humans and machines because of seamless flow of information and data. Here below are four areas that will be vastly affected by Industry 4.0: 1. Increase in productivity Industry 4.0 technologies will not only be used by organisations as a set of tools for continuous improvement activities but they will also have a major impact on the potential opportunities that will allow the creation of new business models and new organisations. 2. Jobs - New skills and professions It will involve the creation of new profession and therefore new skills will be required. However, this has the potential to create unemployment amongst low skilled workforce that perform repetitive tasks that are most likely to be automated. How it will affect unemployment will differ from country to country depending on the amount of jobs occupied by low skilled work force. 3. Reduction of emissions and waste It will deliver sustainable benefits such as reduction of emissions and waste as organisation will have greater ability of monitoring and collecting information in regards to consumption for analysis that will lead to improvements in efficiency. 4. Impact on society It will have both a positive and detrimental impact on society. It will improve employee health and safety because dangerous tasks can be performed by autonomous robots but at the same time it will bring many challenges and limitations as it will reduce employment and create information security issues due to the large amount of personal data being collected (this is already a major concern) ",
            "date": "Answered June 1, 2020",
            "views": "166",
            "upvotes": "0"
        }
    ]
}