{
    "title": "How close are we to run out of renewable energy resources? - Quora",
    "tags": [
        "Renewable Energy",
        "Sustainable Technology",
        "Alternative Energy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaron Dahlen",
                "href": "/profile/Aaron-Dahlen"
            },
            "answer_text": "The energy of the sun was stored, converted, and utilized directly on a planet-wide scale. All Earth turned off its burning coal, its fissioning uranium, and flipped the switch that connected all of it to a small station, one mile in diameter, circling the Earth at half the distance of the Moon. All Earth ran by invisible beams of sunpower. Hello Shivam, That quote is from a short story called The Last Question by Isaac Asimov.[1]I like it because it provides many different ways to look at your question. A simple answer is to state that we will never run out of renewable energy. Or, at least it is not something humanity will ever need to worry about, unless that is, we can reach to the stars as suggested by Asimov. A more nuanced answer would ask you to consider that there are two sides to renewable energy: input: solar, wind, and watercollector: the solar panels, wind turbines, and water machinesWhile the input side of the equation may be considered infinite, the collector side is bound by all to real human problems. Specifically, our renewable energy collectors are bound by the constraints of economics, politics, and competing land use. For example, we have nearly run out of hydro. We have already built dams on most of the world rivers. Yes, we will build more, but not to any significant degree. We could make a similar argument for wind a solar. These resources also have an unequal distribution across the world. Solar and wind can and should be built in places rich in these renewable resources. On the other hand, the economics are unlikely to support renewable installations in places with poor resources. It’s not clear that we could economically build power lines to get out of this situation. How close are we to run out of renewable energy resources? When we put this all together, we can see that there will come a day when we will run our of places to economically build solar. For a specific answer, you may want to look at Aaron Dahlen's answer to What is solar’s razor?. There, I suggest that the answer is related to the capacity factor of the renewable resource in a particular region. As a general statement, it looks like we can and should install more renewable system in many regions. However, there is every reason to keep an eye on things as you suggest in your question. Sincerely, APDahlen Footnotes[1] The Last Question -- Isaac Asimov",
            "date": "Answered January 4, 2020",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Stephen Fish",
                    "user_href": "/profile/Stephen-Fish-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Bernal",
                "href": "/profile/Robert-Bernal"
            },
            "answer_text": "Never (or until the sun gets too hot for Earth, which will be in “only” a few hundred million years, not a few thousand million years because it will get too hot in about 10x less time than it takes to “bloat up”). If we build up clean solar energy and lots of HVDC powerlines to distribute it, we will subsequently become a space faring race, capable of amassing thousands of present day energy demands (mostly to be consumed off planet, of course). However, economic upheaval caused by the haphazardly lopping in of mandatory clean energy with non mandatory political restructuring could cause us to “run out of” the economic ability to build global clean energy collection, storage and distribution. Energy security is vastly more important than the divisionary tactics of a pet political structure! Hence, we still have the possibility of plunging ourselves into the doomsday scenario of energy scarcity and the resulting economic ruin into an overheated biosphere. ",
            "date": "Answered January 4, 2020",
            "views": "43",
            "upvotes": "0"
        }
    ]
}