{
    "title": "How to remove dump files from Android phones - Quora",
    "tags": [
        "Dump Files",
        "Android Operating System Advice",
        "Smartphone Advice",
        "Mobile Phones",
        "Android Devices",
        "How-to Question",
        "Android (operating system)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bosskie",
                "href": "/profile/Bosskie"
            },
            "answer_text": "Open the phone dialer, dial *#9900# and select the 2nd option “Delete dumpstate/logcat” in the prompted menu. Select ok to 'Delete Dump' and hit exit. This will restore heaps of storage space by deleting all the log files in the device memory. These apps like Clean Master are not meant to increase your performance or battery life in anyway. Please stop using these kind of apps. Android's RAM Management and Cache management system are rock solid. Manual Cache clearing is ofcourse good but there is no need of a separate app for it. These apps may clear out even the essential processes of the OS and restarting them is a big overhead. ",
            "date": "Answered June 28, 2017",
            "views": "139",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "رحيق الازهار",
                    "user_href": "/profile/رحيق-الازهار"
                },
                {
                    "user_id": "Ahamed Dyabala",
                    "user_href": "/profile/Ahamed-Dyabala"
                },
                {
                    "user_id": "Marcus Mountstephen",
                    "user_href": "/profile/Marcus-Mountstephen"
                },
                {
                    "user_id": "Shine Abass",
                    "user_href": "/profile/Shine-Abass"
                },
                {
                    "user_id": "Sean Pai",
                    "user_href": "/profile/Sean-Pai-1"
                },
                {
                    "user_id": "Anandh Harish",
                    "user_href": "/profile/Anandh-Harish"
                },
                {
                    "user_id": "Buddha Ps",
                    "user_href": "/profile/Buddha-Ps"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Kumar",
                "href": "/profile/Aditya-Kumar-3347"
            },
            "answer_text": "I suppose you are talking about Bloatware. Bloatware are the apps that come pre-installed in a phone. You can easily uninstall any app downloaded from Play Store But, In the case of bloatware that were pre-installed, uninstallion isn't possible unless your device is rooted. Which I won't recommend because rooting your device voids its warranty and there's also risk of losing data and bricked device. Easiest thing you can do right now: Go to settings/Manage Applications Select the applications which you don't want and Disable them. However, it merely hides those annoying apps but that's the least you can do currently. Peace ☮️ ",
            "date": "Answered October 11, 2019",
            "views": "24",
            "upvotes": "0"
        }
    ]
}