{
    "title": "How good is the new 2020 iPad Pro? - Quora",
    "tags": [
        "iPad Pro Announcement",
        "iPad Pro",
        "iPad",
        "Apple (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aditya Khurana",
                "href": "/profile/Aditya-Khurana-52"
            },
            "answer_text": "The new iPad Pro models were announced on March 18. The actual iPad Pro 2020 release date was March 24, however the actual date of the sale of the same at online stores in US was March 25th. The display is very much identical to the iPad Pro 2018 – TrueTone technology, 120Hz fluid-scrolling display and high-resolution pixel sharpness. The TrueTone display produces color quality to make viewing a much more enjoyable and comfortable experience, while the fluid scrolling makes circumnavigating the tablet, and browsing websites much smoother. Moving on to the basic features of the iPad Pro 2020, one of the biggest upgrades in the iPad Pro 2020 is the Magic Keyboard for a proper typing experience that brings the iPad Pro very close the a MacBook and one would actually have to wonder looking at the iPad Pro if the company is looking to merge that with the MacBook. One of the other main reasons for buying this device would be the iPadOS 13.4, which comes with support for trackpads and mice.  While, earlier one had to hook up a mouse that had come with the 2019’s launch of iPad OS 12, that could be enabled in the Accessibility section, now this particular functionality is completely built in, making it much easier for the user. The cursor is a small round circle. As per company claims, this cursor isn’t the same as a MacOS pointer, rather it’s a circle that will dynamically change to a regular text cursor when the user hovers it over a text. The iPad Pro used the A12Z Bionic chipset, which is said to be just 1% faster than the previous iPad Pro from 2018, which is disappointing. 2018’s iPad Pro was powerful, and the new model doesn’t add much to it.  Apart from these, the camera configuration of the iPad Pro 2020 deserves a mention here. It is probably the only new feature that’s worth talking about- although it doesn’t seem like much of an upgrade either. There are two sensors on the rear; 10MP (f/2.4) and 12MP (f/1.8) respectively. The quality of the pictures in bright light is just fine, although the image quality can’t be matched with those of iPhone 11 or iPhone 11 Pro. If you are looking for an iPad, I would still suggest you get the iPad Pro 2018 for less money. With the basic features and the specifications, it is a little hard to see anything extra or new that the latest model of iPad provides. ",
            "date": "Answered July 20, 2020",
            "views": "51",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eythan Zerad",
                    "user_href": "/profile/Eythan-Zerad"
                },
                {
                    "user_id": "Priyanka Chopra",
                    "user_href": "/profile/Priyanka-Chopra-133"
                },
                {
                    "user_id": "Mehvish Asif",
                    "user_href": "/profile/Mehvish-Asif"
                },
                {
                    "user_id": "Nicholas Xaverius",
                    "user_href": "/profile/Nicholas-Xaverius"
                },
                {
                    "user_id": "Divya Dhawan",
                    "user_href": "/profile/Divya-Dhawan-18"
                },
                {
                    "user_id": "Naveen Kumar",
                    "user_href": "/profile/Naveen-Kumar-2785"
                },
                {
                    "user_id": "Uma Parvathy",
                    "user_href": "/profile/Uma-Parvathy-17"
                },
                {
                    "user_id": "Vivaan Bakshi",
                    "user_href": "/profile/Vivaan-Bakshi"
                },
                {
                    "user_id": "Arjun Agarwal",
                    "user_href": "/profile/Arjun-Agarwal-123"
                },
                {
                    "user_id": "Vihaan Kulkarni",
                    "user_href": "/profile/Vihaan-Kulkarni-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Wee",
                "href": "/profile/Nicholas-Wee"
            },
            "answer_text": "I’ve owned a 2018 12.9″ iPad Pro 512gb since Jan 2019, and I just bought a brand new 2018 11″ iPad Pro 1tb from a store 2 days ago, for 35.5% cheaper than the 2020 equivalent. (S$2169 vs S$1399) Honestly speaking, unless you specifically need the LIDAR sensor and improved camera, there’s a pretty damn good chance you’ll be completely fine with the iPad Pro 2018. The A12Z (2020) chip isn’t some big jump from the A12X (2018) - there’s been tests which highlight that the difference is unremarkable at best. Maybe most apps have not been updated to take full advantage of the additional cores, but I wouldn’t hold my breath. A12Z vs. A12X: What's Changed? So the iPad Pro is a damn good device, but if you can find a discounted 2018 model, that’s arguably more in line with what Apple should have charged for it in the first place. ",
            "date": "Answered October 28, 2020",
            "views": "34",
            "upvotes": " Answer requested by Shadin Mp"
        }
    ]
}