{
    "title": "How do contactless credit or debit cards work? - Quora",
    "tags": [
        "Contactless Payments",
        "Contactless Credit Cards",
        "Credit Cards Vs. Debit Cards",
        "Credit Card Processing",
        "Debit Cards",
        "Credit",
        "Online Payment Gateways and Processing",
        "Payments",
        "Credit Cards"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kirti-Bemoneyaware",
                "href": "/profile/Kirti-Bemoneyaware"
            },
            "answer_text": "Cards with waves/wifi symbol, also known as ContactLess card, speed up purchases as one does not have to Enter PIN. So its no dipping, swiping or waiting for Contactless Card debit and credit cards at the Contactless machines. Card Never Leaves your Hand. In India, payment through contactless mode is allowed for a maximum of 2000 Rs for a single transaction where you are not asked to input your PIN. You can still use your card for purchases using Chip and PIN at machines without the contactless technology. There is no difference in using the Contactless card for amounts more than 2000 Rs or using the card at ATM or on the Internet.  How to ContactLess Cards work? Contactless credit/debit cards have a chip inside them that emits radio waves and an antenna connect with a contactless reader. This is known as radio frequency identification (RFID) technology. To pay for something with a contactless credit card, you hold the card near a payment terminal (known as an RFID reader) and it picks up the signal, communicates with the card. To process the payment it uses public-key cryptography, typically RSA cryptography. Each card contains a unique public and private key pair that is used during authentication. The payment terminal will say if the payment was successful or not. As explained in our article Contactless Card: Pay Without Pin on using Credit and Debit Card  ",
            "date": "Answered June 28, 2019",
            "views": "188",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Saurav Gupta",
                    "user_href": "/profile/Saurav-Gupta-15"
                }
            ]
        }
    ]
}