{
    "title": "How is literature relevant in the era of digital technology? - Quora",
    "tags": [
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Leavy",
                "href": "/profile/John-Leavy-4"
            },
            "answer_text": "On a personal level, I would imagine that literature has little relevance to digital technology. It was not all that long ago, when it was assumed that the arrival of the kindle would sound the death knell of printed material. However, even before these lock-downs, it had been over a year since I had seen anyone on a train using the silly things. In fact, some sources are claiming, kindle sales have taken a nose-dive. How any sane individual could have believed that digital technology would replace the printed page, most assuredly beats me. According to Paula Cocozza: “Here are some things that you can’t do with a Kindle. You can’t turn down a corner, tuck a flap in a chapter, crack a spine (brutal, but sometimes pleasurable) or flick the pages to see how far you have come and how far you have to go. You can’t remember something potent and find it again with reference to where it appeared on a right- or left-hand page. You often can’t remember much at all. You can’t tell whether the end is really the end, or whether the end equals 93% followed by 7% of index and/or questions for book clubs. You can’t pass it on to a friend or post it through your neighbour’s door.” The Guardian, April 27, 2017. I will now add my own list of failings inherent in digital technology. You cannot browse literature in a used digital technology book store... or even an unused digital technology book store. You cannot pick up a valuable second hand digital book. You cannot have a signed, leather bound digital book. You cannot hold and weigh in your hand a digital book. You cannot see any previous owner's margin comments in a digital book. And finally, you cannot see and feel the pages, and smell the ink on a digital book. So then, let us hope and pray its demise will be sure and swift. ",
            "date": "Answered October 19, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tonya Presley",
                    "user_href": "/profile/Tonya-Presley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anamaria Borlan",
                "href": "/profile/Anamaria-Borlan"
            },
            "answer_text": "Why is Literature relevant in this era of digital technology? Literature helps develop one's critical thinking skills in the quest for the 21st century competencies of the digital technology. It helps people, students, and children to gain a better understanding of the societies which produce the literature to foster greater empathy for others. Studying literature is important because it, at its most basic, improves reading skills, helping to see the world - people, places, things, events - through different eyes and by way of a different viewpoint. Literature has had a major impact on the development of society. It has shaped civilisations, changed political systems and exposed injustice. Literature gives us a detailed preview of human experiences, allowing us to connect on basic levels of desire and emotion. The end product is a piece of literature that will reflect the person's own character. Everyone should read literature and learn facts, beginning with the youngest learners, to let them know how valuable written literature is in the process of building mind and character as any one of the other 'practical' subjects. Everything that happens within a society can be written, recorded in, and learned from a piece of literature. Whether it is poetry or prose, literature provides insight, knowledge or wisdom, and emotion towards the person who partakes it entirely. Life is manifested in the form of literature. Digitalized or not, literature remains the same treasure for the humankind. ",
            "date": "Answered October 21, 2020",
            "views": "75",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wiebe de Boer",
                    "user_href": "/profile/Wiebe-de-Boer"
                },
                {
                    "user_id": "Caz Lessels",
                    "user_href": "/profile/Caz-Lessels"
                }
            ]
        }
    ]
}