{
    "title": "How does technology work? - Quora",
    "tags": [
        "Word Definitions, Terminology, and Jargon"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Manings",
                "href": "/profile/Steven-Manings"
            },
            "answer_text": "What do you mean by \"Technology?” The term technology encompasses so many things, anything from your smartphone to your toilet seat. The definition of technology is \"the application of scientific knowledge for practical purposes, especially in industry.\" So really anything can be considered technology. But most likely you’re thinking of thing like computers, cellphones, and rockets. So I made a short list: Cell Phone:  Image: Business Insider Phones, like everything else (Such as tablets, tv, or any other smart thing) have a computer in them. But Smart Phone have Custom Operating Sytems to operate special components (such as Sim Cards, or Wi-Fi receivers). Sim Cards allow the phone to connect to cellular towers that blanket the United States, and much of the rest of the world. This allows the phone to use it 3G, 4G, or LTE, service to always be connected to the internet and be able to make calls and text. Basically it lets it use \"Data,\" as most people have begun calling it. Tablets  Image: Walmart Tablets are just bigger phones. Some are more powerful, some are less. They all could have the ability to call and text, if they have a SIM card installed. The IPod Touch, is just a small IPad.  Image:UCP Computers Computers are made up of many parts to make a functional singular being. It takes many parts, but they generally get more space to breathe than a phone or tablet (which prevents over-heating) which let's them be bigger and better. One problem with computers, (unless it a laptop) is that they are not mobile. The require a lot of space, a desk, external components (such as a Monitor, keyboard, and Mouse) and are not portable by any means. They make up for this by being really good at what they do.  Image: PCMAG Smart Home Technology: In my home I have an Amazon Echo. It can yell at it to turn on my lights. He is a step by step process of how my lights will turn on. USER: \"Alexa, turn on bedroom lights.\" Echo (aka Alexa): \"Okay\" Alexa send request (Bedroom Light - On) to my Smart Hub, which then toggles the Smart Bulb I installed on my lamps. Lights toggle on, and I wake up with bright lights in my face. They do do all of this though a smart hub, which is like a circuit breaker for smart devices. It’s interconnectivity like nothing before. ",
            "date": "Answered February 7, 2018",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhay Singh",
                "href": "/profile/Abhay-Singh-878"
            },
            "answer_text": " We are shaped by our tools, but we also reshape them, and this is an ongoing process. It is an interaction, not an action. I would like to suggest that technologies do not have effects, nor are they effected upon. A hammer can do many things like drive a nail, stop a door, kindle a fire, bang a gong, but its features enable certain uses, and through that ennoblement continue to suggest uses, and by extension ways of thinking and seeing the world. Its clearly means “Technology works how you like to”. ",
            "date": "Answered February 26, 2018",
            "views": "851",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhilasha Singh",
                    "user_href": "/profile/Abhilasha-Singh-273"
                }
            ]
        }
    ]
}