{
    "title": "How is artificial intelligence used? What are some examples? - Quora",
    "tags": [
        "Artificial General Intelligence",
        "Artificial Intelligence",
        "Machine Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rana Usman",
                "href": "/profile/Rana-Usman-3"
            },
            "answer_text": "I would present a few cases, however there are wide range applications of Data Science and AI. I would rather quote some of my work as examples. Social Science Have you ever heard of American Community Survey? It’s one of the biggest database on planet that exists of 320 million americans with hundreds of attributes related to them. Imagine what you can infer about population just going through that one dataset. One of the things that I found working on it was, in specific counties where people used to walk to work/ride bicycle to work, that county had lowest Diabetes and Hypertension rate. Healthcare It is most profound area where data science is being used now. There are many cases where you could use data science, one of the case would be to cut the procedural costs. You can refer to breast cancer analysis. I happened to work on a dataset regarding a hospital complaints. It was inferred that the Wards with most complaints about cleanliness had the delayed patient discharge compared to other wards. Microbiology Have you ever thought that a protein sequencing or dna sequencing would be done by a single command? It is widely used and various algorithms are incorporated for that. I happened to have no experience with it. Finance I worked on Prosper Loan and Lenders club dataset for fun. It turned out to be an amazing learning opportunity in finance sector to predict the bad loans, churn, and many other things. One of the key finding was that the return of loan isn’t necessarily related to wealth of applicant, contrary to what one might believe. One Bonus Example Human Resource Turnover I happened to work on a turnover data to predict which employee is going to leave organisation and when. It was very interesting to work upon. By doing EDA on turnover data, it was certain to say what types of employees leave the organisation and by when. ",
            "date": "Answered September 1, 2016",
            "views": "964",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Reginald Egbuniwe",
                    "user_href": "/profile/Reginald-Egbuniwe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adhyatmikaa Mohanty",
                "href": "/profile/Adhyatmikaa-Mohanty-1"
            },
            "answer_text": "Artificial Intelligence is creating lots of excitements and in many ways, AI and its application are in use today. And artificial intelligence has been the cause of many of the technological breakthroughs in the past several years. Let's have a look at some of the popular example of Artificial Intelligence that is being used today “Siri”“Alexa”“Boxever”“Telsa”If you want to know in-depth please check this link in below it will give you a proper understanding Top 10 Examples Of Artificial Intelligence In Use Today ",
            "date": "Answered September 21, 2019",
            "views": "101",
            "upvotes": "0"
        }
    ]
}