{
    "title": "How can technology impact war? - Quora",
    "tags": [
        "Impact",
        "Warfare",
        "Military History and Wars ",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Meehan",
                "href": "/profile/Sam-Meehan-5"
            },
            "answer_text": "Well lets see. First up, rocks and sticks. Hands and teeth are far too ineffective for killing people. Bows! Atlatls! Now we can kill people from further than we can throw! The Wheel. Now we can carry things as we campaign, so we can actually fight in distant lands! Metalworking! Now we can make stronger, sharper weapons. Or if we’re really smart make tools to make food easier! So now we have more, better equipped people! Shields and armor! Now we don’t all die in one or two hits! Walls! Forts! Now we can muster and defend strategic locations with a huge advantage! Siege equipment! Now we can defeat people who’ve fortified strategic locations! Boats! Now we can travel by river or sea. Trade increases, meaning more wealth, meaning more people! Naval combat is now a thing! Domestic warhorses! Those useless things can now carry us into battle! Whistles/Flags! Now we can signal people without being right infront of them yelling! Writing! Now we can pass down techniques to people we’ll never meet, or send messages that won’t be repeated wrong by the messenger! And I haven’t even gotten to firearms and engines yet. Human society is built on technological advancement. It’s no surprise that war is too. ",
            "date": "Answered May 8, 2017",
            "views": "561",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sheron Arcibald",
                    "user_href": "/profile/Sheron-Arcibald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stuart Buncher",
                "href": "/profile/Stuart-Buncher"
            },
            "answer_text": "Your question should be how did war impact technology? War has brought great leaps in medicine, electronics, engineering and impacts on life in general. Radar, sonar, aircraft, gasoline and diesel engines, munitions, weapons, surgical procedure, new/ better/lighter  materials taking the place of metals, advances in electronic components, the ability to go into outer space or under the sea etc. ",
            "date": "Answered March 14, 2017",
            "views": "374",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ben Collier",
                    "user_href": "/profile/Ben-Collier-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sriram Reddy",
                "href": "/profile/Sriram-Reddy-60"
            },
            "answer_text": "Technology can change the face of war fare but in a negative . 1.hacking Hacking can change the warfare by hacking you easily find what weapons they have a and all the important details about the country.  2.Technolgical weapons These are very important in how the war changes technological weapon are very much useful in wars .weapon are shooting drones,unmanned spacecraft etc.  ",
            "date": "Answered December 27, 2017",
            "views": "251",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheron Arcibald",
                    "user_href": "/profile/Sheron-Arcibald"
                },
                {
                    "user_id": "Kowsalya Ravikumar",
                    "user_href": "/profile/Kowsalya-Ravikumar-1"
                },
                {
                    "user_id": "Kowsalya Ravikumar",
                    "user_href": "/profile/Kowsalya-Ravikumar"
                },
                {
                    "user_id": "Himesh Shah",
                    "user_href": "/profile/Himesh-Shah-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Davison",
                "href": "/profile/Michael-Davison-26"
            },
            "answer_text": "It already has. As a former Armored Recon sergeant, we patrolled far ahead of our tanks to find the enemy. Now drones do it at far less risk to personnel. Artillery aiming and ToT (Time on Target) used to be done by math whizzes, today it’s all done by computers, faster and more accurately. With GPS, map reading and navigating by map and compass are lost arts… ",
            "date": "Answered April 24, 2019",
            "views": "220",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ido Reif",
                    "user_href": "/profile/Ido-Reif"
                },
                {
                    "user_id": "Sheron Arcibald",
                    "user_href": "/profile/Sheron-Arcibald"
                },
                {
                    "user_id": "Cameron Kingsley",
                    "user_href": "/profile/Cameron-Kingsley-1"
                },
                {
                    "user_id": "Thomas Knowles",
                    "user_href": "/profile/Thomas-Knowles-6"
                },
                {
                    "user_id": "Ben Allen",
                    "user_href": "/profile/Ben-Allen-233"
                },
                {
                    "user_id": "Alan Young",
                    "user_href": "/profile/Alan-Young-156"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mahadev Narayanan",
                "href": "/profile/Mahadev-Narayanan"
            },
            "answer_text": "Greatly!! Reduces manpower, quicker and more damaging in larger areas simultaneously, faster response where attacked, better surveillance etc Weakness - suspectible to hacking of controls, may not be successful in inclement weather, any glitch in any system may affect total defensive or offensive plans. Hence 24 x 7 watch against enemies' hacking of systems required . All time maintenance and operational readiness required. ",
            "date": "Answered April 11, 2019",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roberto Eduardo",
                "href": "/profile/Roberto-Eduardo-1"
            },
            "answer_text": "Almost all technology influenced warfare. Technology and science qualified as western although many non-western people has contributed. Japan, China, India and much more. When Asiatic countries fight each other they use western technology and not esoteric developments like karma and other. Without that technology you sure will be defeated. ",
            "date": "Answered April 11, 2019",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sheron Arcibald",
                    "user_href": "/profile/Sheron-Arcibald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thies Schaper",
                "href": "/profile/Thies-Schaper"
            },
            "answer_text": "Hopefully, by using natural “tools” when encountering the opponent …  ",
            "date": "Answered April 24, 2019",
            "views": "53",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sheron Arcibald",
                    "user_href": "/profile/Sheron-Arcibald"
                }
            ]
        }
    ]
}