{
    "title": "How much privacy are we willing to give up in return for greater security and access to technology? - Quora",
    "tags": [
        "Internet Privacy",
        "Privacy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Anderson",
                "href": "/profile/Bob-Anderson-94"
            },
            "answer_text": "Apparently most people are willing to give up quite a lot. But they’re not being offered an honest deal because if they knew exactly how much privacy they’re actually sacrificing, I believe most people would think twice. Apathy is not the problem, what’s missing is informed consent… A spate of surveys and research show that people actually do care, and quite a lot. For example, have a look at People do care about privacy or The Facebook generation is worried about privacy. When you purchase a tablet or a smart phone, when you signup on Facebook or make a Google search, you are NOT being told that the actual cost includes revealing vastly more of yourself than you realize. Your Top 10 Privacy Losses A tremendous amount of personal information is being collected about you, including... Who you areWhere you goWho you associate withWhat you buyYour browsing, search and viewing habitsYour emailYour phone calls and text messagesYour pictures and videosThe files on your computerYour voice commandsThere's more, including medical records and financial data, but at least they have some legal protection. And then of course there's everything people post in social media, which is public by definition. It adds up to a situation that's far worse than most people realize. Here are the details… 1. Who you are Your identity is being collected with virtually every interaction you have on the internet, whenever you shop or use a credit card, as you carry your mobile device, or even when you just walk by someone else's device. You can't even enter some buildings on strictly personal business without your privacy being molested by a strong presumption of guilt.  Buildings are NOT legally required to request ID You are being imaged and identified at toll booths, cross walks, ATMs, shopping malls and transportation centers, casinos, train and bus stations, airports and simply as you pass hundreds of building security cameras in the normal course of your day. Even your webcam or security system can be used to peer deep into your private life. Your identity is being recorded with every internet resource you use, even if you browse using the supposed \"incognito mode\" via a technique known as browser fingerprinting. And it's being correlated with numerous aspects of your personality and motivations in an effort to manipulate your purchasing decisions and the prices you are charged. Your credit card trail is recorded forever, and easy to follow and draw conclusions from. Your health care information is protected (in the USA by HIPAA, the Health Insurance Portability and Accountability Act), yet even those laws have loopholes large enough to drive a truck through. Don't be fooled… it's not just that some apartment building or supermarket knows who you are when you visit, it's that this data is being concentrated from all sources and then analyzed to map not only who you are but who you're with, when and where. 2. Where you go Your moment-to-moment movements are being tracked and recorded by an astonishing array of companies, governments and increasingly, private individuals with a snooping mindset.  The primary culprit is your mobile device, almost all of which have location detection technology. And almost all can transmit that information not only to your mobile service provider, but also to literally thousands of companies that make apps you grant that right to, often unwittingly. You can see this for yourself if you have an Android phone and have activated location history. Google will show you where you were every moment of the day. Most especially, open the Timeline Year Tab and click the red box in the lower-left corner for a list of the places you visit most. This is not limited to Android devices, they're just the easiest to see. The location of virtually all mobile devices of all types is being recorded. Your path through life can then be correlated with other people to find hidden associations using 'dark' algorithms to which you have no access nor right to protest. The conclusions they draw can impact your life in serious ways. 3. Who you associate with Your communications traffic is a direct mapping of who you associate with. The content of the address books in your phone and email system expand on it, and relatively simple proximity analysis of GPS data can reveal which mobile phones are near yours.  Which devices “sleep together” is also mapped, with obvious implications about their owners. Your social media connections ('friends') complete the picture, and if you use the calendar features offered by Apple, Microsoft or Google, whatever appointments and meetings you've set there add even more detail. From those and other sources it's easy for governments and companies to build your relationship topography - literally a 3D map of who you know and when and how you interact with them. And from there a larger map of who they know, which raises some terrifying issues of potential \"guilt by innocent association\". Think about that. 4. What you buy You know those \"member discount cards\" you can get from your favorite retail outlets and supermarkets, the ones they scan at checkout to apply supposed discounts? All you have to do is fill in a simple application with your name, address, email and phone, and presto… you get the card for free, and hence the discounts. But have you ever wondered why do they do it? There are two reasons. By offering sales or special offers only to members, they increase customer loyalty. Fair enough, so far. But there's more: because their POS (point of sale) systems are connected to their inventory and customer relationship systems, by issuing you a card they can keep a precise permanent record of everything you buy.  Think about WHY you or your child pick a particular product This allows them to analyze you in an effort to influence the mix of products and sales you are offered in the future. Also fine, right? Maybe not. They're using potent techniques to influence what you buy, even (especially) if it's not the right product for you or your family. The data they collect about the choices you make has no legal protection. It then joins an ever-widening river of information about you, to be further analyzed to draw opaque conclusions about who you are as a human being, upon which all sorts of decisions will be made, as described by Cathy O’Neil in her insightful book Weapons of Math Destruction. Much the same thing happens when you shop online. If you create an account on sites like Amazon or eBay, or you use Paypal, comprehensive information is collected about what you are buying, and what that implies. 5. Your browsing, search and viewing habits Most people understand that their browser keeps a history of the sites they visit. What many do not realize is that companies like Microsoft and Google also retain that information, as can your ISP, unless you take extraordinary measures1. The supposedly \"incognito\" browsing offered by most of them does not protect you from this. You can get a glimpse of what's known about your searches form Google's Account Dashboard. Log in and have a look; I bet you'll be surprised.  We'd really like to know your phone and email By urging you to \"create an account\" with them, they can recognize you and collate your data across all the devices you use. This is the essential reason that email services such as Outlook, Twitter and Gmail are free… checking your messages on a device requires you to sign in, and once you do they know it belongs to the cluster of devices you use. From there it's a trivial matter for companies like Google to then correlate your viewing with all your other browsing patterns. That's valuable to them for many reasons. In fact it's so valuable that they're happy to give you their service for free. They also strongly encourage you to link your account with your social media, thus cementing their knowledge of who you are, who your friends are, what you buy, what you like to watch, where you go, and much more. These and similar intrusions also enable companies to deduce some remarkably private medical facts about you. Oh, and by the way, it's not just the internet, even your TV is tracking you. Here's how to stop it. 6. Your email Every email you've sent or received for about the past decade has been archived. It doesn't matter if you've deleted them, and unless you've gone to the extraordinary trouble of implementing encrypted email— which almost no one does — it's all 'plain-text', easily readable. Just because it's out of (your) sight does not mean it's out of (someone's) mind.  If you're a Gmail user and archive instead of permanently deleting your messages, you can get a sense of what's been saved by visiting Google's Account Dashboard, under the Gmail heading. Some other email providers provide similar functionality, however most just delete them, but only in the sense that you can't see them anymore… Someone somewhere still has copies (including all attachments) for as far back as the last decade. This will continue into the indefinite future. 7. Your phone calls and text messages Virtually every phone call you've made and text message you've sent since about 2005 has been analyzed and archived, no matter if it's from a mobile or landline, and no matter if it's professional or personal.  Some of that is done by the service providers (phone companies) at the behest of government agencies, and some of it's done directly by them. But either way, every word you've uttered on the phone has been saved for future reference. By whom? Who knows? And that's the point. The same is true for voice calls made using online tools like Skype or Google Voice. It's all recorded and saved, forever. Beyond them there are more exotic systems such TorChat, qTox or Silent Circle featuring voice and/or text encryption to protect you from eavesdropping, but they are 'techie' or expensive, not simple and affordable consumer solutions. 8. Your pictures and videos Virtually any image you take with a smart device can be surreptitiously extracted, or lives in cloud storage already, where it's immediately accessible to the service provider with no skullduggery needed. Likewise with anything you share on social media. If you take pictures with a smart phone or recent digital camera, the camera's location is recorded in every picture, and easily discoverable by anyone who has a copy. This can be far more troublesome than you think.  Your GPS location is embedded in every picture Both OS X and Windows make snapshots of your files as what they call \"thumbnails\" in order to speed up browsing through folders on your computer. But they are not deleted when you delete the files from which they are made. That means that images of files you thought were long gone still linger inside your computer, sometimes for years. Fortunately, there are tools that let you see what's there or get rid of them. 9. The files on your computer Most people assume that the files they keep strictly on their computers (family videos, tax returns, etc.) are safe from prying eyes. They're not. Simple hacks can place malicious code on your device that slowly but steadily copies the entire content of your device via your internet connection to wherever an attacker wants. Those private pictures you and your wife took one night, and kept strictly confidential? Nope, not private, not from certain people, not with the resources they have.  How about your employee agreement and your tax returns, or the lab reports from the doctor? What about the confidential business spreadsheets you've been developing, or the contracts from your lawyer? It's all far more vulnerable than you realize. 10. Your voice commands If you use the voice-commanded digital assistant in your device (Siri, Alexa or Cortana), you may be shocked to discover that the providing companies (Amazon, Apple, Microsoft) keep recordings of your actual voice statements. Apple does the best job of shrouding the data they collect. Google is remarkably transparent about what they've got. Microsoft is somewhere in the middle, and Amazon's Alexa Voice Service is much the same. But they all have a stunning amount. For example, you can look and actually listen to what Google saves on your My Activity pages. Speaking of voice, all these devices can listen continuously to everything within range of the microphone, waiting to hear for their activation phrases (\"Hey Siri\", etc). Amazon says their Echo product \"Hears you from across the room with far-field voice recognition, even while music is playing\" They've implemented their version of what Microsoft calls \"far field\" voice technology, about which Microsoft \"expects the technology to work even in Standby mode\" and is \"…encouraging companies to develop devices supporting this feature\".  Your device is listening all the time When these systems recognize a particular utterance as a command, they transmit that audio segment to the provider's servers where it's recorded, parsed and reacted to. But there's no technical reason why it couldn't be made to continuously transmit everything it hears to anyone the provider or a hacker wants. As of August, 2017 over 4,000 apps have been discovered that do exactly that! ",
            "date": "Answered December 7, 2017",
            "views": "814",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andreas Poxrucker",
                    "user_href": "/profile/Andreas-Poxrucker"
                },
                {
                    "user_id": "Steven Barrett",
                    "user_href": "/profile/Steven-Barrett-24"
                },
                {
                    "user_id": "Ron Clark",
                    "user_href": "/profile/Ron-Clark-43"
                },
                {
                    "user_id": "Mark Nagel",
                    "user_href": "/profile/Mark-Nagel-11"
                },
                {
                    "user_id": "Amanda Grosskopf",
                    "user_href": "/profile/Amanda-Grosskopf"
                },
                {
                    "user_id": "Frank Corradino",
                    "user_href": "/profile/Frank-Corradino"
                },
                {
                    "user_id": "Sebastian Putz",
                    "user_href": "/profile/Sebastian-Putz"
                }
            ]
        }
    ]
}