{
    "title": "How to protect my USB drive with password - Quora",
    "tags": [
        "Flash Drives",
        "Universal Serial Bus (USB)",
        "Security",
        "Web Applications",
        "Passwords",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wayne Sue",
                "href": "/profile/Wayne-Sue-2"
            },
            "answer_text": "There are different approaches you can take to password protect a USB drive. You can choose to encrypt the entire USB drive or password protect specific folders or files on the USB drive. Here are the easiest ways to password protect or encrypt files and folders on a USB flash drive. Method 1. Encrypt USB Drive by WINRAR With the WINRAR software, you can compile the contents of your USB drive and encrypt them in a password-protected folder. WINRAR is a piece of software that allows you to compress files and also encrypt them. Files encrypted with WINRAR have the extension ‘.rar’. Step 1 Download WINRAR Step 2 Prepare the files to encrypt Plug your USB flash drive to your computer and decide on the files or folders you want to secure. If you want to password-protect all the files in your USB drive, it is a good idea to put them all into one folder, and then encrypt the folder.  Step 3 Encrypt the prepared folder Once all your files are now in a single folder, right-click the folder and select ‘Add to archive’.  A pop-up window will be displayed. In the ‘General’ tab, you can set a new name for the encrypted folder from the ‘Archive name’ textbox. Select ‘RAR’ as the archive format and click ‘Set password’. A pop-up window will be displayed. Enter your desired password in the textbox and reenter it in the verification box. Click on the checkbox that says ‘Encrypt file names’, then click ‘OK’. An archive file with the ‘.rar’ file extension will be created. This is your encrypted data. Method 2. Password Protect Individual Data on a USB Drive You may choose to password-protect only individual files on your USB drive and not an entire folder. If your file is a Word document or any other Microsoft Office file, you can set up password protection for the file right inside Microsoft Word or the file’s corresponding Microsoft application.  To password protect a Word document, open the file in Microsoft Word and click ‘File’. On the ‘Info’ tab, you’ll see the option to ‘Protect Document’. Click the option and select ‘Encrypt with Password’. You can follow this procedure for other Microsoft office files. Method 3. Use Rohos Mini Drive to Encrypt a Part of the USB Rohos Mini Drive is a tool that you can use to create a secret encrypted container of your files on your USB drive. Step 1 Download Rohos Mini Step 2 Navigate to your USB drive Once installed to your PC, click the Rohos Mini icon to run the program. A window will be displayed. Click ‘Encrypt USB drive’. A pop-up window will be displayed. Click on ‘Change’ and scroll to select your USB drive.  Step 3 Enter a password Once your USB drive has been identified by the program, two textboxes will be displayed. Enter a new password to your secret partition in the displayed text boxes, then reenter the password to verify it. Click ‘Create a disk’ to begin the encryption. You’ll get a display message once the encrypted partition has been successfully created and you can start adding files to the password-protected portion of your USB drive. Method 4. Use BitLocker to Encrypt the Whole Drive BitLocker is a Microsoft program and it is available to Windows users. Once you encrypt your USB drive with BitLocker, your data is secured and can only be accessed with a valid password. To get started with password-protecting your USB stick with BitLocker, read-through and follow the easy steps outlined below.  An easy way to determine if BitLocker is installed on your Windows operating system is to type ‘BitLocker’ in your Window’s search bar. If you get a display window that says ‘Manage BitLocker’, that means you have BitLocker installed in your computer. Step 2 Plug your USB stick Plug your USB stick to your computer and ensure that your system recognizes it. Step 3 Turn on BitLocker From the search bar, search for BitLocker, and from the results click ‘Manage BitLocker’. Once you are in the BitLocker encryption window, head over to the tab ‘Removable data drives - BitLocker To Go’ at the bottom of the page and browse through to find your plugged-in USB drive. Once you see your plugged-in USB drive, enable BitLocker for your USB drive by clicking ‘Turn on BitLocker’.  Step 4 Set password Once BitLocker is turned on, you’ll receive a prompt to choose how to unlock your USB drive. To password-protect your USB stick using BitLocker, you should select ‘Use password to unlock the drive’ from the prompt displayed. Enter your desired password in the textbox provided and reenter it for verification. Ensure you don’t forget your password. Step 5 Encrypt your USB drive Once you have verified your password, a prompt will be displayed asking you to choose how much of your drive you want to encrypt. ",
            "date": "Answered August 1, 2020",
            "views": "923",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eleanore Reed",
                    "user_href": "/profile/Eleanore-Reed"
                },
                {
                    "user_id": "Ranvijay Rana",
                    "user_href": "/profile/Ranvijay-Rana-11"
                },
                {
                    "user_id": "Shilpa Rana",
                    "user_href": "/profile/Shilpa-Rana-40"
                },
                {
                    "user_id": "Sarthak Pati",
                    "user_href": "/profile/Sarthak-Pati-4"
                },
                {
                    "user_id": "Ankit Dyeonia",
                    "user_href": "/profile/Ankit-Dyeonia-1"
                },
                {
                    "user_id": "Ankur Panthri",
                    "user_href": "/profile/Ankur-Panthri"
                },
                {
                    "user_id": "Shil Rana",
                    "user_href": "/profile/Shil-Rana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashvin J. Sonani",
                "href": "/profile/Ashvin-J-Sonani"
            },
            "answer_text": "With USB Secure you can protect USB drive with a password! Looking for something similar to a vault for your portable drive? You’re on the right page. Use this software to maintain perfect USB security by password-protecting your USB containing private images, personal documents, numerous unending memories, and business stuff. Given that USB drives are far more likely than other storage devices to be lost or stolen, it is important to ensure the contained data cannot be accessed by others even in this unfortunate scenario. USB Secure is a lightweight program that provides you with a solution, as it is designed to encrypt the contents of your flash drive and prevent unauthorized access.  USB Secure To Protect USB drive with a password Software Features USB SecurityUSB Secure password protects your USB drives. Simply install the program in the portable drive you want to password-protect and all the data in it is hidden and is delete proof. To access your files again, enter the correct password, and get your files back without requiring you to install the product again and without needing any admin privileges. ad  Virtual Drive OptionTo access your files, you can choose between unlocking them completely or just access the locked files in a virtual drive. This plug and play feature is handy if you fear data loss in case if the USB drive is removed from the PC abruptly. Works on all disk typesThe product works on FAT/FAT32/NTFS drive types and all types of USB and External drives. No matter how much data you have, it will be password protected in seconds. The tool uses a multi-layer patent-pending method to secure these files on all disk types. Lost and found infoThe app lets you create a lost and found info so that if your USB drive gets lost, someone can contact you with the info you save with USBSecure. You can save your phone number, email, and address so that if it is found by someone; he can reach you.  One of the biggest advantages offered by this application is that it can be installed directly on your portable storage device and accessed from any machine without having to complete the setup procedure a second time. Naturally, your USB drive needs to be connected when installing the software, and you can uninstall it easily by accessing the application’s Options panel. Once everything has been set up, you need to provide the password that will be used to secure the stored information. The drive can then be locked or unlocked with a single mouse click at any time. You also have the option of specifying which of the files or folders stored on the device should be protected. However, items stored in subdirectories cannot be viewed. Experienced users may also wish to modify the default Autoplay settings, as the application allows you to disable this feature or specify which actions should be triggered.  The user interface is styled after a classic USB drive, a design choice that some users may appreciate, although it would have been nice if an alternative theme were also available. Novices should be pleased to learn that an extensive user manual is available and detailed instructions are included. Thanks, ",
            "date": "Answered June 25, 2020",
            "views": "275",
            "upvotes": "0"
        }
    ]
}