{
    "title": "How would you develop an intelligent robot? - Quora",
    "tags": [
        "Intelligent Robotics",
        "Artificial Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Sanders",
                "href": "/profile/John-Sanders-89"
            },
            "answer_text": "See answer from Tom Foale . The term intelligence has no definition and if I give it one there will be plenty of objections. So I will give an outline and then duck! For me intelligence is not defined by tests. It is the ability to adapt. Intelligence is defined by viability with respect to an environment. A small clam in the ocean has the ability to tune its responses given a set of sensors and actuators. With only the simple Hebb rule it can normalise its responses to ensure it responds optimally with respect to its limited environmental niche. This means it is adapting which further means that the clam as a system has a small amount of the property intelligence. In control systems this might be referred to as closed loop control with a loop that belongs to the environment and the clam (they are tightly coupled components). When we talk about our level of intelligence we still do the low level stuff - (when learning to drive you get better at steering for example) . Our main evolutionary advantage is being able to handle open loop problems - by modelling (planning) this is the mechanism we call thought. So if you are building an intelligent robot then it must be able to adapt to its environment. So just programming it to do stuff will not be sufficient to call it intelligent. Once a system can do that. We can add a layer for symbolic systems such as language, modelling and then thought. The point here is that most people expect computers to understand language before they can do basics such as move and pick up. A language must be able to interact with images of the environments in order to provide a learning basis for models. So computers on their own will not become AIs. They need that fantastic - consistent environment to build consistent models for adapting to their sampled environment. Computers only really sample sources of our data world.. it is meaningless to the computer. ",
            "date": "Answered December 17, 2016",
            "views": "606",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fabien Benetou",
                "href": "/profile/Fabien-Benetou"
            },
            "answer_text": "define the purpose as intelligence can be considered as \"just\" a tool toward a goal (e.g. destroy humanity or clean nuclear power plants)assess feasibility according to the state of the art in research in Robotics and Artificial General Intelligenceselect the paradigm that you believe will yield the best result, avoid the existing ones if you believe no intelligence robot has been created so far (I personally would look toward enaction, evo-devo and constructivism, including social constructivism hence HCI)estimate the cost in materials and software development (probably add 20% if it is not your first time, 200% if it is)if you can not handle the financial risk yourself find appropriate financing sources (does not have to be DARPA) if the project is too complex to do it alone assemble the team members for each speciality which is not yet coveredapply project management skills as if you were building a car and raising a kid",
            "date": "Updated June 22, 2012",
            "views": "756",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harri K. Hiltunen",
                    "user_href": "/profile/Harri-K-Hiltunen"
                }
            ]
        }
    ]
}