{
    "title": "How do we balance modernity and tradition? - Quora",
    "tags": [
        "Modernity",
        "Balance"
    ],
    "response": [
        {
            "author_info": {
                "name": "Asimendrakumar Dhirendrakumar Dechaudhari",
                "href": "/profile/Asimendrakumar-Dhirendrakumar-Dechaudhari"
            },
            "answer_text": "One can balance tradition and modernity by accepting good elements of both and by rejecting the bad elements of both. For example, if science is taken as an element of modernity, we should accept it. We have different festivals which are part of our tradition. They create brotherhood and joy in society and so we can preserve them. Similarly, casteism is a bad tradition and so we should reject it. If drinking liquor and smoking is taken as a part of modernity, we should reject it. In this way we can balance tradition and modernity. ",
            "date": "Answered August 2, 2020",
            "views": "114",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ronak Sain",
                    "user_href": "/profile/Ronak-Sain-8"
                },
                {
                    "user_id": "Arpita Aparajita (ଅର୍ପିତା ଅପରାଜିତା)",
                    "user_href": "/profile/Arpita-Aparajita-ଅର୍ପିତା-ଅପରାଜିତା"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Wagner",
                "href": "/profile/John-Wagner-89"
            },
            "answer_text": "That's a great question…….I should say that we are getting a good head start on that in the US.. By being more inclusive we are actually doing a fantastic job of allowing many more people to stick with traditional values as opposed to defecting to a camp whose phony agendas of inclusiveness are only inspired by the obvious necessity of maintaining a permanent victim class through continued sympathy for those whose traditional inclinations have been blunted by a more negative experience with conservative exclusion based on pretty much false far right religious arguements trying to politicize morals and legislate in the bedroom which probably accounts for the largest percentage of republican defection… (holy shit that was a lot of multi syllable words to knock out without any splling errors!) ",
            "date": "Answered December 23, 2016",
            "views": "698",
            "upvotes": "0"
        }
    ]
}