{
    "title": "How has the Internet changed your life? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Patrick Donohue",
                "href": "/profile/Patrick-Donohue-2"
            },
            "answer_text": "I am like a kid in a candy store. With the exception of pay as you go scientific and other scholarly journals, it is great. Further, the advent of free online university classes make \"the candy store\" even more exciting. Overall, it is changing to course of all of humanity, take the \"Arab Spring\" for example. That would not have taken place without it. Also, combined with the smartphone, it places information instantly and literally at ones fingertips, which is powerful.  This, in turn, speeds up technological change geometrically. Consequently, that leads to a corresponding change in society, the two, feeding each other. Given the ever accelerating rate of change, our world will be surprisingly different in 10 years. With great and fundamental change causing the old order of things to shift in dramatic ways. Those who despise change, conservatives, will chafe like never before. Take, for instance, the shift in economic power from New York City to San Francisco. The center of wealth in the USA is in the process of moving due to all the newly minted billionaires on the West.Coast, Elon Musk, being the de facto leader and prototype. Notice the hate coming from those who feel the tide shifting and their world threatened. There is a desperation revealed by their vitriol.  The new economic titans make their home in the Bay Area. Consequently, their political ethos is shaped accordingly.  When we make the shift to \"Fixed Cost Energy\" then that will bring conservatism, as we now know it, to the dust bin of history. For, their economic base will be decimated. All the above, directly influenced by the Internet.  Therefore, as long as the Internet remains open and unconstrained by corporations and government, we will see democracy preserved and enhanced and the political pendulum will begin to swing less wide. The one thing that will be highly unsettling is further and continuous job destruction throughout the economy.  Whole industries will vanish. Just look at 3D printers. That, my friends, will be very disruptive. For they are the first machines with the ability to procreate. Factories as we know them, will eventually vanish. Thus, survival in the future will require continuous upgrading of ones education with Leonardo da Vinci being the prototype. One will need to be a Maker of Change, learn to Surf the Change or suffer being chum in the Waters of Change. Geeks, will literally rule. ",
            "date": "Answered November 23, 2013",
            "views": "804",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Purnima Madaan",
                "href": "/profile/Purnima-Madaan"
            },
            "answer_text": "I can speak a lot about this. I will keep it short, simple and straight forward.  Keeps you connected with your friends and family.Gives you the latest news in the world.Tells you about the major product and service launches.Shows you weird, funny, hot, amazing, cool, gross and whatever kind of videos you want to see.Teaches you to cook food.Teaches you different languages.Teaches you about science and religion.Informs you about the stupid experiments you should not be doing.Tells you about weird challenges and spread awareness about the same (but also spreads these challenges).Helps you find a job.Helps you dump an ex.Helps you find the next.Helps you stalk a crush (and your ex).Share your day with the world.Express your emotions.Watch videos when you are bored.Watch videos when you are horny.Watch videos when you want to learn something.Watch videos when you are lonely at the station.The meme culture.Makes you laugh.Makes you cry.Brings the fun of watching a movie into your bedroom (you also need a big TV though).Helps you to buy the latest fashion and trends.Corrects your spelling and grammar.Helps you find a new job.Helps you sell your house.Helps you buy furniture for your new house.Helps you book a cab.Helps you to adopt a pet.Helps you to showcase your talent to the world.Helps you to be a celebrity.Helps you to send and receive inappropriate texts and media.Helps you to order food.Helps you to read reviews before you buy something.Helps you to buy coupons.Helps you to play games.Helps you to start a business.Helps you to put yourself in front of the world through ads.Helps you to complete your homework.Emails.Helped you to post this question.Helped me to help you answer this question.AND these are just a HANDFUL ways the internet has changed our lives for the good. ",
            "date": "Answered March 16, 2019",
            "views": "33",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "William Johnson",
                    "user_href": "/profile/William-Johnson-1397"
                },
                {
                    "user_id": "Việt Anh Nguyễn",
                    "user_href": "/profile/Việt-Anh-Nguyễn-49"
                },
                {
                    "user_id": "Diwieta Munshi",
                    "user_href": "/profile/Diwieta-Munshi"
                },
                {
                    "user_id": "Mayank Batra",
                    "user_href": "/profile/Mayank-Batra-4"
                },
                {
                    "user_id": "Sumit Kumar",
                    "user_href": "/profile/Sumit-Kumar-13691"
                }
            ]
        }
    ]
}