{
    "title": "How does technology affect teenage mental health? - Quora",
    "tags": [
        "Mental Illness",
        "Teenagers and Teenage Years",
        "Technology",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kate Finch",
                "href": "/profile/Kate-Finch-10"
            },
            "answer_text": "Mental health issues in teenagers on the rise over the last few years, parents and educators have scrambled to find the culprit and have identified a likely one in new technology and smartphones. The rise in the ubiquity of smartphones has coincided with the rise in psychological distress among teens, and there are more than a few intuitive reasons to believe the two trends are connected. Smartphones and social media have given teenagers, who are in the process of developing a sense of self, an unbridled ability to compare themselves. Throw in the ability to escape from the world, they go through games, movies, and other forms of media. Researchers have yet to find a causal link confirming the negative effects of technology on mental health. Most importantly, they still have not determined the direction of the relationship between increased psychological distress and increased digital technology use. In the Common Sense Media report, the adults’ technology use and bedtime sleeping habits were just as poor as their children’s. 62% of parents kept their mobile devices near their beds, and 26% of parents woke up to check their devices at least once a night. Technology and mental health are complicated, and it is difficult to fully understand the relationship between the two. Whether it be wondering how technology affects their child’s ability to focus or how it affects their patience, parents should continue to closely watch for positive and negative patterns in behavior or attitude and experiment with media rules to find what fits their family’s needs. ",
            "date": "Answered June 16, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patricia Claus",
                "href": "/profile/Patricia-Claus"
            },
            "answer_text": "There is so much in this life for us to see and do. Such a broad array of everything. When I raised the children, I made sure that they understood that they needed, they needed, they needed to balance their lives. We all balanced our lives. So, technology was good, as long as we had a balance in it. With it. And through balance, mental health was good and still is. ",
            "date": "Answered July 28, 2020",
            "views": "152",
            "upvotes": "0"
        }
    ]
}