{
    "title": "How old is Li-Fi technology? - Quora",
    "tags": [
        "Li Fi Technology",
        "Visible Light Communications",
        "Li-Fi",
        "History of Technology",
        "Wireless Technology",
        "Wi-Fi",
        "Technology Trends",
        "Age",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Jones",
                "href": "/profile/John-Jones-1089"
            },
            "answer_text": "To answer this question, you must first think about any technology, when it was first used/invented. LiFi is just a modern name for a technology where the modulation of light is used to transfer data. The modulation of light to transmit data has been used for hundreds of years. The most basic being a one bit device, a fire on a high point which is either extinguished or lit. The data transferred is agreed in advance, for example if you see the fire is lit, the enemy are coming. “Ah!!” you say LiFi is much more sophisticated. It bears no resemblance to a hill-top beacon, but that is irrelevant in a way because the core invention is when light was modulated to sent data, using the technology available at the time. The LiFi demonstrated at TED was just an update of the core invention using the technology of today, in fact Alexander Graham Bell and his assistant, Charles Summer Tainter transmitted Voice over a beam of sunlight in 1880, predating the TED talk by 131 years. The TED talk re-invented the technology, gave it a new name, as if it was something new, and created a huge amount of hype, but it was not the first. Pushing this argument to it’s extreme Data transfer by the modulation of light has existed for millions of years. We have built in receivers and processors which converts modulated light into data. That’s how we see ",
            "date": "Answered March 22, 2020",
            "views": "21",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cameron Lorking",
                    "user_href": "/profile/Cameron-Lorking"
                },
                {
                    "user_id": "Natalie Pushkin",
                    "user_href": "/profile/Natalie-Pushkin"
                },
                {
                    "user_id": "Ashish Thomas",
                    "user_href": "/profile/Ashish-Thomas-39"
                },
                {
                    "user_id": "Kelly Runnels",
                    "user_href": "/profile/Kelly-Runnels-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mario Tilley",
                "href": "/profile/Mario-Tilley"
            },
            "answer_text": "LiFi, to answer your question, is technically 9 years old, as it was introduced at a TED Talk in 2011. However, it became a reality in 2013. The first commercially available LiFi device (for any platform) was released in 2015. It was a light with a LiFi transmitter built in for the LiFi dongles to achieve connection. For anyone that doesn’t know what LiFi (LIght FIdelity) is, it’s a communication type similar to WiFi. Rather than using signals, it uses light to communicate a connection. Basically, this makes LiFi exponentially faster than WiFi, as there is little to no interference. LiFi also makes 5G connections much faster, and there are prototypes in the making to have a full-fledged 5G LiFi network. ",
            "date": "Answered March 9, 2020",
            "views": "85",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marek Job",
                    "user_href": "/profile/Marek-Job"
                },
                {
                    "user_id": "Faizan Saleem",
                    "user_href": "/profile/Faizan-Saleem-20"
                },
                {
                    "user_id": "Mustan Husain",
                    "user_href": "/profile/Mustan-Husain"
                },
                {
                    "user_id": "Mario D. Tilley",
                    "user_href": "/profile/Mario-D-Tilley"
                },
                {
                    "user_id": "Mark Smith",
                    "user_href": "/profile/Mark-Smith-1881"
                },
                {
                    "user_id": "Akásh Srívástáv",
                    "user_href": "/profile/Akásh-Srívástáv"
                }
            ]
        }
    ]
}