{
    "title": "How does the Internet Service Provider measure our internet usage? - Quora",
    "tags": [
        "Content Filtering",
        "TCP/IP",
        "Internet Service Providers",
        "Computer Networking"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parth Palera",
                "href": "/profile/Parth-Palera"
            },
            "answer_text": "1. NetWorx Once you install NetWorx, it will track all your Internet usage with an icon on the taskbar. You can click and launch the program to view usage graphs of each day. What’s good about NetWorx is the ability to set a daily, weekly or monthly quota to track uploads or downloads or both. You can also set the on/off peak usage that some internet providers have and it’ll warn you if you’re about to reach the limit.  ​2. BitMeter 2 This program comes with a desktop widget meter graph of your download and upload speeds. Similar to NetWorx, you can add a quota limit — in the case of BitMeter 2, it is namedISP Restrictions. Once set, it’ll tell you how many days and bandwidth you can use before reaching your limit. You can also view your usage stats that can be sorted by hours, days, and months.  ​3. NetSpeedMonitor This program permanently sits on your taskbar showing upload and download speeds. To enable this, right click on your taskbar and under Toolbars click on NetSpeedMonitor. Apart from showing connection speeds, it can track your daily usage. You can see track your daily or monthly usage, and also see what programs are connected to the internet. Unlike the other programs though, there is no quota reminder.  ​4. Cucusoft Net Guard This program has a very clean user interface that is easy to understand. Upon installing it, you’ll have to provide an email address to register for a free product code. After that, you can begin tracking your internet usage and even see what programs are connected to the internet. It also allows you to set your monthly quota with reminders sent to you as you near the limit.  ​5. ISP Monitor ISP Monitor is a lightweight program to easily track your daily or monthly internet usages. You’ll have to set it up first by changing the adapter settings under Settings > Traffic Monitor > Adapter to choose between a wired or Wi-Fi connection. Unlike the previous programs, you cannot set a quota reminder. It has easy-to-read logs where you can instantly see your daily upload and download usage.  ​ ",
            "date": "Answered March 14, 2015",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ranjith Ambekar",
                    "user_href": "/profile/Ranjith-Ambekar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nagen Bhai",
                "href": "/profile/Nagen-Bhai"
            },
            "answer_text": "Well, I guess they have some systems/ mechanism/ algorithm/ software in place to measure the amount of data (bytes or bits) that are being transferred or received by the IP address allocated to us. ",
            "date": "Answered March 14, 2015",
            "views": "265",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pezoh Hope Nchotinjem Jum",
                    "user_href": "/profile/Pezoh-Hope-Nchotinjem-Jum"
                },
                {
                    "user_id": "Jaiveer Rathore",
                    "user_href": "/profile/Jaiveer-Rathore-5"
                },
                {
                    "user_id": "Rituraj Hazarika",
                    "user_href": "/profile/Rituraj-Hazarika"
                },
                {
                    "user_id": "Deepa Gupta",
                    "user_href": "/profile/Deepa-Gupta-22"
                },
                {
                    "user_id": "Nayana Saikia",
                    "user_href": "/profile/Nayana-Saikia-1"
                }
            ]
        }
    ]
}