{
    "title": "How do messenger pigeons work? How do they know where to go? - Quora",
    "tags": [
        "Messenger Pigeons",
        "Animal Training",
        "How Things Work",
        "Birds"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sajjad Ali",
                "href": "/profile/Sajjad-Ali-147"
            },
            "answer_text": "so like a few hundred years ago 17th 18th century when there were no cars phones planes bikes how would one teach a homing pigeon at point A to go to point B which would be a few 100 miles away or more. lets see so it would be such a long distance that one could not send a messenger on a horse as they did exist but rather a pigeon as it would fly and be faster , compare the speed and distance covered by a horse at a stretch without stopping compared to a pigeon flying , still both horse and pigeon would tire after traveling a certain distance at a stretch stop for food or atlast water. a messenger being a human being\\ person\\ man on a horse would start at point A and ride his horse to point B and deliver the message. A homing pigeon at Point A would know of point A Home but would not know where to take the message or note tied to its leg to point B as it probably could not be told to fly north a 100 miles turn left and then enter the big grey castle OR THE SHABBY brown HUT ?? . However the human messenger on the horse could have decided to take the pigeon from point A to Point B and not in a bag pack or cage cause that wouldn't work cause the pigeon wouldn’t really be flying and probably not have enough road sense to observe where the hell it was going unless the pigeon had gps a few thousand years ago or a few hundred if that makes a difference, so while he rode on his horse the man on the horse tied a thread to the pigeons foot not too long not too short mabe like a helium balloon size thread 3–4 feet max or more ??? and while he rode on his horse from point A to B the pigeon with the thread tied to its foot flew above them and continued flying with the man and his horse until they reached point B. This way now the pigeon is aware of point B. and as a homing pigeon it remembered its home base Point A it also get familiar with Point B as the king makes a nice Home for the pigeon who rests for a few days making itself familiar with its new home point B then attached a note on the pigeons foot and flings it in the air , the pigeon with its pigeon sized brain only knew\\knows of going back home to point A and flew\\flies back home to the Queen at Home base A with the message attached to its foot. when the queen opened\\opens the note\\ letter the pigeon had brought back from the King it said ‘‘don't you have a fucking cell phone’’ to which the queen wrote on a note ‘no i dont they haven't been invented yet’’ then she tied the note to the pigeons foot who after a few days rest was flung in the air by the Queen and as the pigeon was aware of point B and Home base B returned back to the King. The Homing pigeon now had 2 homes Home Base A and Home Base B. The king then read the note attached to the pigeons foot and thought to himself ‘ hmmm well this is a way to communicate and talk and if there are no telephones or cell phones or computers and internet then this is the only way to send messages though its more one sided conversation and a slow way but still manageable thus the pigeon who was now tired rested for a few days at Home Base B while the king wrote a long letter rather than sending a short note sort of like a page long . but as paper is lightweight the pigeon had no problem from delivering notes to longer one page letters and then the King tied the letter to the pigeons foot and flung it once again in the air and the homing or STOOL pigeon then flew back to hOME bASE pOINT A .the king then realised if this one Homing pigeon of both point A AND POINT B continued on like this flying a few 100 miles journey every few days IT would certainly die of exhaustion without even earning any flyers club reward points so tHIS WAY OTHER PIGEONS WERE ALSO TRAINED AND the man on the horse would now take 4–5 pigeons with strings and threads attached to their feet and while he rode on his horse from point A to Point B THE PIGEONS WOULD FLY above him and his horse and it would look like a bunch of white balloons hovering above the horse or so it is or was written in the lost history books which got destroyed with all the others books at the library of alexandria along with the library of alexandria itself .now however the burden of delivering letters was shared by the pigeons who would take turns in taking and bringing back letters. Thus this is how pigeons learned or were forcefully taught to deliver messages from Point A to Point B in the olden times. Thank you. Love and Peace ",
            "date": "Answered April 23, 2019",
            "views": "156",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shashank Rana",
                    "user_href": "/profile/Shashank-Rana-24"
                },
                {
                    "user_id": "Thara Subramoni",
                    "user_href": "/profile/Thara-Subramoni"
                },
                {
                    "user_id": "Thomy Fun",
                    "user_href": "/profile/Thomy-Fun"
                },
                {
                    "user_id": "John Jatt",
                    "user_href": "/profile/John-Jatt-1"
                },
                {
                    "user_id": "Omar Preet Singh Bali",
                    "user_href": "/profile/Omar-Preet-Singh-Bali-1"
                },
                {
                    "user_id": "Logan Lovell",
                    "user_href": "/profile/Logan-Lovell"
                },
                {
                    "user_id": "Ley Escalante",
                    "user_href": "/profile/Ley-Escalante"
                },
                {
                    "user_id": "Abhiyan Kharel",
                    "user_href": "/profile/Abhiyan-Kharel"
                },
                {
                    "user_id": "Imran Pathan",
                    "user_href": "/profile/Imran-Pathan-27"
                },
                {
                    "user_id": "Divya Gopal",
                    "user_href": "/profile/Divya-Gopal-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mitch Rezman",
                "href": "/profile/Mitch-Rezman"
            },
            "answer_text": "I wrote this 4 years ago but it still holds up  Pigeons have been used to communicate over distances since the time of Julius Caesar. The Persians (now Iran), and even the Greeks used homing pigeons to \"broadcast\" news about who won the Olympics. Homing pigeons were considered highly prestigious way back in 18th century France until the French Revolution which changed things so anybody who wanted one, could have a pigeon. During the Franco Prussian war, Parisians used hot air balloons to deploy flocks of homing pigeons out of their city to countryside and vice versa. With the advent of micro photography in the 19th century pigeons could carry as many as 30,000 messages by a single bird. When World War I began, armies in Europe used many homing pigeons. General John Pershing saw this and implemented the Army signal Corps which was the first military form of a pigeon communication system. The numbers are sketchy but it's believed more than 500,000 birds were used by the world armies during World War one. Pigeons were highly respected because they had over a 90% delivery rate which proved to be literally life-saving for soldiers on the front line. Putting things in perspective, at the time about the best shot they had at communicating was the telegraph - which required permanent poles & wires. Cher Ami was the name of one of the most famous WWI homing pigeons saving an entire French battalion in spite of German soldiers shooting out the birds eye, it's chest and a leg. the bird was able to fly 25 miles in this condition to the command post which stop the shelling and saved countless lives. The bird actually healed up, was given an honorary Service Cross and after his death it was mounted in place at the Smithsonian Institute. Without war the birds weren't that necessary to the military but homing pigeons were put back in service when WWII began. The Germans had maintained a large contingent of pigeons, almost 50,000 whereas the US let it's pigeon population dwindle and had to reboot the program from scratch. When entering the military at that time, if you had a poultry or pigeon background you were put to work as a pigeoneer in the military In 1941 the veterinary service for Army Signal Pigeons was assigned to Fort Monmouth, New Jersey which became a breeding and training center. This is where signal pigeons were bred, trained and deployed under the guidance of the Pigeon Service which was now an arm of the Army Signal Corps In 1942 Fort Monmouth changed its name to camp Alfred Vail and began developing basically the perfect vision for the military. Later that year the entire operation was moved to Camp Crowder Missouri where it remained until after V-J day when the program moved back to Fort Monmouth  By mid WWII the Army had more than 50,000 birds and began to focus on pigeon health trying to ensure against introducing pigeon borne diseases which affected the birds and other animals as well as human beings. Pigeons were given inoculations, diagnostic investigating studies were initiated which all help to establish controls against diseases of pigeons. It took about 8 weeks to train a pigeon after hatching. When the bird was about 4 weeks old it was moved to a mobile loft which was moved daily over the next few weeks three times a day morning, noon and night. At eight weeks if the bird could fly for an hour, they would begin to move them farther flying from 50 or more miles out and then even farther until it was determined they were ready for combat. Once on the front, handlers learned incentives that would make the birds fly faster. Even though hunger was a good motivator, sex and jealousy proved even more powerful. Trainers would introduce a new male to the mate of a male about to leave on a mission. Birds anyways returned faster if they knew another suitor was milling about back home in the coop.   Human B-17 pilots and crews had to wear oxygen masks and heated suits at 20,000 feet. Pigeons were fine with just their well, feathers. As high as 35,000 feet with temperatures 30 below and colder, these durable little creatures would sit with eyes half closed and fluffed up feathers for warmth. Initially the military designed and used special drop boxes. The thinking was these would prevent the birds wings from being ripped off in the slipstream after release. These drop boxes would open at predetermined altitudes. Ironically it was soon learned they could let birds out at very high altitudes at speeds approaching 400 MPH using a paper grocery bag. The handler would slit the side and place the bird in head first then neatly fold the bag around the bird. Once dropped into the slipstream the bag would unfurl allowing the bird to spread his wings and then spiral down to \"cruising altitude\"  More than 300,000 pigeons were used overseas although veterinary practice was not implemented uniformly in all the war zones because of the newness of the concept of military vet veterinary medicine for the Army pigeon service. To introduce military veterinary medicine into the Army pigeon service human trainees were given more than 25 hours of instruction on that very subject during their eight week training program. One of the big problems was that the manuals they were learning from were woefully out of date. As an example, although a pigeon's pox vaccine had been developed more than a decade earlier it was never mentioned in the curriculum. Neither was salmonellosis (or pigeon paratyphoid) which was the most devastating disease of signal pigeons during World War II. Salmonellosis,a bacterial infection, caused a form of lameness named \"wing droop\". It was the single leading cause of pigeon death during the war. And spite of investigation of this disease by both the Army and civilian labs no vaccine was ever developed thus the army relied heavily on coop sanitation and the quarantine of sick birds Housing too many pigeons in one area was obviously a big problem too. A standard mobile pigeon coop would arrive in a war theater but were immediately remodeled based upon climactic conditions. It was important to have coops exposed to sunlight, be dry and draft free and above all they needed to be clean. The Surgeon General's office provided Information as early as 1922 listing supplies, pharmaceuticals and disinfectants which could then be used by pigeon service personnel to keep pigeon coop's clean and parasite free. At the time the Army suggested sodium fluoride for the control of pigeon lice. One of the companies in France built some open aviaries to provide additional room but encountered seasonal rains and 2500 of it's 3500 pigeons got sick. Illness was a problem across all the theaters where veterinary losses were almost equal to in-flight losses. Veterinary losses were reduced by not introducing replacement pigeons and encouraging breeding. Veterinary and quarantine coops were introduced to help reduce this phenomena.  In spite of the fact that the Signal Paging Company was authorized as its own organic service unit no veterinary reports on individual pigeons were ever maintained. Feeding that many birds was also a big problem. Large quantities of feed packed in burlap bags acquired from various zones of the interior by the Signal Corps often came deteriorated or unusable by the time it arrived in the various overseas theaters. The bags were torn up or rodent infested and became damp, moldy or vermin infested from being at sea so long. As much as they tried the Army veterinary service was unable to remove the damaged grains without causing an imbalance of the overall nutrition value of the feeds. This problem was addressed by fumigating the seed then packing into hermetically sealed tin containers towards the end of the war. The 281st Signal Pigeon Company at Fort George G Meade Maryland was successful administering vitamins after realizing the birds had certain vitamin deficiencies from eating the regular pigeon feed. They were then authorized to acquire 45,000 multivitamin capsules for each pigeon company. It wasn't until 1942 the Army finally authorized an organic veterinary detachment for all the pigeon units deployed overseas. Each unit of a veterinary Corps had an officer who was either first Lieut. or Capt. and then one enlisted technician. A company unit was divided into three combat platoons each with 1500 pigeons. By organizing the birds in this way the Army was able to determine the necessary medicines and medical instruments to maintain every unit. Although radios were brought into service at this time pigeons were still used when radio silence was necessary. Even after the war ended pigeons were used to cross the English Channel between England and France. The counter moves by both countries created falconry programs. The problem was the Falcons could never differentiate the nationality of the carrier pigeons.  As a caveat to this article you'll find it amazing how far pigeons have come into the mainstream as illustrated by the recent purchase of a racing pigeon named Bolt that sold for $400,000. written by mitch rezman approved by catherine tobsing ",
            "date": "Answered August 7, 2017",
            "views": "594",
            "upvotes": " View 125 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Greg Lockwood",
                    "user_href": "/profile/Greg-Lockwood-7"
                },
                {
                    "user_id": "Inivas Ahgnisabus",
                    "user_href": "/profile/Inivas-Ahgnisabus"
                },
                {
                    "user_id": "Thomy Fun",
                    "user_href": "/profile/Thomy-Fun"
                },
                {
                    "user_id": "Ayu Nazrah",
                    "user_href": "/profile/Ayu-Nazrah"
                },
                {
                    "user_id": "Jayprakash Maurya",
                    "user_href": "/profile/Jayprakash-Maurya-9"
                },
                {
                    "user_id": "Mohammad Javad Habibollahi",
                    "user_href": "/profile/Mohammad-Javad-Habibollahi"
                },
                {
                    "user_id": "Alieu Sanyang",
                    "user_href": "/profile/Alieu-Sanyang-3"
                },
                {
                    "user_id": "Emery Smith",
                    "user_href": "/profile/Emery-Smith-17"
                },
                {
                    "user_id": "Amber Lane",
                    "user_href": "/profile/Amber-Lane-14"
                },
                {
                    "user_id": "Stacy Snow",
                    "user_href": "/profile/Stacy-Snow-11"
                }
            ]
        }
    ]
}