{
    "title": "How do cell phone towers transmit so far? - Quora",
    "tags": [
        "Cell Towers",
        "Wireless Technology",
        "Cellular Service Providers",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Allen",
                "href": "/profile/Paul-Allen-213"
            },
            "answer_text": "It’s just physics. EM waves keep traveling forever unless something blocks them or cancels them out. They will be t0o faint to detect with a regular handset at some point so get a bigger antenna. Dutch astronaut André Kuipers recently accidentally called 911 from the space station so even a regular handset can call from 400km under the right circumstances. An actual cell hook up requires GSM sync so I suspect 700KM above the earth is about it for an actual conversation regardless of the size of the antenna but since the first cellular call was in the early 70’s, there are about 130 stars (not counting brown dwarf stars) that should be ‘hearing’ our cellular traffic. ",
            "date": "Answered February 27, 2019",
            "views": "273",
            "upvotes": " Answer requested by Ethan Hunter",
            "upvoters": [
                {
                    "user_id": "Kurt Behnke",
                    "user_href": "/profile/Kurt-Behnke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kit Kilgour",
                "href": "/profile/Kit-Kilgour"
            },
            "answer_text": "Well, fundamentally it is about the laws of physics and the power that they have - say up to 60 Watts, and partially the height they transmit from. The signal in open space will reduce with distance (very approximately 1/r^2.4 for a range r). Modern cellular technologies also enable arrays of antennae to direct the energy towards the cellphones, making things more efficient Note that you don’t actually need to make the towers transmit further and further away by pumping in more and more power. The range limitation is principally driven by the uplink from the cellphone to the tower. The cellphone will be limited to about 0.25W, so there isn’t any point trying to transmit to a range at which the cellphone doesn’t have signal strength to send anything meaningful back to the tower in a reasonably short space of time. ",
            "date": "Answered February 26, 2019",
            "views": "146",
            "upvotes": " View 1 Upvoter"
        }
    ]
}