{
    "title": "How does Google Fit work? - Quora",
    "tags": [
        "Google Fit",
        "How Things Work",
        "Health and Exercise",
        "Weight Loss and Fitness",
        "Exercise",
        "Google (company)",
        "Fitness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhijeet Berad",
                "href": "/profile/Abhijeet-Berad"
            },
            "answer_text": "The functionality of Google Fit app is it measures the duration you are walking or running, and also the number of steps all the time. Google Fit uses a mix of sensors(Accelerometer, Step counter, Significant Motion counter), Machine Learning and heuristics to get the data right. As per the algorithm, it periodically poll accelerometer and use Machine Learning and heuristics to correctly identify the activity and duration. For devices with hardware step counters, it uses these step counters to monitor step counts. For older devices, it uses the activity detected to predict the right number of steps. The algorithms in App merge these activities, steps and sometimes location to correlate and further increase accuracy. On some recent phones, there is a dedicated low-power CPU core that can serve as a pedometer as this core consumes very little power and can compute steps by itself without the need for the entire CPU or the GPS. ",
            "date": "Answered September 4, 2018",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Smile Pabby",
                "href": "/profile/Smile-Pabby"
            },
            "answer_text": "Answer is from an engineer on Google Fit team: Thanks for asking this question! Battery is one of our top most concerns and we work hard to optimize Google Fit's battery usage and provide a magical experience. Google Fit uses a mix of sensors(Accelerometer, Step counter, Significant Motion counter), Machine Learning and heuristics to get the data right. Our algorithm is pretty similar to your 1st option plus a little bit of magic. We periodically poll accelerometer and use Machine Learning and heuristics to correctly identify the activity and duration. For devices with hardware step counters, we use these step counters to monitor step counts. For older devices, we use the activity detected to predict the right number of steps. Our algorithms merge these activities, steps and sometimes location to correlate and further increase accuracy. We do not poll GPS to estimate steps or detect activities. -- Engineer on Google Fit Team. Source : Stackoverflow ",
            "date": "Answered April 18, 2016",
            "views": "108",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kunal SIngh",
                    "user_href": "/profile/Kunal-SIngh-593"
                },
                {
                    "user_id": "Krupa Kalyanpur",
                    "user_href": "/profile/Krupa-Kalyanpur"
                },
                {
                    "user_id": "Nagarajan Srini",
                    "user_href": "/profile/Nagarajan-Srini-1"
                },
                {
                    "user_id": "Dainy Varghese",
                    "user_href": "/profile/Dainy-Varghese"
                },
                {
                    "user_id": "Neha Ajith",
                    "user_href": "/profile/Neha-Ajith-5"
                },
                {
                    "user_id": "Barkha Chainani",
                    "user_href": "/profile/Barkha-Chainani-2"
                },
                {
                    "user_id": "Sumeet Baid",
                    "user_href": "/profile/Sumeet-Baid"
                },
                {
                    "user_id": "Nishant Raj",
                    "user_href": "/profile/Nishant-Raj-31"
                },
                {
                    "user_id": "Shubham Raj",
                    "user_href": "/profile/Shubham-Raj-16"
                },
                {
                    "user_id": "Irem Özen",
                    "user_href": "/profile/Irem-Özen"
                }
            ]
        }
    ]
}