{
    "title": "How are solar cells doped? - Quora",
    "tags": [
        "Thin Film Solar Cell Manufacturing",
        "Microelectromechanical systems (MEMS)",
        "Photovoltaics",
        "Semiconductors",
        "Solar Energy",
        "Manufacturing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joel Jean",
                "href": "/profile/Joel-Jean"
            },
            "answer_text": "I assume you're asking about the actual physical doping process, as opposed to the particular doping schemes that are typically employed. Quick background: We dope semiconductors—that is, introduce impurities into a pure crystal—to modulate their electrical properties, and in the case of solar cells, to create a PN junction and accompanying electric field that helps us separate the electrons and holes formed when light is absorbed. Suppose we have a silicon solar cell that we want to dope, using the typical dopants boron (for p-type) and phosphorus (for n-type). To introduce those impurity atoms without damaging the crystal structure, we can take several different approaches. Most commonly used for solar cells is a blanket doping process, in which a layer of glass or paste containing the desired impurities is placed in contact with the solar cell material, then heated. Heating gives the impurity atoms extra thermal energy, allowing many of them to break their chemical bonds and diffuse (i.e., travel randomly) into the cell material, where some manage to kick out intrinsic (Si) atoms and take their place as permanent dopants. But blanket doping is very imprecise and doesn't let us selectively dope certain parts of the material. To gain better control of the doping process—as well as simplify processing and improve surface passivation—some solar companies have recently moved to doping by ion implantation. In that process, impurity atoms are physically accelerated towards the semiconductor surface and get embedded in the material, and we can control the doping depth and profile by adjusting the energy of the ion beam as desired. ",
            "date": "Answered July 24, 2011",
            "views": "86",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shadab Dastgeer",
                    "user_href": "/profile/Shadab-Dastgeer"
                },
                {
                    "user_id": "Felix Zeng",
                    "user_href": "/profile/Felix-Zeng-2"
                },
                {
                    "user_id": "Stephen Lantin",
                    "user_href": "/profile/Stephen-Lantin"
                },
                {
                    "user_id": "Zefran Kockrin",
                    "user_href": "/profile/Zefran-Kockrin"
                },
                {
                    "user_id": "Milosh Dushkov",
                    "user_href": "/profile/Milosh-Dushkov"
                },
                {
                    "user_id": "Akhila Mallavarapu",
                    "user_href": "/profile/Akhila-Mallavarapu-1"
                },
                {
                    "user_id": "Masumi Nishida",
                    "user_href": "/profile/Masumi-Nishida"
                },
                {
                    "user_id": "Vikash Bibhuti",
                    "user_href": "/profile/Vikash-Bibhuti"
                },
                {
                    "user_id": "Imran Akbar",
                    "user_href": "/profile/Imran-Akbar"
                },
                {
                    "user_id": "Chinmay Nivargi",
                    "user_href": "/profile/Chinmay-Nivargi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Fan",
                "href": "/profile/Frank-Fan-1"
            },
            "answer_text": "Most crystalline silicon solar cells have a p-type base (almost the entire thickness of the cell) and a heavily doped n-type emitter (the top couple microns).  The n-type region has a doping concentration of a few orders of magnitude higher than the p-type base. The p-type dopant (boron) is added during the crystallization process--you grow large crystals of p-type material and slice them into purely p-type wafers. To introduce the n-type dopant (phosphorus), you usually stick the wafers in a diffusion furnace and flow a phosphorus-containing gas (usually POCl3) at high temperature.  The phosphorus diffuses a couple microns into the wafer, forming a junction on both sides. Of course, you only want a junction on the front side of the wafer.  To remove the back junction, an aluminum coating is printed onto the back.  After some thermal treatment, aluminum diffuses into the wafer and forms a p-type region on the back by counterdoping (aluminum is a p-type dopant). ",
            "date": "Answered October 16, 2011",
            "views": "35",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shifa Salam",
                    "user_href": "/profile/Shifa-Salam"
                },
                {
                    "user_id": "Aadi JAGADISH Kumar",
                    "user_href": "/profile/Aadi-JAGADISH-Kumar"
                },
                {
                    "user_id": "Alex Tremper",
                    "user_href": "/profile/Alex-Tremper"
                },
                {
                    "user_id": "Michael Domansky",
                    "user_href": "/profile/Michael-Domansky"
                },
                {
                    "user_id": "Milosh Dushkov",
                    "user_href": "/profile/Milosh-Dushkov"
                },
                {
                    "user_id": "Ankit Parikh",
                    "user_href": "/profile/Ankit-Parikh-3"
                },
                {
                    "user_id": "Elson Liu",
                    "user_href": "/profile/Elson-Liu"
                },
                {
                    "user_id": "Chinmay Nivargi",
                    "user_href": "/profile/Chinmay-Nivargi"
                }
            ]
        }
    ]
}