{
    "title": "How to connect my laptop to an old TV like a smart TV - Quora",
    "tags": [
        "Smart TVs",
        "Laptops",
        "Television"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Yun",
                "href": "/profile/Michael-Yun"
            },
            "answer_text": "While it’s possible to purchase an HDMI-to-Composite Video converter to allow signal to pass from your laptop to your old TV, I’d recommend not wasting your money. If your old TV only has a composite input (the yellow RCA video input), then the TV most likely only has a native resolution of 480i (720x480). Even if you get a higher end converter with a built-in scaler, any resolution that’s moderately useful on your laptop would look pretty horrible on your low resolution TV. The TV’s pixel density just isn’t dense enough for you to get a very sharp image if you’re scaling the signal, especially if you’re planning on reading a lot of text on this TV. If your TV has a YPbPr input (also known as component video and looks like a red, green, and blue RCA), it might support higher resolutions, but it really depends on the age of the TV. This would require an HDMI-to-Component Video converter. One last word of warning. If you decide to ignore my advice and purchase a video converter, make sure that you’re getting an HDMI-to-Composite converter and NOT a Composite-to-HDMI converter. Since you want to convert a digital signal (from your laptop) to an analog signal (on your TV), the circuitry involved only converts the signal in one direction. ",
            "date": "Answered April 19, 2017",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Calm Chen",
                    "user_href": "/profile/Calm-Chen"
                },
                {
                    "user_id": "Abdul Raheem",
                    "user_href": "/profile/Abdul-Raheem-1163"
                },
                {
                    "user_id": "David Corbitt",
                    "user_href": "/profile/David-Corbitt-2"
                },
                {
                    "user_id": "Kunal Gupta",
                    "user_href": "/profile/Kunal-Gupta-299"
                },
                {
                    "user_id": "Vivek Pandey",
                    "user_href": "/profile/Vivek-Pandey-124"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kendall Tisinger",
                "href": "/profile/Kendall-Tisinger"
            },
            "answer_text": "HDMI is your best bet. A TV needs to have the software for it. If it's a post 2013 samsung tv, it has a screen cast option but it's really bad. There's an allshare cast option but that's also totally unreliable. HDMI man. Best bet ",
            "date": "Answered April 19, 2017",
            "views": "278",
            "upvotes": "0"
        }
    ]
}