{
    "title": "How will online education change education in the future? - Quora",
    "tags": [
        "Formalized Online Education",
        "Future of Education",
        "Online Higher Education",
        "E-learning in Higher Education",
        "Educational Technology",
        "Education Reform",
        "Educational Systems",
        "E-learning",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Monica Kochar",
                "href": "/profile/Monica-Kochar-2"
            },
            "answer_text": "eLearning is slowly creating an alternate to the over present domination of education by a single most teacher! (All content is available for free online to study).It is giving an alternate to parents to tuitions. (A friend just subscribed to vedantu instead of hiring a tutor).It is making specialization obsolete. (I can learn any topic if I have a phone and internet).It is giving a chance to stay at home moms to earn. (A lot of freelancers are hired by edtech as remote workers and stay at home moms can earn).It is giving teachers a chance to hustle. (I started freelancing when working as a teacher).It is opening the doors for teachers for an alternate employment. (I moved away from teaching).It is giving classroom teachers a way to teach that is far better than board and chalk.It is making possible online training from any corner of the world.",
            "date": "Answered December 28, 2019",
            "views": "156",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abhishek Kumar Singh",
                    "user_href": "/profile/अभिषेक-कुमार-सिंह-Abhishek-Kumar-Singh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saloni Singh",
                "href": "/profile/Saloni-Singh-945"
            },
            "answer_text": "Online learning refers to the platform where a person can achieve knowledge-based on computer or internet-based training. Online learning is also known as e-learning which means electronic learning. The main purpose of online is learning to make a person capable to learn or get knowledge without physical content and without following the traditional way of education. It is very beneficial for the students who are not able to take admission in a well-developed college or school due to their financial condition. There are also many websites and YouTube channels that provide education without any cost. It also helps the children of the slums who don’t have enough money to gain proper educations. The online classes or online learning also changes the role of teachers and student. Now teachers can share their knowledge with the help of poets and students can raise their doubts without any hesitation. For example:- I have public fear and I am not able to ask questions in groups or front of lots of people. So, digital education provides me a platform where I can ask my question without any fear. There are also many advantages and disadvantages of e-learning. In e-learning the advantages are these platforms are mostly free or available at minimum cost. They are easily accessible and it's also helpful for them who are introverts, or having shy nature. It is also useful for the people for being unable to afford school and colleges, we can understand the main advantage in this lockdown period. There are also some disadvantages like it does not increase the confidence of students, it can't help students in making friends. It required internet connections and a suitable device too. The main importance of online learning is felt today when we all are in lockdown and these digital platform helps us to connect with our university and in completion of our semester courses. It plays an important role in students and learners life by providing a different platform of learning. ",
            "date": "Answered September 22, 2020",
            "views": "24",
            "upvotes": "0"
        }
    ]
}