{
    "title": "How will lead acid batteries be critical in the future? - Quora",
    "tags": [
        "Lead Acid Battery",
        "Lithium-Ion Batteries",
        "Electronic Batteries",
        "Acids",
        "Batteries",
        "Chemistry of Everyday Life",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Zucco",
                "href": "/profile/Frank-Zucco"
            },
            "answer_text": "A2A — Rakesh Tripathi — Thanks for asking the question!  ^ Portable Solar/Battery Eco-Arrow Board Sign — Image Credit: Wanco  ^ Solar/Battery Speed Calming Signs — Image: Solar Technology (SolarTech) ~~~~ Q. How will lead acid batteries be critical in the future? A. My company, and our colleagues who make and deploy portable solar-powered equipment, use many thousands of lead-acid batteries each year. Lead-acid batteries are used for portable safety, security, lighting, and power equipment like the examples shown in this answer.  ^ Sustainable Solar/Battery Portable Changeable Message Sign — PCMS—Image Credit: Wanco ~~~~ The examples above show solar-powered Traffic Safety Equipment that is critical to prevent traffic accidents. Companies like ours are leading the way in the conversion to more sustainable technologies, using PV solar, LED technology, and recyclable batteries.  Lead-acid batteries are the most recycled product there is. According to the U.S. Environmental Protection Agency (EPA), the most recycled product in North America is the lead-acid battery. Lead-acid batteries are recycled over 99% of the time, compared to 70.6% of aluminum cans and 67% of newspapers. This technology has proven for over 100 years.Apr 25, 2016 More Recyclable Than An Aluminum Can: Earth Day Report. As you might expect, companies like ours are looking at new technologies every day—in order to improve safety, sustainability, and economy for our world. Lithium-based batteries, and other battery chemistries, interest us greatly. They are not yet ready for use in our equipment. Here are the reasons: Still too costly—using them today would reduce the number of signs that can be used on the road, leading to a reduction in traffic safety. Relatively soon, we expect Li-ion battery prices to fall so as to be more competitive.Low lifespan in cold weather without heating—current lithium chemistries do not like to be charged below freezing. Our equipment is outdoors in the freezing cold all the time—and must recharge daily—during all daylight hours—using its solar panels. This would damage current Li-ion types unless we were running a heater on the batteries in cold weather. The constant supplemental heating required would waste energy and require much more solar and battery resources—reducing overall efficiency, sustainability and increasing cost. So we have to wait until battery chemistries and designs are available that do not require constant heating. There are dry Li-ion batteries on the horizon that look like they may eliminate this issue. This is not an issue for EVs, since they heat well during operation, and can be plugged in for recharging.Best use of Earth’s resources—EVs are the best use for the newer types of batteries at the moment. Trying to convert other industries prematurely would take away resources from where they are most needed for humanity.Weight—while excess weight can be an issue in battery-driven cars, it is an advantage in a trailer with a large sign attached. The large signs act as a sail—and catch the wind. The heavier the batteries are, the less likely a sign is to blow over in a hurricane or other storm. Our signs are tested to 72 mph (115 kph). With Li-ion batteries, the signs would require additional weighting. So, lead-acid batteries have a very important place in our future—at least until newer battery types are readily available, inexpensive, and can charge below freezing without heating. Because lead batteries are almost 100% recycled, they are very sustainable. At the same time, they contain lead which is very toxic to humans. So when it is time to switch to even more environmental batteries, we will. Leading companies are converting many of their trailers to more sustainable units today. Companies like mine are starting to replace Diesel light towers with solar light towers. Every year, heavy duty LED systems and PV solar systems get less and less expensive, gain a longer life span, and become more efficient and sturdy. This allows our light towers and signs to use less battery, less LED resources, less solar, less metal structure, etc. The improvements we are able to make every few months are remarkable. This is improving safety, sustainability and the quality of life on the planet. For now, lead-acid batteries and also petrol engines have an important role in transportation—both in vehicles, and the types of equipment shown here. Gradually, photovoltaic, electrochemical, electric and electronic advances are replacing the use of lead and fossil fuels, and greatly reducing monetary and environmental costs to our civilization.  ^ Solar/Battery Light Tower — Image: Wanco  ^ Solar/Battery Camera Unit — Image: Wanco o ",
            "date": "Answered October 24, 2020",
            "views": "378",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rakesh Tripathi",
                    "user_href": "/profile/Rakesh-Tripathi-216"
                },
                {
                    "user_id": "Hriday Bajaj",
                    "user_href": "/profile/Hriday-Bajaj"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        }
    ]
}