{
    "title": "How does the digital camera instantaneously translate light into pixels on the screen? - Quora",
    "tags": [
        "Pixels",
        "Computer Vision",
        "Image Processing",
        "Digital Cameras",
        "Digital Photography",
        "Visible Light",
        "Cameras",
        "Photography",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terry Mercer",
                "href": "/profile/Terry-Mercer-17"
            },
            "answer_text": "**Thank technology. ** First, the pixels must be exposed… Much like the x-ray machine, except it uses just regular light rather than radiation. The pixels are ‘in the sensor’ and they are photo sensitive, and their location and ‘response’ are assigned numbers. Much like the thermal transfer receipt you get at some stores… when you leave them in the sun light they turn light grey to full on black. Photo sensors are made up of tiny RGB (red, green, blue) pixels… which are light sensitive. The more like they are exposed to, the darker that section becomes, and that intensity or shade of darkness is assigned a number. The two most common light detecting sensors (in cameras) are either a **charge-coupled device (CCD)** or a **CMOS image sensor. **Some of the most expensive cameras have THREE SENSORS (usually CCD) - one for ‘R’ - one for ‘G’, and one for ‘B’, but those are mostly digital video cameras. When the shutter button is pushed, the ‘aperture’ (leafs inside the lens, usually) opens up, allowing light through from a given period of time (‘shutter speed’); which is two thirds of the ‘exposure triangle’ (ISO or ‘sensitivity to light’ is the third factor, and on your better cameras that sensitivity has greater adjustment capability, to capture images in lower light... or at faster shutter speeds, which ultimately means less time for the light to hit the sensor). The little computer inside a digital camera, electronically switches all these colored pixels on and off very quickly, based on the ‘number’ (intensity, and color) of light that was ‘captured.’ Now, that gets the pixels ‘exposed’ - BUT does NOT get you an image. For that, you need FOCUS, and either a lens, or pinhole opening (comparable to the length of exposure and amount of light). Then saved (to memory built into the camera or removable) Then ‘read’ and ‘translated’ by the tiny computer in the camera designed to ‘interpret’ the data that was saved from the sensor. Imagine looking out of a window at something… being able to FREEZE that image on to the glass, then having it break into 20 million little uniform pieces… that were sequentially numbered, with the exact color, shade, intensity, and focus saved onto that tiny piece of glass. That is sort of what a photo sensor does, really fast, digitally, with the ability to nearly instantly ‘reassemble’ the pieces 99.999999% of the time without problem. Most cameras ‘compress’ and ‘average’ (colors, shades, and intensities). That is basically what JPG images are, compressed images. Rather than 16.7 million shades of a color (for exactitude), the computer picks the closest match to that color out of 65,536 options, which is close enough for the average human eye… and a significant savings of space (to store the data) and time (to reassemble and transmit the data). The better the camera… the more pixels there are, allowing for both larger sizes and more color options, or faster capturing and saving of the pixel information. It’s science, on steroids. The ‘reassembly’ of the pixels is then transmitted to ‘the screen’ (much like a Television). Viola’ you can see the ‘window’ re-assembled. ",
            "date": "Answered September 16, 2019",
            "views": "129",
            "upvotes": " View Sharers"
        }
    ]
}