{
    "title": "How to be motivated every single minute - Quora",
    "tags": [
        "Advice for Daily Life",
        "Motivation",
        "Understanding and Maintaining Motivation",
        "Self Motivation",
        "Self-Improvement Advice",
        "Understanding Self-Improvement",
        "How-to Question",
        "Self-Improvement",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mini Khosla",
                "href": "/profile/Mini-Khosla"
            },
            "answer_text": "Thanks for A2A. Practically its not possible to be motivated every minute. Day to day so many ups and downs come in your life that you are bound to breakdown in some critical moments. But it depends entirely on your grit and outlook to come out of it and stride again.When your morale is already high, you won't need any advice or motivational thoughts, but whenever you are low in spirit, you can follow the below tactics (as many as possible):1. Listen to the music you like.  Though I would recommend you to hear some loud music rather than soft beats.  It invigorates you instantly and you feel like hitting a punching bag immediately.2. Think about the harder times you had earlier. The way you overcame it. If you were strong in those times, remind yourself you can do it again. If you didn't face those days  the way you should have, tell yourself, you are going to deal with it in a better way. Remind yourself that if those bad days didn't last forever, neither wont the current unfavourable situations.3. Go out for a stroll in a park or an area with lot of trees and flowers. 4. Try reaching out to people in similar situation and seeking their advice(positive people who give positive and practical advice), how they dealt with the situation. Else you can do some surfing and read about some extraordinary people who fought against all odds. In short , people who are less privileged than you.5. If you are really depressed go for hiking or trekking or any adventure trip for a day to your nearest place. It will definitely boost you up.6. Spend some more time with your loved one(s). Try to seek some advice from your partner. Even if he/she cant help you then too you will feel relieved after discussing your problems with him/her.7. Watch some comedy and inspirational movies (It really helps).8. Read some good books. Self-help, motivational, fiction or anything which you feel good to read. And one thing. Always try to face the situation, rather than running from it, however tough it seems. Sometimes. when you are face to face, things are not really that difficult and unfavourable , the way they look.  Facing them actually relieves you of your tension.All the best ! Two more important points:* Try to meditate each and every day. It will make a strong and powerful positive impact on your body and mind.* Write a journal daily. Try to vent out your ideas as well as negative thoughts. You will get up rejuvenated next morning, free to face the world, when you are free of those burdening thoughts. ",
            "date": "Answered September 7, 2015",
            "views": "19",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akshay PM",
                    "user_href": "/profile/Akshay-PM-8"
                },
                {
                    "user_id": "Dawn Turner Hildebrand",
                    "user_href": "/profile/Dawn-Turner-Hildebrand"
                },
                {
                    "user_id": "Keshav Sharma",
                    "user_href": "/profile/Keshav-Sharma-475"
                },
                {
                    "user_id": "Akash Kk",
                    "user_href": "/profile/Akash-Kk-1"
                },
                {
                    "user_id": "Aya Mass",
                    "user_href": "/profile/Aya-Mass"
                },
                {
                    "user_id": "Asad King",
                    "user_href": "/profile/Asad-King-12"
                },
                {
                    "user_id": "Hrishikesh Dhoran Patil",
                    "user_href": "/profile/Hrishikesh-Dhoran-Patil"
                },
                {
                    "user_id": "Srinivas Valakatla",
                    "user_href": "/profile/Srinivas-Valakatla"
                },
                {
                    "user_id": "Ravi Srivastava",
                    "user_href": "/profile/रवि-श्रीवास्तव-Ravi-Srivastava"
                },
                {
                    "user_id": "Balachander",
                    "user_href": "/profile/Balachander-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Kumar Mishra",
                "href": "/profile/Ashish-Kumar-Mishra-25"
            },
            "answer_text": "Let me share a story… I hope it might help you… The story of a boy… THE Boy which resides in all of us… The boy embarked on a journey to fulfill his dreams. Initially he was enthralled and excited, he was getting to learn new things, he thought of joining the elites and make his life meaningful. But after the initial “thrust” faded, the boy found himself alone, his conscience questioning his decisions and actions, his abilities were under scanner by his own mind. Questions were rising like high tides in his own mind which were drowning him to the core. He was gasping for breath, for a light to guide him through this “ self-imposed” excruciating experience. But to no help. The boy had run out of energy and he was left with only one question in mind “ was it all worth it, is he worth it. ?” The boy was finding all possible reasons for his state, family problems, college pressure , exams, relationship problems, post breakup trauma. But deep within he knew these are excuses to ease all his worries and back his cravings for the comfort zone which grew exponentially with more excuses he made. The boy had gone into a state of ignorance. He had missed on important aspects of one’s life and he was being oblivious to what opportunities lay ahead for him. Where did he go wrong. ? He had caught the disease of attitude. He had forgotten that the disease of attitude is the worst of all the diseases for no doctor in the world can cure this disease except you. Be your own doctor. He perhaps was being too attached to the results of his actions, which made him too blind to see what it takes to be among elites. He aptly remembered all those ideals and jargon like strong will power, unwavering faith , conviction, sincerity etc . But he forgot to live those golden words. He had forgotten that life is not a bed of roses, and he ought to stay in his comfort zone. Its been a while that he had tasted failure and even if he did , he failed to learn from his mistakes and his failures. The boy was being delusional. Swami Vivekananda had once said “ Each soul is potentially divine”. The same could be applied to the boy. He too is potentially divine, capable of fulfilling all his dreams and rendering exceptional services to the humanity. The boy needs to be rescued… but how? Lets tell the boy that everything works on the Law of equivalence. Goals will always be demanding some sacrifice at his end. Law of equivalence is the basic law that governs every aspect of life, everyone knows it , but only a few are really aware of it. Let’s awake the boy, make him aware, for awareness and compassion are basic tenets that his endeavor demands. There might be moments of lows and high in the his life, but the boy should not forget elementary physics that no surface is absolutely friction-less. Friction and brakes are indeed very necessary to keep one going. Don’t lay down your weapons boy. These are part and parcels of life, but commit not the mistake of not taking your share of lessons from these high and lows and emerging more robust, strong and invigorated in the journey called life. Each moment can teach us something, be aware and receptive to what it is, learn it in letter as well as spirit. Let’s take a resolve with the boy. Lets shackle all our worries and plan out our success. Initially it might be difficult and rather it is , to change your old habits, letting go of your precious comfort zone. Remember, during the launch of a spacecraft , maximum effort takes place during the launch to work against the earth gravity(analogous to the inertia of our mind and the body and its nature desire to remain in the comfort zone). Mark Buddha’s last words were, “Be your own light.” Enlighten the fire within, that cant’t be extinguished this time. And boy don’t look for immediate gratification. The puzzle of life , your journey will seem to be sorted out, just be patient and optimistic. Change your attitude. A wise person had once told “ Maan lo to haar hai, thaan lo to jeet hai”. Things are not as easy as they seem , nevertheless they are not that tough either. All that is desired from one is toughness, a strong will power, persistence , perseverance and a firm conviction that all the sacrifices he(she) has made so far are worth it and he is willing to make more sacrifices for his dreams are his own. “ Go big this time, Or Go home”. Best of luck BOY. ",
            "date": "Answered November 5, 2017",
            "views": "29",
            "upvotes": " View 42 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mara Waldmann",
                    "user_href": "/profile/Mara-Waldmann"
                },
                {
                    "user_id": "Rene",
                    "user_href": "/profile/Rene-118"
                },
                {
                    "user_id": "Sneha Trivedi",
                    "user_href": "/profile/Sneha-Trivedi-52"
                },
                {
                    "user_id": "Zoha Shahid",
                    "user_href": "/profile/Zoha-Shahid-1"
                },
                {
                    "user_id": "Rathod Bhargav",
                    "user_href": "/profile/Rathod-Bhargav-4"
                },
                {
                    "user_id": "Ashu Jha",
                    "user_href": "/profile/Ashu-Jha-38"
                },
                {
                    "user_id": "Antonio Boroša",
                    "user_href": "/profile/Antonio-Boroša"
                },
                {
                    "user_id": "Wolfie Mina",
                    "user_href": "/profile/Wolfie-Mina"
                },
                {
                    "user_id": "Ashutosh Sharma",
                    "user_href": "/profile/Ashutosh-Sharma-1755"
                },
                {
                    "user_id": "Sevda Ebrahimi",
                    "user_href": "/profile/Sevda-Ebrahimi"
                }
            ]
        }
    ]
}