{
    "title": "How to restore my WhatsApp chat history via mail - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Basma Kahin",
                "href": "/profile/Basma-Kahin-4"
            },
            "answer_text": "Restoring your chat history You can back up your WhatsApp data using Google Drive or a local backup. Local backups will be automatically created every day at 2:00 AM and they'll be saved as a file in your phone. Google Drive You can back up your chats and media to Google Drive, so if you change Android phones or get a new one, your chats and media are transferrable. How to back up to Google Drive Open WhatsApp.Tap Menu > Settings > Chats > Chat backup.You can tap BACK UP to create an immediate backup.You can also tap Back up to Google Drive to set a backup frequency.If you don't have a Google account already set up, tap Add account when prompted.Tap Back up over to choose the network you wish to use for backup. Please note that backing up over a cellular data network might result in additional data charges.",
            "date": "Answered July 16, 2018",
            "views": "472",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kenneth Simpson",
                "href": "/profile/Kenneth-Simpson-15"
            },
            "answer_text": "No such feature exists. WhatsApp messenger does offer “Export Chat” feature that allows you to export a particular WhatsApp conversations to a text file that you can forward to your email address. But there is not way to restore chats from an email. You have to backup your WhatsApp chats to either on your phone’s local storage or to Google Drive/iCloud to restore them later. You may refer to this article from the official WhatsApp website to know how to restore chat history on Android and iPhone: 1. On an Android device: WhatsApp FAQ - How to restore your chat history 2. If you are using using an iPhone: WhatsApp FAQ - How to restore your chat history I hope this will help you. ",
            "date": "Answered April 26, 2020",
            "views": "358",
            "upvotes": "0"
        }
    ]
}