{
    "title": "How will 5G change the mobile users’ experience? - Quora",
    "tags": [
        "5G (wireless communication)",
        "User Experience",
        "Wireless Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tarun Banerjee",
                "href": "/profile/Tarun-Banerjee-40"
            },
            "answer_text": "5G is coming and when it does, you’re going to interact with the device in your hand very differently from today. It’s indeed getting real, with multiple companies, the likes of Samsung and Huawei, announcing 5G devices just several weeks ago. US carriers rushing in to call dibs on the next-gen pie, eagerly launching 5G bundles and exclusives. That being said, the fifth generation of wireless network is still going to take a little longer than excitable carriers like Verizon and AT&T would have you believe. The complex infrastructure is still being developed and built up and the technology of everyday phones has yet to catch up. In the meantime, let’s clear the air; we’ve all read about what 5G promises cities, but what about the item we use the most? How does this insane leap in internet speeds change the way we use our phones? In short, 1G let us talk to each other. 2G gave us messaging. 3G let us use the internet outside our houses. 4G, while less of a leap, made everything faster and let us stream videos and load HD pictures in an instant, virtually leading to social media as we know today. And now, 5G is in retrospect the most significant leap forward, hypothetically tying together any device with a wireless connection with immense speed. ",
            "date": "Answered July 8, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zaffar Nasim Siddikee",
                    "user_href": "/profile/Zaffar-Nasim-Siddikee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karthik Venkatachalam",
                "href": "/profile/Karthik-Venkatachalam-7"
            },
            "answer_text": "With 5 g many new and smart things will be experienced but only thing is it’s network bandwidth is more so exposure to higher bandwidth mobile signal is more which will have effects on our human body for sure ",
            "date": "Answered July 7, 2019",
            "views": "18",
            "upvotes": "0"
        }
    ]
}