{
    "title": "How is air getting dehumidified when coming out of an air conditioner? - Quora",
    "tags": [
        "Air Conditioners",
        "Heating, Ventilation, and Air Conditioning",
        "Air Conditioning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nithesh Ramanan",
                "href": "/profile/Nithesh-Ramanan"
            },
            "answer_text": "Thanks for asking. I’m explaining in detail please read it fully. There are three types of temperatures Dry bulb tempWet bulb tempDew point tempDry bulb is the normal temperature you get to see in the thermometer. Wet bulb can be seen by covering the tip of the thermometer with a wet cloth and allowing air contact for a minute. By doing so, the water in the wet cloth will evaporate until the air around it has reached the limit of maximum moisture it can hold. Due to this evaporation, the temperature of the thermometer surface reduces and that reading is called the WET BULB temperature. Dew point temperature is something which can be found using Psychrometrics for a corresponding value of dry bulb and wet bulb. When the dry bulb temperature drops below the Dew point temperature, the moisture in the air which is in vapor form turns into dew or water. In hill stations you might see dew on leaves, car glass etc. This is because the temperature of that area has dropped below the dew point temperature. The more the temperature drops below the dew point, the more amount of vapor is converted into water. So here comes the answer. The same thing is done inside the Air conditioner. The air is drawn inside the Air conditioner and its temperature is dropped below the dew point temperature of that air. That is when drops of water comes out from an air conditioner and it is left outside the room through a pipe ( you would have noticed). That water is nothing but moisture in the air, your sweat, your spit etc. When you are in an Air conditioned room, you’ll not feel sweating because the amount of moisture in the air inside the room is kept low so that when you sweat, it rapidly evaporates even before you sense it ( comfort zone). Your skin gives out sweat all the time and you sense it only when the air around you has met the maximum moisture holding level (85% Relative humidity - Coastal areas). The air conditioner dehumidifies the moisture that you give out and also regulates the amount of moisture to be removed with the help of a Humidistat which is installed in the Air conditioner. If there are 3 people in a room then the surface temperature of the cooling coil inside the A.C will be 12 degree Celsius (assuming). Now two more enter the room. So for 5 people the coil temperature goes down to 10 degree Celsius because more people indicates more moisture being released into the atmosphere. Hope you understand the process. ",
            "date": "Answered May 13, 2016",
            "views": "19",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anand Sriram",
                    "user_href": "/profile/Anand-Sriram"
                },
                {
                    "user_id": "DR Abhishek Navik",
                    "user_href": "/profile/DR-Abhishek-Navik"
                },
                {
                    "user_id": "Cebe Chakaravarthi",
                    "user_href": "/profile/Cebe-Chakaravarthi"
                },
                {
                    "user_id": "Kalai Vanan",
                    "user_href": "/profile/Kalai-Vanan-33"
                },
                {
                    "user_id": "Keshavakrishnan S",
                    "user_href": "/profile/Keshavakrishnan-S"
                },
                {
                    "user_id": "Jeyamurugan Arumugam",
                    "user_href": "/profile/Jeyamurugan-Arumugam"
                },
                {
                    "user_id": "Aditya K H",
                    "user_href": "/profile/Aditya-K-H"
                },
                {
                    "user_id": "Aravind Srinivasan",
                    "user_href": "/profile/Aravind-Srinivasan-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shriraj Nair",
                "href": "/profile/Shriraj-Nair"
            },
            "answer_text": "If you take a water bottle filled with ice  and then pass air over it , you will realize that this air has become cold momentarily after it passes through the bottle.Reason being dew point which is the point at which vapour coverts to water is lower in the bottle than the temp of AirThe air has some heat and moisture in it when it comes in contact with a colder surface the moisture in the air tend to lose its heat to ice in bottle this cause the vapour to form into waterIn an aircondioner the bottle with ice is replaced by tube with colder refrigerant , when the refrigerant is in evaporator it has a dew point below the ambient air there by dehumidifing the air passing over it. ",
            "date": "Answered May 14, 2016",
            "views": "538",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vikas Singh",
                    "user_href": "/profile/Vikas-Singh-461"
                },
                {
                    "user_id": "Shashank Nair",
                    "user_href": "/profile/Shashank-Nair-8"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Ridham Patel",
                    "user_href": "/profile/Ridham-Patel-3"
                },
                {
                    "user_id": "Keshavakrishnan S",
                    "user_href": "/profile/Keshavakrishnan-S"
                },
                {
                    "user_id": "Robin McCarthy",
                    "user_href": "/profile/Robin-McCarthy-2"
                },
                {
                    "user_id": "Shariq Khan",
                    "user_href": "/profile/Shariq-Khan-18"
                },
                {
                    "user_id": "Aravind Srinivasan",
                    "user_href": "/profile/Aravind-Srinivasan-24"
                },
                {
                    "user_id": "Puja Sahu",
                    "user_href": "/profile/Puja-Sahu"
                }
            ]
        }
    ]
}