{
    "title": "How big can a plane get? - Quora",
    "tags": [
        "Airplanes",
        "Aviation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sebastian Trump",
                "href": "/profile/Sebastian-Trump"
            },
            "answer_text": "I instantly see a few problem with a extremely big plane (Comparable with the Airbus A380 or larger.) Firstly in a manufacturers point of view:The cost of hiring engineers to design and produce such a big plane.Designing a gigantic plane would require significant advances in many aspects of a plane such as materials, aerodynamics, safety, efficiency, engine capability and the list goes longer and longer that makes such a plane practical to produce. Which also without doubt adds a significant chunk of money into the cost of R&D as previously mentioned.Market interest and profitabilityThe current demand of large planes are steeply decreasing due to airlines prefering smaller and way more efficient twinjets which are more flexible, versatile and profitable. I will explain more later in a customers perspective.Referring to the two largest commercial planes currently available the Airbus A380 and the Boeing 747–8i , you can see that the orders for these planes are very low and are not benefiting the respective companies manufacturing them.Now on a customers perspective of utilising a plane this big.First and formost, cost. A plane this big will no doubt cost alot to operate due to many reasons. Fuel prices, mantainence, crew costs keep on increasing and also they have to make a huge bet that they are able to fill all of the seats to make utilising a plane like this cost effective. A plane this big would definitely require more complex mechanisms in it which increases the points of failure and would need much experienced engineers to mantain the safety.Versatility and flexibility. Imagine the wingspan needed to generate enough lift for the plane. Which instantly limits it to only certain routes and airports.Thats it. I hope I am able to help you. I apologise in advance for any mistakes and for my excessive use of layman language as I am still in middle school and not exposed to many professional language. Sources: Other similar questions here on QuoraThe internetReadingCommon Sense",
            "date": "Answered January 20, 2017",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pete Laberge",
                    "user_href": "/profile/Pete-Laberge"
                },
                {
                    "user_id": "Carl Bussmann",
                    "user_href": "/profile/Carl-Bussmann"
                },
                {
                    "user_id": "Brian Seward",
                    "user_href": "/profile/Brian-Seward-2"
                },
                {
                    "user_id": "Görkem Coşkun",
                    "user_href": "/profile/Görkem-Coşkun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vega Handojo",
                "href": "/profile/Vega-Handojo"
            },
            "answer_text": "At present it is unlikely that an aircraft can get much larger than the A380. Reasons: 1. On the A380 the wing root is made veeery thick to be able to transfer the huge wing load into the fuselage, otherwise the material would not withstand the loads. A larger and heavier aircraft would require a thicker wing root and it is not desirable because of the higher aerodynamic drag.  Source: airliners.net 2. Airport gates around the world only have space for aircrafts with 80 m wingspan and 80 m length. If bigger aircrafts want to roll to the gate, they need foldable wingtips or comparable devices, however those devices would increase the weight (more structural reinforcements, actuation system etc.). 3. Indeed configurations like Blended Wing Body (BWB) allow a more even load distribution and do not need a massive wing-fuselage intersection, which allows a larger wingspan. However the public acceptance of such configuration is not very good: only a few people have window seats, or during turns passangers on the flank part of the cabin might experience high vertical accelerations... And as engineer I must also say that the modeling of such an aircraft is not easy.  Source: Nasa ",
            "date": "Answered February 26, 2017",
            "views": "528",
            "upvotes": " View 366 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mohammed A",
                    "user_href": "/profile/Mohammed-A-168"
                },
                {
                    "user_id": "Prashanth Sridhar",
                    "user_href": "/profile/Prashanth-Sridhar-3"
                },
                {
                    "user_id": "Atul Choudhary",
                    "user_href": "/profile/Atul-Choudhary-8"
                },
                {
                    "user_id": "John Hobgood",
                    "user_href": "/profile/John-Hobgood-3"
                },
                {
                    "user_id": "Jamaal Jesse",
                    "user_href": "/profile/Jamaal-Jesse"
                },
                {
                    "user_id": "Partha Aich",
                    "user_href": "/profile/Partha-Aich-11"
                },
                {
                    "user_id": "Trevor Athaide",
                    "user_href": "/profile/Trevor-Athaide"
                },
                {
                    "user_id": "Joseph Moudi",
                    "user_href": "/profile/Joseph-Moudi-1"
                },
                {
                    "user_id": "Christopher Alger",
                    "user_href": "/profile/Christopher-Alger-2"
                },
                {
                    "user_id": "Stu Lewine",
                    "user_href": "/profile/Stu-Lewine"
                }
            ]
        }
    ]
}