{
    "title": "How are scientific revolutions and technological revolutions linked? - Quora",
    "tags": [
        "Technological Revolutions",
        "Scientific Revolutions",
        "Revolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Foster",
                "href": "/profile/John-Foster-175"
            },
            "answer_text": "There are many instances of scientific and technological revolution's following one another in the order. One example would be the technological advancement in astronomy through the invention of the telescope around 1606 by the Dutch for naval warfare, which was followed by a scientific revolution in astronomy. History of the telescope - Wikipedia At the time, the Catholic Church held the ruling opinion on all moral and scientific matters - including that the Earth was the center of the universe. Galileo, though use of the telescope, observed the moon, then Jupiter, its moons, then theorized the heliocentric universe (the sun being the center of the universe - or what everyone thought was the universe at that time - you get the point) in 1610. Unfortunately, he was thereafter committed to house arrest for the remainder of his life for his heresy against the Church’s beliefs. However, his progress caused a great leap in scientific understanding of our our place in the universe. Galileo affair - Wikipedia An example in the opposite direction is the light wave/particle behavior principle proven by Albert Einstein, whereas light behaves both as a wave AND as a particle. Another huge leap in scientific understanding of our universe. Wave–particle duality - Wikipedia What followed because of that discovery and scientific revolution is nothing short of a technological explosion including the television, the electron microscope, and digital cameras. The modern world. ",
            "date": "Answered October 19, 2017",
            "views": "285",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dutta Sai",
                    "user_href": "/profile/Dutta-Sai-1"
                },
                {
                    "user_id": "Tobi C",
                    "user_href": "/profile/Tobi-C"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debashis Panda",
                "href": "/profile/Debashis-Panda-14"
            },
            "answer_text": "After Galileo was convicted and imprisoned, the repression of churches was so rigorous that the scientific revolution started drifting towards the northern Atlantic states like England, Holland and France. And many more faces came up like, Rene Descartes, Francis Bacon, William Harvey, William Gilbert and many more. That period, Bacon emphasized that, everything that is for the welfare of the society should be considered as science. So, people started drifting from astronomy to field like heat and electricity and industries started to be set up. After that, the scientific revolution started drifting towards industrial revolution and hence the technological market. Regards,The Monotonous Panda ",
            "date": "Answered November 15, 2017",
            "views": "292",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Himanshu Gupta",
                    "user_href": "/profile/Himanshu-Gupta-1272"
                },
                {
                    "user_id": "Rahul Meena",
                    "user_href": "/profile/Rahul-Meena-100"
                },
                {
                    "user_id": "Yatharth Singh",
                    "user_href": "/profile/Yatharth-Singh-7"
                },
                {
                    "user_id": "Ashwin Bale",
                    "user_href": "/profile/Ashwin-Bale"
                }
            ]
        }
    ]
}