{
    "title": "How to use a Bitcoin ATM - Quora",
    "tags": [
        "Automated Teller Machines (ATMs)",
        "Virtual Currencies",
        "Bitcoin"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glen Boston",
                "href": "/profile/Glen-Boston-1"
            },
            "answer_text": "All Bitcoin ATMs allow you to use cash to buy Bitcoin. And many of these kiosks also allow you to sell Bitcoin and receive cash. You can also insert cash and have it sent to someone else’s Bitcoin wallet, or account. You just need a smartphone. Here’s how: Firstly I will recommend Allcoinhodler Cryptocurrency Investment Platform (www.allcoinhodler,com) as it is relatively new (launched at mid-summer 2017) but has become the largest cryptocurrency Investment Platform there is right now (total volume over 4 billion dollars) where you get double of your invested cryptocurrency after 7 days. Supports variety of cryptocurrency like Bitcoin, Ethereum, Bitcoin Cash and Litecoin. I find that it has a really nice UI and support. Buying Bitcoin with an ATM The process is quite simple and most Bitcoin ATMs work in the same way. You create an account with the Bitcoin ATM operator, privately establishing your identity.You need a Bitcoin wallet that will securely store the records of all of your Bitcoin transactions, and this can be done easily with a downloadable app for your smartphone.Insert cash into the ATM, and indicate which Bitcoin wallet address you want to send it to. Let’s say you insert $100. The Bitcoin ATM operator then sells you $100 worth of Bitcoin at the market price at that moment, minus their own operating fee. Some operators also deduct the miner’s fee.You receive a confirmation that your Bitcoin wallet now holds the secure record of this transaction, proving that you own that $100 worth of Bitcoin, minus the fees.NOTE: Not all Bitcoin ATM operators are the same! Some take longer to complete transactions than others, and the fees charged can be quite steep. And if you have problems, it can be really hard to get customer support. Selling Bitcoin with an ATM If you own Bitcoin, then you already have a Bitcoin wallet. Many people have more than one wallet, so you need to decide in advance which wallet and key you want to use to sell your Bitcoin. If you don’t already have an account with a Bitcoin ATM operator, you will need to create one.Then, using one of their Bitcoin ATM kiosks, you log in to your account, indicate how much Bitcoin you want to sell, and which wallet address you want to sell from.This transaction needs to be verified on the Bitcoin network, or blockchain, and you will receive notification when it has been verified and you can withdraw your cash. This takes longer than buying Bitcoin, and different operators require more time than others.NOTE: Different operators also have different levels of customer service, if any, so it pays to do your research in advance and do business with a Bitcoin ATM operator who is reputable, and has fast, reliable customer service.As with buying Bitcoin, the ATM operator will charge a fee for the transaction, so the cash you collect will be minus the operator’s fee and possibly also the miner’s fee. Depending on the current market value of Bitcoin at the time of your sell transaction, it may be worth more or less than you paid for it originally.Sending Cash to Someone Using a Bitcoin ATM You can send Bitcoin to someone else by selling some of your Bitcoin and having it sent to their Bitcoin wallet. But if you want to send cash to someone, and not sell your Bitcoin to do it, here’s how: You will need to have an account with the Bitcoin ATM operator.Log in to your account on their Bitcoin ATM kiosk and indicate the amount of cash you want to send, and the address of the Bitcoin wallet you are sending it to.Insert cash and it will be deposited in the recipient’s Bitcoin wallet in the form of Bitcoin that they can then cash in and withdraw.",
            "date": "Answered February 3, 2020",
            "views": "29",
            "upvotes": " View 931 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brandon Lawrence",
                    "user_href": "/profile/Brandon-Lawrence-165"
                },
                {
                    "user_id": "James Walters",
                    "user_href": "/profile/James-Walters-254"
                },
                {
                    "user_id": "Alan Winston",
                    "user_href": "/profile/Alan-Winston-10"
                },
                {
                    "user_id": "Justin Tucker",
                    "user_href": "/profile/Justin-Tucker-168"
                },
                {
                    "user_id": "Nathan Philips",
                    "user_href": "/profile/Nathan-Philips-8"
                },
                {
                    "user_id": "Mark Harrison",
                    "user_href": "/profile/Mark-Harrison-650"
                },
                {
                    "user_id": "Justin Parry",
                    "user_href": "/profile/Justin-Parry-15"
                },
                {
                    "user_id": "David Whittaker",
                    "user_href": "/profile/David-Whittaker-118"
                },
                {
                    "user_id": "Orlando Jeffery",
                    "user_href": "/profile/Orlando-Jeffery-1"
                },
                {
                    "user_id": "Nicholas Fisher",
                    "user_href": "/profile/Nicholas-Fisher-77"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Batchelor",
                "href": "/profile/Justin-Batchelor-9"
            },
            "answer_text": "Usually you can buy and sell bitcoin at these type of atms. You can always at least buy Bitcoin by inserting cash into the atm. You will be asked to scan your i.d. or enter your phone number at atm . There are three different types of bitcoin atms that I have seen. Some work by asking you to first sign up with the operator of the atms site like coinme does with there coinstar machines. They ask you to enter your phone number you have attached to the account. After depositing cash into the machine you get a slip with a code that you enter on there site. The Bitcoin is transferred to your wallet after 30 minutes to an hour. Another way the atms can be setup is where after scanning your i.d and depositing the money into atm the coin will be sent directly to the wallet you have created on there site within 30 minutes to an hour but without having to enter any codes. They also may have you enter your wallet address at the atm and then deposit cash into atm and the coin is sent to the wallet of your choosing. I have seen all three options. Also you may be able to use the atm to get cash from selling bitcoin. You once again sign up with there site and send them the Bitcoin you want to sell after agreeing to there sell price which is the price coin is valued at at time of transaction. Then you will be given a code to enter to withdraw the cash from atm. Not all atms allow this though . I would suggest contacting support for atm company to verify before going to atm to find out. *** All these options do involve a fee being taken by atm operator in order to facilitate transaction and they sometimes are relatively high fees** ",
            "date": "Answered January 12, 2020",
            "views": "213",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Donnie Holloway",
                    "user_href": "/profile/Donnie-Holloway-5"
                }
            ]
        }
    ]
}