{
    "title": "How has Cyberpunk 2077 ruined Cyberpunk? - Quora",
    "tags": [
        "Cyberpunk 2077 (2020 game)",
        "Cyberpunk",
        "Science Behind Science Fiction",
        "Dystopia",
        "Science Fiction (genre)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Hume",
                "href": "/profile/Paul-Hume-10"
            },
            "answer_text": "Hard to say. given that it won’t be out for about a year. Has it “ruined” the genre? Unlikely. Cyberpunk’s floruit was a few decades ago. Things that were fresh when Gibson and Sterling and others were writing them a few decades ago are pretty standard SF tropes now. CP2077 (like CP2020 in paper before it, and the other games in the genre) looks to be based on the commonest tropes in Cyberpunk: gritty urban environment, no moral constraints on players but what they bring with them, many many many fancy weapons and shiny tech. Cultural norms today exist to be squashed in Night City. Look at the controversy about gender fluidity as surfaced in one early demo/ad. I hope the people who were exercised about that never read George Alec Effinger’s Budayeen trilogy (another ground breaker in the CP genre). Their heads might explode. ",
            "date": "Answered November 16, 2019",
            "views": "502",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Vargas",
                    "user_href": "/profile/Michael-Vargas-163"
                },
                {
                    "user_id": "Thomas Narvaez",
                    "user_href": "/profile/Thomas-Narvaez"
                },
                {
                    "user_id": "Merc Trujillo",
                    "user_href": "/profile/Merc-Trujillo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ariel Williams",
                "href": "/profile/Ariel-Williams"
            },
            "answer_text": "This is a clickbaity question and I disagree with the premise completely. Firstly Cyberpunk 2077 is not even out yet. It won’t be out until April 2020. Secondly Cyberpunk 2077 can’t possibly ruin Cyberpunk considering the original creator of the Cyberpunk 2020 RPG, Mike Pondsmith was directly involved in every step of the creation of the game. This guy knows more about Cyberpunk than most anyone except maybe William Gibson. Mike literally created a timeline that goes from Cyberpunk 2013 (published in 1988), Cyberpunk 2020 (1990) Cyberpunk 3.0 2030’s (2005), through 2077 including Cyberpunk Red (2019–2020). The game seems to be as true to the spirit of the setting of the original RPG and the various Gibsonesque Cyberpunk novels and stories that inspired it as it could be. As with any genre you can’t really ruin it as genres change and adopt new concepts over time. ",
            "date": "Answered December 27, 2019",
            "views": "14",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gabe Stewart-Guido",
                    "user_href": "/profile/Gabe-Stewart-Guido-1"
                },
                {
                    "user_id": "James Hutchins",
                    "user_href": "/profile/James-Hutchins-12"
                },
                {
                    "user_id": "Miguel Valdespino",
                    "user_href": "/profile/Miguel-Valdespino"
                },
                {
                    "user_id": "Jaime Alonso Rodríguez",
                    "user_href": "/profile/Jaime-Alonso-Rodríguez"
                },
                {
                    "user_id": "Augustus Le",
                    "user_href": "/profile/Augustus-Le"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                }
            ]
        }
    ]
}