{
    "title": "How is climate change an existential threat? - Quora",
    "tags": [
        "Bernie Sanders",
        "Climate Change"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Troxler",
                "href": "/profile/James-Troxler"
            },
            "answer_text": "Climate change is an existential threat but not for the reason most people believe. The threat comes from the devious people trying to frighten the public into believing the hoax, P.T. Barnum would be proud of them. Believers have been driven so far down the rabbit hole that no scientific explanation will suffice. The light of truth must be used to flood the discourse with the words of those behind the hoax. I submit three quotes borrowed from fellow Quora Allen Rogers to illustrate the true behind the lie. Judi Bari, Principal organizer of Earth First! - \"If we don't overthrow capitalism, we don't have a chance of saving the world ecologically. I think it is possible to have an ecologically sound society under socialism. I don't think it is possible under capitalism.” Reported in the New American March 7th, 2013 and Inspiring Quotes | Inspiring Quotes | inspiringquotes.us Dr. John Holdren, Obama’s Science Czar - “A transnational “Planetary Regime” should assume control of the global economy and also dictate the most intimate details of Americans’ lives — using an armed international police force.” (His book, “Ecoscience” in 1977) Richard Benedick - Deputy Assistant of State, headed the policy divisions of the U.S. State Department said: “A global warming treaty [Kyoto] must be implemented even if there is no scientific evidence to back the greenhouse effect.” Quoted by Dixy Lee Ray in her 1990 book “Trashing the Planet” There are hundreds of quotes available that illustrate what is really going on in this scam. The world needs to know before we make the mistake of giving the hucksters the power to rule the world. ",
            "date": "Answered September 24, 2019",
            "views": "68",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Lucas",
                    "user_href": "/profile/Michael-Lucas-196"
                },
                {
                    "user_id": "Thane Wegner",
                    "user_href": "/profile/Thane-Wegner"
                },
                {
                    "user_id": "TL Winslow",
                    "user_href": "/profile/TL-Winslow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clare Livingston Bromley",
                "href": "/profile/Clare-Livingston-Bromley"
            },
            "answer_text": "Clmate change is not an existential crisis. Here is an excerpt from the petition to President Trump by Professor Richard Lindzen and around 300 “eminent scientists and other qualified individuals, including physicists, engineers, former Astronauts, meteorologists, immunology specialists, marine biologists, chemists, statisticians, doctors, military weather specialists, geologists, accountants, a former director of NASA, economists, soil specialists, mathematicians, hydrologists, environmental scientists, computer modelling specialists, and many more. It is a long list.” The full letter and petition is at the link below. “For far too long, one body of men, establishment climate scientists, has been permitted to be judges and parties on what the “risks to the Earth system associated with increasing levels of carbon dioxide” really are. “Let me explain in somewhat greater detail why we call for withdrawal from the UNFCCC. [United Nations Framework Convention on Climate Change] “The UNFCCC was established twenty-five years ago, to find scientific support for dangers from increasing carbon dioxide. While this has led to generous and rapidly increased support for the field, the purported dangers remain hypothetical, model-based projections. By contrast, the benefits of increasing CO2 and modest warming are clearer than ever, and they are supported by dramatic satellite images of a greening Earth. • The UN’s Intergovernmental Panel on Climate Change (IPCC) no longer claims a greater likelihood of significant as opposed to negligible future warming, • It has long been acknowledged by the IPCC that climate change prior to the 1960’s could not have been due to anthropogenic greenhouse gases. Yet, pre-1960 instrumentally observed temperatures show many warming episodes, similar to the one since 1960, for example, from 1915 to 1950, and from 1850 to 1890. None of these could have been caused by an increase in atmospheric CO2, • Model projections of warming during recent decades have greatly exceeded what has been observed, • The modelling community has openly acknowledged that the ability of existing models to simulate past climates is due to numerous arbitrary tuning adjustments, • Observations show no statistically valid trends in flooding or drought, and no meaningful acceleration whatsoever of pre-existing long term sea level rise (about 6 inches per century) worldwide, • Current carbon dioxide levels, around 400 parts per million are still very small compared to the averages over geological history, when thousands of parts per million prevailed, and when life flourished on land and in the oceans. “Calls to limit carbon dioxide emissions are even less persuasive today than 25 years ago. Future research should focus on dispassionate, high-quality climate science, not on efforts to prop up an increasingly frayed narrative of “carbon pollution.” Until scientific research is unfettered from the constraints of the policy-driven UNFCCC, the research community will fail in its obligation to the public that pays the bills.” Professor Richard Lindzen, PhD. Alfred P. Sloan Professor of Meteorology, Department of Earth, Atmospheric and Planetary Science, MIT. WikiLeaks cables reveal how US manipulated climate accord ",
            "date": "Answered October 17, 2019",
            "views": "128",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "TL Winslow",
                    "user_href": "/profile/TL-Winslow"
                },
                {
                    "user_id": "Karine Le",
                    "user_href": "/profile/Karine-Le"
                },
                {
                    "user_id": "Paul Darling",
                    "user_href": "/profile/Paul-Darling-7"
                },
                {
                    "user_id": "Dennis Strope",
                    "user_href": "/profile/Dennis-Strope"
                },
                {
                    "user_id": "Nicholas Gonzalez",
                    "user_href": "/profile/Nicholas-Gonzalez-90"
                },
                {
                    "user_id": "Ian Sutton",
                    "user_href": "/profile/Ian-Sutton-5"
                }
            ]
        }
    ]
}