{
    "title": "How is technology changing, improving, etc the world right now? - Quora",
    "tags": [
        "Changing the World",
        "The World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nitika Aggarwal",
                "href": "/profile/Nitika-Aggarwal-38"
            },
            "answer_text": "The usage and implementation of technology is endless. Lets talk about IoT. Right from Home/Business Automation to Healthcare, from Retail to Transportation, you think of it and IoT is there. Today we have stepped into a smarter world and a life full of convenience. There are many areas wherein IoT based solutions touch our lives. A few are mentioned below: Home Automation After a long day of work, you come home all tired and lay in bed after completing all the chores, suddenly you start to think, “ Did I turn the lights off downstairs ? ”, “ Did I lock the door ? ” , “ Did I leave the window open ? ”. How about you let technology help manage all these worry points. Smart homes filled with connected products are loaded with possibilities to make our lives easier, more convenient, and more comfortable. These smart automation devices happen to have an interface with IoT. The smart home gadgets interact, seamlessly and securely; monitor and improve accessibility, from anywhere across the globe. By connecting the IP gateway directly to the Internet or through a home/residential gateway; this system can be managed remotely using a PC, Smart phone, Tablet or other devices. With IoT based smart sensors for Glass Break, Water Leak, Motion detection, Image detection, Temperature and Humidity detection, we can easily get real-time notifications on a hand-held device or the platform. Smart Retail Through a unified IoT platform, the retailers (like Hyper-retails and Quick Service Restaurants etc.) are empowered to improve operational efficiency, monitor employee activity, control pilferage, make the security smarter/efficient, provide omni-channel support, better customer experience, efficient fleet management etc. As we all know very well that pilferage cases are increasing day to day and in order to control them and vandalism, IoT based sensors provide smart alerts directly on your cloud-based mobile application in real-time. Overall the IoT based solutions have the ability to provide smarter actionable business analytics for smarter business decision making and optimisation. Smart Healthcare Healthcare industry has IoT based solutions that solve the needs by integrating with devices, hardware, software and smart connectivity. IoT technology can help by sending reminders of when to take medication and to keep track of someone’s heart rate, sleeping hours, sufficient diet, exercise habits etc. These advancements allow both the doctors and the patient himself to take an active role in the health management and better treatment. Find out more about IoT and how it facilitates business optimization. ",
            "date": "Answered May 7, 2018",
            "views": "675",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zhiyi Zhou",
                    "user_href": "/profile/Zhiyi-Zhou-7"
                },
                {
                    "user_id": "Siddarth",
                    "user_href": "/profile/Siddarth-81"
                },
                {
                    "user_id": "Rounak Dhillon",
                    "user_href": "/profile/Rounak-Dhillon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sohail Ahmed",
                "href": "/profile/Sohail-Ahmed-7"
            },
            "answer_text": "Thanks Hector for asking for my humble input. After WWII, we have seen unprecedented growth particularly in the field of electronics, communications, robotics and in medical arena. Technology is said to have impacted masses. Their living style has changed. Their habits have been changed (such as going from slide rules to calculators and now it is available in our mobile sets). Transport industry has provided a changed traveling pattern through packages with better options particularly in speed and direct connectivity. Internet and overlay networks have facilitated enormously. Libraries and bookstalls have lost their members and customers. Even Moore’s law has been amended to take into account the way we are trying to adjust to rapid technological pace! Online purchase has opened up new vistas. Teleworking has been dovetailed in our normal working and leave taking scenario in a way that was not possible earlier. Online health services are going to create new revolution in next decade. Miniaturization is offering us more and more gadgets in DIY form. Monitoring is becoming more advanced, especially health sector. Speed is increasing. Automatically driven cars are appearing. Renewable energies are being brought. Automation is increasing steadily. I am hopeful that communications will have new dimensional changes like doctor patient dialog through gadgets (where direct conversation is not possible). That is going to be extended further. THERE IS ONE PROBLEM: TECHNOLOGY CANNOT BE CHEWED AND EATEN! Thus cooks and bakers etc. will continue their expertise undeterred. ",
            "date": "Answered November 11, 2017",
            "views": "633",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Malini Rajendra",
                    "user_href": "/profile/Malini-Rajendra"
                }
            ]
        }
    ]
}