{
    "title": "How long do you normally keep a mobile phone for before replacing it with a new one? - Quora",
    "tags": [
        "Mobile Technology",
        "Technology",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan James",
                "href": "/profile/Nathan-James-50"
            },
            "answer_text": "I typically upgrade as soon as a sexier model comes out. It could be next year, or the following year. Why? Because I have more money than sense. I like to show off my latest tech gadget to friends and family in order to validate my life. That’s how sad my existence is. I like to have the very best camera phone tech because I have this persistent delusion that I’m some sort of Ansel Adams or Robert Mapplethorpe. As if my pix are worth shit. I like the feeling of belonging to a cult family like Apple iPhone users or Samsung Galaxy users. Yeah, I’ve really bought into their marketing shit. Basically, I’m a shallow, insecure, over-entitled dude with an inferiority complex who doesn’t care about how much money he throws away in order to feel good about himself. So just let me have my iPhone 11 or Samsung S10, and stop passing judgment on me. Okay? ",
            "date": "Answered March 10, 2019",
            "views": "27",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hunter Hunter",
                    "user_href": "/profile/Hunter-Hunter-137"
                },
                {
                    "user_id": "Kim Henry",
                    "user_href": "/profile/Kim-Henry-62"
                },
                {
                    "user_id": "Simon Rushton",
                    "user_href": "/profile/Simon-Rushton-6"
                },
                {
                    "user_id": "Celaena Mappe",
                    "user_href": "/profile/Celaena-Mappe"
                },
                {
                    "user_id": "Diego Alejandro Ortiz-Monasterio Miramontes",
                    "user_href": "/profile/Diego-Alejandro-Ortiz-Monasterio-Miramontes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Montana",
                "href": "/profile/Tony-Montana-251"
            },
            "answer_text": "I brought Vivo Y51i for my family on late 2016. The phone is still in working condition but with severely damaged body and a cracked screen BUT still working well and good. I have changed it to Asus Zenphone Max Pro M2 on January 2019. It has been more than two years, it demanded a replacement because of rough use not because of functionality. If the phone was in outwardly good condition, it could have lived on about half or till the end of 2019 and not above that. I brought a Gionee A1 on latter part of 2017. The screen started to become unresponsive often by December 2018 and it now generated stuck pixels and the unresponsiveness has been auto fixed by itself for some reason. I was hoping to use it for atleast two years but it demanding replacement by the end of an year and half. Smartphones are evolving at a tremendous rate. If your smartphone survives for two years without any hardware issues, then it will be technologically outdated. Today even a 10K phone has full view display with good processor and RAM. You might comparatively miss a lot in better features that were not available in the market at that time. So the practical usable life of a smartphone is generally about 2 years. If your phone does not incur any hardware related issues by then, then you might extend its life for another 3–4 years and definitely not above that. ",
            "date": "Answered January 28, 2019",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amr Ezzat",
                    "user_href": "/profile/Amr-Ezzat"
                },
                {
                    "user_id": "Ark Erra",
                    "user_href": "/profile/Ark-Erra"
                }
            ]
        }
    ]
}