{
    "title": "How to check the technology used to develop a website like  www.kosisamay.com - Quora",
    "tags": [
        "Web Design",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ekta Kashyap",
                "href": "/profile/Ekta-Kashyap-3"
            },
            "answer_text": " Nowadays you can find everything online, with the increase in the number of online business competition also increases and people put lots of their efforts in ranking on top. So, to get the full insight of the competitor website or for any website, check this list of best online tools to find all information about a website. These tools will help marketers, site owners and business owners to spy on a competitor website and extract the complete data like the domain, hosting, technology and other tools to build their own robust strategy. Let’s dive in. List of best online tools DomainToolshttp://just-ping.comwho.iswhoishostingthis.comBuiltWithmyip.mslumendatabase.orgSEMrushssllabs.comTestmysite.ioSource: List of best online tools to find all information about a website Thank You for the read! ",
            "date": "Answered May 20, 2020",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ganesh Babu",
                "href": "/profile/Ganesh-Babu-11"
            },
            "answer_text": "There are many websites that can be found online to check the details you are looking for. Personally I would prefer builtwith.com. The website you’ve specified in question (kosisamay.com) is built with PHP framework at its backend. To be specific, it uses Wordpress CMS. ",
            "date": "Answered May 23, 2016",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jeff Hoovers",
                    "user_href": "/profile/Jeff-Hoovers"
                }
            ]
        }
    ]
}