{
    "title": "How to tell whether an HDMI cable is quality or not - Quora",
    "tags": [
        "A/V Cables",
        "HDMI"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony May",
                "href": "/profile/Anthony-May-2"
            },
            "answer_text": "You plug it in. If it works, it has acceptable quality. Yes, it’s really that simple. HDMI is a fully digital signalling cable standard. If signal gets from one end to the other, then that’s all there is to it; job done. If s HDMI cable doesn’t work, or seems unreliable, then that is not a quality cable. Once you pass the threshold of a HDMI cable working - including those from the cheapest you can buy from places like Monoprice - anything more expensive is a complete waste of money. Of course, ahole companies like Moster Cables would like you to believe otherwise. They lie, and they prey on your ignorance of thinking that modern digital-signalling cables like HDMI have the same factors at play as old-fashioned analog cables, where quality does mattere a LOT more, and where it was worth paying a little more for a quality cable. ",
            "date": "Answered August 23, 2018",
            "views": "1",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Comet",
                    "user_href": "/profile/Comet-7"
                },
                {
                    "user_id": "Vikram Balaji",
                    "user_href": "/profile/Vikram-Balaji-6"
                },
                {
                    "user_id": "Cagatay Paftali",
                    "user_href": "/profile/Cagatay-Paftali"
                },
                {
                    "user_id": "Ari Bimo",
                    "user_href": "/profile/Ari-Bimo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Silverman",
                "href": "/profile/Andrew-Silverman-10"
            },
            "answer_text": "You can’t, short of using a cable tester to validate continuity of each signal line, or better yet, signal integrity at the multi-hundred-megahertz speeds and low voltage swings currently used by HDMI devices. Poor cables actually can introduce visual snow into an HDMI signal- while it is a digital standard, there is no error correction whatsoever during the active video portion of each frame, and you can see this with excessive cable lengths or poor cables. About the best you can do via eyeball is to look for good construction, such as adequate strain relief where the cable meets the connector, quality of the plastic molding, and so forth. ",
            "date": "Answered August 22, 2018",
            "views": "451",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Cagatay Paftali",
                    "user_href": "/profile/Cagatay-Paftali"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Vanderschel",
                "href": "/profile/David-Vanderschel"
            },
            "answer_text": "A2A: Whether it works properly or not. It implements a digital interface. There is no relative quality issue as can apply with an analog interface. Either it works or it doesn’t. There is no need to spend big bucks on an HDMI cable. Don’t be scammed. Very inexpensive ones can work just fine for regular HD resolutions. You do need what is called “high speed” for higher resolutions and HDR. ",
            "date": "Answered August 22, 2018",
            "views": "496",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Cagatay Paftali",
                    "user_href": "/profile/Cagatay-Paftali"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Miller",
                "href": "/profile/Ted-Miller-11"
            },
            "answer_text": "Use it. The picture should be clear, grainy if your TV is adjusted to be, but not snowy or wavy. If it looks bad, swap it for another one you know is good. If it still looks bad, it’s not the cable’a fault. If you want to know which one to buy, I always get the cheapest one I can find, same as I would any cable. The job it must do is to send a high def image to your display, no matter the amount paid. If it can’t do that, it gets returned for a full refund. Whatever you do, don’t go to the TV department for it. Many stores will try to sell you a $50 gold-plated Monster cable. Nothing wrong with gold plating, but most of that money is for pretty packaging. Go to the aisle that has video cables and cable fabrication parts. In my local Fry’s Electronics, thats over by the CPU department. ",
            "date": "Answered August 22, 2018",
            "views": "274",
            "upvotes": " Answer requested by Cagatay Paftali",
            "upvoters": [
                {
                    "user_id": "Paul Durdik",
                    "user_href": "/profile/デュルディク-ポール-Paul-Durdik"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Ben Krewson",
                    "user_href": "/profile/Ben-Krewson-1"
                },
                {
                    "user_id": "Phillip Remaker",
                    "user_href": "/profile/Phillip-Remaker"
                },
                {
                    "user_id": "Isaac Wingfield",
                    "user_href": "/profile/Isaac-Wingfield"
                },
                {
                    "user_id": "Matt Elder",
                    "user_href": "/profile/Matt-Elder-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wicida Sarme",
                "href": "/profile/Wicida-Sarme"
            },
            "answer_text": "By using it and observing the picture and sound qualities… Making comparison between different HDMI cables that are connected to the different HDMI inputs of the HDTV set.. Which in turn is connected to HD DV player with an HD movie playing… By switching the different inputs, you can make the comparison between cables as you can easily observe any changes in picture and sound quality… Observable enhancement or degradation can be easily noted.. ",
            "date": "Answered August 23, 2018",
            "views": "171",
            "upvotes": " Answer requested by Cagatay Paftali"
        },
        {
            "author_info": {
                "name": "Konstantinos Konstantinides",
                "href": "/profile/Konstantinos-Konstantinides"
            },
            "answer_text": "From a video quality point of view, since HDMI is a digital interface, any certified HDMI cable should yield exactly the same performance. Very cheap HDMI cables have typically issues with the end-connectors (they break more easily). Beyond that, an HDMI cable either works or not. ",
            "date": "Answered August 21, 2018",
            "views": "11",
            "upvotes": " View 6 Upvoters "
        }
    ]
}