{
    "title": "How long can a laptop last if used regularly? - Quora",
    "tags": [
        "Longevity",
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Haynie",
                "href": "/profile/Dave-Haynie"
            },
            "answer_text": "There’s no hard upper limit. I got a laptop back in 2006, based on an Intel core 2 processor. A few years later, I upgraded the dual HDDs to 640GB each. Eventually, I gave it to my wife, and when the first HDD (C:) failed, I replaced that with a 240GB SSD. We retired it this spring… one of the hinges had busted, and eventually the display failed. In terms of full functionality, the battery is probably the first thing to fail. My daughter has a MacBook Pro we bought for her in 2013. The battery died a couple of years ago. A typical Li-ion battery is good for not much more than 500 charge/discharge cycles, though some new chemistries are extending that a bit. You can, of course, replace the battery or, in the case of Apple, pay Apple to replace the battery for you. But it’s certainly possible to kill the battery in less than two years if you run it down every day. If you don’t drain the battery, it’ll last much longer. That’s usually the story with older laptops: either the HDD fails or something important and mechanical breaks. Some folks will replace the drive, but had it been mine, I would have updated. A ten year+ laptop, even one that ran $1200 new, will easily be surpassed by even a cheap one today. It’s like any other portable device — most die because of misadventure or obsolesce, not system failure. It’s true that if you go long enough, maybe 20+ years or more, you’ll start to see capacitors fail. They’re a critical component of your laptop’s power systems. Quite a few of the computers from the 1980s and early 1990s exhibit this problem — I know a few people in Europe who do capacitor transplants on Amiga computers to bring them back to life. And that’s the key issue, too — is it worth the trouble of repair, or is replacement a better option? In the case of a laptop, other than maybe a drive swap or battery replacement, repair probably doesn’t make much sense. Carefully handled, though, you can probably expect to see 15–20 years of life from one of the better made units. Just looking — the screen hinge on my current ASUS Zenbook is quite a bit more robust than the one that broke on that old HP. Then again, this one cost nearly twice as much, new, last year. And seriously, by 2025, won’t I barely be able to function with my laptop… no 8K screen, no 256GB RAM or 256TB SSD, no 16-core processor, no brain interface, etc! ",
            "date": "Updated February 25, 2020",
            "views": "139",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Honesta Atara Adeola",
                    "user_href": "/profile/Honesta-Atara-Adeola"
                },
                {
                    "user_id": "Harshal Barve",
                    "user_href": "/profile/Harshal-Barve-1"
                },
                {
                    "user_id": "Ajai Banerji",
                    "user_href": "/profile/Ajai-Banerji"
                },
                {
                    "user_id": "Sai Hari Krishnan G",
                    "user_href": "/profile/Sai-Hari-Krishnan-G"
                },
                {
                    "user_id": "Keshav Singh",
                    "user_href": "/profile/Keshav-Singh-124"
                },
                {
                    "user_id": "Visesh Bartam",
                    "user_href": "/profile/Visesh-Bartam"
                },
                {
                    "user_id": "Will Huang",
                    "user_href": "/profile/Will-Huang-19"
                },
                {
                    "user_id": "Tup Tap",
                    "user_href": "/profile/Tup-Tap"
                },
                {
                    "user_id": "Wilson Mixon",
                    "user_href": "/profile/Wilson-Mixon"
                },
                {
                    "user_id": "Đỗ Minh",
                    "user_href": "/profile/Đỗ-Minh-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Voldi Sinarta",
                "href": "/profile/Voldi-Sinarta"
            },
            "answer_text": "With regular maintenance, a laptop can last quite long. Uninstall unused programmes, vacuum the motherboard, drain the battery regularly, always carry in a padded bag, are some of the maintenance we can do to our notebooks. My Lenovo T-400 that I bought in 2008 is still working well. I only change the battery, replace the HDD with an SSD, and upgrade the OS regularly (now it is running Windows 10). Still running like new, although physically ugly.The MacBook Pro 5.3 (from mid-2009) is also still alive and kicking. Just like my Lenovo, last year I changed the battery and replace the HDD with an SSD. Plus upgrade all the way to El Capitan.My main working notebook is now the HP Envy 15″ I bought in 2014. Replaced the HDD with and SSD, and add an mSATA SSD as the second storage plus replace 8GB with 16GB RAM. Now it works better than when it was new.",
            "date": "Answered September 4, 2017",
            "views": "39",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Beryl Cholif Arrahman Meuraxa",
                    "user_href": "/profile/Beryl-Cholif-Arrahman-Meuraxa"
                },
                {
                    "user_id": "Artur Johny",
                    "user_href": "/profile/Artur-Johny"
                },
                {
                    "user_id": "Zoran Nikin",
                    "user_href": "/profile/Zoran-Nikin"
                }
            ]
        }
    ]
}