{
    "title": "How can a country legally invade another? - Quora",
    "tags": [
        "Historical Power (international relations)",
        "International Law and Legal Institutions",
        "Invasions",
        "Warfare",
        "Military History and Wars ",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Davis",
                "href": "/profile/Chris-Davis-90"
            },
            "answer_text": "This is a serious question. How do you make the world better? I think invading country might qualify. How is this wrong and is it illegal? Keep in mind that as long as you are not fighting against the American government, it is not treason. Many people found in the Spanish civil war, like Earnest Hemingway. If an American citizen hires a mercenary force and invades a country, is it illegal under international law? I ask this because warlords overthrow dictators all the time and no one gets involved. After much thought of how to make a country and people better, I am thinking of the legality of this act. A country like Equatorial Guinea has a high income from oil and a small area to control. It has an average income of about $37,000 a year. The current dictator kills his own people and many live on less than $2 a day. The country has a military of 2,400 troops, which is quite weak. They have no air force to speak of. Most military equipment is nonoperational or barely so. Like all dictators in all countries, he is good at suppressing decent at not fighting a foreign war. Assume this is the plan. To hire a mercenary force of 500-800 people and promise to pay every citizen of the country $10,000 a year base salary. Upon invasion, drop leaflets just before and perhaps a few hundred thousand dollars in US currency for good measure. The country gets close to 40 billion dollars in oil revenue per year, so this is a pittance. The capital is on an island and easily secured. The whole area is the size of Atlanta. Based on the wealth of the country, the mainland could be showered with presents as well. The current dictator suppresses ruthlessly so how much would people resist? After seizing power, the hard part begins. One must negotiate with the oil companies to keep paying. However, based on humanitarian grounds, what company really wants to be in bed with a dictator who embezzles all the money and kills its citizens or a consortium who promises citizens $10,000 per year and does so. The main question is will the three main powers get involved: China, US, and Russia. Does it make a difference if a corrupt warlord takes over or a corporation, which is essentially what this is. This is better for the citizens of the country and human rights in general. Would the world try to re-install a dictator who kills his own people and takes all the money or a group of people who try to give a lot more of the money to the people? If so how would the U.N. or other group justify it? ",
            "date": "Answered April 13, 2017",
            "views": "31",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles Cryar",
                    "user_href": "/profile/Charles-Cryar"
                },
                {
                    "user_id": "Cheek Clappin Back Breaker",
                    "user_href": "/profile/Cheek-Clappin-Back-Breaker"
                },
                {
                    "user_id": "Joseph Charlesworth",
                    "user_href": "/profile/Joseph-Charlesworth"
                },
                {
                    "user_id": "Laidback Mike",
                    "user_href": "/profile/Laidback-Mike"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chia Jeng Yang 谢征阳",
                "href": "/profile/Chia-Jeng-Yang-谢征阳"
            },
            "answer_text": "There are several ways that an invasion can be justified by virtue of international law. Firstly, a UN Security Council Resolution can legitimize the use of force. This is typically in response to aggression [Such as the UN Mandate to invade Kuwait to push out Iraq occupiers in the Gulf War]. This may also be in response to humanitarian intervention [Libyan Intervention], though the scope of this power is controversial and may perhaps not extend so far as to invasion, and merely just minimal armed intervention. Secondly, any counter-measure is allowed if it is proportional to an armed attack by another country. The obstacles to fulfilling this is extremely high, and it is unlikely that an invasion fulfils this criteria. In Armed Activities (Congo), the International Court of Justice found that, in response to border incursions by small armed platoons did not validate the occupation of villages and airports hundreds of kilometers from the border. However, in the Advisory Opinion on the Use of Nuclear Weapons, the court was split 7-7 as to the possible use of nuclear weapons in the event that a country's survival was at stake. The fact that the use of nuclear weapons was left undecided indicates that it is likely that less serious uses of force, such as invasions, may be proportional and justified if and only if it can be definitively proved a country's survival was at stake. This is highly unlikely, though I can imagine a far-fetched scenario where a nuclear device was hidden and one had to search the whole country to figure out the information/people that could disarm it. Deepak Raju comes closest in describing the overall framework for the use of force in international law. ",
            "date": "Answered April 21, 2016",
            "views": "97",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Charlesworth",
                    "user_href": "/profile/Joseph-Charlesworth"
                },
                {
                    "user_id": "Subhrangshu Chakraborty",
                    "user_href": "/profile/Subhrangshu-Chakraborty-2"
                },
                {
                    "user_id": "Johnny Garxia",
                    "user_href": "/profile/Johnny-Garxia"
                },
                {
                    "user_id": "Nicholas Lim",
                    "user_href": "/profile/Nicholas-Lim-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepak Raju",
                "href": "/profile/Deepak-Raju"
            },
            "answer_text": "As a matter of international law, use or threat of force against the territorial integrity or political sovereignty of another State is illegal. Force may be used for the purpose of self defense and within the confines of necessity and proportionality. This prohibition on use of force is one of the norms that international lawyers call 'jus cogens' (peremptory norms) and has been codified in Article 2(4) of the UN Charter. Customary international law also prohibits States from acquiring territory through aggression or recognising such acquisitions made by other States. So, there is no way of lawfully 'invading' another sovereign State. I see some answers suggesting that there is no norm against invading another country since there is no police force that can enforce the norm. That would be like saying that a perfectly executed murder leaving behind no trace of evidence is not a crime. The existence of a norm is not determined by the chances of its enforcement. ",
            "date": "Answered April 11, 2015",
            "views": "83",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Javon Quinnine",
                    "user_href": "/profile/Javon-Quinnine"
                },
                {
                    "user_id": "Lachlan Chan",
                    "user_href": "/profile/Lachlan-Chan"
                },
                {
                    "user_id": "Tadhg Ó Raghaill",
                    "user_href": "/profile/Tadhg-Ó-Raghaill"
                },
                {
                    "user_id": "Gloria Newman",
                    "user_href": "/profile/Gloria-Newman-1"
                },
                {
                    "user_id": "Wiweko Rahadian Abyapta",
                    "user_href": "/profile/Wiweko-Rahadian-Abyapta"
                },
                {
                    "user_id": "Kaiser Asif",
                    "user_href": "/profile/Kaiser-Asif"
                },
                {
                    "user_id": "Pedro Garcia",
                    "user_href": "/profile/Pedro-Garcia-298"
                },
                {
                    "user_id": "Felix Obiora",
                    "user_href": "/profile/Felix-Obiora-1"
                },
                {
                    "user_id": "Keshav Jasrotia",
                    "user_href": "/profile/Keshav-Jasrotia"
                },
                {
                    "user_id": "Nar Singh",
                    "user_href": "/profile/Nar-Singh-30"
                },
                {
                    "user_id": "Rahul Kumar",
                    "user_href": "/profile/Rahul-Kumar-2755"
                },
                {
                    "user_id": "Rukmini Das",
                    "user_href": "/profile/Rukmini-Das-1"
                },
                {
                    "user_id": "Yu-Hsing Chen",
                    "user_href": "/profile/Yu-Hsing-Chen-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayu Nazrah",
                "href": "/profile/Ayu-Nazrah"
            },
            "answer_text": "Yes, there is no law against invasions because there is no one with the power to create and enforce that law. But in this 21st century era, invasions can be done indirectly. I mean indirectly. That is through the 'lawful channel'. It is not obvious. One country can invade another via so-called international trade, ecomomy,education and so on.   In 1498, the interest of the European began when a group of European expedition first reached India via sea route and this small group was led by Vasco da Gama arrived in Calicut at the west coast of India. They asked permission of the Hindu authority at that time to build trades base along the coast area. The guarantee of traders entry by the authority to Vasco and team had given opportunity to them to carry out the commercial with local people had led to a growing demand of local products as the European team had high purchasing power over local traders. Local traders were happy as they can sell more. Long after, the trading post  in the area largely expanded to other traders outside the country that caused to economic invasion in India by European.  The similar type of invasion happened in the beginning of the 19th century whereby the political  and economic power of the Malay rulers in Kalimantan and what is now the southern Philippines was declining sharply. The rule of the once-powerful Sultans of Brunei and Sulu now barely extended outside their capitals. Their decline resulted largely from the development of European entrepots in South-East Asia, which offered local traders a better price for their produce and were free from the taxes of the Malay ports. The development of local trade with European entrepots, especially Singapore, Batavia and Manila, and the decay of the older trading centres of Brunei and Sulu meant a drastic reduction in the Sultanates' revenues, with a consequent decline in political power at that time. That is how a country 'legally invade' another.  ",
            "date": "Answered March 29, 2016",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Young",
                "href": "/profile/Scott-Young-5"
            },
            "answer_text": "There is no enforceable law above that of the nation state.  The world court cannot put a nation on trial.  The UN does not have an army or a police force to enforce any laws and no set of laws has been accepted by all nations to be enforced on all nations. If the USA signs a treaty to abide by a certain rule (say, no invasions) it is actually passing a law internally to abide by that rule.  They have to do that because that is the highest law that applies to the USA.   There is no law against invasions because there is no one with the power to create and enforce that law. ",
            "date": "Answered April 11, 2015",
            "views": "23",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Subhrangshu Chakraborty",
                    "user_href": "/profile/Subhrangshu-Chakraborty-2"
                },
                {
                    "user_id": "Mikhail Rimsky-Korsakov",
                    "user_href": "/profile/Mikhail-Rimsky-Korsakov"
                },
                {
                    "user_id": "David Mullich",
                    "user_href": "/profile/David-Mullich"
                },
                {
                    "user_id": "Scott M. Stolz",
                    "user_href": "/profile/Scott-M-Stolz"
                },
                {
                    "user_id": "Olivier Garamfalvi",
                    "user_href": "/profile/Olivier-Garamfalvi"
                },
                {
                    "user_id": "Sean Sanders",
                    "user_href": "/profile/Sean-S-11"
                },
                {
                    "user_id": "Scott Welch",
                    "user_href": "/profile/Scott-Welch"
                },
                {
                    "user_id": "Yu-Hsing Chen",
                    "user_href": "/profile/Yu-Hsing-Chen-1"
                },
                {
                    "user_id": "Wouter van Burik",
                    "user_href": "/profile/Wouter-van-Burik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hassan Sajjad",
                "href": "/profile/Hassan-Sajjad-13"
            },
            "answer_text": "A country can legally invade another country on basis of -Humanitarian needs -In order to protect state from invading country -Invitation by the state to invade to protect it from terrorist groups or rivals. ",
            "date": "Answered August 29, 2017",
            "views": "748",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Doan",
                    "user_href": "/profile/Matthew-Doan-1"
                },
                {
                    "user_id": "Jonathan Common",
                    "user_href": "/profile/Jonathan-Common"
                },
                {
                    "user_id": "Leven Liu",
                    "user_href": "/profile/Leven-Liu-1"
                },
                {
                    "user_id": "Anshuman Mishra",
                    "user_href": "/profile/Anshuman-Mishra-42"
                },
                {
                    "user_id": "Chris White",
                    "user_href": "/profile/Chris-White-427"
                },
                {
                    "user_id": "Ben Allen",
                    "user_href": "/profile/Ben-Allen-233"
                },
                {
                    "user_id": "Samuel Rosenberg",
                    "user_href": "/profile/Samuel-Rosenberg-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dongyang Shi",
                "href": "/profile/時-冬陽-Dongyang-Shi"
            },
            "answer_text": "Well …History and rules are made by winner s…In the history of human being ,there's only two consequences of invasion ：The  invaders win and on the contrary, the defenders win .Now that ask invade legally, there is only one circumstance for that : The INVADERS win .Just like what UK did：  MOST of them were lawfull ,because UK is ademocratic country, and all the decision made by parliament are rightful. ",
            "date": "Answered April 11, 2015",
            "views": "18",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cheek Clappin Back Breaker",
                    "user_href": "/profile/Cheek-Clappin-Back-Breaker"
                },
                {
                    "user_id": "Rahul Kumar",
                    "user_href": "/profile/Rahul-Kumar-2755"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhavishya Rathore",
                "href": "/profile/Bhavishya-Rathore-3"
            },
            "answer_text": "Just be the US and have a monopoly over the UN…..tada…….now you can legally invade any country. Or you can be India and invade Pakistan, Bangladesh, Indonesia, Tibet on the premise of their Hindu roots…..Which will happen very soon! ",
            "date": "Answered April 13, 2017",
            "views": "179",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Stephens",
                "href": "/profile/Ian-Stephens-6"
            },
            "answer_text": "With a UN mandate, ie.  Korea 1951 Kuwait 1991, or as a response to an act of aggression against your country or another country, ie. Afghanistan 2001 and, again, Korea and Kuwait ",
            "date": "Answered April 11, 2015",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sean Sanders",
                    "user_href": "/profile/Sean-S-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paulo Köhler",
                "href": "/profile/Paulo-Köhler"
            },
            "answer_text": "Saying that they have mass destruction weaponsBeing a candidate to solve all their problems such as civil warsProposing a free-market agreementBeing a candidate to depose their dictatorSending your companies and media to destroy their culture and economy",
            "date": "Answered April 14, 2017",
            "views": "580",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cheek Clappin Back Breaker",
                    "user_href": "/profile/Cheek-Clappin-Back-Breaker"
                }
            ]
        }
    ]
}