{
    "title": "How to accurate determine the top speed of a car? Is the speedometer an accurate estimate - Quora",
    "tags": [
        "Human Surroundings",
        "Speedometers",
        "Speed"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Peck",
                "href": "/profile/Paul-Peck-1"
            },
            "answer_text": "Use GPS to get the true speed. More about that later. To my knowledge, all production car speedometers read a bit faster than you are actually going. I have tested this several times, in all sorts of cars, using the speedometer function in a GPS. Also, the roadside radar speed reporting signs seem to corroborate my findings. For my favorite “test”, I was in Germany in a rental Audi A6 3.5L turbo diesel, and I wanted to see if it really did have the speed electronically limited to 250 kph (per the famous “gentleman’s agreement” among the big German carmakers, except for Porsche). For top speed measurement , my best datapoint was a from a jaunt on the A71 autobahn, in the former East Germany (sometimes called the “autobahn to nowhere”). It has long stretches where it’s straight and no entrance/exit ramps, so I could go fast and still watch my instruments. Before starting out, I found the setting on the car’s GPS and set it to display speed, and had a separate GPS of my own (set for mph) and hooked it up via the cigarette lighter. The car quickly and effortlessly started approaching the alleged 250 kph limit. When the engine starting cutting out (feels odd, like the engine was misfiring), the speedometer guage in the instrument cluster was showing 260 kph, the car’s GPS in the center dash was showing exactly 250 kph, and my personal GPS showed 155 mph, which converts to 250 kph. Then I settled back down to a mere 200 kph, relaxed, watched the fleshtones return to my knuckles, turned on the radio, and started breathing normally again. All my experience points to speedo gauges indicating 3–4% fast, regardless of the speed. ",
            "date": "Answered December 5, 2018",
            "views": "615",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chuck St.Amand",
                "href": "/profile/Chuck-St-Amand"
            },
            "answer_text": "The speedometer means nothing. Not that it won’t tell you how fast you’re going, but it won’t tell you how fast you can go, given enough time in a straight line on a clear straight road. Many cars are built with several engine / transmission / gearing options, When it comes to top speed, google is your friend. No matter what car it it, who made it, when it was made, whatever,… Some magazine / group / or even the manufacturer, put out the numbers for the model that are year, engine and transmission and gear ratio correct. Even better, those numbers will include 0 to 100 KPH.. 1/4 mile, and variants thereof. Would you rather have a 0 to 100 KPH time of 5.3, with a top speed 0f 200 KPH, or, a 0 to 100 KPH of 6.8 and a top speed of 245 KPH? Would you rather have the neck snapping acceleration, or the long legs of a high top speed? There’s more to the numbers than just the numbers.. ",
            "date": "Answered May 8, 2018",
            "views": "316",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "A Kid",
                    "user_href": "/profile/A-Kid-3"
                }
            ]
        }
    ]
}