{
    "title": "How has the telephone changed the world? - Quora",
    "tags": [
        "Changing the World",
        "Telephones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Damien Kastro",
                "href": "/profile/Damien-Kastro-1"
            },
            "answer_text": "The telephone is a technology that has become an integral part of our life since it was invented in 1876 (officially speaking). The telephone has allowed the sender and the receiver to be in direct contact without being physically in each other's presence through a receiver and a transmitter. The sender and the receiver can be separated by vast distances but their communication is still direct and no interference is required through a messenger. True communication requires back and forth speaking and listening interaction and then providing a response informed by what has been heard. We also need to remember that the telephone can facilitate misrepresentation and fraudulent schemes, it can be used to send a message such as \"I miss you\" or \"I’m going to kill you\" without anyone hearing. As with almost all things when the telephone was first introduced it could only be afforded by the rich as the materials needed for connection were very expensive. On the grounds that it would increase wealth, employment and improved means of communication the telephone was encouraged to enter every household. Although not apparent at first it lead to development of city centers, office buildings and the concept of an urban worker society, it has also lead to the creation and destruction of jobs and above all also changed the pace of business and made the world smaller and more accessible to all. The telephone has provided security and helped in emergency situations, it is been used to conqueror and promote crime, on one hand one could call for help quickly on other hand fraudsters could reach into our houses and pick our pockets. The telephone also changed the way social relationship and social interaction take place. Communication over the telephone broadened the range of people one could interact with. Long distance relationships became possible. The telephone helped keep close bond with families and communities. The telephone has made communication more efficient and faster since it was first developed. In some ways it has moved us back to the oral culture that we originated from and in other respects it has aided in the proliferation of the written text. The telephone has transformed societies social behavior by changing the way we communicate with each other, it has fostered a whole host of new inventions, like the cell phone and the internet. We can now read up on an obscure subject over the internet and then discuss it online with a friend immediately. The phone has over the a century of its existence introduced us to a different mindsets and relational patterns in which we move. From the time in which only offices and capitalists would call each other over the phone, to calling the operator and asking to speak to “so and so”. To being on the phone for hours with the boy/girlfriend and no phone calls at dinner time, to having the world in your palm and getting notifications every minute of the day, the phone has been a friend and fiend… ",
            "date": "Answered November 28, 2017",
            "views": "147",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gordon Mei",
                    "user_href": "/profile/Gordon-Mei-3"
                },
                {
                    "user_id": "Harrison Kim",
                    "user_href": "/profile/Harrison-Kim-46"
                },
                {
                    "user_id": "Sisi Sisi",
                    "user_href": "/profile/Sisi-Sisi-25"
                },
                {
                    "user_id": "Felix Wang",
                    "user_href": "/profile/Felix-Wang-91"
                },
                {
                    "user_id": "Seema Pai",
                    "user_href": "/profile/Seema-Pai-13"
                },
                {
                    "user_id": "Erik van Garderen",
                    "user_href": "/profile/Erik-van-Garderen-1"
                },
                {
                    "user_id": "Wallis Dudhnath",
                    "user_href": "/profile/Wallis-Dudhnath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Mason",
                "href": "/profile/Paul-Mason-49"
            },
            "answer_text": "In a similar way that the Internet has changed the world. Telephones were indirectly the predecessor to the Internet. Telephones made it possible for humans to communicate with one another in real time from other sides of the planet. Otherwise, people were limited to asynchronous communication via letters, and it could take months before a letter arrived at its destination - each way! Conference calls today effectively function the same as they did before the Internet. The only thing that differs is the efficiency and quality. It still is just a group of people talking on the same line at the same time. In principle that hasn’t changed in over 100 years. The spread in popularity of the telephone led to a cable drop being installed in every home and office. This laid the original physical infrastructure for what would become the Internet. Fibre optic cables linking central offices of telephone companies (city-to-city) were installed long before the Internet came along. The same applies to cross-continental and cross-oceanic links - originally all to facilitate telephone customers. The original cabling standard for carrying Ethernet over unshielded twisted pair (UTP): T568(A&B) was based on having 10Base-T signal run within the same ‘jacket’ as the existing telephone land line. The ideology was you could leverage your existing telephone line. However this was seldom done as the problems were the analogue 96V on-hook, off-hook voltage spikes that could induce noise to the digital LAN signal, as well as the political issues with the telephone companies allowing IT companies monkeying around in their wiring closets. It didn’t take long before you had two drops of UTP to every desk instead of one. I used to design and implement those systems. The original internetworking was all based on utilizing the existing telephone infrastructure: the wonderful world of BBS and dial-up modems. Today a significant % of high speed ISP connections still use the old telephone copper infrastructure: DSL, which does run within the same jacket as your land line with the use of band-pass filters for the noise. With the ubiquity of cell phones today, it’s understandable why young people don’t appreciate the relativity of the relationship between the Internet and the original telephone connections…pardon the pun. ",
            "date": "Answered April 10, 2018",
            "views": "55",
            "upvotes": "0"
        }
    ]
}