{
    "title": "How did data harvesting and selling begin in tech? And why hasn't the US done anything for privacy rights in this regard? - Quora",
    "tags": [
        "Data Collection",
        "Information Privacy",
        "Internet Privacy",
        "Privacy",
        "Data Mining",
        "Data",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Godek",
                "href": "/profile/Stephen-Godek"
            },
            "answer_text": "Data harvesting is as old as mass advertising as advertisers have attempted to collect consumer information for years by various means like surveys, contests, special offers for which consumers had to divulge personal information, etc. However, the “industrial” harvesting was ushered in with the advent of the internet and the easy to use World Wide Web, which quickly became adopted as a means to gather large scale datasets on consumer behavior. The introduction of social media, like Facebook, Twitter, Quora, etc. involved including the collection of users’ data as a part of the platforms’ business plans, which allowed them to offer services to users for “free” in return for their agreeing to share vastly more information about themselves than had been previously available. This information could then be packaged and sold to advertisers and others willing to pay the costs. The U.S. has done little to protect users’ privacy for a couple of reasons. First is the novelty of the commercial use of consumer data on such a scale. Congress, which is composed of policy generalists has few members who understand how the internet works, much less how to regulate it. Second, platforms obtain users’ permission to collect and use the data provided in license agreements that few people read and even fewer care about as they focus on the features of the platform that attract their attention in the first instance. Finally, the law of privacy in the U.S. is barely formalized, consisting primarily of a few court decisions and very little protection under the Constitutional prohibitions of government intrusion that do not cover private attempts to pry into our lives for commercial purposes. ",
            "date": "Answered October 23, 2020",
            "views": "68",
            "upvotes": " Answer requested by Shane Gallagher"
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "Data harvesting and selling began before there was tech. The unknown marketing databases that know everything about you Mailing list compilation began in the 50s. Although sure, as computers became a useful tool in the 70s, compiling that data into larger sets with more demographic brackets really made this market commercially useful. As for why privacy rights, in the U.S. passing information is protected as free speech. So this is a 1st Amendment issue. And no right to personal privacy exists in the Constitution, so that 1st Amendment issue is pretty hard to overcome. And given that this is about selling names and addresses of identified demographic groups so people can target you with ads, that’s not exactly a “harm” that you have much to complain about. Certainly not to the level where you can trample on their free speech rights to send you those ads. I know it feels squicky to be aware that people out there have your private data. And that there is a psychological effect from dwelling on that. But they aren’t doing this to harm you, they just want to be economical with your time by only sending you ads that potentially are for products you might buy. And being economical with who they reach, also makes their advertising more efficient. Thus doesn’t raise their bottom line to the level where they need to increase prices on their product. ",
            "date": "Answered October 23, 2020",
            "views": "56",
            "upvotes": "0"
        }
    ]
}