{
    "title": "How do TV set top boxes work and display channels? - Quora",
    "tags": [
        "Channels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Dickens",
                "href": "/profile/Michael-Dickens-5"
            },
            "answer_text": "What kind of set top box? Cable? IPTV? Satellite? OTA? Smart STB (smart TV STB, AppleTV, Roku)? These all qualify as set top boxes Overall, set top boxes take a signal in, manipulate it in some way, and send it to the TV, earlier set top boxes were nothing more than tuners with premium content decoders (for premium channels like HBO and PPV) Cable boxes take in an RF signal from the coax line, allow you to tune into different frequencies (channels), decode encrypted content, and send the TV something it understands, newer set top boxes allow for digital content and 2 way data communication Satellite set top boxes work similarly, but not the same as cable, they have to power the LNB on the dish (unless it’s powered separately) they may need to control a motor to move the dish to connect to different satellites, they may need to read from different satellites at once, programming and account info is stored differently, otherwise it does the same thing to the satellite signal as a cable STB does for cable IPTV a whole different animal, IPTV STBs don’t have tuners, they connect to an IP network just like how your computer connects to the Internet, as a matter of fact IPTV shares the same lines as your internet and connects to the same modem (known as a residential gateway), IPTV is offered by your local phone company (in America its through AT&T and the IPTV is called U-verse), it’s essentially streaming TV (like YouTube), the STB is basically a computer you connect to your TV and runs Windows CE, the STB then sends the TV something it understands OTA is very similar to cable, this is basically an antenna, an OTA set top box is more rare now than it was during the digital conversion and that is because it allowed TVs without digital tuners to receive digital broadcasts, these were separate boxes you had to buy for your older TV so they count as STBs, they had no premium content, and all you got were your local channels, they just took the digital antenna signal, did the same to it as a cable STB, and have an analog signal the TV could understand Smart STBs weren’t much for s TV service, these pretty much just gave your non-smart TV smart features, like YouTube, Hulu, some do video chat, some have a web browser and allow you to go online, they support Netflix and other video streaming services, allow you to beam your smartphone content, a whole bunch of stuff, it’s like an iPad on your TV, these are boxes that connect to your TV, so they count as a set top box A lot of these things are slowly being replaced by game consoles like the PS4 and Xbox One, Sony already offers Cable-like IPTV service through PSN on the PS4 ",
            "date": "Answered December 23, 2017",
            "views": "89",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek",
                    "user_href": "/profile/Abhishek-1055"
                },
                {
                    "user_id": "Revanth A",
                    "user_href": "/profile/Revanth-A-1"
                },
                {
                    "user_id": "Dsk Kamali",
                    "user_href": "/profile/Dsk-Kamali"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Purcell",
                "href": "/profile/Barry-Purcell-2"
            },
            "answer_text": "1. Take the cable that comes from your set top box and plug it into the back of your television. Make a note of which port in the back of your television you've just used. It might be a SCART port, or a HDMI port, or something else. It doesn't matter. Just remember what it is. 2. Find the button on your TV remote control (NOT the set top box remote!) that lets you choose from different inputs. It might say \"inputs\" on it, or it might have a picture of a little TV screen with a small arrow going into it. I can't tell you what it is. You'll have to work that out yourself.  3. Hit the button and remember which port you plugged the set top box into, and select it from the list that appears.  4. You should see something on your screen more or less immediately. Now you can use your set top box remote to look around for channels. One would assume that the most popular channels would be on 1 or 2 or 3, and so on, but this might not be so. It depends. You can probably get a list on the website of whoever made the set top box.  5. Enjoy endlessly repeated episodes of unfunny ten-year-old sitcoms, reality shows about people you actively avoid in real life and late-night infomercials selling you things you don't need.  6.  I watched a snail crawl along the edge of a straight razor. That's my  dream; that's my nightmare. Crawling, slithering, along the edge of a  straight razor... and surviving. ",
            "date": "Answered April 29, 2014",
            "views": "208",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Naganathan Venkatrshwar",
                    "user_href": "/profile/Naganathan-Venkatrshwar"
                },
                {
                    "user_id": "Pradeep Ch",
                    "user_href": "/profile/Pradeep-Ch-22"
                },
                {
                    "user_id": "Andrea Murphy",
                    "user_href": "/profile/Andrea-Murphy-2"
                }
            ]
        }
    ]
}