{
    "title": "How to use the Internet for free - Quora",
    "tags": [
        "Free Internet",
        "Internet Access",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin O'Hara",
                "href": "/profile/Martin-OHara-10"
            },
            "answer_text": "Unfortunately you cant get totally free internet anywhere. Even wifi access at coffee shops may cost you the price of a cup of coffee and a bun, and even this is limited in value, as you wont be spending all your time there. The best way to get “free data” is to “free up” some of your data on your monthly mobile plan. For example if you could stream video at a lower rate, you could free up half the data you spend on video streaming, and use it for other activities like browsing, downloading or more streaming. This is possible with a free app called Datamore from the android play store, and its specifically designed for those who stream a lot of video. Video players stream at the highest data rate to ensure the highest quality video is delivered to the end user, regardless of the cost in data terms. However normal quality is more than good enough for most people, especially on a small screen device like a smartphone, so we can limit the data rate AND still enjoy very good video quality. Datamore : Data Saver for Streaming Video - Apps on Google Play ",
            "date": "Answered December 10, 2019",
            "views": "401",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Rowlands",
                "href": "/profile/Ian-Rowlands"
            },
            "answer_text": "It's an old story: There is no such thing as a free lunch. There is no such thing as \"free\" internet access. Oh you can hide most of the costs from yourself but they are till there. You need an access device, an Internet Service Provider, and network access. Where I live you can avoid those explicit charges by going to a branch of the county library and use an access point there. However ... There's a cost to get to the library. There's a cost in time while you wait for your time. There's a cost to your freedom as some sites are blocked (not any I care about, but you might).Finally, there is the value to advertisers of access to your eyeballs!Bottom line? It's not free - but you can choose the price you want to pay. ",
            "date": "Answered September 3, 2015",
            "views": "6",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Owen",
                    "user_href": "/profile/Chris-Owen-53"
                },
                {
                    "user_id": "Tibet Ambroce",
                    "user_href": "/profile/Tibet-Ambroce"
                },
                {
                    "user_id": "Christopher Carver",
                    "user_href": "/profile/Christopher-Carver-10"
                },
                {
                    "user_id": "Jensen Oakwater",
                    "user_href": "/profile/Jensen-Oakwater"
                },
                {
                    "user_id": "Joshua Grosso",
                    "user_href": "/profile/Joshua-Grosso"
                }
            ]
        }
    ]
}