{
    "title": "How has technology changed the way we learn? - Quora",
    "tags": [
        "Learning New Things",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paula Alexandra Clapon",
                "href": "/profile/Paula-Alexandra-Clapon"
            },
            "answer_text": "I found this article with some info about how technology has changed learning. I think it might be useful to you. Here is a link to the full article. “Experts in the field now agree that learning has changed. It is no longer about the product of learning and it is more about the process of learning. This could explain why we have seen an increase in topics like gamification, active learning, adaptive learning, and microlearning. New learning theories have been created to address the changes in learning: Situation cognition, distributed cognition, and socially shared cognition. These theories state that learning needs to occur in an active learning community to be successful. These communities support communication and interaction between people and technology tools. With technology, learning is no longer restricted to paper and pencil. Video games or video game elements, the internet, social networks, forums, communication apps, and augmented reality are just a few of the technologies creating more diverse learning systems. Technology can help to provide scaffolding to the learning or to make the learning process easier. It can create learning tools and platforms that provide more action and interaction. Learners are using social media to learn information, share it with others, and discuss it. Integrating technology into learning environments can create improved confidence and motivation. It can help people develop positive attitudes about learning, improving attendance and lowering dropout rates. Technology also creates the opportunity for more interaction.” Source: The Definition of Learning Has Changed: Managing Technology's Influence ",
            "date": "Answered December 18, 2016",
            "views": "28",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Regina Mwaba",
                    "user_href": "/profile/Regina-Mwaba"
                },
                {
                    "user_id": "Laureanne Ventura",
                    "user_href": "/profile/Laureanne-Ventura"
                },
                {
                    "user_id": "Trang Phan",
                    "user_href": "/profile/Trang-Phan-67"
                },
                {
                    "user_id": "Lyubomyr (Lou) Reverchuk",
                    "user_href": "/profile/Lyubomyr-Lou-Reverchuk"
                },
                {
                    "user_id": "Ramesh Krishnan",
                    "user_href": "/profile/Ramesh-Krishnan-51"
                },
                {
                    "user_id": "Archana Mahesh",
                    "user_href": "/profile/Archana-Mahesh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adlen Berkani",
                "href": "/profile/Adlen-Berkani"
            },
            "answer_text": "The traditional way of learning in a classroom, with a professor that teaches to students has been used for hundred of years, it led to many inventions and scientific discoveries but also has it limits. Digital Learning is the process of using digital tools and technology to create a better learning experience for students and to influence the learning experience. Technology has influenced the way corporation train their employees for the past 2 decades with e-learning. More recently, it has been adopted by schools and universities. Nowadays about 80 % of US organisations use digital tools to enhance the trainings of their employees. And in June 2018, Coursera (the largest Mooc provider) had 33 million users all around the world. So, digital learning has had an immense impact on the way we learn and the impact will grow even further. The idea of Digital Learning is to make trainings more efficient and to improve the learning experience of learners using the latest tools. The goal is not to entirely abandon classical training but rather to enhance it using technology. With the use of digital learning solutions, the goal is to help the learner gain the skills or knowledge needed by having control over: The place and time of the trainingThe learning path (difficulty)The pace of the trainingInteractions with othersThese improvements radically enhance the learning experience and reduce the price of high quality education. Thus, it will be adopted by the mass. Digital learning has a great future ahead and its impact on our society will continue to increase. ",
            "date": "Answered September 11, 2018",
            "views": "697",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chimere Elele",
                    "user_href": "/profile/Chimere-Elele"
                },
                {
                    "user_id": "Rethida Tek",
                    "user_href": "/profile/Rethida-Tek"
                }
            ]
        }
    ]
}