{
    "title": "How much has smartphone usage likely contributed to poor eyesight in children? - Quora",
    "tags": [
        "Ophthalmology",
        "Eyesight",
        "Children",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Otto",
                "href": "/profile/Bill-Otto-5"
            },
            "answer_text": "Well, Jonathan, this is very bad science and a disgrace that so many people are still in the dark ages. Why don’t we take a survey of Catholic priests to determine if the Earth is flat? A survey of Japanese educators, however carefully conducted, is not a scientific method. Actual scientific method is open to any potential cause and tries to narrow down the causes by eliminating those that can be shown not to be involved in a significant way. Studies have actually shown that cellphone usage and reading do not have any measurable effect on refractive errors. There is also no mechanism postulated for how that would work. In order to have myopia, the eye must grow longer than it should. Exactly how is a Smartphone supposed to make the eye grow longer? No one has put forth a serious mechanism for that. We don’t know what causes myopia. We know there is some hereditary component and some environmental component. But what in the environment? GMOs? Growth hormones in cows? Artificial sweeteners and preservatives? Less outdoor time? Not much of this has been studied. Outdoor time does seem to have a murky relationship which is not consistent among studies. If you are serious about this question, then please look at my detailed answer here: Bill Otto's Answer to What causes myopia and is there a cure? ",
            "date": "Answered December 26, 2018",
            "views": "502",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sanjay Bhartiya",
                    "user_href": "/profile/Sanjay-Bhartiya-9"
                },
                {
                    "user_id": "Vanessa Kruze, CPA",
                    "user_href": "/profile/Vanessa-Kruze-CPA"
                },
                {
                    "user_id": "Preeti Mandal",
                    "user_href": "/profile/Preeti-Mandal-7"
                },
                {
                    "user_id": "John Leslie",
                    "user_href": "/profile/John-Leslie-42"
                },
                {
                    "user_id": "Dee Hoban",
                    "user_href": "/profile/Dee-Hoban"
                },
                {
                    "user_id": "Sharon Breivogel-Leonard",
                    "user_href": "/profile/Sharon-Breivogel-Leonard"
                },
                {
                    "user_id": "Paulo Henrique Silva Monteiro",
                    "user_href": "/profile/Paulo-Henrique-Silva-Monteiro"
                },
                {
                    "user_id": "Manish Pal",
                    "user_href": "/profile/Manish-Pal-164"
                },
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                },
                {
                    "user_id": "Luminita Virlan",
                    "user_href": "/profile/Luminita-Virlan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Wilkinson",
                "href": "/profile/Ben-Wilkinson-81"
            },
            "answer_text": "I can see no connection between smartphones and poor eyesight. An excess (whatever that happens to be) of any activity is harmful, especially in children. Any cultural change is likely to bring unforeseen problems. Do you have any reliable research that demonstrates that children’s vision has deteriorated recently? In the last 10 years? ",
            "date": "Answered January 17, 2019",
            "views": "10",
            "upvotes": " Answer requested by Frank Anthony Caruso, Jr."
        }
    ]
}