{
    "title": "How hard is it for you maintain anal only? - Quora",
    "tags": [
        "Anal Sex",
        "Adult Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alana Brown",
                "href": "/profile/Alana-Brown-103"
            },
            "answer_text": "Not even a little bit! Anal only has become completely natural for me, and that’s not an exaggeration. I know some girls love the idea of anal only but find it hard to maintain in practice. That’s not how it is for me. Having vaginal sex or using my clit would be very hard to maintain at this point because they’re nowhere near as enjoyable as anal for me, and I wouldn’t enjoy them. I never enjoyed vaginal sex. I couldn’t orgasm from it, and it would often start to get uncomfortable and raw feeling, sometimes even painful, in the absence of pleasure. I had to rub my clit to avoid that feeling, and it was very easy for me to get oversensitive in my clit and uncomfortable, which was amplified further after orgasm, where I’d be repulsed by being touched anywhere around my pussy and clit. With anal, I had a lot more pleasure right away, initially still cumming from my clit, but once I learned I could orgasm just from anal without my clit, I started to do anal a lot more, and over time decided to stop vaginal entirely, and then stopped using my clit a while after too. I haven’t ever used either since. It was that easy a decision, and I’m super committed to it. In addition to not liking either, I find it a real turn on to know that I haven’t been fucked in my pussy in ten years and never will again. It’s part of my identity now, it’s who I am, and that’s just not changing after all this time. And besides, why would I want to have worse sex? ",
            "date": "Answered June 16, 2020",
            "views": "896",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nadia Di Giamberardino",
                    "user_href": "/profile/Nadia-Di-Giamberardino"
                },
                {
                    "user_id": "Gita Gurav",
                    "user_href": "/profile/गीता-गुरव-Gita-Gurav"
                },
                {
                    "user_id": "Peter DeMarco",
                    "user_href": "/profile/Peter-DeMarco-9"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Hasanyryan"
                },
                {
                    "user_id": "Juan Solorzano",
                    "user_href": "/profile/Juan-Solorzano-2-1"
                },
                {
                    "user_id": "Dion Shaw",
                    "user_href": "/profile/Dion-Shaw"
                },
                {
                    "user_id": "Nathaniel Smith",
                    "user_href": "/profile/Nathaniel-Smith-51"
                },
                {
                    "user_id": "Cliff Kammerdiener",
                    "user_href": "/profile/Cliff-Kammerdiener-1"
                }
            ]
        }
    ]
}