{
    "title": "How is it to live without seeing a doctor ever? - Quora",
    "tags": [
        "Natural Health",
        "Off-Grid",
        "Preventive Medicine",
        "Doctor Opinions on Prescription Drugs",
        "Complementary and Alternative Medicine",
        "Doctors",
        "Pharmaceuticals"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rowena Portch",
                "href": "/profile/Rowena-Portch"
            },
            "answer_text": "Absolutely wonderful! Modern medicine is great, but for me, I would rather put my health in my own hands. I make my own medications with herbs and wild plants. I went to school for four years to learn about nutrition, herbs, and the art of making medicine. My immediate family has not seen a doctor in over 20 years. Of course, if we are involved in a major accident, seeking medical attention is a must, however, we never see a doctor for sickness or minor injuries. I’m 57 years old and do not take any pharmaceutical medication. When I’m sick, I use Natrual medicine to heal. The trick is knowing about pathologies, human biology, nutrition, and healing herbs and plants. This takes time and good education. You would be surprised at how many healing plants grow right outside your door. Before I learned about healing myself, I used to get pneumonia at least four times per year. I suffered a never-ending string of urinary tract infections, yeast infections, and general fatigue. The medicines my doctors prescribed were effective, but did little in helping my body heal. The infections always returned. Today, I no longer suffer ongoing infections. I have energy, and my spirit is bright. When I do get sick, I’m typically over it in a day or two at the most. Why? because I have allowed my body to heal itself by giving it what it needs to thrive. Keep in mind, I’m blessed with good health and the knowledge to make medicine when I need it. Everyone is different and some people truly need help from a doctor. You must make that choice yourself. Doctors enter medicine because they want to help people. Insurance and medical associations make that difficult. Many doctors escape to doctors without borders just so they can practice what they are passionate about—helping people heal without the dictation from organizations that care only about the bottom line. Thank God we have such doctors who dedicate themselves to the healing arts. Other doctors do not always have your best interest in mind. They believe the devices they install in your body have been thoroughly tested, when in truth, they have not. They believe that the FDA has done their job and will discontinue a device or drug if it has proven to be harmful. Issues with a drug or device are supposed to be reported by the manufacturer, but they are not. Before you have a procedure done, take medication, or have a device installed, do your research. Find out if others have tried the same and see what they say. Do not assume that your doctor knows everything. Take control and responsibility of your health. Take the time to learn. ",
            "date": "Answered August 11, 2018",
            "views": "27",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kristopher TenHarmsel",
                    "user_href": "/profile/Kristopher-TenHarmsel"
                },
                {
                    "user_id": "ML Kuklish",
                    "user_href": "/profile/ML-Kuklish-1"
                },
                {
                    "user_id": "Bonnie Mellott",
                    "user_href": "/profile/Bonnie-Mellott"
                },
                {
                    "user_id": "Ann Bradley",
                    "user_href": "/profile/Ann-Bradley"
                },
                {
                    "user_id": "Casper Udemark",
                    "user_href": "/profile/Casper-Udemark"
                },
                {
                    "user_id": "Yola Monique Hamlin",
                    "user_href": "/profile/Yola-Monique-Hamlin"
                },
                {
                    "user_id": "Gregg Portch",
                    "user_href": "/profile/Gregg-Portch"
                },
                {
                    "user_id": "Clare Watts",
                    "user_href": "/profile/Clare-Watts-8"
                },
                {
                    "user_id": "Christine Db",
                    "user_href": "/profile/Christine-Db"
                },
                {
                    "user_id": "Mai Hoang Cao",
                    "user_href": "/profile/Mai-Hoang-Cao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kyrani Eade",
                "href": "/profile/Kyrani-Eade"
            },
            "answer_text": "With the exception of one test I had done for curiosity’s sake in around 2004, I haven’t seen a doctor since 1994. That is about 25 years. I am now 70 and have very good health. The reason for my good health and my not having to see a doctor, not even through a telescope, is the knowledge I was given by a surprising source, my late psychopathic husband. He told me how inhumane people operate, underhandedly of course, to affect those around them with whom they are related. With this knowledge, which I am sharing freely with all humane people (see my profile page if you are interested) I have been able to overcome many very bad health conditions by myself and with spectacular success. To get a brief view of the ways in which the inhumane operate, or what I call the underhanded foul game play, you can watch the two videos in my pinned answer (the sixth of my series and a sort of summary) : Kyrani Eade's answer to Does the distinction drawn by doctors between \"organic illnesses\" and psychiatric illness play into the old stereotype that psychiatric illness isn't genuine? What would be less pejorative terminology? I have gone a lot further though and have done a lot of research and found that the science actually points strongly to disease being a nocebo effect, i.e., a person’s adverse bodily reaction to ideas and perceptions about some sort of harm that they have believed to be true. In this long answer I discuss the scientific evidence I have found on cancer: Kyrani Eade's answer to How can we understand self healing and can cancer be treated or suppressed? ",
            "date": "Answered June 20, 2019",
            "views": "798",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jon Kervin",
                    "user_href": "/profile/Jon-Kervin"
                }
            ]
        }
    ]
}