{
    "title": "How is technology destroying thousands of jobs? - Quora",
    "tags": [
        "Technological Unemployment",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Jonas",
                "href": "/profile/Tom-Jonas-12"
            },
            "answer_text": "Quite simple: technology is becoming better and better at doing various tasks, and increasingly it is able to do these tasks better than a human can. So once it becomes more efficient (and cheaper) to implement, many industries and employers will switch to using machines to do jobs that humans could do. Case in point- an automated cash register can do basically the same job as a manual cashier, and it doesn’t need to take a break, doesn’t need to be paid for its time, won’t ever complain, and so forth. So many supermarkets have switched to using these, or have at the very least cut down on the number of manned cash registers they use. Similarly, robots in factories can do the same tasks that human machine operators can do, but they can do it round the clock without ever needing food, water, rest, or anything, so you can Now yes, if you’re a technology expert, the future looks bright for you- some answers have commented “well, I’m an electronics engineer and I’ve got plenty of work”, and this is no doubt true. However, it’s certainly not the case that all the various jobs replaced by machines can simply be replaced by others- and importantly, a single engineer might be responsible for looking after many machines, each of which would once have been a human worker. Skill levels are also important- right now, many unskilled tasks are being automated away. There is also increasing concern that increasingly powerful AI may automate at least some formerly skilled jobs as well. ",
            "date": "Answered October 30, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lutz Filor",
                "href": "/profile/Lutz-Filor"
            },
            "answer_text": "Technology is not destroying jobs, consumer behavior is destroying jobs. Right now we are changing our social behavior. If you vote with your dollar to shop at Amazon you destroy or not support the shop in your neighborhood. Don’t complain to me, that you are living in a desert in a few months and have to drive for hours to find a shop or a restaurant. Everybody is so keen to buy out of convenience I refused to order my coffee online.And voila - weeks later I can buy my coffee at the door. ",
            "date": "Answered October 23, 2020",
            "views": "63",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gregory Norton",
                    "user_href": "/profile/Gregory-Norton"
                }
            ]
        }
    ]
}