{
    "title": "How to connect set top box to PC - Quora",
    "tags": [
        "Set-Top Boxes",
        "Cable TV",
        "Personal Computers",
        "Television"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Hannent",
                "href": "/profile/Bob-Hannent"
            },
            "answer_text": "You can use a video capture card. Depending on what outputs your STB has and what quality you want, you can get HDMI capture devices, component capture devices, composite capture devices, etc. The only thing to remember is that many STBs have copy protection on their outputs and that can be a problem for capture devices. For example very few capture devices support HDMI HDCP (HD Content Protection). Analogue content protection is easier to defeat but also existed and can cause problems for capture devices. And before you ask: no you can't use the USB port on the STB. I hear this request a lot and there isn't any chance of that working. USB wasn't designed for it and the designers of the box are often excluded from doing anything like that for security reasons. There are some STBs which support UPNP or DLNA content sharing, but these are rare. ",
            "date": "Answered April 11, 2016",
            "views": "92",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anand Job",
                    "user_href": "/profile/Anand-Job-1"
                },
                {
                    "user_id": "Joe Maldonado",
                    "user_href": "/profile/Joe-Maldonado-11"
                },
                {
                    "user_id": "Jimmy Clemence",
                    "user_href": "/profile/Jimmy-Clemence"
                },
                {
                    "user_id": "Saranraj Paranjothi",
                    "user_href": "/profile/Saranraj-Paranjothi"
                },
                {
                    "user_id": "Sanika Pandharkar",
                    "user_href": "/profile/Sanika-Pandharkar"
                },
                {
                    "user_id": "Faisal Izhar",
                    "user_href": "/profile/Faisal-Izhar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devanshu Arya",
                "href": "/profile/Devanshu-Arya-2"
            },
            "answer_text": "You have to use a TV tuner card it can either be an internal one or an external one. Its pretty easy I used to use one where the TV tune card came with its own software so you you connected the set top box via this and then you could watch TV on your computer, even record programs on your hard disk. Guess the newer laptops/desktops have HDMI you can connect via that too. ",
            "date": "Answered April 10, 2016",
            "views": "38",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joe Maldonado",
                    "user_href": "/profile/Joe-Maldonado-11"
                },
                {
                    "user_id": "Saranraj Paranjothi",
                    "user_href": "/profile/Saranraj-Paranjothi"
                },
                {
                    "user_id": "Faisal Izhar",
                    "user_href": "/profile/Faisal-Izhar"
                }
            ]
        }
    ]
}