{
    "title": "How would you rate your current phone compared to your first ever mobile phone in terms of reliability and toughness? - Quora",
    "tags": [
        "Mobile Phone Recommendations",
        "Android Devices",
        "Mobile Technology",
        "Technology",
        "Mobile Applications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lewis Edge",
                "href": "/profile/Lewis-Edge-2"
            },
            "answer_text": "My first mobile phone was installed in my car by Bell Atlantic and cost nearly US$1,000. It included a handset installed on the center console of my car. The electronics for the phone were installed in my trunk. The antenna for that phone was mounted on the deck of my sedan’s trunk. As long as I had a signal I could place a call anywhere, but anyone who called me would need to know what region I was in and then dial the right code to reach me. To make the phone portable required buying what was called a T-Pack. It weighed 7 1/2 pounds with its Nickel Cadmium battery. To make the T-Pack operational, I had to slide my phone’s electronics out of the tray in the trunk of my car and plug it into the T-pack. Then I had to unplug the handset from the center console of my car and plug it into the T-Pack. It had a shoulder strap to be able to carry the phone hands-free. Using an acoustic coupler with that phone enabled me to make data connections using a dial-up modem. Dial-up modems were the only way to send/receive data in those days before there was public access to the Internet. MCI mail was one of the first email services available during the early eighties. ",
            "date": "Answered October 22, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Buster Smith",
                "href": "/profile/Buster-Ecks"
            },
            "answer_text": "My first phone which I remember the model number of was a Motorola V551.  How tough was the phone? I’d frequently remove the screw-on antennae and use it to play hacky-sack with some friends. The phone worked flawlessly for quite some time even after the many many many drops, bounces, and kicks. The only reason it was replaced was because I switched carriers and the new carrier didn’t support the device.  My phone now is the Samsung Galaxy S9. Where I was quick to play hacky-sack with the V551, I dive to intercept the S9 because it impacts carpeting on the floor.  When the phone does fall to the floor, I hold my breath and hope that the screen isn’t cracked or otherwise broken. All this and the phone has a protective case and quality screen-protector. In terms of reliability, both rate about the same. This is of course taking into account the advancements of the infrastructure over the last 2 decades or so. ",
            "date": "Answered October 22, 2020",
            "views": "156",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Vanessa",
                    "user_href": "/profile/Andrew-Vanessa-2"
                }
            ]
        }
    ]
}