{
    "title": "How much is a dollar bill with a star in the serial number worth? - Quora",
    "tags": [
        "Dollar Bills",
        "Two-Dollar Bill",
        "Serial Numbers",
        "Valuations (finance)",
        "Value (economics)",
        "Coins",
        "U.S. Dollar",
        "Currencies",
        "Economics of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Colt",
                "href": "/profile/Kevin-Colt-3"
            },
            "answer_text": "the star indicates that the original dollar was rejected by the mint as defective (cut badly, smudged, missing or mismatched details etc.), and it was replaced with the same serial number with a star to identify it as a replacement. there are some collectors that specialize in star notes. if it’s relatively recent probably two bucks, if it’s old, maybe three. if it’s a silver certificate, five or ten. check on ebay for prices. I had a bill that sported two stars. that meant the replacement was replaced. unfortunately, it was stolen along with the rest of my collection. that note would probably fetch around $1500 right now. ",
            "date": "Answered December 25, 2019",
            "views": "4",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Skelton",
                    "user_href": "/profile/Jim-Skelton-2"
                },
                {
                    "user_id": "Nathan Nance",
                    "user_href": "/profile/Nathan-Nance-11"
                },
                {
                    "user_id": "Hamed",
                    "user_href": "/profile/Hamed-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chas Alston",
                "href": "/profile/Chas-Alston"
            },
            "answer_text": "Star notes are replacement notes for bills that were damaged and caught before release…after release the damaged notes become error notes and very collectible… Depending on the variety of the note and condition is value determined…Star notes are collectible… A Star Hawaii or N. Africa gets a premium…as do some of the higher denominations…while modern star notes are usually face value unless unique in some way… ",
            "date": "Answered June 25, 2020",
            "views": "35",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Curtis Childress",
                    "user_href": "/profile/Curtis-Childress-2"
                },
                {
                    "user_id": "Bruce Greenhalge",
                    "user_href": "/profile/Bruce-Greenhalge"
                },
                {
                    "user_id": "Vernon Averill",
                    "user_href": "/profile/Vernon-Averill"
                }
            ]
        }
    ]
}