{
    "title": "How to transfer a WhatsApp chat history from Android to iOS - Quora",
    "tags": [
        "Chat History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tahseen Arshalan",
                "href": "/profile/Tahseen-Arshalan"
            },
            "answer_text": "Try the given tricks:- Solution 1: Transfer WhatsApp Messages from Android to iPhone via \"Email chat\" 1. Open WhatsApp on your Android device, go \"Setting>Chats Setting>Chat History>Email chat\" 2. Choose the chat that you would like to have on your iPhone, there will be a pop-up window asking whether to transfer your WhatsApp messages with or without media. Transferring the messages with media will take longer time.  3. Then it will come to the sending page. Provide an email account and click the sending option. 4. Log in the email account on your iPhone, you can then view the WhatsApp messages, but are unable to have the messages on the WhatsApp application of the iPhone. Solution 2: Transfer WhatsApp Messages from Android to iPhone via Backup 1. Backup your WhatsApp messages on Android cell phone: go \"Setting>Chats>Chat backup\", and click \"BACK UP\" button.  2. Uninstall WhatsApp on your Android device. 3. Launch WhatsApp on your iPhone device and log in with your original WhatsApp account.  4. There will be a pop-up window informing you that \"Message Backup Found\", click \"Restore\". Your Android WhatsApp messages will be transferred to your iPhone. Transferring WhatsApp messages via backup is more complicated than emailing the messages, however, you can have the chats on the WhatsApp of your new iPhone, which make it easier for you to catch up the conversation on the old Android phone. Therefore, it is worth the trouble to transfer WhatsApp message by backup. ",
            "date": "Answered September 30, 2017",
            "views": "123",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sandra DeMeritt",
                    "user_href": "/profile/Sandra-DeMeritt-2"
                },
                {
                    "user_id": "Parveez Ahmed",
                    "user_href": "/profile/Parveez-Ahmed-75"
                },
                {
                    "user_id": "Giulia Sorrentino",
                    "user_href": "/profile/Giulia-Sorrentino-1"
                },
                {
                    "user_id": "Cheng Kiong Toh",
                    "user_href": "/profile/Cheng-Kiong-Toh"
                },
                {
                    "user_id": "Deepak",
                    "user_href": "/profile/Deepak-894"
                },
                {
                    "user_id": "Safi Shamsi",
                    "user_href": "/profile/Safi-Shamsi-1"
                },
                {
                    "user_id": "Sayed Seemab Zehra",
                    "user_href": "/profile/Sayed-Seemab-Zehra"
                },
                {
                    "user_id": "Humera Sheikh",
                    "user_href": "/profile/Humera-Sheikh"
                },
                {
                    "user_id": "Anam Ahmad",
                    "user_href": "/profile/Anam-Ahmad-15"
                },
                {
                    "user_id": "Aisha",
                    "user_href": "/profile/Aisha-361"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samuel Kim",
                "href": "/profile/Samuel-Kim-117"
            },
            "answer_text": "Clear all data on your Android device WhatsApp, then move to the iOS and begin from scratch as if you’re creating the WhatsApp on the new device, of course under the same mobile number as was on the Android device. As you progress to have WhatsApp on the iOS device, the system recognizes you have past messages and asks for your OK to import them to the new device. That’s all you’ll need to do and have your messages transferred. ",
            "date": "Answered May 4, 2018",
            "views": "33",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fleur Anne Dias",
                    "user_href": "/profile/Fleur-Anne-Dias"
                },
                {
                    "user_id": "Mohamed Ahmed",
                    "user_href": "/profile/Mohamed-Ahmed-168"
                },
                {
                    "user_id": "Shantanu Tadas",
                    "user_href": "/profile/Shantanu-Tadas-1"
                }
            ]
        }
    ]
}