{
    "title": "How to fix an Android phone that keeps restarting - Quora",
    "tags": [
        "Android Operating System Advice",
        "Smartphone Advice",
        "Android Devices",
        "How-to Question",
        "Android (operating system)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shane Britton",
                "href": "/profile/Shane-Britton-3"
            },
            "answer_text": "In Android development we call this “random rebooting.” This can be a huge nuisance and is obviously problematic in terms of reliability. This problem is almost always due to a bug or corruption in your kernel, which ironically, is located in your boot image. If you have modified your stock configuration in any way (rooted, custom recovery, custom kernel, Xposed Framework, etc.), your best option is to revert back to a full stock configuration (stock recovery, stock kernel, stock ROM), and start over on your customizations, taking special care to watch for random rebooting. If you have never modified your device in any way, random rebooting can most easily be corrected by performing a factory data reset. First backup all important userdata, charge your battery to at least 60%, go to Settings>Backup & Reset and opt for a factory data reset. Your device will boot into stock recovery and your /system and /cache partitions will be wiped completely, effectively reverting your device back to stock factory condition. If this does not fix the problem, you will need to manually flash your device will a stock firmware package. Visit XDA-Developers Android Forums and search for your model. There you can typically find stock firmware and tutorials for flashing your particular device. ",
            "date": "Answered May 1, 2018",
            "views": "295",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ilias Kslr",
                    "user_href": "/profile/Ilias-Kslr"
                },
                {
                    "user_id": "I.A. Scriberner",
                    "user_href": "/profile/I-A-Scriberner"
                },
                {
                    "user_id": "Arpit Kaushal",
                    "user_href": "/profile/Arpit-Kaushal"
                },
                {
                    "user_id": "Ryan Liau",
                    "user_href": "/profile/Ryan-Liau-1"
                },
                {
                    "user_id": "Krishnavtar Jaiswal",
                    "user_href": "/profile/Krishnavtar-Jaiswal-1"
                },
                {
                    "user_id": "Silent Spring",
                    "user_href": "/profile/Silent-Spring"
                },
                {
                    "user_id": "Sarthak Tamhankar",
                    "user_href": "/profile/Sarthak-Tamhankar"
                },
                {
                    "user_id": "Nikil Paramesh",
                    "user_href": "/profile/Nikil-Paramesh"
                },
                {
                    "user_id": "Angela Quinty",
                    "user_href": "/profile/Angela-Quinty"
                },
                {
                    "user_id": "ALEX ABAH",
                    "user_href": "/profile/ALEX-ABAH"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mac Lee",
                "href": "/profile/Mac-Lee-40"
            },
            "answer_text": "There are various reasons for an Android phone that keeps restarting: Some apps with poor qualityThe device automatically shut off because of too hotThe loose battery, which may can be attributed to the battery connector is bent out of shapeYour “Power” button is stuck so that the pressure is always putting on it To solve such problems easily, iMyFone Fixppo for Android will be a good choice. Its advanced technology and high success rate will repair your Android OS at fast repairing speed. Its clear interface will lead to finish the operation and professional skills are not needed. ",
            "date": "Answered October 28, 2019",
            "views": "47",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raymond Damilare",
                    "user_href": "/profile/Raymond-Damilare"
                },
                {
                    "user_id": "Sarthak Tamhankar",
                    "user_href": "/profile/Sarthak-Tamhankar"
                },
                {
                    "user_id": "Jason Sauer",
                    "user_href": "/profile/Jason-Sauer-3"
                }
            ]
        }
    ]
}