{
    "title": "How do Chinese companies make a profit by selling mobile phones at such low cost? - Quora",
    "tags": [
        "Chinese Companies",
        "Business in China",
        "Profitability",
        "Mobile Technology",
        "Costs",
        "Companies",
        "China",
        "Technology",
        "Business"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chang Liu",
                "href": "/profile/Chang-Liu-793"
            },
            "answer_text": "They don’t make money, on purpose. They use predatory low source pricing to scare away any competitors. These companies all work for China Inc. - China is actually a single company, the biggest company in the world. These individual factory/companies don’t make money so no one can compete - and they extract foreign currencies from western buyers. The China Inc wants to obtain western currency. They want to be the only one fulfilling the western orders. China is not really a free economy - the people of China do not own land or properties. Even their houses are only for 70 years rights of use - the land belongs to country, and hence any business that runs on the land has to belong to the country. The Chinese government is the biggest capitalistic company. Consider all Chinese companies their subordinates - and you get the idea. The Chinese companies purposely do not make profits, so the western buyers are addicted. That is their game plan. They sell labor at amazing low cost to obtain buyer contracts.  Chang Liu's answer to Why do most of the countries blame China for everything knowing there is no substitute in the near future for low price imports from China?  It is important to explain basics of supply chain and channel pricing. When a merchandise is sold in USA in a store like Target or Amazon, it carry a retail price of say 30 dollars. But the merchandise is a western brand (e.g., Apple or Nike), it is only manufactured/assembled in China. The stores obtain the source items for about 2 dollars, and the rest of the money (28) is pure channel margin. The Chinese factory’s profit is made within this 2 dollars. For that they spend capital, build factory, hire workers, and make things, and then sell their source items for amazing low price. When we say “China profit’ we are talking about the profit withim this 2 dollar source pricing. The rest of the “profit” has nothing to do with Chinese factory and factory owners. Low cost of Chinese goods also have little to do with American customers benefits or “enjoyment” - the channel margin these western companies extracts is staggering anyways. The Chinese factory charge just enough to cover their cost. They make revenue and cash flow, but nit profits. China decided to make small profits on that source … they are willing to “make no money so that no one else can make money”. Note: please be mindful “Not making profit” does not mean “not making money”. It just means artificially setting your profit margin to near zero, so that Vietnam, Mexico and Africa and everyone has to bleed if they want to compete with China and fulfill western manufacturing orders. It is raw capitalism.  Note 2: The supply chain is badly explained to many. The Chinese workers hate America - they think they work in a sweat shop and Americans buy their products for 3 dollars. No, it is priced at 30. The American consumers may not like China, because they think Chin made 20 or 29 dollars. None of these is true. In between is greedy corporate America and Wall Street that regulate the behavior of Corporate America. The Chinese companies are shrewd and super tough businessman. They are willing to not make making much money to make sure they monopolize the job orders and all assembly jobs of the world. Chang Liu's answer to Why is China better than the US? Chang Liu's answer to Why should Western tech companies not set up in China? Chang Liu's answer to How can China successfully develop a separate financial services system to go around the US SWIFT system? Chang Liu's answer to Why does the government of the United States view Huawei as such a threat and has it been effective in damaging the Chinese company? ",
            "date": "Updated October 21, 2020",
            "views": "93",
            "upvotes": " View 797 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tejas Kulkarni",
                    "user_href": "/profile/Tejas-Kulkarni-73"
                },
                {
                    "user_id": "Sreenivasan Nair",
                    "user_href": "/profile/Sreenivasan-Nair-1"
                },
                {
                    "user_id": "Avinash Kumar",
                    "user_href": "/profile/Avinash-Kumar-5"
                },
                {
                    "user_id": "Fae Liu",
                    "user_href": "/profile/Fae-Liu"
                },
                {
                    "user_id": "Jasveen Singh Sandral",
                    "user_href": "/profile/Jasveen-Singh-Sandral"
                },
                {
                    "user_id": "Shantanu Birole",
                    "user_href": "/profile/Shantanu-Birole"
                },
                {
                    "user_id": "Narayanan Srinivasan",
                    "user_href": "/profile/Narayanan-Srinivasan-65"
                },
                {
                    "user_id": "Pratap Singh",
                    "user_href": "/profile/Pratap-Singh-804"
                },
                {
                    "user_id": "Ammar Haider Shah",
                    "user_href": "/profile/Ammar-Haider-Shah"
                },
                {
                    "user_id": "Akshay Jain",
                    "user_href": "/profile/Akshay-Jain-1988"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronald Barry",
                "href": "/profile/Ronald-Barry-4"
            },
            "answer_text": "Question is who manufactures the phones and really what is the cost for material. Also if machines are making them labor costs are low. Honest if it only costs cents for the plastic to use computers and machines making the moldings and design of the casing yo hold the micro harware one very little material is used to build a phone or device. Purchasing material at such high amounts or they are the manufacture of plastic or the material used to make the device well wow not only are they making a profit in selling material to other companies for a profit. If they manufacture the material needed to make the device and the manufacturer of the device. Where are the costs. They don't need to buy the material to make the device. Im sure there are some costs but if that were the case. For them to be able to sell a phone cheap. Its because the cost to make it is very low. Imagine if it only costs a few cents or maybe a dollar or two to make it. Honest what about tge glass screen what if they are their own manufacturers of glass so the glass screen not only is manufacture in the same country. Im sure the technology companies own most of those manufacturers or have accounts with the executives for a percentage of revenue to provide materials to the phone manufacturing company. Ideally to sell a phone cheap is reasonably simple to do. Now to have the devices shipped to other countries costs and fees so not only do they have to account for the shipping costs and export fees so they have to determine that cost into the cost of the device per device and shipping by large quantities is billed by weight of cargo Im sure. So when they ship the phones over seas to be distributed accross the nation they have to charge a higher rate to cover costs not only that to make a profit. So example if it costs them lets say 2 dollars per device. And an order for 1 million devices to be shipped to the united states well they have to account for the shipping and export fees. At 2 $ of cost for material. That is 2million dollars already. So at 1 million devices they will need to sell the devices at whole sale prices to there franchises in the 🇺🇸 not only that if the devices have different brands well there will be different costs. So lets say they are all samsung at a retail price of 199$ per phone whole sale lets say they charge 75$ per device. So the buyer has to pay 75,000,000.00 for the order of 1 million devices. Now with the cost of material we said its 2$ so thats minus 2 million also the cost ti ship the products its probably shipped by their own shippers. So really they pay the tarifs and export fees and import fees. No what ever that cost may be im sure is not that high. Lets 500 thousand for the shipping and fees this is not an accurate amount im just assuming or using as example. With a total cost of 2.5 million dollars with a sale price of 75 million profit is 72.5million dollars. Now when sold In the 🇺🇸 at retail price of 199$ if all 1 million sold at 199$ that is 199 million dollars in revenue. Minus the cost of 75 million. That is a profit of 124 million. Now what that does if a franchise wants to make a deal on that device to make a profit any amount that they lower the device from 199 will be less in profit they can not go under 75$ for the cost then they takea loss for the devive. Now if that franchises make all of the investment back. Now he can decide to do what ever they want with the devices. Example lets say one franchise orders 10,000 phones at 75$ that 75,000 dollars cost. They will have to sell 376 devices at retail price of 199$ to make the investment back. That leaves 624 devices now are paid in full. So now the franchise can now create deals and offers to sell tge remaining phones. Because they made the investment back. So every device now sold is profit and its totally up to the franchise to decide what to charge. Goal is to sell all of them fast so deal will come out on that device not only will they have other name brand devices to sell now they can offer that specific brand phone cheaper. ",
            "date": "Answered September 13, 2019",
            "views": "1",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jacob Handley",
                    "user_href": "/profile/Jacob-Handley-1"
                }
            ]
        }
    ]
}