{
    "title": "How can we charge nikon battery with power bank? - Quora",
    "tags": [
        "Nikon (company)",
        "Power Banks",
        "Electronic Batteries",
        "Batteries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sayom Sarkar",
                "href": "/profile/Sayom-Sarkar"
            },
            "answer_text": "You did not mentioned what kind of battery it is. Nikon is just a company. Power bank can supply 5V Dc. Most common batteries are 1.2V rechargeable battery & 3.7V rechargeable battery. So you must use a buck converter to step down the voltage to desired 3.7V or 1.2V and then you can apply the voltage directly to your battery. You can use Mini-360 buck converter for this purpose. It is really cheap and effective.  It is also really tiny in size as the name suggests. ",
            "date": "Answered February 17, 2018",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pavitra Shukla",
                "href": "/profile/Pavitra-Shukla"
            },
            "answer_text": "I'd say yes and no. you'd be needing a special adaptor that takes your camera battery via usb that isnt available in india,atleast not through mainstream trusted sources. See if you can find that on alibaba etc. or you'd need camera charging powerbanks that are available for sale like this one Digitek Instant Power Bank for DSLR Camera Support EN-EL14 battery D3100 D5300  That costs about 60% more than usual powerbanks.Plus charge delivered by a powerbank is low and camera batteries are usually huge that'd take a long time to charge the battery fully. I'd rather suggest you to buy a spare nikon battery and charge it using your nikon charger and carry with you as a battery bank.That would be a more feasible,convenient and economical alternative. ",
            "date": "Answered December 15, 2015",
            "views": "128",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nitin Gaikwad",
                    "user_href": "/profile/Nitin-Gaikwad-1"
                },
                {
                    "user_id": "Akash Mangukiya",
                    "user_href": "/profile/Akash-Mangukiya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samyojeet Dey",
                "href": "/profile/Samyojeet-Dey"
            },
            "answer_text": "If the nikon battery supports USB charging then definitely you can. The output voltage of the power bank must be more than the capacity of nikon battery. ",
            "date": "Answered April 23, 2016",
            "views": "4",
            "upvotes": " Answer requested by Tarun Sarkar"
        }
    ]
}