{
    "title": "How well did the Nazis defend Germany in WW2? - Quora",
    "tags": [
        "Nazism",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter Kiefer",
                "href": "/profile/Walter-Kiefer"
            },
            "answer_text": "Nazis and Hitler were kind of like a bad marriage. It started off great and they loved him and where willing to do just about anything to make him happy, up to and including genocide. But, just like a bad marriage, things fell apart drastically at the end. Many had started to ‘wake up’ and see Hitler and his inner circle for the thugs they truly were and became severely disillusioned with them. When the Allies finally made it over the Rhine and into Berlin a lot of them just wanted to make it out alive with whatever dignity they had left so there was no real defense aside from the random pockets of extreme loyalists that were left. Dr. Erskine said “People often forget that the first country the Nazi’s invaded was their own” (Yes I am aware that I just quoted Captain America but it’s a great line). At this point the German people had been through absolute hell. Many of them were veterans and survivors of the Kaiser and the first world war, they had suffered the sanctions from the League of Nations and reparations and massive inflation, midnight raids by the SA, the Gestapo and SS, constant bombings by the Allies, starvation, death, disease, etc etc etc. They were as much Hitler’s victims as anyone and many of the soldiers in the Wehrmacht were just ready for it to be over. They had been fighting for years. Many of them had no idea where their families were, or if they were even alive. Their homes were reduced to rubble, they were physically, mentally, and emotionally exhausted, and they had a very uncertain future. They knew the war was over and that the only hope they could have at surviving and piecing their life back together would be to simply lay down their arms. There was no defending Germany because the Allies weren’t invading Germany. They were liberating it. ",
            "date": "Answered May 1, 2018",
            "views": "256",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John O'Connell",
                    "user_href": "/profile/John-OConnell-56"
                },
                {
                    "user_id": "Alex Zelinsky",
                    "user_href": "/profile/Alex-Zelinsky-4"
                },
                {
                    "user_id": "Thomas van der Valk",
                    "user_href": "/profile/Thomas-van-der-Valk"
                },
                {
                    "user_id": "Christian Westby",
                    "user_href": "/profile/Christian-Westby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Hunyadi",
                "href": "/profile/Stephen-Hunyadi"
            },
            "answer_text": "Considering the utter devastation of Germany by the end of the war and the fact that they agreed to an unconditional surrender, I would say very poorly. But one might say - under hindsight, of course - that going to war with limited resources set the Germans up to be poorly defended. How could one defend so much terrain with insufficient personnel and resources, against so many opponents in the form of sovereign nations and resistance movements, all coupled with military blunders on the parts of its allies? Hitler was successful until his failure to capture Moscow. The Reichswehr of WWII could be analogized as a knock-out-punch-style fighter, not the endurance fighter of the WWI Reichswehr. This shock and awe style of fighting, better known as Blitzkrieg, turned out not to be conducive toward defense. ",
            "date": "Answered November 13, 2016",
            "views": "370",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "John O'Connell",
                    "user_href": "/profile/John-OConnell-56"
                },
                {
                    "user_id": "Nanang Sugianto",
                    "user_href": "/profile/Nanang-Sugianto-14"
                },
                {
                    "user_id": "Alex Zelinsky",
                    "user_href": "/profile/Alex-Zelinsky-4"
                },
                {
                    "user_id": "Fred Makiling",
                    "user_href": "/profile/Fred-Makiling"
                },
                {
                    "user_id": "Michael Zheng",
                    "user_href": "/profile/Michael-Zheng-52"
                }
            ]
        }
    ]
}