{
    "title": "How will they use chloroquine as a way to address the corona virus? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Dean Gold",
                "href": "/profile/Dean-Gold-1"
            },
            "answer_text": "Right now it is being used in trials. The NIH, CDC, FDA, and many health agencies internationally have all come out against the use of it. As you see today, Remsdesivir showed effective in the early trials so its use is being approved by the FDA any day now. Chloroquine has been in use longer and there has been no such announcement and many trials have been stopped due to bad outcomes. The current recommendation is to only use chloroquine in hospitals under the direct supervision and no other way. Unfortunately, with our system of medicine regulation, a doctor can prescribe it “off label” and give it to a patient. it is to be hoped in light of all the warnings and contraindications on Chloroquine that it is not being used outside of hospitals. Chloroquine will probably turn out to NOT be a way to address COVID-19. ",
            "date": "Answered April 29, 2020",
            "views": "135",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "E. G. Moye",
                    "user_href": "/profile/E-G-Moye"
                },
                {
                    "user_id": "Jesse Raffield",
                    "user_href": "/profile/Jesse-Raffield-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David McKay",
                "href": "/profile/David-McKay-26"
            },
            "answer_text": "There is so much conflicting information flying around, (including health professionals trying to cover for ignorant buffoons who are their bosses!) that it is hard to say anything with much certainty. Nevertheless, as I understand it, almost from the start, chloroquine was considered a good place to start in fighting Covid19, not because it had been proven effective, but because it had some similarities to what they were roughly looking for. I think it had been used (again, somewhat ineffectively) for a previous corona virus, which gave them some hope. When there is nothing available, doctors often give just about anything even remotely hopeful, more or less as a placebo if nothing else. But in addition to that, the best hope anyone had of stopping the virus early was to find something that was (a)already cleared by health and drug authorities; and (b) available in large quantities at a reasonable price. Sometimes by combining a couple of different drugs used for other somewhat similar diseases, a researcher can fluke a solution (or partial solution). So everywhere, researchers started mixing cocktails, many of them containing chloroquine, which is quite cheap and widely available. That sort of research was happening almost everywhere, including China… but with little success, and even a couple of tests which indicated chloroquine was detrimental. So the search goes on. Someone may yet find a chloroquine plus solution, but most are looking elsewhere. ",
            "date": "Answered April 30, 2020",
            "views": "115",
            "upvotes": "0"
        }
    ]
}