{
    "title": "How to get into a top tier university from community college - Quora",
    "tags": [
        "Community College",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lulu Thurman",
                "href": "/profile/Lulu-Thurman"
            },
            "answer_text": "Top universities will consider your high school grades, college grades, your personality (through references and essays), if your transcript and extracurriculars reflect a passion and aptitude for your major field, occasionally your SAT/ACT scores, and most importantly why you chose to go to community college and why you want to transfer to their particular university. You have to craft an incredibly compelling argument that you are made to be a student on their campus, and a detailed and wise reason for going to community college, and then back that up with stellar performance in and out of the classroom. Most importantly, check if your community college has agreements with your dream school for what classes you need to take. If not, triple-check the university website for their required classes and take classes related to your intended major. You have to paint the picture that you are an incredibly talented student that they need as part of their campus community, and community college was just a healthy stepping stone on the way to their campus. ",
            "date": "Answered August 9, 2017",
            "views": "1",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alana Winner",
                    "user_href": "/profile/Alana-Winner-1"
                },
                {
                    "user_id": "Victor Van",
                    "user_href": "/profile/Victor-Van-13"
                },
                {
                    "user_id": "Timothy Howard",
                    "user_href": "/profile/Timothy-Howard-33"
                },
                {
                    "user_id": "Brett Elkins",
                    "user_href": "/profile/Brett-Elkins-1"
                },
                {
                    "user_id": "David Anderson",
                    "user_href": "/profile/David-Anderson-183"
                },
                {
                    "user_id": "Judy Stephens",
                    "user_href": "/profile/Judy-Stephens-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Stagliano",
                "href": "/profile/Tom-Stagliano"
            },
            "answer_text": "Apply In 2014 and 2015  94% of the accepted transfer students at UC Berkeley were from California Community colleges, and I believe 92% at UC San Diego. All of the state Public universities (including the Top Tier) are Meant to be there to accept transfer students from the state's community colleges. However, the elite Private universities accept very Few transfer students and the acceptance rate, across the board, is about half of the rate to be admitted as a freshman and the private universities want extracurricular activities from the CC and they want all of the high school info, as well. Stick to the Top Tier public universities in your state and you will have a much easier time transferring and it should be cost-effective for you, as well.   ",
            "date": "Answered March 9, 2016",
            "views": "11",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fau Zan",
                    "user_href": "/profile/Fau-Zan-7"
                },
                {
                    "user_id": "Alana Winner",
                    "user_href": "/profile/Alana-Winner-1"
                },
                {
                    "user_id": "Brett Elkins",
                    "user_href": "/profile/Brett-Elkins-1"
                },
                {
                    "user_id": "Jesus Lopez",
                    "user_href": "/profile/Jesus-Lopez-50"
                },
                {
                    "user_id": "Anne Hinkle",
                    "user_href": "/profile/Anne-Hinkle"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                }
            ]
        }
    ]
}