{
    "title": "How to control my anger - Quora",
    "tags": [
        "Self-management",
        "Anger",
        "Anger Management",
        "Self-Improvement Advice",
        "Self-Improvement",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terrell Cotton",
                "href": "/profile/Terrell-Cotton"
            },
            "answer_text": "I wrote an article about Anger and managing it.Hope this helps. The 5 Causes of Uncontrolled Anger and the 5 Ways You Can Manage it. Dictionary .com describes anger as a noun meaning “a strong feeling of displeasure and belligerence aroused by a wrong; wrath;” Anger is something we have all experienced in life, and personally, I can tell you many stories where my anger got the best of me. Times where I was let down by somebody I considered a friend or betrayed by a woman I was in a relationship with. Times where I felt I didn’t get a chance I deserved professionally, or when I let myself down by doing something stupid. Anger is a very strong emotion that, when left unchecked, can cause us to make decisions that can have lifelong consequences. Have you heard of Alexander the Great? He was a great military genius who by the age of 32 not only ruled Macedonia, but become the King of Persia, the Pharaoh of Egypt, and the King of Asia. We also know, however, that Alexander had an explosive temper. The information below is from livescience.com which describes how Alexander killed his best friend during a fit of rage. “A second casualty of Alexander’s was his old friend Cleitus, who was angry that Alexander was adopting the Persian dress and customs. After an episode where the two were drinking, Cleitus told his king off, telling him, in essence, that he should follow Macedonian ways, not those of the Persians who had opposed him. After the two got drunk, Cleitus lifted up his right hand and said,“this is the hand, Alexander, that saved you then (at the Battle of Granicus).” Alexander, infuriated, killed him with a spear or pike. Alexander took his act of murder terribly. “Again and again, he called himself, his friend’s murderer and went without food and drink for three days and completely neglected his person,”  The killing of Cleitus. By Andre Castaigne How many times have you done or said something in anger which you later regretted? What words or actions do you wish, you can take back? I know as a father, I personally have said and done things I regret. However, I have learned from my mistakes and evolved from the person I was, and I hope this article will help you see the dangers of anger. What Causes Anger? 1. Our Ego. \"Avoid having your ego so close to your position that when your position falls, your ego goes with it.\" Colin Powell For many men, our ego can cause us to make rash decisions. “I’m not going to let anyone punk me”, “I have to prove a man”, and other silly notions of a perceived sense of manliness has gotten a lot of us in trouble. Just like Alexander, how many of you get angry, allow their egos to go unchecked, and do something you regret? How many men are sitting in prison because they did something stupid because of their ego? I’ll be the first to raise my hand on how letting my anger, overwrite my common sense, get me in trouble because of my ego. It was early 2000’s I was working the typical call center job. I had applied for a supervisor position, thinking I was certain to get it. I also started dating a co-worker, and not knowing the difference between love and infatuation, I fell for her pretty fast. A few guys there wanted to get with her but she was with me so I had a chip on my shoulder. I later found out that I wasn’t the only guy she was with. Things quickly spiraled out of control. We had a very heated discussion that night over the phone and broke up. But knowing that I would have to see her at work the next day, I decided to make continue the conversation in public. Things got more heated. The other guy decides to call me on my cell (She gave him my number) and we exchange words while I’m sitting at my desk. Not wanting to look like a punk (here we go with the ego) I walk over and tell her “I will f**k him up and you too if you wanna keep playing with me.” Wrong move! I just threatened a co-worker in front of several other witnesses. My chances of getting that promotion were gone and my reputation took a hit as well. People started calling me “T-Murder” because of my temper and how I let anger get the better of me. 2. Having Unrealistic Expectations. Unfortunately, not everything goes as planned. We can seemingly have things planned perfectly, and all of a sudden, things go awry. You may have expected a larger raise at work, or a project you are working on can all of a sudden go horribly wrong. You may have gotten into an argument with your girlfriend or wife and thought buying her flowers will magically make things better, but didn’t, and now you have the angries. Things don’t always go as planned. We need to accept that and move on. As a father have you ever gotten angry with your children over something that really wasn’t a big deal? I can speak from experience on times I have something out of nothing. We have to remember that kids will be kids. They will do things that kids do. Why, being an adult, should we hold children to standards above their age, and get upset when they don’t meet them? I know parents that push their children to standards of perfection. They don’t allow their children to be children. Once again, it comes back to the ego. Our children are a reflection of us, and if they “fail” to meet some parent’s expectations of perfection, they get angry. Don’t set unrealistic expectations. 3. Poor Communication. Poor communication is a big problem in many relationships. When two people cannot communicate effectively, anger is sure to pop its ugly head up somewhere. Many times, poor communication goes hand and hand with ego. When someone is too bull headed to listen to anything the other person has to say. \"Bad human communication leaves us less room to grow.\" Rowan Williams I once had a girlfriend that thought I was upset with her because I too silent. I came home from work tired and wasn’t in a particularly chatty mood. She assumed I was upset and asked me why I was so angry? I told her I wasn’t, but she pushed back saying that I needed to open up. I wasn’t upset, but her pushing and not believing me started to make me angry and an argument ensued. If we knew how to communicate properly, things wouldn’t have gotten as far as they did. She knew from past experience that when I was upset, I was quiet. She took this as a sign of my current mood and misread it. If I would have opened up to her more when I was angry, instead of keeping it inside, our communication would have been better. 4. Making Yourself Angry. Are you a negative person or a complainer? Do you choose to become angry over things you really don’t need to be angry about? I know people that get extremely wound up over politics. Others have serious road rage when someone cuts them off and will carry that rage needlessly for hours. I know I was the type of individual that would consider the slightest perceived insult or sign of disrespect as a proclamation of war. I would carry a grudge for a long time while watching the offending party living their life without even the slightest feeling of what may have occurred. How about when someone does cut you off while driving. We assume that that the other driver is just a moron that doesn’t know how to drive. Maybe it was a guy with a pregnant wife who was about to have a baby. Maybe it was a mother who had a sick child they were rushing to the hospital. While there are people that are jerks and shouldn’t be driving, some people have a good reason why they are driving a little more reckless than normal. Don’t let it trouble you so much. Sometimes we need to give people the benefit of a doubt. \"Let all bitterness and wrath and anger and clamor and slander be put away from you, along with all malice.\"Ephesians 4:31 5. Purposely Making Others Angry. Spouse, children, girlfriends, close friends, I’m guessing you know what their hot buttons are. You know exactly what to do, or what to say, to make them upset. Anytime you use this knowledge, to purposely get a rise out of someone, to purposely make them upset, you are being childish, extremely unfair, and honestly less of a man. If you have nothing better to do with your time than to yank the chain of the people you care about, you need serious help. A few years ago I was going through a breakup. She expressed that she wanted to try and work things out, but I wasn’t hearing it. I knew this woman inside and out. I knew what buttons to press and what words to say to piss her off. I let my ego (There’s that word again) get the better of me. She had embarrassed me on social media, and I couldn’t let that pass. So I pushed those buttons as hard as I could and said those things as loud as possible. I hurt her real bad. I wasn’t a man, I was a coward. How many of you are cowards? How many of you would rather make others upset just because you are sick and enjoy it? Stop being a coward, and stop being a prick. What Happens When We Get Angry? 1. Anger Prevents Problem Solving. When we become angry, our ability to think logically and problem solve are greatly reduced. Anger completely shuts down an open mind. Have you been is the middle of discussing a problem or disagreement with your significant other, and things seem to be working themselves out. Then one of you said something that makes the other angry. The next thing you know the both of you are angry and all efforts of resolution cease. Talking leads to yelling, which leads to silence, which leads to no resolution. 2. Anger Can Be Habitual. \"Fools give full vent to their rage, but the wise bring calm in the end.\" Proverbs 29:11 Anger can become a default way of handling problems if repeated. If you habitually get angry when an issue comes up, anger will fast become the only way you handle them. Athletes practice to become better at their sport. My brother is a software engineer and he is always reading, researching, and perfecting his craft. It has been said often that “Practice makes perfect”. Practice can also make things become permanent. I took karate for over 6 years during my teenage years. Over twenty years later I can still throw a punch and a side kick without thinking of my form. The way you practice something will become the way to perform it until you consciously practice it a different way to change it. Anger is no different. If you establish a pattern of becoming easily angered at every small problem or disagreement, you will cause that behavior to become permanent. 3. The Truth Becomes Distorted. We tend to over exaggerate when we get angry. We say things like, “You’re always late!”, “You never listen to anything I have to say!”, or “You seriously can’t do anything right!” Anger distorts the truth. I was one to say ridiculous things such as this. When one of my boys would leave a dirty bowl in their room, I would be quick to say, “You never clean up after yourself.” While he is a messy kid, to say that he never cleans up after himself is a lie. It’s just me being frustrated. When I am in a conversation with someone and they use words like never or always, I say things like, “So you’re saying I NEVER listen to you?” I repeat these things back and the other person will normally correct their statement. If not, I’ll give examples to demonstrate how what they just said isn’t true. If you like to make such exaggerations when you are angry, do yourself a favor, take a minute, and think. Think about this when it comes to your children. You don’t realize how such exaggerations hurt them. If you are claiming they are ALWAYS doing something bad, they may start to believe it. Don’t do that to your kids. What To Do When You Get Angry. 1. Focus On Releasing It Positively. Some people will say you need to vent your anger, let it out. I agree with releasing your anger, but only in a positive way. I don’t recommend what I watch so many people do and verbally snap. That’s definitely not the correct way to release your anger. When I decide to release my anger, I’ll do things like go to the gym, play video games, anything but do something destructive physically or verbally. Go for a walk (Not a drive!), work in your yard, clean the house, do whatever you need to do to let it go. Don’t vent negatively. Doing so is a surefire way to damage relationships. \"Do not make friends with a hot-tempered person, do not associate with one easily angered,\" Proverbs 22:24 You can also find a person to talk to. I have a person that I trust to tell me the truth when I need to talk. They just won’t tell me what I want to hear because I’m their friend. For me, it’s my sister-in-law. If I’m wrong, she will tell me so. If I’m not wrong, she will still tell me to calm down and think. She’s a person I know I can call and she will keep me in check. Whatever you do, do not hold anger in. Holding anger is not only emotionally damaging, it’s physically unhealthy. Holding in anger causes stress. This stress causes things like headaches, depression, nausea, ulcers, and high blood pressure. Ask yourself if what you are angry about really worth all this? I would have to say no. 2. Prevent It From Happening. \"My dear brothers and sisters, take note of this: Everyone should be quick to listen, slow to speak and slow to become angry,\" James 1:19 Don’t let your anger backfire and blow up in your face. Prevent your anger by taking hold of it before the fuse is ignited. If you lose control and light the fuse, it’s only a matter of time before you explode and cause what could be irreparable damage to a relationship or worse as in the case of Alexander the Great. One way you can prevent anger is by realizing that some battles don’t need to be fought. In other words, why argue over things that are petty. I don’t argue over nonsense, politics, or my faith. Why bother arguing? Is arguing going to make the other person change their mind? I don’t think so either. I was once sitting in a Starbucks writing and a group of women were talking about politics and they supported views I didn’t. One of them asked me who I was voting for. I simply answered, “I don’t discuss politics.” I did this because I knew how easily that situation could have blown up. I decided to prevent it. I sometimes have guys that call me regarding their relationship issues. One guy called me upset because he said his soon to be ex-wife would use their son as a way to make him angry. He said that she knew what buttons to push to do so. I simply said, “If she knows what buttons to push, why are you continuously letting her push them?” Sometimes we allow people to make us upset. If he knew his ex-wife was going to come to him with nonsense, why let her make him angry? Shut it down by not giving her the time to do so. I guarantee if she saw that he was no longer becoming angry over her antics, those antics would cease. 3. Know That It’s OK To Be Angry. Anger in itself isn’t wrong or right. What counts is your response to that anger. Anger does need to be expressed, but as I mentioned above, it must be in a positive way. Don’t hold it in, don’t be verbally or physically abusive. It’s OK to feel angry. \"A person that’s praised is the one who is angry for the right reasons, with the right people and also in the right way and at the right time for the right length of time” Aristotle Anger can be positive when directed at something that is wrong. People get mad when at things such as social injustice, or when criminals prey upon and injure innocent people. I recently went to a seminar on how to recognize and report sex trafficking. It makes me very upset when I think of how girls as young as 11 are forced into sex slavery by pimps. It makes me just as upset that some varieties of popular music actually glorifies pimping. Jesus used his anger against the moneychangers in the temple to cleanse the temple of cheaters and thieves. He directed his righteous anger at a wrong. (Matthew 21:12-13) 4. Talk To Someone About Your Anger. As I said above, I have someone I can talk to when I’m upset. She knows me very well and can often get me to a level where I think clearly about the situation. Having someone who can look at the situation from the outside and will tell you the truth is good. If you are in a relationship, the person you need to speak to is whoever you are in a relationship with. It’s best to let them know immediately and not let it linger. If you are in a relationship where you cannot communicate such feelings with each other, I don’t need to tell you that your relationship needs help. \"Do not be quickly provoked in your spirit, for anger resides in the lap of fools.\" Ecclesiastes 7:9 If you are going to communicate your feelings of anger, do so in private. Don’t do it in front of other people, and definitely, don’t put it on social media. It drives me nuts when I see someone who is angry with someone else so they put them on blast on Facebook. What does that prove besides your incredibly high degree of insecurity? I’ve watched a couple argue on an open Facebook post. I’ve also seen people post a status in anger, directly addressing the other person and telling them off? This is a cowardly and childish approach. Grow up already. 5. Agree Not To Hurt Each Other And Ask For Help. I’ve read stories where couples actually make a contract stating that they will not hurt each other out of anger. They agree to not verbally, emotionally, or physically hurt each other. This is something I believe more couples need to do. As a father, I have written an oath that I will never hurt my children out of anger. I know how hurtful words can be, and I’ve brought it upon myself to make certain I never become the type of dad they regret. If your anger is truly out of control, it may be time to ask for help. Seek counseling, talk to your pastor, do something to get your anger in check before it becomes a habit or you do or say something you will later regret. Don’t let your ego stop you from doing this guys. There is no shame in asking for help. Conclusion I personally have done and said many stupid and harmful things out of anger. I also know what it’s like to hold onto anger, always been that person holding a grudge. Do yourself a favor and just let it go. Prevent it when you can, vent it positively if you must, and forgive those that hurt you. Life is too short to live it bitter and angry. ",
            "date": "Answered May 10, 2017",
            "views": "213",
            "upvotes": " View 224 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isaias Lopez",
                    "user_href": "/profile/Isaias-Lopez-3"
                },
                {
                    "user_id": "Ayush Syal",
                    "user_href": "/profile/Ayush-Syal-2"
                },
                {
                    "user_id": "TheCrawfishGamer",
                    "user_href": "/profile/TheCrawfishGamer"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/J-M-4342"
                },
                {
                    "user_id": "Box In",
                    "user_href": "/profile/Box-In-1"
                },
                {
                    "user_id": "Hana Seom",
                    "user_href": "/profile/Hana-Seom"
                },
                {
                    "user_id": "Florian Röske",
                    "user_href": "/profile/Florian-Röske"
                },
                {
                    "user_id": "Glorian Reyes",
                    "user_href": "/profile/Glorian-Reyes"
                },
                {
                    "user_id": "Sunil Badatya",
                    "user_href": "/profile/Sunil-Badatya"
                },
                {
                    "user_id": "Rajesh",
                    "user_href": "/profile/Rajesh-1325"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kartik Rao",
                "href": "/profile/Kartik-Rao-12"
            },
            "answer_text": "Folks love to give advice, it’s free after all, that too on an emotion like anger… I have only some suggestions to offer, with the aim of helping one “understand anger” Anger is not Bad. Anger is Natural. As it is a natural emotion, express it… Anger is certainly NOT bad. Anyone who tells you that anger is bad is doing more harm than good. They haven’t understood anger one bit or perhaps it works only for them…It needn’t work for others!! For example, Some idiot jumps right in front of your vehicle or commits some form of hara-kiri… or your idiotic boss calls you to chip in for the weekend…Anger arises..but natural isn’t it… What is most important though is what do you do with the anger? Do you continue doing what you have been doing so far? or can you break the pattern creatively… Say someone receives a good round of firing from his boss…He is deeply hurt and angry…He is boiling within yet swallows his anger silently. He reaches home and the pent-up anger erupts on his wife…Any excuse would do…the dish not being tasty enough…The wife coincidentally would have had a harrowing time and she returns the gunfire!! WHAM, BOOM…Listening to the fireworks the child walks in and he too is exposed to the ugly crossfire… The underlying point is this… You pour your anger onto someone…The other is likely to be even more psyched up than you and even worse complications arise unless the other is a Buddha…the probability of which is a rarity. Creativity is an extremely crucial and useful value to develop in today’s world and so is authenticity… You are angry, you want to express it which is natural, but not on the immediate near and dear ones, for you are probably well aware of the consequences that pile up… Some pointers Dance away to rhythm music… Let your body loosen itself gradually to the rhythm and dance… Shout out loud…Scream out loud… Go Mad completely in this duration…Don’t bother about steps…permit your body to go completely wild…and release the energy If dancing is not your cup of tea, shouting and screaming can be it…Switch off the lights, and shout…clench your fists, punch the pillow all you like…release the energy… Get a boxing bag and punch away to glory or if jogging is your cup of tea…go for a long jog… Some folks go and smoke to feel better, but harming yourself is as bad as harming the other… Ditto for alcoholism… Once habituated, lifestyles, pressure, and tension can always be blamed, can’t they?? Anger is simply a pent-up emotion and you need to express it creatively…not destructively… Develop any such technique that works for you and does not involve others(others also are carrying anger in them like you are!!) and do that activity to start off daily… Make this activity your prayer… No other prayer is required. Understanding your emotions fully is prayer enough… The best way to remain sane is to go “MAD” for a small chunk of time daily. Nothing wrong in it…Rather it is absolutely the wisest and most authentic thing to do… Do it alone …Give it a try… Cheers Karthik worldofwellness.me ",
            "date": "Answered October 31, 2018",
            "views": "121",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "VallalArasu Pandiyan",
                    "user_href": "/profile/VallalArasu-Pandiyan"
                },
                {
                    "user_id": "Tejasree Reddy",
                    "user_href": "/profile/Tejasree-Reddy-12"
                }
            ]
        }
    ]
}