{
    "title": "How is the Chinese mobile phone? - Quora",
    "tags": [
        "Chinese Mobile Phone",
        "Mobile Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Max Irwin",
                "href": "/profile/Max-Irwin-2"
            },
            "answer_text": "Well, I would recommend a chinese smartphone brand called Huawei. This tech giant makes great phones. The one I am using from them is the Huawei honor 6x. For $150 it's an amazing phone! Here are a few pros and cons: Pros: 5.5 inch LCD display8 megapixel front facing cameraA rear facing dual camera setup of a 12 megapixel camera and a 2 megapixel camera (will post a pic of a picture taken by this dual camera setup)3 Gigs of RAM (just as much as the new iPhone x)3,340 mAh battery capacity,to GREATERY, it has ALWAYS lasted me 24 hrs or more, NEVER LESS THAN THAT.Headphone jack with a speaker, microphone, and sterio speaker ( ear speaker)A lightning fast fingerprint sensorGreat software, Android 7.0 Nougat (EMUI 5)Multitasking feature (goes with software )Great speed and smooth performance; Also great with multiple apps running in the backgroundCons: No EIS (Electrical Image Stabilization) or OIS (Optical Image Stabilization)The screen is not very scratch resistant so don't put keys or sharp objects with the phone in the same pocketIt's not an OLED or AMOLED display, colors are a bit washed out.Single tone flasher, so it won't be as brightDoesn't support wireless chargingHeres that dual camera photo sample I said I was going to post:  Here's the original:  If you have any questions about smartphones reply to my comment and I can probably help you out. ",
            "date": "Answered February 2, 2018",
            "views": "66",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "G Lock",
                    "user_href": "/profile/G-Lock-1"
                },
                {
                    "user_id": "Ka Bi",
                    "user_href": "/profile/Ka-Bi-2"
                },
                {
                    "user_id": "Liang Tao",
                    "user_href": "/profile/Liang-Tao-17"
                },
                {
                    "user_id": "Ariel Kusnoto",
                    "user_href": "/profile/Ariel-Kusnoto-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Surya-raj-Joshi"
                },
                {
                    "user_id": "Ram Kumar",
                    "user_href": "/profile/Ram-Kumar-32"
                },
                {
                    "user_id": "Dong Luo",
                    "user_href": "/profile/Dong-Luo-5"
                },
                {
                    "user_id": "Jonathan Martinez",
                    "user_href": "/profile/Jonathan-Martinez-261"
                },
                {
                    "user_id": "Nite Luo",
                    "user_href": "/profile/Nite-Luo"
                },
                {
                    "user_id": "Ritish Timalsina",
                    "user_href": "/profile/Ritish-Timalsina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Santos",
                "href": "/profile/Matthew-Santos-12"
            },
            "answer_text": "Some of them, yes! The thing about Chinese brands is that most are often overlooked for being made cheaply by unknown and untrustworthy companies. Though there is fact in that, there are plenty of companies that are lesser known and cheap, but still offer a solid smartphone experience. Chinese brands usually have trouble entering US markets because bigger brands like Apple and Samsung already having a hard hold. There are some chinese companies that break this rule, the best examples; Huawei, Xaiomi, and OnePlus. If you follow tech tubers like Marques Brownlee and MrWhoseTheBoss, these companies are quite high quality. Huawei is the largest telecommunications manufacturer in the world. They make solid phones, too.  Xaio Mi is also an excellent manufacturer; they have the phone with the highest screen to body ratio with the Mix.  The real sleeping giant here is OnePlus. OnePlus doesn’t sell their products in stores; they only take orders exclusively online, which allows them to cut the costs of a middle man and deliver directly to the consumer for cheaper prices. OnePlus also does one thing unique; it cares greatly about consumer input. The first phone they designed, the One plus One, was designed exclusively by what fans and buyers posted on their forums. Today, their forums are still operating strong, and their latest phone, the OnePlus 5, offers flagship specs and 0–60 charging in half an hour, all for 500 dollars.  Another smartphone I'd put trust in is the Elephone S8, it sounds like a knockoff but it's actually quite a solid phone.  I'd say stay away from Dougee. They're the prime example of how Chinese brands are associated with untrustworthy phones. The “dual camera” set up on one of their phones weren't even real; it was marketted as authentic, but in reality you could cover one lense up with your finger and the camera would work exactly the same. Hope that helps! ",
            "date": "Answered February 3, 2018",
            "views": "18",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asif Siddiqui",
                    "user_href": "/profile/Asif-Siddiqui-38"
                },
                {
                    "user_id": "Ritish Timalsina",
                    "user_href": "/profile/Ritish-Timalsina"
                },
                {
                    "user_id": "Nguyen Tran Tuyen",
                    "user_href": "/profile/Nguyen-Tran-Tuyen"
                },
                {
                    "user_id": "Kimiaie Sadat",
                    "user_href": "/profile/Kimiaie-Sadat"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/an-414"
                },
                {
                    "user_id": "Soumyadeep Bhunia",
                    "user_href": "/profile/Soumyadeep-Bhunia-2"
                },
                {
                    "user_id": "Shaan Mutreja",
                    "user_href": "/profile/Shaan-Mutreja"
                }
            ]
        }
    ]
}