{
    "title": "How much salary do call centres give? - Quora",
    "tags": [
        "Call Centers",
        "Salaries for Specific Jobs and Careers",
        "Salaries and Wages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neha Gupta",
                "href": "/profile/Neha-Gupta-998"
            },
            "answer_text": "A Call Center and Customer Service Executive earns an average salary of Rs 189,943 per year. People in this job generally don't have more than 10 years' experience. Experience strongly influences income for this job. The highest paying skills associated with this job are Customer Relationship Management (CRM) and Oral / Verbal Communication. Assistant Manager, Customer Service Salary (India) The average pay for an Assistant Manager, Customer Service is Rs 475,417 per year. Most people with this job move on to other positions after 20 years in this field. Operations Manager Salary (India) An Operations Manager earns an average salary of Rs 715,975 per year. Pay for this job rises steadily for more experienced workers, but goes down noticeably for employees with more than 20 years' experience. People in this job generally don't have more than 20 years' experience Team Leader, General Salary (India) The average pay for a Team Leader, General is Rs 513,918 per year. The highest paying skills associated with this job are Engineering Design and Project Management. Experience strongly influences income for this job. Most people move on to other jobs if they have more than 20 years' experience in this field. Call Center Representative Salary (United States) An average Call Center Representative in the United States can expect to take home roughly $12.43 per hour. Overall incomes of Call Center Representatives — including $3K bonuses, $4K profit sharing proceeds, and $10K commissions on the more lucrative end — generally ranges between $20K and $38K. The most important factor affecting compensation for this group is the particular firm, followed by geography and years of experience. Female Call Center Representatives make up most of the survey respondents at 73 percent. Most workers in this position report high levels of job satisfaction. Unfortunately, some people in this line of work are without benefits — approximately one in four lack coverage. Human Resources (HR) Manager Salary (India) A Human Resources (HR) Manager earns an average salary of Rs 600,898 per year. Most people move on to other jobs if they have more than 20 years' experience in this career. Pay for this job rises steadily for more experienced workers, but goes down noticeably for employees with more than 20 years' experience. Senior Customer Service Representative (CSR) Salary (India) A Senior Customer Service Representative (CSR) earns an average salary of Rs 276,959 per year. Experience has a moderate effect on pay for this job. A skill in Team Management is associated with high pay for this job. Most people with this job move on to other positions after 10 years in this career. Source: Call Center Salaries ",
            "date": "Answered August 20, 2016",
            "views": "233",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pallavi Kar",
                    "user_href": "/profile/Pallavi-Kar-13"
                },
                {
                    "user_id": "K Amithraj",
                    "user_href": "/profile/K-Amithraj"
                },
                {
                    "user_id": "Ravi J",
                    "user_href": "/profile/Ravi-J-13"
                },
                {
                    "user_id": "Fusion Inc",
                    "user_href": "/profile/Fusion-Inc-1"
                },
                {
                    "user_id": "Ranjeet Sharma",
                    "user_href": "/profile/Ranjeet-Sharma-14"
                },
                {
                    "user_id": "Raviteja Sadu",
                    "user_href": "/profile/Raviteja-Sadu-1"
                },
                {
                    "user_id": "Saurabh Singh",
                    "user_href": "/profile/Saurabh-Singh-857"
                },
                {
                    "user_id": "Sameet Pattnaik",
                    "user_href": "/profile/Sameet-Pattnaik-1"
                },
                {
                    "user_id": "Shaik Rushi",
                    "user_href": "/profile/Shaik-Rushi"
                },
                {
                    "user_id": "Krishna",
                    "user_href": "/profile/Krishna-945"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prasant Das",
                "href": "/profile/Prasant-Das-12"
            },
            "answer_text": "This is a question which may have 2 answers. I will try to answer both a bit and leave it on you to decide. A call center as a business will earn from the process which it works on. It can be an in-house or in sourced. There are several factors which play a role in deciding the payment amount of a call center. There are several KRA or you can say certain benchmarks for measuring performance when it’s a outsourced process. For example : if it’s a customer care ,then ideally performance is ranked by customer satisfaction score. And the CallCenter is paid by the Client on the basis of customer satisfaction. Basically this becomes a regular cycle. Customer is happy with customer service (CallCenter) and he/she continues paying for the goods or services to the Client and for this good work the CallCenter gets paid by the Client. On the other hand I run an in house sales process. There are benchmarks or targets we have to Meet to carry on the business.So I get paid directly by customers or end users. I hope I have answered your question with some personal examples or experiences which may help. ",
            "date": "Answered July 27, 2018",
            "views": "36",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pallavi Kar",
                    "user_href": "/profile/Pallavi-Kar-13"
                }
            ]
        }
    ]
}