{
    "title": "How did Asian Paints become India's largest paint company? - Quora",
    "tags": [
        "Asian Paints",
        "Supply Chain Management",
        "Companies in India",
        "Paint",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rivin Sainudeen",
                "href": "/profile/Rivin-Sainudeen"
            },
            "answer_text": "Farmers across Maharashtra, Chhattisgarh and Telangana celebrate a rather unique festival in honour of the bulls that help till their land. They decorate their bulls with ornaments and silk, paint their horns and put up a very colourful spread of bovines. However back in the old days, painting a bull’s horn in bright colours and procuring them in such small quantities proved to be a particularly difficult challenge. This is when Champaklal Choksey, a budding entrepreneur found both a need gap and an interesting opportunity to expand his business. What began as a dream soon gave way to unbridled ambition culminating in the company becoming the largest paint manufacturer in the country. Started as “Asian oil and Paints company” by Champaklal Choksey, Chimanlal Choksey, Suryakant Dani and Arvind Vakil, Asian paints Ltd is ranked today at No 10 among the top Decorative Coatings Companies in the World. Asian Paints and its subsidiaries has operations in 22 countries across the world and 27 paint manufacturing facilities, servicing consumers in 65 countries.  Now 2 questions arise, How a paint company could do this over a span of 50+ years?How are they constantly outperforming their peers?Well, here’s a story of an entrepreneur and his company that was too innovative for its time, even by global standards. Champaklal Choksey did a brilliant move by removing the distributor and the wholesalers as they were taking off 20% of the margins of the company. They simply kept retail dealers and to whom they had to transport the paints. For dealers, this was a tough task to hold such a big inventory. They requested Mr. Choksey to look into this. Choksey made a genius move. He said that our truck would come every 3 hours and replenish the stock. So that was like 4 times a day and 28 times a week. And this was back in the 70s when ease of doing business was difficult. And they had 40,000 such dealers which totalled to 1.6 lakh times a day. Today, the figure is as high as 3 lakh times a day. Innovating the supply chain has played a very important role in the company’s growth. This was an hugely impactful stroke, since when you talk about the margins, 97% of the MRP goes to the manufacturer and 3% goes to the dealer in Asian Paints. In other cases, manufacturers get 60% of the MRP, 30% the distributors and wholesalers, and the rest the dealers. Asian Paints is a master at this game. It has a cash conversion cycle of a mere 6 days i.e. it only takes the company 6 days to recoup its investment in inventory and other resources through sales and generate cash in the process.  How was this made possible? Asian Paints, at a very early stage of its growth, recognized the importance of Information Technology & Data, and how it could use the technology to its advantage. Champaklal Choksey bought the first-ever mainframe computer in India in 1970 for 8 crore rupees(CDC 6600 is regarded as the first successful supercomputer in the world). This was 10 years before ISRO & IITB adopted it and 21 years before any other company. Even an SAP consultant testified that the best ERP implementation was not by Amazon or any other Western/Chinese corporation, but it’s India’s Asian Paints Ltd.  For a span of 50 years, Asian Paints Ltd has collected data on: What colour is being sold the most?What quantity is being sold?And what tin size is being sold the most?The use of computers provided an automated way of generating details of dispatches to the depots. AP also invested in branch computerization which helped zonal distribution centres to get daily stock position levels. This information was tracked and analysed to determine the performance of the dealers, thus helping forecast sales, take corrective actions in case of low sales and incentivize the high performing dealers. Also, around 1994, Asian Paints installed terminals which connected factories to depots and helped in accounting and planning procedures. Through intensive application of machine learning & predictive analytics, Asian paints has been able to forecast demand with >90% accuracy. Ensuring the right product at the right time being made available in a semi-unpredictable environment. This helped them bring down inventory stock costs and working capital costs by minimizing supply chain inefficiencies. Machine learning applies complex mathematical algorithms to automatically recognize patterns, capture demand signals and spot complicated relationships in large datasets. These capabilities enable ML-based software to produce more accurate and reliable forecasts in complex scenarios. Asian Paints was also one of the first paint companies to use Supply Chain Management (SCM) and Enterprise Resource Planning (ERP) software for streamlining and automating its processes. It selected the SCM solution offered by i2 Technologies and later also started using SAP’s ERP solution, much before other companies adopted similar solutions. This helped the company to connect to all their vendors and suppliers. Data and analytics were always at the core of the company’s operations. It starts with a good forecasting engine which tries to predict the demand and all the next generation algorithms but slowly usage of data and analytics is populating right up to the shop floor. The paint manufacturer looks at technology as an enabler for reimagining the current value chain which includes customer experience, dealers, logistics and distribution, manufacturing & distribution, and product development & research Today, Asian Paints also uses connected IoT and visibility systems so that a complete tracking and tracing could be done right from when the products leave the factories and lands at the dealers’ shops. The company serves over 65,000 dealers directly from its depots. In tier 1 cities, the company also offers day zero promise for the dealers which means if an order is placed around 11 AM, the products will be delivered the same day. It is estimated that these initiatives gave AP an estimated savings of INR 100 million, 25% of which came due to reduction in finished goods inventory. Rama Bijapurkar, one of India’s most respected thought-leader in market strategy notes- “Asian paints is obsessed about hiring the best people, about having the best IT and the smartest technology-driven process.” It started hiring IIM graduates back in 1969 and had mainframe computers in the 70's to forecast demand. It installed automated warehousing systems (robots stacking up shelves & loading trucks) in 2008 and uses GPS on its vehicles to optimise its supply chain- all pointing to a culture of innovation and an insatiable desire to grow. In yet another winning move Asian Paints raises salaries, among other assistance to ensure that its employees remain motivated and find hope to cling onto during these dark times. Not only this, but they also plan to make things easier for the sales channel by offering an assistance package that includes insurance and hospitalisation, direct cash support and complete disinfection and sanitisation facilities to its partner stores. Asian Paints felt that this wasn't enough to help a situation as grave as the pandemic, they also deposited INR 40 crores to the accounts of their contractors. References :- Asian Paints - Leading the wayCompetitions, Quizzes, Hackathons, Scholarships and Internships for Students and CorporatesComputational and Information Systems Laboratory Asian Paints: A case study, Why is Asian Paints Ltd Such a Huge Money Making Machine? ",
            "date": "Updated October 26, 2020",
            "views": "11",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sagar Nagpal",
                    "user_href": "/profile/Sagar-Nagpal-10"
                },
                {
                    "user_id": "Debnarayan Bhattacharya",
                    "user_href": "/profile/Debnarayan-Bhattacharya"
                },
                {
                    "user_id": "Gopi Nath",
                    "user_href": "/profile/Gopi-Nath-4"
                },
                {
                    "user_id": "Prakhar Pandey",
                    "user_href": "/profile/Prakhar-Pandey-15"
                },
                {
                    "user_id": "Shalabh Kulshreshtha",
                    "user_href": "/profile/Shalabh-Kulshreshtha-2"
                },
                {
                    "user_id": "Ganesh M",
                    "user_href": "/profile/Ganesh-M-193"
                },
                {
                    "user_id": "Ritesh Kumar",
                    "user_href": "/profile/Ritesh-Kumar-3175"
                }
            ]
        }
    ]
}