{
    "title": "How long do video game consoles last? - Quora",
    "tags": [
        "Nintendo Wii (video game console)",
        "Console Games",
        "PlayStation (video game console)",
        "Xbox (console series)",
        "Video Game Industry",
        "Video Game Consoles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Montez Bond",
                "href": "/profile/Montez-Bond"
            },
            "answer_text": "That depends on lots of things. Quality of the product, amount of time the item is used and the general upkeep of the item. The worst system I ever had as far as lifespan goes was the very fun, but difficult to get going Nintendo NES. I loved it, but it you didn’t almost pass out from manually blowing in the cartridge before inserting it , pushing it down before hitting the power button then you might not get to play whatever game was calling you. On the other hand I never had that problem with any other console and I have almost all of my systems in storage in pristine working condition. That group includes Sega Dreamcast, Super Nintendo, Nintendo 64, Nintendo Wii and a GameCube, PS1, 2 (3 & 4 I’m still using) a Sony PSP and a Nintendo 3DXL Sony like everyone else has their quirks, but they still start like I just bought them and although they’re not perfect, you get less chances of the RLOD than messing around with an XBox So I’ll probably always be a Sony guy. IF YOU LIKED MY ANSWER OR LEARNED SOMETHING THEN PLEASE UPVOTE IT ",
            "date": "Answered July 21, 2019",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Cadwallader",
                    "user_href": "/profile/Joseph-Cadwallader-1"
                },
                {
                    "user_id": "Ian Irving",
                    "user_href": "/profile/Ian-Irving-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Stormcastle",
                "href": "/profile/Aaron-Stormcastle"
            },
            "answer_text": "Ideally, if you take care of the machine - and aren’t the idiot who owned this poor Xbox One before it died…  …a game console should last you a very long time - mostly likely exactly as long as you need it to keep working That being said, game consoles are mass manufactured in Taiwanese factories by the millions - and while Quality Control tries its best to weed out the faulty machines, sometimes the defective machines make it on to store shelves Most often, the defects in these machines are gradual… only showing up after a certain amount of time, which would not register during the brief testing done at the factory Generally speaking, if a machine is going to fail due to manufacturing problems, it will do so within the warranty period you get when buying the thing - so if your console has lasted longer than the warranty, it’ll probably keep going for as long as you own it ",
            "date": "Answered November 23, 2019",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Joel Sundstrom",
                    "user_href": "/profile/Joel-Sundstrom-1"
                }
            ]
        }
    ]
}