{
    "title": "How does the medical digital imaging system work? - Quora",
    "tags": [
        "Digitalis Medical",
        "Imaging Science",
        "Medical Image Processing",
        "Medical Technology",
        "Medical Imaging",
        "Medical Research",
        "Computer Vision",
        "Image Processing",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "KBV Research",
                "href": "/profile/KBV-Research-1"
            },
            "answer_text": "Medical Digital Imaging System: what is it? Before knowing about the Medical Digital Imaging System, we first need to understand what medical imaging is. It is a technique that is capable of generating visual illustrations of internal body parts that are further used for medical intervention and clinical diagnosis. It produces images without any invasion in the body.  Medical Digital Imaging Systems are nothing different from medical imaging. It is in fact a type of imaging system in which the images produced by the use of fast processors and through the conversion of energies arithmetically into logical signals. These signals are then converted into digital images. Types of medical digital imaging The major types of digital imaging that are used in the healthcare sector include ultrasound, radiography, MRI, and nuclear medicines. Radiography In radiography, electromagnetic radiation is used to capture the images of the internal organs. The most common example of radiography is X-ray in which a beam of high energy waves is radiated on the body. Soft tissue doesn’t absorb this beam of the wave but hard tissue does. The results obtained are transferred to X-ray films. Ultrasound It uses high-frequency sound waves that are responsible for reflecting off the tissues resulting in the formation of images of internal organs, muscles, and joints. The light enters the body through the skin and the image of the internal body parts is viewed with the help of electronic sensors attached to the device. Nuclear medicines It is the general term that is used for the medicines that use radioactive materials. These radioactive drugs that are either the swallowed or injected that travel through the body. The radiation that is produced is then detected to form an image. Magnetic resonance imaging In MRI, radio waves couples with magnetic fields are used to view the organs of the body. MRI scanner is used for this procedure which a large donut-shaped machine that creates powerful magnetic fields that are able to align the protons in the body. ",
            "date": "Answered October 22, 2020",
            "views": "47",
            "upvotes": " View Sharers"
        }
    ]
}