{
    "title": "How to find out what information about me is in the internet - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Marie Davis",
                "href": "/profile/Marie-Davis-42"
            },
            "answer_text": "Googling yourself is a good starting point, and an easy response! But let me tell you how I'd approach learning about you, as a family history nut. I start by Googling your name. Your name is the critical starting point, but every piece of data attached to it (age, birthdate, gender, email address, phone number) helps a researcher refine their search to learn more about you. Depending on your circumstances, your name may appear on your employer's website (past or present), on websites run by volunteer organizations you're involved with, schools you've attended, online newspapers and social media, among many others. Social media is the genealogist’s old mine! Facebook is filled with people who offer enough information about past schools, work, locations -- as well as familial relationship -- to confirm if your public pictures and posts belong to the person I'm seeking. LinkedIn is another place I'd go looking. If I know your name and schooling or previous employers, I may be able to track you down. (An employer may take a different path: starting on LinkedIn to see what you look like, then searching for you on other social platforms, looking to see what they can learn about you before you interview. I've done that, too.) I also frequently search for obituaries of close family members; I often find first-name references to family that I can identify by their relationship to the deceased. Googling your name will find your name mentioned on publicly accessible websites but may not find other available information, such as friends-locked social media accounts, images where you appear (though your name is not attached to them), videos, subscription/paid sites (like Ancestry, news archives) and the like. Those sites can offer up previous addresses, census data, confirmation of military service, etc. But if I've paid for a subscription, that information is an open book to me. And even if you didn't sign up on a geneology site, there's an increasingly good chance that one of your relatives has, meaning they've done all of the legwork for me! That's an important point to consider: even if you've maintained tight data security, you can't be sure that your cousin, your boss, your friends have done the same! If you are online, then a diligent researcher can find information about you. ",
            "date": "Answered January 10, 2020",
            "views": "700",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Thomas",
                "href": "/profile/Robert-Thomas-329"
            },
            "answer_text": "Goggle you’re name there will be more than one so you need to click on one and see if it is you if not move on to the next one. You could also use people finders or BeenVerified to get all the information you will have to pay a small fee ",
            "date": "Answered December 28, 2017",
            "views": "357",
            "upvotes": "0"
        }
    ]
}