{
    "title": "How can technology help in rural educations? - Quora",
    "tags": [
        "Rural Development",
        "Rural Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kedar Kulkarni",
                "href": "/profile/Kedar-Kulkarni-58"
            },
            "answer_text": "In India illiteracy is one of the biggest problems. Lack of easy access, lack of teachers, lack of interest, poverty, gender differentiation, lack of infrastructure are few of the reasons which are holding back the progress in rural education. But with the use of technology rural education can be given and hence the situation can be changed. To reach rural areas, first of all study material can be distributed to the students then online interaction and online videos can be made with teachers.By using technology the problem of unqualified teachers can also be solved , because Teachers play a key role in the education and also student’s life. A non-profit organization, Azim Premji Foundation run by Wipro group has been working towards this issue since 2001. It is helping 2 million children in 16,000 schools from 14 state governments. For students in rural areas computer is a very exciting machine. This will give positive results. Dropout rates will be reduced to a great extent through computer education. Advantages: Technology attracts the rural students.Their wish to attend school increases with the word computer.Even parents show more willingness in this case.Computer education builds up the required confidence and narrows down the gap between urban and rural education.Qualified teachers can be hired instead of unqualified.So rural India needs great investment in this section. :) “Technology is a tool. In terms of getting the students working together and motivating them, the teacher is most important.” ~ Bill Gates ",
            "date": "Answered March 14, 2017",
            "views": "937",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "A ABHIVARDHAN REDDY",
                    "user_href": "/profile/A-ABHIVARDHAN-REDDY"
                },
                {
                    "user_id": "Hemant Wankhede",
                    "user_href": "/profile/Hemant-Wankhede"
                },
                {
                    "user_id": "Iswarya Mogalapalli",
                    "user_href": "/profile/Iswarya-Mogalapalli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harsh Sharma",
                "href": "/profile/Harsh-Sharma-741"
            },
            "answer_text": "Computerization of factories and small firms.. And people should called for interview in the behalf of who has pass +2, graduation. ",
            "date": "Answered March 14, 2017",
            "views": "90",
            "upvotes": "0"
        }
    ]
}