{
    "title": "How to study at home without having to go to college or university - Quora",
    "tags": [
        "College Studying Advice",
        "College Advice for Careers",
        "How-to Question",
        "Studying",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pat Harkin",
                "href": "/profile/Pat-Harkin"
            },
            "answer_text": "Your public library will have access to all the textbooks you'll need, though you'll find it hard to know exactly what to study, and virtually impossible to judge how well you understand the concepts. It's isn't impossible to study alone, but it is much harder. There are many on-line or correspondence based courses but do be aware that quality can be very variable. Does your local colleg offer part-time or evening classes? ",
            "date": "Answered July 17, 2015",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "windphoenix",
                    "user_href": "/profile/windphoenix-1"
                },
                {
                    "user_id": "Nagesh",
                    "user_href": "/profile/Nagesh-119"
                },
                {
                    "user_id": "Cristen Tyndale",
                    "user_href": "/profile/Cristen-Tyndale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian McDonald",
                "href": "/profile/Ian-McDonald-23"
            },
            "answer_text": "U.K. Open University. However you might on some courses get a one week summer school and some units have evening weekly tutorials. Tutorials are very helpful and you should go to get help. However they are not compulsory. The summer schools are extreamly helpful and you really should go because of that. However while summer schools are compulsory, it is possible to get let off if you have a good reason. ",
            "date": "Answered October 30, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Kaigi",
                    "user_href": "/profile/John-Kaigi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lorenzo Ashton",
                "href": "/profile/Lorenzo-Ashton"
            },
            "answer_text": "Take online classes through your university or take MOOCs. Personally, I prefer the latter if you can find a good program that gives you hands on experience. ",
            "date": "Answered August 11, 2020",
            "views": "81",
            "upvotes": "0"
        }
    ]
}