{
    "title": "How will Tesla be the first to offer full self-driving? - Quora",
    "tags": [
        "Tesla Autopilot",
        "Self-Driving Cars",
        "Waymo Self-Driving Cars",
        "Autonomous Driving",
        "Electric Cars",
        "Tesla (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aleksey Matiychenko",
                "href": "/profile/Aleksey-Matiychenko-1"
            },
            "answer_text": "Other car companies may have good technology but they don’t have something more important. Machine learning technology that autonomous driving needs relieas heavily on data. The data is the hardest thing to obtain. It includes different driving scenarios, multiple road conditions , multiple street types, etc. Tesla has been collecting this data for years through the fleet of their cars. Tesla is the most connected car there is. And thousands of drivers have been passivly contributing to Tesla’s data collection. It accelerated when Tesla released first version of the auto-pilot. Tesla has also been smart about making partial releases: enhanced cruise controlauto-pilot.auto-steeringnavigate on auto-pilotFirst version of Summon allowed the car to move back and forward. The next one (coming out “soon”) will allow the car to pick you up at a parking lot. Gradual improvements couple with thousands of beta testers is why Tesla will suceed in FSD first. ",
            "date": "Answered September 10, 2019",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Sutter",
                "href": "/profile/Paul-Sutter-9"
            },
            "answer_text": "Though Tesla I'm sure is developing and testing autonomous systems, it looks more likely that Mercedes will lead the European introduction of self-driving cars. M-B has already released some details whereas other mfgr's are keeping things under wraps. Look forward to more Mercedes press releases about the AIrcon, ElAIna, and R3 prototypes. They've mentioned these models have level 3 autonomy and MB wants to offer level 5 fully self operation when legislation is passed. Give it 6 years or so for Europe to see the first models available to the public. Much longer in the U.S. because laws and regulation are horribly slow to change. ",
            "date": "Answered September 6, 2019",
            "views": "32",
            "upvotes": "0"
        }
    ]
}