{
    "title": "How to become more tech savvy - Quora",
    "tags": [
        "Technology Entrepreneurship",
        "How-to Become Question",
        "Technology Companies",
        "Technology Trends",
        "Entrepreneur Advice",
        "Startup Founders and Entrepreneurs",
        "Entrepreneurship",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Misha Yurchenko",
                "href": "/profile/Misha-Yurchenko-ユルチェンコ-ミーシャ"
            },
            "answer_text": "Build stuff.  No, not houses. More like apps, programs, websites. Whatever it is that you’re interested in. Start small. Unless you have some solid programming skills you might ask how am I supposed to do that? Well, you don’t have to build it all by yourself. Simply the act of starting and putting ideas into actions will force you to at the minimum figure out the basics. You’ll be forced to figure out the process. Once you have tried to build stuff, you’ll notice that you will become better at asking good questions. For example, I wanted to learn how to build an Alexa Skills as a compliment to an eBook I recently published. So I made an Amazon AWS account and watched a bunch of Youtube videos about adding custom skills using AWS Lambda. Codecadamy made this a lot easier.  To be honest, I didn’t get extremely far without coding skills. But I learned what is possible and what is not possible with Amazon Alexa. It forced me to do research and now I have not only a higher level business understanding of how I could monetize a skill, but also a more in depth understanding of the tech. Now I can ask better questions. Since then I’ve got some help from a developer in India who is building the rest of the skill for me. It’s a lot easier to have a conversation with her because I know how the interface looks like and the basics of the technology. Curiosity comes naturally to some people. But what we think is “natural” is often just a series of habits. If you do something long enough it will become engrained and become part of your character. All in due time. The first step is to just try and build something. Don’t put pressure on yourself with unrealistic goals to understand a business or product inside out in a day. Once you hit a wall and when you don’t understand something, the great news is that you can ask people who have done it before! Good luck :)  I study and share useful content about self-improvement and new technology. If you enjoyed this drop your email here to subscribe to my weekly newsletter. ",
            "date": "Updated January 11, 2018",
            "views": "46",
            "upvotes": " View 89 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Saleha Abdul",
                    "user_href": "/profile/Saleha-Abdul"
                },
                {
                    "user_id": "Arogya Bichpuria",
                    "user_href": "/profile/Arogya-Bichpuria-3"
                },
                {
                    "user_id": "Anik Dey Shaon",
                    "user_href": "/profile/Anik-Dey-Shaon"
                },
                {
                    "user_id": "Rojan Shrestha",
                    "user_href": "/profile/Rojan-Shrestha-6"
                },
                {
                    "user_id": "Aman Pandya",
                    "user_href": "/profile/Aman-Pandya-7"
                },
                {
                    "user_id": "Deaan Koekemoer",
                    "user_href": "/profile/Deaan-Koekemoer"
                },
                {
                    "user_id": "Khaled Mohamed",
                    "user_href": "/profile/Khaled-Mohamed-2"
                },
                {
                    "user_id": "YOGESH PATEL",
                    "user_href": "/profile/YOGESH-PATEL-217"
                },
                {
                    "user_id": "Shalini Sinha",
                    "user_href": "/profile/Shalini-Sinha-7"
                },
                {
                    "user_id": "Shashank Sharma",
                    "user_href": "/profile/Shashank-Sharma-1342"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Arbitman",
                "href": "/profile/Steven-Arbitman-1"
            },
            "answer_text": "A2A. I have a one word answer, if you want to learn something: play! The other answers here are all very good, but your emphasis should be on play. If you are having fun with your tech interest then you will naturally learn about it. This is how children learn and it is why children are much better at learning computers (for example) than adults. Adults see a computer as a fancy complicated piece of technology and are afraid to touch it for fear of breaking something. Kids see it as a toy. They may break it but that is what happens to toys sometimes. Be a kid, play with it. The other answers seem to assume that your tech interest is computers and electronics. If so, then try their suggestions. Alternatively, get a chemistry set, or a set of Legos, or even build a model rocket or a telescope, depending on your tech interest. ",
            "date": "Answered January 4, 2018",
            "views": "553",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kendra Cox",
                    "user_href": "/profile/Kendra-Cox-30"
                },
                {
                    "user_id": "Olajide Christopher",
                    "user_href": "/profile/Olajide-Christopher"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Migs-Mortz"
                }
            ]
        }
    ]
}