{
    "title": "How do technological factors influence curriculum development? - Quora",
    "tags": [
        "Curriculum Development",
        "Influence",
        "Course Curricula and Syllabi",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Deitrick Price",
                "href": "/profile/Bruce-Deitrick-Price"
            },
            "answer_text": "Well, they are always there, like phones or cars or computers now. But I don't know that you can speak of cause-and-effect. In any given year or region, people work with what's available. If you want to talk about huge influences, you have to look at intellectual and philosophical context. Beliefs make a difference. In the US, there are two huge swirling adversaries. The first is traditional education, which is the distillation of Western civilization and all the things that the smartest people valued and wanted to see preserved for the next generations. (All of my work is intended to remind people that this tradition is worth preserving.) The opposing force is called Progressive education, which is the distilled wisdom of collectivist, socialist, totalitarian, Communist, and anti-Western thinking. In ways that are very hard to disentangle, Progressive perspectives end up being the friend and tool of people who want to overthrow existing authority and seize power for themselves. In practice, what this means, confusingly enough, is that something calling itself an educational philosophy is more properly understood as a revolutionary philosophy. It's what you adopt if you intend to change governments. QED: ideological factors are the dominant influence on American curriculum development. ",
            "date": "Answered October 7, 2019",
            "views": "965",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nurul Hazmi",
                    "user_href": "/profile/Nurul-Hazmi"
                }
            ]
        }
    ]
}