{
    "title": "How does Google and other search engines get their information? - Quora",
    "tags": [
        "Google Search",
        "Search Engines",
        "Engines",
        "Search Engine Optimization (SEO)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arash Ghaemi",
                "href": "/profile/Arash-Ghaemi-4"
            },
            "answer_text": "Google gets its information from other people. Wikipedia, for example, is a crowdsourced way for Google to gather information and show them in results. People add information to Wikipedia all the time and it’s oftentimes one of the top results when you complete a search. Another way they get information is from other people starting their own website. For example, if someone starts a blog on the best tools for SEO and publishes it, Google uses that blog post for information. Or someone could post information on another website on how to become an SEO expert and Google uses that as well. The IRS has a website with information on how to file your taxes and different tax codes. Disney has a website with information on their company and all of their movies. There are websites dedicated to answering questions like Quora. So, Google basically just relies on other people to get their information. The incentive for people to add this information is to make money. At its core Google is a Marketing engine. Google’s original mission statement is to organize the world's information and make it universally accessible and useful. Now compare this to how people used to get information 50 years ago. They would rely on TV, radio, word of mouth, or the library. If you wanted information someone would have to of wrote a book on it, had it published, and in turn distributed to book stores. Eventually, it would makes it way to the library and you would then go and check it out. So, while the same theme still applies 50 years ago where other people would provide information to fill bookshelves, Google has created a way to do so much faster! When you think of Google think of it as a digital library. It’s no different but you don’t need to “check out” the information. You just search for it and see if it’s what you’re looking for or not. ",
            "date": "Updated May 18, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andy Lehane",
                    "user_href": "/profile/Andy-Lehane-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Kumar",
                "href": "/profile/Aditya-Kumar-97"
            },
            "answer_text": "Google and other search engines have their Spiders/Crawlers, whose works is to fetch web pages, categorize them and saved indexes of keywords used on it. Crawlers also follows links(internal/external) from that page to the other, which helps search engines to become more robust and comprehensive. Based on these saved indexes it serves most relevant information/results for what user is searching for. ",
            "date": "Answered February 1, 2019",
            "views": "482",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aakash Brahmbhatt",
                    "user_href": "/profile/Aakash-Brahmbhatt-2"
                },
                {
                    "user_id": "Ravi Teja",
                    "user_href": "/profile/Ravi-Teja-5142"
                }
            ]
        }
    ]
}