{
    "title": "How do hackers learn how to hack? - Quora",
    "tags": [
        "Hackers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dhiraj Panjwani",
                "href": "/profile/Dhiraj-Panjwani-3"
            },
            "answer_text": "Take it from a guy who has spent a lot of money getting certificates. Its a waste. Don’t go for certificates unless you’re certain that the content would help you. EC-Council’s Certified Ethical Hacker(popularly known as CEH, written as C|EH) is a huge waste of time. You get to know very few things and that to on the surface. Most of those things don’t work if you are serious about being a hacker. A hacker cannot learn technologies by just seeing its flaws. First, you need to understand how technologies work. You won’t find a hacker who doesn’t know the entire TCP/IP suite at the back of his hand, at least not the ones I’m talking about. He is familiar with how Operating Systems work. How packets in a network flow. He knows how passwords are stored in machines and how they are stored in browsers. A person who thinks just knowing where the password is, is plenty for him to crack it, this is what CEH teaches, is an utter fool. If you don’t know how the privileges in the Linux system work, or how they are to manipulated to get the password file and then the encryption that is used and how the tool that cracks that encryption works. Then you aren’t a hacker. You just know a hack that you keep repeating. All these are questions a hacker should know the answers to. A hacker, the kinds I have known, learned by going deep in everything that they were curious to explore. They didn’t Google how to be great hackers, because that shows you are doing it to be famous and its stupid. If you really want to know if hacking is your field, go and download a packet analyser, see how packets move in the network and learn how protocols in theory compare with them. Then, learn enough programming to write your own packet analyser. If you succeed at that, write a tool to craft your own packets and send them. Once you have learned everything I described here, you have merely learned one attack, and that is called IP spoofing. You still aren’t even sure how to use it, you just found a way to fool the system and that’s what hacking is all about. You learn the rules, you play with them and every once in a while you find a way to fool the system. Stop reading books that have the word hacking in it, it will teach you very few things. Learn the core technologies, their rules and exceptions and then bend them. ",
            "date": "Answered June 29, 2016",
            "views": "51",
            "upvotes": " View 247 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amelia Olaru",
                    "user_href": "/profile/Amelia-Olaru"
                },
                {
                    "user_id": "Alejo Rosario",
                    "user_href": "/profile/Alejo-Rosario-2"
                },
                {
                    "user_id": "Comet",
                    "user_href": "/profile/Comet-7"
                },
                {
                    "user_id": "Velu Ramasamy",
                    "user_href": "/profile/Velu-Ramasamy-4"
                },
                {
                    "user_id": "Takashi Takamatsu",
                    "user_href": "/profile/Takashi-Takamatsu"
                },
                {
                    "user_id": "Mary-Ann Van der Wath",
                    "user_href": "/profile/Mary-Ann-Van-der-Wath"
                },
                {
                    "user_id": "John Johnson",
                    "user_href": "/profile/John-Johnson-5189"
                },
                {
                    "user_id": "Fanya Midtskogen",
                    "user_href": "/profile/Fanya-Midtskogen"
                },
                {
                    "user_id": "Emyz Keyi",
                    "user_href": "/profile/Emyz-Keyi"
                },
                {
                    "user_id": "Cynthia Hamilton",
                    "user_href": "/profile/Cynthia-Hamilton-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Omar Todd",
                "href": "/profile/Omar-Todd"
            },
            "answer_text": "(I just liked this question and answered from my perspective, I hope the author and the named recipients mentioned don't mind) Experimentation plus a lot of time with not much of a normal life means you may become a reasonable \"hacker\". It's often a lonely, repetitive and not so glamorous as Hollywood films make it out to be sort of life style. In my case I dabbled for many years by mostly building up my own Internet Service Providers and trying to find innovative ways around monopoly owned expensive first tier bandwidth providers so most of my \"hacking\" was finding innovative ways to bypass costs to save money, hence peering arrangements, satellite transits, multi homed routers and BGP (Border Gateway Protocol) etc etc lots of bonded methods of internet connectivity. To save money!  There was no one around to ask about this stuff back in the 90's so we all just pissed about about breaking a lot and mangling it until it would work, along the way you learn out things are vulnerable but more or less you didn't see it as vulnerable you just knew it was designed for one purpose and here you are hacking other purposes out of it.  You see in itself hacking or to become a hacker shouldn't be the sole goal in my view, but a learning experience to serve your ultimate goals which should be more lofty. Meanwhile suddenly you end up knowing a lot about stuff and then someone slaps the \"hacker\" label on you although mostly the good hackers don't really like it as a label as it belittles their usually more lofty ideals. ",
            "date": "Answered August 23, 2015",
            "views": "272",
            "upvotes": " View 177 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Comet",
                    "user_href": "/profile/Comet-7"
                },
                {
                    "user_id": "Stacy Wilson",
                    "user_href": "/profile/Stacy-Wilson-189"
                },
                {
                    "user_id": "Mustafa Hayati",
                    "user_href": "/profile/Mustafa-Hayati"
                },
                {
                    "user_id": "Anupam Kumar",
                    "user_href": "/profile/Anupam-Kumar-346"
                },
                {
                    "user_id": "Chetan Sagta",
                    "user_href": "/profile/Chetan-Sagta"
                },
                {
                    "user_id": "Surya Teja Parnampedu",
                    "user_href": "/profile/Surya-Teja-Parnampedu"
                },
                {
                    "user_id": "John Gedeon",
                    "user_href": "/profile/John-Gedeon-1"
                },
                {
                    "user_id": "Jude Ashan",
                    "user_href": "/profile/Jude-Ashan"
                },
                {
                    "user_id": "Roussos Koliakoudakis",
                    "user_href": "/profile/Roussos-Koliakoudakis"
                },
                {
                    "user_id": "Taufan Satrio",
                    "user_href": "/profile/Taufan-Satrio"
                }
            ]
        }
    ]
}