{
    "title": "How long should I charge a new phone before the first use? - Quora",
    "tags": [
        "Mobile Phone Charging",
        "Battery Charging",
        "Mobile Phones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joran Smith",
                "href": "/profile/Joran-Smith"
            },
            "answer_text": "Nowadays, most modern phones use Lithium Polymer (Li-Po) batteries. Lithium Polymer batteries don't need to be charged before the first use, because (if the manufacturer that sold you your phone isn't stupid) they will probably already be charged to about 60-70%. The thing is, Li-Po batteries wear down. That is, they lose the capacity to hold charge slowly over time. This wear happens wether you use them or not, though it happens faster with use. The most optimal situation for most batteries, in which this wear happens the slowest, is at a slightly refrigerated temperature, at a charge level of about 60-70%. This is not really a problem for consumers: You can't store your phone in the fridge, and permanently keeping it charged to 70% probably isn't very feasible either. For companies that deal with large volumes of Li-Po batteries that will not be used while in storage, it can however be a good idea to charge those batteries to 60-70%, since storing them at lower or higher charge levels can adversely impact the life expectancy of the battery. Therefore, when you receive your new smartphone in the mail, it will nowadays usually be charged to about 65% and ready to use. There is no real need to charge the phone before use, but 60% is of course not even 2/3 charged. It would probably be wise to charge the phone whilst configuring it, so you won't run out of power later on the day. You are likely sitting still while you are configuring it anyway... This applies only to Li-Po/Li-Ion chemistry phone batteries, and as a disclaimer, I'm just a hobbyist who did some googling/reading on this a while back, if an actual expert could say something about this that would of course be better, and I'd be interested to hear whether or not I'm talking bullshit ;PTL;DRCharging a new phone for any specific length of time isn't necessary for any technical reason (that I know of). ",
            "date": "Answered May 15, 2015",
            "views": "4101",
            "upvotes": " View 211 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Suzyo Kasanga",
                    "user_href": "/profile/Suzyo-Kasanga"
                },
                {
                    "user_id": "Jonathan Morrone",
                    "user_href": "/profile/Jonathan-Morrone-1"
                },
                {
                    "user_id": "Elijah Day",
                    "user_href": "/profile/Elijah-Day-2"
                },
                {
                    "user_id": "Helmut Samerski",
                    "user_href": "/profile/Helmut-Samerski"
                },
                {
                    "user_id": "Blind Luv",
                    "user_href": "/profile/Blind-Luv"
                },
                {
                    "user_id": "Deekshith Shetty",
                    "user_href": "/profile/Deekshith-Shetty-17"
                },
                {
                    "user_id": "Sangita Raturi",
                    "user_href": "/profile/Sangita-Raturi-2"
                },
                {
                    "user_id": "K.Manoj Gowda",
                    "user_href": "/profile/K-Manoj-Gowda"
                },
                {
                    "user_id": "Aftab Mirza",
                    "user_href": "/profile/Aftab-Mirza-13"
                },
                {
                    "user_id": "Zabeen Khan",
                    "user_href": "/profile/Zabeen-Khan-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yuan Gao",
                "href": "/profile/Yuan-Gao-5"
            },
            "answer_text": "However long you want, you can even just start using it at whatever half-charge it came with if you'd like. There's basically no adverse effects of not doing a full charge on your new battery, other than your phone's battery meter being a little bit inaccurate until you do a full charge/discharge cycle. The manufacturer recommendations stem way back from the time when NiMH batteries were in use, which had certain requirements when it came to charge/discharge cycles, but don't apply to Lithium ion.  This has lead to a lot of misconceptions about batteries of different chemistries, as well as, unfortunately, battery safety.  Furthermore, because the consequences of making the consumer do an 8 hour charge is relatively low. Interestingly, Apple make a point to ensure that their products are fully charged - Steve Jobs and the user experience guys at Apple rightly noted that it was a major disappointment for consumers to unbox a great gadget that they'd been looking forward to, only to have to wait several hours for it to charge before they could use it.  So Appleactually mostly charges their devices at the factory, allowing consumers to begin using the device right away.   I don't know if other manufacturers have followed suit. ",
            "date": "Updated December 18, 2017",
            "views": "415",
            "upvotes": " View 121 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Morrone",
                    "user_href": "/profile/Jonathan-Morrone-1"
                },
                {
                    "user_id": "Alex Wong",
                    "user_href": "/profile/Alex-Wong-759"
                },
                {
                    "user_id": "Sahejeet Singh",
                    "user_href": "/profile/Sahejeet-Singh-4"
                },
                {
                    "user_id": "Sachin Eldho",
                    "user_href": "/profile/Sachin-Eldho"
                },
                {
                    "user_id": "Moshfiq Rohit",
                    "user_href": "/profile/Moshfiq-Rohit"
                },
                {
                    "user_id": "Aadityan R Kurungat",
                    "user_href": "/profile/Aadityan-R-Kurungat"
                },
                {
                    "user_id": "Joanna Rand",
                    "user_href": "/profile/Joanna-Rand"
                },
                {
                    "user_id": "Selina Yep",
                    "user_href": "/profile/Selina-Yep"
                },
                {
                    "user_id": "Zahur Ashrafuzzaman",
                    "user_href": "/profile/Zahur-Ashrafuzzaman"
                },
                {
                    "user_id": "Sumit Joshi",
                    "user_href": "/profile/Sumit-Joshi-135"
                }
            ]
        }
    ]
}