{
    "title": "How to find my retweets - Quora",
    "tags": [
        "Retweets (Twitter)",
        "Twitter (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Tropes",
                "href": "/profile/Frank-Tropes"
            },
            "answer_text": "Twitter is gradually removing the Retweets tab from all accounts and merging it into the @username tab. If you're running a Twitter account for a business, or if you're just curious about your personal reach within your followers, it can be difficult to sort through the @user tab's plethora of information. So here's a quick fix for taking a look at your tweets, retweeted: Log in to Twitter. Then, in the search box type: include:retweets OR via @username replacing \"username\" with your Twitter name.  Screenshot by Nicole Cozma If you find that the people retweeting you are using a different syntax (like \"re:\" instead of \"via\"), just add it to the end of the two search terms already listed. For example, include:retweets OR via @CNET OR re:@CNET Screenshot by Nicole Cozma If you don't want to fuss with the search box, you can use this direct link by again replacing username with your actual Twitter name: Twitter. It's what's happening. For instance, if you were looking at CNET's tweets, retweeted, it would look like this: Twitter. It's what's happening. Now you can save the search on Twitter (through the save search button) or use a handy bookmark to see your retweets. It shouldn't be this complicated, but hey, at least the search function still shows them. ",
            "date": "Answered August 31, 2016",
            "views": "172",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Nguyen",
                    "user_href": "/profile/John-Nguyen-729"
                },
                {
                    "user_id": "Patsachol Akanitvong",
                    "user_href": "/profile/Patsachol-Akanitvong"
                },
                {
                    "user_id": "Piyush Mandalia",
                    "user_href": "/profile/Piyush-Mandalia-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Kawula",
                "href": "/profile/Michael-Kawula"
            },
            "answer_text": "Use Twitter Advanced Search (click-here) Easy to use and several different ways to pull up a Tweet if you remember some of the keywords you used or the account you were tweeting to. I actually had to pull up a Tweet from 2012 recently to remind someone of a conversation on Twitter and found it within moments using Advanced Search. It’s also a great tool to do prospecting and social listening when you know the keywords your interested in following if this is for business. Good Luck ~ ",
            "date": "Answered August 25, 2020",
            "views": "509",
            "upvotes": "0"
        }
    ]
}