{
    "title": "How can someone work in healthcare with an associate’s degree? - Quora",
    "tags": [
        "Associate Degrees",
        "Healthcare Industry",
        "Jobs and Careers in Healthcare and Medicine",
        "Healthcare IT",
        "Health Insurance",
        "College Advice",
        "Jobs and Careers",
        "Medicine and Healthcare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Janine Randall",
                "href": "/profile/Janine-Randall"
            },
            "answer_text": "I’m not really sure about the reason for your question. As Ms. Voss stated, there are many careers you can pursue in the medical field with little or no additional education after High School. If you want something more than your AA, but you’re not looking to get your RN, BSN, I would suggest a vocational school. You can receive schooling in Medical Billing and other front office services, Phlebotomy and other training needed to be an MA. You’ll have a better place in line for a job than others who have no additional training. ",
            "date": "Answered October 25, 2019",
            "views": "186",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susan Calvin",
                "href": "/profile/Susan-Calvin"
            },
            "answer_text": "The hands on care usually requires little to no training. The stuff that we used to think of as orderly’s work. It does often require experience. I know that the carers that work with my dad had to either finish a 8 month course to become a CNA or have experience which was usually 1 year of caring for an elderly family member. Many of the lab jobs have on the job training. Many things like phlebotomist have certification training. ",
            "date": "Answered October 25, 2019",
            "views": "164",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pal Gurp",
                    "user_href": "/profile/Pal-Gurp"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annie Voss",
                "href": "/profile/Annie-Voss"
            },
            "answer_text": "Associate’s degree in what? There are CNA, LPN/LVN roles, even RNs that are AA-based, though the ask for RNs with a BS is increasingly common. There’s medical unit secretaries, lab techs, radiology techs, respiratory therapists, and many more that have community college-based programs all across the US. Then there’s options on the business/back office side too. ",
            "date": "Answered October 24, 2019",
            "views": "138",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janine Randall",
                    "user_href": "/profile/Janine-Randall"
                },
                {
                    "user_id": "Mark Schumaker",
                    "user_href": "/profile/Mark-Schumaker-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Davis",
                "href": "/profile/Chris-Davis-515"
            },
            "answer_text": "Many of the allied health careers require an associate degree…physical therapy assistant, occupational therapy assistant, surgical technologist, nurses, medical assistants, ultrasound, x-ray techs, pharmacy tech, etc. ",
            "date": "Answered October 24, 2019",
            "views": "95",
            "upvotes": " Answer requested by Evan Lipschultz"
        }
    ]
}