{
    "title": "How many bees are left in the world? - Quora",
    "tags": [
        "Apiculture (Beekeeping)",
        "Bees (insect)",
        "Entomology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Snyder",
                "href": "/profile/Chris-Snyder-77"
            },
            "answer_text": "I will assume that you are talking about honeybees and would argue that it is the number of beehives that is important, since that is the reproductive unit, and I would take FAOSTAT’s numbers (as cited by respondent Emily Heath) as a conservative estimate for that. Orphaned bees without a hive are going to be dead very soon with no descendants. Moreover, I would say that the huge numbers of bees that others are citing in their answers might give people false comfort or even lead them to think that bees are not in danger of extinction, when the advent of veroa mites, colony collapse disorder, and neonicotinoid pesticides used on so many human crops and even nursery plantings is causing a rapid decline in the number of living domesticated hives and wild honeybee hives have become pretty rare. I know that in my short half century, I have seen bees decline from nearly every other dandelion in my parents yard having a wild bee on it, to sighting a honeybee in my rural area is now a very rare occurance, not something that happens even every week, much less daily. My husband used to keep a couple of hives as a hobby, and over the course of a decade, he noticed that he went from the bees thriving & producing lots of honey, to having to replace both hives every year, even though he completely sterilized the bee boxes between each batch of bees. He decided that it was unfair to keep using the annual reproductive capacity of some queen bees only to have their progeny die off every year when he was not able to dedicate the time needed to caring for the bees when he had a full time job. It is true that some other more native bee species have begun picking up the pollination slack and filling the mostly vacant ecosystem niche the honeybees occupied, but those other species are not invulnerable either, and humanity’s survival is dependent upon pollinators helping our plant foods to reproduce. We need to resolve all the problems that have led to the decline of the honeybee if we want to preserve our ecosystems and humanity. ",
            "date": "Answered March 9, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ashley Victoria",
                    "user_href": "/profile/Ashley-Victoria-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Heath",
                "href": "/profile/Emily-Heath"
            },
            "answer_text": "Your question did make me smile as I imagined you trying to go round counting them all. Here’s my attempt to answer… if you go to the United Nations Food and Agriculture Organization website at FAOSTAT, you can download the latest 2016 data on the number of managed bee hives worldwide across 123 countries. The individual country data can be downloaded as a spreadsheet or the data can be visualised at FAOSTAT - this tells us that there was a worldwide total of 90,564,654 beehives in 2016. The number of honey bees in a hive fluctuates during the year depending on the local weather, season, available forage and the health of the colony. The species or sub-species of honey bee will also affect how many bees are in the colony. I’ve seen widely ranging estimates of how many bees are in a colony, but the British Beekeeping Association (BBKA) ‘Life in the hive’ information sheet says 'In high summer about 35,000, dropping to around 5,000 in the winter', so let's go with that. As a very rough and un-mathematical estimate we might say around 20,000 bees could be in each colony. So 90,564,654 x 20,000, which my calculator says = 1.8112931e+12 This number is only for bee hives that have been counted and data supplied to the United Nations. There will obviously be many more wild colonies that have not been counted. And the number of live honey bee colonies will be fluctuating all the time. Can anyone else come up with a more accurate number? Does anyone feel this is wildly inaccurate? ",
            "date": "Answered January 5, 2018",
            "views": "134",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Theodore Hildebrandt",
                    "user_href": "/profile/Theodore-Hildebrandt-1"
                },
                {
                    "user_id": "Eric L. Peters",
                    "user_href": "/profile/Eric-L-Peters"
                },
                {
                    "user_id": "Daton Craft",
                    "user_href": "/profile/Daton-Craft-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/TBNRskyfire"
                },
                {
                    "user_id": "Charles Nielsen",
                    "user_href": "/profile/Charles-Nielsen-5"
                },
                {
                    "user_id": "Alexander Mav",
                    "user_href": "/profile/Alexander-Mav"
                },
                {
                    "user_id": "Diane Kenaston Sauerborn",
                    "user_href": "/profile/Diane-Kenaston-Sauerborn"
                },
                {
                    "user_id": "Peter Fink",
                    "user_href": "/profile/Peter-Fink-5"
                },
                {
                    "user_id": "Gunawan Wicaksono",
                    "user_href": "/profile/Gunawan-Wicaksono"
                },
                {
                    "user_id": "Brie Doby",
                    "user_href": "/profile/Brie-Doby"
                }
            ]
        }
    ]
}