{
    "title": "How would the real world react to Peter Parker? - Quora",
    "tags": [
        "Peter Parker (Marvel Character)",
        "Spider-Man (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Imogen Howard",
                "href": "/profile/Imogen-Howard-4"
            },
            "answer_text": "I can honestly see people being ecstatic. Assuming that we’re well aware that Peter Parker is Spider-Man and that Spider-Man is a good guy, I think most of us would be happy to have him. Firstly, he’d probably be a great source of income for New York. Can you imagine how many tourists would go to New York to try and see him? New York would be getting a lot of money from tourists. If he ever met with Marvel, he could probably reduce the money they spend on special effects when making films including Spider-Man, and if we assume that his story plays out the same way as the comics, we could give Peter some advice for the future. I can also see Peter Parker taking some kind of quiz on YouTube to see which actor he’s most like (Toby Macguire, Andrew Garfield, Tom Holland) so we can settle that debate. I can see him reacting to all the Spider-Man films and other films, just being a well liked person. ",
            "date": "Answered August 18, 2019",
            "views": "122",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anita Bath",
                    "user_href": "/profile/Anita-Bath-12"
                },
                {
                    "user_id": "Zach Batz",
                    "user_href": "/profile/Zach-Batz-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shane Greer",
                "href": "/profile/Shane-Greer-3"
            },
            "answer_text": "That depends on the Peter Parker you’re asking about. If you’re thinking Peter Parker the once nerdy Scientist/Photo Journalist. The reaction would be just the same as he would be treated in the comics. Indifference from strangers, loved by close friends and family and hated by rivals of the trade. If you’re asking about Peter Parker as Spider-man, the same way he’s treated in the comics. When Stan Lee first created Spider-man, he wanted to create an imperfect real world hero, who has to struggle with all of his life’s responsibilities, while trying to live up the responsibility he feels obligated with his powers. Everything that didn’t involve the use of his powers and battles with criminals and supervillains can be applied to the real world. He struggles financially, he often shows up late for his civilian life stuff such as his school and work. So needless to say everything that’s happened to him without his powers could happen to him in real life. ",
            "date": "Answered August 18, 2019",
            "views": "117",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anita Bath",
                    "user_href": "/profile/Anita-Bath-12"
                },
                {
                    "user_id": "Travis Lengacher",
                    "user_href": "/profile/Travis-Lengacher"
                }
            ]
        }
    ]
}