{
    "title": "How to tap somebody's phone - Quora",
    "tags": [
        "Ethical Hacking",
        "Telephones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rosario Contarino",
                "href": "/profile/Rosario-Contarino-1"
            },
            "answer_text": "I agree with Mario Ortega ‘s answer, to a certain extent. Unfortunately, today the cost for tracking/tapping a cellphone has gone so low that the illegal business of tracking/tapping other’s phone is literally booming. It is not just booming because it has become cheap, it is booming because the demand is increasing and, unfortunately, this growing demand comes from abusive, jealous partners. According to a recent research done by Joseph Cox (Vice, Feb.22, 2017), $170 are enough to buy a very sophisticated app able to track any phone, even from the other side of the world. According to Cox’s research, this technology, albeit illegal, has been even copied by some law enforcement agencies and it has become so advanced that cannot even be easily removed from the target phone. In Australia, for example Women's Services Network (WESNET) gives new smartphones to victims of domestic violence So, unfortunately, you don’t need to be a V.I.P. to become victim of this sort of stalking, and, beware, this technology is easily available to anyone. Many of our clients are lawyers and business men who are well aware of the risks they take in using standard phones. To be clear, it doesn’t matter what brand is your phone, if it connects to the standard cellular network it can be easily tapped/tracked, no matter what. ",
            "date": "Answered March 5, 2017",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Howard Bleiwas",
                "href": "/profile/Howard-Bleiwas"
            },
            "answer_text": "Step 1. Join a law enforcement agency.Step 2. Go to a court for a wiretap warrant. Landline telephones are simple technology. At the core of everything, even the most advanced telephone is still a radio; however, most mobile telephone networks encode voice digitally and encrypt the stream. Someone with suitable knowledge, technology and resources can tap either. However, legality - specifically civil and criminal penalty is more of a concern. Most countries and their component states/provinces do not have a great sense of humor when it comes to wiretaps. ",
            "date": "Answered May 23, 2016",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patricia Pitts",
                "href": "/profile/Patricia-Pitts-14"
            },
            "answer_text": "Um this is hard to explain but ill try my best so what you want to do is when the person is sleeping you wanna put tap on the persons finger if your talking about a iphone then you take the piece of tape off the place the piece of tape PERFECTLY OF IT IS NOT GOING TO WORK on YOUR finger then take the piece of tape off SLOWLY THEN place you finger on the iphone HOME BUTTON and you should be able tap into to this persons PHONE ",
            "date": "Answered December 15, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brady Smith",
                    "user_href": "/profile/Brady-Smith-129"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mario Ortega",
                "href": "/profile/Mario-Ortega-2"
            },
            "answer_text": "the likelihood depends on your nobodyness, if you are a nobody like the rest of us mere mortals, it is very unlikely, now, if you are really somebody, like a public face, a politic, a personality, or a hollywood star, well, the likelihood increases proportionatelly to your prominence, me being a nobody I can just imagine the other side, just remember, a lot more interest will be put onto your online accounts or your computer contents, private pictures, etc, I don’t think tapping a cell phone is easy, or cheap, all I know is that is very doable, given the right amount of resources, another thing that could put you in the right spot for a tapping or plain espionage would be if you are into illegal things like murdering people or trafficking anything, or anything illegal, and even if you are not, try this, threathen a most notorious politic figure, I think you can think of it like a “me! me! me!” for a tapping or what I would call it: DIY how to became a person of interest, instantaneously. or even better, don’t try it. Good Luck ",
            "date": "Answered October 15, 2016",
            "views": "918",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Haley",
                    "user_href": "/profile/Richard-Haley-21"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sean-331"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raghuveer(Raghu Incredibl)",
                "href": "/profile/Raghuveer-Raghu-Incredibl"
            },
            "answer_text": "By wiping data and cache . Reset your settings and format all of the data. Be sure to know that how you are hacked. Whether you downloaded any spy app or clicked on phishing links. Because,if you know how your phone hacked you can prevent and encrypt the phone with settings and many more. If you don't know still they can do the same thing and get access to your sensitive information . Be safe . . . ",
            "date": "Answered August 15, 2018",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Janice Baker",
                "href": "/profile/Janice-Baker-61"
            },
            "answer_text": "How do you put a tap on a cell phone ",
            "date": "Answered July 3, 2019",
            "views": "101",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christine Duggan",
                    "user_href": "/profile/Christine-Duggan-8"
                },
                {
                    "user_id": "Rachel Jackson",
                    "user_href": "/profile/Rachel-Jackson-464"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luke Eleks",
                "href": "/profile/Luke-Eleks"
            },
            "answer_text": "By multiple ways. For example by reading your E-mails and texts messages. A program that is installed on ylur device were you may nit even know of, can look at your e-mails and text messages and sent them to the owner of the program. That's wby you should NEVER install an application from an unknown source unless if you are 100% sure that it is safe. ",
            "date": "Answered November 30, 2017",
            "views": "607",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pavan Panchala",
                "href": "/profile/Pavan-Panchala"
            },
            "answer_text": "First make sure that your mobile is hacked. Then search in the apps for any suspicious apps,. If you find any such apps, uninstall them. Use the app named malwarebytes for checking any further bugs retained. If the problem still persists, it's better to reset your mobile. ",
            "date": "Answered August 15, 2018",
            "views": "33",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Psych Ansh",
                    "user_href": "/profile/Psych-Ansh"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Lee",
                "href": "/profile/John-Lee-2166"
            },
            "answer_text": "There are some points with the help of that yo can know that, if your phone hacked. Spy apps-ways to know if your phone is hacked.Phising using messages.SS7 phone vulnerabilitiesopen wifi network and charging stationsAnd If I am hacked",
            "date": "Answered July 23, 2018",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "PRIYANKA JADHAV",
                    "user_href": "/profile/PRIYANKA-JADHAV-368"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Civita",
                "href": "/profile/David-Civita"
            },
            "answer_text": "YOU CAN'T UNLESS YOU ARE LAW ENFORCEMENT PROCEEDING WITH PROPER COURT MANDATED LEGAL JURISDICTION. WOULD YOU WANT THAT DONE TO YOU??- D.C. ",
            "date": "Answered May 11, 2020",
            "views": "65",
            "upvotes": " Answer requested by Donald Semali"
        },
        {
            "author_info": {
                "name": "Syed Z Hosain",
                "href": "/profile/Syed-Z-Hosain"
            },
            "answer_text": "Yes. Law enforcement officials can monitor any phone, once they have a warrant signed by a judge. This means they can then require a cellular service provider to monitor a cell phone and listen. Google CALEA for more information. ",
            "date": "Answered February 21, 2017",
            "views": "11",
            "upvotes": " Answer requested by Margaret Leverette"
        },
        {
            "author_info": {
                "name": "Abu Abu",
                "href": "/profile/Abu-Abu-29"
            },
            "answer_text": "My all face book account shutonly close then ask upload ur clearly photo Why this problamI think my moblie ime numper or mobile numper hackig ?Pls telme good solution ",
            "date": "Answered July 5, 2017",
            "views": "708",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amrit Assi",
                "href": "/profile/Amrit-Assi-1"
            },
            "answer_text": "That is not allowed in India ",
            "date": "Answered March 23, 2018",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashitbharat Kothari",
                "href": "/profile/Ashitbharat-Kothari-1"
            },
            "answer_text": "You don’t. ",
            "date": "Answered May 11, 2020",
            "views": "37",
            "upvotes": " Answer requested by Donald Semali"
        }
    ]
}