{
    "title": "How to negotiate offers with two companies if both companies ask for the other offer before making an offer - Quora",
    "tags": [
        "Compensation",
        "Job Offers",
        "Software Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Morgan Missen",
                "href": "/profile/Morgan-Missen"
            },
            "answer_text": "Who are these companies?! Do not join either of them. Using manipulative tactics this early on is a huge warning sign. You shouldn't need to 'negotiate' just to get a first offer, ever. Perhaps not the answer you were looking for, but things like this (and exploding offers, low-balling, ultimatums, misrepresenting equity value, disparaging competitors and their employees, demanding candidates disclose salary history or other offer details, etc) make me really angry. In this current market (silicon valley anyway) most reputable companies know  better than to try to get away with treating candidates this way. I don't have enough context around your situation, but your question makes me think these companies are hesitating because they feel as though you're being disingenuous. They may fear you'll play the two offers and companies against one another (I'd bet these two companies are competitors). Either way, it's not a good sign--for you and for them--if they are being cagey this early. If they are concerned you'll try to force a bidding war, tread lightly here. You could burn bridges that would damage your reputation with both companies and their networks. Happy to give a more specific recommendation on how to handle this if given more context. ",
            "date": "Answered December 15, 2011",
            "views": "46",
            "upvotes": " View 54 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charlie Cheever",
                    "user_href": "/profile/Charlie-Cheever"
                },
                {
                    "user_id": "Denise Llorca",
                    "user_href": "/profile/Denise-Llorca"
                },
                {
                    "user_id": "S. Naqvi",
                    "user_href": "/profile/S-Naqvi"
                },
                {
                    "user_id": "Emma Saboureau",
                    "user_href": "/profile/Emma-Saboureau"
                },
                {
                    "user_id": "Anirudh Joshi",
                    "user_href": "/profile/Anirudh-Joshi"
                },
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                },
                {
                    "user_id": "Alagunarayanan Narayanan",
                    "user_href": "/profile/Alagunarayanan-Narayanan"
                },
                {
                    "user_id": "Benjamin Forrest",
                    "user_href": "/profile/Benjamin-Forrest"
                },
                {
                    "user_id": "Vijay Chidambaram",
                    "user_href": "/profile/Vijay-Chidambaram"
                },
                {
                    "user_id": "Shengwu Yang",
                    "user_href": "/profile/Shengwu-Yang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Hendler",
                "href": "/profile/Jonathan-Hendler"
            },
            "answer_text": "Honesty may work. Draw a boundary with both companies and say you can not ask the other company to bid first. You may loose out on a better offer, but the company that respects your boundaries might be better to work with in the long term.  To really sieze the moment, say \"I want X\". You might loose both, or you might get exactly what you want. If they aren't willing to give you what you want, then maybe that's a reason to not work with either of them. You could also raise the stakes to deter the them from waiting it out - if you have any preferences about which company is better, use that as leverage with the other. Saying \"I'm leaning towards company A because\". Again, be honest. If you want to take purely game-theoretic approach to optimize the bargaining, you can get quite sophisticated, I'd imagine. In a sense, they are locked in a game of brinksmanship, with you as the prize. The negotiation is the war, and the one that moves first believes they might lose. [1] Edit: Just for fun - imagine you are the blond. This reminds me of the scene in \"A Beautiful Mind\" \"Governing Dynamics\" when Nash enters the bar with friends and realizes they must ignore a woman to break the stalemate:http://movieclips.com/gx3fc-a-beautiful-mind-movie-governing-dynamics-ignore-the-blond/  Summary:Get one to make an offer - either because it's the company you really want, or it's the offer you really want. Then the other one is forced to outmatch, and they'll know they are at a disadvantage. If they don't really like you that much, then you have called their bluff and it might not be great to work there anyway. [1] - http://en.wikipedia.org/wiki/Chicken_(game) ",
            "date": "Answered December 15, 2011",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charlie Cheever",
                    "user_href": "/profile/Charlie-Cheever"
                }
            ]
        }
    ]
}