{
    "title": "How do 3D glasses work while watching a 3D movie? - Quora",
    "tags": [
        "3D Movies",
        "3D Technology",
        "Hollywood"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashok Kumar Srinivasan",
                "href": "/profile/Ashok-Kumar-Srinivasan"
            },
            "answer_text": "The polarized filters are used in the 3D glasses to watch the 3D content movie or any show.Our visual perception is one of the interesting things. Our two eyes perceives the different images of the same object when you are looking at an object and both the images formed as a complete one image with the help of our brain. Our human brain is very intelligent enough to form a complete image.You can try this out. You close your one eye and try to see the object with the other eye, you will a sea different angle or position of an image also do it vice versa you will notice the different position or angle too. Therefore ,3D glasses has two polarize filters to basically to do the following,one is to let one kind of light through,another one is to let another kind of light.It is basically of horizontal & Vertical light through. You can find out the difference of light travels using two 3d glasses.try this.1. Take 2 3D glasses, when both the filers(polarizers)are put in one direction let say (horizontal) - they are transparent. You will be able to see the picture. Because horizontal light travels.2. If they put horizontal&vertical(I mean perpendicular axis). then it looks like the block. It's like the horizontal light waves are not able pass through the vertical medium. So it may look like block. They also have the circular polarizers. Which is basically to see the picture of which  the light travels in the circular form ( I mean clockwise & anti clockwise). There are three kinds of 3d Glass. Red/CyanPOlarizedActive shutter - Designed for home theater screens Polarized is the one which is used most of the places and also its a cheap compared to the active shutter. ",
            "date": "Answered May 7, 2014",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Travis Casey",
                    "user_href": "/profile/Travis-Casey-4"
                },
                {
                    "user_id": "Soni Barnwal",
                    "user_href": "/profile/Soni-Barnwal-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rameez C",
                "href": "/profile/Rameez-C"
            },
            "answer_text": "Binocular Vision            Most human beings come equipped with two eyes and an absolutely amazing binocular vision system. For objects up to about 20 feet (6 to 7 meters) away, the binocular vision system lets us easily tell with good accuracy how far away an object is. For example, if there are multiple objects in our field of view, we can automatically tell which ones are farther and which are nearer, and how far away they are. If you look at the world with one eye closed, you can still perceive distance, but your accuracy decreases and you have to rely on visual cues, which is slower.          The binocular vision system relies on the fact that our two eyes are spaced about 2 inches (5 centimeters) apart. Therefore, each eye sees the world from a slightly different perspective, and the binocular vision system in your brain uses the difference to calculate distance. Your brain has the ability to correlate the images it sees in its two eyes even though they are slightly different. 3-D Viewing          In a movie theater, the reason why you wear 3-D glasses is to feed different images into your eyes just like a View-Master does. The screen actually displays two images, and the glasses cause one of the images to enter one eye and the other to enter the other eye. There are two common systems for doing this: Red/Green or Red/Blue          Although the red/green or red/blue system is now mainly used for television 3-D effects, and was used in many older 3-D movies. In this system, two images are displayed on the screen, one in red and the other in blue (or green). The filters on the glasses allow only one image to enter each eye, and your brain does the rest. You cannot really have a color movie when you are using color to provide the separation, so the image quality is not nearly as good as with the polarized system. Polarization          At Disney World, Universal Studios and other 3-D venues, the preferred method uses polarized lenses because they allow color viewing. Two synchronized projectors project two respective views onto the screen, each with a different polarization. The glasses allow only one of the images into each eye because they contain lenses with different polarization. ",
            "date": "Answered May 7, 2014",
            "views": "19",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaditya Khedekar",
                    "user_href": "/profile/Aaditya-Khedekar"
                },
                {
                    "user_id": "Rafael Carpy",
                    "user_href": "/profile/Rafael-Carpy"
                },
                {
                    "user_id": "Vinit Chouhan",
                    "user_href": "/profile/Vinit-Chouhan-2"
                },
                {
                    "user_id": "Bansal Shah",
                    "user_href": "/profile/Bansal-Shah"
                },
                {
                    "user_id": "Snigdha Potharaju",
                    "user_href": "/profile/Snigdha-Potharaju"
                }
            ]
        }
    ]
}