{
    "title": "How will real estate in India change post COVID-19? - Quora",
    "tags": [
        "Future of India",
        "Real Estate in India",
        "Commercial Real Estate",
        "Real Estate Agents",
        "Real Estate Investing",
        "The Economy of India",
        "Real Estate",
        "COVID-19 (2019-2020)",
        "Politics of India",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Velocity Housing",
                "href": "/profile/Velocity-Housing"
            },
            "answer_text": "Indian Real Estate market post-pandemic - How and where COVID -19 is creating opportunity. Covid-19 impact can radically remould our beliefs and behavior. Colossal disruptions are the genesis of a fundamental shift in human attitudes that pave the path for new consumer requirements. Emergence of prominence of home In the lockdown period while staying at home for more than a month, most of the people realised the significance of owning a home and the safety that comes with it. Causes of increased demand in the residential sector Social distancing & Hygiene In the present scenario, when social distancing, hygiene, and safe place to live and work is the priority, the residential segment is most likely to witness a paradigm shift in terms of emerging trends and the demand from millennials. Read More ",
            "date": "Answered June 20, 2020",
            "views": "73",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anil Kapopara",
                    "user_href": "/profile/Anil-Kapopara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Star India Construction",
                "href": "/profile/Star-India-Construction"
            },
            "answer_text": "Covid-19 and Real Estate in tier 2 cities:The COVID-19 pandemic has had a sudden and drastic impact on all aspects of people’s lives. Now, it’s a global crisis with almost 64 lakhs infections and more than 3.5 lakh deaths across the world. Nearly half of the world is now living under some sort of lockdown quarantine and India is no exception. After a lockdown of almost two and a half months, a new phase has been launched with the name ‘Unlockdown 1.0’. Govt. has announced aid packages to counter the economic crises, boost the recovery, and reduce the impact. For the real estate sector, loan repayments have been delayed, new schemes have been announced, deadlines of project completion have been enhanced whereas the realtors have announced price reduction, changes in their working way, and schemes to enhance the demand. As the country starts to move out of lockdown, the real estate business begins the journey to’re-entry’ and adjusts to a ‘new normal’. From a consumer point of view, let’s have an analysis of the outcomes of this crisis that will help in the growth of the real estate sector and increase demand in tier-2 cities like Patna. 1. Price Policy: No doubt, the real estate sector of Patna has been heavily impacted by COVID-19. It has made realtors reduce the price of their upcoming and ongoing projects to sell the maximum. Also, relaxation schemes have been announced in the repayment of EMIs. Star India Construction Pvt. Ltd is offering the booking of premium bungalow plots at only 5000/- INR with the payment in installments after a year. Property investors or customers now have an opportunity to buy plots at a prominent site with high ROI at minimum capital expenditure. 2. Mass Migration and significance of home-state: India has never experienced such a mass migration of people except for the time of Independence in 1947. People are now more inclined to their home-state and state governments for further direction, support, and living. More and more buyers have shown interest in buying home or land in their respective states. It has increased demand in tier-2 cities like Patna whereas, in metro or tier-1 cities, it has been reduced. Under this period of “Unlockdown”, more and more buyers will be there that helps in achieving a ‘U’ or ‘V’ type growth in the sector. 3. Significance of self-owned home and gated community: the Year of 2020 will be known for two reasons in the future – one is COVID-19 and other ‘LOCKDOWN’. Measures of lockdown have enhanced the significance of personally owned homes and gated communities. It has been seen that virus has spread more in old cities with almost packed gullies. Now it’s time to rethink city planning and home-location. Buyers are more interested in newer gated community township than an apartment in some old area. Moreover, ease to access the essential commodities, to restrict the trespassers, and to monitor the communities are now more preferred. Along with these, in-campus medical facilities, no-congestion on roads, proximity to airport & railway station are other preferable choices. Summarizing, demand for township plans will increase. So, it’s time to invest in that. Considering, the Tech-Towne project by Star India Construction Pvt. Ltd completely in the light of the above-mentioned factors, it matches. Whether it’s about the price policy by its developer, gated community, or its proximity, it is the most favored project of the present time. It not only ensures property buyers for modern-era infrastructure but also a safe investment with higher ROI.For more project details, please Click ",
            "date": "Answered July 6, 2020",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anil Kapopara",
                    "user_href": "/profile/Anil-Kapopara"
                }
            ]
        }
    ]
}