{
    "title": "How to make money as a musician - Quora",
    "tags": [
        "Making Money Online",
        "Musicians",
        "How-to Question",
        "Wanting and Making Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Painter",
                "href": "/profile/Nathan-Painter-3"
            },
            "answer_text": "Okay it is possible but you have to really want it. Now a Ray's you cant just live off just making music like the oldies. You have to be your own band and manager in everything. You also have to be more than a musician you have to be an influence to a degree it's more than just making good music of course I'm talking about being a celebrity performing musician like from Hollywood. You can also join orchestras and make alot of money you can produce music and make a LOT of money. But still being an influence is about that playing shows is a low way to make money and is more of a celebrate now a days or a way to get your music out to the hip kids to spread to the world. Spotify if you get enough views people make like 80,000 a month and that's artist that are okay that we both have never heard of artist like nicki Minaj drake erc. Oh they make like 1m a month from spotify sometimes I'm not kidding Look up. Just think of how much YouTube pays them…. As a performing musican you'll do photo shoots people will pay YOU to take picture of you crazy… so now yojre a model. Naturally you will wear clothing to influence others to wear what you're wearing as that happens when people thi k you're cool any what do you'll find a brand you personally really like and they'll pay you to wear their cloths and give you that cloths for free. You have your own merch as well. Music that is the center point of you its who you personally are it's how you tackle life. It's how you see it. You have your own shirts posters wallets etc. That you made or you paid someone to help you make which is alot of the case you paying others to help or them just wanting to help. Well I could go on but yes you just really have to work hard and you can get there and as long as you become good at what you do you can make alot of money if you work with the righg people and really try to be influenced and be yourself I could seriously go on and on and on. I'm in the same position. I'm gonna keep grinding till I achieve my dream good luck to you too we can do it! YouTube all your questions and google then practice! All the time practice and take breaks too make sure to always be yourself but at the same time remember we can actually be who ever we want to be isnt that crazy? So that who you imagine you want to be in your head that bad add you wish to achieve to be like guess what? That's the real you. Get it. ",
            "date": "Answered September 1, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wooyoung Kim",
                "href": "/profile/Wooyoung-Kim-4"
            },
            "answer_text": "It is definitely possible, majority of us might not be able to live in a mansion and enjoy various 'luxurious' experience but making a living with fairly standard level isn't as hard as one might think. First thing you have to do is evaluation. Compared to other occupations, being musician isn't as hard as one would think. Aside from entry or non-skilled job out there, pretty much any profession requires some form of credentials, certificates, and licenses, which mean those people in the fields actually studied, practiced, and acquired both experiences and information whether they like their jobs or not. Having enough musicianship and information is must, this is just to set you on the startline since there's no way of telling who's good or not. If you make mistakes during practice, you will make one at the work. You really have to be very strict on you. Next would be treating your life as a musician more professionally. From social/professional relationship to personal life, you'd have to treat it like anyone out there who's successful in their fields. People used to talk about 10,000-hour rules, but average people with 9–5 jobs usually spend that much, or even more, for their jobs in about 5-year. In a way, musician isn't special, probably closer to average joe or even worse usually. Respect others for who they are, being punctual is given in any industry, not to mention presenting yourself accordingly including appearance and way you speak and behave. Be informed about what's going on around you and the world. Another one that you really need to pay attention is how to handle your music life as a business. Once you decide to pursue a career as a musician, you are becoming a business entity. Practice, recording, and performing or teaching should be the easy and fun part at this point. We are talking about tax, registration, contract, and everything in between. If you are not interested in more business aspect of music and would rather hire someone else means you just need to make way more. Know your right, decline any underpaid offer, negotiate, and make sure to know how to read contact and understand. Also, make sure to do tax. Now to be bit more specific, always try to write and record. Whether it's a demo, EP, or full-length recording, your craft belongs to you and will be a business card to represent you. If you are into teaching, write and prepare your own curriculum. I've been telling this to almost everyone who are trying to attend music school since they will have more resources handy, yet only a few decided to actually do it. Learning and covering other people's music is great but it is part of the 'practice', not career. You really need to have your own thing going on. It is indeed hard to write epic masterpiece from the beginning but that's exactly why we constantly try. Of course, this means you really need to carefully spend limited fund to acquire/update you as a business. Custom/luxury instruments are always tempting but it won't really help in your music life if you don't own any of descent recording equipment. Make some time to meet and engage with people in the industry, but put some distance. Connection is the key in any industry, it informs you even quicker than social media or news, often securing you a job. Remember, there's no ‘indeed’ or so kind of website to publicly post music exclusive work unless you are a teacher or so, many opportunities are still based on word of mouth and you need to let others know that you are available and capable. That being said, don't try to believe everything people say and use your own judgement.just like any other fields, there are always people who'd try to take advantage. Last but not least, make sure to update your repertoire and update yourself frequently. Try not to stuck at old files of music, check new ones out whether they are good or not. Listen to something that you usually don't listen, don't limit yourself by all means and practice/write to acquire something new to learn all the times. ",
            "date": "Answered September 1, 2020",
            "views": "45",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Metivier",
                    "user_href": "/profile/Bob-Metivier"
                },
                {
                    "user_id": "Lenny Rothbart",
                    "user_href": "/profile/Lenny-Rothbart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hal Cooper",
                "href": "/profile/Hal-Cooper-2"
            },
            "answer_text": "A lot of people are teaching. Even before the Rona, teaching was the best meal ticket. There are some on line concerts. It’s tough to get people to pay for a concert. People are involving various charity. There are some foundations. Earning a living has always been a thorn in the side for musicians. What we need are places like this: Musicians' Village - New Orleans Area Habitat For Humanity ",
            "date": "Answered September 1, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Igor Prpa",
                "href": "/profile/Igor-Prpa"
            },
            "answer_text": "By doing other things. I am musician too. Still, I make great living as a Shopping Sherlock app distributor and affiliate marketer. It give sme the all time to play and record without caring wheter I`m gonna make it as musician or not.Check this businesses that I do here: http://independent-entrepreneur.com/ ",
            "date": "Answered July 25, 2015",
            "views": "857",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Martin",
                    "user_href": "/profile/Robert-Martin-517"
                },
                {
                    "user_id": "Cam Nelson",
                    "user_href": "/profile/Cam-Nelson-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas McGregor",
                "href": "/profile/Thomas-McGregor-3"
            },
            "answer_text": "Try busking/street performing. I've seen some guys playing unusual instruments do very well in my city. Unusual instruments are ones that are unusual for busking. One guy had an upright bass and was making a killing playing some pop songs in our local bar area. There were plenty of drunk people throwing in $5's $10's and even $20's to hear certain songs. ",
            "date": "Answered July 12, 2015",
            "views": "567",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Natasha McNamee",
                "href": "/profile/Natasha-McNamee"
            },
            "answer_text": "Get a job that pays and sign up to a site that will distribute your music to places like Google play, ITunes, sound hound etc and they pay you for each download eventually if enough people notice you you may end up with a record deal that could make being a musician your full time job ",
            "date": "Answered August 4, 2016",
            "views": "510",
            "upvotes": "0"
        }
    ]
}