{
    "title": "How to improve my knowledge - Quora",
    "tags": [
        "General Knowledge",
        "Knowledge",
        "Learning New Things",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan R Strong",
                "href": "/profile/Jonathan-R-Strong"
            },
            "answer_text": "The most important thing I learned in school wasn’t any single topic or piece of information. What I learned was how to go about learning. It sounds simplistic, but if you have that kind of mindset, much of the rest will follow. I learned how to organize my thoughts around questions and topics. Instead of taking a question as literal and simplistic, I learned to think about the question in context: who was asking, why were they asking, and what did I think they actually wanted to know from an answer? Only then would I start researching and developing an answer. I learned to explore around the edges of questions and topics. What other topics might be related, and how? Such explorations have often led me to completely new topics to learn about. Going back to basics: read. Be voracious about knowledge. Before the Internet, I read newspapers 7 days a week. Now I browse multiple online sources daily, and read numerous articles. If a topic is interesting, I’ll save it, and follow up by doing additional searches and reading topical material in greater depth. If what you want to learn is related to a skill, then you must exercise that skill. The way to martial arts mastery is through practice - there is no substitute. If you want to learn about knife throwing, start practicing. Think about the topics you wish to learn. Search out sources, whether online, in books, via classes or on-the-job training, and find a way to immerse yourself. This has all be extremely general advice - but your question is also quite general. If you want to learn but don’t know where to begin, I suspect you’ll have to begin within, and try to figure out what it is you want to learn about. Once you’ve identified at least a starting point, you can pursue some of the suggestions above to expand on that initial topic. ",
            "date": "Answered September 19, 2017",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Josh Hill",
                    "user_href": "/profile/Joshua-Hill-396"
                }
            ]
        },
        {
            "author_info": {
                "name": "Say Keng Lee",
                "href": "/profile/Say-Keng-Lee"
            },
            "answer_text": "It's quite simple, actually! 1) Read, read, and read widely and deeply, all kinds of published works, mainstream as well as from  the  fringes, so that you can have sustainable intellectual horsepower. Always reflect on your reading, and think in terms of personal relevancy to action, as only action creates results. Knowledge is not measured by what's stored in the head; it's your productivity, i.e. what you do and what don't do! 2) Write, write, and write, so as to garner people's attention to your   evolving acumen and  growing expertise, which often can lead to more  public speaking gigs and consulting engagements. 3) Begin with a  warm, sincere and genuine interest in people all around  you, as people  are your greatest resource, as well as your wonderful  opportunities to learn, grow and change. 4) Don't forget to attend selected conferences, seminars and workshops to keep yourself abreast of trends and developments in your as well as outside your industry, as everything in business - as well as in life - is connected in some ways;  Naturally, don't hesitate to seek as much opportunities as possible to rub shoulders with like-minded professionals inside as well as outside your industry, with the longer-term view to gain diverse - or even contrarian - perspectives; 5) Always listen intently, and talk less. 6) Keep  learning - and doing - new things, so as to gain expanded  perspectives  and new experiences.  Evolving experiences = applied  knowledge! 7) Develop a idea/insight generating mindset and a  problem solving  attitude, so that folks around you can turn to you for  advice and help. Nevertheless, here are a few good tips for enhancing your idea/insight generation: - be acutely observant of your environment, by using all your senses;- be curious and inquisitive;- be open-minded to new and even radical possibilities;- suspend judgement;- make unlikely connections;- ask questions, all kinds, especially open-ended ones, like \"what if?\", \"why not?\",  \"So what?\", \"What now?\", etc.- think like a child, but don't be childish, so to develop the beginner's mindset;- learn to see things backwards, inside out, and upside down; inside the box as well as outside the box, plus no box at all;-   learn to see from atop; see ahead; see beyond; see behind; see   sideways; see beneath; see behind; see from within; and see through, so   as to develop multi-directional and multi-development viewpoints;- hitchhike; copycat; piggyback;  leapfrog on other peoples' ideas, as \"Ideas Build on Ideas\";- you can make use of the simple but proven SCAMPER technique [it dates back to the 1950's], to expand your idea generation;-  likewise, you may want to explore the more elaborate but proven CPSI  methodology of the US-based Creative Education Foundation, to expand  your idea generation;- for the more adventurous, you can also take a  look at the Synectics group brainstorming process, which also dates back  to the 1950's; 8) Go all out to share your knowledge, experience and acumen, locally and globally, orally or in written form, as \"Knowledge Shared is Power Squared\". 9) Make globetrotting a part of your expansive lifestyle, as continual interactions with diverse knowledgeable as well as ordinary folks around the globe often expand and rejuvenate your mental horizons. 10) Last but not least, be humble. Always remember, knowledge building and intelligence amplification is always a work in progress! ",
            "date": "Answered February 20, 2016",
            "views": "45",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mallika Verma",
                    "user_href": "/profile/Mallika-Verma-10"
                },
                {
                    "user_id": "Destini Rainey",
                    "user_href": "/profile/Destini-Rainey"
                },
                {
                    "user_id": "Saba Ri",
                    "user_href": "/profile/Saba-Ri-1"
                },
                {
                    "user_id": "Naresh Lakshminarayanan",
                    "user_href": "/profile/Naresh-Lakshminarayanan-1"
                },
                {
                    "user_id": "Balavinayagam Lenin",
                    "user_href": "/profile/Balavinayagam-Lenin"
                },
                {
                    "user_id": "Anna Huo",
                    "user_href": "/profile/Anna-Huo-2"
                },
                {
                    "user_id": "Lohith Chadalavada",
                    "user_href": "/profile/Lohith-Chadalavada"
                },
                {
                    "user_id": "Halwest Star",
                    "user_href": "/profile/Halwest-Star"
                },
                {
                    "user_id": "Ryunosuke Furiya",
                    "user_href": "/profile/Ryunosuke-Furiya"
                },
                {
                    "user_id": "Saquib Siddiqui",
                    "user_href": "/profile/Saquib-Siddiqui-1"
                }
            ]
        }
    ]
}