{
    "title": "How to make a burned DVD play in a DVD player - Quora",
    "tags": [
        "DVD Burning",
        "DVD Ripping",
        "DVD Players",
        "Blu-ray",
        "Burns and Burning",
        "DVD",
        "Do It Yourself (DIY)",
        "Videos",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pauli Vaara",
                "href": "/profile/Pauli-Vaara"
            },
            "answer_text": "If the disc has been burned and it doesn’t play on the player, there’s nothing to do anymore at that point. Some players (usually older ones) simply don’t play burned discs. The other option is that the disc hasn’t been burned with correct settings and file structure. Usually the burner software has options for what kind of disc you’re creating; in this case, you’d need to choose the option referring to video DVD. Just creating the disc like a data DVD, with just files or folders included, might lead to using wrong file system, or to some other issues. ",
            "date": "Answered November 29, 2019",
            "views": "121",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Sandoz",
                    "user_href": "/profile/David-Sandoz-1"
                },
                {
                    "user_id": "John Fishback",
                    "user_href": "/profile/John-Fishback-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derrik Pates",
                "href": "/profile/Derrik-Pates"
            },
            "answer_text": "It depends. Is it because the disc wasn’t authored correctly (wrong filesystem type, files in wrong places on disc, etc.) or because the player can’t read the disc? You’d have to figure out what it is. CSS, while required for pressed discs, is not required for burned media, so assuming it was authored correctly for DVD-Video (was it?), it should work, unless: The player is particularly old (the DVD readers in some old drives didn’t deal well with lower reflectivity, which is common with recordable media)You uses DVD+R or DVD+RW media in a player that doesn’t comprehend the + media variantsYou used a DVD-RW in a drive that doesn’t work with -RW mediaI’ve authored DVDs myself in the past that worked with every DVD player I ever tried, so I know it can work. ",
            "date": "Answered December 2, 2019",
            "views": "298",
            "upvotes": "0"
        }
    ]
}