{
    "title": "How can renewable energy help the people under the poverty line to generate income? What are the challenges and opportunities? - Quora",
    "tags": [
        "Renewable Energy",
        "Solar Energy",
        "Income",
        "Sustainable Technology",
        "Poverty"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Diesendorf",
                "href": "/profile/Mark-Diesendorf"
            },
            "answer_text": "Renewable energy is already helping people in many poor countries to become educated and to generate income through small businesses. A small solar PV module with small battery is quite cheap nowadays. Unlike kerosene lighting, solar provides bright light for studying, shops and simple tourist accommodation, without pollution. For peasant farmers with middle incomes upwards, solar runs irrigation pumps. In parts of India and Bangladesh, biogas from cow manure provides fuel for cooking with much less pollution than burning cow dung, leaves and twigs. However, it can only be used by rural people who have access to manure from a sufficient number of cows. In some rich countries, low-income people who are home-owners can purchase or lease rooftop solar PV with no up-front cost, paying it off, for example, on the local government rates. In some places, low-income people who rent their homes can obtain a share in a solar garden, receiving the benefits of cheaper, cleaner electricity. Solar gardens, with land (or rooftops) provided by local governments and businesses, are growing in numbers. ",
            "date": "Answered May 24, 2020",
            "views": "161",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Don Shiner",
                    "user_href": "/profile/Don-Shiner"
                },
                {
                    "user_id": "Micheal Hatch",
                    "user_href": "/profile/Micheal-Hatch-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Fortune",
                "href": "/profile/Bill-Fortune-5"
            },
            "answer_text": "renewable energy is a scam which makes the poor even more poor. There is no way in the U.S. for the poor to get above the poverty line. There are simply way too many bureaucrats/Green Lawyers & Phony Capitalists to support, to say nothing about all the other people that get a lot of money from the government & working poor. The amount of taxes required and the rate of tax increases rises faster than most people’s wages can ever rise. The more taxes on businesses the higher the Cost of Living for bureaucrats, so they need to get paid more. ",
            "date": "Answered May 23, 2020",
            "views": "17",
            "upvotes": " View 2 Upvoters"
        }
    ]
}