{
    "title": "How do people die of old age? What actually causes 'death from old age'? - Quora",
    "tags": [
        "Biology of Aging",
        "Senior Citizens",
        "Aging",
        "Age",
        "Human Biology",
        "Death and Dying",
        "Health",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin McLauchlan",
                "href": "/profile/Kevin-McLauchlan"
            },
            "answer_text": "QUESTION: How do people die of old age? ANSWER: Two things - exhaustionscarringWe are all familiar with young people thinking that they are invincible, or experiencing getting hurt and bouncing back quickly with “no ill effects”. The problem is that this is incorrect, as we are starting to see with the current media-mania about concussions. The issue is scarring. Every time you receive damage, the body heals itself (if able) at the damage site, knitting the organ (skin, bone, eye, kidney, lung, heart, brain, etc.) back together with scar tissue. A little extra goes a long way — just not as far as you imagine Almost every system in a young, healthy, human body has built-in over-capacity. You can take damage and return to normal function. What is not usually obvious is the cost. Each time you take damage, you are using up some of that over-capacity. Your leg gets broken, and you heal within weeks and resume activity. But decades later, an x-ray will show where the break happened. That’s because the bone is scarred. You drop your motorcycle (and yourself) on the road, and fetch up against something hard. Maybe you shake yourself and get the bike upright, and it’s workable, so you ride home in some pain. Your leathers (or Kevlar) saved you from major road-rash, except one forearm. You scare yourself by pissing bloody the next couple of days, but the bruising on your back takes longer to fade than the bloody pee. The road-rash on your arm (after you picked out the gravel and applied antiseptic) takes longer to heal, because it’s like a burn. But still, a few months later you can see only a slightly gnarly scar patch. You are a little more careful when you ride, in future, but other than some scraped paint, scraped leather, and such, it seems that no real damage was incurred. What you don’t see is that your delicate kidneys (the source of that bloody urine) have been stitched back together with scar tissue. No big deal, right? Well, probably not. If you underwent some testing right now, your kidney function would be reduced, because your kidneys are now normal kidney tissue interspersed with some areas of collagen “cement” where the damage occurred. Scar tissue does not function as anything other than physical structure and “glue”. It holds things together, but it doesn’t do what the thing it secures does (or did). Structure is not necessarily function Kidney scar does not work like kidney membranes. So now, you have (perhaps) 85-percent of your nominal kidney function. Because of the built-in over-capacity, that’s still more than enough for you to live a normal life, process your usual allotment of Friday-night beers, and so on. You might even survive another major body-blow episode and have your kidneys recover to 70-percent, and still not know that there’s permanent damage. Of course, some years later, your doctor tells you you have elevated blood pressure, and we can’t be sure if some of that is from damaged kidneys or if some of the kidney damage is from hypertension that went undetected for too many years. Oh well. You are still alive. But now you need to be really careful. Did you smoke? You know those commercials they used to show on TV with a blackened smoker lung, and then a pink-and-healthy lung a couple of years after cessation of smoking? Well, that was relative. If you compared the “pink-and-healthy” lung of somebody who smoked for a long time, then stopped for a few years, to the pink-and-healthy lung of somebody who had never smoked at all, you would be able to see the difference in scarring and shrunken or distorted alveoli of the former smoker. Still pink, but not as able to do the job of absorbing oxygen and releasing carbon dioxide. You can still train for a while and get up to jogging a few miles, but just not as many, and not as fast as some of your friends. Scarring. Danny boy, the pipes the pipes are clogging Do you still have a bit of that scar on your forearm from the long-ago road-rash? Well, you still have scarring elsewhere, too. Inside, where you can’t see it. The walls of blood vessels? Yep. Scarred and inelastic, so contributing to your elevated blood pressure and also preventing maximum blood flow when your brain and other parts need it most - so your aerobic capacity is reduced. And if they aren’t clogged, they’re turning into sieves Perhaps you were a bit gluten-intolerant, but ate bread and pizza and stuff anyway. So your intestines have been taking on irritation damage, and scarring for years and years. For a long time, your natural, in-built over-capacity let you keep eating and getting enough nutrition from the food that passed through. But now, you absorb the easy stuff (glucose), but other nutrients don’t get into your bloodstream as readily, due to all the scarring in your intestines - damaged, distorted, or missing villi. So you can still uptake more sugar/simple carbs than you need, and get fat and start becoming diabetic, but your absorption of minerals and proteins and other important larger molecules is hindered. You begin to see what I mean Your eyes have been viewing the world for decades, but remember when you decided that the small-lens sunglasses were cooler than those big, full-coverage aviator style sunglasses? Yeah. So the small dark lens allowed your pupils to expand on sunny days, but they let UV get in all around their inadequate perimeter. Your own internal eyeball lenses have begun to yellow and stiffen as the UV ages the once-clear protein. You need cheaters (librarian glasses) to see anything up close, because your eye muscles are no longer strong enough to bend the stiffened lens material for near focus, and because the yellowed lens protein cuts down the amount of light that gets through. You start turning on lamps just to read ordinary print. . . during the day. That’s a form of scarring. Have you heard? Sorry, did you miss what I just said? That’s because years of loud music or recreational shooting, or skydiving or motorcycling or standing by the third corner at the car races or operating shop equipment or yard equipment without earplugs have damaged the little auditory hairs in your inner ear, and the smallest ones died or got scarred-over first. Those are the ones that detect and convert higher frequency sound, like birdsong and the “bright” parts of recorded music, and like some sibilant and consonant sounds in ordinary speech. Especially women’s voices. Hearing aids are damn expensive, and only partially covered by the group insurance, it turns out. Also, don’t go swimming or forget to take ’em off before showering; you only get to do that once and then it’s full-pop, out-of-pocket for the replacements and no insurance coverage for at least four more years. Ouch. Could have bought a small car. It doesn’t necessarily start at the top, but it ends there Have we reached the brain yet? What, you forgot where we were? Scarring in the brain and the blood vessels that serve it, and in the heart muscle that pumps it, and in the lungs that are supposed to bring in the oxygen for the heart to deliver to the brain, etc. As you’ve aged, everything is harder, not just gross physical activity, but anything that uses all those systems that have been accumulating wear and tear … and scar tissue. So basically every function of your body is harder to accomplish. Everything takes longer, and has less capacity to do whatever-it-is, and takes longer to recover. Then you get another flu and maybe pneumonia while your lungs and immune system are already taxed by that flu. Did you put off that annual flu-shot just a little too long? Or just forgot to get it? Drat. Or maybe those years of smoking have finally rewarded you with emphysema. You can barely get out of a chair, and now an oxygen tank accompanies you everywhere. At first, it’s a supplement, but soon it’s necessary just to stay conscious and upright in your seat. TLDR - It gets worse until you give up This is how scarring of all your body systems turns into general tiredness, and eventually exhaustion. Comes the day when simply taking the next breath is just about all you can manage, and you wonder why you should bother doing it again. And then your caregiver is crying… in relief, that you finally croaked and she can try to put her life back together, now that her own health and sanity have been permanently damaged… scarred, you might say. Money can’t buy happiness, but… One of the reasons that the very rich live longer, is that their money lets them offload all the damaging physical labor that accumulates scarring in the young and foolish and in those of us who do physically demanding jobs or sports. Another reason, of course, is that they can afford the very best medical care with no waiting. But even they can’t eliminate the damage incurred while they were young and foolish, or from their own bad habits - just because they smoke a better brand than you did, doesn’t save them much when exhaustion comes calling. But when you are incapacitated by age, a boatload of money means the difference between still being able to participate in life, versus being shut away in a room. Regardless, except in cases of severe, fast-acting trauma (like accident, electrocution, or quick poison), everybody else dies of exhaustion. TIMELY UPDATE: April 2020 — Yes, that’s also how you die from Novel Coronavirus 2019, a.k.a. Covid-19. If you are lucky and get a mild infection, you just feel something ranging from almost nothing, up to and including miserable-and-scared for a week, followed by another week or two of weakness and tiredness, and then you resume normal life. If you are less lucky, your airway tissues are damaged enough by the virus itself, and by your body’s over-the-top response, that it lets pneumonia take hold. Now you are weakened by the virus and the lack of rest, and pneumonia fills your lungs with mucous and pus and you can’t seem to get a breath. Saying a few words to get a glass of water is too much. You struggle to sit up because only when your chest is vertical can you get even a little air inside you. The wracking coughs just won’t quit, so you can’t sleep. Everything hurts. You might crack a rib from the coughing. You have no interest in food. Every breath is labor and none is even remotely satisfying. If you are living alone, you might not try to dial 911 (or your country’s emergency number) until it’s too late, and you can’t. They’ll find your body when the smell starts to bother the neighbors. Or you’ll get to hospital in the late stages and they’ll try some drugs to relax your airways a little, but it won’t help much, and they’ll try the daytime version of Continuous Positive Airway Pressure (CPAP mask), but that will become less effective over the next few hours, so finally (if there’s any family to ask), they’ll have the talk about intubation - putting you on a ventilator. If there aren’t enough ventilators to go around, they’ll compare you with somebody younger or with fewer complicating factors and maybe you just won’t get a ventilator. They have to give the last-ditch chance to the patient with the best chance to recover. If that’s not you… Or you’ll get on it and the drugs will keep you semiconscious to quell the panic (from having the tube down your throat and the machine breathing for you), giving you a few more hours to keep fighting the virus. But your immune system is too slow at learning to make antibodies, so even the extra time they bought with the ventilator is not enough, and finally you just can’t find the strength to try for one… more… breath… and they call time-of-death and pull out the tube and wheel your corpse to the makeshift morgue (refrigerated truck), while the crew quickly cleans the room and the equipment for the next lucky participant in the Covid marathon. ",
            "date": "Updated April 4, 2020",
            "views": "227",
            "upvotes": " View 145 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vedant Gala",
                    "user_href": "/profile/Vedant-Gala"
                },
                {
                    "user_id": "Venky",
                    "user_href": "/profile/Venky-294"
                },
                {
                    "user_id": "Anvita Gupta",
                    "user_href": "/profile/Anvita-Gupta-9"
                },
                {
                    "user_id": "Swarnava Sarkar",
                    "user_href": "/profile/Swarnava-Sarkar-10"
                },
                {
                    "user_id": "Altansarnai Tsering",
                    "user_href": "/profile/Altansarnai-Tsering"
                },
                {
                    "user_id": "Lance Knuth",
                    "user_href": "/profile/Lance-Knuth"
                },
                {
                    "user_id": "Nicolas Miles",
                    "user_href": "/profile/Nicolas-Miles-2"
                },
                {
                    "user_id": "Liz Marsh",
                    "user_href": "/profile/Liz-Marsh-1"
                },
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                },
                {
                    "user_id": "Harshit Sinha",
                    "user_href": "/profile/Harshit-Sinha-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Maloney",
                "href": "/profile/Christopher-Maloney"
            },
            "answer_text": "Death of old age encompasses our denial of death itself. Denying that death is inevitable and pretending that we are treating this diagnosis or that diagnosis without looking at the patient as a whole allows us to pretend that we will not ultimately \"fail\" all of our patients.   \"Sherwin Nuland, an American surgeon, has made the point that death in old age is often a protracted affair, rather than a clear-cut process...He quotes an elderly patient as saying ‘Death keeps taking little bits of me’. Her physician commented: ‘She saw that with each attack of dizziness or fainting or confusion she became a little older, a little weaker and a little more tired. She knew that for ten years or more, she had been moving step by step towards the grave.’ Nuland quotes Osler as saying: ‘These people take as long to die as they did to grow up.’\" (What happens when elderly people die?) My own recent experience with watching a patient spend a year-and-a-half on hospice (yes, normally hospice is over in a week to ten days, but six different doctors were involved and she was getting excellent care) supports the idea of reversing the growth process. She became more and more dependent on her daughter, slowly suffered more incontinence, more inability to care for herself. Six times she went into failure of one type or another, usually in response to a change in medication. Once the change was reversed, she would rebound. Even at the end, when all muscle tissue was nearly absent, she would at times lift herself from the bed and have moments of lucidity, laughing and talking with the home-care nurses. The process included times when she was deaf and then regained her hearing, times when she was in agony and other times when the pain medication did not seem to be necessary. At the end, she became more and more tired, sleeping for longer and longer periods. The last time she awoke, she and her daughter had a lovely chat. Then she went back to sleep. While it was the death her daughter wanted to give her, it took enormous effort to keep the patient in the home and every time she left for nursing care she went into failure within a day or two. So I would presume that death by old age is no longer a common diagnosis. But the death I observed would fall into the second category:  \"Lynn7 noted that function and symptoms at the end of life generally follow one of three trajectories—(1) a short period of obvious decline at the end, typical of cancer; (2) long-term disability with periodic exacerbations and unpredictable timing of death that characterize dying with chronic organ or system failures (some cancers that respond to treatment and then relapse come into this category); (3) self-care deficits and a slowly dwindling course to death from dementia.\" (What happens when elderly people die?) ",
            "date": "Answered April 12, 2015",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sourav Das",
                    "user_href": "/profile/Sourav-Das-1433"
                },
                {
                    "user_id": "Nicolas Miles",
                    "user_href": "/profile/Nicolas-Miles-2"
                },
                {
                    "user_id": "Ethel Bentancourt",
                    "user_href": "/profile/Ethel-Bentancourt"
                },
                {
                    "user_id": "Neha Kumaran",
                    "user_href": "/profile/Neha-Kumaran-2"
                },
                {
                    "user_id": "Martin Ariola",
                    "user_href": "/profile/Martin-Ariola"
                }
            ]
        }
    ]
}