{
    "title": "How to safely clean inside a computer - Quora",
    "tags": [
        "Computer Maintenance",
        "Computer Hardware",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Coba Weel",
                "href": "/profile/Coba-Weel"
            },
            "answer_text": "Taking care of your own safety Pull the plug. That makes sure you don't electrocute yourself, usually. There is one situation in which you still need to be careful even if the device is not connected to a power source: if your computer has a CRT monitor in it, like the original iMac. In that case, there are capacitors that could have dangerous charges on them even after you pull the plug. Otherwise, though, pulling the plug is usually adequate protection. The safety of the device In order to make sure you don't damage the device, you want to make sure that you don't damage connections, and don't introduce static electricity.  If the computer you are cleaning is a typical desktop model, it is most likely designed so that you can take the case off without damaging connections pretty easily; usually, these days, the number of screws to be removed is pretty minimal, and there is some panel that slides off. You don't want to touch any chips, or things that are connected directly to chips, without first touching the metal case. That should discharge static electricity. Anti-static wristbands are even better. Fortunately, you don't really have to touch anything. Instead, you are going to get a can of compressed air. Places like Fry's and Microcenter have it near the checkout, and you should also be able to find it in general purpose stores, or, if all else fails, on amazon. It's not actually air but some other gas that compresses better, which you probably don't want to inhale directly, but otherwise it's pretty harmless to work with. You use the compressed air always in short bursts, and whenever the can gets cold, you have to wait for it to warm up again, for otherwise the contents comes out as a liquid, which isn't useful. (You can alternate between two cans if you don't like waiting.) Holding a vacuum cleaner hose near the place where you are dusting is a good idea if there's lots of dust, so that it disappears into the vacuum and not into your nostrils, but it's strictly a means of disposing of the dust, not a way to get it to come out of its hiding place: vacuum cleaners suck nowhere near hard enough for that, and you need the compressed air. The typical places where dust accumulates are on and around fans and between the metal fins of heat sinks. With laptops, it can be tricky to take them apart without damage, but fortunately, they are so densely packed with components that you don't have to take them apart to clean them, as the only places where dust usually gets are reachable with compressed air through air vents. If you do have to open a laptop, though, you're usually well advised to find a repair manual or other such document outlining (dis)assembly step by step. ",
            "date": "Answered March 9, 2012",
            "views": "647",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rick Morris",
                    "user_href": "/profile/Rick-Morris-127"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Maxwell",
                "href": "/profile/Richard-Maxwell-23"
            },
            "answer_text": "You can try cleaning the computer without opening the case, but it will not be very effective. To clean out the case, you need to open the covers up. If you are nervous about opening the case, just be careful and take your time. If you are concerned about pulling something loose, just keep your hand outside of the case and just use the air can to blow the dust loose, you shouldn’t have to reach inside to clean it. While it is nice to get rid of all of the dust inside, just removing most of the dust will help keep it cooler. The cables and such inside of the computer can withstand some bumping and wiggling and not get disconnected, but again if you are nervous about it, just keep your hands and the can of air outside of the case and you should be fine. As the other two have said, the first thing would be to purchase a can of compressed air. After that, shut down the computer and unplug the power cord from the computer (Or from the wall, the end result is the same). It would be better to do this outside or in a room such as a car garage, the dust a computer can collect up can create an impressive dust cloud when you start cleaning it. Newer computer cases will likely have a button or a slide, on the top or back side, you can use to open the side of the case up without any tools.  If it doesn’t have that, there are usually two screws on the back of the case that you need to remove and then you can slide the side panel off. Generally the screws are Phillips head screws so have a screw driver handy. Again, some of the newer cases have large screw heads you can grasp with your fingers and remove.  Once you have the cover open, you can use the can of air to blow the dust off of the components and from the vents and fans. I always would start at the front and top of the case and work my way down and towards the back of the machine. You can clean it out in whatever way works best for you. As long as you are not trying to shove the can inside the case or are trying to use the straw from the air can to pick out dust, you shouldn’t have to worry about disconnecting anything. Don’t just hold down the button and spray, use short bursts (1/2 second or so) from the can of air. Think of it like using a can of spray paint, short bursts instead of just holding the button down continuously. Spray it for a second and let the dust settle some then spray again. You can hold it down longer if you want or need to, it won’t hurt anything, it just uses the air in the can faster if you just hold it down. If there are larger clumps of dust, pull them out with your fingers instead of trying to use the air. Here is a link for how to clean out a computer, it may not be exactly your brand of computer but the concepts are pretty much the same. Cleaning the Interior of your PC Good luck and if you are too nervous about opening the case, ask a friend. ",
            "date": "Answered May 31, 2017",
            "views": "424",
            "upvotes": "0"
        }
    ]
}