{
    "title": "How to get free Apple products in 2020 - Quora",
    "tags": [
        "2020 (year)",
        "Free Products",
        "Apple (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chandler Pilipis",
                "href": "/profile/Chandler-Pilipis"
            },
            "answer_text": ". . . Begging? There's no secret trick or gateway to an apple product that's totally free without strings attached, save for maybe the trash heap, where you might find an Apple III that was thrown out 40 years ago because the piece of crap kept overheating and some businessman wasn't having it that day. People just don't give stuff out for free with the expectation of nothing in return. Anyone who poses that way to you is misleading you and attempting to scam you. I can tell you how to get an apple product for dirt cheap, though: you buy old and used. The only Apple product I ever willingly spent money on was a 2006 MacBook I found on eBay for $50 back in 2017. “Sweet”, I thought, “This'll be a perfect machine to run a really old version of MacOS on!”. Eventually I ran Linux on it instead because running a really old version of MacOS isn't all that when there's not a single functional web browser for it that is still supported, and web browsers are sort of important. But, it was useful for programming, web browsing, and really light retro gaming. It also had a neat little keyboard, and was really small and convenient to carry around. It was reasonably well built and still had that Apple quality to it, and if I really just needed access to Garage Band or something, the older version of MacOS would have been perfect. You go on eBay and you shop around for a $100 apple product, and you'll get a nice little machine that's past it's prime in terms of power and performance, but still well built, and still fairly useful if you just need a cheap computer with spare parts plentiful for you to perform repairs. Plus, a lot of Apple's downward spiral of ultra pretentiousness and bad design decisions didn't really start until after the 2010’s, so buying an Apple computer that old gets you the best of Apple's design without any of the crud that comes with their newer offerings. ",
            "date": "Answered June 6, 2020",
            "views": "569",
            "upvotes": "0"
        }
    ]
}