{
    "title": "How to tell if someone is tracking my text messages on my cell phone - Quora",
    "tags": [
        "Tracking (physical)",
        "Texting Etiquette",
        "Text",
        "Messaging",
        "Text Messaging",
        "Software and Applications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnny B. Appleseed",
                "href": "/profile/Johnny-B-Appleseed"
            },
            "answer_text": "haha, I have this problem. i do love a raging paranoia. I notice that my messages change, numbers that I have called wont be there, websites I never searched will be under history, there is a “parent/ child node” reference in the coding of the phone, contact names will change from “Name” to “_________”, whole message sections will disappear, I save all my messages, so when I have a conversation with a female over “her talking to my mother and about my mother lying to her”, and then I realize that she was talking about her boyfriends mother, but stay close to the text as if she was really talking to me. She would come over and say she loved me, (as a friend though), but loud enough so the pervert neighbors that were listening could hear and record it for some odd reason like; trying to make it seem like she was my grilfriend, with the texts, and to the neighbors, when she was a “friend” trying to steal money from the government and blame me. Those texts, the one about my mother, disappeared. GONE! This is my psychosis, and it is not drug induced. It is because I never went to jury duty….shhhh tell no one, or i keeeeel you! Is your paranoia like my paranoia? If so, we should totally swap anecdotes. I have a great noid about my mail being stolen….if youre interested…OK-bYe weeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee…. ",
            "date": "Answered August 27, 2017",
            "views": "118",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Boyd",
                    "user_href": "/profile/Joshua-Boyd-114"
                },
                {
                    "user_id": "Abraham Davis",
                    "user_href": "/profile/Abraham-Davis-19"
                },
                {
                    "user_id": "Victoria Anne",
                    "user_href": "/profile/Victoria-Anne-27"
                },
                {
                    "user_id": "Jack Frost",
                    "user_href": "/profile/Jack-Frost-873"
                },
                {
                    "user_id": "Amber Flores",
                    "user_href": "/profile/Amber-Flores-13"
                },
                {
                    "user_id": "James Hargett Seal",
                    "user_href": "/profile/James-Hargett-Seal"
                },
                {
                    "user_id": "Theresa Uzhca",
                    "user_href": "/profile/Theresa-Uzhca"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Parker, PGA",
                "href": "/profile/Don-Parker-PGA"
            },
            "answer_text": "Do your feet get itchy? when you're in a public, do you ever just see someone near you, quietly reading, but wearing dark glasses that he/she/(it??) never come off? Yeah, I have no idea. Sorry. ",
            "date": "Answered September 18, 2016",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Franklin Simpson",
                "href": "/profile/Franklin-Simpson-7"
            },
            "answer_text": "I thought I know him, I gave him everything I have more then anything. I gave him a child and he went to visit his family in Africa and when he come back everything changed. He wanted out. I gave him space about 6 years and we got back together last year and in June I found out I'm pregnant with twins. The worst thing happened to me I found out he was married when he was in Africa, that was through the help me Markfagertech on google mail com. I'm so broke in pieces I was with this person since I was 19 and I'm 28 now soon will be with 3 kids. I'm hurt and scared being alone. ",
            "date": "Answered February 18, 2020",
            "views": "598",
            "upvotes": "0"
        }
    ]
}