{
    "title": "How good is ColourDrive services ? - Quora",
    "tags": [
        "ColourDrive",
        "Decorative Painting "
    ],
    "response": [
        {
            "author_info": {
                "name": "Akash Solanki",
                "href": "/profile/Akash-Solanki-41"
            },
            "answer_text": "I contacted ColourDrive for our house painting work exterior. I am very much happy for choosing them to this job. Worth for money and reasonable quote for work he committed. ColourDrive have nice professionals and care for your concerns and comments on his work. They took special interest in suggesting me good color choice. ColourDrive have good expertise on painting job and have highly skilled labors. I am happy overall as work completed in time with fine finishing. They are trusted , committed to get perfection at work . Thanks to ColourDrive for being patience and get my work done without charging extra. ColourDrive is the best choice for now and my future painting works too ;)  ",
            "date": "Answered June 26, 2018",
            "views": "361",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samyakth Jain Hc",
                    "user_href": "/profile/Samyakth-Jain-Hc"
                },
                {
                    "user_id": "Santosh Parmar",
                    "user_href": "/profile/Santosh-Parmar-1"
                },
                {
                    "user_id": "ColourDrive SEO",
                    "user_href": "/profile/ColourDrive-SEO"
                },
                {
                    "user_id": "Harish Panwar",
                    "user_href": "/profile/Harish-Panwar"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ColourDrive-1"
                },
                {
                    "user_id": "Rahul Parmar",
                    "user_href": "/profile/Rahul-Parmar-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nitin Shetty",
                "href": "/profile/Nitin-Shetty-134"
            },
            "answer_text": "They have a bunch of incompetent unprofessional team in Mumbai I had hired them in the month of March'20 for painting services for my 2 bhk flat in Virar. I had paid them 80% of the cost a day before lock down and they worked for 4 days for about 5 hours each day and did not even complete 20% of the work I. e. they had applied just one coat putty that was also incomplete in the living room. I later followed up with Jitendra Tiwari their sales person and Navnath Kalel onsite supervisor to get the work completed in the month of Aug'20 as in between lock down from 25th Mar to 20th July'20 they did not bother to call me back to start off and complete the work. Around 15th August'20 I spoke to their Mumbai business head Sachin Pawar to refund my full payment of Rs. 33,200/- as their supervisor Navnath was stuck in his village Satara for more than 3 months and unable to arrange manpower to complete my work. After 2 weeks after multiple follow ups I was refunded just Rs. 10k instead of the full amount stating pathetic excuses. I would like to state hereby kindly do not avail any services from Colourdrive as they are highly unprofessional and cannot live up-to their commitments. The reviews stated on their website stating and boasting about themselves and their good work seems fabricated as you cannot post an honest review as they want to hide their in competencies about their team and company in public. Regards, Nitin Shetty ",
            "date": "Answered September 5, 2020",
            "views": "24",
            "upvotes": "0"
        }
    ]
}