{
    "title": "How does one look up patents by company that holds them? - Quora",
    "tags": [
        "Patent Litigation",
        "Patent Law",
        "Patents",
        "Intellectual Property Law",
        "Intellectual Property",
        "Litigation and Lawsuits",
        "Invention and Inventions",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew King",
                "href": "/profile/Andrew-King-319"
            },
            "answer_text": "Inventors and entrepreneurs who are looking to cut costs frequently want to do their own patent search. This is a wise first move, because patent searches are critically important. But inventors need to be careful. It is quite common for inventors to do a patent search and find nothing even when there are things that could and would be found by a professional searcher. So while it makes sense to do your own search first, be careful relying on your own search to justify spending the thousands of dollars you will need to spend to ultimately obtain a patent. In other words, nothing in this article should be interpreted as me suggesting that inventors can or should forgo a professional patent search. There is simply no comparison between a patent search done by an inventor and a patent search done by a professional searcher. Having said that, every inventor should spend time searching and looking for two reasons: (1) spending time patent searching will familiarize you with the prior art; and (2) patent searches inform you on the prior art so you can focus on what makes your invention unique. Of course, if you can find something that is too close on your own you save time and money and you can move on to whatever invention/project is next. If you are going to do your own searching and find relevant patents you are going to need to learn some strategies, and also about the free tools that are available to you. If you are going to do your own preliminary patent searching you will want to take a look at the United States Patent Office patent search page. A lot of information can be found free, and the system is not terribly difficult to use. There is also an excellent Help Section on the Patent Office website to educate inventors on how to use the online search features. There is also another excellent (and free) site that you should use when searching – Free Patents Online. Whenever I search tend to use Free Patents Online, simply because it is easier to access the patent illustrations. Which leads me to one of the best things about Free Patents Online — they provide copies of the actual PDF documents, which is why it is easier to obtain access to the images. Using the images on the USPTO website to obtain these full text PDF documents that contain the images is cumbersome to say the least. Free Patents Online is also normally much faster than the USPTO site as well. Having said that, I sometimes find the patent search engine of the Patent Office better. Nevertheless, when I use the USPTO patent search engine I go to Free Patents Online for the PDFs and to access related patents, which is much easier because everything at Free Patents Online is hyperlinked. So once you find a handful of relevant patents definitely go to FPO so you can easily jump back and forth and look at the patents that are cited in each relevant patent you find. In other words, I suggest that you consider using the strengths of both the USPTO and Free Patents Online sites to make your searching easier. Google also offers Google Patent Search, which is lightening fast (unlike the USPTO online database) even compared with Free Patents Online. The reason I don’t suggest this search tool first is because the Google Patent Search engine has some serious limitations. The number of fields that can be searched pales in comparison to the USPTO or Free Patents Online. Thus, if you are going to use Google Patent Search it is probably best used initially because when you start a search you want to cast a very wide net, so the limitations of the field search are probably not as important initially. As you start to want to search for specific things, perhaps terms within a particular part of a patent or patent application, the Google tool is just not very useful. Another thing you MUST know about when you use Google Patent Search is that there are also some holes in the database. I have specifically looked for patents I know to exist and cannot always find them. I have heard the same experience from other patent attorneys and patent agents. Additionally, the most recent patents are not always available on Google. What this means is you cannot only rely on Google, but you still must use Google. The Google database covers patents that are issued all the way back to US Patent No. 1. This scope is much broader than either Free Patents or the USPTO. So while you might not find everything, while it is difficult to specifically narrow your search, you still really need to check yourself using the Google database to see if there are old references that might be on point. When using the USPTO search features, either at the USPTO website or on Free Patents Online, one trick to improve search quality is to start by using the Advanced Search Page and searching in the specification field. Lets say, for example, you are looking for patents that relate to insulated containers for carrying beverages. In order to do this you will first need to pick a term or phrase that might appear within the written description of issued patents. Following this example, you might try in the search box – SPEC/”insulating beverage container”. When this search was conducted (on June 30, 2015) the results returned a list of 27 patents issued since 1976 that have used that phrase in the specification. This points to the first problem encountered by doing your own patent search online at the USPTO. You can only do full text searching back to 1976. This is probably not too much of a concern for those operating in the high-tech sector, but important to known nonetheless. The fact that you can only search going back to 1976 can be extremely detrimental if you have a mechanical invention or gadget. It is not at all uncommon — in fact it is extremely common — for inventors in every generation to seek solutions for the same or similar problems, which leads to the same or similar solutions/inventions. In this case there are not many to choose from. Many times, however, the list will contain hundreds or even thousands of patents depending upon the popularity of the term or phrase selected. For example, if you search “SPEC/thermos”, you will find hundreds of patents that use this word in the specification. In fact, at the time this sample search was conducted (June 30, 2015) no fewer than 1144 US patents have the word “thermos” in the specification, and that is only for patents issued since 1976. So what should you do now? If you find too many patents, rework the specification field search. For example, if your search were “SPEC/thermos and SPEC/beverage” you get down to 241 US patents. Ultimately, upon receiving manageable results, just click on several of the patents. The key, however, is to start off broad and then narrow your way down to those that are the most likely relevant references. Before going any further it is worth pointing out one major problem associated with inventors doing their own search. What you are doing, at least in the first instance, is a keyword search. Perhaps the reason there were only 27 issued US patents found that use the term “insulating beverage container” in the specification is because that isn’t the proper, or at least most common, way that patent attorneys and patent agents typically describe that particular feature set. This means it is essential to try a variety of different keywords in your search. I’ve done searches myself using keywords in the past and haven’t been able to find anything when I knew there should be a universe of prior art to find. Once you stumble on the proper keyword combination the doorway starts to open. Even with the best keyword combination the doorway only starts to open. To do a competent search you must do more. For example, once you receive manageable results you need to read the patents and see which ones are relevant. Always remember to try various search terms to make sure you are covering all possible descriptions of the invention. Along the way, as you read the patents and identify related ones keep track of the numbers and identify the US classification that relates to the type of invention you are searching. Upon identifying several US classifications that seem to relate to your invention, return to the Advanced Search Page and do a classification search. For example, again following our example from above, you may notice that classification 206/545 seems relevant to the area of insulated beverage containers. As it turns out, this classification relates to special receptacles or packages with an insulating feature. See US Classes by Number & Title. Therefore, it would seem that patents within this classification are potentially highly relevant. So return to the Advanced Search Page text box and enter “CCL/206/545”. This will search for all the patents classified in 206/545, which as of the time the search was conducted resulted in 156 US patents. You can also add to a classification search to narrow. For example, if you search “CCL/206/545 and SPEC/beverage”, you get down to 55 US patents issued since 1976. Even as the old US classification system becomes obsolete the same will work with respect to the CPC classes. You would just use “CPC/” and the classification number without the numbers in parenthesis. Admittedly, becoming familiar with the intricacies of doing a quality US patent search on your own will take time. Also, when searching using the USPTO system there are a number of fields that are searchable through the Advanced Search Page, which means that there are any number of ways to begin to tackle any search. If you are a serial inventor it is probably worthwhile spending time becoming acquainted with this and other ways to search. Having said this, however, if you are not intimately familiar with both advanced searching techniques and the classification systems, you are almost certainly going to miss what you are looking for in your own search. While it is advisable for every inventor to at least do a preliminary search on their own, it is not uncommon for inventors to do a search and find nothing. Every time I do a patent search I find patents that were findable in the Patent Office database, but not located by the inventor. Sometimes those patents are tangentially related, sometimes they are quite close and sometimes they are exactly what the customer has invented. This is no doubt caused by the fact that a patent search is akin to searching for a needle in a haystack. That is why the best money you can spend is to hire a professional patent searcher. Any successful search must use rely upon classification searching. While the classification system is helpful, never forget that patents are classified as the Patent Office sees fit. In order to identify the appropriate classification a broad search is necessary to make sure you familiarize yourself with how inventors and patent attorneys routinely characterize certain inventions, features, scientific principles and concepts. Only after you have a broad idea of all possible descriptions can you meaningfully search the classification systems. Having said this, let me acknowledge that some will disagree with this last statement. Frequently a patent classification search is the only type of search that is conducted by individuals who are professional patent searchers. It is important to realize, however, that a professional searcher only searches for a living and is far more familiar with the classification system than any inventor or even any patent attorney. I also want to point out that even if you think you are familiar enough with the classification system, you are not!  Take a look at this patent: US Patent No. 6,619,810 Halloween treat carrier Issued September 16, 2003  This invention, according to claim 1, is “a container having thereon a Halloween design, wherein the container and/or the Halloween design comprises a glow-in-the-dark material.” While this invention is outrageous and it is ridiculous that it was ever patented, that is not the point here. The point is with respect to the US classification for this patent. Prior to reading on, go to the US classification menu on the Patent Office website. Take some time and try and figure out what classification this invention would best be placed in. What you will find, I suspect, is that using the classification system in the first instance is at best cumbersome. Now I invite you to review the patent. Notice that the US classification for this patent is 362/84 and 362/156. Notice that 362/84 is in bold. This means that it is the primary US classification for this invention. If you look at class 362 you learn that the class is broadly titled “Illumination.” The subclass of 84 relates to “Light source or light source support and luminescent material.” The secondary subclass of 156 a container, specifically a “bag, purse or trunk”. When looking at this particular invention in the first instance how many would have thought that this invention would best be described as a light source support and/or as an invention related to illumination? I doubt many would. Of course, when I asked the patent searcher I used this question, off the top of his head and without any preparation he named the classification immediately. The point with this exercise, however, is to illustrate that finding a classification number first is difficult if not impossible when you are engaging in patent searches infrequently. It is always more wise to broadly search, perhaps searching the specification (using SPEC/) and find somewhat relevant patents. Then with respect to the most relevant patents, make note of their classification numbers and then search those numbers. The reason individual inventors do not find the most relevant patents is because they almost always fail to follow up the broad search with a classification search. In every patent search I can remember doing the most relevant patents were not discovered until I identified the most likely classifications and did a classification search. Also remember that it is critically important to figure out what things are called. I cannot stress this enough. You need to use different names and labels. You will find that patent attorneys typically call certain features by a select few names. These names are not always obvious, but once you figure out what the industry calls something you are far more likely to find relevant patents. ",
            "date": "Answered June 27, 2018",
            "views": "69",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Claire Fisher",
                    "user_href": "/profile/Claire-Fisher-96"
                },
                {
                    "user_id": "Paul Robin",
                    "user_href": "/profile/Paul-Robin-8"
                },
                {
                    "user_id": "Dusk Banks",
                    "user_href": "/profile/Dusk-Banks-1"
                },
                {
                    "user_id": "Jose Luis Gonzalez",
                    "user_href": "/profile/Jose-Luis-Gonzalez-6"
                },
                {
                    "user_id": "Mason Biegel",
                    "user_href": "/profile/Mason-Biegel-2"
                },
                {
                    "user_id": "Ashu Jain",
                    "user_href": "/profile/Ashu-Jain-117"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raad Ahmed",
                "href": "/profile/Raad-Ahmed"
            },
            "answer_text": "There are a bunch of websites to help you search! I’ll quickly compile the list of sites already suggested by others and add a few that I have used but have not been mentioned: United States Patent and Trademark Office (USPTO) - Assignment Search is a search engine that allows you to simply search by the company nameGoogle Patent SearchFreePatentsOnline.comPatexia.comPlainSite.orgPatentsSearcher.comRPXHowever, as Brandon noted in a prior post, searching a company name on these sites may not always yield results. Instead, the patent may be held by an investor, board member, or an affiliated company. That being said, I would suggest another option than the various search engines to ensure you don’t miss anything by “doing it yourself.” We at LawTrades provide entrepreneurs and inventors with a free patent search using one of our experienced patent attorneys. After the search, we'll provide you with a fixed fee price quote should you decide to hire the attorney to file the patent on your behalf. Since we don't have the overhead of traditional law firms, we're also about 60% more affordable than normal rates. We've helped entrepreneurs secure 100's of patents, so if you have any other questions, don't hesitate to reach out. ",
            "date": "Updated December 2, 2016",
            "views": "145",
            "upvotes": " View 55 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashish Madkaikar",
                    "user_href": "/profile/Ashish-Madkaikar-1"
                },
                {
                    "user_id": "Pranav Sreedhar",
                    "user_href": "/profile/Pranav-Sreedhar"
                },
                {
                    "user_id": "Alauddin Husaini",
                    "user_href": "/profile/Alauddin-Husaini"
                },
                {
                    "user_id": "Shrinivas Hegde",
                    "user_href": "/profile/Shrinivas-Hegde-5"
                },
                {
                    "user_id": "Kevin Murray",
                    "user_href": "/profile/Kevin-Murray-10"
                },
                {
                    "user_id": "Gunjan Mehta",
                    "user_href": "/profile/Gunjan-Mehta-25"
                },
                {
                    "user_id": "Ibrahim Adeniji",
                    "user_href": "/profile/Ibrahim-Adeniji-1"
                },
                {
                    "user_id": "Pedram Sameni",
                    "user_href": "/profile/Pedram-Sameni-1"
                },
                {
                    "user_id": "Hega Merou",
                    "user_href": "/profile/Hega-Merou"
                },
                {
                    "user_id": "Red Legal",
                    "user_href": "/profile/Red-Legal"
                }
            ]
        }
    ]
}