{
    "title": "How about RFID in guns? - Quora",
    "tags": [
        "Radio Frequency Identification",
        "Ideas",
        "Gun Control in the United States of America",
        "Guns and Firearms",
        "Crime"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Fogh",
                "href": "/profile/John-Fogh"
            },
            "answer_text": "You need to understand a little bit about how RIFD actually works: An RFID tag provides the reader with a number. That number being connected to anything (like a serial number or a person) is a function of a database. Say you have an RFID tag on your work laptop that happen to carry with you when you pick up your kids from school. The RFID reader just knows \"I read a tag\" it doesn't know what the tag is associated with, so you have just generated a false positive if you assume that every tag is a gun. RFID is hard to get working when attached to metal, and metal-mount tags need to be pretty large. Putting a tag inside of a gun is probably not feasible. RFID is not super long range. You might be able to detect a tag at about 30 feet in real world conditions. Radio frequency interference and objects between the tag and the reader's antenna will impact this distance. As you increase the distance from the antenna to the reader you loose detection range as well.   There is nothing inherent about a firearm that requires a tag to be in place, so removing the tag wouldn't effect the operation of the firearm. Chris Everett really made the ultimate point: so you detected what you believe is a gun, now what? Swift response is much more of a factor than detection. Detecting a gun a second or two sooner doesn't improve the response by a measurable amount. ",
            "date": "Answered December 18, 2014",
            "views": "182",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dan Homeyer",
                    "user_href": "/profile/Dan-Homeyer-1"
                },
                {
                    "user_id": "Tim Furgerson",
                    "user_href": "/profile/Tim-Furgerson"
                },
                {
                    "user_id": "Chris Bast",
                    "user_href": "/profile/Chris-Bast"
                },
                {
                    "user_id": "Nayab Saiyed",
                    "user_href": "/profile/Nayab-Saiyed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Everett",
                "href": "/profile/Chris-Everett"
            },
            "answer_text": "Problems with this plan: 1.  Getting an RFID chip in every gun.  There are probably a billion guns in circulation.  Even if you manage to pay for that, how do you get those all installed?  Especially when guns are held by people who don't WANT them installed.  Further, guns aren't made in a handful of factories where it would be easy to enforce putting them on new guns.  They are made in thousands of small factories, and even by individuals in primitive environments.  2.  RFID sensors would have to be installed in every school, at every entrance, and all networked together, and connected to the local police.  Again, expensive, and has to be maintained.   3.  Okay, you've detected a gun...  Now what? You still have to send the police to actually do something.  So while this plan may cut a few seconds off of response times, that's really all you accomplish. 4.  Gun users don't want technology on their gun that can remotely disable them.  Any such technology would be taken advantage of by bad guys.  Imagine if the responding officers in Pakistan suddenly found that their guns didn't work!   5.  Connected with #4, it's very hard to imagine a way to electronically disable a firearm in a way that's not fairly easy to bypass.  And if your planning a terrorist attack, you almost certainly would. In conclusion, while it's tempting to turn to technology to solve this problem, smart guns really don't solve it, and tend to cause more problems than they actually fix. ",
            "date": "Answered December 17, 2014",
            "views": "194",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dan Homeyer",
                    "user_href": "/profile/Dan-Homeyer-1"
                },
                {
                    "user_id": "Perry Lee",
                    "user_href": "/profile/Perry-Lee-36"
                },
                {
                    "user_id": "Tim Furgerson",
                    "user_href": "/profile/Tim-Furgerson"
                },
                {
                    "user_id": "Chris Bast",
                    "user_href": "/profile/Chris-Bast"
                },
                {
                    "user_id": "John Tiller",
                    "user_href": "/profile/John-Tiller-3"
                },
                {
                    "user_id": "Kyle Lee",
                    "user_href": "/profile/Kyle-Lee-32"
                },
                {
                    "user_id": "Nayab Saiyed",
                    "user_href": "/profile/Nayab-Saiyed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Moss",
                "href": "/profile/Peter-Moss-37"
            },
            "answer_text": "We can all wish for things but part of that should be knowing why you want that wish. Exactly what will this RFID do to help? Do people just dream this stuff up as a good idea…. Seriously you have made a fundamental error in thinking, tracking a gun, any gun is going to do something of use. Besides the total lack of use there are several billion firearms? Who is going to pay for all the equipment logistics and software for this assuming it was even possible. I’m pretty sure you would like to reduce crime and to do that the first thing you need to remove entirely from your mind is anything to do with gun control. That has already proven totally ineffective simply because guns do not cause crime and a causal relationship is needed. I wish for a frontal lobotomy for…. no never mind. I’m assuming they have a brain and it will make a difference. ",
            "date": "Answered February 7, 2020",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Garry Billick",
                    "user_href": "/profile/Garry-Billick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jesse Spurgeon",
                "href": "/profile/Jesse-Spurgeon-1"
            },
            "answer_text": "There actually are already some guns with RFID chips, it is part of how the factory tracks the units during assembly and shipping. There was some customer paranoia/backlash, but it doesn't make the weapon trackable or hackable. So, how about that rfid in guns? ",
            "date": "Answered February 6, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kyle Lee",
                "href": "/profile/Kyle-Lee-32"
            },
            "answer_text": "Try getting criminals to turn in their guns let alone the 300 million guns in circulation to convert them. And this tech is easily disabled. Its a useless expensive prospect ",
            "date": "Answered December 16, 2014",
            "views": "76",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Furgerson",
                    "user_href": "/profile/Tim-Furgerson"
                },
                {
                    "user_id": "Nayab Saiyed",
                    "user_href": "/profile/Nayab-Saiyed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thor Johnson",
                "href": "/profile/Thor-Johnson-5"
            },
            "answer_text": "Well, you could do that… but nobody would want to buy a weapon that needed batteries in order to work or could be disabled if it received a “signal” from somewhere. Tell you what, once you get all of law enforcement to adopt weapons like this, then we’ll think about it. ",
            "date": "Answered February 12, 2020",
            "views": "35",
            "upvotes": "0"
        }
    ]
}