{
    "title": "How does manufacturing work? - Quora",
    "tags": [
        "Wholesale Distribution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jared McLaughlin",
                "href": "/profile/Jared-McLaughlin"
            },
            "answer_text": "This question seems to assume a very simple idea of a manufacturing economy. In reality, there are numerous ways for these various types of companies to operate. Let's take some examples: 1. Apple. As far as I am aware (and I admit I don't know for certain) Apple  has not made most of their products. They designed them, they engineered them, worked out the marketing and packaging but paid someone else to actually make the things? Why would someone do this?  Some companies want to focus on being good at one thing. Apple wants to be good at designing their products, and they work with a company who doesn't want to design products, but wants to be good at making products. To a degree it's a matter of focus, and sometimes it a matter of comparative advantage in different areas. I see that the above example actually covers two different sorts of companies. 2. General Motors. As far as I am aware, General Motors designs their vehicles and makes some of the parts. Other parts, they get specialized companies to make for them. Companies like this do make / buy decisions based on how many of a given thing needs to be made over time, the capital costs involved, and a few other factors. For the company making the parts for GM, they can make the parts while the model is on the line, then continue to make the parts as replacements for some time after GM has decided to use a different part. On top of that, some aspects of manufacturing are difficult enough and capital intensive enough that it makes sense for only a few companies to invest the time and money to be good enough to service the rest of the market. High precision stamping dies and their products often fall in to this category.  Why distributors? Some of it has to do with cash flow and cost of capital. Distributors can carry the cost of the goods in their inventory and allow the manufacturer to receive cash. The distributor does not have to borrow capital to buy machines, and the manufacturer does not have to borrow capital to hold much inventory. This allows the lot sizes to be made more economical for both. I hope some of this has helped. ",
            "date": "Answered March 19, 2015",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Muhammad Tawfiq",
                    "user_href": "/profile/Muhammad-Tawfiq-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Gobat",
                "href": "/profile/Paul-Gobat"
            },
            "answer_text": "There are several different ways for manufacturers to obtain ideas to make stuff, and some companies thought of manufacturers are actually design groups and don't actually make what they sell. So, if you are asking about true manufacturers that start with raw materials which are then made into a value-added product here are some things to think about: 1. Most manufacturers have some kind of design and engineering department which can include concept-through-production but that doesn't mean that they won't consider outside sources for design work or processes that they themselves cannot do in-house. It is not necessarily true that these manufacturers utilize distributors. In my experience it is becoming more common that companies have their own distribution arm and sales team, cutting out the \"middleman\" and selling direct to the retailer. The benefit of having a one-stop supplier for the retailer to use is becoming less attractive in my opinion; 2. I imagine that there are SOME products on amazon that are sold direct (see above) but manufacturers want to sell in bulk, not onesies and twosies. They can accomplish this by selling to a retailer but not direct to a consumer. ",
            "date": "Answered March 19, 2015",
            "views": "13",
            "upvotes": "0"
        }
    ]
}