{
    "title": "How important are gadgets in your life? - Quora",
    "tags": [
        "Gadgets (technology)",
        "Information Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michelle Schell",
                "href": "/profile/Michelle-Schell-7"
            },
            "answer_text": "Today we use various electronic gadgets in our daily life. Everything from cooking to music uses electronics or electronic components in some way. Communication gadgets are a category of gadget which control the biggest part of our lives. But it is not the only gadgets that can increase the efficiency. Just think of the morning when you start using the gadgets. From the very first in the morning you need to use the alarm clock to wake you up until you want to gate late. Then you make your coffee using a coffee maker followed by watching of television to catch the latest news and stock market. It has influenced our lives to such an extent that we cannot think a day without them. Starting from the early morning till the time we reach the bed we are making use of some of other gadgets in various ways. With the advancement in the technology new sophisticated gadgets machines is coming up that enable in surgeries. And diagnostic thus preventing people from frequent deaths. In earlier times due to lack of medical development usually people die before the time but recently medical science has developed so much that people can now get medicines for every disease and illness. Even for minor things like measuring blood pressure, sugar level and other there are various kinds of machines. You no longer have to wait for monthly check up or rolled down to the hospital and wait for hours to measure your blood sugar. Today you can get everything at the tip of your finger. Gadgets reviews have made our life pleasurable like the use of AC during the summer season followed by a room heater during the cold chilly winter seasons. Fans, dryers, washers, sewing machine, air purifiers are all gadgets. Wherever you look you will able to see a gadget. Even for taking care of our hair we need gadgets like hair dryer, hair straightener and so on. Gadgets are also beneficial for disabled people. Take electronic eyes for the blinds. It can help them to detect the zebra crossing and thus ensure safety to cross the roads. ",
            "date": "Answered May 31, 2020",
            "views": "469",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gena Kotov",
                "href": "/profile/Gena-Kotov"
            },
            "answer_text": "Gadgets are the whole ecosystem and in the developing world, this part couldn't be missed. Can you imagine being involved in some process or action without important devices? In this particular question, gadgets help us to solve different tasks faster and better. E.g. smart-home is no longer a concept. Isn't it faster and more comfortable when you can use your phone to switch on a heating system in your house while you are driving back tired from a difficult working day? It is more convenient for you to check whether you left your iron on or off and without feeling this disturbing paranoia. It doesn't depend on what gadget you are using right now. The aim is that exactly this gadgets helps you to: save your time;be confident in your actions;reduce your expenses.I am keen on music and drawing. Recently I've bought my wireless headphones and also a new laptop that can be used as a graphical tablet. I am very pleased with my new headphones. I use public transport almost every day and it was an unbreakable argument to buy wireless headphones in order not to buy every month a new pair of them, in overloaded subway wires are like my Achilles heel. To crown it all gadgets are like ninjas, because of the habit we are not even noticing them, but they are with us and they help us under cover of night. ",
            "date": "Answered September 26, 2019",
            "views": "12",
            "upvotes": " View 40 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paulina Kubala-Chuchnowska",
                    "user_href": "/profile/Paulina-Kubala-Chuchnowska"
                },
                {
                    "user_id": "Roman Chuprina",
                    "user_href": "/profile/Roman-Chuprina"
                },
                {
                    "user_id": "Dmitry Chervonyi",
                    "user_href": "/profile/Dmitry-Chervonyi"
                },
                {
                    "user_id": "Baptiste Debever",
                    "user_href": "/profile/Baptiste-Debever"
                },
                {
                    "user_id": "Alice Berg",
                    "user_href": "/profile/Alice-Berg-1"
                },
                {
                    "user_id": "Ostap Yaroshevych",
                    "user_href": "/profile/Ostap-Yaroshevych-1"
                },
                {
                    "user_id": "Iryna Viter",
                    "user_href": "/profile/Iryna-Viter"
                },
                {
                    "user_id": "Matthew Roberts",
                    "user_href": "/profile/Matthew-Roberts-521"
                },
                {
                    "user_id": "Nina Kozlowska",
                    "user_href": "/profile/Nina-Kozlowska-1"
                },
                {
                    "user_id": "Deandre Davis",
                    "user_href": "/profile/Deandre-Davis-39"
                }
            ]
        }
    ]
}