{
    "title": "How long should you keep a laptop? - Quora",
    "tags": [
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Lester",
                "href": "/profile/Mark-Lester-31"
            },
            "answer_text": "Retailers and manufacturers will tell you a three year old laptop is basically old technology in an attempt to get you to buy a laptop every two years. Before I can answer that question let us look at the three main drivers that dictate whether you need a new laptop or not. What is your budget.What are you planning to use it for.How powerful is the laptop you’re actually buying.If you’re a student at college or in a situation where you don’t have a mattress full of cash you’re budget is going to be pretty stretched so you’ll end up keeping your laptop until the cover hinges are falling off. There’s nothing wrong with that as long as it is still fulfilling your needs. What are you planning to use it for? This is the one that usually throws everybody for a loop. You start out buying the laptop for run of the mill stuff like email, Facebook, typing up assignments and stuff like that. Over the life of the laptop you might get into gaming, coding, video editing, sound editing or something that’s a little more resource intensive for a basic laptop. That’s when you realize that you probably have to get either an upgrade or a new laptop entirely. My third point; how powerful is the laptop that you bought in the first place. If you don’t have budget constraints and you know that what you’re going to do with it is going to be pretty intense you’re going to pick up a pretty powerful machine. Separate and apart from regular maintenance and minor repairs a mid to high end machine can last a user anywhere from four to six years without actually slowing down to the point where it is unusable. So basically how long you should keep a laptop is wholly dependent on you and your needs. I know a guy who goes through laptops like Kleenex because he’s always dropping them or leaving them somewhere where they get stolen. But like I said before, it boils down to you. ",
            "date": "Updated May 22, 2019",
            "views": "84",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victoria Bornino",
                    "user_href": "/profile/Victoria-Bornino"
                },
                {
                    "user_id": "Anurag Nandi",
                    "user_href": "/profile/Anurag-Nandi-4"
                },
                {
                    "user_id": "Edward Stotts",
                    "user_href": "/profile/Edward-Stotts-1"
                },
                {
                    "user_id": "Martina Lovric",
                    "user_href": "/profile/Martina-Lovric-3"
                },
                {
                    "user_id": "Naz Soysal",
                    "user_href": "/profile/Naz-Soysal"
                },
                {
                    "user_id": "Balram Singh Mehta",
                    "user_href": "/profile/Balram-Singh-Mehta"
                },
                {
                    "user_id": "Lala Latte",
                    "user_href": "/profile/Lala-Latte"
                },
                {
                    "user_id": "Kelsey Rich",
                    "user_href": "/profile/Kelsey-Rich-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Cherry",
                "href": "/profile/Alex-Cherry-2"
            },
            "answer_text": "You should keep it as long as it is useful to you. Remember that a laptop - any technology - is simply a tool you use to accomplish tasks. If that tool still functions, you don’t need to disgard it in favor of a newer tool! The majority of modern consumer computing occurs on the internet - that is, in your web browser - and in an Office suite. Browsers are relatively lightweight software, and Office suites aren’t exactly super-intense (though it can feel like it sometimes). Right now, a decade old laptop could run the most current version of Windows or Linux, use a browser and have a word processor open at the same time without much effort. It’s strongly likely that a laptop will still be a useful tool for its original purpose, even a decade later. That can be extended with small, inexpensive upgrades; replacing the old spinning platter hard drive with a solid state drive makes an enormous improvement in speed, and adding more RAM will help the system keep pace with more memory-hungry modern software. You’ll probably have to replace the battery somewhere around the five year mark, but that’s a small price to pay. Even when it starts to be problematic as a primary use machine, it can still be re-purposed for other in-home computing tasks. Others have mentioned using it as a NAS (network attached storage), though I’m not fond of using it for that due to lack of drive bays and on-board RAID. You could use it as a print server, a router, a node for SETI (Search for Extra-Terrestrial Intelligence) or Folding@Home, a torrent box, a game server, a proxy server, or a million other things. ",
            "date": "Answered December 5, 2017",
            "views": "21",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Taylor",
                    "user_href": "/profile/Robert-Taylor-315"
                },
                {
                    "user_id": "Jason Gafar",
                    "user_href": "/profile/Jason-Gafar-1"
                },
                {
                    "user_id": "Douglas Whalen",
                    "user_href": "/profile/Douglas-Whalen"
                },
                {
                    "user_id": "Giulio Moro",
                    "user_href": "/profile/Giulio-Moro-1"
                }
            ]
        }
    ]
}