{
    "title": "How does a telephone exchange work? - Quora",
    "tags": [
        "Telecommunications Companies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wallis Dudhnath",
                "href": "/profile/Wallis-Dudhnath"
            },
            "answer_text": "Lets look at this a digital Telephone Exchange and consider a Use-Casethat is Wireline, i.e. a Fixed Line system. A digital Telephone Exchange can be broken into two key functional (software) areas:- - Control- Switching The Controlling software helps to determine how the call (after dialling using a MF4 / Rotary dial / etc..) will be routed either to another line (intra routing) on the Exchange or to another Exchange (inter routing). The Control software supports a Digit-Decoder that is used to analyse the dialled digits and determine how the routing will take place. Control also help to determine the Metering for the call. The Switching software supports a Digital Swiching Fabric that connects internal resources (Time Slots) via software routes. The Controlling software helps with the connection of internal resources. The Two Wire Local Loop connects the Wireline Terminal to the Telephone Exchange. By going \"off-hook\" you send a signal to the Exchange that you are ready to make a call. Dial tone is the signal that prompts you to enter digits. ",
            "date": "Answered May 21, 2016",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaitanya Ramgirwar",
                    "user_href": "/profile/Chaitanya-Ramgirwar"
                },
                {
                    "user_id": "Sooraj Paul",
                    "user_href": "/profile/Sooraj-Paul"
                },
                {
                    "user_id": "Jayaram Jonnada",
                    "user_href": "/profile/Jayaram-Jonnada"
                },
                {
                    "user_id": "Vishnu A M",
                    "user_href": "/profile/Vishnu-A-M-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santosh Sridhar",
                "href": "/profile/Santosh-Sridhar"
            },
            "answer_text": "Simple anology!Telephone call with your friends number = Letter with your friends address Telephone exchange that connects your call to your friend= Post Office that delivers letters to your friends homw  :) ",
            "date": "Answered July 24, 2014",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jayaram Jonnada",
                    "user_href": "/profile/Jayaram-Jonnada"
                },
                {
                    "user_id": "Wallis Dudhnath",
                    "user_href": "/profile/Wallis-Dudhnath"
                }
            ]
        }
    ]
}