{
    "title": "How much are you satisfied with US Health Care system? - Quora",
    "tags": [
        "Healthcare and Medicine in the United States of America",
        "Health Insurance",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aly Bingham",
                "href": "/profile/Aly-Bingham"
            },
            "answer_text": "I work part-time in the health care industry, and I think the mindset of most people regarding health insurance is fundamentally flawed.  Life insurance is comparable to car insurance -- it pays for catastrophic damage, not routine maintenance. Routine maintenance is the owner's responsibility. That's the same attitude we ought to have towards health insurance, because in actuality, it's a glorified payment plan. I've also seen the EOB's (Explanation of Benefits) that health care providers receive, and I can promise you that in about six years of experience, I've never seen a bill that was actually paid in full by the insurance company, but that leads into the problem on the other side. Everything in the health care industry is marked up. Ridiculously marked up. Why? Because insurance companies don't pay it all. So, the more health care providers charge, the higher percentage the insurance company pays, which in turn makes health insurance premiums higher. This is a large part of the reason why health insurance is so expensive and why they're so selective about who they'll cover: the more they have to pay out, the less profit they make. Don't forget, insurance companies are businesses, too. So, yes, to answer your question, the health care system is broken, and while I personally don't think the government ought to be stepping in to solve the problem, it does need to be reformed. ",
            "date": "Answered November 1, 2013",
            "views": "16",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Varun Chandra",
                    "user_href": "/profile/Varun-Chandra-21"
                },
                {
                    "user_id": "Christopher Richards",
                    "user_href": "/profile/Christopher-Richards-10"
                },
                {
                    "user_id": "Alton R Marcum",
                    "user_href": "/profile/Alton-R-Marcum"
                },
                {
                    "user_id": "Jacob VanWagoner",
                    "user_href": "/profile/Jacob-VanWagoner"
                },
                {
                    "user_id": "Ryan Davidson",
                    "user_href": "/profile/Ryan-Davidson-3"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                },
                {
                    "user_id": "Manjari Narayan",
                    "user_href": "/profile/Manjari-Narayan"
                },
                {
                    "user_id": "Manik Uppal",
                    "user_href": "/profile/Manik-Uppal"
                },
                {
                    "user_id": "Siddharth Bhattacharya",
                    "user_href": "/profile/Siddharth-Bhattacharya"
                },
                {
                    "user_id": "Alon Amit",
                    "user_href": "/profile/Alon-Amit"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Munro",
                "href": "/profile/Dan-Munro"
            },
            "answer_text": "The \"system\" is broken - in many ways: The U.S. healthcare \"industry\" is an economic unit larger than Germany.It's currently running at over $3 trillion - per yearThat equals over 18% of our entire GDPAbout 100,000 deaths occur each year due to medical errors (U.S. alone)We're the only industrialized country where medical expenses are a leading cause of personal Bankruptcy.Forget the earlier number - we're well over $9k per-capita per year - and probably over $10kFor 2012 - The Commonwealth Fund reported that 84 million Americans (basically 1/3 of the non-elderly population) were either uninsured or underinsured during the year [1]The last time the World Health Organization (WHO) ranked healthcare systems (2000) the U.S. came in #37 - tied with Costa Rica and just ahead of Slovenia  Here's the chart for PPO coverage for a family of 4 [2] All of which combined is how we get to this chart representing both a national crisis and global embarrassment  Unlike other countries, we've optimized our system around revenue and profits - not safety and quality.  The 2 sentence quote of why this is such a mess and hard to change?    ========================[1] New Health Insurance Survey: 84 Million People Were Uninsured for a Time or Underinsured in in 2012; Nearly Decade-Long Trend of Rising Uninsured Rates Among Young Adults Reversed - The Commonwealth Fund  [2] 2013 Milliman Medical Index ",
            "date": "Answered March 24, 2014",
            "views": "808",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Heather Fiske",
                    "user_href": "/profile/Heather-Fiske"
                },
                {
                    "user_id": "Ian McCullough",
                    "user_href": "/profile/Ian-McCullough"
                },
                {
                    "user_id": "Jacob VanWagoner",
                    "user_href": "/profile/Jacob-VanWagoner"
                },
                {
                    "user_id": "Laszlo B. Tamas",
                    "user_href": "/profile/Laszlo-B.-Tamas"
                },
                {
                    "user_id": "Jerry Mc Kenna",
                    "user_href": "/profile/Jerry-Mc-Kenna"
                },
                {
                    "user_id": "John James Morton",
                    "user_href": "/profile/John-James-Morton"
                },
                {
                    "user_id": "Dan Strayer",
                    "user_href": "/profile/Dan-Strayer"
                }
            ]
        }
    ]
}