{
    "title": "How can immigration affect a country's economy? - Quora",
    "tags": [
        "Macroeconomics",
        "International Economics",
        "Immigration"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Scott",
                "href": "/profile/George-Scott-37"
            },
            "answer_text": "You are asking a very broad question. There are many different types of migrants in many different countries, so there can be no generalizations. Let’s take Singapore as an example. Singapore accepts a very large number of immigrants. Singapore prioritizes immigration on the basis of the skills the country needs and the skills the migrant applicant offers. As a result, immigration is extremely beneficial both to Singapore’s economy and to the immigrants. It is a win-win arrangement. Now let’s look at Syria’s emigrants in its neighboring countries (particularly Jordan, Lebanon, and Turkey). They have fled Syria under extremely adverse conditions. Some live in refugee camps in bad conditions and depend on international largess for their survival. Others seek whatever jobs they can find in these nations’ cities. This is a lose-lose arrangement. Immigration to other nations generally falls somewhere in between these two extremes. Much depends on whether the immigration is by legal or illegal means, their level of education, and whether they are refugees or immigrants seeking better opportunities in life. There are many well-educated immigrants who came to their new country under favorable conditions who contribute very favorably to their host country’s economy. Those with low levels of education who had to flee their country with barely the clothes on their back often require considerable welfare assistance at least during the early period of their arrival. A country’s immigration policy can have significant influence on the outcome. Singapore has a very business-oriented immigration policy which benefits the country. The United States’ immigration policy has been outdated for close to half a century and is thereby dysfunctional, which has been a major source of the controversy and problems related to immigration in the U.S. ",
            "date": "Answered August 19, 2018",
            "views": "174",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sam Li",
                    "user_href": "/profile/Sam-Li-160"
                },
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                },
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Armando Cardona",
                "href": "/profile/Armando-Cardona-2"
            },
            "answer_text": "REALLY? Are you really THAT ignorant? The smart and educated ones are tenured professors in science and mathematics at the best colleges, universities and boarding schools in the Nation and conduct research at top pharmaceutical companies, laboratories and NASA; the US won the space race and may yet be first to set foot on Mars because of immigrants and chances are the wonder drug or the experimental medical treatment that last saved your life is the work of an immigrant or immigrants. The less educated or not so smart ones grow and pick the vegetables you eat; they wash the dishes, wait tables and cook the meals at the fine restaurants where you dine; they mow the lawn and keep the grounds at the nice golf and tennis clubs where you play and the suburban gated subdivisions where you live; and they do the million and one jobs that native born Americans won’t do anymore for any amount of money, like sweep and mop floors, wash windows, clean houses and hotel rooms and clean toilets—and more often than not they do it for minimum wage OR LESS. Physically gifted ones are some of the best players in spectator sports and add substantially to their respective teams’ performance, stats and profitability. Finally, immigrants ALSO keep the Social Security system from going under by the monies they pour INTO the system and they lessen the tax burden on the rest of us by paying billions in taxes at the municipal, county, state and federal levels. In short, they’re ABSOLUTELY INDISPENSABLE to the U.S. economy. ",
            "date": "Answered February 22, 2020",
            "views": "119",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Johni Matz",
                    "user_href": "/profile/Johni-Matz"
                },
                {
                    "user_id": "Vaughn Cordero",
                    "user_href": "/profile/Vaughn-Cordero-1"
                },
                {
                    "user_id": "Celia Milton",
                    "user_href": "/profile/Celia-Milton"
                },
                {
                    "user_id": "Joseph O Ruanaidh",
                    "user_href": "/profile/Joseph-O-Ruanaidh"
                }
            ]
        }
    ]
}