{
    "title": "How to program a Dish remote to my TV - Quora",
    "tags": [
        "Dish Network",
        "Remote Controls",
        "Tech Support",
        "Television",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Apoorv Sathish",
                "href": "/profile/Apoorv-Sathish"
            },
            "answer_text": "My answer is based on programming an Airtel DTH remote to an LG LED TV (2020) Step 1: Reset the remote. To reset your DTH remote, press the ‘ok’ button and the red colour button simultaneously for a few seconds and then press the keys ‘9’ , ‘8’ and ‘0’ respectively. The LED in your DTH remote should blink twice indicating success. Otherwise, repeat the step again. Step 2: To turn on learning mode. For your DTH remote to be on learning mode, long-press the ‘OK’ button and numeric key ‘2’ till the LED in your remote blinks twice. If it doesn’t blink or blinks more than two times, then repeat the step. Step 3: Programming the DTH remote. The following are steps are to be followed immediately after you turn on ‘learning mode’. Any delay in the following steps will result in no effect of the programming and therefore you will have to repeat the steps again from Step 2. To begin the programming, place the DTH remote and TV remote 3 to 6 cm apart facing their LEDs to each other. Now, remember, the following steps are to be followed quickly and precisely otherwise you will have to repeat again from Step 2. After placing the two remotes in position and turning the DTH remote into learning mode, press the desired keys you wish to access on your DTH remote first followed by pressing the same key on your TV remote. Eg: Power key (DTH remote) + power key (TV remote), Volume ‘up’ key (DTH remote) + volume ‘up’ key (TV remote), similarly do it for volume down key and then Mute key (DTH remote) + mute key (TV remote). As soon as you finish paring, press the ‘OK’ key once and if the LED in your DTH remote blinks twice, the pairing is successful. If it blinks more than two times, do it again from Step 2. NOTE: All the process after turning into learning mode must be done quickly. If the LED blinks more than two times during the process, it means the pairing was a failure and hence you’ve to repeat the steps again. Thank you. Hope this was useful. Let me know if it worked or if you have any queries. ",
            "date": "Answered July 24, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jena Dawn",
                    "user_href": "/profile/Jena-Dawn-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kyle Peterson",
                "href": "/profile/Kyle-Peterson-41"
            },
            "answer_text": "It really depends on the type of remote you have but on mine you simply press and hold the TV power button for about three seconds, then type in the code (found here: How to Program Remote to TV or Other Device - press the first remote and a blue link saying “three-digit remote control code” will pop up. Select it and a menu asking for tv brand will pop up and display codes) and it will flash. After that you test it and it hopefully works. Happy trails! ",
            "date": "Updated February 28, 2017",
            "views": "107",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Valene Parrish",
                    "user_href": "/profile/Valene-Parrish"
                }
            ]
        }
    ]
}