{
    "title": "How good is the third party logistics industry? - Quora",
    "tags": [
        "Wholesale Distribution",
        "Small Business Entrepreneurship",
        "Drop Shipping",
        "Logistics",
        "Small Businesses",
        "Startup Founders and Entrepreneurs",
        "Entrepreneurship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karishma",
                "href": "/profile/Karishma-160"
            },
            "answer_text": "According to a new research published by Polaris Market Research. The global third party logistics market was valued at USD 795 billion in 2017 and is reach around USD 1,260 billion by 2026 to grow at a CAGR of 5.3% during the forecast period. Get more information : Third Party Logistics Market Size & Share - Industry Report, 2018-2026 The rise in global trading with respect to e-commerce and retail has led to an increase in the third party logistics market. Advantages offered by 3PL, such as lesser time taken to complete the process, cost and reliability, has encouraged businesses to invest in it to increase overall efficiency and profitability. Outsourcing logistics operations enables manufacturers and retailers to focus on core competencies. Digitalization and integration of IT software and solutions coupled use of reverse logistics and multi-modal transportation is expected to offer growth opportunities during the forecast period. However, factors such as high initial investment to setup the warehouses, initiate staffing activities, investment in IT and monitoring services and actual delivery solutions might hinder market growth to a certain extent. The major players operating in the third party logistics market include FedEx Corporation, Union Pacific Corporation, Kuehne+Nagel Inc., BNSF Railway Company, AmeriCold Logistics, LLC, Landstar System, Inc., Ryder System, Inc., Burris Logistics, DB SCHENKER Logistics, CEVA Logistics. The global third party logistics market is segmented on the basis of service, mode of transport, end-user, and geography. Third Party Logistics Market Size and Forecast by Service, 2018-2026 Dedicated Contract CarriageDomestic Transportation ManagementInternational Transportation ManagementWarehousing and DistributionOthersThird Party Logistics Market Size and Forecast by Mode of Transportation, 2018-2026 RoadwaysRailwaysWaterwaysAirwaysThird Party Logistics Market Size and Forecast by End-User, 2018-2026 RetailManufacturingHealthcareOthersThird Party Logistics Market Size and Forecast, 2018-2026 by Region North AmericaEuropeAsia-PacificLatin AmericaMiddle East & Africa",
            "date": "Answered June 10, 2019",
            "views": "225",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Julie Roland",
                    "user_href": "/profile/Julie-Roland-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aashish Gangrade",
                "href": "/profile/Aashish-Gangrade-1"
            },
            "answer_text": "Third party logistics (3PL) market size is estimated to reach over USD 1,029.47 billion by 2022, growing at 4.4% from 2015 to 2022. Increasing focus on core business activities accompanied by reduced shipping cost is anticipated to drive third party logistics market size. Increasing freight rates is likely to boost shippers towards discovering new opportunities to pull costs out of the supply chain. 3PL providers aids in offering optimized transportation costs by prescribing effective and timely supply chain solutions. The advent of e-commerce along with entrepreneurial ventures is likely to fuel the industry demand for specialized logistics as well as supply chain execution capabilities. More Details @ http://bit.ly/24NG7fV ",
            "date": "Answered June 6, 2017",
            "views": "205",
            "upvotes": "0"
        }
    ]
}