{
    "title": "How are phone's cameras so small? - Quora",
    "tags": [
        "Smartphone Cameras",
        "Digital Cameras",
        "Cameras"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Forbes",
                "href": "/profile/Jeff-Forbes"
            },
            "answer_text": "The sensors are pretty small. My phone camera has a sensor that is about 25 square millimeters in area. That is, if it were a square, about 5mm by 5mm. Smaller than a thumbnail. Because the sensor is small, it needs a small lens. Even with the “large” apertures of modern smartphones, the lens can be quite small. With a focal length of about 4.5mm, even the aperture needs to be only about 2mm wide. There is no zoom on the lens. Zooms add a lot of bulk to lenses! There is also no additional hardware that operates the camera beyond the camera module. It just needs to be able to focus, and connect electronically to the phone. Everything else is done “off camera”. If you compare a cellphone camera to a point and shoot camera with a zoom lens, you’re not really making a reasonable comparison due to the zoom lens - and the necessity of having a body for the camera to exist in. At some point, having a smaller and smaller camera body isn’t a good thing - it can be a bad thing for the user, as the camera still needs buttons and a screen and such. If you make it too small, you don’t have room for them. Here’s a fun camera… from 2002. Casio sold them and made some other similarly small cameras. They were never very popular in the US, though I had seen them from time to time. Perhaps they were more popular in Japan. Casio Exilim EX-S1 / EX-M1 That camera had a teeny tiny little sensor, with a tiny lens. It was basically like a cellphone camera - the sensor is about the same size, and while the lens design is a bit different, it’s all the same idea. THey had to make the camera bigger to hold the battery, put a screen on it, and put some buttons on it to use it, but it was about as small as a camera could practically be. And all that stuff - the screen, battery, and controls, are handled by the non-camera hardware in the phone. ",
            "date": "Answered June 17, 2018",
            "views": "295",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Toh Wu Jie",
                    "user_href": "/profile/Toh-Wu-Jie"
                }
            ]
        }
    ]
}