{
    "title": "How connected is too connected? - Quora",
    "tags": [
        "Civilization",
        "Humans ",
        "Wi-Fi",
        "Computer Networking"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paula D. Tozer",
                "href": "/profile/Paula-D-Tozer"
            },
            "answer_text": "Hey Kevin It is true, folks in your age group have never known what it means to live without technology. From the time they were old enough to understand, even my kids (now 27 and 31) have always known what a cell phone was, had access to some form of computer and played video games from the time they could hold a controller. Even television (and video recording devices) was part of their day in a way that it was not in mine when I was their age. Has this made us more connected (not electronically, but to each other) or has it made us more disconnected? It is easy to be nostalgic and yearn for the good ole days. I know many of my friends and family who do that. It is considered normal and is widely accepted. I can guarantee you that when men and women your age get to a certain point you will do the exact same thing…yearn for the days when you were young. I think was is normal is that every generation does it. I remember my Mom looking at me one day when I was rocking out to Nick Gilder’s Roxie Roller…she was highly amused that I was so into rock music… I think it is also normal to find a way to disconnect. I know we did with our headphones, and it still happens now. I really dislike Pop music and so when I am at the gym I take my own music (generally heavy rock or metal for working out). As a parent, I think my generation has been responsible for some of the issues that affect the younger generations today. Videos and video games, Game Boy’s and other devices were part of the social scene and we indulged our kids with these items. On one hand, we thought it would give you a boost when it came to learning (it has certainly helped your reaction time!) but on the other hand it was also an effective babysitter, so parents could indulge in their own pursuits. Had this indulgence hurt our offspring? Perhaps. Perhaps not. It is a matter of awareness. You alone are responsible for the quality of your life. If you are aware of where you spend your time and choose to invest in what promotes your best life, then how you spend your time is your business. Truth be told, every person alive, whether they indulge in technology or not, has to find a balance between indulgence and productivity. It is personal accountability. We have to know what silence sounds like, and what alone feels like in order to connect with ourselves. We have to communicate in an honest, personal, one-on-one basis in order to maintain deep relationships. We have to discover and focus on what matters every day and apply it to every day or life has no inspiration, no colour. However, we don’t have to have our face in a screen in order to lose focus. We don’t have to be texting at the dinner table in order to be rude. We don’t have to be surfing the net when we should be listening in class in order to fail. But it does not help that on top of our tendency to zone out we now have our hands full of technology that screams at us to do just that. Pay attention to ME! We whine and suffer as we give away our power to a thing. Sounds like worship…an electronic religion? It is like we are gluttons, gluttons for indulgence. For example, as a culture we are sedentary and overweight but do we do anything about it? I think everyone would agree that it is much easier to form a healthy routine of diet and exercise before you become unhealthy and obese than it is to try to change those unhealthy habits later on. But we cannot, it seems. We worship food. You ask how do I detox in order to stay sane… How about by not making it toxic in the first place? Food is fuel. Technology is efficient communication. Without food, we die. Without technology, lives would be lost. Use it, don’t let it use you. That applies to food or to technology, as well as other things. The first step is awareness. If it has become a real problem and it is cutting you off from living a real life instead of a virtual one, consider it like an addiction. The first step is to admit that there is a problem. You are not an avatar. Take back your power. ",
            "date": "Answered March 3, 2017",
            "views": "294",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephanie Esther Fam",
                "href": "/profile/Stephanie-Esther-Fam"
            },
            "answer_text": "For me I use only ONE social media platform. I have only apps on my phone that I need to use. I have a thing about not liking too many apps on my phone. When I'm at a Toastmasters event or out with friends , I rarely physically hold onto it as it is hard to handle a phone when you're pushed around in a wheelchair.. My phone is on silent mode after a certain time at night so when I am about to sleep or already asleep, nothing on my phone bothers me unless I wake up to check it… ",
            "date": "Answered March 2, 2017",
            "views": "73",
            "upvotes": "0"
        }
    ]
}