{
    "title": "How to start a call center, and how can I approach the process - Quora",
    "tags": [
        "Business Process Outsourcing",
        "Business Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Greene",
                "href": "/profile/Jeff-Greene-2"
            },
            "answer_text": "Original question: How can I start a call center, and how can I approach the process? To be honest, if you do not know what is required to start a call center, you will most likely fail or get ripped off by fraudsters and scammers. I have worked at three call centers. The first was a single location, the other two were large multi center companies that were spread around the globe. If you want to operate a call center, you need: connectionsbusiness connections so you will have clientsphysical connections as in data, phone, data center, etc.capital - lots of capitalcontracts so you will have calls to answerlawyers to make sure every contract is properly written and that the business is run legally including having non disclosure agreements if necessarysecurity for the buildingbackup power systemsredundant network, telephone, internet, and data centerstrainers to train your employees for the contracts you sign with clientsthe right partners and managers to operate a call centeretc.",
            "date": "Answered September 23, 2020",
            "views": "34",
            "upvotes": " Answer requested by Donnie Holloway",
            "upvoters": [
                {
                    "user_id": "Akansha Rajput",
                    "user_href": "/profile/Akansha-Rajput-45"
                },
                {
                    "user_id": "Jyotsna Patil",
                    "user_href": "/profile/Jyotsna-Patil-71"
                },
                {
                    "user_id": "Anjali Agarwal",
                    "user_href": "/profile/Anjali-Agarwal-295"
                },
                {
                    "user_id": "Gurcharan Singh",
                    "user_href": "/profile/Gurcharan-Singh-385"
                },
                {
                    "user_id": "Soundarya Ramaswamy",
                    "user_href": "/profile/Soundarya-Ramaswamy"
                },
                {
                    "user_id": "Prakash Bhosale",
                    "user_href": "/profile/Prakash-Bhosale-51"
                },
                {
                    "user_id": "Swetha Ahir",
                    "user_href": "/profile/Swetha-Ahir"
                },
                {
                    "user_id": "Nitin Suryawanshi",
                    "user_href": "/profile/Nitin-Suryawanshi-32"
                },
                {
                    "user_id": "Sukanya Pawar",
                    "user_href": "/profile/Sukanya-Pawar-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rutuza Deshmukh",
                "href": "/profile/Rutuza-Deshmukh"
            },
            "answer_text": "First of all, plan on real things, not like quick rich scheme, no risks etc.. If you planning call center business, with thoughts of , easy returns, no risks , typing jobs, support etc.. then do not start, you sure get scammed if do. As its never easy to survive in any new business, with proper guidance and support, hard work , consistency you can only do it. Risks always there, in Call center, if you can arrange staff who can give you steady performance, then you can earn good profits. Otherwise, vice versa. You must choose correct category to start operations, like above mentioned, non voice category, inbound process are looks good, but its like too good to be true kind of .. Non voice campaigns already outdated from market. companies are not fool to waste money on such simple tasks in this digital world. and Inbound process arent outsourced in open market. you are just a start up, so unless you develop yourself as a center, no one gives you a chance in such. Note, your infra, computers are not a company.. look around, there are tons available with only infra. No offense. Being a start up , Outbound is only option , like or not , it is only. Doing sales, lead generation, for various products and services in UK or USA or Canada market. Earn good commission on performance. Investment could be approx. 3lac to 4 lac for databases, 10k for dialer crm, 1lac to 1.5 lac for VoIP . with good team, you can expect good profits. but to achieve such, you must do necessary changes in team time to time.. such as replace those who are not able to perform. consistency etc. There is not particular place, website or shopping site for such projects , not even a fix mathematical formula , you get business with reference or network known to you . I know one of genuine client from long time.. Instead of trying with consultant , i would suggest you work/talk with direct client like Mr. saleem +91 7386034574. Sure he does have long term projects in usa and uk region , more than 10 years now. Hope it helps. regards Mrs. Rutuza Deshmukh ",
            "date": "Answered March 16, 2020",
            "views": "589",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Venkatesh Tillu",
                    "user_href": "/profile/Venkatesh-Tillu-1"
                },
                {
                    "user_id": "Dóra Rapcsák",
                    "user_href": "/profile/Dóra-Rapcsák"
                },
                {
                    "user_id": "Ice Mendoza",
                    "user_href": "/profile/Ice-Mendoza-1"
                },
                {
                    "user_id": "Jeg Lee",
                    "user_href": "/profile/Jeg-Lee"
                },
                {
                    "user_id": "Jaquelyn Arellano",
                    "user_href": "/profile/Jaquelyn-Arellano"
                },
                {
                    "user_id": "Katreena Sarmiento",
                    "user_href": "/profile/Katreena-Sarmiento"
                },
                {
                    "user_id": "Mason Taylor",
                    "user_href": "/profile/Mason-Taylor-49"
                },
                {
                    "user_id": "William Brown",
                    "user_href": "/profile/William-Brown-640"
                },
                {
                    "user_id": "Jayden Long",
                    "user_href": "/profile/Jayden-Long-1"
                },
                {
                    "user_id": "Rachel Ross",
                    "user_href": "/profile/Rachel-Ross-114"
                },
                {
                    "user_id": "Emma Williams",
                    "user_href": "/profile/Emma-Williams-337"
                },
                {
                    "user_id": "Sophia Smith",
                    "user_href": "/profile/Sophia-Smith-191"
                },
                {
                    "user_id": "Isabella Johnson",
                    "user_href": "/profile/Isabella-Johnson-69"
                },
                {
                    "user_id": "Jennielyn Abaygar",
                    "user_href": "/profile/Jennielyn-Abaygar-1"
                },
                {
                    "user_id": "Christian Abaygar",
                    "user_href": "/profile/Christian-Abaygar"
                },
                {
                    "user_id": "Chris Woodard",
                    "user_href": "/profile/Chris-Woodard-21"
                },
                {
                    "user_id": "Rick Harrison",
                    "user_href": "/profile/Rick-Harrison-53"
                },
                {
                    "user_id": "Frank Stevens",
                    "user_href": "/profile/Frank-Stevens-23"
                },
                {
                    "user_id": "Marah Sayaman",
                    "user_href": "/profile/Marah-Sayaman-3"
                },
                {
                    "user_id": "Akash Dwivedi",
                    "user_href": "/profile/Akash-Dwivedi-3"
                },
                {
                    "user_id": "Sophie Hendrix",
                    "user_href": "/profile/Sophie-Hendrix-1"
                },
                {
                    "user_id": "Brooke Harper",
                    "user_href": "/profile/Brooke-Harper-8"
                },
                {
                    "user_id": "Drew Wicker",
                    "user_href": "/profile/Drew-Wicker-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Betteridge",
                "href": "/profile/Alan-Betteridge-2"
            },
            "answer_text": "Starting a call center is not a cheap investment. The cost will vary dependent on the location of your business - but the equipment and general cost of starting a call center is never cheap. Even before getting to work out the logistics, a company will have to obey the guidelines and regulations for that particular location. Once the paperwork complies with the requirements. To start a call center you will need to: Have a strategic business plan - Having objectives will allow you to shape the kind of call center you want to establish. A business plan will prepare you for potential growth and expansion. As well as this, the expenses need to be managed. Having this plan gives the company a guideline to follow to ensure sustainability. Identify the purpose of your call center - The most common being either inbound or an outbound call center. Or maybe the less popular telemarketing. Is it going to be based on sales, customer service or informative support? It may be a mixture of all of them. Choose a suitable location - There are many factors to consider. If you need multilingual employees, maybe situating the call center in a big city will give you the skilled people you need. If you are proving a local service, a smaller town will be more appropriate. The distance from headquarters is vital. Not only does it build brand awareness, but if there is a problem, it makes it easier to help solve the situation. There are many other factors, such as the budget that needs to be considered. As experts say the three most important things in marketing are Location, Location, Location. Have the appropriate equipment and software tools - The physical equipment of headsets, monitors and laptops are needed. You'll also need a phone system, CRM software and a stable internet connection. All tools need to be durable and reliable. A slow call center will quickly fail; quality is a must. Good luck! ",
            "date": "Answered September 13, 2019",
            "views": "169",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akash Kumar",
                "href": "/profile/Akash-Kumar-5777"
            },
            "answer_text": "The call center business in India has been expanded for the last few years. There are two types of Call centers in India: Inbound Call Centers ( A Place where business calls are received from the prospective customers)Outbound Call Centers (A Place where business calls are made to the prospective customers)Call centers play a vital role in a company. Not only a sales perspective but also it helps companies to establish their customer relationship. If you want to start your Call center, Following steps will help you to start your own: 1. First of all, You need to have a business process so that you can decide which call center you have to setup. Like if you are running a third-party business, You will be required to start an outbound call center process, but if you're some kind of manufacturing or customer service, You will need an inbound process. Likewise, if your business is to process paperwork, Non-voice/data processing call center will be required to be set up here. 2. To start a call center, first, you have to prepare the requirements such as computer systems, Vonage, Toll-free numbers, etc. If your business process is service-based and you want your customers to directly pay through your sales team, the Payment gateway will be required there. 3. Prepare an RFI and RFP. Get a technical team to install the systems in place. Please identify the most feasible phones, lines, and other systems as this will be an irreversible capital investment. Cisco and Avayas are the widest phones in India. Desktops may be average. Try having a good solid NOC and IT Infrastructure team. Their main function will be to ensure 100% up time of links and servers at ALL TIMES. We do not want instances of applications going down and calls being queued up with no-one to help the customers out. 4. Prepare the necessary policies and procedures in your workplace. Make sure you've listed every process like call flows, SOPs, inter-Intra department communication channels, etc. You should have a robust, simple, and easy-to-follow process laid down for your customers. 5. If you're into the inbound process, prepare a proper estimate for the amount of inbound traffic you're expecting. Hire workforce staff first and then go to hire operational staff. These steps are just an overview. If you want an experienced consultant for starting your call center, You can contact through this phone number +91-9821399320. ",
            "date": "Answered June 23, 2020",
            "views": "214",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patrick Hogan",
                "href": "/profile/Patrick-Hogan-44"
            },
            "answer_text": "Which country are you planning to divide and conquer? Kidding aside, call center requirements differ per location. First things first, make sure you know the guidelines and requirements you need to comply before you start your business. Once you’ve got that figured out. You’ll want to: Identify which type of call center you want to set up. Inbound, outbound, web-enabled, telemarketing? Are you planning to provide tech support, customer service, sales services, or all three? Your call center set up depends on the type of contracts you’re interested in.Come up with a solid business plan. You’ll need a point of reference as your business grows. Aside from company information, your business plan should include employee salary & benefits, expenses, equipment costs, investments, and projected sales. You can look at this detailed sample for reference: Call Center Business PlanInvest in the necessary tools and equipment. Robust and reliable tools are a must-have for any call center company. Depending on your agreement with your client, you’ll need: a suitable CRM, a quality phone system, a CTI software to integrate your communication channels and your system of records. A steady power supply and dependable high-speed internet connection are non-negotiables.Contact business that outsource their business processes. A survey published in Computer Economics states that 65% of firms, which outsource applications hosting are planning to increase outsourced work in the years to come. Landing contracts isn’t easy. You’ll need to put in a lot of work to land contracts with different companies. This thread might be of help to you: Where can I find call center projects like inbound, outbound and back office?Good luck! ",
            "date": "Answered November 27, 2017",
            "views": "35",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kristína Fischerová",
                    "user_href": "/profile/Kristína-Fischerová"
                },
                {
                    "user_id": "Nina Kozlowska",
                    "user_href": "/profile/Nina-Kozlowska-1"
                },
                {
                    "user_id": "Matthew Roberts",
                    "user_href": "/profile/Matthew-Roberts-521"
                },
                {
                    "user_id": "Eve Liecht",
                    "user_href": "/profile/Eve-Liecht"
                },
                {
                    "user_id": "David Cacik",
                    "user_href": "/profile/David-Cacik-1"
                },
                {
                    "user_id": "Paulina Golab",
                    "user_href": "/profile/Paulina-Golab"
                },
                {
                    "user_id": "Ostap Yaroshevych",
                    "user_href": "/profile/Ostap-Yaroshevych-1"
                },
                {
                    "user_id": "Roman Chuprina",
                    "user_href": "/profile/Roman-Chuprina"
                },
                {
                    "user_id": "Maryna Sharapa",
                    "user_href": "/profile/Maryna-Sharapa"
                },
                {
                    "user_id": "Lisa Plitnichenko",
                    "user_href": "/profile/Lisa-Plitnichenko"
                },
                {
                    "user_id": "Deandre Davis",
                    "user_href": "/profile/Deandre-Davis-39"
                },
                {
                    "user_id": "Paulina Kubala-Chuchnowska",
                    "user_href": "/profile/Paulina-Kubala-Chuchnowska"
                },
                {
                    "user_id": "Klaudia Joanna Amelia Żyłka",
                    "user_href": "/profile/Klaudia-Joanna-Amelia-Żyłka"
                },
                {
                    "user_id": "Kateryna Davydova",
                    "user_href": "/profile/Kateryna-Davydova-1"
                },
                {
                    "user_id": "Vadym Antsyferov",
                    "user_href": "/profile/Vadym-Antsyferov"
                },
                {
                    "user_id": "Rima Grainger",
                    "user_href": "/profile/Rima-Grainger"
                },
                {
                    "user_id": "Nick Hladush",
                    "user_href": "/profile/Nick-Hladush"
                },
                {
                    "user_id": "Emilia Cano",
                    "user_href": "/profile/Emilia-Cano-3"
                },
                {
                    "user_id": "Brian Wright",
                    "user_href": "/profile/Brian-Wright-445"
                },
                {
                    "user_id": "Elen Udovichenko",
                    "user_href": "/profile/Elen-Udovichenko"
                },
                {
                    "user_id": "Sasha Andrieiev",
                    "user_href": "/profile/Sasha-Andrieiev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Berenika Teter",
                "href": "/profile/Berenika-Teter"
            },
            "answer_text": "Let’s face it: Nowadays, no company can function without a well-functioning contact center that makes it possible to get in touch with customers, prospective clients, suppliers, and business partners. Luckily, there are ready-to-use call center tools out there that even small organizations can afford to build their own contact centers with.  Essentially, all you have to do is to pick one of the many options available on the market. It might seem daunting at first, given the variety of call center tools out there - but it’s definitely worth the effort. Compare the advantages and disadvantages of being in the cloud.Think about cases when your call center agents would need to work remotely - if that’s something that might interest you, see whether the tool offers a mobile app.Make a list of all the tools you’re already using and see if they can be integrated with your brand new call center tool.Have a closer look at pricing options and check whether they’re within your budget.Test the solution first - there’s usually a free trial for you to take advantage of.The truth is: There are many factors that can influence your choice. would still recommend giving CloudTalk a try, though. Since it’s a reliable and powerful call center tool with great reviews and affordable packages - it’s likely to meet your needs and help you create a well-functioning call center in the process. ",
            "date": "Answered April 13, 2020",
            "views": "289",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charlotte Hills",
                    "user_href": "/profile/Charlotte-Hills-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kristína Fischerová",
                "href": "/profile/Kristína-Fischerová"
            },
            "answer_text": "It really depends on the area you focus on, whether you want to establish a smaller or bigger call center, if your call center should be placed in one location or your employees will work remotely. As I don't have this information, my suggestions will be a little bit more general.  First of all, it is important to ask the following questions: Job description and tasks - Do I really need the call center? What tasks do I have for them? Is it enough of work or can I delegate it to another department in my business?Budget - What is my budget for call center? Is it enough for all the salaries? What will be my costs connected to call center - for equipment needed or call center software + call credit?Employees - Where can I find the right people? How will I train them to provide excellent service? What structure do I want to have in my call center?Once you go through these questions, these are the most important steps: #1 Find the right people and educate them continuously & give them regular feedback #2 Decide whether you want to have an on-premise office or run a virtual call center (call agents are working from different locations). #3 Choose the right call center software based on your budget #4 Buy equipment needed - PCs, hardware phones or headphones, etc. I perceive crucial to choose the right call center software I prefer the ones which are cloud-based, as they provide you with much bigger flexibility, your employees can work from any location and you can always access your call center data from anywhere. So here are a few suggestions on how to choose the right call center software: Make initial research of the best call center providers on the market - you can use for those different directories like G2crowd, Capterra or GetApp. These are top provides on the market in my opinion: CloudTalk (Capterra rating - 4.8/5) - $15/per month/per user RingCentral (Capterra rating - 4.2/5) - Contact vendor JustCall (Capterra rating - 4.1/5) - $25/user/month Aircall (Capterra rating - 4.2/5) - $25/user/month (min 3 users) 2. Set your priorities and expectation from the right call center software Have a look at the features you’ve been using most frequently. Figure out what are the most important ones for your team and treat these as a priority. 3. Test the solution Most software providers offer free trial periods, usually for more or less two weeks. This way, you can see if the app works smoothly, which features are included and whether you actually enjoy using it. ",
            "date": "Answered April 29, 2020",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bruce Tuggle",
                "href": "/profile/Bruce-Tuggle"
            },
            "answer_text": "Since you have decided what kind of business you want to run, then, you should run a feasibility study to determine if it will make you any money and which niche will you be targeting. Then, you need to build your business plan which will include your marketing and digital plans. Here is what I tell my clients: Plan what you want to do and then do it. First pick something that you would like to sell. It can be anything to start. Keep it legal, socially acceptable, and fun for you. Then run a feasibility study on it. You can get help for free online. If your study says don’t do it, then don’t do it, find something else. Repeat. When you find something that appears to have a demand, then put together your business plan. So, you want to start a business, any business, anywhere. Or, you want to introduce a new marketing channel. Or, you want to modify your marketing plan Start by deciding what business you want to conduct. Use a feasibility study to help do this. Then create a business plan that contains your marketing plan which in turn has your web presence plan. You will be required to determine the effectiveness of your plan as you put it together. Let me quote Benjamin Franklin: “By failing to prepare, you are preparing to fail.” Once you have the business plan completed, you will have a road map for where you want to go and the milestones along the way so that you can measure your progress and to make sure that you stay on course. Your business plan will have the results of your research and budgeting. Your research phase will help you find out what rules you will need to follow in whatever geographic area that you want to headquarter. Budgeting is one of the least prepared for part of your plan, so look at it hard. You really need to make sure that you cover your resources and marketing efforts thoroughly. And, take a hard look at crisis management as well. If you don’t have a clue on how to build the business plan, I suggest you hire a business consultant. With their help you will get a marketing consultant and me (maybe) as your web presence consultant. You don’t have to hire anybody if you are inclined to do it yourself. Search online for business plans. You’ll get all sorts of templates and some help on how and why to use them. I recommend Sean Castrina, he has outlined a plan that you can download for free. I’d like to quote Sean Castrina here: “The mere exercise and discipline required to write a business plan separates those who think they want to be an entrepreneur from those who will be an entrepreneur.” ",
            "date": "Answered September 28, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jyotsna Patil",
                    "user_href": "/profile/Jyotsna-Patil-71"
                },
                {
                    "user_id": "Sanjay Soni",
                    "user_href": "/profile/Sanjay-Soni-506"
                },
                {
                    "user_id": "Soundarya Ramaswamy",
                    "user_href": "/profile/Soundarya-Ramaswamy"
                },
                {
                    "user_id": "Rachana Heggade",
                    "user_href": "/profile/Rachana-Heggade"
                },
                {
                    "user_id": "Prakash Bhosale",
                    "user_href": "/profile/Prakash-Bhosale-51"
                },
                {
                    "user_id": "Akansha Rajput",
                    "user_href": "/profile/Akansha-Rajput-45"
                },
                {
                    "user_id": "Rutuza Deshmukh",
                    "user_href": "/profile/Rutuza-Deshmukh"
                },
                {
                    "user_id": "Daniel Baker",
                    "user_href": "/profile/Daniel-Baker-272"
                },
                {
                    "user_id": "Saleem Shaik",
                    "user_href": "/profile/Saleem-Shaik-22"
                },
                {
                    "user_id": "Gurcharan Singh",
                    "user_href": "/profile/Gurcharan-Singh-385"
                },
                {
                    "user_id": "Nitin Suryawanshi",
                    "user_href": "/profile/Nitin-Suryawanshi-32"
                },
                {
                    "user_id": "Anjali Agarwal",
                    "user_href": "/profile/Anjali-Agarwal-295"
                },
                {
                    "user_id": "Swetha Ahir",
                    "user_href": "/profile/Swetha-Ahir"
                },
                {
                    "user_id": "Solanki Riteh",
                    "user_href": "/profile/Solanki-Riteh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishnu Goyal",
                "href": "/profile/Vishnu-Goyal-81"
            },
            "answer_text": "Gone are the days when you needed a hell lot of cash to invest in call center infrastructure, a team of hundreds of agents, and a big office space to accommodate. Now, if you have knowledge of how to handle calls and a smartphone, you can start a call center from scratch. With cloud telephony technology, modern call centers run in the cloud and can be set up online in minutes with zero hardware requirements. They are suitable for business and a team of every size. So, no matter if you are a team of one or have a team of thousands of support agents to take care of calls, a cloud-based call center system can take care of your business requirements. These days, leading cloud telephony companies like MyOperator offer free trials of their call center systems. To get started, you can set up a free call center online with your email ID and phone number and get your call center up and running in less than one business day. ",
            "date": "Answered June 23, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leo Lopez",
                "href": "/profile/Leo-Lopez-25"
            },
            "answer_text": "Your strategy depends on the purpose. Is this to support your product or service? Or do you want to be an outsourced service provider? Either way, there are a few universal minimum basic fundamentals: Facility: Unless your going to use a virtual workforce or work at home model, you’re going to need space. You’ll want to be strategic in site selection and balance cost against being located close to your ideal workforce demographic and accessibility. People: You’ll need to create an ideal employee profile of what skills are needed, and a plan for recruitment and training of staff and leadership personnel. Technology/Infrastructure: You’ll want workstations and high bandwidth network capabilities along with an ACD platform to support contact management. You’ll need a CRM system to manage transactions for your customer base. Process: You’ll need to have mapped out your contact flow, recommended scripts or verbiage, call handling procedures as well as department policies. You’ll also want to have goals and expectations communicated well along with roles and responsibilities. In addition you’ll need to be prepared to handle forecasting, scheduling, reporting, along with quality assurance to ensure optimal performance management. Very tip of the iceberg stuff but these are minimal essentials to getting off the ground. ",
            "date": "Answered March 25, 2018",
            "views": "228",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swetha Ahir",
                    "user_href": "/profile/Swetha-Ahir"
                },
                {
                    "user_id": "Jyotsna Patil",
                    "user_href": "/profile/Jyotsna-Patil-71"
                },
                {
                    "user_id": "Daniel Baker",
                    "user_href": "/profile/Daniel-Baker-272"
                },
                {
                    "user_id": "Sanjay Soni",
                    "user_href": "/profile/Sanjay-Soni-506"
                },
                {
                    "user_id": "Soundarya Ramaswamy",
                    "user_href": "/profile/Soundarya-Ramaswamy"
                },
                {
                    "user_id": "Gurdeep Singh",
                    "user_href": "/profile/Gurdeep-Singh-105"
                },
                {
                    "user_id": "Rachana Heggade",
                    "user_href": "/profile/Rachana-Heggade"
                },
                {
                    "user_id": "Prakash Bhosale",
                    "user_href": "/profile/Prakash-Bhosale-51"
                },
                {
                    "user_id": "Sukanya Pawar",
                    "user_href": "/profile/Sukanya-Pawar-11"
                },
                {
                    "user_id": "Akansha Rajput",
                    "user_href": "/profile/Akansha-Rajput-45"
                },
                {
                    "user_id": "Solanki Riteh",
                    "user_href": "/profile/Solanki-Riteh"
                },
                {
                    "user_id": "Saleem Shaik",
                    "user_href": "/profile/Saleem-Shaik-22"
                },
                {
                    "user_id": "Gurcharan Singh",
                    "user_href": "/profile/Gurcharan-Singh-385"
                },
                {
                    "user_id": "Rutuza Deshmukh",
                    "user_href": "/profile/Rutuza-Deshmukh"
                },
                {
                    "user_id": "Nitin Suryawanshi",
                    "user_href": "/profile/Nitin-Suryawanshi-32"
                },
                {
                    "user_id": "Anjali Agarwal",
                    "user_href": "/profile/Anjali-Agarwal-295"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ekaterina Karpina",
                "href": "/profile/Ekaterina-Karpina"
            },
            "answer_text": "Starting a call center service is not easy and requires special monitoring to bring success in establishing the customer support service. When a company’s owner decides to establish a call center service, she/he needs to determine the type of call center to establish. The call center can be an inbound call center or an outbound call center service. After deciding the type of call center, the business needs to recognize the local/state requirements. Further, the business requires a plan to bring the projected output and a plan on investment in necessary equipment to perform the business functions in a better manner. Further, companies need to pay emphasis on business marketing, accompanied by business expansion measures. ",
            "date": "Answered August 1, 2019",
            "views": "210",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Iwo Dzięciołowski",
                "href": "/profile/Iwo-Dzięciołowski"
            },
            "answer_text": "Starting the call center is surprisingly easy! Really! With new technologies new possibilities presented themselves. Now you don’t have to use stationary and really expensive equipment, that takes weeks to set up. There are plenty of cloud based call center software out there.  You really can set-up the ENTIRE call center in less than five minutes. You just register, enter your contact list and assign your agents. That’s all. Cloud based call center should have all the functionalities of traditional call centers, like: power dialerhandling of inbound and outbound callscall recording What is more, you can expect from your cloud call center even more functionalities, like: international virtual numberembedded call scriptseasy to generate rapportsWould you be interested in such cloud based call center software - I highly recommend you to check CrazyCall. We really want to make all types of connections as easy as possible! Disclaimer: I work at CrazyCall so I might be little over-enthusiastic here :D ",
            "date": "Answered November 5, 2018",
            "views": "157",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joann Alexandra",
                    "user_href": "/profile/Joann-Alexandra"
                },
                {
                    "user_id": "Mohamed Gamal",
                    "user_href": "/profile/Mohamed-Gamal-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anjali Agarwal",
                "href": "/profile/Anjali-Agarwal-295"
            },
            "answer_text": "Its very common question in mind when someone willing to start call center business. Unfortunately there are many fake contracts in indian bpo market, especially when you are start up, only you get such offers.. dont know how, but start ups only get connected to such scammers in searching for project. experienced never fall for. Lets see how to avoid those and get genuine , long term projects. Did you think, why you getting scammers in all search results?? Because you are not searching for real bpo business. or real call center projects. For example.. You arranged few computers , some furniture, few ac, cabin , chairs etc . Now you think your CALL CENTER office is ready to start. Search for projects.. What type projects exactly… most of time, you searching for data entry, copy paste, form filling, or something easy where you get assured billing for hitting keyboard keys. When your business plan is something like this , why not, you get only scammers in places. In reality, you see many big mnc’s doing something easy jobs and earning in crores. wake up dear.. NO one is fool to waste money on easy tasks.. Outsourcing industry always follow one simple logic.. Outsource Challenging tasks, keep simple ones. Unless your role is not productive , forget you get any genuine project. AT first place, you need to understand one thing very clear , whatever projects you gonna get, if its easy money for simple tasks, sure scam. More hard job, challenging tasks , sure sign of genuineness. Majority Genuine projects you may find in Outbound , Lead generation, telemarketing , sales and marketing only. MOst of time ive seen, budding entrepreneurs , tend to work on kiddish jobs and dream for big amounts n return.. Result.. fall for any scam offer, company close in next 2 or 3 months. and blame all bpo industry, all are scams in such. etc.. Dude, its you, who invited them. Instead, be realistic, work on lead generation, thats only entry for you as fresher , company start ups no matter what is your personal work experience in mncs.. when you start your own business, its fresh start only. Be prepare to do investments, not to purchase projects.. never do that. To purchase quality data sets, to hire quality staff.. Your own , your team performance is only main factor decides whether you make profit or losses. Data sets always differs with project to project. do not be overconfident you can arrange everything.. follow guidance, its for your own good. Never think, you have all connections, if you did, you wouldnt be searching for projects , you doing that means those expert resources of yours are not up to mark and lac of actual business skills. NO OFFENSE. with all these negative, just think and remove it from your thought, plans and start fresh. There are many genuine reference available .. few as client, few as genuine consultant. for good client reference try Saleem Shaik's answer to How can I start an outsourcing business? Good luck. regards Agarwal Anjali ",
            "date": "Answered June 11, 2019",
            "views": "12",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daria Zaboj",
                    "user_href": "/profile/Daria-Zaboj"
                },
                {
                    "user_id": "Zahorodnia Hanna",
                    "user_href": "/profile/Zahorodnia-Hanna"
                },
                {
                    "user_id": "Jakub Kliszczak",
                    "user_href": "/profile/Jakub-Kliszczak"
                },
                {
                    "user_id": "Anupam Joshi",
                    "user_href": "/profile/Anupam-Joshi-28"
                },
                {
                    "user_id": "Szymon Golyski",
                    "user_href": "/profile/Szymon-Golyski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adesola Michael Ayandiji",
                "href": "/profile/Adesola-Michael-Ayandiji"
            },
            "answer_text": "To set up a Call Center venture, I advise that you look at the network service providers' call centers and create a miniature model. You may start with a Call Agent who would work for a limited time until you are solvent enough to begin running shift, while you focus on pitching the need for your service to potential customers. It sure would take some time to build believers in your services, especially in Nigeria as most businesses do not focus resources in this critical unit of their business. Not forgetting, you will require the basic gadgets to smartly receive and make calls to potential and existing customers. Note that your service is essentially to provide Third-party sales support to an audience professionally. ",
            "date": "Answered October 29, 2017",
            "views": "194",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gurcharan Singh",
                    "user_href": "/profile/Gurcharan-Singh-385"
                },
                {
                    "user_id": "Rutuza Deshmukh",
                    "user_href": "/profile/Rutuza-Deshmukh"
                },
                {
                    "user_id": "Akansha Rajput",
                    "user_href": "/profile/Akansha-Rajput-45"
                },
                {
                    "user_id": "Jyotsna Patil",
                    "user_href": "/profile/Jyotsna-Patil-71"
                },
                {
                    "user_id": "Daniel Baker",
                    "user_href": "/profile/Daniel-Baker-272"
                },
                {
                    "user_id": "Ranjit Bar",
                    "user_href": "/profile/Ranjit-Bar"
                },
                {
                    "user_id": "Prakash Bhosale",
                    "user_href": "/profile/Prakash-Bhosale-51"
                },
                {
                    "user_id": "Swetha Ahir",
                    "user_href": "/profile/Swetha-Ahir"
                },
                {
                    "user_id": "Soundarya Ramaswamy",
                    "user_href": "/profile/Soundarya-Ramaswamy"
                },
                {
                    "user_id": "Nitin Suryawanshi",
                    "user_href": "/profile/Nitin-Suryawanshi-32"
                },
                {
                    "user_id": "Saleem Shaik",
                    "user_href": "/profile/Saleem-Shaik-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jenny James",
                "href": "/profile/Jenny-James-11"
            },
            "answer_text": "Starting a call center business can be an effective way to earn income while operating your own business. Application process: The application form for a Business Process Outsourcing entity differs with respect to various entities. With some organizations, the application procedure is easy as they have online application forms that can be filled out. Collecting important details: When an entrepreneur is trying to make repeated applications to a client that is yet to come back with an answer, they can highlight the following aspects. Important business decisions: The basic factor in starting a successful call center is deciding its nature of operations. Following are the major options available in this regard. Guidelines for starting a new BPO: The call centers are registered, as per the company established rules, under the Other Service Provider category. ",
            "date": "Answered December 2, 2017",
            "views": "353",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kioiyibo Fiyasiri",
                    "user_href": "/profile/Kioiyibo-Fiyasiri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sachin Bhatia",
                "href": "/profile/Sachin-Bhatia-6"
            },
            "answer_text": "The most important thing to consider is why?  Are you setting up a Inhouse call center for your company or a BPO.  I assume you are referring to a BPO. Then the most important question is who are your customers and what process? Usually pay for performance Telemarketing is easiest to setup. Check with franchise/Vendor teams of Telcos / Banks in your region.  The actual operations requires Technology and people. This can wait till you figure out business process.  Cheers! ",
            "date": "Answered March 30, 2015",
            "views": "356",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Venessa Miller",
                    "user_href": "/profile/Venessa-Miller-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dominic Lin",
                "href": "/profile/Dominic-Lin-6"
            },
            "answer_text": "Depending on which location and customer you are serving. Things to consider: HR - How many staff do you need? Working hours? Salary? Will you be the one hiring and managing them yourself?Operations & Training - What’s the workflow? Who does the training?Infrastructure - Electricity, Internet, suitable work space, computers, call centre software and hardware. Solutions depend on item 1 and 2, budget and how long do you want to do this for?Administrative - Any business incorporation, corporate secretary, local licensings, accounting and bookkeeping needed? Who does this?Sales & Marketing - Where’s business going to come from?That’s off my head with my experience setting up business process outsourcing (BPO) facilities in Philippines and Malaysia. Enjoy the journey and have fun! ",
            "date": "Answered September 28, 2017",
            "views": "339",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jyssica Schwartz",
                "href": "/profile/Jyssica-Schwartz"
            },
            "answer_text": "The first thing you would need to do would be to have calls to answer, so before you worry about a staff or call center, you need to identify a company or client who need call center services, reach out and get a contract signed. Once you have a contract and money on the table, THEN you would worry about hiring temps or freelancers to fulfill the needs of that client, before worrying about office space and marketing and hiring permanent employees, and such. Always focus on clients first. ",
            "date": "Answered January 18, 2018",
            "views": "186",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mayank Rawat",
                    "user_href": "/profile/Mayank-Rawat-2"
                },
                {
                    "user_id": "Shaista Haque",
                    "user_href": "/profile/Shaista-Haque"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nina Kozlowska",
                "href": "/profile/Nina-Kozlowska-1"
            },
            "answer_text": "To set up a center you can follow these steps: 1. Have the right people on board. 2. Ensure language proficiency. 3. Focus on your customers. 4. Set clear team goals. 5. Take a closer look at your scripts. 6. Leverage & integrate call center software 7. Keep up with the global call center market. Here you can find the full guide on that topic: 7 tips to create a five-star call center!  Hope I helped :) ",
            "date": "Answered February 25, 2020",
            "views": "320",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Juan Ramirez",
                    "user_href": "/profile/Juan-Ramirez-325"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Aimon",
                "href": "/profile/John-Aimon-1"
            },
            "answer_text": "I knew a man who went to local furniture stores in his area. He offered to call their customers and perform a survey regarding the experience the customer had in making purchases at that store. That’s how he got started. Some years later, he had contracts with Volkswagen, Porsche, BMW and other clients in the automotive field providing…. guess what….. satisfaction surveys on automobile purchases and service for the service department. You don’t have to start big. This is an example of what you can do. And if you feel like you don’t have the skills to write the surveys, there are tons of internet sources where you can hire a writer to develop a transcript for you. Good luck! ",
            "date": "Answered October 25, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cecil Williams",
                "href": "/profile/Cecil-Williams-5"
            },
            "answer_text": "Baleke, If I were going to start one, I would emulate Apple on a small scale. Rather than an army of techs to answer the questioners' phonecalls, they have a call back system. That works for the customer because one is not waiting and waiting and waiting…. It works for the company because the call center workforce does not have to be so large. Good luck. Carver Wrightman alias Cecil R. Williams ",
            "date": "Answered December 9, 2019",
            "views": "173",
            "upvotes": " Answer requested by Balgobin Raakesh and Baleke Kaluba",
            "upvoters": [
                {
                    "user_id": "Joshua Griffin",
                    "user_href": "/profile/Joshua-Griffin-88"
                },
                {
                    "user_id": "Ostap Yaroshevych",
                    "user_href": "/profile/Ostap-Yaroshevych-1"
                },
                {
                    "user_id": "Lisa Plitnichenko",
                    "user_href": "/profile/Lisa-Plitnichenko"
                },
                {
                    "user_id": "Nitin Bajaj",
                    "user_href": "/profile/Nitin-Bajaj-24"
                },
                {
                    "user_id": "Alex Pechenizkiy",
                    "user_href": "/profile/Alex-Pechenizkiy"
                },
                {
                    "user_id": "Zobia Zuberi",
                    "user_href": "/profile/Zobia-Zuberi"
                },
                {
                    "user_id": "Kateryna Davydova",
                    "user_href": "/profile/Kateryna-Davydova-1"
                },
                {
                    "user_id": "Denys Cherkasov",
                    "user_href": "/profile/Denys-Cherkasov"
                },
                {
                    "user_id": "Olga Pogozheva",
                    "user_href": "/profile/Olga-Pogozheva"
                },
                {
                    "user_id": "Yuliia Dekhtiarova",
                    "user_href": "/profile/Yuliia-Dekhtiarova"
                },
                {
                    "user_id": "Stella Mcqeen",
                    "user_href": "/profile/Stella-Mcqeen"
                },
                {
                    "user_id": "Nikita Kliushun",
                    "user_href": "/profile/Nikita-Kliushun"
                },
                {
                    "user_id": "Vadym Antsyferov",
                    "user_href": "/profile/Vadym-Antsyferov"
                },
                {
                    "user_id": "Berenika Teter",
                    "user_href": "/profile/Berenika-Teter"
                },
                {
                    "user_id": "Gena Kotov",
                    "user_href": "/profile/Gena-Kotov"
                },
                {
                    "user_id": "Elen Udovichenko",
                    "user_href": "/profile/Elen-Udovichenko"
                },
                {
                    "user_id": "Sasha Andrieiev",
                    "user_href": "/profile/Sasha-Andrieiev"
                },
                {
                    "user_id": "Iryna Bilyk",
                    "user_href": "/profile/Iryna-Bilyk-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vikram Singh",
                "href": "/profile/Vikram-Singh-21"
            },
            "answer_text": "The question is not specifc enough about, what is that you need help with.  You can start with nothing just a commerial telephone line. If you have money to invest you can have all the tech setup first. Telecom providers can do end to end setup for you. ",
            "date": "Answered May 27, 2015",
            "views": "476",
            "upvotes": " Answer requested by Gaurav Pal",
            "upvoters": [
                {
                    "user_id": "Anjali Agarwal",
                    "user_href": "/profile/Anjali-Agarwal-295"
                },
                {
                    "user_id": "Jyotsna Patil",
                    "user_href": "/profile/Jyotsna-Patil-71"
                },
                {
                    "user_id": "Tania Burgess",
                    "user_href": "/profile/Tania-Burgess-6"
                },
                {
                    "user_id": "Sanjay Soni",
                    "user_href": "/profile/Sanjay-Soni-506"
                },
                {
                    "user_id": "Rutuza Deshmukh",
                    "user_href": "/profile/Rutuza-Deshmukh"
                },
                {
                    "user_id": "Daniel Baker",
                    "user_href": "/profile/Daniel-Baker-272"
                },
                {
                    "user_id": "Saleem Shaik",
                    "user_href": "/profile/Saleem-Shaik-22"
                },
                {
                    "user_id": "Nitin Suryawanshi",
                    "user_href": "/profile/Nitin-Suryawanshi-32"
                },
                {
                    "user_id": "Soundarya Ramaswamy",
                    "user_href": "/profile/Soundarya-Ramaswamy"
                },
                {
                    "user_id": "Swetha Ahir",
                    "user_href": "/profile/Swetha-Ahir"
                },
                {
                    "user_id": "Rachana Heggade",
                    "user_href": "/profile/Rachana-Heggade"
                },
                {
                    "user_id": "Prakash Bhosale",
                    "user_href": "/profile/Prakash-Bhosale-51"
                },
                {
                    "user_id": "Sukanya Pawar",
                    "user_href": "/profile/Sukanya-Pawar-11"
                },
                {
                    "user_id": "Akansha Rajput",
                    "user_href": "/profile/Akansha-Rajput-45"
                },
                {
                    "user_id": "Gurcharan Singh",
                    "user_href": "/profile/Gurcharan-Singh-385"
                },
                {
                    "user_id": "Solanki Riteh",
                    "user_href": "/profile/Solanki-Riteh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Murray Trepel",
                "href": "/profile/Murray-Trepel"
            },
            "answer_text": "If you have to ask this question then you probably need to hire someone who has done it. You need to be knowlegable in a very diverse and often unrelated set of areas. For example, call forecasting vs property and facilities management. Employment law vs telecommunications implementation. Call centers are complex operations that look simple on the surface but are not so simple to create and run. ",
            "date": "Answered October 1, 2017",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ayah Osama",
                "href": "/profile/Ayah-Osama-4"
            },
            "answer_text": "Determine where you want to open your call center choose a highly educated country like Egypt for Example (Cairo Governorate), then establish clients, I know a company called Fusion Global Services, its headquarter is in the UK, but its operating office is in Cairo, Egypt, they are one of the most growing startups in Egypt now serving different clients internationally. ",
            "date": "Answered March 27, 2018",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sudeep Nadukkandy",
                "href": "/profile/Sudeep-Nadukkandy"
            },
            "answer_text": "Sachin is right. Your infrastructure will depend on who your clients are. You can even start with one line and  sheets of paper or you can have leased lines and switching equipment and large servers. ",
            "date": "Answered March 30, 2015",
            "views": "218",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arpit Porwal",
                "href": "/profile/Arpit-Porwal-2"
            },
            "answer_text": "Contact to the outsourcing agencies...But be sure about the genuineness.. ",
            "date": "Answered March 27, 2015",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ameed Jamous",
                "href": "/profile/Ameed-Jamous-2"
            },
            "answer_text": "This presentation explains how to Start Call Center Business in 24 hours ",
            "date": "Answered August 2, 2017",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rohit Saini",
                "href": "/profile/Rohit-Saini-395"
            },
            "answer_text": "I need a bussiness n 4 ",
            "date": "Answered April 13, 2018",
            "views": "19",
            "upvotes": "0"
        }
    ]
}