{
    "title": "How many VHS tapes can you fit on a DVD? - Quora",
    "tags": [
        "Tapes",
        "Videotapes",
        "VHS"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Vargas",
                "href": "/profile/Chris-Vargas-12"
            },
            "answer_text": "It depends on what speed the VHS tapes were recorded at, and how much quality you want/need from the DVD recording.  Tapes were usually recorded in SP, which gave 2 hours per tape. (There were also 4 and 6 hour settings at lower recording quality if you really wanted to jam a lot of material on a tape.) With a DVD, an acceptable bitrate for recording something as low res as VHS would be 4 megabits per second. (DVD supports as high as 10 megabits per second but that's overkill for VHS) On a single layer recordable disc, that bitrate gives you about 2 hours.  So, the answer is: one tape. Two if it's a dual layer disc.  Of course you can lower the bitrate and get more tapes on, but image quality will suffer.  ",
            "date": "Answered January 25, 2016",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jon Walker",
                    "user_href": "/profile/Jon-Walker-139"
                },
                {
                    "user_id": "Joseph O'Shea",
                    "user_href": "/profile/Joseph-OShea-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Vanderschel",
                "href": "/profile/David-Vanderschel"
            },
            "answer_text": "Less than one VHS tape recorded at EP speed. Maybe one if you are willing to compromise quality on the DVD recording. One for SP speed and a good recording. If you were to use a good codec like H.264, you could put files for a lot more than 6 hours on a DVD, but few DVD players could play it. A computer could. ",
            "date": "Answered May 16, 2020",
            "views": "427",
            "upvotes": "0"
        }
    ]
}