{
    "title": "How will the economy be in the next 20 years? - Quora",
    "tags": [
        "International Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Apoorva Bhide",
                "href": "/profile/Apoorva-Bhide"
            },
            "answer_text": "Nobody knows shit. We could be serving our AI overlords, or barter trading seeds and water in a post-apocalyptic wasteland, or you know, living the same dreary lives in our grey, slightly shabbier monolithic cities. 20 years? I don’t know shit about how the economy is going to look like in 20 years. Neither does the guy with 8,000 upvotes. In 1967, Herman Kahn, by all standards a smart man, wrote a book called The Year 2000: A Framework for Speculation on the Next Thirty-three Years. Among other things, the book predicted that 30-hour workweeks, with 13-week vacations per year, would be the norm in 2000. That, in case you missed it because you were working, did not happen. He made a lot of other predictions too: you can read a fact-checked list here. Among his other predictions were underwater cities, rockets for transportation, and even practical, large-scale desalinisation. Among his 100 ‘likely’ predictions, 27 are hits. Among his 25 ‘Less likely but possible’ predictions, one is a partial hit. Among his ten far-out possibilities, none have happened. Then, in the year 1998, the famous economist Paul Krugman, then a professor of economics at MIT, wrote about this Herman Kahn book, in an article titled ‘Why most economists' predictions are wrong’. In the article, he wondered why, by all measures, technology made less, not more, progress than Herman Kahn thought. He made the joke written above, that most people were probably too busy working to notice they didn’t have more vacation days. Then, at the end of that very same article, Paul Krugman predicted that the growth of the Internet would slow down drastically after 2005. He went on to say that the number of jobs created by Silicon Valley would decelerate dramatically, and then even decrease, all in the span of 10 years. “Ten years from now,” he wrote in 1998, “the phrase information economy will sound silly.” That statement has not aged well. Economists have failed to predict 148 of the last 150[1] recessions. In 1929, just three days before the Great Depression, Irving Fisher, considered the greatest economist of his time, said “Stock prices have reached what looks like a permanently high plateau.” A whole lot of economists, including the ones in charge of the US economy, made a whole lot of such predictions 10 years ago and screwed up, not for a lack of intelligence. I don’t want to knock the desire behind trying to predict what the economy will look like in 20 years. Trying to predict the future lets us feel a little less uncertain about what it holds. A big, blank unknown is scary - so we extrapolate, and then glorify those extrapolations with all kinds of bells and whistles. More than that, predicting the future, from the outcome of tomorrow’s game to what the economy will look like in 20 years, is challenging and just plain fun. The trick, to me, is not being married to those predictions. The world will pants you every chance it gets, no matter who you are. The most important part of the other answers, the only part definitely right, is that there will be change. You can be sure that technology will change, and the economy will go up or down and make no sense (except in retrospect, when it is trivial). You can also be sure that humans will still be humans, with all our monumental stupidity and hubris and greed and ignorance and bias. If you can play with that, you don’t need your predictions to be right, and you can succeed in any economy. Footnotes[1] Why economic forecasting has always been a flawed science",
            "date": "Answered April 21, 2018",
            "views": "14",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frédéric Uhrweiller",
                    "user_href": "/profile/Frédéric-Uhrweiller"
                },
                {
                    "user_id": "Benyamin Degefa",
                    "user_href": "/profile/Benyamin-Degefa"
                },
                {
                    "user_id": "Lu Elizondo",
                    "user_href": "/profile/Lu-Elizondo"
                },
                {
                    "user_id": "Prashant Kumar",
                    "user_href": "/profile/Prashant-Kumar-3489"
                },
                {
                    "user_id": "Ayyappan Pillai",
                    "user_href": "/profile/Ayyappan-Pillai"
                },
                {
                    "user_id": "Siddarth Tiwari",
                    "user_href": "/profile/Siddarth-Tiwari"
                },
                {
                    "user_id": "Swarali Vaidya",
                    "user_href": "/profile/Swarali-Vaidya"
                },
                {
                    "user_id": "Smit Mehta",
                    "user_href": "/profile/Smit-Mehta-6"
                },
                {
                    "user_id": "Yash Khandelwal",
                    "user_href": "/profile/Yash-Khandelwal-6"
                },
                {
                    "user_id": "Abhishek Kumar Singh",
                    "user_href": "/profile/Abhishek-Kumar-Singh-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asim Qureshi",
                "href": "/profile/Asim-Qureshi-17"
            },
            "answer_text": "Automation is going to be the next big shaper of the world economy. I mean, within a decade McDonald’s will be rolling out fully-automated kitchens. And much of the rest of the industry will follow. We’re going to see self-driving cars, trucks and planes. Robot cleaners. Cashiers in supermarkets are already disappearing through self-checkouts - next will be automatic-checkouts. In all of this disruption there will be 3 distinct groups, each affected very differently; Business-owners. They will benefit massively from the lower costs of robots vs humans. Expect the rich to get much much richer.Skilled/Knowledge workers. General gains in their own productivity will mean higher salaries.Unskilled workers. Many of their jobs will be replaced by robots - salaries will fall, unemployment rise. It’ll be very tough at the bottom. Being unskilled will be the equivalent of being illiterate today.Now, who will these business-owners sell to if many unskilled workers lose their jobs? Well, the increased spending of business-owners and skilled workers will more than offset the reduction in spending of unskilled workers. Business-owners will be fine. Ok, so what does this mean to you? If you’re training for a job, make sure it’s technology or automation-proof. Don’t train now to become a commercial aviation pilot, for example.Invest in yourself, invest in gaining skills.Get into artificial intelligence, or, at least, head towards a technology-related job.Consider becoming an entrepreneur. There has never been a better time.",
            "date": "Answered December 25, 2017",
            "views": "1261",
            "upvotes": " View 8.5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishal Ugle",
                    "user_href": "/profile/Vishal-Ugle"
                },
                {
                    "user_id": "Duan Guowei",
                    "user_href": "/profile/Duan-Guowei"
                },
                {
                    "user_id": "Orgil Batbold",
                    "user_href": "/profile/Orgil-Batbold-1"
                },
                {
                    "user_id": "Kunal Joshi",
                    "user_href": "/profile/Kunal-Joshi-68"
                },
                {
                    "user_id": "Nikhil Kandoi",
                    "user_href": "/profile/Nikhil-Kandoi-2"
                },
                {
                    "user_id": "Nabilah",
                    "user_href": "/profile/Nabilah-5"
                },
                {
                    "user_id": "Sahil Jindal",
                    "user_href": "/profile/Sahil-Jindal-36"
                },
                {
                    "user_id": "Aditya Sanehi",
                    "user_href": "/profile/Aditya-Sanehi"
                },
                {
                    "user_id": "Zane Mars",
                    "user_href": "/profile/Zane-Mars"
                },
                {
                    "user_id": "Ravi Sobwani",
                    "user_href": "/profile/Ravi-Sobwani-1"
                }
            ]
        }
    ]
}