{
    "title": "How does Mathematics relate to technology? - Quora",
    "tags": [
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Baker",
                "href": "/profile/Steve-Baker-100"
            },
            "answer_text": "Well, without mathematics, most technology would be impossible. Here’s a good example: Right now, I’m building an Internet-of-Things gadget. It’s a tiny computer with a sensor and a WiFi connection. The rechargeable battery lasts for months of normal use - but I want it to email you a few days before it runs down so you can plug it in and recharge it before it dies completely - and while it still has enough battery life left to actually send the email! This requires modeling the rate at which the voltage of the battery declines as it discharges and the way that this rate changes as the battery gets older. With that mathematical model boiled down to an equation, I can plug in the voltage I’m currently measuring from the battery and figure out how many days of battery life I have left. There is math involved in doing that. Without the math…I dunno…maybe the thing would email you way too often - or way too late. Either way would be bad! But every single aspect of modern technology is suffused with math. Math is the means to apply physics…and physics is the way to understand how things work…and understanding how things work is what makes all of technology possible. ",
            "date": "Answered January 5, 2017",
            "views": "43",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhan Riyadh Bibat",
                    "user_href": "/profile/Dhan-Riyadh-Bibat"
                },
                {
                    "user_id": "Eric John",
                    "user_href": "/profile/Eric-John-67"
                },
                {
                    "user_id": "Roxanne Smith",
                    "user_href": "/profile/Roxanne-Smith-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Felipe Razo",
                "href": "/profile/Felipe-Razo"
            },
            "answer_text": "Great question in need of answers. The same as for all other subjects in the blessed “STEM/STEAM” acronyms). Caring engineers, as well as scientists of all kinds should care and be concerned about how Mathematics, as well as Science, Technology, and the Arts relate and support each other. Else, the chaotic and demagogic curricula we see today, from Kindergarten to professional studies. Sorry for the prolonged introduction, here is my view: A reasonable definition of Technology is: “the SCIENCE of TOOLS”. Mathematics refers to the various mental, physical and virtual (computer supported, “abstract”) tools that help us implement accuracy (fine measure) and precision (trustworthiness) on the things we do. Math therefore can assist technologies by making them more effective (more “bang for the buck”) and efficient (cheaper, faster, safer). Thank you very much for your attention. ",
            "date": "Answered June 2, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}