{
    "title": "How true is it that countries usually have a possible attack plan on their neighbors? - Quora",
    "tags": [
        "Military Strategy",
        "Invasions",
        "Terrorism",
        "Warfare",
        "Military",
        "Military History and Wars ",
        "Countries of the World",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "James W. Hoover",
                "href": "/profile/James-W-Hoover"
            },
            "answer_text": "At one time or another they probably do. I recall someone at the Pentagon once making an argument for a massive augmentation of U.S. airpower that provided a list of potential adversaries that included countries like Canada, the U.K., and France. They were just trying to inflate the number of “potential enemy aircraft” out there, and maybe hoping that some Congressman or Senator wasn’t paying close attention. In the late 19th century, the U.S. definitely developed plans for an attack on Canada in the event of a war with Britain. The scenario was extremely unlikely, even then, but the “war plan” was nevertheless a reality. A similar plan existed for Mexico, and - of course - there was a military intervention in Mexico in 1916–1917, during the Mexican Revolution. Earlier in its history, the U.S. had fought wars with both Canada/Britain and Mexico, so there was at least a historic precedent for conflict. Some countries don’t need attack plans for anyone, and many probably don’t have any. Some countries probably really do need to worry about their neighbors, and plan accordingly. Anyone sharing a border with China, for instance, probably needs to be thinking right now about how to defend themselves. ",
            "date": "Answered June 24, 2020",
            "views": "71",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gerry Surette",
                    "user_href": "/profile/Gerry-Surette-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Pratt",
                "href": "/profile/David-Pratt-20"
            },
            "answer_text": "Almost absolutely true. If nothing else drawing up plans for an attack on your neighbours is a good training exercise for officers joining your general staff. Monaco has an army 255 strong but I would bet they have plans for attacking France and quite possibly Italy too. Italy entirely surrounds and provides the defence forces for the Vatican City which has no armed forces but I would be surprised if the 134 strong Swiss Guard do not have a plan for attacking Italy after all the Parliament building is less than two miles away from them. It is a rarely acknowledged fact that in many countries amongst the contingency plans are those to handle a Zombie Apocalypse - not because one is expected but because it is a good training exercise forcing planners to think outside the box. These best of these plans are kept for post planning evaluation of later candidates who are given the same exercise. ",
            "date": "Answered June 17, 2020",
            "views": "80",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ed Hakobyan",
                    "user_href": "/profile/Ed-Hakobyan"
                },
                {
                    "user_id": "Bird J. Onion",
                    "user_href": "/profile/Bird-J-Onion"
                },
                {
                    "user_id": "Mark Jeffrey",
                    "user_href": "/profile/Mark-Jeffrey-15"
                }
            ]
        }
    ]
}