{
    "title": "How will gas cars be banned? Will I be able to still buy gas? - Quora",
    "tags": [
        "Gasoline",
        "Bans and Banning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Baxter",
                "href": "/profile/Michael-Baxter-63"
            },
            "answer_text": "I’m sure we will always be able to buy gas and to drive classic cars (hey - they need them for movies). Looks like gas cars for sale will be gradually forced out by regulation if the economics of them don’t drive everybody to electrics anyway. The way to think about this is that for both gas cars and the gas they use, as the market for them shrinks their cost will inevitably go up - but not steadily. Mass production lowers costs. On the other hand when supply exceeds demand costs to buy existing stock go down - but only temporarily because manufacturers start to close factories to tailor the supply to the demand and as they produce less the research costs to come out with new models start to cost more per car. So they cut the number of models. So their market shrinks more - etc., etc. in a downward spiral. As gas stations start to shrink in number they start to become harder to find and fewer people want a gas car in that situation. Another downward spiral. Costs will go up and down along the spiral but electrics cars will become the norm one way or another. I should not totally exclude hydrogen but everyone has electricity in their homes which makes charging very convenient but how many homes have or want to add hydrogen? 90% or more of charging is done at home. ",
            "date": "Answered July 5, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ernie Dunbar",
                "href": "/profile/Ernie-Dunbar-1"
            },
            "answer_text": "The only proposals yet made for banning gas cars is to ban the sale of new gas cars at some distant point in the future, usually 10–15 years from now, and since those proposals were only made in the past year, that means: Ban on petrol and diesel car sales brought forward to 2035 (at the soonest). So first, you’re safe buying gasoline for the next 30–40 years at least. There will be a market for the stuff for a good 20+ years after any such ban goes into effect, since most of the cars produced the year before the ban will survive for a good 20 years. However, even as a big fat Greenie, I think… Nine countries say they’ll ban internal combustion engines. So far, it’s just words. The fact is that any modern democratic government won’t have the same ruling party in 10–15 years. Any government enacting such a proposal knows this, and thus, is a meaningless gesture. One of three things will result: Industry makes electric vehicles cheap enough to compete at the point of sale (making the gesture useless), a future election will make the deadline an election campaign promise (either to repeal the law or enforce it) and the electorate will decide at that time (making the gesture useless), or it will actually be completely forgotten in favour of more pressing matters (making the gesture useless). It’s mostly hot air. ",
            "date": "Answered July 5, 2020",
            "views": "97",
            "upvotes": "0"
        }
    ]
}