{
    "title": "How to repair a Lenovo laptop's broken screen - Quora",
    "tags": [
        "Laptop Screens",
        "Lenovo Laptops",
        "Lenovo",
        "Laptops",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Max Debbarma",
                "href": "/profile/Max-Debbarma"
            },
            "answer_text": "You can do it yourself here is the guide -  When You Should Try Fixing : Honestly, if you are already into technical blogs and repairs you must give it a try, there are so many DIY guides available these days. DIY videos are also recommended for this as you may find thousands of them on YouTube. Yet I must tell you If accidental damage is covered under your laptop’s warranty, don’t do this fix yourself. Get the laptop repaired under the warranty. Again for those Not-so-techy friends out there, better not to take a chance with your laptop. You have our call-to-action right below this paragraph, Before you get a heart-attack trying to fix it up, please let us know if you need any help for your Laptop Screen Repair. What you need : Flat working area ( Table ) : You’ll need a spot to sit with a flat area to work on your laptop, Preferably a table. Find a clean and noise free space so that you can concentrate. Small-head magnetic Philips screwdriver: Not small like a mini screwdriver from an eyeglass repair kit, but I’d say between that size and a mid-sized screwdriver would work. If you don’t have a magnetic-head screwdriver, try to find a magnet big enough to magnetize the driver head. This helps the screws stick to the head, making it much easier to remove and replace the screws without cursing as they fall all over the place. Safety pin or needle: This is for removing the cover stickers that are hiding the screws on your laptop’s surrounding cover, called the bezel. Plastic putty knife or other thin object: This is optional, to aid in prying apart the screen bezel from the case. Personally, my finger nails usually do the trick. If you do use another object, ensure it’s thin enough but not so sharp that it will leave scrapes or other evidence of prying. Small bowl or other container: This is for stashing the small screws — and keeping them safe from curious cats and children. LAPTOP SCREEN REPLACEMENT 1. Remove the screen bezel: First, you need to disconnect the power supply and then after removing the battery you have to cautiously look at the bezel around the screen. You’ll need to remove this bezel to access the screws that hold the LCD panel in place. Then you will get to see several rubber cushions hiding screws, which hold the bezel in place. So now you need to remove these cushions and the screws that are underneath. 2. Remove the broken LCD panel: You need to get your LCD’s mounting brackets exposed, then you can remove the screws that secure it to the lid. Then leave the display front-side-down on the case and disconnect its cable. 3. Install the new LCD panel: Once your new screen arrives, unpack it and make sure it matches the old one. If the dimensions, mounting brackets, and connector all match, you ready to install the screen. Connect the new panel to the cable, position the panel in the lid, and secure it using the appropriate screws. 4. Test the new LCD panel and reinstall the bezel: Before reattaching the bezel, it’s a good idea to test the new panel. Reconnect the battery and power cable and turn the machine on. If the display works, you can reattach the bezel and any external screws and rubber cushions. The repair is now complete. IF YOU WANT TO KNOW MORE DETAILS PLEASE VISIT LAPTOP SCREEN REPLACEMENT GUIDE.  ",
            "date": "Answered November 9, 2016",
            "views": "48",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ramon VlogWriter",
                    "user_href": "/profile/Ramon-VlogWriter"
                },
                {
                    "user_id": "Ain Suhaimi",
                    "user_href": "/profile/Ain-Suhaimi-1"
                },
                {
                    "user_id": "Sumona Roy",
                    "user_href": "/profile/Sumona-Roy-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Lee",
                "href": "/profile/Alex-Lee-481"
            },
            "answer_text": "Should you do the repair yourself? Only if you already have experience, or you want to take up a new and challenging hobby. It's a lot more difficult than swapping a hard drive or adding RAM.   If you decide to have a professional do the job, go with a local repair shop over the manufacturer or a big box store. You won't get caught up in red tape, you don't have to ship things back and forth, and you're more likely to get personal service. Ask friends or check Yelp for recommendations.  I haven't found a site that can replace the older and kinder ScreenTek, but there are other ways to find screens. You can search eBay--be sure to include the make and model number in your search. A Google shopping search can also provide useful results, although most of them will be on eBay. ",
            "date": "Answered March 30, 2016",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Heather Lee",
                    "user_href": "/profile/Heather-Lee-498"
                }
            ]
        }
    ]
}