{
    "title": "How to improve the quality of my professional presentation - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Isabella Sevilla",
                "href": "/profile/Isabella-Sevilla"
            },
            "answer_text": "Hi there! Although you already created the content for your presentation, you need to modify the design of it so it doesn’t look a little dull. What can you do to enhance the looks of your presentation without spending too much time? Well, we got you covered! Here are 5 easy tweaks that will take no time from you and will dramatically improve your slides! Take a look at this Slidebean presentation: As you can see, the slides have relevant information, and they're looking OK, but still they feel a little meh. Let's awesomize them one by one shall we? Slide 1:   WHAT CAN YOU CHANGE? 1. Capitalize the title: Simple things like these help emphasise a particular phrase/word, and break the monotony of the body of text, making it more appealing to the eye. 2. Make columns: If you only have a big paragraph in your slide, try breaking it up into several columns. Chunks of information are way easier to read, and smaller lines also help with readability. 3. Image as background: From time to time, try making things a little more interesting by adding an image as the foreground of your slide. It gives a sense of depth and adds contextual visuals to the info in your slide. Just make sure to dim it so the text is not lost with the textures and shades of the photo. “Adding an image as the foreground of your slide gives it a sense of depth and adds contextual visuals to the info in your slide TWEET IT!  Slide 2:   WHAT CAN YOU CHANGE? 1. Make the font bigger: Do this as often as possible. It forces you to keep text blocks shorter, and it makes the information more accesible. 2. Quote + Image: A cool way of making your quote even more memorable is to include a picture of the author. Related Read: Presentation Design Inspiration: Epic Slide Ideas  Slide 3:  WHAT CAN YOU CHANGE? 1. Break the slide: This slide simply has too much text. Bullets are ok for short sentences, but when each line becomes a paragraph like the ones in this slide, it becomes too hard to read. The best you can do is break the information into several slides, to give each piece of information the relevance needed. The Result:      Slide 4:   WHAT CAN BE CHANGED? 1. If you can't split it, rearrange it: If your slide is a little overcrowded, but for some reason you can't split it, try rearranging the content to ease the pain of reading all the information. In this slide, we've implemented several of the tweaks mentioned before. We've rearranged the content, using a three column structure; we've added an image as background and capitalized the titles of each block; and as a final touch, we've included an icon to better differentiate the chunks of info.  Slide 5:  WHAT CAN BE DONE? 1. Make images bigger: If you include an image, let it have its say in your slide. People tend to make images appear as thumbnails in their slides, making them look as mere decoration instead of an intended part of the message. Related Read: How Do I Know if my Presentation Sucks? THE RESULT:  Now, that's better!  Better yet, go for fullscreen! Now let's checkout the finished result put together: START YOUR OWN PRESENTATION Making your presentation stand out doesn't have to take hours. Use these simple changes in your next deck and it's guaranteed you'll be complimented on your slides! ",
            "date": "Answered October 31, 2016",
            "views": "749",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alfred Naranjo",
                    "user_href": "/profile/Alfred-Naranjo"
                },
                {
                    "user_id": "Vinu Menon",
                    "user_href": "/profile/Vinu-Menon-8"
                },
                {
                    "user_id": "Mayank Jain",
                    "user_href": "/profile/Mayank-Jain-139"
                },
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-3860"
                }
            ]
        },
        {
            "author_info": {
                "name": "David S. Rose",
                "href": "/profile/David-S-Rose"
            },
            "answer_text": "The fact that you're here asking for support speaks very well for you, and deserves to be taken in the spirit in which the question was asked. And, under the heading of 'tough love' that means not pulling any punches. The bottom line is that the presentation as it currently stands is completely useless. There is not an investor on the planet who will still be watching it 30 seconds after it starts playing. It appears to have been created by someone who has done no background research or reading whatsoever on pitch presentations and who, even worse, has never seen anyone else's presentations. Rather than go point by point through suggestions (which have already been very well done by Tatiana Estévez and Jay Wacker, and in any case would be akin to trying to empty the ocean with a teaspoon) let me help here by pointing you to various resources that will help you start back at the beginning so you can do this right. For the super-quick video introduction on how to do a venture pitch, watch this video I did for TED. Although it was done half a decade ago, it has had over half a million views and is still completely valid: http://www.ted.com/talks/david_s_rose_on_pitching_to_vcs.html Then go get and read the following three books on the subject: PresentationZen by Garr Reynoldshttp://www.amazon.com/Presentation-Zen-Simple-Delivery-Edition/dp/0321811984/ Slide:ology by Nancy Duartehttp://www.amazon.com/slide-ology-Science-Creating-Presentations/dp/0596522347/ Presenting to Win by Jerry Weissmanhttp://www.amazon.com/Presenting-Win-Telling-Updated-Expanded/dp/0137144172/ Between the video and the books, you will be a transformed presenter, and I can't wait to see the next version of your presentation! ",
            "date": "Answered May 11, 2012",
            "views": "786",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Colonel Chris",
                    "user_href": "/profile/Colonel-Chris"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/DJ-Park"
                },
                {
                    "user_id": "Pratyush Agarwal",
                    "user_href": "/profile/Pratyush-Agarwal"
                },
                {
                    "user_id": "Siddharth Nair",
                    "user_href": "/profile/Siddharth-Nair-2"
                },
                {
                    "user_id": "Nikolaus Piccolotto",
                    "user_href": "/profile/Nikolaus-Piccolotto"
                },
                {
                    "user_id": "Ghalib Suleiman",
                    "user_href": "/profile/Ghalib-Suleiman"
                },
                {
                    "user_id": "Brad Silverman",
                    "user_href": "/profile/Brad-Silverman"
                },
                {
                    "user_id": "Alex Jouravlev",
                    "user_href": "/profile/Alex-Jouravlev"
                },
                {
                    "user_id": "Tracy Chou",
                    "user_href": "/profile/Tracy-Chou"
                },
                {
                    "user_id": "Xiaoyuan He",
                    "user_href": "/profile/Xiaoyuan-He"
                }
            ]
        }
    ]
}