{
    "title": "How to import from China to Dominican Republic - Quora",
    "tags": [
        "Dominican Republic",
        "Chinese Imports and Exports",
        "Import/Export",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simon Wo",
                "href": "/profile/Simon-Wo-2"
            },
            "answer_text": "In my opinion, you should be find a sourcing company in China for best results. That’s why you should do that. Mostly, you was encouraged to try Alibaba or other B2B platforms. Absolutely, it’s one of the way to find Chinese factory. But you must verify who you are talking to. There are some suppliers will say to you “we are manufacturer” even though they are not. You will never to know the truth before coming to China.Having a good communication with your supplier. It’s also a difficult thing to process because they don’t know your languages.Factories Don’t Know Online Marketing - If you are a online seller, just like Amazon, Ebay, ..etc. You will prefer to a sourcing company that solve your goods packaging. Then you don’t concern about your products FBA warehousing.Factories Didn’t Publish Their Information on their Website - What kind of products you are importing usually is the important thing of whether you can search the real factory, because you cannot find factory suppliers for every product.There some tips for you when importing from China.Revealed: 7 Things to Know Before Importing from China - ACKKA 8 Tricks for Product Sourcing in China - A Cost Down Guide for Beginner Sourcing from China: The Key to Success for Selling on Amazon | ACKKA ",
            "date": "Updated November 25, 2016",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robby Johnson",
                    "user_href": "/profile/Robby-Johnson-14"
                },
                {
                    "user_id": "Yaysi Solanyi Gonzalez",
                    "user_href": "/profile/Yaysi-Solanyi-Gonzalez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Ranos",
                "href": "/profile/Aaron-Ranos"
            },
            "answer_text": "Besides general rules for all of the countries, there are specific rules for everyone apart, so check out first the custom rules (including the items you want to import) and procedures you have to do, both for the Dominican and Chinese Republic. And secondly register on Export Portal to meet sellers, manufacturers, shippers, all around the world to do your business with safety, guaranteed payment and 24/7 consultancy. More countries is better then one. ",
            "date": "Answered February 19, 2016",
            "views": "517",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yaysi Solanyi Gonzalez",
                    "user_href": "/profile/Yaysi-Solanyi-Gonzalez"
                }
            ]
        }
    ]
}