{
    "title": "How will cloud technology look like in next 10 years? - Quora",
    "tags": [
        "Cloud Technology",
        "Future Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ganna Ustynova",
                "href": "/profile/Ganna-Ustynova"
            },
            "answer_text": "Fintech is gaining momentum, and cloud technology as a part of this ever-moving process strengthens its position. An average customer spends 11 hours per day glued to the screen. Merchants try to meet consumers needs - that’s the reason card-to-cloud transition may happen in the nearest future. People has already started to pay by scanning QR code on the smartphone, and pay straight from the virtual account. It saves time and efforts. And what do you think about card-to-cloud payments? Share you thoughts! If you want to know more about fintech trends, check the article below: 5 Trends for the Future of Payment Processing ",
            "date": "Answered December 6, 2018",
            "views": "260",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniella Acido",
                    "user_href": "/profile/Daniella-Acido"
                },
                {
                    "user_id": "Inese Grube",
                    "user_href": "/profile/Inese-Grube"
                },
                {
                    "user_id": "Chloe Ward",
                    "user_href": "/profile/Chloe-Ward-69"
                },
                {
                    "user_id": "Royce Dietrich",
                    "user_href": "/profile/Royce-Dietrich"
                },
                {
                    "user_id": "Yulia Mamonova",
                    "user_href": "/profile/Yulia-Mamonova-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rufus Delorian",
                "href": "/profile/Rufus-Delorian"
            },
            "answer_text": "Honestly, advancement in this area has been sorely lacking for centuries, I don't expect any breakthroughs in the next decade. Cumulonimbus is still seen as the industry standard despite being literally millions of years old. I think this is a result of corrupt lobbying and entrenched interests in the cloud industry. Modern technology allows for much larger clouds, my patent for Cumulocumulus stacks has been stuck in the patent office for years, whenever I ask about progress, they act as if I'm mad. So I wouldn't expect any change. Feel free to contribute to my Cumulocumulus effort by releasing large amounts of water vapour into the atmosphere. ",
            "date": "Answered December 7, 2018",
            "views": "57",
            "upvotes": " Answer requested by Gaurav Juneja"
        }
    ]
}