{
    "title": "How did people advertise before printing was invented? - Quora",
    "tags": [
        "Invention and Inventions",
        "Advertising and Advertisements"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Tisdale",
                "href": "/profile/David-Tisdale-7"
            },
            "answer_text": "Advertising is a tricky word. There really wasn’t advertising as we know it (hauberks 20% off, arbalest quarrels BOGO!) Likewise, when is before printing? So I’m assuming you mean European, post-Classical, pre-Gutenberg. If you lived in a village, you knew everybody and didn’t have coinage much. So you met your own needs, or bartered with a neighbor. Big exception were public houses, because brewing is a very skilled art. If you were a merchant or a tradesperson. or a specialist (doctor, lawyer, etc.) in the city, you probably worked out of your house, shop on the bottom, living quarters on the top. So, you had to buy provisions and you had to sell product. So, people had to know your name and profession. Making copies was a labor intensive and time consuming. And, since most people were illiterate, there wasn’t really any point to papering the neighborhood. So, most people advertised with hand-painted signs hung on the front of the shop. Other ways that people could advertise were: Word of mouthLocation. look at any map of an old city. There’ll be a Tailor Street, and a Weaver Street, and a Shambles (butchering).Announcing. You could hire people to go around shouting your spiel. Very much like the seedier side of New Orleans today, where touts try to drag you into their particular establishment.Fairs. You’d put up a stand at the fair and go for the walk-in trade.Guilds. If you were a guild member in good standing, some guild official would point potential customers in your direction.If you were an official, or a prelate. You could have copies made. But, you sent them to people who could read them (or have them read) to the correct audience. Not advertising, but communications. And, remember Marin Luther nailing his 39 theses to the door of the church? That was actually considered to be a legitimate way to express a grievance. As to monumental art; I believe it stretches the definition of advertising. It’s a sort of vanity cast in granite. ",
            "date": "Answered September 17, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suvajit Majumder",
                "href": "/profile/Suvajit-Majumder-8"
            },
            "answer_text": "Good evening kind sir.I explain myself in the following few points Advertising is the form to reach out the masses about particular product in order to say to reach mass scale output.Advertising was invented in Ancient Egypt by the form of Papyrus being used to make poster on the walls.Wall or painting on the rocks were another form of advertisements especially for the commercial advertisements, it is considered as the oldest form of advertising to reach out mass scale. It is still can be found in the parts of Africa, Asia and also in South America.Wall painting can be associated with rock art painting which has Indian origins dating back as early as 4000 BCE.In ancient china orals were famous in other words so as to say that ancient classical forms of poetry was being advertised on Bamboo flutes in order to sell candy. era was around 7th Century BCE.Now I am focussing on advertising agencies namely the most famous one in Great Britain is a person known as Thomas J Barrat who used to work for Pears shop Company. I mention him because he created an unique form of to catch mass scales was the usage of slogans as well as lucrative images and also Phrases.In the USA the advertising agency was set up by Volney B Palmer in Philadelphia in the year of 1840.Advertising in India began where hawkers calling out for people to sell their products. Advertisements appeared first time in a old newspaper called or known as Hickey’s Bengal Gazette. The Bengal Journal was first published in 1785 it also printed the advertisements on behalf of the Government free of cost in those days.Now the question will be how I know all of it thing is when I was studying in Xavier’s I had met one guy named as Akshar Grover we are no longer friends anymore due to various reasons that is a different story. Thing is Akshar’s father is a renowned journalist known as Mr. Anil Grover, my summers were spent mostly in Akshar’s home he used to have a massive library at his home with a lot of books. I had the opportunity to glance upon some of it and I still remember them with growing time. Time changes for everyone the thing I learned from my life is worth it. I am happy being a loner. Have a pleasant evening kind sir and stay safe.  The above school photo from Xavier’s class of Mr. A K Sharma shows me at the last row with high eye powered glasses me in the last row the tallest boy in the class. Akshar Grover is next to Abhijeet Dutta Second last row third boy. Also seen in this picture is Prajna Dutta ( Third Row second boy ) my class mate from Xavier’s who I met last year and also in this photo third row from the right first boy is Atideb Sarkar present CEO of ABP group limited was also my classmate in Xavier’s. ",
            "date": "Answered September 17, 2020",
            "views": "15",
            "upvotes": " Not for Reproduction "
        }
    ]
}