{
    "title": "How much does it take to be a professional hacker if I am willing to spend 5 hours per day learning? - Quora",
    "tags": [
        "Hours",
        "Hackers",
        "Computer Hacking (security)"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Bailey",
                "href": "/profile/David-Bailey-11"
            },
            "answer_text": "As you might imagine, professional hackers come with varying levels of skill and varying scopes of capabilities. Based on research by Anders Ericsson, it takes roughly 10,000 hours to become an expert in a specialized field. I doubt anyone really understands how that model adapts to Information Security, but 10,000 hours represents around 20 hours of work a week for 10 years. So if you're willing to spend five hours per day, you're looking at a little less than eight years to meet this standard. The challenge in hacking, more commonly known as penetration testing or security research, is getting into the profession. You can learn and research on your own, but you can only get so far attacking and defending systems that you own. You'll need to find others willing to entrust their systems to you to graduate to larger and more complex environments, unless you're independently wealthy and willing to spend millions of dollars to build the kinds of computing environments that most large organizations utilize today. Training, especially at the beginning, can also speed the process. Once you reach a certain level of ability, training doesn't help very much, unless it's in an environment you're unfamiliar with, or you spend time with an elite group. There are also so many areas within hacking- technical or social with a focus in either research or field operations and many different environments. While it might be possible to achieve high levels of expertise in some of these, I believe it to be virtually impossible to be current and capable in all of them. Do some research and dig in- it's an amazing career choice. One word of warning: stay away from the dark side. It will damage your career unless you want to work for organized crime for the rest of your life.  ",
            "date": "Answered April 3, 2016",
            "views": "980",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vivek Saini",
                    "user_href": "/profile/Vivek-Saini-1"
                },
                {
                    "user_id": "Venkatesh Macha",
                    "user_href": "/profile/Venkatesh-Macha-1"
                },
                {
                    "user_id": "Jigar Patel",
                    "user_href": "/profile/Jigar-Patel-184"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maxe Johnson",
                "href": "/profile/Maxe-Johnson"
            },
            "answer_text": "If you're a fast learner and want to become a professional penetration tester, then you could theoretically do it in 2 years. (As a Junior/Entry Level Consultant.) If you have an IT education, and know about how the TCP/IP protocols work, including raw HTTP requests (just an example), etc., then the time is shortened. It all depends on how much you know right now. In case you have zero knowledge about computers, or close to zero knowledge about computers, I would say that it would probably take a few more years as a fast or semi-fast learner. Having knowledge about at least one programming or scripting language is almost a necessity as a true hacker. (In other words, you don't have to be a programmer, but you'll need to be able to write simple programs.) To become a senior consultant (i.e. senior pentester), you'll need at least ~5 years of experience and deep exposure to hacking, preferably 7-10 years at least. This doesn't have to all be in a professional capacity, but you will need to have a lot of general experience with hacking to master the job.  You will need to push yourself, to learn about the basics of almost everything there is to know about in hacking, and then focus on practical topics (i.e. areas of expertise) that can be utilized professionally. The easiest way to start, is probably web application hacking, unless you have a knack for buffer overflows and finding bugs with fuzzing, reverse engineering, and source code review. ",
            "date": "Answered April 12, 2016",
            "views": "17",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zahan Ahmad",
                    "user_href": "/profile/Zahan-Ahmad"
                },
                {
                    "user_id": "Aditya Arora",
                    "user_href": "/profile/Aditya-Arora-23"
                },
                {
                    "user_id": "Scott Hansen",
                    "user_href": "/profile/Scott-Hansen-21"
                },
                {
                    "user_id": "Sorath Eruditus",
                    "user_href": "/profile/Sorath-Eruditus"
                },
                {
                    "user_id": "Jeeya Khan",
                    "user_href": "/profile/Jeeya-Khan-2"
                },
                {
                    "user_id": "Aviral Gupta",
                    "user_href": "/profile/Aviral-Gupta-28"
                }
            ]
        }
    ]
}