{
    "title": "How to reduce the cost to make a rapid prototype - Quora",
    "tags": [
        "Rapid Prototyping"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Boucher",
                "href": "/profile/Chris-Boucher-11"
            },
            "answer_text": "Very difficult to answer. We first must define if we are here talking about hardware or app/software. When you are using rapid prototyping methods such as FDM, SLA, CNC milling, SLS, and so on, the most important is to choose the right one for your parts and avoid any waste of material as it will be charged. Sometimes it is necessary to simplify some parts in order to make prototyping easier and less complicated/expensive. So I guess the best is to work more on the design side before jumping into real prototyping. One good option is also to use basic and cheap materials for the first prototypes just to check if the functions work before jumping into more expensive materials, especially when many iterations are necessary to adjust a few parts together. Regarding the electronics, though I know it is not considered as rapid prototyping, there is some efforts that can be made as sourcing cheaper components of same quality or so, and make the PCB as simple as possible. Nevertheless, it would be great to have this question redefined to provide better answers. ",
            "date": "Answered July 31, 2018",
            "views": "156",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Benoit Schildknecht",
                "href": "/profile/Benoit-Schildknecht"
            },
            "answer_text": "Hi, If you want something professional and cheap, I think the best way for you is the following ; Go to platform like Upwork, Freelancer … find a 3D designer freelance who use professionnal software as Catia or Solidworks. Price is very various, but you can ask for a price for a project or filter price per hour.Describe precisely what you need and follow up the project with himAt the end, you receive normally a CAD fileGo to On demand Manufacturing platform as Make, upload your file, choose your process and materials (if you want cheap take additive and plastic), request multiple quote, choose the best manufacturer for you and receive your part.If you are in a big city, you can also maybe find public lab directly on this website for exampleI think this is the better way to have multiple quote at each step, but with good level of information and so to manage perfectly your cost. Good luck. ",
            "date": "Answered October 18, 2018",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dagfinn Aksnes",
                "href": "/profile/Dagfinn-Aksnes"
            },
            "answer_text": "Firstly obtain competitive quotes from rp agencies. If you are able to let us know what kind of prototype you want to build and at what stage in the design innovation process you want to build this prototype, a more detailed answer would be possible. A rapid prototype may not be appropriate or cost effective. A simulation may be quicker and cheaper. Or you can build prototypes that are much quicker and cheaper than \"rapid prototypes\" What is it you wish to model? ",
            "date": "Answered July 28, 2018",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susie Sue",
                "href": "/profile/Susie-Sue-11"
            },
            "answer_text": "A great question , it’s depend on your requirements and invention to choose processing ways(CNC machining, 3D printing, Vacuum casting, Laser cutting etc) materials(Plastic, Metal, Rubber, Wood, Resin, Ceramics etc) and surface finishing(Painting, Silk-screen, Sandblasting, Anodized, Plating,Polishing etc). If you have any new projects,welcome to contact us ,we can help CNC Machining Service | RD | Www.sgproto.com ",
            "date": "Answered July 31, 2018",
            "views": "51",
            "upvotes": "0"
        }
    ]
}