{
    "title": "How did YouTube become such a big hit? Could any other video sharing platform dethrone YouTube in the near future? - Quora",
    "tags": [
        "Online Video and Videosharing Startups",
        "Video Platforms",
        "Online Video Advertising",
        "Video Sharing",
        "Video Marketing",
        "Streaming Video Content",
        "Online Video",
        "Videos",
        "YouTube Videos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Salam Abiodun",
                "href": "/profile/Salam-Abiodun"
            },
            "answer_text": "This is pretty obvious that youtube is a big hit because of his previous user generated content i.e videos are tailored towards the viewers interest without affecting the publishers but YouTube is no longer like that they now feed you with useless videos not from the channel you subscribed to because of their own ads, the most important now become the least important. Another thing that will kill YouTube is the website or the app is standalone i.e you can't do anything without leaving the web or app and if you flash back to the history of Google apps you will know that the really sucks at any other thing except search and Android the later was believe by Steve jobs as a stolen intellectual property (another discussion), Google+ loose to Facebook and Twitter, and lots of Google products are being abandoned by users except the most prominent ones like maps, Gmail and the gsuit. YouTube should be alert as the game changer is here INSTAGRAMTV this made it possible to do so many things without leaving the app . Read news, you got it. See Trends, You got it. Share videos, you got it. User based contents, you got it. Final note: Google+ is dieing as a social media this is because Facebook and Twitter knows how to poach users. If care is not taken IGTv will divert and retain YouTube users just as………did for their game streaming users. ",
            "date": "Answered December 23, 2018",
            "views": "67",
            "upvotes": "0"
        }
    ]
}