{
    "title": "How far can a cell phone tower reach? - Quora",
    "tags": [
        "Cell Towers",
        "Cellular Service Providers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kit Kilgour",
                "href": "/profile/Kit-Kilgour"
            },
            "answer_text": "Other answers have given good radio propagation reasons - height, terrain, frequency, fading scenario, but practically you have to consider the teachnology and handset as well, because higher powers can be useless and counterproductive. An LTE handset can transmit at a maximum of 0.25 Watts, the same for most 3G handsets, whilst GSM was allowed to do 1 or 2W, So, cellular coverage is almost always uplink limited, rather than downlink limited: you could put more power in to a cell tower, but it’s no use if a handset hasn’t got enough transmit power to it’s own to respond back at the cell edge. In some cases there are other technical issues such as timing advance (that is signalled to a handset so it transmit in time for the signal to arrive in a particular time window) that limited maximum GSM cell range to 33km, irrespective of power. There were some timing advance changes to 3G that were potentially meant to allow a long range cell of > 100 km, but I’m not sure that anyone ever built one. ",
            "date": "Answered November 25, 2017",
            "views": "82",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Doar",
                    "user_href": "/profile/Matt-Doar"
                },
                {
                    "user_id": "Timothy Dailey",
                    "user_href": "/profile/Timothy-Dailey-2"
                },
                {
                    "user_id": "Joe Fratianni",
                    "user_href": "/profile/Joe-Fratianni"
                },
                {
                    "user_id": "Syed Karim",
                    "user_href": "/profile/Syed-Karim"
                },
                {
                    "user_id": "Chris Owen",
                    "user_href": "/profile/Chris-Owen-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kurt Behnke",
                "href": "/profile/Kurt-Behnke"
            },
            "answer_text": "The answer depends very much on the frequency band and the transmission energy. And after all, the phones have to be able to transmit back to the tower, to enable a two way communication. Without nothing will happen. It also depends on the environment. How much absorption? Is there water (ponds, lakes, rivers) which absorb a lot of microwave. Any forests? Concrete buildings? Where are the obstacles? The first Fresnel zone is the area where on ground obstacles matter most. Typically the radius of a mobile phone cell is from a few hundred meters (LTE 2.6 GHz in dense urban environment) to some 50 km (450 MHz for cdma and 1G networks, but in near future also for LTE). ",
            "date": "Answered July 31, 2018",
            "views": "3",
            "upvotes": " Answer requested by James Hawk"
        }
    ]
}