{
    "title": "How are corporations supporting the sustainable development goals (SDGs)? - Quora",
    "tags": [
        "UN Sustainable Development Goals",
        "Sustainable Development",
        "Sustainability"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jan Goossenaerts",
                "href": "/profile/Jan-Goossenaerts"
            },
            "answer_text": "Several corporations are supporting the SDGs. You might check the #tagcoding #b4sdgs hashtag on Twitter (business 4 SDGs) for some of the links. As well as hashtags #b4sdg1 to find out about what business can do for eradicating poverty, #b4sdg2 and so forth, one “business” tag for each of the 17 sustainable development goals. Recently I also composed a first business for target tag for #SDT087 - take immediate and effective measures to secure the prohibition and elimination of the worst forms of child labour. The tag for sharing initiatives in this area is #b4sdt087 . The UN Global Compact (Homepage | UN Global Compact) is a very useful website. It offers examples from many sectors as well as tools to apply in your own business. You can also find out more about local business networks (Engage Locally | UN Global Compact). Needless to say that corporations can and should do more for supporting the sustainable development goals. Corporations and the networks of the UN Global Compact figure prominently in the Partnership work streams of the \"UN Development System (UNDS) system-wide plan, or world plan\" and is described in chapter VII.B of Repositioning the UN development system to deliver on the 2030 Agenda: our promise for dignity, prosperity and peace on a healthy planet - Report of the Secretary-General (December 2017, Advance unedited version). The below figure (from #unds062 - Partnership work streams - Wikinetix ) visualizes some of the proposed “worldwide” workstreams using Archimate.  (answer of July 25, 2016) Another place to learn about corporate initiatives is the World Business Council for Sustainable Development. An important tool for corporations is the “SDG Compass Guide” (Download the SDG Compass Guide). How corporations can support the sustainable development goals depends on the sector in which they operate. Published in July 2016: New report shows how mining can contribute to achieve the Sustainable Development Goals ",
            "date": "Updated January 30, 2018",
            "views": "919",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Milan Sadhwani",
                    "user_href": "/profile/Milan-Sadhwani"
                },
                {
                    "user_id": "Naveed Ali Qureshi",
                    "user_href": "/profile/Naveed-Ali-Qureshi"
                },
                {
                    "user_id": "Network Global Compact Network Canada",
                    "user_href": "/profile/Network-Global-Compact-Network-Canada"
                },
                {
                    "user_id": "DrDalia Mostafa -Sáez",
                    "user_href": "/profile/DrDalia-Mostafa-Sáez"
                },
                {
                    "user_id": "Lindsay Harris",
                    "user_href": "/profile/Lindsay-Harris-26"
                },
                {
                    "user_id": "John Power (UK - Assurance)",
                    "user_href": "/profile/John-Power-UK-Assurance"
                },
                {
                    "user_id": "Sukanya Mishra",
                    "user_href": "/profile/Sukanya-Mishra-3"
                },
                {
                    "user_id": "Gijs",
                    "user_href": "/profile/Gijs-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hiba Shimla",
                "href": "/profile/Hiba-Shimla"
            },
            "answer_text": "Companies say they want to support Sustainable development, but do they Know How? In order to prosper over time, every company must not only deliver financial performance, but also need to show how it makes a positive contribution to society. Companies must benefit all of their stakeholders, including shareholders, employees, customers, and the communities in which they operate. For instance, find below the perception of companies and the need the feel towards inclusive growth as compared to a companies belief to influence change and contribute to SDGs.  (Source: Deloitte) Many CEOs probably already understand the social dilemma. They’ve been hearing a variety of messages about corporate social responsibility for more than a decade. The harder question is may be, how they are going to carry out such policies and the need to serve multiple stakeholders, with the need to serve profit-hungry investors still remains one of the biggest challenges for companies. For example, a survey, based on responses from 350 executives from multiple countries, comes from the global consulting firm Deloitte. It finds that CEOs are keen to follow through an agenda while bearing in mind the Sustainable Development Goals, covering everything from ending extreme poverty and hunger to tackling climate change and reducing income inequality. Fully 92% of respondents say they support the SDG agenda. But just 17% believe they currently have programs in place to help achieve the SDGs by 2030. (Source:Deloitte) However, there are benefits for CEO’s and their businesses who work towards the SDGs and make it a policy to involve SDGs: Improvement in relationship with government and RegulatorsMore innovation and Creativity (Source:Deloitte) So the is the main question that, are Companies Succeeding at the SDGs or at “SDG Washing”? When 193 member states launched the 17 SDGs at the United Nations in 2015, it was not made very clear as to how clear how businesses can contribute to an agenda that covered such wide-ranging topics as eliminating poverty and hunger and promoting peaceful, just, and strong institutions worldwide. However now, these fears have proved false as business are consistently making it a point to involve SDGs. Big companies like Coca-Cola, Gap, Johnson & Johnson, Mastercard, and Unilever as examples of companies that are integrating selected SDGs into the core of their corporate strategies. However, the bad news is that corporate “SDG washing” (positively contributing to some of the SDGs while ignoring the negative impact of others) is a risk which limits a company’s contribution toward the SDGs. For example, a company may develop large-scale renewable energy projects in support of Goal 7, affordable and Clean Energy, but displace communities and undermine rights to food, access to water, health, culture, and livelihoods in the process. Under the guise of supporting the SDGs, may deliver weak or counterproductive contributions to the goals. A company’s support of the SDGs is not necessarily considered a good thing by many. Business leaders who want to support the 2030 Agenda for Sustainable Development in a way that is both strategic and responsible must ask themselves, “We want to leverage our business practice to support the SDGs, but how can we do so in a way that is effective, ambitious, and conscientious?” (Source: Harvard Business Review) However, in my opinion, this is a never-ending debate. There are a few examples of companies doing remarkable work. Please find the example below: NO POVERTYVisa brings financial services to people who do not have access to banks or the very concept. 2. ZERO HUNGER General Mills gives meals to local food banks. 3. GOOD HEALTH AND WELL-BEING Kaiser Permanente invests in healthy communities. (Source: How 17 Companies Are Tackling Sustainable Development Goals (and Your Company Can, Too) - SDGfunders) ",
            "date": "Answered July 31, 2018",
            "views": "456",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kris Bevan",
                    "user_href": "/profile/Kris-Bevan"
                },
                {
                    "user_id": "Milan Sadhwani",
                    "user_href": "/profile/Milan-Sadhwani"
                }
            ]
        }
    ]
}