{
    "title": "How can science and technology solve unemployment? - Quora",
    "tags": [
        "Technological Unemployment",
        "Unemployment Rate",
        "Unemployment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "No, not at allJust the oppositeThe endpoint of Technology is to solve employmentThat is, to make most people unemployed Most creatures spend very little time looking for food, shelter, and their basic needsHumans have to fill their time, just about every minuteThe problem of unemployment will be replaced with the problem of what we will do with ourselves when all our needs are catered for, and we have the means, time, and hopefully the ability to do whatever we want Every new invention and innovation is in some way to solve time and effortMore products become everlasting or disposableServices become more efficient, and people increasingly become redundant At some point products will merge just as the camera, phone, and internet require one machineSo our vehicles will become our homes, offices, college, and entertainment centerOur bodies and accessories will become nodes on a global computerand we will interface directly with the machines we use Being unemployed is not a problem in regarding wealthbut will be a problem regarding our identityIt will be meaningless to call yourself something that is done better by a robot It may well be that we will need to study how to do nothing in a positive way ",
            "date": "Answered July 27, 2018",
            "views": "711",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bharathi G,r",
                    "user_href": "/profile/Bharathi-G-r"
                },
                {
                    "user_id": "Ken Musembi",
                    "user_href": "/profile/Ken-Musembi"
                },
                {
                    "user_id": "Monika William",
                    "user_href": "/profile/Monika-William-2"
                },
                {
                    "user_id": "John Johnson",
                    "user_href": "/profile/John-Johnson-301"
                },
                {
                    "user_id": "Mark Cardle",
                    "user_href": "/profile/Mark-Cardle"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Johnson",
                "href": "/profile/John-Johnson-301"
            },
            "answer_text": "Science and technology specialize in reducing effort. That is - with every advance fewer people are needed to produce the same or increased output. So, what is the advantage of increased employment? We are currently at 96.X%. The closer we get to 100% the greater the rate of inflation will get. Around 15-20 years ago one country achieved 100% employment, and inflation was greater than 100% per year. Needless to say such an inflation rate is unsustainable. The economy tanked. If we achieve cold fusion 95+% of people in the energy industry will be out of work. If we achieve zero point energy conversion that goes to 99.999% If can prevent quantum particles from decaying almost the instant they manifest we will be on the road to replicator technology. And no. Isenberg’s uncertainty principle doesn't preclude it. We don't need the level of certainty that the theory suggests is unattainable. And that will put 99.9999% of everyone else out of work. ",
            "date": "Answered July 27, 2018",
            "views": "254",
            "upvotes": "0"
        }
    ]
}