{
    "title": "How does Netflix's 'Streamfest' event work? - Quora",
    "tags": [
        "Netflix User FAQs",
        "Netflix Original Series",
        "Netflix (company)",
        "Events (leisure)",
        "Streaming Content",
        "Netflix (product)",
        "Streaming Video Content",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ronnie Ganguly",
                "href": "/profile/Ronnie-Ganguly-4"
            },
            "answer_text": "Multimedia streaming platform Netflix had announced their new marketing stunt StreamFest, that'll let all users stream for 48 hours on Netflix at no extra cost, starting December 4. Only available to the Indian audience in its initial testing phase, StreamFest will be a good marker for the market, and depending on the response they may be tempted to launch it elsewhere as well. What is unique is that none of the users will be asked for payment details to explore Streamfest. Unlike the free 30-day trials that required users to submit their payment details. After those free trials, Netflix would deduct money according to the plan subscribed by the users. Netflix did cancel their free monthly trials all over the world in order to launch StreamFest. All you've got to do is have the Netflix app in your desired device, and that's it. Ideally try using Netflix post December 4th and you'll find the option of StreamFest while you create your account. It's an weekend of free streaming therefore it only works in the weekends that much is clear. Baring that there isn't much information available at this point of time. Hope that satisfies your query. ",
            "date": "Answered October 31, 2020",
            "views": "20",
            "upvotes": " Answer requested by Sameer Thakur",
            "upvoters": [
                {
                    "user_id": "Aarav Agarwal",
                    "user_href": "/profile/Aarav-Agarwal-25"
                },
                {
                    "user_id": "Aditya Khurana",
                    "user_href": "/profile/Aditya-Khurana-52"
                },
                {
                    "user_id": "Vihaan Kulkarni",
                    "user_href": "/profile/Vihaan-Kulkarni-1"
                },
                {
                    "user_id": "Reyansh Madan",
                    "user_href": "/profile/Reyansh-Madan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arjun Agarwal",
                "href": "/profile/Arjun-Agarwal-123"
            },
            "answer_text": "Netflix has discontinued the practice of offering 30-day free trials for potential subscribers. The promo event is an attempt to attract more subscribers to its streaming service as part of its marketing strategy.  Currently, it offers select content including movies and TV show episodes for free to viewers even without an account through its Watch Free section. “You can watch some of the great TV shows and movies from Netflix for free at Netflix. Choose from a variety of TV shows and movies that are available to watch now for free. You don’t have to sign-up or register, you can just press play and watch ",
            "date": "Answered October 28, 2020",
            "views": "67",
            "upvotes": " View 4 Upvoters"
        }
    ]
}