{
    "title": "How and why did Japan become dominant in creating advanced technology? - Quora",
    "tags": [
        "Culture of Japan",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Murray",
                "href": "/profile/Don-Murray-15"
            },
            "answer_text": "Dominant? Not really, in many fields. In the past Japan became a major power in production through concentrating on growing large corporations as well as finances. You need to study the development of the zaibatsu and later the keiretsu to see how bigger became better. The backing of a major bank such as the case of Mitsubishi is also crucial. The fact is that America still leads in numerous fields - astronautics, aeronautics, pharmaceuticals, computers and AI, chemical research, and of course weaponry. But America often classifies a lot of its technology for the military, while Japan doesn't. That's why you see a lot more development in Japan. If the US released all the tech it's sitting on for civilian applications, it would knock the world on its ear. Japan has many instances of developing advanced technology such as in trains and cameras, plus robotics. But it also lags in many others, and that gets a lot less attention in the western press. Europe also has a lot of high speed rail, and while Japan will have a functioning maglev train in 2027, China has one up and running now. Many of Japan's production has also moved out to other Asian countries, causing a 'hollowing out' of Japan's economy. Which is one big contributing factor as to why Japan's economy has been in a coma for the last 25 years - the efficient high flyers are not longer around to prop up the laggards. ",
            "date": "Answered January 13, 2016",
            "views": "21",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Damián González",
                    "user_href": "/profile/Damián-González-9"
                },
                {
                    "user_id": "Sam Suhr",
                    "user_href": "/profile/Sam-Suhr"
                },
                {
                    "user_id": "Thadeus Paskal Kebubun",
                    "user_href": "/profile/Thadeus-Paskal-Kebubun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Medina Christopher",
                "href": "/profile/Medina-Christopher"
            },
            "answer_text": "Stereotypically speaking, Japan doesn’t create technology, rather, it develops and improves old technology. Original ideas are not what Japan is typically known for. ",
            "date": "Answered April 19, 2019",
            "views": "42",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Cassidy Nguyen",
                    "user_href": "/profile/Cassidy-Nguyen-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chance Wang",
                "href": "/profile/Chance-Wang-1"
            },
            "answer_text": "They have lesser resource and want to be stronger. ",
            "date": "Answered July 9, 2014",
            "views": "277",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thadeus Paskal Kebubun",
                "href": "/profile/Thadeus-Paskal-Kebubun"
            },
            "answer_text": "i sugest you to watch japanoloy,channel japan,NHK world. you will see why,they can do that. ",
            "date": "Answered September 14, 2016",
            "views": "70",
            "upvotes": "0"
        }
    ]
}