{
    "title": "How technologically advanced is Tokyo compared to America? - Quora",
    "tags": [
        "Tokyo",
        "Japan",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tracy Greenwood",
                "href": "/profile/Tracy-Greenwood-8"
            },
            "answer_text": "That’s a really broad question. I will limit it to a few things. Public transportation: Japan’s system is not as amazing as you’ll read about. The infrastructure is falling apart, walls are leaking, and trains are often late (often because of suicides). Payment: But the great thing about taking a train in Japan is that you can swipe your prepaid card at the entrance and exit to pay your fair. These prepaid cards work on buses as well as many stores and vending machines. Cell phone service: Cell phone service in Tokyo is incredible. I can be on a subway streaming YouTube and it rarely lags. Now, if I get to the end of the month and I’ve used too much data, my carrier might throttle me (restrict how fast my data works). But with a 50GB monthly plan, that has yet to happen. Delivery infrastructure: Delivery infrastructure is incredible. In the US, a delivery driver will run up to your door with a slip already filled out saying, “Sorry we missed you”. They stick the slip to your door, knock, run back to their truck, and drive away. I have been walking out the door when this happened. I called out to the driver, who ignored me and drove away. It’s up to you to arrange for a pickup, or just go get it yourself. That sucks. In Tokyo, there are many more delivery centers. They are very small. But they are very efficient. People who request the delivery can specify a 2 hour time range, and the package always arrives during that time. If you miss a delivery, you can arrange to have your package delivered again, and it will actually arrive in the time range specified. 10am-12pm, 6–8 pm, etc. Highway toll booths In the 90’s, toll booths created terrible bottlenecks. I don’t drive much these days, but most cars have an ETC card in a card reader in the car. As you drive up to a toll gate, the reader charges you and the gates open. You have to slow down a bit, but traffic flow is amazing. These days, when I take a bus to the airport, I don’t see traffic jams at toll booths. ",
            "date": "Answered February 4, 2019",
            "views": "335",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aaron Ray",
                    "user_href": "/profile/Aaron-Ray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeanie Gogal",
                "href": "/profile/Jeanie-Gogal"
            },
            "answer_text": "Visiting Tokyo is not like living in the future, if that’s what you’re asking. If you don’t have a Japanese e-payment system, you’ll be using cash (and many people still do this exclusively), and private residences generally have in room air conditioners and heaters rather than HVAC. The “wow” factor of Tokyo generally has to do with efficiency and attention to detail in presentation. Want to get somewhere? Trains run on a very reliable schedule with timetables displayed and train announcements played in both Japanese and English throughout the Tokyo region. Visiting a McDonald’s in Akihabara? Here’s an English language menu. Want to visit the Sunshine Aquarium in Ikebukuro? An elevator attendant will take you up to the proper floor, where every room of the bright, clean facility has its own lovingly crafted soundscape. If you want to see some cool technological advances, there are several great museums and exhibits on Odaiba (part of Tokyo - it’s an island in Tokyo Bay) that show off futuristic technology. Also — visit a public restroom. There are technically advanced potties everywhere from department stores to the occasional KFC and they make bathroom breaks better than you ever imagined they could be. (Train station restrooms, though, tend to be bare-bones.) ",
            "date": "Answered February 6, 2019",
            "views": "554",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abraham Lee",
                    "user_href": "/profile/Abraham-Lee-16"
                }
            ]
        }
    ]
}