{
    "title": "How long should a furnace run during a typical heating cycle? - Quora",
    "tags": [
        "Furnaces"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Reno",
                "href": "/profile/Steve-Reno-6"
            },
            "answer_text": "What type of furnace? What type of structure? In what ambient conditions? What insulation value? What set point? How much infiltration? How many cycles per hour is the thermostat set to allow? A high efficiency modulating furnace is designed to and will run continuously. A standard efficiency (80%-85%) might run 10–20 minutes per cycle, relative to conditions. A high efficiency, non modulating furnace is designed to and will run more than the standard efficiency but less than a modulating furnace. There's too many unknown variables to give a decent answer. ",
            "date": "Answered September 15, 2019",
            "views": "15",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Les McLean",
                    "user_href": "/profile/Les-McLean"
                },
                {
                    "user_id": "JD Miller",
                    "user_href": "/profile/JD-Miller-47"
                },
                {
                    "user_id": "David Reichard",
                    "user_href": "/profile/David-Reichard-10"
                },
                {
                    "user_id": "Mark Doane",
                    "user_href": "/profile/Mark-Doane-1"
                },
                {
                    "user_id": "Tiberius Kraemer",
                    "user_href": "/profile/Tiberius-Kraemer"
                },
                {
                    "user_id": "Reg Schmidt",
                    "user_href": "/profile/Reg-Schmidt"
                },
                {
                    "user_id": "Fred Greulich",
                    "user_href": "/profile/Fred-Greulich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bo Miller",
                "href": "/profile/Bo-Miller-1"
            },
            "answer_text": "In general, the longer the better. What kills a furnace some day will be the number of starts and stops it has performed, because temperature going up and down creates wear and tear - plus, when starting up, it will always burn less than optimal, and that will often create soot or other things inside the burner chamber, lowering the lifespan. Notably, if the water is hard, a furnace can also die from limestone buildups inside, but that can happen regardless of running time. Point is: keep things stable. Makes things last longer. ",
            "date": "Answered March 6, 2020",
            "views": "503",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        }
    ]
}