{
    "title": "How can an older person keep up with fast change technology? - Quora",
    "tags": [
        "Technology Change",
        "New Technologies",
        "Change and Changing",
        "Senior Citizens",
        "Aging",
        "Technology Trends",
        "Technology",
        "Human Behavior",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Day",
                "href": "/profile/Erik-Day-3"
            },
            "answer_text": "“How can an older person keep up with fast change technology?” Try and break it. This memo has some practical advice, but I’m going to start with a quote from Douglas Adams, excerpted from the Salmon of Doubt: I've come up with a set of rules that describe our reactions to technology: 1. Anything that is in the world when you're born is normal and ordinary and is just a natural part of the way the world works. 2. Anything that's invented between when you're 15 and 35 is new and exciting and revolutionary and you can probably get a career in it. 3. Anything invented after you're 35 is against the natural order of things. The take-away here is that technology evolves, but people age. Their sense of exploration fades (or more technically, it’s beaten out of them). You might be 15 now, but you’ll sneeze, open your eyes and find you’re 35 and suddenly facing the sad truth that late-night commercials are now strangely compelling. So here is how to keep up with “fast change technology”: After purchasing the doohickey, try and break it. Not just within the 30-second warranty, but before you ever get it out of the store. Share the unboxing experience with the employees and fellow customers. Let them review how the titanium-alloy case was strangely cracked during shipping. Then break it. No, not the easy rage-fling that will come impulsively after it stops doing the thing you rely on because the latest patch broke that function, but go through the process of everything you’re going to use that thingamajig for while you’re still next to the fool who sold you that shiny piece of [gear]. They’re on the hook for walking you through the basic functions. Pretend your thumbs are fatter than normal.Push the Big Red Button “by mistake.”See if you can get the blender to connect to the printer, like the 11th bullet point on the box says that it can. Who cares if you’ll ever use it, you just want to see if it’ll actually do what it was advertised to do. That’s going to tell you all about the disconnect between the company’s engineering group, the manufacturing division, the marketing department and their customer service section. The relationship will likely graph out like a ball of moldy spaghetti, and this will help in the next step:Lower your expectations. Sliced bread is still the greatest thing, and despite releasing several models of bread since then, none of them actually taste like divine ambrosia while burning body fat and curing cancer. Such a disappointment. Sell the bread stock immediately.Don’t read the comments section.Realize the same frothy idiots who criticize the lemmings buying into the technology of Company A have a death grip on what is actually the best-selling gadget in the world… made by Company S. Realize that critique goes both ways… and that not all opinions are created equal. Then sit back and consider that these tribal collections are simply an evolution of the same imbeciles that put a sticker of Calvin whizzing on the logo of Company F while they’re driving a vehicle made by Company C. Be especially aware of those who adorn their vehicle with a corresponding Calvin sticker instead: they either have a self-aware sense of irony and should be embraced, or they’re Darwin Award Candidates and you should immediately seek minimum safe distance. To all my fellows who are past their warranty date, I salute you and wish you luck. ",
            "date": "Answered January 1, 2020",
            "views": "790",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nihil Shah",
                    "user_href": "/profile/Nihil-Shah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albert Wells",
                "href": "/profile/Albert-Wells"
            },
            "answer_text": "I started on mainframe computers in 1973 and even played with the Altair 8800, one of the first microcomputers. I witnessed, first-hand all the changes in technology playing with the early versions of the Internet (we had to guess at the URL), programmed in FORTRAN, COBOL, GW-BASIC, using DOS and CP/M based computers as well as working in machine language on some of the earlier chips such as the Intel 80286 chip. One of the first word processors called, WordStar, worked off of a 360 Kb floppy disk and back then, tight coding was critical, unlike the bloatware we see today. My email address was one of the first beta testers for Gmail, where one had to be invited to join. I’ve kept up with technology quite well over the years, including robotics, CAD/CAM and electronic keyboards. But, we also know how to take care of the ‘analog’ world as well as the digital world. As Mr. Nest discussed, part of our training when we were younger included basic home repair. I don’t need to call a plumber or electrician if I need most work done, as I do it on my own. I was hanging doors and windows, roofing, soldering copper pipes, painting, putting up drywall, etc. when I was 12 years of age. We did not have time for video games which did not exist anyway but were motivated to make our summer jobs as students count to buy that 10-speed bicycle we had our eye on or the latest hockey equipment. No, I did not have computers in high school. We used slide rules for complex maths problems. We never worried about them getting hacked or the batteries running down. Up until recently, slide rules were still being used for calculating artillery shots.  ",
            "date": "Answered January 8, 2020",
            "views": "13",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tony Gilbert",
                    "user_href": "/profile/Tony-Gilbert-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roberta Tweedy",
                "href": "/profile/Roberta-Tweedy"
            },
            "answer_text": "If an older person wants to keep up with the changing technological world, then they do it the same way a younger person does - by continuing interest in, and learning about, everything they can. As someone who started typing in the early days of electric typewriters, then electronic ones, then computers (early 80s), I’ve always been up to date with what is going on there and can still sort out most problems; I have had a smart phone for years and use a tablet almost daily. But, without an interest in technology - or the necessity to use it - what would be the point of spending time keeping up with what is going on? I have a contemporary friend who doesn’t own a computer; I have others who are a whizz with all things technological. I have friends with smart phones and others who still use the basic models and do no more than send texts. We are all different - I have always been interested in knowing how things work, many are not. So, we oldies can usually find a way to keep up if we want to - or accept technology that others use. Speaking personally, I would hate to have a driverless car - there are others who would love it; the technology is nearly there - but I wouldn’t want to be involved. So it’s horses for courses - those that are interested will keep up - those that are not, will stay at whatever stage they decided enough was enough! And good luck to them! ",
            "date": "Answered December 30, 2019",
            "views": "11",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alma Coleman",
                    "user_href": "/profile/Alma-Coleman-7"
                },
                {
                    "user_id": "Darryl Gardner",
                    "user_href": "/profile/Darryl-Gardner-2"
                },
                {
                    "user_id": "Ian Heggie",
                    "user_href": "/profile/Ian-Heggie"
                },
                {
                    "user_id": "Robin Harville",
                    "user_href": "/profile/Robin-Harville"
                },
                {
                    "user_id": "Jan Antonsson",
                    "user_href": "/profile/Jan-Antonsson-1"
                },
                {
                    "user_id": "David Nguyen",
                    "user_href": "/profile/David-Nguyen-349"
                },
                {
                    "user_id": "Matthew Roberts",
                    "user_href": "/profile/Matthew-Roberts-210"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Cadman",
                "href": "/profile/David-Cadman-2"
            },
            "answer_text": "Rockets landing themselves, Cars driving themselves, Heart Attack Open Surgery now an Arterial Procedure, being born with life expectancy of 67 and now looking at 86. From cooking food on a wood stove, water heated in the laundry tub, which was also the bath tub. Party lines, to telephone exchanges, to rotary phones, push button phones, to where we are today. Rationing in 1948 to food cornucopia abundance in 1953. Smog that could kill 3,000 in a weekend, to clean air. Watching Science Fiction become reality from 1960’s to today. I could go on and on. In Larry Niven and Anne McCaffrey wrote about a Hologram projection such as these two web sites. earth :: a global map of wind, weather, and ocean conditions Weather Map: Precip (Radar Past & Forecast)  In 10 years they could become full reality. In the meantime we “settle” for these primitive tools. What I’m trying to point out is that we take what we can, whether because we can afford it, or because we need it in our day to day lives, and by necessity, of use learn how to deal with it. Those that refuse or who can’t for psychological reasons, learn to accept, adapt, and use the new technological advances, will be left on the outside. and in the past 40 years, I have met many like that. Language is another aspect of change that lots of people gloss over. Bring me from 1962 (14) to the present, and I’d be as lost as a migrating goose, in a fog. “It’s Christmas, of course I was feeling gay before you brought me here. No, I don’t smoke fags, Mom and Dad do.” Get the picture. That is the tip of the spear. Ok, Boomer is not the disparaging reflection on a generation that it was originally meant to be. It is disparaging a whole centuries way of thinking, when it is brought into the 2020’s. No different than the Roaring 20’s “spat in the face” of the Victorians. It is a way of telling someone they are out of step with the new century. By taking what a person can use in their life, and keeping abreast of the times, they are entering the Roaring 20’s vs 2.0 with a 21st Century forward thinking attitude. It’s nothing to fear, it’s to be embraced as an adventure. Trust me, “It’s going to be the Cat’s Meow. Jump in my jalopy and lets 22 skidoo.” LMAO ",
            "date": "Answered December 22, 2019",
            "views": "12",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Morris Hopkins",
                    "user_href": "/profile/Morris-Hopkins-2"
                },
                {
                    "user_id": "Daniel Banks",
                    "user_href": "/profile/Daniel-Banks-87"
                },
                {
                    "user_id": "Dayu Anandani",
                    "user_href": "/profile/Dayu-Anandani"
                },
                {
                    "user_id": "Ann Sockol",
                    "user_href": "/profile/Ann-Sockol"
                },
                {
                    "user_id": "Gary Ansorge",
                    "user_href": "/profile/Gary-Ansorge"
                },
                {
                    "user_id": "Michael Wardell",
                    "user_href": "/profile/Michael-Wardell-6"
                },
                {
                    "user_id": "Bob Wexler",
                    "user_href": "/profile/Bob-Wexler-3"
                },
                {
                    "user_id": "Derek Ross",
                    "user_href": "/profile/Derek-Ross-9"
                },
                {
                    "user_id": "Syed Omar",
                    "user_href": "/profile/Syed-Omar-64"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Hicks",
                "href": "/profile/Jerry-Hicks-15"
            },
            "answer_text": "Boy, this should make question of the day if Quora had such a thing. The answer, I think, is no one does. Children are given technology very early these days. I gave my grandchildren computers almost before they could talk and told my daughters to let the kids destroy them. That started 30 years ago. These kids now have absolutely no fear of computer technology. On the other hand, they know very little history. They know almost nothing about how hard our ancestors worked and how much they sacrificed for this good life we now can enjoy if we set our minds to it. We use two buttons on a device that has 20, the TV remote. Why do they put so many knobs on a window? Samsung sold me a lovely TV 10 years ago. I surf with the multibutton device to do what I do most with the TV; a small round object the size of an ashtray (whatever that is) with two buttons: on-off, I use change stations and it looks lovely on the coffee table. What sort of genius thought that up? What do you as an older person want to do? What are your goals in this age of magic manifest? Can you align those goals with any of this modern stuff. Your kids can give you a good overview and it will be worth a lot if you pay attention. You can actually take classes in most adult schools (and meet other cool people at the same time). You have to be able to look into the mirror and see a hero instead of a coward. That is important. ",
            "date": "Answered January 1, 2020",
            "views": "771",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charou Boi",
                    "user_href": "/profile/Charou-Boi"
                },
                {
                    "user_id": "Pat Kendall",
                    "user_href": "/profile/Pat-Kendall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Van Nest",
                "href": "/profile/Robert-Van-Nest"
            },
            "answer_text": "young lady young lady I happen to be 81 and I'm a former shop teacher and I can keep up with technology quite well because I have a background in it plus I am very very good with my hands I should be after 60 years of working with them. The question is how much do you know at this point in your life about technology what can you do physically what skills do you have what occupations can you physically do I can do Electrical Plumbing woodworking carpentry furniture repair photography artwork I have a great voice and by that I mean Broadway Type voice of the old style did it for years no I'm Broadway unfortunately. When I was 25 years old I went to southeast Asia to teach woodworking as a previous Corps volunteer I did that for four years change my life erratically to this very day I've been studying history since I was in high school and religion because of my experience in college. Most Christians don't know squat about religious history especially about Israel I have pet questions that I ask people very few if any ever can get any of them right it's pretty sad ",
            "date": "Answered December 9, 2019",
            "views": "848",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeanette Fletcher",
                    "user_href": "/profile/Jeanette-Fletcher-7"
                },
                {
                    "user_id": "Miriam Mendoza",
                    "user_href": "/profile/Miriam-Mendoza-47"
                },
                {
                    "user_id": "Darryl Gardner",
                    "user_href": "/profile/Darryl-Gardner-2"
                },
                {
                    "user_id": "Doug Wilson",
                    "user_href": "/profile/Doug-Wilson-20"
                },
                {
                    "user_id": "Robert Broughton",
                    "user_href": "/profile/Robert-Broughton-3"
                },
                {
                    "user_id": "David Cadman",
                    "user_href": "/profile/David-Cadman-2"
                },
                {
                    "user_id": "Erika Hi",
                    "user_href": "/profile/Erika-Hi"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Rumbaugh",
                "href": "/profile/James-Rumbaugh-1"
            },
            "answer_text": "Carter's Little Liver Pills and Ovaltine. On a more serious note (slightly) you probably are overwhelmed by all the stuff. So are most millennials. Sure some techies/ geeks are up to scratch across the board, because it's their profession. But most don't know a lot about it outside their jobs and of course social media. As to the former they were either school trained ( Do you want to go back? Can you? Time and money) or got OJT…which again unless you have to be involved…eg…learning Swedish if your job sends you there…you need not know much about it.. .setting up a commercial website, pay pal, etc. If your interest is social you have to jump in, be frustrated, bored, excited or as in my case, appalled. Imagine some folks from the 1920s time warped to the 1960s. Would they have to know how a refrigerator worked, television set, automatic transmission, jet plane, electric typewriter, fax, to enjoy life? Many lived into the 60's and didn't. Ask yourself is the jabberwocky worth it. Like buying a boat…and then….you may like it..or not. Finally, if you feel you are really missing out…go on youtube asking to see how things are done ….everything from turning on your cellphone to cooking meth. ",
            "date": "Answered January 16, 2020",
            "views": "823",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Charles Morgan",
                    "user_href": "/profile/Charles-Morgan-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Summers",
                "href": "/profile/Chris-Summers-22"
            },
            "answer_text": "How much of an “older person” are we talking about? I know plenty in their 80s that are online, use smartphones, have email and social media and are active with them. My dad was on his emac editing photography shoots he would do for businesses up until he passed when he was in his 70s. I know many that are on here that are in their 70s and 80s answering questions about tech. Your president of the US is active on Twitter along with trying to run the country in his 70s. So age doesn't mean much anymore. Gone are the days when you hit 50 you might as well buy a rocking chair and rock your days away. All that is needed to teach someone is to talk with them at their level of understanding. I taught little old ladies how to set up their first computer when they were in their 60s. Several wrote books, got online, and became active online for the first time in their lives. Those “older” people are the ones who made that technology today's generation enjoys possible in the first place. They laid the foundations of all that. They/we understand more than you think. ",
            "date": "Answered January 16, 2020",
            "views": "954",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ubong Akpan",
                    "user_href": "/profile/Ubong-Akpan-4"
                },
                {
                    "user_id": "Paul Zabawa",
                    "user_href": "/profile/Paul-Zabawa"
                },
                {
                    "user_id": "Óscar Medina",
                    "user_href": "/profile/Óscar-Medina"
                },
                {
                    "user_id": "Patricia Hay",
                    "user_href": "/profile/Patricia-Hay-1"
                },
                {
                    "user_id": "Dhruv Bhatt",
                    "user_href": "/profile/Dhruv-Bhatt-45"
                },
                {
                    "user_id": "Zack Levy",
                    "user_href": "/profile/Zack-Levy-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Munson",
                "href": "/profile/Michael-Munson-13"
            },
            "answer_text": "“How can an older person keep up with fast change technology?” ??? We can’t. No one can, young or old. The way existence works is, that you go about your life as best you can, and whenever you run into something you don’t know how to “work,” you learn about it then. “Keeping up” would mean spending all day every day, searching the world for every technological change, and get training about it. No one can do that. There is no magic shift that happens to someone with age alone, that causes them to regress in ability to deal with change. What can cause it to appear that way, is that lots of people who have been around longer than you, and who aren’t insanely rich, have and use older still working technologies, because they do still work. Only the very rich can afford to update everything as soon as a new device comes out. Therefore lots of people older than you use old tech, because they have no need to use what you are using. At least not as soon as you think they should. ",
            "date": "Answered January 19, 2020",
            "views": "571",
            "upvotes": " Answer requested by Davina Gjennestad",
            "upvoters": [
                {
                    "user_id": "Michael Inyanguko",
                    "user_href": "/profile/Michael-Inyanguko"
                },
                {
                    "user_id": "Srooley Harp",
                    "user_href": "/profile/Srooley-Harp"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Spies",
                "href": "/profile/Rick-Spies"
            },
            "answer_text": "Just because someone is “older” doesn’t mean they’re automatically out of touch with technology. I’m a couple weeks short of sixty-one. I’ve been a proud geek for more than 40 year. My first computer, the original Compaq Portable, cost me the equivalent to ~$9000 in 2019 dollars. (I still have this PC!) NCSA Mosaic 1.0, in the early 90s, was my first GUI Internet browser. You could search the Archives of Usenet Newsgroups and find my posts from the same era. One of my “hobbies” is beta testing technology products for several major and a few minor companies. I think I’m approaching 50 different products for perhaps 15 companies. I’ve lost track. I’m currently participating in three betas at once. I suppose a more direct answer to your question would be that I have simply kept up to date by keeping involved. 🙂 ",
            "date": "Answered December 24, 2019",
            "views": "608",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harry Keller",
                    "user_href": "/profile/Harry-Keller-5"
                },
                {
                    "user_id": "Sam Loh",
                    "user_href": "/profile/Sam-Loh-7"
                },
                {
                    "user_id": "Blake Senftner",
                    "user_href": "/profile/Blake-Senftner"
                },
                {
                    "user_id": "Dennis Eichenlaub",
                    "user_href": "/profile/Dennis-Eichenlaub"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doreen Mallett",
                "href": "/profile/Doreen-Mallett"
            },
            "answer_text": "Why do we need to keep up? We don’t need to have our lives directed by technology, all we need to do is to ensure that we understand from a usability stand point, those areas of technology that are complementary to our way of life whatever we choose that life to be. For instance - using the telephone for communication and not necessarily all the other functions that often force themselves on you. That is easy enough to manage for anyone.using the computer for those things which add to your way of life - online shopping , email, bill payment, basic banking …using services like Amazon to facilitate your life eg self-publishingetc…These are the technology services that I use and I do so quite efficiently. I think that if seniors apply the kind of attitude to technology as I do i.e. use what you need for a more efficient living and ignore the rest - do not let your life be driven by every new and hot tekky device - then no problem. I do watch technology shows, I find them intriguing but my life is not driven by them. Doreen ",
            "date": "Answered December 23, 2019",
            "views": "819",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Cadman",
                    "user_href": "/profile/David-Cadman-2"
                },
                {
                    "user_id": "Cynthia Watkins",
                    "user_href": "/profile/Cynthia-Watkins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Bennett Sharp",
                "href": "/profile/Mary-Bennett-Sharp"
            },
            "answer_text": "Someone will have to physically take my old device away from me and place the new and improved device into my empty hand. I don't read much about the latest tech news or any of their newest discoveries. As long as I have the same basic running system as I had on my old device, I can figure it out. I'm 64 and I ’m certain technology will advance leaps and bounds in the coming years. I realize that my leaps and bounds will be going in the opposite direction as I age. I may not be able to stay current, I shall be trying though! Right up to the moment that they pry my tablet and my cell phone from my cold dead hands. By the time I no longer can figure it out for myself, my grandkids should be at the perfect age to teach me. Or, I'll get overwhelmed and shit can the works! ",
            "date": "Answered December 6, 2019",
            "views": "398",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Audrey Larson",
                    "user_href": "/profile/Audrey-Larson-14"
                },
                {
                    "user_id": "Clement Liu",
                    "user_href": "/profile/Clement-Liu"
                },
                {
                    "user_id": "Jordan Burns",
                    "user_href": "/profile/Jordan-Burns-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Hansen",
                "href": "/profile/Dave-Hansen-9"
            },
            "answer_text": "I graduated with an engineering degree in 1964. My senior project involve coding and programming a computer controlled drill. I had previously worked in the missile industry in tool engineering. There has been no fast change in technology since about 1980. Pretty much everything is controlled by software. I am an inventor with new ideas but what everyone wants is a product you can put online for sale and make a bunch of money. Business today reminds me of a farmer who keeps growing the crop that produces the most money with no thought to maintaining his ground for the future. The people who evaluate my ideas do not really understand the technology and their company or organization does not want to spend the time required to build the marketing mechanism. The computer is a wonderful tool but, once everyone has one and knows how to use it, you no longer need the experts. I believe progress comes from building, testing, identifying and correcting mistakes. The computer is history and not a crystal ball. Iguana ",
            "date": "Answered February 9, 2020",
            "views": "884",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Cadman",
                    "user_href": "/profile/David-Cadman-2"
                },
                {
                    "user_id": "Cynthia Watkins",
                    "user_href": "/profile/Cynthia-Watkins"
                },
                {
                    "user_id": "Leoco Li",
                    "user_href": "/profile/Leoco-Li"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paige Noel",
                "href": "/profile/Paige-Noel-10"
            },
            "answer_text": "Go to udemy.com, they have a New Year’s special or some other online course website that you trust. Take beginner courses in technology but make sure that you read the reviews so you are taking a course from a good instructor as there are some not so great instructors on udemy too. Start to learn something new. It is good to look at job postings in your workplace that have you “intimidated”. Look at the names of the requirements like “Java”, “HTML”, “SASS”, etc. and then put a term like that into the search box at Online Courses - Learn Anything, On Your Schedule | Udemy and enrol in one course only. Right now the special price is $10-$13 depending on where you live. Don’t race through a course. Instead put time aside like 2–3 days a week where you work on it for 1–2 hours. Chip away at it and do the actual exercises that you are shown. In time you will get more comfortable with new technology and it won’t be so hard learning something new. We are always fearful or uneasy over things that are strange to us. You can do it! ",
            "date": "Answered January 1, 2020",
            "views": "12",
            "upvotes": " Answer requested by Davina Gjennestad",
            "upvoters": [
                {
                    "user_id": "George Claxton",
                    "user_href": "/profile/George-Claxton-1"
                },
                {
                    "user_id": "Vinaya Menon",
                    "user_href": "/profile/Vinaya-Menon"
                },
                {
                    "user_id": "Kaleb Hunter",
                    "user_href": "/profile/Kaleb-Hunter-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Royanne Boyer",
                "href": "/profile/Royanne-Boyer"
            },
            "answer_text": "I wish I knew! I always had a tech guy who took care of everything for me. My husband, who taught uni Information systems was very clear that he wasn’t going to become my go-to when I retired. We’ve been retired so long that he really has to experiment - which takes time - to solve technical issues. Two of my children are top-notch tech people, but we are 250 miles apart. I do love innovation, but wonder if I can possibly keep- even remotely- up to date, especially as we are about to face a wave of new technology. Naturally, I use Alexa- even though she spies on me. So, I doubt many seniors/elders will do much more than try, and then grouse! ",
            "date": "Answered December 6, 2019",
            "views": "230",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sawyer Putnam",
                    "user_href": "/profile/Sawyer-Putnam"
                },
                {
                    "user_id": "Josh Garcia",
                    "user_href": "/profile/Josh-Garcia-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica McEachern",
                "href": "/profile/Jessica-McEachern"
            },
            "answer_text": "I think this is best suited for older people who don’t already have a background in technology and can become quite overwhelmed with it. In that case, it wouldn’t hurt for family members or friends who are already well-versed in the technology to introduce it to them, especially emphasizing how it is capable of helping them. My mom is 73. She didn’t start using email until 2006 (when she turned 60). I had used it for 10 years prior starting in college, and she had asked me for help in using it. I sat with her and showed her the basics, wrote down instructions for her to keep in a pad beside her laptop, etc. She still had questions, but I would patiently go over everything with her. In time she got used to it and was able to do it on her own. Now she can do pretty much anything on her iPhone. ",
            "date": "Answered December 30, 2019",
            "views": "11",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Barry Lester Weingast",
                    "user_href": "/profile/Barry-Lester-Weingast"
                },
                {
                    "user_id": "Raymond Russell",
                    "user_href": "/profile/Raymond-Russell-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dheeraj Bhushan",
                "href": "/profile/Dheeraj-Bhushan-2"
            },
            "answer_text": "What do you mean by older. Human brain does not regrow on its own ( ReNeuron is exception) you only grow older after a brain is born. The old adage of I could learn a lot but my education is an impediment has some solid truth to it. Learn to forget and let go. Several tests in older Adults in 65–80s compared to children under 10–15 years show similar pattern of improvement in cognitive tasks once challenges are removed. Here is a link to a TED talk related to the topic Growing evidence of brain plasticity The old excuse is just your brain’s way of justifying the inability to accept the cognitive challenge, just like a kid in school says I forgot my book at home ! ",
            "date": "Answered January 16, 2020",
            "views": "808",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hafez Kiman",
                    "user_href": "/profile/Hafez-Kiman"
                },
                {
                    "user_id": "Naresh Kodiganti",
                    "user_href": "/profile/Naresh-Kodiganti"
                },
                {
                    "user_id": "Bobbi Punjabi",
                    "user_href": "/profile/Bobbi-Punjabi"
                },
                {
                    "user_id": "Greg Trobaugh",
                    "user_href": "/profile/Greg-Trobaugh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Glowacki",
                "href": "/profile/Chris-Glowacki-2"
            },
            "answer_text": "First step is to realize that you don’t need to track ‘change’, you need to track ‘progress, or sadly, sometimes, regress… Facebook to Youtube to Twitter to WhatsApp to Instagram to SnapChat to TikTok is certainly a lot of apparent change, but is it?? Look at the world- hundreds of new technologies in the last 2 decades, and yet we’re still battling ideologies that would have been perfectly at home in Mussolini’s Italy, or Mao’s China. Being able to say stupid things at the speed of light is change, but it’s certainly not progress. Don’t worry fellow Boomers- the Gen Z’ers will have their moment to realize that they too, fiddled while Rome burned… ",
            "date": "Answered April 12, 2020",
            "views": "14",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sam Loh",
                    "user_href": "/profile/Sam-Loh-7"
                },
                {
                    "user_id": "Shital Sonatkar",
                    "user_href": "/profile/Shital-Sonatkar"
                },
                {
                    "user_id": "Michael Keehl",
                    "user_href": "/profile/Michael-Keehl-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Keller",
                "href": "/profile/Harry-Keller-5"
            },
            "answer_text": "You do not have to keep up with every new fad, video game, or pop star.Choose the ones that are useful to you.Become computer-savvy, as in being able to use email, browsers, and any tool that interests you.Ask questions on any forum or ask your children and grandchildren.I began programming computers in 1960 and have never stopped. Yet, I do not attempt to know everything technological. I have learned to wait until new technology really has become stable rather than a passing fad. Then, I evaluate its potential to help my life. Finally, I dive in or reject it. BTW, this approach should be applied at any age. ",
            "date": "Answered January 2, 2020",
            "views": "667",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Keith Brown",
                    "user_href": "/profile/Keith-Brown-29"
                },
                {
                    "user_id": "Brynn Crowley",
                    "user_href": "/profile/Brynn-Crowley"
                },
                {
                    "user_id": "Harrison Butchart",
                    "user_href": "/profile/Harrison-Butchart"
                },
                {
                    "user_id": "Ranveer Rajesh Singh",
                    "user_href": "/profile/Ranveer-Rajesh-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Fetterman",
                "href": "/profile/Sarah-Fetterman-1"
            },
            "answer_text": "Don't. There is nothing wrong with using a paper and a pencil. There is nothing wrong with doing math calculations in Your Head. There is nothing wrong with bypassing the automated cash register to go through the checkout line and make contact with another human being. There is nothing wrong with pressing #7 to speak with a Real human being instead of a machine. There IS something wrong with a world-wide internet system that allows for Identification Theft, credit card fraud, and pedophile predators. There IS something wrong about Facebooking falsehoods in order to project an image that is Not Real to others, rather than having face to face encounters with them. There IS something wrong with any technology that discourages human contact and encourages Crimes Against Humanity. ",
            "date": "Answered January 3, 2020",
            "views": "12",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shubham Ayush",
                    "user_href": "/profile/Shubham-Ayush-3"
                },
                {
                    "user_id": "Ashish Gawali",
                    "user_href": "/profile/Ashish-Gawali-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Anderson",
                "href": "/profile/Michael-Anderson-28"
            },
            "answer_text": "How? By creating the fast changing technology. That’s the cool thing about being an engineer. I might be old, my kids are all adults, and I’ve lived a more years than I have left; but I’m still designing the cutting edge technology. And as long as my mind is sharp I can keep on designing. The arthritis affects my ability to use a soldering iron, but not to design. The bad shoulders make it so I can’t lift the heavy test equipment anymore, but I can still use it. ",
            "date": "Answered February 3, 2020",
            "views": "798",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Cadman",
                    "user_href": "/profile/David-Cadman-2"
                },
                {
                    "user_id": "Cynthia Watkins",
                    "user_href": "/profile/Cynthia-Watkins"
                },
                {
                    "user_id": "John Buginas",
                    "user_href": "/profile/John-Buginas"
                },
                {
                    "user_id": "Emmanuel Salihu",
                    "user_href": "/profile/Emmanuel-Salihu"
                },
                {
                    "user_id": "Raghu Ramesh",
                    "user_href": "/profile/Raghu-Ramesh-2"
                },
                {
                    "user_id": "Leoco Li",
                    "user_href": "/profile/Leoco-Li"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Grossman",
                "href": "/profile/David-Grossman-55"
            },
            "answer_text": "Keeping up with technology means continuing to learn. Learning is an investment in the future. And it’s an investment that will benefit only one person — the learner. But as one approaches end of life, many aspects of the future becomes less important. For example, if you’re 100 years old, you won’t care too much about the technology to put colonies on Mars in the year 2060. On the other hand, you are likely to keep up with the technologies needed to communicate with your grandkids, and the pharma technologies to keep you healthy. ",
            "date": "Answered January 18, 2020",
            "views": "13",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Youssef Mouzoune",
                    "user_href": "/profile/Youssef-Mouzoune"
                },
                {
                    "user_id": "James Robbins",
                    "user_href": "/profile/James-Robbins-69"
                },
                {
                    "user_id": "George Petrov",
                    "user_href": "/profile/George-Petrov-6"
                },
                {
                    "user_id": "Sameer Singh Chauhan",
                    "user_href": "/profile/Sameer-Singh-Chauhan-2"
                },
                {
                    "user_id": "Daniel Tallentire",
                    "user_href": "/profile/Daniel-Tallentire"
                },
                {
                    "user_id": "Ivy Chang",
                    "user_href": "/profile/Ivy-Chang-46"
                },
                {
                    "user_id": "Joshua Joji",
                    "user_href": "/profile/Joshua-Joji"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Ussery",
                "href": "/profile/Steven-Ussery"
            },
            "answer_text": "In my case I kept up by being one of the creators of that technology. Even though I am 66, I just retired from three decades of being a Silicon Valley engineer who worked for Apple, Adobe, eBay, Microsoft VMware, Cisco, etc. You didn’t think it was just young people producing technical innovation did you? If so, you were very wrong to assume so. One more stereotype takes a dive… ",
            "date": "Answered December 6, 2019",
            "views": "210",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephanie Ray",
                    "user_href": "/profile/Stephanie-Ray-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elgrit B. Russell",
                "href": "/profile/Elgrit-B-Russell-1"
            },
            "answer_text": "One way I learn is to take the manual and read one paragraph at a time. Then I take every single step in that paragraph and try to do what it tells me to do. But I WRITE DOWN EVERY SINGLE DETAILED STEP. Then I practice and do it over and over again until it is in my head. For me, reading a manual is like reading Greek. I personally have to SEE EVERY SINGLE STEP FROM A TO Z - not just be told to do this or that. I can’t figure out the steps from point A to Z so most times I have to have someone physically SHOW ME while I watch and write. Otherwise, God help me. Manuals are never written for seniors. We do NOT know the steps to get from here to there - write them out in detail. Examples are: plug into the electrical outlet. Turn device on. Then do……step by step. ",
            "date": "Answered December 29, 2019",
            "views": "819",
            "upvotes": " Answer requested by Davina Gjennestad",
            "upvoters": [
                {
                    "user_id": "Sam Taylor",
                    "user_href": "/profile/Sam-Taylor-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ageliki Morris",
                "href": "/profile/Ageliki-Morris"
            },
            "answer_text": "I am 64. How? Decide to learn.  To embrace the new generations and go forward with them. I love my iPhone 11. My iPad Pro, Apple TV, Apple Pay.  I love texting I love being an Official Guide for Google. I don’t like YouTube as much, nevertheless I have an account with many videos. I love technology. Others just decide to live in the past. ",
            "date": "Answered December 24, 2019",
            "views": "699",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Jr Kitchings",
                    "user_href": "/profile/John-Jr-Kitchings"
                },
                {
                    "user_id": "James Taylor",
                    "user_href": "/profile/James-Taylor-1202"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Brendel",
                "href": "/profile/Joe-Brendel-1"
            },
            "answer_text": "Technology now is solely based on security and non-security, so always assume you are being watched so don’t use personal information when you don’t have to. You can also look at technology trends for basic communications and self-management. Keys. We all forget and take for granted our keys, yet we all need to lock our homes, vehicles, and businessesComputer devices: Laptop/Tablet/Mobile phone, etcWashing/sanitary productsTVExersizeFoodWallet/purse/cardholder.ClothingLightsTransportation",
            "date": "Answered December 23, 2019",
            "views": "345",
            "upvotes": " Answer requested by Davina Gjennestad",
            "upvoters": [
                {
                    "user_id": "Trevor Millions",
                    "user_href": "/profile/Trevor-Millions-1"
                },
                {
                    "user_id": "Ian Newman",
                    "user_href": "/profile/Ian-Newman-1"
                },
                {
                    "user_id": "John Griffin",
                    "user_href": "/profile/John-Griffin-75"
                },
                {
                    "user_id": "Jordan Lubus",
                    "user_href": "/profile/Jordan-Lubus"
                },
                {
                    "user_id": "Dennis Mitchell",
                    "user_href": "/profile/Dennis-Mitchell-52"
                },
                {
                    "user_id": "Barbara Ann Webber",
                    "user_href": "/profile/Barbara-Ann-Webber-1"
                },
                {
                    "user_id": "Byron Shuford",
                    "user_href": "/profile/Byron-Shuford-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wicida Sarme",
                "href": "/profile/Wicida-Sarme"
            },
            "answer_text": "I believe it can be done through a lot of readings which will also be hard when eyes are not very cooperative! Being old is difficult enough to maintain more so to keep up with the fast evolving and ever changing development in technology, as I am now experiencing… It is even harder if not impossible even for an electrical engineer when he is already retired as his resources are now already limited.. ",
            "date": "Answered January 1, 2020",
            "views": "650",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Robin Coker",
                    "user_href": "/profile/Robin-Coker-1"
                },
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Aderton",
                "href": "/profile/Jerry-Aderton"
            },
            "answer_text": "It is not easy - is it! I try to ask young people about things. Mostly I ask my daughter. But, she is not real techy. If that doesn’t work, I will ask her husband. He is really good - but many times too advanced for me. But, we keep trying to keep up - don’t we? It changes so fast it is difficult. YouTube videos also help. There are some very good ones on a huge variety of subjects. Thanks for the question. ",
            "date": "Answered January 1, 2020",
            "views": "477",
            "upvotes": " Answer requested by Davina Gjennestad",
            "upvoters": [
                {
                    "user_id": "Veronica Hens",
                    "user_href": "/profile/Veronica-Hens-1"
                },
                {
                    "user_id": "Victor Brinzan",
                    "user_href": "/profile/Victor-Brinzan"
                },
                {
                    "user_id": "Maniraj Manimuthu",
                    "user_href": "/profile/Maniraj-Manimuthu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Turner",
                "href": "/profile/Larry-Turner-7"
            },
            "answer_text": "Simply be open. There is always emerging technology, some of it you may find beneficial, some of it you may not. If something intrigues you, research it. It's harmless to Google a product, or service, or new technology, and you could probably find how-to videos, and other instructions that would help you understand technology from different perspectives. ",
            "date": "Answered January 3, 2020",
            "views": "511",
            "upvotes": " Answer requested by Davina Gjennestad",
            "upvoters": [
                {
                    "user_id": "Darja Shevchenko",
                    "user_href": "/profile/Darja-Shevchenko"
                },
                {
                    "user_id": "Lauren Johnston",
                    "user_href": "/profile/Lauren-Johnston-116"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mason Kelsey",
                "href": "/profile/Mason-Kelsey-4"
            },
            "answer_text": "What is obvious is that the world is becoming more complex and there are more things to learn, know, and use than existed in the 1950s when the brains of the boomers were frozen. They cope as best than can, if they want. But they have lovely young people like you to take care of things. LOL! I do not envy you when you are old. ",
            "date": "Answered December 29, 2019",
            "views": "633",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tusar",
                    "user_href": "/profile/Tusar-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sullivan Richard",
                "href": "/profile/Sullivan-Richard-1"
            },
            "answer_text": "“Technopoly” “the world we live in is very nearly incomprehensible to most of us. There is almost no fact, whether actual or imagined, that will surprise us for very long, since we have no comprehensive and consistent picture of the world that would make the fact appear as an unacceptable contradiction. We believe because there is no reason not to believe.” ― Neil Postman, Technopoly: The Surrender of Culture to Technology ",
            "date": "Answered January 2, 2020",
            "views": "744",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rick Franklin",
                    "user_href": "/profile/Rick-Franklin-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter A Duda",
                "href": "/profile/Walter-A-Duda"
            },
            "answer_text": "I am 85 and a long time ago I learned to pick and choose what I want not what some geek has sprung for the fast buck. When not on this site , I study a foreign language, medicine, physics astronomy. I do not attempt to follow trends, I am an independent in every way possible. I have much pleasure in my life. ",
            "date": "Answered December 24, 2019",
            "views": "787",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arshad Jamaal",
                    "user_href": "/profile/Arshad-Jamaal"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Adama",
                "href": "/profile/William-Adama-5"
            },
            "answer_text": "It takes an interest and work to keep up, but it is far from impossible. Can I use all the functions on my new phone? No, but I don’t have an interest in all of them. I learn and use the ones I need and don’t worry about the rest. It is the same with the rest of new technologies. ",
            "date": "Answered January 20, 2020",
            "views": "357",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yi Xiang Chong",
                    "user_href": "/profile/Yi-Xiang-Chong"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Christoforou",
                "href": "/profile/Christopher-Christoforou-2"
            },
            "answer_text": "Only by choosing to so. If you constantly learn it is easy. Attempting to catch up with the last 10 years worth of technology is not, and you will need a very patient friend or relative to teach you, step by step. The human brain is a brilliant thing and once triggered the learning cycle will start again. ",
            "date": "Answered December 27, 2019",
            "views": "965",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cynthia Watkins",
                    "user_href": "/profile/Cynthia-Watkins"
                },
                {
                    "user_id": "John Buginas",
                    "user_href": "/profile/John-Buginas"
                },
                {
                    "user_id": "Michael Vincent",
                    "user_href": "/profile/Michael-ONial"
                }
            ]
        },
        {
            "author_info": {
                "name": "L. De Vives",
                "href": "/profile/L-De-Vives"
            },
            "answer_text": "Do not ever retire. If you work you will be exposed to new technology in the workplace. If you work you can afford to buy new technology when it comes out if you so desire. If you retire you will stagnate and quit growing. If you retire you will not be current anymore. If you retire you will sit on a shelf and collect dust like an unread book. ",
            "date": "Answered January 9, 2020",
            "views": "22",
            "upvotes": " Answer requested by Davina Gjennestad",
            "upvoters": [
                {
                    "user_id": "Shay McCarthy",
                    "user_href": "/profile/Shay-McCarthy-4"
                },
                {
                    "user_id": "Keyur Panyala",
                    "user_href": "/profile/Keyur-Panyala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Gordon",
                "href": "/profile/Steve-Gordon-90"
            },
            "answer_text": "First realize that you can't. Use the technology you are comfortable with. And secondly, have one of your five year old grandchildren explain all the buttons on all of the tv remotes to you when stumped. Then ask another one.then give up and read a book or do a crossword puzzle. ",
            "date": "Answered December 29, 2019",
            "views": "11",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhishek Kushwaha",
                    "user_href": "/profile/Abhishek-Kushwaha-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cathy Gillespie",
                "href": "/profile/Cathy-Gillespie-1"
            },
            "answer_text": "The best way would be to take classes in your chosen field to get the most up-to-date version of software and hardware. A tutor is always helpful just to advise and instruct and guide which makes things so much easier than trying to learn all these things on your own. ",
            "date": "Answered December 29, 2019",
            "views": "956",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Bill Flewelling",
                "href": "/profile/Bill-Flewelling"
            },
            "answer_text": "I'm 60 years old and have no problem at all keeping up with technology. The challenge is to recognize that much of it won't last, and will end up going the way of the 8-track tape, or even the pet rock. ",
            "date": "Answered December 28, 2019",
            "views": "15",
            "upvotes": " Answer requested by Davina Gjennestad"
        },
        {
            "author_info": {
                "name": "Luis Alejandro Masanti",
                "href": "/profile/Luis-Alejandro-Masanti"
            },
            "answer_text": "What for? You are in your own age of wisdom! Tech is a fake substitute for experience and wisdom… both are only attained thru age and learning from the past. Keep up with the growing of your soul, becoming the best human being you can be. ",
            "date": "Answered December 27, 2019",
            "views": "797",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Howard Neilly",
                "href": "/profile/Howard-Neilly"
            },
            "answer_text": "For anyone without some basic knowledge of science it is very difficult to keep up with the latest technological changes. A lot of technology is based on Quantum Mechanics which involve some counterintuitive reasoning ",
            "date": "Answered January 1, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Steph Mantos",
                "href": "/profile/Steph-Mantos"
            },
            "answer_text": "How old ? If their brain functions well, they can keep up. It depends on whether or not they can afford the newer technology. Do they buy the new Samsung phone or iPhone ? Or, are they limited to an AARP phone ? Tech costs $$$ ",
            "date": "Answered January 15, 2020",
            "views": "6",
            "upvotes": " Answer requested by Davina Gjennestad"
        },
        {
            "author_info": {
                "name": "Sam Loh",
                "href": "/profile/Sam-Loh-7"
            },
            "answer_text": "To me? Very simple do not follow what is new it will never end even if U live for centuries. Just learn what U need to know and follow the flow of your abilities. From a 72 year old experience ",
            "date": "Answered December 26, 2019",
            "views": "27",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Gary Ansorge",
                "href": "/profile/Gary-Ansorge"
            },
            "answer_text": "I was a space nut when I was 9…I’ve cursed the slow rate of change in this world because I want the moon,,,and low gravity…and life extension and electronic augmentation of my brain and,and,,and,,,dang it world,,,SPEED UP…danged slow pokes… ",
            "date": "Answered January 8, 2020",
            "views": "201",
            "upvotes": " Answer requested by Davina Gjennestad"
        },
        {
            "author_info": {
                "name": "Mary Scott",
                "href": "/profile/Mary-Scott-258"
            },
            "answer_text": "The same as a young person does. Just because someone ages, it does not always mean that each suddenly cannot learn new technologies. ",
            "date": "Answered December 6, 2019",
            "views": "153",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Anthony Atkielski",
                "href": "/profile/Anthony-Atkielski"
            },
            "answer_text": "The same way a young person does, although older people tend to be less interested in killing time chasing ephemeral technology. Young people often have nothing better to do. ",
            "date": "Answered December 24, 2019",
            "views": "90",
            "upvotes": " Answer requested by Davina Gjennestad"
        },
        {
            "author_info": {
                "name": "Terry Newton",
                "href": "/profile/Terry-Newton-14"
            },
            "answer_text": "The same way a younger person does. ",
            "date": "Answered January 19, 2020",
            "views": "208",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Lynn Bryant DeSpain",
                "href": "/profile/Lynn-Bryant-DeSpain"
            },
            "answer_text": "Immerse yourself in whatever you are using at the moment, without comparison to the past, not concern of the future. Lynn Bryant DeSpain ",
            "date": "Answered February 3, 2020",
            "views": "753",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Marvin Berman",
                "href": "/profile/Marvin-Berman"
            },
            "answer_text": "This is the key reason one has grandchildren. We were not raised in the digital world and so its not as easy to relate to it let alone manage it effectively. ",
            "date": "Answered December 30, 2019",
            "views": "58",
            "upvotes": " Answer requested by Davina Gjennestad"
        },
        {
            "author_info": {
                "name": "Connie Larkin",
                "href": "/profile/Connie-Larkin"
            },
            "answer_text": "Are you an “older person”? Or, it is pure curiosity? Would knowing the answer to this question make a difference for the better in your life? ",
            "date": "Answered January 8, 2020",
            "views": "488",
            "upvotes": " Answer requested by Davina Gjennestad"
        },
        {
            "author_info": {
                "name": "David Reilly",
                "href": "/profile/David-Reilly-3"
            },
            "answer_text": "Start reading books, listen to topical Podcasts around new tech and join a network like tech London advocates, same as a young guy ",
            "date": "Answered December 24, 2019",
            "views": "20",
            "upvotes": " Answer requested by Davina Gjennestad"
        }
    ]
}