{
    "title": "How can technology be used to improve education in developing countries? - Quora",
    "tags": [
        "Educational Technology",
        "Developed Countries",
        "Developing Countries",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prreeti Radhika Taneja",
                "href": "/profile/Prreeti-Radhika-Taneja"
            },
            "answer_text": "The latest sensation, Artificial Intelligence is said to have capabilities of ending poverty from the world. And of many ways that can happen, includes the role it can play in the education sector. Developing countries can use AI solutions to elevate the standards of their education system with intuitiveness and higher efficiency. Replacing teachers and traditional education standards, they can go beyond the needed scope to teach students much more than curriculum. AI systems can be more efficient in teaching tough concepts even to the weaker students. Plus, education can become much cheaper. So those who can’t afford basic education (whose number is very high in poor countries), even they can learn. In short, everything in the education field could be much more efficient, quick and cheap. However, happening of that in poverty-stricken countries seems like a difficult task for few years moving forward. Because these countries still have poor penetration of internet and computers. They still have very less idea of AI and other cutting-edge technology. So unless you understand something, you won’t really use it, would you!? The community as a whole must be trained to welcome such new-age technology. Governments must invest heftily in building the right infrastructure and bringing transformational change in the society, which, honestly, sounds like a fanatical idea. But yeah, technology can easily improve the state of education system by introducing AI and training communities for such change. But that is only possible if the governments wants it to happen. I have answered the same question at www.letsdiskuss.com. ",
            "date": "Answered January 12, 2018",
            "views": "590",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adithyan S Raj",
                    "user_href": "/profile/Adithyan-S-Raj-3"
                },
                {
                    "user_id": "Satindra Chauhan",
                    "user_href": "/profile/Satindra-Chauhan-1"
                },
                {
                    "user_id": "Avinash Kumar",
                    "user_href": "/profile/Avinash-Kumar-492"
                },
                {
                    "user_id": "राम नारायण",
                    "user_href": "/profile/राम-नारायण"
                },
                {
                    "user_id": "Kanchan Sharma",
                    "user_href": "/profile/Kanchan-Sharma-294"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Leitz",
                "href": "/profile/Carl-Leitz-1"
            },
            "answer_text": "Short answer. In enumerable ways! Furthermore: Education is the doorway to improving everything that effects the lives of the disadvantaged and under-educated. The internet provides a gateway to canned and live education venues. The choices are endless. DIY education in the form of videos and text as well as live classrooms.  Language barriers, geographical barriers and financial barriers to education are easily overcome using broadband internet. I can think of nothing more impact-full and beneficial. The impact of greater education will help balance population growth and spread the value that knowledge creates. Nature provides for all life on earth and it is time for human beings to understand that everything they need and want is supplied by nature at no cost other than labor. Work isn't confined to jobs. Jobs are a form of financial slavery created by the false and failed social science of economics. The few profit while the most live in need.  That has to end. Soon. ",
            "date": "Answered May 8, 2016",
            "views": "444",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Raj Das",
                    "user_href": "/profile/Raj-Das-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaishak Nair",
                "href": "/profile/Vaishak-Nair-15"
            },
            "answer_text": "Developing and Developed countries have one thing in common, and that's \"the internet\". Since most of the solutions these days are cloud-based, improvizations is not an issue anymore, it's just the willingness to improve and the need to deliver quality information in education. For example, mentors can improvise the method of teaching by implementing a kiosk lockdown software that lets them configure and manage devices like tablets/iPads & smartphones. This way teachers & students can collaborate quickly and stay updated with tasks, assignments and discussions. Few scenarios where technology is making a huge difference in developing countries: Device Browser Settings: Since browsing is a primary way to access information, teachers must whitelist only those websites that are necessary. Teachers can whitelist a set of sites and publish the settings remotely from a laptop/desktop.Configuring Apps: Teachers can select apps & have them in Single App Mode or Multi App Mode, and disable volume & home button to not exit from the app.Tracking device/Set Geo-Fence: Teachers can even track devices owned by their organization & even set geo-fence, so that they get notified if the device has entered/exit a specific location.Above are the basic necessity in adopting technology in classroom, know more how this solution can help the education industry.  ",
            "date": "Answered October 16, 2019",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nitin Soni",
                    "user_href": "/profile/Nitin-Soni-76"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ley Lujuo",
                "href": "/profile/Ley-Lujuo"
            },
            "answer_text": "So back in the days. I had this idea. I go to china, buy a lot of tablets for a cheap price. Then, go to a remote town in Tanzania. I look for a primary school and i provide them with the tablets. Now, those tablet will contain educational games where they will teach kids the basic things of life. But, I remember there is a electricity challenge, Then, it hit me, Solar charger, in Tanzania, there’s more solar gadgets in the village nowadays so i have to configure my tablets to use solar charger for power and the power should last for 8 hours. It was a brilliant (IMO) idea, back then but now I’m working 8–5. I can’t implement it, the only best way is sharing it so maybe someone else can do something about it. Hopefully, I answered your question using my personal idea. Maybe you can do something about it. Cheers. ",
            "date": "Answered May 16, 2016",
            "views": "557",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yongpengli",
                    "user_href": "/profile/Yongpengli"
                },
                {
                    "user_id": "Kavya Rao",
                    "user_href": "/profile/Kavya-Rao-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zach Taylor",
                "href": "/profile/Zach-Taylor-56"
            },
            "answer_text": "It largely depends on exactly where they stand technologically. For example, many students could be hugely benefitted by simply having access to Google. Khan Academy has proven to be a remarkable way to learn math. They could be taught typing skills and write essays on Google Drive to share with the teacher. The teacher could comment and the student could edit in real time, saving paper by cutting out numerous rough drafts that students print.  The possibilities are endless.  ",
            "date": "Answered May 9, 2016",
            "views": "188",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Adithyan S Raj",
                    "user_href": "/profile/Adithyan-S-Raj-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Lambert",
                "href": "/profile/William-Lambert"
            },
            "answer_text": "Instead of landlines, cell phone towers can be built. Instead of laptops and desktop computers, tablets can be used. ",
            "date": "Answered July 8, 2016",
            "views": "51",
            "upvotes": " Answer requested by Raj Das",
            "upvoters": [
                {
                    "user_id": "Partha Shakkottai",
                    "user_href": "/profile/Partha-Shakkottai"
                }
            ]
        }
    ]
}