{
    "title": "How to back up my computer to a USB drive - Quora",
    "tags": [
        "Flash Drives",
        "Universal Serial Bus (USB)",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Willemsen",
                "href": "/profile/John-Willemsen"
            },
            "answer_text": "You would first need to provide the people you’re asking with at least some (clear) information, such as your OS (Windows, Mac or a Linux distro) and its version. If you don’t care enough about getting a clear answer to make that teeny tiny effort, then I don’t even want to help you because that makes an incredibly lazy impression. Lots of admin tasks on Windows and Mac require a small dedication of time, effort and attention and most of them on Linux distros do, and formulating a clear, concise and unambiguous question requires all three. In your case, like I said; you could at least -at the VERY least- have indicated which OS you use, the version thereof and whether or not you have any additional requirements in terms of what you back up, how you back it up and what you want to be able to do with it / how you want to be able to use it. Having failed at that, I’ll keep it short: JFGI. ",
            "date": "Answered August 20, 2020",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Daniel",
                "href": "/profile/Michael-Daniel-21"
            },
            "answer_text": "Thanks for A2A. How do I back up my computer to a USB drive? Because it is the dominant OS, I am assuming Windows. If you visit Spotmau.com, you can download a freeboot ISO. It will back up an entire disc or a partition to your specified target drive with user-selectable compression levels. The catch is that if you reverse the process it will overwrite everything with the original version. You can’t pick and choose files. It also offers some other functions that I find useful. If you are willing to pay for a licence, then it can be integrated into Windows as a regular backup tool with greater functionality. Otherwise, make a habit of manually backing up your personal data. You can drag entire folders from Source to Target and Windows will only interrupt when it finds a new file on the Target drive. ",
            "date": "Answered August 20, 2020",
            "views": "49",
            "upvotes": " Answer requested by Adekunle Sogbesan"
        }
    ]
}