{
    "title": "How is the OnePlus Nord smartphone for playing games? - Quora",
    "tags": [
        "OnePlus (company)",
        "OnePlus One (product)",
        "Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ritik Dewangan",
                "href": "/profile/Ritik-Dewangan-6"
            },
            "answer_text": "Firstly i say you to, Oneplus Nord is comes with Qualcomm letest Chipset , Qualcomm Snapdargon 765G, which is really amazing as well as 5G chipset. Here in this chipset, you can easily play heavy online games or daily work, its never disturbing you. We all know Oneplus smartphones are powerpack smartphones. Here oneplus nord is also gives amazing performence. However there might be some issues like battery discharging & speaker etc. So overall Oneplus Nord Smartphone is one of the best smartphone to play games or daily work. ",
            "date": "Answered September 20, 2020",
            "views": "481",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajay.T.Shaju",
                "href": "/profile/Ajay-T-Shaju"
            },
            "answer_text": "I got the phone a week ago and in my user experience, the phone is good as a daily driver but not that good for high end gaming like PUBG or Call Of Duty you can still play games in lower fps modes. Games like Clash of Clans can be played very efficiently but I get some problem in screen recording the gaming The processor is High for doing daily tasks and video streaming purposes without any problems but not for high graphics games- you can get very good gaming experience from Nord's competitiors like Realme X3 superzoom & Redmi K20 pro ",
            "date": "Answered August 19, 2020",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Younus Mohammad",
                    "user_href": "/profile/Younus-Mohammad-2"
                }
            ]
        }
    ]
}