{
    "title": "How can we make technology more accessible globally?  What is the best way to foster innovation and 'appropriate technology?' - Quora",
    "tags": [
        "Technological Innovation",
        "Advice for Daily Life",
        "Self-Improvement Advice",
        "Innovation",
        "Technology Trends",
        "Understanding Self-Improvement",
        "Self-Improvement",
        "Technology",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "There are   three stages The technology has to existThe education to use it has to existThe economy to support it has to existWhen all three exist the system 'goes critical' in that there is an increasingly convergent state where every new technical development finds more ways of being exploited, and the increase is exponential This has already happened in the West, and those countries that do not have the technology, education, and economy to necesssary will never catch up The countries that do have these elements will create virtual Information Empires Imagine the USA in the 1960's deciding not to go to the Moon, but instead decided to invest all its resources into Computing, Material science, fuels, and all the fundamental requirements for space exploration.Then when they had reached todays level knowledge, that's when they decide to build a rocket It would mean all the early rocket failures would not have happened. The spin-off from the basic science would have had commercial applications much earlierConvergence would have happened much soonerThe world would have been far more advanced in the techno-countries, and the non-techno-countries would have become dependent on technologies they could not make themselves In effect, we have reached that state nowNow much effort is being put into how to mass produce Graphene with all its wonders. Yet we do not know that they will beSeveral large corporations developing electrical storage, without knowing exactly what forA a whole range of alternative energy forms, yet the markets not clearly definedNew forms of transport, yet no ultimate purpose for themVarious alternatives to money, yet not sure who will use themSeveral ways of bringing the internet to the farthest corners of the earth, yet who are the customers In all, we can start with the knowledge that such developments will certainly pay off in some way, but how and when is another matter It is a different way of thinking. It is no longer 'There's the problem, how do we solve it?'But, 'There's a solution, now let's find a problem to fit it' In answer to the question of how do we make technology more accessible to all walks of life It will be made simpler so more can use itIt will be cheaper so more have access to itIt will incorporate humans into the loop so we are part of itIt will be everlasting or disposable so we don't have to think about itIt will appropriate to the needs, and effectively make us all equal in the social senseIt will change us so we have to rethink our philosophies on meaning and purposeDeus ex machina",
            "date": "Answered August 21, 2015",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Chaychuk",
                    "user_href": "/profile/Alexander-Chaychuk"
                },
                {
                    "user_id": "Yashas",
                    "user_href": "/profile/Yashas-25"
                },
                {
                    "user_id": "Samuel Liu",
                    "user_href": "/profile/Samuel-Liu-7"
                },
                {
                    "user_id": "Donna Murdoch",
                    "user_href": "/profile/Donna-Murdoch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Werninck",
                "href": "/profile/Peter-Werninck"
            },
            "answer_text": "I think access to the internet especially in education would improve all walks of life. Giving those less off access to this valuable resource would be a good idea I think The sharing of knowledge via the internet is such a valuable technological asset that we should improve on. How many videos exist on Youtube educating you in how to do things?  I am in the process of leaning a language off of Duolingo, which is free and accessible to everyone. THAT is a epic use of modern tech we should work more on. Tech like iPads and interactive learning programs and things similar should be used more in schools I recon to improve general teaching.  Personally, I would think that technology will inevitably be used to make the human labour force redundant and people could instead focus on creative pursuits instead.Politics could benefit also I think. In school, we learned that direct democracy is impossible for practical reasons however, now with the internet and mass communication I recon it's likely possible to have political issues more accessible to the public :) It's a good question though :) Tough to answer. ",
            "date": "Answered August 21, 2015",
            "views": "376",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donna Murdoch",
                    "user_href": "/profile/Donna-Murdoch"
                },
                {
                    "user_id": "Paul Shilla",
                    "user_href": "/profile/Paul-Shilla"
                }
            ]
        }
    ]
}