{
    "title": "How can technology help the community? - Quora",
    "tags": [
        "Community"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Popovich",
                "href": "/profile/John-Popovich"
            },
            "answer_text": "Solaculture Fluidynamic Concentrators  Solaculture array canopies supported by wire hoops Solaculture arrays collect and fluidynamically concentrate the direct and diffuse solar thermal energy absorbed by covered earth regions. Air intakes from engine driven co-fueled generators are used to create slightly sub-atmospheric pressures within regions covered by transparent microporous fabrics (crop covers). The sub-atmospheric pressure causes atmospheric air inflow and directs air within the arrays towards the engine air intakes. The air is convectively heated by the earth during its travel to the intakes. Heat loss from plants and the earth to the local environment is primarily by convection and evaporation, both are prevented by the inward passage of air thru the porous canopies and by boundary layer flow along the inner canopy surfaces. Air inflow thru the covers prevents air and gas escape, cools the covers, and reduces the drag on air flow along the canopy interiors. Solaculture arrays collect and concentrate water from the atmosphere and from precipitation drawn thru the canopies. The water can be used for plant growth. The water vapor emitted by plants and the local earth is concentrated and directed to the engine air intakes. The exhaust from internal or external combustion engines or heaters fed with \"air\" from Solaculture arrays contains water vapor from the local atmosphere, water evaporated from the plants and the earth and the water of combustion from biogas produced within the array and from the cofuel supplied. The percentage of water in the exhaust is much greater than the atmosphere can hold as vapor and much of it condenses on exit. Additional water can be collected with low cost heat exchangers. Some of the heat, water and CO2 can be returned to the array for plant growth. Solaculture systems can be net water producers and output distilled water for a variety of uses. Solaculture water recycling. Wastewater, from municipal sewage, animal husbandry, and agriculture causes excess nutrients in waterways, lakes, and oceans. The water and the nutrients can have great value in Solaculture arrays for the growth of plants, algae, and for biofuel production. Solaculture arrays evaporate, concentrate, and condense the water for reuse. Solaculture arrays collect and concentrate biogas (methane/hydrogen) by drawing atmospheric air thru porous canopies to prevent gas escape thru the canopies and to allow any biogas and oxygen produced in the covered regions to be concentrated and directed to engine air intakes. The biogas can be from microbial processes within the earth associated with plants, landfills, remediation sites, sewage, garbage, bogs, swamps, reservoirs, coal mines, coal piles, tar sands, oil and gas well regions, ruminants or other sources. Solaculture arrays can produce biogas in situ in cooperation with microbial communities that occur and prosper in the local environment rather than removing and transporting plants to remote processing facilities for conversion to biofuels. The cheapest way to reduce atmospheric CO2 is to increase plant matter and to store the resultant decay products in the local earth. The “Azolla Event” of 50 million years ago is one example of how this process can dramatically reduce atmospheric CO2. Atmospheric methane is a concern in climate change and many existing sources such as landfills, oil and gas producing regions, sewage ponds, animal feed lots, and peat bogs can be economically captured by Solaculture arrays. Solaculture fluidynamic concentrators can provide low cost food, water, electricity, fuel, and heat, and Solaculture can increase plant growth and the regions where plants can be grown by improving the plant environment through enhanced control of sunlight, water, air, CO2, and temperature. By also using the local earth for short and long term storage of fuel, heat, water, and for the sequestration of CO2 via plants and their decay products, Solaculture can better provide life’s needs with the addition of climate benefits. Low cost (<$1/m2) transparent porous row covers such as Agribon AG-19 are currently used to increase crop yields and similar canopies can be used in Solaculture arrays. Solaculture is especially attractive for off grid regions and independent residences, including the provision of water, water recycling, and sewage, garbage and agricultural waste energy conversion. Low cost land, unsuitable for conventional agriculture can be made productive with Solaculture. Solaculture for Landfills Landfills can be covered by Solaculture arrays and the “landfill gas” emitted can used to cofuel engine driven generators. A very slight subatmospheric pressure (ΔP<1mbar) created under the canopies by engine air intakes causes atmospheric air inflow thru the microporous canopy media. Transparent porous row cover media such as Agribon AG-19 are currently used as crop covers and are available for <$1/m2. Low tunnel canopies can be supported by periodic wire hoops. 3/16” diameter steel wire rod is commonly used and cost ~$0.35/lb in quantity purchase. Solaculture fluidynamic solar concentration is much less costly than radiative solar concentration and offers many additional benefits. Solaculture fluidynamic solar concentrators can have much higher concentration ratios than radiative solar concentrators, and can be much more efficient. Solaculture arrays can use both direct and diffuse solar radiation, and do not require tracking or spacing. Drawing air for a cofueled engine driven generator from a 10 hectare Solaculture array (100,000m2) thru a 1m2 duct yields a concentration ratio of 100,000 for solar heated air, biogas, and water. A 1kw/m2 net solar radiation yields 100MW thermal input. Solaculture arrays can use solar energy to increase the average temperature of the landfill and thereby increase microbial productivity and evaporation of the contained water, a process that requires a large amount of thermal energy. Much of the U.S. receives 2,000kwh/m2/yr solar radiation, so the solar energy can be of considerable value in water evaporation and concentration, heat, crop and biofuel production. U.S. EPA estimates 5 Tg methane emission and 100 Tg CO2 equivalent emission from U.S. landfills in 2012, approximately 18% of total U.S. anthropogenic methane emission in 2012. The annual value of U.S. landfill methane (5 Tg) is ~$220Billion. Landfill cap costs often exceed $50.00/m2 . Microporous row cover media used for crop protection (Agribon AG-19) cost ~$0.5/m2.and is widely available. U.S EPA estimates landfill methane well cost ~$6.00/m2 and there is further extraction cost associated with plumbing and blowers. Solaculture canopies can be placed in operating or closed landfills for energy production Solaculture systems offer lower costs and construction times than conventional cap and well arrays and can provide fresh water and heat in addition to fuel. Solaculture offers a profitable solution to an environmental problem. Industrial biofuel processes are associated with costly and proprietary microbes, enzymes, and methods that are used to rationalize process trains that cost tens of millions of dollars and take several years to demonstrate failure, and with many on the payroll reluctant to question. We cannot get any more energy from plants than that resulting from the local sunlight. Removing the plants and sending them to a remote facility for biofuel production implies costs that are difficult to rationalize. Industrial biofuel processing facilities consume large amounts of taxpayer money, in addition to being large users of natural gas and electricity, often produced from coal. If the industrial biofuel processes really made more economical fuel, wouldn’t they be used to fuel the process? Farmers have learned to use solar energy profitably and Solaculture offers farmers greatly expanded range. ",
            "date": "Answered February 24, 2017",
            "views": "374",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Laura Blohm",
                "href": "/profile/Laura-Blohm"
            },
            "answer_text": "Community activities are stored indefinitely. They create a body of knowledge. They create a sum of previous stories and shared experienced. This is powerful for communities filled with tacit knowledge easily lost when members depart. You can use this to rapidly improve the skills/abilities of members. Technology allows you to have clear influence over what the community. You can add remove discussions, highlight members and material you want people to pay attention to, and establish the rules for participation more easily than you could with an off line community. ",
            "date": "Answered February 15, 2017",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hoda Elebiary",
                "href": "/profile/Hoda-Elebiary"
            },
            "answer_text": "It does not it is the weakness in this era ",
            "date": "Answered May 30, 2018",
            "views": "10",
            "upvotes": "0"
        }
    ]
}