{
    "title": "How does 3D technology work? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Warren Hyde",
                "href": "/profile/Warren-Hyde"
            },
            "answer_text": "Stereoscopic imaging is almost as old as photography itself, and although not much has changed in the theory, the techniques have made huge leaps especially this century with many movies using 3D as their drawcard. The principle is simple: two images are used from two cameras about 70mm apart (or further for greater effect) and these represent the viewers eyes. Nowadays with motion tracking technology, camera movements can be replicated in 3D applications so CGI can be incorporated seamlessly into movie footage. Back in the 70s when colour TV was just emerging, stereoscopic movies were brought to the cinema using anaglyph 3D, where each eye had a separate coloured lens (red/cyan or red/green) and both camera images were combined on screen at the same time with limited neutral colour. These were mostly a fad, and hardly became mainstream viewing. Over the last fifteen years or so, 3D movies have been revived with the use of either polarised lenses, or shutters on viewers glasses. Both allow full colour to be seen while each eye gets its own separate image. Shutters alternated between left and right eye, synchronising with the appropriate image on screen, while polarised lenses are lighter and allow both images on screen simultaneously, although each eye can only see its own image. Most cinemas make use of the polarised lens technique, as they can have two cameras with polarising filters beaming the images onto the cinema screen. Home viewers don't have this setup and instead have the synchronising shutters associated with their 3D TVs. This is why the glasses at home require batteries and the cinema glasses seem like cheap sunglasses. ",
            "date": "Answered September 13, 2015",
            "views": "445",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arshad Jamal",
                "href": "/profile/Arshad-Jamal-22"
            },
            "answer_text": "3D movies starts with the help of two camera and two Eyes. A Photographer takes two image simultaneously two image. Theses two image is projected on same screen. Our 3D glass separates these two image in way that our left eye gets only left Image and our right Eye get only right Image. Then our Brain joins these two image and we feel depth and popup effect.  These is the oldest method in this Image to get the basic idea. If you want to get into the details of new method and all formats then you could visit “www.whatis3d.co” ",
            "date": "Answered February 14, 2020",
            "views": "38",
            "upvotes": "0"
        }
    ]
}