{
    "title": "How difficult is nanotechnology? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Etienne Palos",
                "href": "/profile/Etienne-Palos"
            },
            "answer_text": "I will assume that you are referring to the difficulty of a bachelor’s program in Nanotechnology (Nanotechnology / Nanoscience /Nanoengineering). I will begin to answer this by describing the field itself, then the “difficulty” of an academic program, and finally research. Nanotechnology is a multidisciplinary field consisting of a combination of physical, chemical, biological, computational and engineering methods to study materials at the nano-scale ( 1 nm = 1 x 10^-9 m). This roughly translates to the the molecular and atomic levels in some cases. Although Nanotechnology seems to limit itself to a very small scale and its overall scope may be pretty straightforward, it is a very broad field. As mentioned above, Nanotechnology combines methods and techniques from all major STEM fields. Ideally, a student will fit the profile to study Nanotechnology if they feel passionate about science and technology, is naturally curious, enjoys challenges and is fond of learning through research and hands-on-experience. As a Nanotechnology student, you would have to learn the fundamentals of: Mathematics: Single variable Calculus, Linear Algebra, Vector Calculus, Probability and Statistics, Differential Equations (ODEs & PDEs), Fourier Analysis, Complex Analysis and Special Functions, etc.Physics: Classical mechanics, Thermodynamics, Wave mechanics, Electromagnetic theory, Optics, Modern Physics, Quantum Mechanics, Solid State physics, Statistical Mechanics, Plasmonics, Spintronics, Computational Condensed Matter Physics (i.e. Electronic Structure , Quantum Chemistry), Semiconductor Physics, Materials Science* and Condensed Matter*Chemistry:General, Inorganic, Organic, Biochemistry, Environmental Chemistry, Materials Chemistry (Solid-State Chemistry), Thermodynamics (chemical), Kinetics, Thermostatistics, Catalysis, Polymer chemistry, Materials Science*, Condensed Matter*, Computational Chemistry, Reactions engineering, etc.Biology: General biology (Bio systems), Biochemistry*, more Biochemistry, maybe more Biochemistry, Molecular Biology, Microbiology, Cell Biology, Biophysics, Genetics, Bio - Thermodynamics, Bio-materials, Bio-catalysis, Enzymology, Bioinformatics, etc.Engineering: Computer Aided Design (e.g. Solid-Works software for 3D modeling and printing), Basic Electronics, Economics and Finance Analysis, Programming (MATLAB, Python, C++), Electronic instrumentation, Circuit Theory, Microscopy and Spectroscopy methods (e.g. SEM, STM, Raman, FTIR, NMR), Microelectronics (clean room! ALD, Sputtering), maybe some electives oriented toward industry, for knowledge con patents and industrial intellectual property!NOTE: The courses I listed are only to give an idea of what courses you might (and probably will) study as a Nanotechnologist. Some courses (the more specialized courses) are usually offered as electives depending on what you want to focus on. No matter what your favorite topic is, you WILL take classes from all fields. So, if you’re really 100% sure that you “only really like physics” or chemistry, try Materials Science, Chemical Engineering, Chemistry, or Physics. Naturally, you WILL have a favorite. You will want to to focus 100% on this and it can result challenging to balance everything out; no problem!!! This is when you start to seriously think about your research!!! Luckily, you can research anything ranging from hot topics in Condensed Matter Theory (e.g. Topological Phases of Matter) to Advanced Materials (e.g. metamaterials, Photovoltaics {for solar cells!}, magnetic materials) to Carbon Nanomaterials (CNTs, Fullerenes, Graphene) to Environmental Chem (Photocatalysis, Green Chemistry) to Biotechnology (Virus-like Particles for drug delivery, Cancer research, Protein engineering) to Nanoengineering (Micro and nanoelectronics, low-dimensional capacitors, ALD {Atomic Layer Deposition}, Sputtering, Plasma Physics, etc.) and Computation… for any of the fields mentioned + AI is hot- hot- hot!!! So, Nanotechnology IS difficult, but there is room and topics for EVERYONE and it is definitely NOT impossible. I would recommend Nanotechnology if you’re interested in research within the interface of two or more disciplines, such as condensed matter theory and renewable energy, for example. You are not limited to apply to a more “pure science (be it physics or chem)” graduate program. Another alternative is to major in a pure field and switch to Nanotech during grad school. Hope this helps! ",
            "date": "Updated December 18, 2018",
            "views": "36",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Liya Elizabeth Jacob",
                    "user_href": "/profile/Liya-Elizabeth-Jacob-1"
                },
                {
                    "user_id": "Prakash Niroula",
                    "user_href": "/profile/Prakash-Niroula-7"
                },
                {
                    "user_id": "Christopher Stanton",
                    "user_href": "/profile/Christopher-Stanton-7"
                },
                {
                    "user_id": "Lala Shwante",
                    "user_href": "/profile/Lala-Shwante"
                },
                {
                    "user_id": "Arunachalam",
                    "user_href": "/profile/Arunachalam-20"
                },
                {
                    "user_id": "Jaylah Easter",
                    "user_href": "/profile/Jaylah-Easter"
                },
                {
                    "user_id": "Nilan Fernando",
                    "user_href": "/profile/Nilan-Fernando-1"
                },
                {
                    "user_id": "Umut Saglam",
                    "user_href": "/profile/Umut-Saglam"
                },
                {
                    "user_id": "Sumathi Muruganantham",
                    "user_href": "/profile/Sumathi-Muruganantham"
                },
                {
                    "user_id": "M C",
                    "user_href": "/profile/M-C-584"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Stanton",
                "href": "/profile/Christopher-Stanton-7"
            },
            "answer_text": "Nanotechnology deals with the realm of the very small. A nanometer is one BILLIONTH of a meter and approaches the wavelength of light. One of the biggest challenges arising from nanotechnology is making quantitative measurements down at the nano-scale. While Richard Feynman joked that, “There is plenty of room at the bottom”, accurately measuring nanoparticles and their interactions can be quite rigorous. Transmission electron microscopes (TEMs) the size and weight of a military artillery field piece are needed to resolve such minute features as individual atoms. Optical spectroscopy at precise wavelengths is needed to stimulate chemical bonds. High pressure gas chromatographs are required to separate out complex compounds into their individual chemical components. Scanning tunneling electron microscopes (STEMs) are used to detect the placement of individual ATOMS. If you are not prepared to make exceedingly fine measurements and keep meticulous notes, then nanotechnology may not be the career for you. Incidentally, nanotechnology is not an entirely new field. The stained glass in early European cathedrals used gold nanoparticles to obtain certain colors. Here is a revolutionary new solar cell design that uses a “forest” of vertical nanowires to create more surface area exposed to sunlight. Although not yet in production, they promise record-breaking efficiencies.  This is what the cross-section of a nanowire looks like:  ",
            "date": "Answered May 27, 2020",
            "views": "468",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Etienne Palos",
                    "user_href": "/profile/Etienne-Palos"
                },
                {
                    "user_id": "Len Richards",
                    "user_href": "/profile/Len-Richards"
                }
            ]
        }
    ]
}