{
    "title": "How does Elon Musk do so much? - Quora",
    "tags": [
        "Elon Musk"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Colestock",
                "href": "/profile/Dan-Colestock"
            },
            "answer_text": "Elon Musk has vision, goals and plans to accomplish them. He has intelligence, creativity, confidence and resources. Most of all, he’s not afraid to fail. He was severely bullied in his youth, once even hospitalized for his injuries. He learned how to fight and to face his enemies with courage. He’s an oldest child and son, and is estranged from his Professional Electro-Mechanical Engineer father, who still lives in Pretoria South Africa. Of him Elon has said “A terrible human being … Almost every crime … every evil thing you could possibly think of, he has done”. Perhaps a son is compelled to achieve good on behalf of an evil father and the country he stood for. Elon Musk - Wikipedia Elon Musk: The Architect of Tomorrow ",
            "date": "Answered April 3, 2019",
            "views": "229",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pavel Shabalovski",
                "href": "/profile/Pavel-Shabalovski"
            },
            "answer_text": "Elon Musk has the drive force of an F1 engine because he's paranoid about the world going to shit in the next 50 years, and he realized he's probably the only one who sees it clearly enough and has the power to do something. He wants to save the world - by clearing our oxygen of fuel fumes, and humanity not extinct because of an asteroid or something. After he finds a problem he researches the steps that will be necessary to fix it, and starts from the first step. Clearing our oxygen - Filters or cars. No one will buy filters, everyone buys cars. Same with human extinction - NASA is mostly government funded, hence won't travel to MARS very soon, but as a private company with their own missions it will happen as fast as they can afford it. So Elon took it upon himself to do those things. And he wakes up everyday with a deep concern about life, and that's why he's in for it. If it was for the money, I think he is smart enough to go figure out some passive business, without working 120 hours a week. The business profit machines his companies are, are only the fuel to his ideas. ",
            "date": "Updated April 10, 2019",
            "views": "390",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Komal Sangwan",
                    "user_href": "/profile/Komal-Sangwan-10"
                }
            ]
        }
    ]
}