{
    "title": "How good is the Revolt RV400 electric motorcycle? - Quora",
    "tags": [
        "Electric Motorcycles",
        "Electric Bikes (E-Bikes)",
        "Harley-Davidson Motorcycles",
        "Motorcycle Mechanics and Maintenance",
        "Motorcycle Safety",
        "Battery Electric Vehicles (BEV)",
        "Electric Vehicles",
        "Electric Cars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shubham Mishra",
                "href": "/profile/Shubham-Mishra-531"
            },
            "answer_text": "It's good to have and ride both. But, as the old men said: “Every coin has two sides”. So here we go, In this content, Mainly all the practical unique pros and loopholes are embraced. The first question which fascinates the users is AI-enabled bike, so is it really incorporating the AI? Yes, but as a whole? Hell NO. Why because they are using the cloud connect platform which will monitor and store the rider’s personal as well as riding parameters. Such data can be sold to other companies and can also be utilized to upgrade the rider’s performance. But that will take at least 1-year life span so that immense amount of data can be collected to ensure the reliability of AI-based decisions. So it's a big NO from my side if you are buying this just for a style statement of an “AI” thing as it is having no direct impact on rider’s performance within a year. Another thing is artificial sound, that's really pretty cool. But some bike reviewer’s are finding it gimmicky. But that feature is an impeccable match for riders playing road rash in real life ;-). Another point which made me upset is the charging time, 4 hours….? Really, have you lost it….? Many Ebikes are offering 1–2 hrs of charging along with more range, and some foreign Ebikes are also incorporating supercapacitor based charging technologies to have 15–20 min charging for 100 km range. Rahul Sharma should think in such direction, which can make REVOLT more revolutionary. And some Pros and Cons are as below: Pros: Looks and Sound good.Very nice handlebar.All LED lighting and a fully digital instrument cluster.Multiple options to recharge the batteryCons: Bikes proportions are tiny.Custom exhaust sounds are a bit unpleasant.Price is predicted to be around 1L INR, so certain value additions could have been done to justify the price. In spite of some constructive criticism, we must support such a company which is more than an assembly based organization. Such indigenous products must be encouraged to do well in Indian as well as in the overseas market. ",
            "date": "Answered August 18, 2019",
            "views": "11",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mech Miracles",
                    "user_href": "/profile/Mech-Miracles"
                },
                {
                    "user_id": "Aakash Dere",
                    "user_href": "/profile/Aakash-Dere"
                },
                {
                    "user_id": "Sachin Chauhan",
                    "user_href": "/profile/Sachin-Chauhan-268"
                },
                {
                    "user_id": "Hemant Dhingra",
                    "user_href": "/profile/Hemant-Dhingra-2"
                },
                {
                    "user_id": "Pulkit Mishra",
                    "user_href": "/profile/Pulkit-Mishra-18"
                },
                {
                    "user_id": "Anoop Antony",
                    "user_href": "/profile/Anoop-Antony-19"
                }
            ]
        }
    ]
}