{
    "title": "How should renewable energy be defined? - Quora",
    "tags": [
        "Renewable Energy Solutions",
        "Non-Renewable Energy",
        "Renewable Energy",
        "Sustainable Technology",
        "Alternative Energy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Barnard",
                "href": "/profile/Michael-Barnard-14"
            },
            "answer_text": "Renewable energy has the following characteristics: It harvests energy from an existing major, ongoing process in the earth's climate or geologyIt does not deplete that process in any significant way and/or the energy must be renewed by external inputs in human timeframesIt does not cause extraordinary harm to biological or climate systems as a result of harvesting the energyUsing these three measures, we can assess a variety of energy types: Wind energy harvests a tiny fraction of the enormous energy bound in movement of air from high pressure to low pressure systems. Energy from the Sun as well as rotation of the Earth constantly create more wind. The total amount of impact from gaining all of Earth's energy from the wind is a minuscule and immaterial fraction of the total energy in the system. Wind energy does not cause harm to anything in any significant way with relatively minor siting care. VERDICT: RENEWABLE Solar energy harvests a tiny fraction of the enormous energy falling on the earth from the Sun during daylight hours. The Sun is a massive fusion ball of flame with a lifespan measured in billions of years. The total amount of energy harvested is immaterial compared to the amount falling and does not interfere except directly beneath solar panels with other things the suns rays might be doing. Solar panel does not cause harm to anything in any significant way with relatively minor siting care. VERDICT: RENEWABLE Hydroelectric energy harvests a tiny fraction of the potential kinetic energy created by the cycle of evaporation and precipitation. Evaporation is dominated once again by the Sun's energy input to the Earth's systems. Wind transports the water vapor to places where it falls from the sky on high ground, creating the potential kinetic energy. The total amount of energy harvested is an insignificant fraction of the total energy in the system. Hydroelectric power causes some environmental challenges, but these are very small in comparison to alternatives. VERDICT: RENEWABLE Geothermal energy harvests a tiny fraction of the energy bound into the molten core of the earth and created by movement of the Earth's plates. This energy was dominantly bound into the system at creation of the earth and will dissipate over a billion years or so. The total amount harvestable and harvested is a tiny fraction of the amount of energy in the system. Geothermal does not cause environmental harm. VERDICT: RENEWABLE-ish. Pedants will argue Fossil fuel generation takes the result of millions of years of biological processes that are then subject to further millions of years of geological processes and burns them in a very short period of time. The heat from this burning is used to generate steam -- usually -- which then drives turbines which generate electricity. Fossil fuel resources are being depleted at an extraordinary rate, with quite ridiculous percentages of the total energy laid down over those millions of years burnt in the past 200. The energy is depleted and will not recover in vastly more time than humans have even been recognizably human (200,000 years or so ago the first recognizable human appeared; that's a few percent of the time it took to create fossil fuels.) People who argue that fossil fuels are renewable based on biological and geological processes do not understand the nature of the biological processes, the likelihood of recreation of those processes, the geological processes or the time frames involved. Fossil fuels, when extracted, processed and shipped, cause significant environmental and health damage. Fossil fuels when burnt create significant pollution and produce much more than their weight in CO2 which alters the climate radically. VERDICT: NOT RENEWABLE Nuclear generation takes radioactive isotopes laid down when the Earth was formed, refines them into sufficient density to create nuclear fission, then uses the resulting heat to create steam to drive turbines to create electricity. It takes a tiny fraction of the materials of the earth and the potential energy locked into them to create electricity. Extraction and refinement of nuclear ore is environmentally damaging locally to the mine and refinery, but not in inordinate amounts compared to fossil fuel alternatives. Nuclear energy does not create environmental or health impacts of any significance when running compared to alternatives. VERDICT: if geothermal is renewable, then nuclear is RENEWABLE  Like my content? Help it spread via Patreon. Get confidential consulting via OnFrontiers. Email me if you’d like me to write for you. ",
            "date": "Updated May 11, 2017",
            "views": "22",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jody Schmidt",
                    "user_href": "/profile/Jody-Schmidt-1"
                },
                {
                    "user_id": "Shrishti Sharma",
                    "user_href": "/profile/Shrishti-Sharma-177"
                },
                {
                    "user_id": "Bibi Gk",
                    "user_href": "/profile/Bibi-Gk"
                },
                {
                    "user_id": "Peter Gouldhurst",
                    "user_href": "/profile/Peter-Gouldhurst"
                },
                {
                    "user_id": "Merv Gibson",
                    "user_href": "/profile/Merv-Gibson"
                },
                {
                    "user_id": "Aditya Kumar",
                    "user_href": "/profile/Aditya-Kumar-7334"
                },
                {
                    "user_id": "Shruti Mishra",
                    "user_href": "/profile/Shruti-Mishra-578"
                },
                {
                    "user_id": "Sneha Kataria",
                    "user_href": "/profile/Sneha-Kataria"
                },
                {
                    "user_id": "James Hahn",
                    "user_href": "/profile/James-Hahn-8"
                },
                {
                    "user_id": "Ricardo Teamor",
                    "user_href": "/profile/Ricardo-Teamor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Liberto Pires",
                "href": "/profile/Liberto-Pires"
            },
            "answer_text": "Renewable energy is an energy that never finishes and can be constantly supplied to the consumers. Examples : Solar energy- the sun rays produce heat and electricity constantly while it is visible from the Earth. It is always there ( in the sun ) to be supplied. The sun does not need to be refilled with helium and other components that irradiate the energy. The wind is created by the difference of pressures between two spots in the surface of the Earth and such energy is always there forever. Perhaps some days the wind is not strong enough however it is always available when there are two different atmospheric pressures. The tidal energy always exist while there are waves in the sea. In some areas the waves are not so powerful but in other areas they are therefore the spots to build tidal plants must take such factor in consideration however waves supply energy forever, Hydraulic energy exists because there is water at a certain altitude that can be used to fall down and move turbo generators. It is the altitude and the weight of the water that creates the energy to be transformed into electricity and this factor exists forever unless a profound drought makes the water reservoir to be extinguished, Geothermal energy is produced by the heat that exists in the interior of our Planet and if we are able to reach the source where such heat exists we can transform such heat into energy and it will exist forever because the Earth core loses around 100 degrees every billion years, Other sources of energy like nuclear are not considered renewable because the nuclear fuel will create heat for some time and then it needs to be replaced therefore we need to refill the plants like we refill the plants of coal, natural gas etc ",
            "date": "Answered December 19, 2019",
            "views": "203",
            "upvotes": "0"
        }
    ]
}