{
    "title": "How to move on - Quora",
    "tags": [
        "Moving On",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "H Chung So",
                "href": "/profile/H-Chung-So"
            },
            "answer_text": "I'm so sorry you had to endure this nightmarish relationship. But the short answer to moving on is: stay away from him. As in, avoid running into him, unfollow his social accounts, block his numbers and shutting down \"what's he up to now?\" discussions (either with others or in your own head.) Even as I write this response, I can't fathom why you would be checking in on his snaps, reading his texts or happen to \"find out\" he's talking to your sister's ex-friend. And of course, if he escalates the situation and gets in your face again, do alert the authorities to protect yourself.  Note: I can't tell from the query whether you're a college or high school student; if it's the latter, talk to adults about this situation, be it your parents, school counselor or a trusted teacher.  You, like many folks, tend to forgive and give people the benefit of the doubt. With him, don't. Even in your Quora query, there's only one paragraph about his \"positive\" qualities (and that's only at the beginning of a relationship!) versus several paragraphs of seriously red flag behaviors.  While I'm glad you finally got out of this relationship, I only wished you had made the cut a lot earlier - when he started calling you names, when he exhibited jealousy rages and certainly when he started grabbing your arm and tugging your hair; in other words, when he stopped respecting you as a person. And whenever you entertain even the faintest of notions of reaching out to him, remember these moments and think of what kind of future you two could possibly have. Lastly, I have complete faith that you can form a positive and healthy romantic relationship, especially given your scholastic and social achievements thus far. But for the time being, please focus on yourself (moreso because it's been eight months since the relationship ended and you're still thinking of him.) Discover and do the things that make you feel happy and fulfilled; connect with your friends and family for support. And when you are ready to enter into a new relationship - do keep in mind a list of \"not OK\" behaviors so you can recognize those red flags early and spare yourself a lot of unnecessary pain. ",
            "date": "Answered September 24, 2015",
            "views": "34",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephanie Doss",
                    "user_href": "/profile/Stephanie-Doss-12"
                },
                {
                    "user_id": "ShE WhO kNoWs",
                    "user_href": "/profile/ShE-WhO-kNoWs-1"
                },
                {
                    "user_id": "Mary Rojas",
                    "user_href": "/profile/Mary-Rojas-33"
                },
                {
                    "user_id": "Jasmine Ching",
                    "user_href": "/profile/Jasmine-Ching-3"
                },
                {
                    "user_id": "Anne Lanham",
                    "user_href": "/profile/Anne-Lanham"
                },
                {
                    "user_id": "Tiffany Cao",
                    "user_href": "/profile/Tiffany-Cao-13"
                },
                {
                    "user_id": "Ruchi Vashisht",
                    "user_href": "/profile/Ruchi-Vashisht-1"
                },
                {
                    "user_id": "Simran Gandhi",
                    "user_href": "/profile/Simran-Gandhi-20"
                },
                {
                    "user_id": "Pamal Preet Singh",
                    "user_href": "/profile/Pamal-Preet-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanveer Kaur",
                "href": "/profile/Tanveer-Kaur-54"
            },
            "answer_text": " Accept the truth: The one you are attached to, they are gone.Now, it’s me and I have to deal with this pain. And next accept LIFE GOES ON! there are people who face even worse and accept I am brave enough to make my future better.Vent out: You want to cry, CRY OUT LOUD! Write all your emotions, you will feel hell light.Learn: Learn what mistakes you did and make a note of it literally. Because it will register in your mind. Learn to keep a check on your expectations. Learn not to trust blindly.Learn not to get attached to things.Get distracted: Find a goal or a new hobby or meet new people. I started to spend time on internet more by learning a new language, listening to knowledgeable videos etc. Engage yourself, go out, watch movies, party, travel etc. You can do something you love to do like sports or be travelling or reading or do something you always wanted to do like dancing, singing, ramp walk etc because your interest and productivity in such tasks would be the best when you are trying to move on.(Always keep your career, first priority)Of course, you will miss them! You want them back. I swayed back to him I guess 100 times, I want them back. Of course! It’s OK. You can try! both ways you are in a win-win situation, if they come back, talk to them, this is the issue, discuss that we can work this together, if they don’t, at least you won’t have the regret you didn’t try. I’ll suggest, whenever you miss them, talk to yourself in your head, they were a good part of my past, we made good memories but maybe they are not good for my future. Whatever happens, it's for good. It’s kind of Psychological trick, trust me you’ll get courage, you’ll feel better.Give Time: Time heals everything. With time, you will be better.Ctrl+shift+delete- Any friend, any relationship, once you are sure you are done, delete them from your life. Your phone, any social website like everywhere but only once you are sure otherwise go back to point 6.Smile: NO matter what you are dealing with just never stop smiling, click selfies, it helps.Dress up: Put little more time on dressing up well daily during these days. You’ll start loving yourself more.And you’ll start loving the attention you’ll get from opposite sex. It will boost your self-esteem.:)Ask yourself, what do you want? Is he or she giving you any happiness? NO, good for you. Yes, Try and get her back.(If she isn’t willing, let her go and go to point 1.Finally Embrace yourself: Love your company more, those who depend more on others for their happiness actually don’t love themselves enough. Love being alone. Some people love it for some it does take Practice. DON’T TAKE LIFE TOO SERIOUSLY, ONCE YOU FEEL EASY. PLEASE HAVE A GOOD LAUGH, AND TELL YOURSELF I AM SUCH AN IDIOT(for being emotional, for wasting my tears, crying because of idiots). LIFE HAS SOOOOOO MUCH TO OFFER.. LOVE YOUR LIFE.. AND AFTER EVERY PAIN OR HEART BREAK, JUST LOVE THE NEW YOU..  ",
            "date": "Updated June 17, 2017",
            "views": "193",
            "upvotes": " View 244 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vung Sen",
                    "user_href": "/profile/Vung-Sen-2"
                },
                {
                    "user_id": "Jastej Singh",
                    "user_href": "/profile/Jastej-Singh-3"
                },
                {
                    "user_id": "The Shade",
                    "user_href": "/profile/The-Shade-3"
                },
                {
                    "user_id": "Riseru",
                    "user_href": "/profile/Riseru"
                },
                {
                    "user_id": "Phelicy Marsh",
                    "user_href": "/profile/Phelicy-Marsh"
                },
                {
                    "user_id": "Stephanie Doss",
                    "user_href": "/profile/Stephanie-Doss-12"
                },
                {
                    "user_id": "Lalrohlim Zate",
                    "user_href": "/profile/Lalrohlim-Zate"
                },
                {
                    "user_id": "Sunanda Verma",
                    "user_href": "/profile/Sunanda-Verma-15"
                },
                {
                    "user_id": "Megha Rathi",
                    "user_href": "/profile/Megha-Rathi-62"
                },
                {
                    "user_id": "Sushmitha",
                    "user_href": "/profile/Sushmitha-141"
                }
            ]
        }
    ]
}