{
    "title": "How did you become a millionaire? - Quora",
    "tags": [
        "Self-Made Millionaires",
        "Becoming a Millionaire",
        "Becoming Successful",
        "Wealthy People and Families",
        "Wealth",
        "Wanting and Making Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Altucher",
                "href": "/profile/James-Altucher"
            },
            "answer_text": "I went from millions to zero to millions to zero several times so I’ll be totally transparent and tell you about each time. But more interesting might be to ask how I lost millions each time. This is the demon I’ve always wrestled with. I didn’t want to lose millions. Or two homes. Or a family. Or anything. But it’s my fault. I take the blame. MILLIONAIRE #1: I had nothing in the bank. I was living in an apartment with one foam futon and no other furniture. I had one suit in a garbage bag. There were roaches in the bathroom. I was working a full time job but I wanted to help out my brother in law who had a little business. Nobody knew how to make a website back then so I taught him how to do one. Then we went to some meetings together. First we did a website for a diamond dealer. Then we did the whole website for American Express. The diamond dealer paid us $35,000 in cash and we split it. I took the cash to the Chelsea Hotel in a brown paper bag and spilled it on the desk of Stanley Bard, who ran the hotel. Are you a drug dealer? No, I make websites. He gave me a room for a year. Then another and another. Everyone in the Chelsea Hotel was either a criminal or an artist. I was probably somewhere in the middle but who knows. The easiest person to lie to is ourselves. We started doing more websites: HBO, Time Warner, Loud Records, Bad Boy Records, Interscope, Con Edison, and more and more. After 18 months of this I quit my job and went to the business full time. It was hard work. It was work 7 days a week, 20 hours a day. My wife at the time thought “your religion is money”. But it wasn’t. I didn’t enjoy working that hard. But I had to do it. I didn’t really know how to hire people but we started hiring more and more but it was also difficult to manage people once we hired them. And every client wanted a friend. I was that friend. They’d call me 24 hours a day. Finally we sold the business. It’s hard to get people to give you millions for a business. Why are you selling your business? We wanted to work with a bigger partner, I’d say. But the real reason: I wanted a million dollars. I wanted ten million dollars. We sold the business. By the way, I’m shortening everything. Every step of the way was brutal. Maybe the most difficult thing I’ve ever done or ever will do.  Then I lost it all.  MILLIONAIRE #2 A friend of mine owned a mental hospital. I got a piece of it as well. The #2 guy at the company was also in the state senate so we got all the permits we needed. My friend got an offer for $10,000,000 for the business. I told him wait. I told him, give me a few months to see what I can do. With another friend we build up a whole presentation containing projections and justifying each projection. It was ambitious but we thought it was accurate. We then called every business that was in the business of buying up mental hospitals. We made around 30 calls. One call we hit a wrong number. We kept calling back and calling back until we got the right person on the phone. She was the one person who made an offer for the company. Luck meant: call back and call back and call back and have three phone calls with everyone on the phone and invite her over for dinner twice and then the entire team and then negotiation. Negotiating was hard. But we sold the mental hospital for $41,000,000 cash just a few months after my friend had his $10,000,000 offer. I made $1,000,000 in the deal.  A few weeks later the IRS called. I had never not paid but I owed money for a few years. I owed a million dollars, give or take. I was out of money again.  MILLIONAIRE #3: I thought all the money was on Wall Street. I started a hedge fund. A hedge fund invests money for rich investors and then takes a fee. I now think this is a BS business but at the time I thought I would get rich doing it. I didn’t. I barely made a living. We tried to sell the business. We got an offer from a bank. $4,000,000. But then my partner, Dan, called me and said, you can’t take this deal. Oh, I’m going to take it. I’m broke! You can’t take it. Please let me take it. But I couldn’t take it. In the deal was a clause: I had to work there for six years and at any point they could fire me and I’d owe the entire $4,000,000 back. I couldn’t take the deal. We shut down the business and started listing some web businesses we could start. We made nine different web businesses. One after the other. None of them worked. Maybe that’s it, Dan said. No more. One more. So we started Stockpickr.com. And we teamed up with a big company, TheStreet . com. Thats a big story. I won’t get into it. But the formula was: - try a lot of ideas - fail quickly - combine your interests - team up with a partner that can get you distribution and revenues. The month we launched we had a million unique visitors, almost $100,000 in revenues, and zero employees. Life was good. Except when the site crashed because it was too crowded. That was very stressful and I thought I would kill myself. The day we officially launched was the day I officially called everyone I knew and said, “We’re for sale!” I met with Google, AOL, Yahoo, Forbes, Interactive Corporation, and more. Finally thestreet valued us at $10,000,000 and we sold the company. I had several million then.  16 months later I was dead broke. Lost my home. Got a divorce.  MILLIONAIRE #4: When we started Stockpickr I got a lot of calls from people who wanted to invest or be CEO. I met with all of them. One person I met wanted to be CEO. He had just sold his own company to AOL for $24 million and liked the idea of Stockpickr. He gave me a lot of ideas of what he could do if he were CEO. I loved the ideas but I said, I’m CEO. And there’s really no need for anyone else. We remained friends but I stole all his ideas. They were really good. Then he started another company. He was so smart I begged to invest in his company. I put in a small amount. Five years later he sold for $900 million. I made about $3,000,0000.  I didn’t lose it this time.  Some years I don’t make any money though. And some years I made a lot. From 2012–2014 I didn’t really make any money. From 2007–2012 I net lost money. In 2015 I did ok. This year barely ok. But another company I invested in sold recently. And I’m invested in many more companies. Some have already failed miserably. Some are on their way to having a $100,000,000 in revenues or more and I will make money on them. Then in March 2015 I started my own company. It’s based on the enormous email list I have built over the years. And it’s based specifically on helping people get unstuck from their lives in various ways. Every month I describe in detail more ways to be entrepreneurs, make money, etc. We did $17,000,000 in revenues the first year. We were profitable. We will be more profitable this year. Maybe I will make money on this company. Time will tell. But it’s fun and I am enjoying it and I’m helping people. We have 16 employees and growing.  In each case, you make money by helping people in a unique way. How do you help people? How do you have the maximum impact on the world? By first helping yourself: Be healthy. You can’t save the world if you are sick in bed.Be around good people. Believe me, I’ve seen this over and over and lost millions this way: bad people will rob you of soul and money. They will suck the music out of you.Be creative every day. Otherwise the creativity muscle will atrophy.Be grateful every day. Even if it’s hard work and painful, always say, “I get to..” instead of “I have to….”I will add to this: learn from everyone you meet. If I see you in the street today, I promise I will learn from you. Or I will go broke, sleep in the sidewalk, destroy all the people in my life, and google how to easily kill myself. Either one. Related Post: The Power of Broke ",
            "date": "Updated November 9, 2016",
            "views": "1689",
            "upvotes": " View 3.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prem Joshi",
                    "user_href": "/profile/Prem-Joshi-1"
                },
                {
                    "user_id": "Nandu",
                    "user_href": "/profile/Nandu-97"
                },
                {
                    "user_id": "Anam Sadaf",
                    "user_href": "/profile/Anam-Sadaf-1"
                },
                {
                    "user_id": "Petr Liška",
                    "user_href": "/profile/Petr-Liška-11"
                },
                {
                    "user_id": "Augusto Brighenti",
                    "user_href": "/profile/Augusto-Brighenti"
                },
                {
                    "user_id": "Kaushik Dwivedi",
                    "user_href": "/profile/Kaushik-Dwivedi-2"
                },
                {
                    "user_id": "Meun Neu",
                    "user_href": "/profile/Meun-Neu"
                },
                {
                    "user_id": "Mike Poulton",
                    "user_href": "/profile/Mike-Poulton-1"
                },
                {
                    "user_id": "Layne Gabbert",
                    "user_href": "/profile/Layne-Gabbert"
                },
                {
                    "user_id": "Nerdic Runelords",
                    "user_href": "/profile/Nerdic-Runelords"
                }
            ]
        },
        {
            "author_info": {
                "name": "Curt Sutherland",
                "href": "/profile/Curt-Sutherland-1"
            },
            "answer_text": "I started with $200, sort of. $200 was all that we had in our savings account and we had about another $1 in our checking account. I borrowed the $200 from our savings, and went looking for something to buy that I could make some money on. I bought a stainless Ruger Security-Six .357 Revolver for $167 at a flea market. I guess I could have started robbing banks that same afternoon, but instead, I took it to a gun store a few blocks away, sold it for $210, gave my wife back the $167 to put back in savings, and I started buying things to resell with the $43 difference.At first I bought more firearms. I'd go to gun shows and buy and resell all weekend. I'd buy at one table and sell a few tables away. I was buying $20 handguns up to around $200 rifles by the end of the day. I'd make $2 to $25 on each sale normally. Occasionally, I'd make a hundred or so. By the end of the day, I had normally earned an extra $200, up to $300 or $350 on a good day. That was great! It covered half my mortgage.That was about the time that President Regan was shot, and I could tell that gun sales were going to slow down a lot, so I got out of that and started buying used cars to resell from a local new car dealer. I bought his \"back lot\" cars, the trade-ins that he couldn't resell. I bought them on Thursday mornings around 11am. I had them paid for and transported to my house by about 2pm. I'd call the newspaper by 4pm and have them advertised in the following day’s paper. I was buying cars for $600 to $800, and selling them to students and parents with teenage drivers for $1000 to $1200 a car. They would all be sold by Saturday afternoon. I'm sure my neighbors loved all the extra cars that I had at my house for a day or two each week.We had a freeze one day in town and I lost a few freeze plugs and had other issues with my cars, plus a buddy wrecked one that I let him drive for a day. I decided to get out of cars and into gold jewelry, diamonds, and pre-owned Rolex watches.The goal was always to make enough to be able to start investing in real estate. It didn't take too long before I was able to purchase an investment property. I didn't know how I was going to pay for it, but I owned it. The payment was $37.50 a month for 5 acres on Highway 183. I think I paid somewhere around $550 to $1300 for it. Thirty some odd years later I figured out that I was never going to do anything with the land and I think I sold it for $75K. By then, $75K was no big deal.I bought a few houses, sold a few houses, bought a few more, kept them, (somewhere around here is when I became a millionaire) built a few duplexes, bought a few commercial properties, (bought two commercial buildings on the same day...multi-millionaire status about now and growing rapidly), bought a large commercial property, and a few more houses to keep. Built a few businesses along the way, sold a few of the businesses, but kept the real estate to lease to the new business owners/tenants, and before I knew it, I had a little money and it was a good thing because I was starting to get older by then.Now I'm nearly 59. I could have retired a decade ago, but that wouldn't have been very exciting. In the mean time, I've started another business or two, invested in a number of real estate ventures, bought another commercial property this past month, yesterday I was approached by some friends that want me to invest and take a leading role in their start-up company, so I started researching that opportunity, and I'm hoping to break ground on a $50,000,000 apartment community/high-end retail development in the next few months, (still negotiating to buy out the last tenant so I can demo the building and then start construction...I want to pay them $250K to move, they want $1.25MM to move...their whole business is only worth $500K) so yeah, I'm very glad I didn't \"retire\". I would have missed out on a lot of fun, a little excitement, and all of the challenges....and that's how I became a millionaire. Slowly, over a lifetime, starting with almost nothing except a very strong desire to feed and house my family.The desire is the same for a lot of people, it's just that everyone takes a different path to get to their goal. Best of luck on your journey! I sincerely hope that you will have as much fun as I have had. ",
            "date": "Updated October 12, 2018",
            "views": "2338",
            "upvotes": " View 5.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jurgen Viereck",
                    "user_href": "/profile/Jurgen-Viereck"
                },
                {
                    "user_id": "Kunal Kaushik",
                    "user_href": "/profile/Kunal-Kaushik-151"
                },
                {
                    "user_id": "Ugo Trainer",
                    "user_href": "/profile/Ugo-Trainer"
                },
                {
                    "user_id": "Ruday Shiv",
                    "user_href": "/profile/Ruday-Shiv"
                },
                {
                    "user_id": "Tony Deller",
                    "user_href": "/profile/Tony-Deller"
                },
                {
                    "user_id": "Sharon Mishayev",
                    "user_href": "/profile/Sharon-Mishayev"
                },
                {
                    "user_id": "Ntandokazi Mbelu",
                    "user_href": "/profile/Ntandokazi-Mbelu"
                },
                {
                    "user_id": "Danphil Daniel",
                    "user_href": "/profile/Danphil-Daniel-1"
                },
                {
                    "user_id": "Techno Gameing World",
                    "user_href": "/profile/Techno-Gameing-World"
                },
                {
                    "user_id": "Johan Alvarado",
                    "user_href": "/profile/Johan-Alvarado-10"
                }
            ]
        }
    ]
}