{
    "title": "How does electrostatic generate on an aircraft? What is an example of that effect on the aircraft, and how do you overcome it? - Quora",
    "tags": [
        "Aircraft Design",
        "Electrostatics",
        "Aircraft Carriers",
        "Military Aircraft",
        "Aerospace and Aeronautical Engineering",
        "Aircraft",
        "Airplanes",
        "Physics of Everyday Life",
        "Aviation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julian Baker",
                "href": "/profile/Julian-Baker-9"
            },
            "answer_text": "you know when you rub a toy baloon on your hair the balloon becomes charged. What’s happening is that electrons are being ripped from your hair onto the rubber of the balloon. So the ballon has more electrons than protons giving it a net negative charge. The same thing happens in thunder clouds as tiny droplets of water are rushed up through the middle of the cloud; electrons are knocked off and the cloud becomes charged. When the charge becomes to great for the insulation of the air a flash of ligntning is created. Now the same thing can happen with aeroplanes: electrons can be knocked off the wings by the onrush of air. Its not mich of a problem whilst you are flying because the aeroplane is made of metal through which electrons can flow easily so no one place gets more charged than the rest, however it can interfere with the radio. To get rid of some of the charge Static Discharge Wicks are used on the trailing edges of the aircraft. You have probably seen these from the aircraft window, apparantly little knitting needles sticking out of the back edge of the wings. However not all the charge is able to be dissipated by these in flight, on the ground the wheels nicely insulate the aircraft and its residual charge. Guess the most hazardous operation on the ground, yes refuelling. To ensure the aircraft is neutrally charged and so that a spark does not ignite the fuel, you will see the first thing the refuelling people do is to “earth” the aircraft by attaching a nice copper cable to it. ",
            "date": "Answered July 27, 2019",
            "views": "87",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Farah Aqilah",
                    "user_href": "/profile/Farah-Aqilah-42"
                },
                {
                    "user_id": "Danish Luqman",
                    "user_href": "/profile/Danish-Luqman"
                }
            ]
        }
    ]
}