{
    "title": "How to automatically verify someone's identity (i.e., they are who they say they are) online - Quora",
    "tags": [
        "Online Identity",
        "Identity Verification"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Todd",
                "href": "/profile/Emily-Todd-76"
            },
            "answer_text": "personally, i tend to lean away from ideas such as in the description of the question. kik if you download kik messenger you can have them send a “live picture”, meaning they take the picture in app, real time. it will show you that they did take a live picture, and not use one from online or something picture with a _______ a common one but still good is to ask for a picture that includes their face and a fork, spoon, knife, etc. also, if they write your name on a piece of paper and hold it up and take a picture. pill bottles/medication ask them to send you a picture of a pill bottle of some sort that shows their name printed on it. it doesn't have to show what med it is, just that it's theirs. ",
            "date": "Answered July 8, 2017",
            "views": "84",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christina Nye",
                    "user_href": "/profile/Christina-Nye-2"
                },
                {
                    "user_id": "Mohamed Kamal",
                    "user_href": "/profile/Mohamed-Kamal-372"
                },
                {
                    "user_id": "Chris Pearl",
                    "user_href": "/profile/Chris-Pearl-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mathias Adler",
                "href": "/profile/Mathias-Adler"
            },
            "answer_text": "Hi- you can check Personal Financial Management Platform For Banks & Consumers | Yodlee for the bank account verifications. With a Credit Card the account holders name is not confirmed. The fact that they write \"Name as it appears on Card\" is meaningless, no acquirer returns the account holders name. Hope this helps! ",
            "date": "Answered May 30, 2013",
            "views": "71",
            "upvotes": "0"
        }
    ]
}