{
    "title": "How to tell if someone is monitoring my phone - Quora",
    "tags": [
        "Phone Monitoring",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "J Hernandez",
                "href": "/profile/J-Hernandez-12"
            },
            "answer_text": "First off, with no disrespect to anyone, and if you get all up in your feelings, DON'T GET ALL SALTY AND JUST SHAKE IT OFF. JUST AS YALL WANT US GOING THRU THE DUSTURBING SITUATION OF BEING MONITORED. Shame on all those with years of expertise and knowledge who vague response showing no empathy whatsoever stating who the hell are we to believe or why are we being spied on. We don't have to be rich, a celebrity or someone of importance to society. There are lots and lots of evil people out there. Pervs, pedophiles, and other type of individuals who just wanna make you and your family your going nuts who have no remorse on what they do to satisfy their evil appetite. People don't necessarily have to have physical access to your device in order to “not hack your device\" but remotely monitor and receive all the data from your device(s). I have a group of individuals who have done it to more than several devices, including my part family next door via bluetooth, sniffing on wifi, AND even thru something similar to SS7. How??? Idk. I have screenshots of lots and lots of data, even voicemails from someone else calling the other someone else who somehow forwarded my phone to who knows what number AND my phone WAS ON at the time and date of the voice mails. AND every time I spoke on the phone with certain individual, after we ended the call, my phone would get stuck in a loop and had to do a carrier reset and all to connect to my carriers network. Now, they also altered, my electricity to implant some type of listening device or maybe even video surveillance. And that is with the intention to come into our property at night, enter our garage and steal. There is lots and lots of ways to remotely monitor your phone without the need of physically having access to it. Some of these individuals have mentioned certain things we have discussed in our home. Throughout the entire 24+ years that we gave lived on this home, as many many times I have stayed in here BY MYSELF, AND I DON'T BELIEVE IN GHOST AND HAV NEVER EVER EVER HEARD ANY STRANGE NOISES, SINCE UP UNTIL 2 YERAS AGO THAT I WAS ALLOWED TO LET THIS GOOD FOR NOTHING stay here. And who is super knowledgeable in the area of electronics, our radio AND some home electronics appliances interfere with RFs and make too too much distortion in radio, when before it didn't do that. They know exactly what part of the house I am all the time and play stupid childish games by making cracking popping sounds. My family did not believe me until they actually heard it one night. Ever since that one family never heard and believe me, these idiots knew and we went for weeks without noises. I would even hear some music and ppl talking and wondered where it would come from at 2 to 4 am. And one night, I put my ear on the wall where the cracking g popping noises sound at most of these time, and that's where music is coming from. U couldn't make out the voices. They play the music to mask the sound of their conversations and voices. I have lived hell without any support or help from anyone. Now I no longer care. I talk to these idiots bcuz I know their listening and they'll res6 back with a popping sound. But I tell them they are so trifling and miserable and laugh at how they have made me so important in their life to the point I have complete control of their emotions cuz I know they hate. Lol. We are like the Kardashians they look forward to hearing us every night. They are like Lady Gagas song. Paparazzi. Lol .. Sooooo, if you have not lived thru this effin shizzle, KEEP YOUR PATHETIC COMMENTS TO YOURSELF AND YOUR NOT ALLOWED TO SPEAK ABOUT IT EITHER. LIKE I SAID AT THE BEGINNING. TO THOSE WHO THE SHOE FITS, IF YOU GET ALL UP IN YER FEELINGS, JUST SHAKE IT OFF JUST AS YALL WANT US TO SHAKE IT OFF THAT SOMEONE WHO IS NOT THE GOVERNMENT, NASA, CIA, FBI, OR LOCAL LAW ENFORCEMENT LISTENING TO US CUZ WE AINT IMPORTANT. TOODLES 🤪🤪🤪🤪😜😜😜👊👊👊✌✌✌ ",
            "date": "Answered June 12, 2020",
            "views": "284",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kelvin Hugs",
                    "user_href": "/profile/Kelvin-Hugs"
                },
                {
                    "user_id": "Jacob Gordon",
                    "user_href": "/profile/Jacob-Gordon-131"
                },
                {
                    "user_id": "Chris Brown",
                    "user_href": "/profile/Chris-Brown-3800"
                },
                {
                    "user_id": "Jeanna Sparks Pace",
                    "user_href": "/profile/Jeanna-Sparks-Pace"
                },
                {
                    "user_id": "Krysta Bryanna",
                    "user_href": "/profile/Krysta-Bryanna"
                },
                {
                    "user_id": "Joseph Pace",
                    "user_href": "/profile/Joseph-Pace-38"
                },
                {
                    "user_id": "Scott Przepierski",
                    "user_href": "/profile/Scott-Przepierski"
                },
                {
                    "user_id": "Amanda Murphy",
                    "user_href": "/profile/Amanda-Murphy-447"
                },
                {
                    "user_id": "Howard Smith",
                    "user_href": "/profile/Howard-Smith-197"
                },
                {
                    "user_id": "Natalie Noble",
                    "user_href": "/profile/Natalie-Noble-22"
                },
                {
                    "user_id": "Megan Moore",
                    "user_href": "/profile/Megan-Moore-597"
                },
                {
                    "user_id": "Scott Stokes",
                    "user_href": "/profile/Scott-Stokes-43"
                },
                {
                    "user_id": "Stacey Chaney",
                    "user_href": "/profile/Stacey-Chaney-5"
                },
                {
                    "user_id": "Valerie Lopez",
                    "user_href": "/profile/Valerie-Lopez-271"
                },
                {
                    "user_id": "Jaclyn Keller",
                    "user_href": "/profile/Jaclyn-Keller-7"
                },
                {
                    "user_id": "Quana Singley",
                    "user_href": "/profile/Quana-Singley"
                },
                {
                    "user_id": "Paul RUEHL",
                    "user_href": "/profile/Paul-RUEHL-2"
                },
                {
                    "user_id": "John Cranford",
                    "user_href": "/profile/John-Cranford-7"
                },
                {
                    "user_id": "Megan Damiani",
                    "user_href": "/profile/Megan-Damiani"
                },
                {
                    "user_id": "Joseph Thornton",
                    "user_href": "/profile/Joseph-Thornton-75"
                },
                {
                    "user_id": "Lori Agee",
                    "user_href": "/profile/Lori-Agee-2"
                },
                {
                    "user_id": "Ahmet Husseyin",
                    "user_href": "/profile/Ahmet-Husseyin-1"
                },
                {
                    "user_id": "Serena M Smith",
                    "user_href": "/profile/Serena-M-Smith"
                },
                {
                    "user_id": "Alexa Schuler",
                    "user_href": "/profile/Alexa-Schuler-1"
                },
                {
                    "user_id": "Mak Daddy",
                    "user_href": "/profile/Mak-Daddy-10"
                },
                {
                    "user_id": "Bobbie Castro",
                    "user_href": "/profile/Bobbie-Castro-1"
                },
                {
                    "user_id": "Cassy Knox",
                    "user_href": "/profile/Cassy-Knox-4"
                },
                {
                    "user_id": "Tess Scott",
                    "user_href": "/profile/Tess-Scott-4"
                },
                {
                    "user_id": "Amy Kay",
                    "user_href": "/profile/Amy-Kay-103"
                },
                {
                    "user_id": "Michael Scrivner",
                    "user_href": "/profile/Michael-Scrivner-6"
                },
                {
                    "user_id": "Anil Babu",
                    "user_href": "/profile/Anil-Babu-21"
                },
                {
                    "user_id": "Daniel Ainley",
                    "user_href": "/profile/Daniel-Ainley-1"
                },
                {
                    "user_id": "Danielle Duran",
                    "user_href": "/profile/Danielle-Duran-28"
                },
                {
                    "user_id": "Billy Cunningham",
                    "user_href": "/profile/Billy-Cunningham-44"
                },
                {
                    "user_id": "Linda Grace Caudill Gillum",
                    "user_href": "/profile/Linda-Grace-Caudill-Gillum"
                },
                {
                    "user_id": "Andrew Onciul",
                    "user_href": "/profile/Andrew-Onciul-1"
                },
                {
                    "user_id": "Michele Thompson",
                    "user_href": "/profile/Michele-Thompson-70"
                },
                {
                    "user_id": "Jennifer Begley",
                    "user_href": "/profile/Jennifer-Begley-13"
                },
                {
                    "user_id": "Matthew Sawyer",
                    "user_href": "/profile/Matthew-Sawyer-18"
                },
                {
                    "user_id": "Rozay Rose",
                    "user_href": "/profile/Rozay-Rose-2"
                },
                {
                    "user_id": "Austin Gustafson",
                    "user_href": "/profile/Austin-Gustafson-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Crowley",
                "href": "/profile/Paul-Crowley-21"
            },
            "answer_text": "Sorry, but a “hacker” isn’t going to help you in the slightest little bit. They will take your money and I hope you have plenty if you contact them. Phone monitoring applications do exist, but they have to be installed by hand - with your phone in the perpetrator’s hands. This cannot be done remotely and requires jailbreaking or “rooting” the phone. So if you haven’t given your phone to someone, you are probably safe. Let’s say you aren’t sure if someone borrowed your phone and did this. Don’t you have a lock code on your phone? No? Well, then you are open to such things happening. While a lock code isn’t absolute security, it will keep someone from being able to install stuff on your phone if they just pick it up for a couple of minutes at a bar or at the office. So how do you tell if you have one of these apps installed on your phone? It is extremely difficult to be sure. Two things that will be a clue are the battery life and temperature. Did your phone suddenly get so your phone needs to be charged more often? Is your phone warm when you pick it up? Both of these indicate that something is going on with your phone that you may not be aware of. OK, what do you do? Here is the hard part. Unless you are very, very lucky, removing one of these apps is extremely difficult and time consuming. You cannot simply back up your phone, wipe it back to factory state and restore. You would be restoring the spyware app. You need to basically wipe your phone and by hand transfer everything you need back to the phone one item at a time. There are ways to do this with a backup and external storage, but none of it is easy for either iPhone or Android. No, someone cannot do this “for” you remotely. The apps cannot be removed remotely and really cannot be removed at all without wiping the phone. If someone says they can fix this problem for you and only charge you $100 they are robbing you and you probably do not have a spyware app on your phone at all. ",
            "date": "Answered August 13, 2019",
            "views": "169",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Captn Bingham",
                    "user_href": "/profile/Captn-Bingham"
                },
                {
                    "user_id": "Memory Mbumwae",
                    "user_href": "/profile/Memory-Mbumwae"
                },
                {
                    "user_id": "Yogendra Yadav",
                    "user_href": "/profile/Yogendra-Yadav-111"
                },
                {
                    "user_id": "Serena M Smith",
                    "user_href": "/profile/Serena-M-Smith"
                },
                {
                    "user_id": "Amy Kay",
                    "user_href": "/profile/Amy-Kay-103"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Knight",
                "href": "/profile/Mark-Knight-58"
            },
            "answer_text": "Somebody is tracking your mobile phone, and they have to —your phone company tracks the phone all the time because if they didn’t they couldn’t provide a service at a sensible price. They do have a legal obligation in most countries not to misuse the data and to respect your privacy, so it isn’t anything to worry about. In most cases it is only computers that know where you are and the information is used only to provide the service. It is not normally made accessible to anyone, even within the phone company. As for anyone else, it is impossible to tell if the Police or security services are tracking your phone and that’s just as it should be. If people could tell then criminals would have a free alert that they were being tracked. This makes it undesirable for it to be possible to tell. If you aren’t a criminal of any kind then who cares if the Police or the security services are tracking your phone? If you have a smart-phone then it may be possible for a criminal to track it in some circumstances, but these are limited and if you look after the phone and its software properly you won’t be affected. In theory a smart-phone virus could track your phone and report to somebody over the internet connection. To avoid this the following should be adequate: Don’t download software from sources that might not be trustworthy.Keep your phone OS as up-to-date as you can.Learn about the better known security sites and sign up to a couple of their newsletters so you are made aware if there is a problem with your model of phone.Be sensible about web sites you visit. Some porn sites and many hackers’ sites are a great way to pick up a virus, spyware or a trojan. Don’t go there with your phone’s browser.Don’t let anyone get hold of the phone’s serial number, known as the IMEI number in most countries.The other issue with smart-phones is your privacy settings. Check them and if you don’t understand them call the phone company’s customer services and ask them to help you. In some cases anyone who has your phone number could track the phone if you haven’t set your privacy settings properly. Mostly this is so you can let friends track your phone so, for example, they can invite you to join them if they are having lunch in a restaurant near your location. This is a great little service that can be an aid to your social life, but you have to learn about how to set it up properly to prevent complete strangers from tracking you. ",
            "date": "Answered June 8, 2017",
            "views": "178",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deven Isbell",
                    "user_href": "/profile/Deven-Isbell"
                },
                {
                    "user_id": "Barbara Kalman",
                    "user_href": "/profile/Barbara-Kalman-1"
                },
                {
                    "user_id": "Raziel Tovar Dominguez",
                    "user_href": "/profile/Raziel-Tovar-Dominguez"
                },
                {
                    "user_id": "Melissa MacDonald",
                    "user_href": "/profile/Melissa-MacDonald-69"
                },
                {
                    "user_id": "Karen Maier",
                    "user_href": "/profile/Karen-Maier-12"
                },
                {
                    "user_id": "Amy Kay",
                    "user_href": "/profile/Amy-Kay-103"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zoltán Györkei",
                "href": "/profile/Zoltán-Györkei"
            },
            "answer_text": "I remember there was a rumour back in the day, that if your calls are monitored (or intercepted by authorities), you will hear a clicking sound when the line is connected. Obviously, this is not true, and would go against the whole point of legal interception. Here is how it works, and why you will never be able to tell if you are monitored (by authorities, anything else must be done via applications as others said before). During call setup, your call goes through 4 phases: Establishing a ling between a tower and your deviceEstablishing a link between the tower and the serverEstablishing a link between the server (the same or different, depending if you are in the same cell as the called party) and a towerEstablishing the link between the second tower and the called party’s phoneStep 1 & 2, and 3 & 4 are called legs. Between step 2 & 3, the server starts searching for B party’s data (in their Home Location Register, wthe adress of which can be calculated from the called number). This HLR will send back data to establish the 2nd leg and connect the call - it will also send information about stuff like call forwarding, call waiting services, and legal interception (the same happens for calling party as well). If B is marked for interception, then during the 3rd step, a third leg is created, connecting the call to the authorities as well. At this point, B party still doesn’t have “line”, meaning they can’t hear anything from the process. Additionally, hearing any sound (like the ringing tone you hear before the called party picks up) is played when the server is intructed to play it - it can be disabled completely as well, but the point is, for legal interception, this “play tone” command is never sent. Also, the legal interception line is strictly one-way: there is no voice channel established to send back any data. It is virtually impossible to detect legal interception by the user, unless someone makes some error in the call setup code and accidentally opens up the voice channel or sends back some “play tone” command. PS: back in the days, when there was a big “race” on who can connect calls faster (we are talking about milliseconds here, like in Formula 1), Huawei actually made a feature where they sent this play tone command and connected the voice channel before both sides sent the OK signal, indicating the connection has been established between the two parties. In this cases, you might have experienced that you only hear the end of the greeting from the other party (like “lo” from “Hello”). It’s a different story, it’s basically the same if your car would allow you to start the engine before turning the key all the way or pressing the pedal fully. ",
            "date": "Answered July 16, 2020",
            "views": "9",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaradhya Shakya",
                    "user_href": "/profile/Aaradhya-Shakya"
                },
                {
                    "user_id": "Meghan Bea Nystrom",
                    "user_href": "/profile/Meghan-Bea-Nystrom"
                },
                {
                    "user_id": "Shauna Cox",
                    "user_href": "/profile/Shauna-Cox-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jayden Kelly",
                "href": "/profile/Jayden-Kelly-13"
            },
            "answer_text": "You probably can’t. First thing you should realise is that you most likely aren’t being watched. TV and Movies depict hacking as agents sitting in dimly lit rooms that just press a button to get access to everything and stream your phone but this is simply not true (at least we don’t think it is @NSA.) Apple is famous for security of their products so watching your screen or even remotely stealing data is incredibly unlikely, i can’t comment for android or other operating systems but i assume they are also very secure. Most attacks will be in the form of “phishing attacks” where an attacker will send you a fake email claiming to be from Apple or Google asking you to reset your password. If your on iPhone and have iCloud enabled, once an attacker has your AppleId they can easily get access to most of your phones data (photos, contacts, sms ect.) Local attacks would be coming from someone on the same network as you, programs like Wireshark can be used to see network traffic and detect anything suspicious, but assuming nobody you live with or that uses your internet connection has advanced degrees and experience in networking or software engineering and an intent, nobody will be doing this to you. So while you can’t really detect attacks there are steps you can take to prevent them. Prevention of Phishing attacks Inspect any email coming from companies by clicking into the “from” field and looking around, most of the time if its a phishing attempt there will be a different email listed.Don’t click into links from emails. If you get an email from Apple asking you to take actions, go to the Apple website yourself, if action really needs to be taken websites will alert you once logging in most of the time.Inspect SSL Certificates of websites you click on. Look for the green “Secure” icon in the left hand side of the URL bar, clicking on it shows info about the website. Secure parts of a website should also show the company name in green in the URL Bar. Getting this requires proof that the registrar is who they say they are.Inspect the URL of the page you are going to, some attackers are so bad at this they will use completely random URLs, but some are smarter and might use something like “app1e.com”, notice the 1 instead of the l.Just in general prevent giving out information/passwords through emails or links in emails you receive. Stay safe. ",
            "date": "Answered August 25, 2018",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mihir Rajpal",
                "href": "/profile/Mihir-Rajpal-1"
            },
            "answer_text": "There are two main ways a person can monitor a phone. The first way is to intercept the signals being sent by your phone and break the encryption. If someone is doing this, you have no way of knowing. However, this method requires a significant amount of resources, so its usually only done by government agencies and other similar organizations, so the chances that a hacker not affiliated with a government or other powerful entity will use this method is minuscule. If you are concerned, you can switch your device to airplane mode, which will mean that no signals will be emitted from your phone. The second way, on the other hand, is far easier to do and requires less resources. It involves loading an application on your phone remotely that can retrieve and send whatever data they would like to get. The way to check for this is to open up your settings and see what applications are running. Don’t just check what apps are downloaded because you can covertly download applications on iPhones that have been jailbroken or Android devices. If there is something running that shouldn’t be (not associated with an app or the operating system), you are being monitored and should either destroy your phone or determine how that application was downloaded. The way to prevent this from happening is to keep Bluetooth off unless you trust all the devices within range, updating your phone as soon as possible, and be alert to phishing scams and/or emails that look suspicious (although they usually get filtered out to spam). ",
            "date": "Answered November 9, 2017",
            "views": "703",
            "upvotes": " View 35 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swati Thakur",
                    "user_href": "/profile/Swati-Thakur-108"
                },
                {
                    "user_id": "Isaac Ortiz",
                    "user_href": "/profile/Isaac-Ortiz-45"
                },
                {
                    "user_id": "David Flowers",
                    "user_href": "/profile/David-Flowers-102"
                },
                {
                    "user_id": "Autumn Blanchett",
                    "user_href": "/profile/Autumn-Blanchett-1"
                },
                {
                    "user_id": "Christina Pratt",
                    "user_href": "/profile/Christina-Pratt-25"
                },
                {
                    "user_id": "Scott Stevens",
                    "user_href": "/profile/Scott-Stevens-233"
                },
                {
                    "user_id": "Angie Fernandez",
                    "user_href": "/profile/Angie-Fernandez-64"
                },
                {
                    "user_id": "Leigh Pope",
                    "user_href": "/profile/Leigh-Pope"
                },
                {
                    "user_id": "Terri Rice",
                    "user_href": "/profile/Terri-Rice-17"
                },
                {
                    "user_id": "Deep Current",
                    "user_href": "/profile/Deep-Current-1"
                },
                {
                    "user_id": "Sammy A",
                    "user_href": "/profile/Sammy-A-36"
                },
                {
                    "user_id": "Charles Barton",
                    "user_href": "/profile/Charles-Barton-36"
                },
                {
                    "user_id": "Amanda Boone",
                    "user_href": "/profile/Amanda-Boone-50"
                },
                {
                    "user_id": "Ashu",
                    "user_href": "/profile/Ashu-534"
                },
                {
                    "user_id": "Cindy Glunt",
                    "user_href": "/profile/Cindy-Glunt"
                },
                {
                    "user_id": "Leesa Sage",
                    "user_href": "/profile/Leesa-Sage"
                },
                {
                    "user_id": "Katie Grant",
                    "user_href": "/profile/Katie-Grant-98"
                },
                {
                    "user_id": "Onyedika Lotanna Kanu",
                    "user_href": "/profile/Onyedika-Lotanna-Kanu"
                },
                {
                    "user_id": "AJ Singh",
                    "user_href": "/profile/AJ-Singh-286"
                },
                {
                    "user_id": "Dolaldducksjuicypussy",
                    "user_href": "/profile/Dolaldducksjuicypussy"
                },
                {
                    "user_id": "Vikki Ashworth",
                    "user_href": "/profile/Vikki-Ashworth"
                },
                {
                    "user_id": "Monday Ogudu",
                    "user_href": "/profile/Monday-Ogudu"
                },
                {
                    "user_id": "Anshu Rao",
                    "user_href": "/profile/Anshu-Rao"
                },
                {
                    "user_id": "Suhas Chavan",
                    "user_href": "/profile/Suhas-Chavan-57"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Abubakar Ali",
                    "user_href": "/profile/Abubakar-Ali-22"
                },
                {
                    "user_id": "Willa Cantu",
                    "user_href": "/profile/Willa-Cantu"
                },
                {
                    "user_id": "John Collins",
                    "user_href": "/profile/John-Collins-328"
                },
                {
                    "user_id": "Carrie Caswell",
                    "user_href": "/profile/Carrie-Caswell-1"
                },
                {
                    "user_id": "Chris Omalley",
                    "user_href": "/profile/Chris-Omalley-19"
                },
                {
                    "user_id": "Linda Hubbard",
                    "user_href": "/profile/Linda-Hubbard-33"
                },
                {
                    "user_id": "Bill Boland",
                    "user_href": "/profile/Bill-Boland-2"
                },
                {
                    "user_id": "Sheila Marie Kwiatkowski",
                    "user_href": "/profile/Sheila-Marie-Kwiatkowski-1"
                },
                {
                    "user_id": "Sa Ze",
                    "user_href": "/profile/Sa-Ze-2"
                },
                {
                    "user_id": "Hema Deepak",
                    "user_href": "/profile/Hema-Deepak-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robotics Chick",
                "href": "/profile/Robotics-Chick"
            },
            "answer_text": "There are a number of quick, easy methods you can employ to make sure no one is spying on your phone. If your battery is draining more quickly than usual, tracking software could be running in the background.--Unless you're playing a bunch of games on your phone, your battery draining quickly could be a sign that you're being tracked.-- This is especially true when your phone is taking longer to charge. A longer charge time might indicate that an intensive app -- like a monitoring app -- is running. If your phone constantly feels warm, spy software could be running.-- Your phone will get warm from time to time as it runs intense software like games, but if you aren't running anything other than Facebook and your phone feels like it could fry an egg, you could be the victim of spy software. -- This is not applicable while you are charging your device -- some phones just get hot as the battery charges. However, if a phone becomes really warm to the touch, it may be a result of your phone being over-worked, and this might mean that a spyware application is running. If your phone calls have been filled with strange noises or echoing lately, somebody might be listening in.-- If you've never had issues with your phone echoing during calls in the past, but you are now, you might have an uninvited guest on your phone call. ",
            "date": "Answered August 28, 2017",
            "views": "177",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johnny Hughes",
                    "user_href": "/profile/Johnny-Hughes-16"
                },
                {
                    "user_id": "Rebecca Jessica Turley",
                    "user_href": "/profile/Rebecca-Jessica-Turley"
                },
                {
                    "user_id": "Linda Grace Caudill Gillum",
                    "user_href": "/profile/Linda-Grace-Caudill-Gillum"
                },
                {
                    "user_id": "Nina Jay",
                    "user_href": "/profile/Nina-Jay-22"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "John Collins",
                    "user_href": "/profile/John-Collins-328"
                },
                {
                    "user_id": "Linda Hubbard",
                    "user_href": "/profile/Linda-Hubbard-33"
                },
                {
                    "user_id": "Peng Pana",
                    "user_href": "/profile/Peng-Pana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ehan",
                "href": "/profile/Ehan"
            },
            "answer_text": "[Sorry for misunderstanding, my answer is for physically access to you phone, not remote access… my bad lol] Let’s imagine a situation first: You found your smartphone seems like moved 1mm on the table after you came out of that bloody toilet. Your girlfriend was doing Yoga in front of the television. Everything seems so normal. However, you know that there’re some dirty secrets hide in your phone, you just talked with your best mate via Messenger about how to make up an excuse to cheat your girlfriend for hanging out to a put and watching a football game with your friends. You know you’re gonna f**ked up if you still talk lie to your girlfriend after she’ve already checked your phone. Therefore, How do you know if someone has access to your phone? (The method I mentioned below is just for Android phone and tested on Android 6.0, not sure about IOS environment, sorry, if someone can buy me an iphoneX, I’d love to figure it out:) Open Call interface:  Type in: *#*#4636#*#* and the interface will shown up like this:  Click “Usage Statistics”:  Aha, You can check the “Last time used” and “Used time” of the applications, and know whether someone has access your phone. I hope this will help :) English is not my first language, if I make any mistakes, pls point out for me, appreciate!!!! ",
            "date": "Answered October 5, 2017",
            "views": "258",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rachel Romi",
                    "user_href": "/profile/Rachel-Romi-1"
                },
                {
                    "user_id": "Nicole Bonetti",
                    "user_href": "/profile/Nicole-Bonetti-3"
                },
                {
                    "user_id": "Julia John",
                    "user_href": "/profile/Julia-John-4"
                },
                {
                    "user_id": "Linda Grace Caudill Gillum",
                    "user_href": "/profile/Linda-Grace-Caudill-Gillum"
                },
                {
                    "user_id": "Meghana Chukka",
                    "user_href": "/profile/Meghana-Chukka-2"
                },
                {
                    "user_id": "Sanyeong Choi",
                    "user_href": "/profile/Sanyeong-Choi"
                },
                {
                    "user_id": "Vasu Vasu",
                    "user_href": "/profile/Vasu-Vasu-75"
                },
                {
                    "user_id": "Thomas Staatz",
                    "user_href": "/profile/Thomas-Staatz"
                },
                {
                    "user_id": "Onyedika Lotanna Kanu",
                    "user_href": "/profile/Onyedika-Lotanna-Kanu"
                },
                {
                    "user_id": "Bikergirl",
                    "user_href": "/profile/Bikergirl-1"
                },
                {
                    "user_id": "Ruby White",
                    "user_href": "/profile/Ruby-White-69"
                },
                {
                    "user_id": "Craig Caywood",
                    "user_href": "/profile/Craig-Caywood-2"
                },
                {
                    "user_id": "Anshu Rao",
                    "user_href": "/profile/Anshu-Rao"
                },
                {
                    "user_id": "Robin Platz",
                    "user_href": "/profile/Robin-Platz"
                },
                {
                    "user_id": "Sad Please Help me god Help",
                    "user_href": "/profile/Sad-Please-Help-me-god-Help"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Mi Fone",
                    "user_href": "/profile/Mi-Fone-2"
                },
                {
                    "user_id": "Rawhiya Khamis",
                    "user_href": "/profile/Rawhiya-Khamis"
                },
                {
                    "user_id": "Tonya Robinson",
                    "user_href": "/profile/Tonya-Robinson-93"
                },
                {
                    "user_id": "Alex K",
                    "user_href": "/profile/Alex-K-577"
                },
                {
                    "user_id": "Miranda Mariè LaRuè",
                    "user_href": "/profile/Miranda-Mariè-LaRuè"
                },
                {
                    "user_id": "Rob Ere Toll",
                    "user_href": "/profile/Rob-Ere-Toll"
                },
                {
                    "user_id": "Divagari Arumugam",
                    "user_href": "/profile/Divagari-Arumugam"
                },
                {
                    "user_id": "WOO-YOUNG CHOI",
                    "user_href": "/profile/WOO-YOUNG-CHOI"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Fred",
                "href": "/profile/David-Fred-3"
            },
            "answer_text": "If it's being done legally, with a warrant, you can't. The tracking happens deep in the network, there is no “hack” or hidden software on your phone. If it's being done illegally, there are some subtle things, but those same things can occur on a phone not being tracked. Shorter battery life, long connect times after you push the SEND key, A sudden inexplicable change in signal strength, the number of bars your phone displays. But all of those things occur normally in a network sometimes. If you're worried about hidden software on the phone, you can check storage/memory usage to see if there is anything you don't recognize. You can go online and look at your detailed bill to see if there has been an unusual increase in SMS or data usage. if your phone is behaving strangely, print out your contacts and other important information, and do a factory reset. See if the odd behavior stops. Never click “a\"I accept” or “\"I agree” to anything, unless you know what it is. Im not familiar with Android, but on Apple you can disable ALL location based services. But as I said, there is no way to tell for sure. ",
            "date": "Answered December 16, 2016",
            "views": "329",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles Beck",
                    "user_href": "/profile/Charles-Beck-13"
                },
                {
                    "user_id": "Leigh Pope",
                    "user_href": "/profile/Leigh-Pope"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Brandy-S-6"
                },
                {
                    "user_id": "Faraway Fields",
                    "user_href": "/profile/Faraway-Fields"
                },
                {
                    "user_id": "Kate Han",
                    "user_href": "/profile/Kate-Han-21"
                },
                {
                    "user_id": "Riley Diener",
                    "user_href": "/profile/Riley-Diener"
                },
                {
                    "user_id": "Amr Al-najjar",
                    "user_href": "/profile/Amr-Al-najjar"
                },
                {
                    "user_id": "Mendy Ortega",
                    "user_href": "/profile/Mendy-Ortega-1"
                },
                {
                    "user_id": "Jumanah Idris",
                    "user_href": "/profile/Jumanah-Idris"
                },
                {
                    "user_id": "Kevin Lee Perry",
                    "user_href": "/profile/Kevin-Lee-Perry"
                },
                {
                    "user_id": "Lovin Babu",
                    "user_href": "/profile/Lovin-Babu"
                },
                {
                    "user_id": "Jaydon Mook",
                    "user_href": "/profile/Jaydon-Mook"
                },
                {
                    "user_id": "sharlea",
                    "user_href": "/profile/sharlea-1"
                },
                {
                    "user_id": "Doug Siefken",
                    "user_href": "/profile/Doug-Siefken"
                },
                {
                    "user_id": "Chere Dahlstrom",
                    "user_href": "/profile/Chere-Dahlstrom"
                },
                {
                    "user_id": "Scott Helms",
                    "user_href": "/profile/Scott-Helms-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Delespierre",
                "href": "/profile/Benjamin-Delespierre"
            },
            "answer_text": "There are, unfortunately, many ways to spy on your phone. I’ll go from broader to the closest to your phone: Internet data: the US gvt - and other big organization - are capable of intercepting & storing your messages. You have no direct power over them. You can circumvent their monitoring by using cryptography but you’ll end up looking more suspiciousPhone Service Provider : I worked for them, they have access to the “pipes” carrying you data, they can see / act on what you say / message / send, you have very limited control over thatPhone Cloning : this is rather advanced and unusual hacking, but basically someone can copy your IMSI (subscriber identifier) to create a clone of your phone on the network and recieve call / SMS as if they were youPhone Tapping : I saw that once, someone with access to your phone or account can install a spy software giving access to the phone’s data, location, you name it. Such app provide the thieve real time data.Direct Access : gvt officials are legally capable of asking you to hand over your device or its data unencrypted in most countries.Most of the time, you have little to no chance of detecting a data leak when it happens. If you’re suspecting something here’s my advice: 1. ask you service provider for a new SIM card 2. reset your phone to factory settings (which will remove any spy program if any) 3. always use 2 factor authentication on all your accounts (supported by Google, Twitter, Facebook etc.) If you can’t, use different password for each apps 4. crypt your phone internal storage (easy on android, IDK on IOS) 5. even turned off, your phone can still be “seen” on the network. if you truely want to disapear, remove both SIM & Battery. Good Luck :-) ",
            "date": "Answered June 25, 2018",
            "views": "1444",
            "upvotes": " View 57 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leanne Taylor",
                    "user_href": "/profile/Leanne-Taylor-44"
                },
                {
                    "user_id": "Sriya Devkar",
                    "user_href": "/profile/Sriya-Devkar"
                },
                {
                    "user_id": "Becky Manuel",
                    "user_href": "/profile/Becky-Manuel-2"
                },
                {
                    "user_id": "Carloree Hoppe",
                    "user_href": "/profile/Carloree-Hoppe"
                },
                {
                    "user_id": "Usman Naeem",
                    "user_href": "/profile/Usman-Naeem-68"
                },
                {
                    "user_id": "David Cavallaro",
                    "user_href": "/profile/David-Cavallaro-7"
                },
                {
                    "user_id": "Isabella Malick",
                    "user_href": "/profile/Isabella-Malick"
                },
                {
                    "user_id": "Susan Morse",
                    "user_href": "/profile/Susan-Morse-35"
                },
                {
                    "user_id": "Yasar Hayat",
                    "user_href": "/profile/Yasar-Hayat-1"
                },
                {
                    "user_id": "Jim Gamblain",
                    "user_href": "/profile/Jim-Gamblain"
                },
                {
                    "user_id": "Rhys McLarnon",
                    "user_href": "/profile/Rhys-McLarnon"
                },
                {
                    "user_id": "Doug Mcmiller",
                    "user_href": "/profile/Doug-Mcmiller"
                },
                {
                    "user_id": "Dave Reddon",
                    "user_href": "/profile/Dave-Reddon"
                },
                {
                    "user_id": "Kiana Kirkwood",
                    "user_href": "/profile/Kiana-Kirkwood"
                },
                {
                    "user_id": "Linda Layton",
                    "user_href": "/profile/Linda-Layton-15"
                },
                {
                    "user_id": "Suzanne Oldfield",
                    "user_href": "/profile/Suzanne-Oldfield-1"
                },
                {
                    "user_id": "Tara Santistevan",
                    "user_href": "/profile/Tara-Santistevan"
                },
                {
                    "user_id": "Kritika Choudhary",
                    "user_href": "/profile/Kritika-Choudhary-9"
                },
                {
                    "user_id": "Tugba Yan",
                    "user_href": "/profile/Tugba-Yan"
                },
                {
                    "user_id": "Brandy Gilreath",
                    "user_href": "/profile/Brandy-Gilreath-2"
                },
                {
                    "user_id": "Matt Reyes",
                    "user_href": "/profile/Matt-Reyes-38"
                },
                {
                    "user_id": "Christina Pratt",
                    "user_href": "/profile/Christina-Pratt-25"
                },
                {
                    "user_id": "Ashwini Jadhav",
                    "user_href": "/profile/Ashwini-Jadhav-46"
                },
                {
                    "user_id": "Barnell Phillips III",
                    "user_href": "/profile/Barnell-Phillips-III"
                },
                {
                    "user_id": "CALVIN REAGAN",
                    "user_href": "/profile/CALVIN-REAGAN-1"
                },
                {
                    "user_id": "Moccah Steele",
                    "user_href": "/profile/Moccah-Steele"
                },
                {
                    "user_id": "Ravitesh Chaudhary",
                    "user_href": "/profile/Ravitesh-Chaudhary"
                },
                {
                    "user_id": "Sanyeong Choi",
                    "user_href": "/profile/Sanyeong-Choi"
                },
                {
                    "user_id": "Leigh Pope",
                    "user_href": "/profile/Leigh-Pope"
                },
                {
                    "user_id": "Terri Rice",
                    "user_href": "/profile/Terri-Rice-17"
                },
                {
                    "user_id": "Ryan Rhawn",
                    "user_href": "/profile/Ryan-Rhawn-1"
                },
                {
                    "user_id": "Lily Vang",
                    "user_href": "/profile/Lily-Vang-30"
                },
                {
                    "user_id": "Durre Shahwar",
                    "user_href": "/profile/Durre-Shahwar-41"
                },
                {
                    "user_id": "Pierre Kur",
                    "user_href": "/profile/Pierre-Kur"
                },
                {
                    "user_id": "Christian Soto",
                    "user_href": "/profile/Christian-Soto-114"
                },
                {
                    "user_id": "Leesa Sage",
                    "user_href": "/profile/Leesa-Sage"
                },
                {
                    "user_id": "Bvanastern Vannah",
                    "user_href": "/profile/Bvanastern-Vannah"
                },
                {
                    "user_id": "Onyedika Lotanna Kanu",
                    "user_href": "/profile/Onyedika-Lotanna-Kanu"
                },
                {
                    "user_id": "AJ Singh",
                    "user_href": "/profile/AJ-Singh-286"
                },
                {
                    "user_id": "Marissa Aladro",
                    "user_href": "/profile/Marissa-Aladro"
                },
                {
                    "user_id": "Connie X. Zhang",
                    "user_href": "/profile/Connie-X-Zhang"
                },
                {
                    "user_id": "Keymah Danae",
                    "user_href": "/profile/Keymah-Danae"
                },
                {
                    "user_id": "Carol Kurowski",
                    "user_href": "/profile/Carol-Kurowski-1"
                },
                {
                    "user_id": "Shyam Sudra",
                    "user_href": "/profile/Shyam-Sudra"
                },
                {
                    "user_id": "Ky",
                    "user_href": "/profile/Ky-250"
                },
                {
                    "user_id": "Tyson Holmes",
                    "user_href": "/profile/Tyson-Holmes-7"
                },
                {
                    "user_id": "Nina Jay",
                    "user_href": "/profile/Nina-Jay-22"
                },
                {
                    "user_id": "Kimberly Austin Parrish",
                    "user_href": "/profile/Kimberly-Austin-Parrish"
                },
                {
                    "user_id": "Tina Gauna",
                    "user_href": "/profile/Tina-Gauna"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Charles Wang",
                    "user_href": "/profile/Charles-Wang-318"
                },
                {
                    "user_id": "Mima Moise",
                    "user_href": "/profile/Mima-Moise"
                },
                {
                    "user_id": "Mehmet Rende",
                    "user_href": "/profile/Mehmet-Rende"
                },
                {
                    "user_id": "Kp Griffin",
                    "user_href": "/profile/Kp-Griffin"
                },
                {
                    "user_id": "Faraway Fields",
                    "user_href": "/profile/Faraway-Fields"
                },
                {
                    "user_id": "Miranda Mariè LaRuè",
                    "user_href": "/profile/Miranda-Mariè-LaRuè"
                },
                {
                    "user_id": "Kc Richardson",
                    "user_href": "/profile/Kc-Richardson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matloob Khan",
                "href": "/profile/Matloob-Khan-4"
            },
            "answer_text": "Ofcourse unless you are sure about each of the app in your phone. By sure I mean you know how the app work and why you have it. Apps can't hide themselves unless you give them permissions. There are some keyboard apps which keep track of your typing history and clipboards. Apps you get from friends through shareit or xender etc, are also unreliable as they have no source mentioned on them.(Only if the app doesn't belong to a big and reliable company like facebook, chrome, etc,.). Someone might also have your email and password and hence he can see everything you surfed online wether it is a google search or a video over youtube. But you can delete your history by googling “google activity” and deleting your history. Anyways you should never use your id in others phone as phones can save passwords and emails automatically. And if you feel like someone is monitoring you, your first step should be to change your passwords for email or any other social website or app. Apps which are not so popular can not be guaranteed to be safe specially if they were downloaded from outside of PlayStore. Or apps which have friends in their name (Friendzone, FriendLocation, etc,) are also for friends to access your details like location etc,. There is also an app called TeamViewer, Assist etc for anyone to see your screens live preview. And last but not least someapps can hide themselves after one set up. But you can get such apps by going to Device Administration or Device Admin Apps or Administration - (vary based on different phones). In most devices it can be found under security tab and for others they can search one of the above terms in settings. Once inside, there are apps with administrative permissions no apps need this kind of permissions unless they are for finding phone once lost or somekind of launcher etc,. No one can track you unless you are safe at your side never download apps sent over email and if you ever feel someone is eavesdropping on your phone just change every password you have (Google, Facebook, Twitter ) that will automatically remove your email from others phones. And uninstall useless or not frequently used less known apps. N Yeah please try to upvote cuz that'll make me happy which I need a lot during this pandemic 🤞 ",
            "date": "Updated August 15, 2020",
            "views": "85",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Piyush",
                    "user_href": "/profile/Piyush-629"
                },
                {
                    "user_id": "Jeanna Sparks Pace",
                    "user_href": "/profile/Jeanna-Sparks-Pace"
                },
                {
                    "user_id": "Shabna C",
                    "user_href": "/profile/Shabna-C-1"
                },
                {
                    "user_id": "Sarah Brown",
                    "user_href": "/profile/Sarah-Brown-1871"
                },
                {
                    "user_id": "ANUM",
                    "user_href": "/profile/ANUM-44"
                },
                {
                    "user_id": "Ashley Roark",
                    "user_href": "/profile/Ashley-Roark-20"
                },
                {
                    "user_id": "Mary Silvergirl",
                    "user_href": "/profile/Mary-Silvergirl"
                },
                {
                    "user_id": "Yogendra Yadav",
                    "user_href": "/profile/Yogendra-Yadav-111"
                },
                {
                    "user_id": "Jaclyn Keller",
                    "user_href": "/profile/Jaclyn-Keller-7"
                },
                {
                    "user_id": "Laurie Sampsell",
                    "user_href": "/profile/Laurie-Sampsell"
                },
                {
                    "user_id": "Linda Grace Caudill Gillum",
                    "user_href": "/profile/Linda-Grace-Caudill-Gillum"
                },
                {
                    "user_id": "Amy Largher",
                    "user_href": "/profile/Amy-Largher"
                },
                {
                    "user_id": "Barnell Phillips III",
                    "user_href": "/profile/Barnell-Phillips-III"
                },
                {
                    "user_id": "Adam Blackwell",
                    "user_href": "/profile/Adam-Blackwell-2"
                },
                {
                    "user_id": "Leigh Pope",
                    "user_href": "/profile/Leigh-Pope"
                },
                {
                    "user_id": "Terri Rice",
                    "user_href": "/profile/Terri-Rice-17"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kit Kilgour",
                "href": "/profile/Kit-Kilgour"
            },
            "answer_text": "If your phone is carrying out normal cellular activity and being tracked legally but not with great accuracy, then you won’t know - the police, say, will have got a warrant and gone to the cell phone operator and will be tracking your location to cell accuracy level by getting the details from the operator. If there is some more detailed tracking from the network, then the network may be sending signals to the phone to request actual location every few seconds and if you aren’t doing much on the phone you might notice increased battery drain. If you have enabled Android or iPhone phone tracking / findmyphone etc then your phone is updating accurate location fairly regularly anyway and someone with access to your google / iPhone account would be able to see that and you wouldn’t notice as it would be normal phone activity. If someone has put a tracking app on your phone that isn’t all that good then you might be able to find it, or it could use too much battery ",
            "date": "Answered February 27, 2019",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amanda Miller",
                    "user_href": "/profile/Amanda-Miller-1448"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chad Young",
                "href": "/profile/Chad-Young-8"
            },
            "answer_text": "I didn't dig too deep in the answers here but in the effort to keep this short and not too sweet…..feast your eyes on this: Stingray phone tracker - Wikipedia My favorite part is how traffic is forced thru this device, and because it knows all the protocols or how to roll back your device to a less secure protocol, that means all the trouble you go through making your device secure goes right out the fucking window. I play alot on the spectrum. I have since I was just a lad. I hear law enforcement say things on side channels such as so in so is going to go over here to purchase whatever. Then he is going to his girls house and smoke. These assholes are listening in real time to conversations and reading text messages, again in real time on the fly. This is no joke, no shit. Most likely without a warrant. Thanks Patriot Act. The only way to get any real privacy is to employ end to end encryption. A “secret conversation” in Messenger or equivalent software app. Cheers! ",
            "date": "Answered August 30, 2020",
            "views": "700",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "KellieandJay Graffis",
                    "user_href": "/profile/KellieandJay-Graffis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisa Snigir",
                "href": "/profile/Lisa-Snigir"
            },
            "answer_text": "Well first spy ware would need to be installed on your phone. If you have an iPhone then make sure you update it right away as updates gets rid of spyware. Here are some signs that can happen if your phone is being tracked::: Odd Phone Behavior - look for how your phone behaves. It can suddenly light up when you aren’t using it, makes beeping noises or shuts down on its own. Battery Rundown – some spyware can increase the use of your battery. If it’s the middle of the day and your battery is significantly low you could be a victim. Your phone can also get hot. Phone Shuts down – your phone may shut down regularly, even when the battery is charged. Background Noise – this one isn’t as reliable as it could be a bad connection. If you hear background noise regularly it could be a sign. Receiving Unusual Texts – you could get random texts from weird numbers, symbols or characters. Increased data Usage – look at your data. Some spyware increases it. But the best have reduced this making it hard to detect. ",
            "date": "Answered July 10, 2018",
            "views": "44",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "KellieandJay Graffis",
                    "user_href": "/profile/KellieandJay-Graffis"
                },
                {
                    "user_id": "Gml None",
                    "user_href": "/profile/Gml-None"
                },
                {
                    "user_id": "Linda Grace Caudill Gillum",
                    "user_href": "/profile/Linda-Grace-Caudill-Gillum"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Kc Richardson",
                    "user_href": "/profile/Kc-Richardson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vanessa Hunt",
                "href": "/profile/Vanessa-Hunt-41"
            },
            "answer_text": "I'll tell you what ticks me off. I have or had a good phone where I set my icons of apps so I can readily launch them. I woke up one morning, and I couldn't believe that not only were the apps misplaced but so many ads that made my head spin. I have an excellent security package that I pay for to protect me. It was doing so for a long time. When I went to my phone icon, a large old picture of me, being blurred, was plastered on the phone. I never asked for it or even had any views there. You would think of how that could happen? Here is another problem I found. When I read messages, I find that some hacker got in there and was communicating sexual activities, and I saw pictures as well. I blocked all the numbers that I didn't recognize and report. To this day, I still get them. I am going to call my provider and the security system, which is supposed to monitor that, but it is not working. Phones today are not secured, and all these hackers find some way to get in. For fixing service, check PacificEthicalHackers.Com”” ((Enter on your browser. You can't keep up with the security as there are changes by hackers always. Your phone is not as safe as you think. We should go back to the old way of using landlines. ",
            "date": "Answered May 21, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Garvin Michael",
                    "user_href": "/profile/Garvin-Michael"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ton Klompmaker",
                "href": "/profile/Ton-Klompmaker"
            },
            "answer_text": "Probably by checking your data usage. On a LAN you may have a means to check on the router if your cell is using data when it should not. On 3G / 4G data through the cell operator you can often do the same. i.e. current use and next ceck in 30 minutes or so. This should give you an idea if there is something goin on there. Do switch off all apps which use data of course. Chanses are that the spying app would only be active when A LAN connection is detected. This to avoid you using all your 3G/4G data allowance and as a result, be alarmed something is not right. LAN usually is “all you can eat” so it is safer to spy upon one there. Avoidance: install a decent firewall on your LAN (like Smoothwall express as a free download, which is believed to have no backdoor!!!) and block all traffic going in or out between LAN and WAN/Internet except the traffic you really need. It also has a data volume measuring capability so may help you to identify and shut down illegal traffic. it also can list the IP addresses in the logs of the systems trying to get access to your LAN and systems.. ",
            "date": "Answered April 19, 2018",
            "views": "123",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "LingLing Haskins",
                    "user_href": "/profile/LingLing-Haskins"
                },
                {
                    "user_id": "Karen Gore",
                    "user_href": "/profile/Karen-Gore-13"
                },
                {
                    "user_id": "Chanel Rupi",
                    "user_href": "/profile/Chanel-Rupi"
                },
                {
                    "user_id": "Nachiket Saggam",
                    "user_href": "/profile/Nachiket-Saggam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aju K Jose",
                "href": "/profile/Aju-K-Jose"
            },
            "answer_text": "Spy apps They are available in all of the different app stores, which makes it extremely easy for them to get on your phone. Phishing Using Messages Another major way that people are able to try to get into your phone is by using phishing programs. This is done by sending you some kind of message that automatically downloads a malicious app onto your phone so that they are able to determine what you are doing on your phone, view your information, and gain access to things you clearly don’t want them to know. SS7 Phone Vulnerabilities It was discovered about two years ago that there is a vulnerability in mobile networks throughout the world, referred to as SS7. WiFi networks There are those who have gone to the extra measure to protect their phone, and they dare people saying there is no way that someone can hack my phone. The truth is that some of the most innocuous situations can open the door to hacking occurring. You actually are putting yourself in this kind of situation by connecting into strange Wi-Fi networks or even using a charging station at a home or business you are potentially opening the door for someone to gain access into your phone. Safety measures… Install an antivirus app on mobile device. Get Wi-Fi network safeguard application to protection when connected to open wifi. Download files only from trusted sources only. Screen locking helps you from being monitored online and offline says, Google ",
            "date": "Answered April 27, 2018",
            "views": "55",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Traci Tindall",
                    "user_href": "/profile/Traci-Tindall-1"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Sheyden M",
                    "user_href": "/profile/Sheyden-M"
                },
                {
                    "user_id": "Roxanne Rico",
                    "user_href": "/profile/Roxanne-Rico"
                },
                {
                    "user_id": "Kc Richardson",
                    "user_href": "/profile/Kc-Richardson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Jones",
                "href": "/profile/Barbara-Jones-1283"
            },
            "answer_text": "The battery runs down and the phone won't update. See if there have been any back ups which you didn't do. Go into an online store and see if you've been shopping for stuff you haven't shopped for. My stalkers like to taunt me so they turn the camera and video on and have recorded a therapy session to my phone and have texted me to let me know they are watching me. I found camera in the smoke detector. The police where I live are hiring “consultants” to do this. I'm not the only one. The county where I live has tons of gangs and intelligence and they appear to use civilians as guinea pigs to train their goons. I don't know that that's true but these are the crappiest people on the planet. ",
            "date": "Answered January 21, 2020",
            "views": "26",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kimberly Picou",
                    "user_href": "/profile/Kimberly-Picou-2"
                },
                {
                    "user_id": "Michael Blackhurst",
                    "user_href": "/profile/Michael-Blackhurst-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Nicholas",
                "href": "/profile/Jason-Nicholas-20"
            },
            "answer_text": "Step 1: start taking your pills again as your doctor recommended. Step 2: If you were interesting enough to track and monitor you'd know it, and the group you were affiliated with would have measures in place, or you'd be the one putting these measures in place, and you wouldn't have asked this question in the first place because you'd already know. LOL Step 3: have you taken your pills yet? Step 4: if your Significant Other (SO) is monitoring you, is he / she taking their pills? Are you sure they're taking their pills? Or does your SO have a legitimate reason to doubt you? If they do then maybe you need to be caught out… just saying. If no reason exists then why do you really care that you're being monitored by your SO? If they are monitoring you, and you're both taking your pills as directed, then maybe a breakup and a new handset & number are in order, cray cray is cray cray. GTFO before your bunny ends up in a pot on the stove o_O Just saying… ",
            "date": "Answered April 19, 2019",
            "views": "35",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jason Bender",
                    "user_href": "/profile/Jason-Bender-43"
                },
                {
                    "user_id": "Garvin Michael",
                    "user_href": "/profile/Garvin-Michael"
                },
                {
                    "user_id": "Sally Jenson",
                    "user_href": "/profile/Sally-Jenson-6"
                },
                {
                    "user_id": "Michael Blackhurst",
                    "user_href": "/profile/Michael-Blackhurst-4"
                },
                {
                    "user_id": "Lynette From MS",
                    "user_href": "/profile/Lynette-From-MS"
                },
                {
                    "user_id": "Annel Antonio",
                    "user_href": "/profile/Annel-Antonio"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Machelle Jones",
                "href": "/profile/Machelle-Jones"
            },
            "answer_text": "They send out signals ,clues, their there. Next you obviously start noticing them. Then you go investigate it. You first go to your activity look at the details. Are the device i.d numbers yours and only yours? Biggest hint right there. You then check your i.p address. Is there only one or an exceeding i.p address? Does it seem to continue on and on like more than one line of i.p addresses? At first glance this would be how you would notice and from having no idea at first that's how it would seem to look. You then notice every change your device makes without you. All the other things it does without you that shows it's being used by another. Like when your camera takes your picture after it notified you annoyingly until you looked at it for the picture to be taken. That's how you know your being looked at through it. ",
            "date": "Answered November 7, 2018",
            "views": "279",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mike Rawlings",
                    "user_href": "/profile/Mike-Rawlings-14"
                },
                {
                    "user_id": "Beeb O",
                    "user_href": "/profile/Beeb-O"
                },
                {
                    "user_id": "Annemarie Clark",
                    "user_href": "/profile/Annemarie-Clark-4"
                },
                {
                    "user_id": "Bonnie",
                    "user_href": "/profile/Bonnie-346"
                },
                {
                    "user_id": "Karen Gore",
                    "user_href": "/profile/Karen-Gore-13"
                },
                {
                    "user_id": "Priya Matthew",
                    "user_href": "/profile/Aria-Matthew-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Gallo",
                "href": "/profile/Geoff-Gallo-1"
            },
            "answer_text": "If you rurn off wi-fi, and do not run gps by running google maps, your phone should not transmit location info. iPhones maybe track auromatically and can't be shut off. Technically, your phone company and the NSA can find out what tower you are near, but for a laser drone strike youe GPS has to be operating. With a computer engineering education, I understand why it is impossible for me to track the location of anyone's phone, despite having a serious set of skills for creating sophisticated electronics that fit this sort of realm. You pretty much have to be MI6 or the KGB to know how to operate cell-provider systems that can locate a phone. If you just wrap it in copper foil (better yet Copper Roof Flashing - see hardware store) - no one on Earth can track your phone no matter how easy it might be. Ask for details … you can't send or receive calls on a copper shielded phone, but might enjoy the privacy. ",
            "date": "Answered September 26, 2017",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonio Roldan",
                    "user_href": "/profile/Antonio-Roldan-2"
                },
                {
                    "user_id": "Antonette Matthee",
                    "user_href": "/profile/Antonette-Matthee"
                },
                {
                    "user_id": "Alex Georgopoulos",
                    "user_href": "/profile/Alex-Georgopoulos-1"
                },
                {
                    "user_id": "Andy Tan Hong Lin",
                    "user_href": "/profile/Andy-Tan-Hong-Lin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zachary Weiner",
                "href": "/profile/Zachary-Weiner-5"
            },
            "answer_text": "Unless there is a form of spyware or malware on your mobile device, you will not be able to. Once the signal has left your phone via wifi or cell signal, it's not expected to return. Therefore your phone will never know that the information you sent was diverted before reaching its intended destination.  If there is an actual application on your mobile device, it's still may be difficult to tell. Andriod devices are notoriously open and iPhones are notoriously locked down.  One way to tell if something out of the ordinary is going on is to: route your phones connection through your computer, and turn off the cellular signal so that the phone can only connect to the Internet via the wifi of you computer. Then open a network logger like WireShark or Fiddler depending on PC or Mac. You'll see the destination of each expected piece of information sent, but this still won't prevent the data from being re-routed before reaching its destination. ",
            "date": "Answered December 27, 2015",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jesus Gomez",
                    "user_href": "/profile/Jesus-Gomez-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Crowley",
                "href": "/profile/Paul-Crowley-26"
            },
            "answer_text": "Who are you concerned about? Your neighbor, your friend or the police? A long time ago, it wasn’t very hard to connect a recording device to a phone line. If you are using a landline in an apartment building, you might want to visually survey the phone connections if you have terminally nosy neighbors. The police? They are going to take advantage of something called CALEA which allows them to request your phone provider to record dialed number and duration (what is called a “pen trace”) or the content of calls. Either way, this is done on the phone company’s equipment and you will never know it is happening. ",
            "date": "Answered August 18, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Valerian Safonov",
                "href": "/profile/Valerian-Safonov"
            },
            "answer_text": "I have watched some videos on the internet on how to spy on someone elses phone and I have to tell you that you may never know that someone is spying on your phone. There are some very hidden ways that people can spy on you. You may go to the internet and dowload an app. It may be as simople as a file manager but it is actually a spying tool, What it does is take pictures and record audio. When there is an interet conncetion it sends the data to the spy. If you want to find out you need to take a look at the data usage. If you notice that an app is using a lot of data and it is not even meant to use data then it is the one. ",
            "date": "Answered June 8, 2020",
            "views": "866",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kurt Behnke",
                "href": "/profile/Kurt-Behnke"
            },
            "answer_text": "If you haven't killed your mother in law or robbed a bank lately, probably nobody is monitoring your phone calls. Phone call monitoring is done by mobile operators on order by the police, if they present a valid court decision. In any case your connection data will be automatically stored by your network operator (that is by law) for possible criminal prosecution — those records are deleted after a while. Mobile networks are pretty safe. Air interface is encrypted, and the rest of the connection goes through optical cables. You need to be in a secured central office with access to the nodes and know-how how to handle in order to tap into a call. ",
            "date": "Answered August 30, 2018",
            "views": "34",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Shagga B",
                    "user_href": "/profile/Shagga-B"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jens Peter Karlsen",
                "href": "/profile/Jens-Peter-Karlsen"
            },
            "answer_text": "Check if you have let anyone install tracking software on your phone.If you are talking of the police you can’t so if you have done something that caused the police to get a warrant to track and monitor your calls you are out of luck. The first thing you will know about it is when the prosecutor present it in a court case. ",
            "date": "Answered January 14, 2020",
            "views": "355",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Syed Z Hosain",
                "href": "/profile/Syed-Z-Hosain"
            },
            "answer_text": "Your question: “How do I know when my mobile phone has been monitored?” Depends on who is monitoring and for what purpose. If there is an app on the phone reporting your location and other stuff (perhaps installed without your knowledge), you may be able to find it by looking at what processes are running on your phone. If it is a law enforcement agency listening to your calls, or tracking your location, this is done in the cellular network and you cannot know whether you are being monitored. The only sure way to avoid being monitored? Simple answer to that: don’t use a mobile phone at all … ever! Or even carry one on you (regardless of whether it is powered off). ",
            "date": "Updated April 29, 2018",
            "views": "79",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Angel A",
                    "user_href": "/profile/Angel-A-128"
                },
                {
                    "user_id": "Faraway Fields",
                    "user_href": "/profile/Faraway-Fields"
                },
                {
                    "user_id": "León Koller",
                    "user_href": "/profile/León-Koller"
                },
                {
                    "user_id": "Kc Richardson",
                    "user_href": "/profile/Kc-Richardson-3"
                },
                {
                    "user_id": "Jumanah Idris",
                    "user_href": "/profile/Jumanah-Idris"
                },
                {
                    "user_id": "Kevin Lee Perry",
                    "user_href": "/profile/Kevin-Lee-Perry"
                },
                {
                    "user_id": "Ankit Nagpal",
                    "user_href": "/profile/Ankit-Nagpal-39"
                },
                {
                    "user_id": "sharlea",
                    "user_href": "/profile/sharlea-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harold Hill",
                "href": "/profile/Harold-Hill-18"
            },
            "answer_text": "Yeah, they planted a small bug in your back left shoulder when you were sleeping, your phone has been tapped by the FBI, NSA and CIA for months now. None of your communication devices are secure; your office phone line and office have hidden recording devices. Bluetooths, car phones, even your kids phones are insecure. We have hacked your financial accounts and at any time we can steal your identity in a split second per our auto computer program. We have 24 hour tabs on your spouse as well. Your automobile engines have been programed to shut down at a 25 mile radius from your home. Is Big Brother watching? Ken :) ",
            "date": "Answered May 18, 2018",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Randy Stegemann",
                    "user_href": "/profile/Randy-Stegemann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danté Moore",
                "href": "/profile/Danté-Moore"
            },
            "answer_text": "Put a piece of tape or a camera cover over the camera on your smartphone. If someone phones you asking you to please remove the item obstructing the camera then you can probably be sure that said person is watching you. Seriously though, covering the camera physically guarantees that no one is watching you through the camera - it’s easy enough to uncover if and when you need it, and it 100% guarantees visual safety (audio is another matter). Hope this helps. ",
            "date": "Answered September 15, 2017",
            "views": "423",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erika Ebenhoh",
                    "user_href": "/profile/Erika-Ebenhoh"
                },
                {
                    "user_id": "GR65",
                    "user_href": "/profile/GR65"
                },
                {
                    "user_id": "Suzanne Oldfield",
                    "user_href": "/profile/Suzanne-Oldfield-1"
                },
                {
                    "user_id": "Katrina Fortu",
                    "user_href": "/profile/Katrina-Fortu"
                },
                {
                    "user_id": "Jorge Patricio",
                    "user_href": "/profile/Jorge-Patricio-4"
                },
                {
                    "user_id": "Deborah Johnson",
                    "user_href": "/profile/Deborah-Johnson-366"
                },
                {
                    "user_id": "Mikka Renee",
                    "user_href": "/profile/Mikka-Renee"
                },
                {
                    "user_id": "Nate Enns",
                    "user_href": "/profile/Nate-Enns-3"
                },
                {
                    "user_id": "Swathi Nair",
                    "user_href": "/profile/Swathi-Nair-49"
                },
                {
                    "user_id": "Talia LaFerriere",
                    "user_href": "/profile/Talia-LaFerriere"
                },
                {
                    "user_id": "Willa Cantu",
                    "user_href": "/profile/Willa-Cantu"
                },
                {
                    "user_id": "Pat Martinez",
                    "user_href": "/profile/Pat-Martinez-31"
                },
                {
                    "user_id": "Karen Gore",
                    "user_href": "/profile/Karen-Gore-13"
                },
                {
                    "user_id": "Raven Macdonald",
                    "user_href": "/profile/Raven-Macdonald-1"
                },
                {
                    "user_id": "Troy Hoffman",
                    "user_href": "/profile/Troy-Hoffman-8"
                },
                {
                    "user_id": "Wilda Patterson",
                    "user_href": "/profile/Wilda-Patterson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshal",
                "href": "/profile/Harshal-18"
            },
            "answer_text": "Monitored by whom? If you're an Android users , then Google keeps track of your speech, traveling, habits, behavior, favorite food items, the way you type, your facial features, your walking patterns, what you like to buy ,your driving stats etc. If anything apart from this ,then for that your phone should have an app installed by the person, organization wants to track you. Just check for malacious running app in running process which isn't familiar. All green looking bots icons are system apps. ",
            "date": "Answered July 3, 2017",
            "views": "61",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "León Koller",
                    "user_href": "/profile/León-Koller"
                },
                {
                    "user_id": "Pearl Jade Rikihana",
                    "user_href": "/profile/Pearl-Jade-Rikihana"
                },
                {
                    "user_id": "Muzzammil Khan",
                    "user_href": "/profile/Muzzammil-Khan-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caleb Hadden",
                "href": "/profile/Caleb-Hadden"
            },
            "answer_text": "So my Galaxy S6 has been hacked. I noticed the quick setting buttons (smart view, phone visibility, private mode and nearby) are sometimes “enabled” on their own. I moved the buttons to the top row of the pull down bar just to be sure because whoever is doing it is usually quick to disable them and make the bluelit light go grey. I have searched for any unknown apps and have done the factory reset twice, but the hacker still has access. Considering buying a new phone and changing my number but that seems like a lot… ",
            "date": "Answered October 2, 2018",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Hunley",
                "href": "/profile/Eric-Hunley"
            },
            "answer_text": "This can be a real challenge. Especially on an iPhone as the apps run in their own sandbox and don’t access the system directly. You need something external. One way to potentially find things out is to capture data that is being sent out and tracing where. This can be done by having a firewall between your Wifi network and the Internet and turning off the LTE/Cellular radio on your device. Capture the traffic with a firewall that is between you and the router and monitor. The 15 best firewall devices to protect your home network ",
            "date": "Answered February 15, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Holland James Phillips",
                "href": "/profile/Holland-James-Phillips"
            },
            "answer_text": "I assume that you're referring to tracking the phone's location, right? No, you won't have any idea that you're phone is being tracked. The most common way that phone location is tracked, whether it's by law enforcement, or some other government organization, is by using cell tower connection data, which is obtained from the provider by court order. There are other methods, but generally, those require special equipment, and regardless, you wouldn't know if you're being tracked with those methods either. ",
            "date": "Answered April 28, 2019",
            "views": "816",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Ericson",
                "href": "/profile/William-Ericson"
            },
            "answer_text": "Most frequently, your phone slows down or lags when running programs. This is normally followed with the battery draining. In an iPhone, you can launch Settings, select General, and then Privacy. Look through every folder there and check for any third-party applications that may be monitoring your phone. If your data usage does go up quickly, contact your provider and ask what made your usage spike. I hope this answer helped, and if it did, fell free to contact or request an answer from me. I usually respond within two days, even on weekends. Best Regards, William Ericson  ",
            "date": "Answered April 7, 2017",
            "views": "104",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Ajisafe Akinola",
                    "user_href": "/profile/Ajisafe-Akinola"
                },
                {
                    "user_id": "Yumi Park",
                    "user_href": "/profile/Yumi-Park-15"
                },
                {
                    "user_id": "Kate Han",
                    "user_href": "/profile/Kate-Han-21"
                },
                {
                    "user_id": "Sabz Hussain",
                    "user_href": "/profile/Sabz-Hussain-1"
                },
                {
                    "user_id": "Michael Hanel",
                    "user_href": "/profile/Michael-Hanel"
                },
                {
                    "user_id": "Kc Richardson",
                    "user_href": "/profile/Kc-Richardson-3"
                },
                {
                    "user_id": "Sheila Marie Kwiatkowski",
                    "user_href": "/profile/Sheila-Marie-Kwiatkowski-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Haythorne",
                "href": "/profile/Richard-Haythorne-1"
            },
            "answer_text": "Well, first and foremost, anybody at least somewhat intelligent can work out that your service provider (along with the Homeland Security) are recording everything we say or write via our cell devices by way of bots that are assigned to your devices encrypted ID. So that nails down one aspect.. The other is a suggestion; who buys a cell phone and doesn't install a good real-time antivirus package?? It'll tell you your infected or spyed on as it's happening.. I mean come on now ",
            "date": "Answered October 7, 2017",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luiz Fernando Pinho",
                "href": "/profile/Luiz-Fernando-Pinho"
            },
            "answer_text": "If legal monitoring, you will never know. There are specific laws to protect official monitoring and there is nothing we can do. Telephony equipments are specifically designed for such \"stealth\" legal monitoring purposes. If illegal monitoring, well, you can or not detect it depending on how much technology is applied. ",
            "date": "Answered November 10, 2014",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nahid Hossain",
                "href": "/profile/নাহিদ-হোসেন-Nahid-Hossain"
            },
            "answer_text": "According to my country I can say you that your phone is being tracked from 3–4 places. First of all government security agencies track your calls.Military intelligence services tracks your callsState department keeps record on your callMobile companies or service providers keeps regular logs of your calls.In recent few years there have been a number of phone call conversation leaks happened here in Bangladesh and most in common cases these agencies released these call information to media. ",
            "date": "Answered April 28, 2019",
            "views": "572",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Woolley",
                "href": "/profile/Mark-Woolley-3"
            },
            "answer_text": "I hope that the person you are calling is listening to you! If you mean “are my calls being intercepted”, then I’m afraid you will never know, until you reach court, and your words are quoted at you! The legal interception of calls is designed to be unintrusive; as a user you should not notice anything, and indeed, only specially trained and authorized government agents will know you are intercepted, the network operators also probably have no knowledge of this! ",
            "date": "Answered January 17, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sagor Majomder",
                "href": "/profile/Sagor-Majomder"
            },
            "answer_text": "sometime people are access our mobile without our permission and it is so bad. To know who access our mobile, we can install some applock app in our mobile. Applock app have a great features to taking selfie. when anybody want to access our mobile, they maybe type wrong lock keyword again and again. when they type that again and again, applock app take their selfie and then we can see their selfie and know who are trying to access my mobile without my permission. ",
            "date": "Answered October 6, 2017",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonah Kowall",
                "href": "/profile/Jonah-Kowall"
            },
            "answer_text": "Most of the monitoring happening outside of the carrier (which you cannot detect) is going to be from apps installed on your mobile device. You can monitor these with a firewall or other software on your phone. The downside is that they will use CPU, memory, and untimely power on your phone, which is a problem for everyone. Realistically everything you do on the web is already being monitored. I use disconnect on my mobile which can help identify monitoring.  ",
            "date": "Answered January 14, 2016",
            "views": "609",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oscar Calderon",
                "href": "/profile/Oscar-Calderon"
            },
            "answer_text": " At the network level, you could do something (you will need networking knowledge): Remove the SIM card from your phone to connect it to a WiFi network (you can do this without removing the SIM card, but if monitoring uses cellular network to send data collected from your phone, you won't be able to find it out. By removing the SIM card, there's no way for the cellphone to have internet access other than WiFi). Then, in the wireless network, connect using a laptop and use the app Wireshark. This app allows you to sniff all the packages that are travelling in the network you're connected. Locate the IP address of the cellphone and start tracking all the outgoing packages. You will see the destination hosts. ",
            "date": "Updated August 29, 2018",
            "views": "176",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Waldo A. Mery",
                    "user_href": "/profile/Waldo-A-Mery"
                },
                {
                    "user_id": "Shauntell Campbell",
                    "user_href": "/profile/Shauntell-Campbell"
                },
                {
                    "user_id": "Ky",
                    "user_href": "/profile/Ky-250"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Miranda Mariè LaRuè",
                    "user_href": "/profile/Miranda-Mariè-LaRuè"
                },
                {
                    "user_id": "Ana Kennedy",
                    "user_href": "/profile/Ana-Kennedy-13"
                },
                {
                    "user_id": "Bill Boland",
                    "user_href": "/profile/Bill-Boland-2"
                },
                {
                    "user_id": "Julie Youngblood",
                    "user_href": "/profile/Julie-Youngblood-3"
                },
                {
                    "user_id": "Pickles Rogerson",
                    "user_href": "/profile/Pickles-Rogerson"
                },
                {
                    "user_id": "Mayukh Mukhopadhyay",
                    "user_href": "/profile/Mayukh-Mukhopadhyay-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Hall",
                "href": "/profile/Josh-Hall-120"
            },
            "answer_text": "because you saw them, if you are doing stuff that it matters then you are doing stuff wrong, depends on how you want to look at it though as to which way you are doing things wrong. I am not going to go from a moral stand point here but a practical and logical one. start with a pass code. get an app that hides calls and pics and text and folders and is only accessable via the dialer and a code. don't leave dirt on your phone, always delete it. log out of on line accounts that have any personal info on them including messages and pics etc. ",
            "date": "Answered March 20, 2019",
            "views": "2",
            "upvotes": " Answer requested by Wesell Rvs",
            "upvoters": [
                {
                    "user_id": "Russell Branham",
                    "user_href": "/profile/Russell-Branham"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Waoo Mart",
                "href": "/profile/Waoo-Mart"
            },
            "answer_text": "It is very easy to get to know that your phone is tracking or not. There is much application that tells about you whether your phone is tracking or not. Many Amazon products are also used to know about the tracking of your phone. In every country Amazon shopping is present. Amazon shopping in Pakistan is also possible. ou just order the things from there and use and you get to know about that your phone is tracking or not. ",
            "date": "Answered July 27, 2020",
            "views": "324",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Imon Roy",
                    "user_href": "/profile/Imon-Roy-4"
                },
                {
                    "user_id": "Muzzammil Khan",
                    "user_href": "/profile/Muzzammil-Khan-27"
                },
                {
                    "user_id": "Adam Marjama",
                    "user_href": "/profile/Adam-Marjama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Li",
                "href": "/profile/Carl-Li-9"
            },
            "answer_text": "Simple answer is that if someone is monitoring your communications from the wireless side then there is no way you can know. Gov can intercept your calls and texts without you even knowing about anything. Of course, if there is a spyware on your phone then your battery will drain faster and for some older phones they slows down due to limited CPU power. Very easy to notice. ",
            "date": "Answered November 29, 2019",
            "views": "822",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Colin Longman",
                "href": "/profile/Colin-Longman"
            },
            "answer_text": "If it’s being tracked at the network level then there is no way for you to know. If you’re concerned that software has been installed on the physical device then look for apps that you don’t recognize and/or for processes running that shouldn’t be. You can reinstall a factory image and in most, but not all, cases this will clear anything locally installed. ",
            "date": "Answered July 3, 2017",
            "views": "82",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abdul Wahid",
                "href": "/profile/Abdul-Wahid-418"
            },
            "answer_text": "You probably use email, social media, and various other online services including banking information, and all of these details can be monitored if the phone or tablet is being tracked. Our dependence on these new technologies also puts us at risk, and the need to know about this kind of software, and protect yourself from ... ",
            "date": "Answered February 6, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wicida Sarme",
                "href": "/profile/Wicida-Sarme"
            },
            "answer_text": "Anyone you share your phone # with, will have the ability to access it… If your phone is of the smart type, means you use it for some other applications as well. Any applications specially related to social media are open to such nuisance … So any links in those applications makes your phone vulnerable! How to identify is something you can do by working with your phone company.. ",
            "date": "Answered October 4, 2017",
            "views": "2",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicola Li",
                "href": "/profile/Nicola-Li-1"
            },
            "answer_text": "The biggest symptom of spyware/malware communicating with someone else (ie using your radio transceiver) is a bigger battery drain than normal. If the payload is at the OS level, you can find anti-spyware apps for your kind of phone. I use D-Vasive for Android. If your sim card’s been hacked, you’ll just never know since it by-passes the OS entirely. Enjoy your privacy! :( Also you may want to stop downloading free apps. ",
            "date": "Answered October 8, 2017",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Metslov",
                "href": "/profile/Alex-Metslov"
            },
            "answer_text": "To be honest, if you're needed by professional and governmental services, you have no chance. (Your phone is simply not needed to track you) If you're the one who clicking \"agree\" button without paying attention to a simple line of text, then just factory reset your phone and start thinking before pressing any button. In any other cases you're smart enough to go through basics of the security check. ",
            "date": "Answered March 16, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Joakim Welde",
                    "user_href": "/profile/Joakim-Welde"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Amici",
                "href": "/profile/Michael-Amici-1"
            },
            "answer_text": "In truth, you can’t If someone from police or government agency wants to listen to your calls they will. Private parties can listen to if the clone your phone but unlike the movies, it is a lot harder than it looks. Here is the thing you need to know: is that there is no such thing as privacy. Your calls all can be monitored. So, stop doing things illegal or immoral and you will sleep better at night ",
            "date": "Answered May 3, 2019",
            "views": "320",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Surya Kanth",
                    "user_href": "/profile/Surya-Kanth-65"
                },
                {
                    "user_id": "B J Combs",
                    "user_href": "/profile/B-J-Combs"
                },
                {
                    "user_id": "Andrew Enochs",
                    "user_href": "/profile/Andrew-Enochs-1"
                },
                {
                    "user_id": "Shah Faisal",
                    "user_href": "/profile/Shah-Faisal-341"
                },
                {
                    "user_id": "Jessa Michaelis",
                    "user_href": "/profile/Jessa-Michaelis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Drew Arreolaa",
                "href": "/profile/Drew-Arreolaa"
            },
            "answer_text": "Turn off your location not only on your phones gps but on your google maps or any application requiring your location. All apps are a form of tracking you being that most all phones are connected the internet. If your that worried about it buy yourself a pre owned phone on offer up for like 20 to 30 bucks and get it activated for 30 bucks. I would of said get an obama phone you know the free ones ….but im not sure if they still have those. What you do is your business im just giving you some options lol ",
            "date": "Answered August 9, 2018",
            "views": "809",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lauder Daler",
                    "user_href": "/profile/Lauder-Daler"
                },
                {
                    "user_id": "Willa Cantu",
                    "user_href": "/profile/Willa-Cantu"
                },
                {
                    "user_id": "Nahla Ismail",
                    "user_href": "/profile/Nahla-Ismail-4"
                },
                {
                    "user_id": "Yvette-Jeannine Boucher",
                    "user_href": "/profile/Yvette-Jeannine-Boucher-1"
                },
                {
                    "user_id": "Jana Smothermon",
                    "user_href": "/profile/Jana-Smothermon"
                },
                {
                    "user_id": "Kory Wilson",
                    "user_href": "/profile/Kory-Wilson-3"
                },
                {
                    "user_id": "Holkar Reace",
                    "user_href": "/profile/Holkar-Reace"
                },
                {
                    "user_id": "Alex Hole",
                    "user_href": "/profile/Alex-Hole-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nenad Miodrag",
                "href": "/profile/Nenad-Miodrag"
            },
            "answer_text": "In order to do so, someone would have to hack your phone and install a program to activate your phone camera, record video and transmit it over internet, wifi or bluetooth to their computer. The chances of this are next to none. However if you wish to be protected buy any security suite from a reputable company that makes anti virus / malware software and install it on your phone. ",
            "date": "Answered September 17, 2017",
            "views": "14",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Enam Ablanky Obiosio",
                    "user_href": "/profile/Enam-Ablanky-Obiosio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rita Guinea",
                "href": "/profile/Rita-Guinea-1"
            },
            "answer_text": "How do you tell, there are many ways to think this, different trajectory, different understandings, why could someone be monitoring your personal phone? Now to the main question “How can one tell.” It is quite easy because I believe and know and I have experienced that there are people that can execute a lot of the hack issues you have on ground hackbound1 (at outlook,com) ",
            "date": "Answered September 17, 2020",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Jennifer Turner",
                    "user_href": "/profile/Jennifer-Turner-394"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosario Contarino",
                "href": "/profile/Rosario-Contarino-1"
            },
            "answer_text": "Your phone can be tracked in many ways, also ways that are undetectable to you. So, assuming you are being tracked, what can you do? You accept someone is tracking you, ORleave at home your phone, ORuse a phone that does not connect to the standard cellular network. We do produce such phones. You can learn more here.Those are the only options you have. Any other phone that connects to the cellular network can be tracked by using vulnerabilities of the cellular network itself, without even touching your phone, so you have no ways to get rid of whoever is tracking you, as long as you carry with you a normal cellphone. ",
            "date": "Answered December 22, 2016",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jackson-5-4"
                },
                {
                    "user_id": "Clemmie Macpherson",
                    "user_href": "/profile/Clemmie-Macpherson"
                },
                {
                    "user_id": "Rajendra Prasad",
                    "user_href": "/profile/Rajendra-Prasad-1048"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jona Arkenson",
                "href": "/profile/Jona-Arkenson"
            },
            "answer_text": "Easy.. on Android, go to settings, network, mobile data and then look at all the apps that are using data. If you're being spied on, you will see data usage of a certain app.. look at what that app is and if it's unfamiliar, it can be spyware. Fun fact, your carrier network is sending back data and collecting your data, you will see it yourself. ",
            "date": "Answered July 25, 2019",
            "views": "377",
            "upvotes": " Answer requested by Sophia Smith",
            "upvoters": [
                {
                    "user_id": "Allison Pappas",
                    "user_href": "/profile/Allison-Pappas"
                },
                {
                    "user_id": "David W. Strong",
                    "user_href": "/profile/David-W-Strong"
                },
                {
                    "user_id": "Callum McNeill",
                    "user_href": "/profile/Callum-McNeill-4"
                },
                {
                    "user_id": "Kabir Belgikar",
                    "user_href": "/profile/Kabir-Belgikar"
                },
                {
                    "user_id": "Rose Stephenson",
                    "user_href": "/profile/Rose-Stephenson-3"
                },
                {
                    "user_id": "Aman Pandya",
                    "user_href": "/profile/Aman-Pandya-7"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bibhuti Shiv Ranjan",
                "href": "/profile/Bibhuti-Shiv-Ranjan-1"
            },
            "answer_text": "Can't really say But in some cases many app don't need few permission and they ask for it and misuse your privacy I will suggest install “unhack” and see if there is any app with extra permission granted which is not needed for it to perform its task then either uninstall it or remove the permission it can help you monitor ",
            "date": "Answered April 14, 2018",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Heather Bowles",
                    "user_href": "/profile/Heather-Bowles-22"
                },
                {
                    "user_id": "Navneet K",
                    "user_href": "/profile/Navneet-K-3"
                },
                {
                    "user_id": "Pappu Shukla",
                    "user_href": "/profile/Pappu-Shukla-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Pappas",
                "href": "/profile/Nick-Pappas-2"
            },
            "answer_text": "Look at your phone. Is someone doing something like this to it?  If yes, it is being monitored and you better move it. Be careful though because you might end up being monitored yourself. ",
            "date": "Answered November 16, 2018",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Kagio",
                    "user_href": "/profile/David-Kagio"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Kassover",
                "href": "/profile/David-Kassover"
            },
            "answer_text": "You found it in a place that you know you didn’t leave it. You found it set up differently from how you know you left it. Things are missing, or extra things have been added. They left something of themselves behind, e.g. fingerprints, bits of the last meal or snack they had, or they salivated on it from looking at the pictures they found there. ",
            "date": "Answered March 19, 2019",
            "views": "830",
            "upvotes": " Answer requested by Wesell Rvs",
            "upvoters": [
                {
                    "user_id": "Paul Impola",
                    "user_href": "/profile/Paul-Impola"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Marsh",
                "href": "/profile/Charles-Marsh-17"
            },
            "answer_text": "Put a screen lock on it with a spycatcher app. Most Androids have this built in. If yours does not, such apps are easy to find with this function. Basically it secretly shoots a pic of anyone who enters the wrong pattern or code, then puts it either in Gallery or in the Android folder. ",
            "date": "Answered March 2, 2019",
            "views": "808",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amanda Heffington",
                    "user_href": "/profile/Amanda-Heffington-5"
                },
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Flowers",
                "href": "/profile/Thomas-Flowers-24"
            },
            "answer_text": "If you have a smartphone and have ever given an app permission to your camera and/or microphone, then quite frankly, YES!!! This is the simplest way to confirm this answer. Have you ever been in a general conversation around or near your smartphone and out of the blue, Google answers or tells you that it can't help with that, but it is still learning. ",
            "date": "Answered January 17, 2020",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carla Renner",
                    "user_href": "/profile/Carla-Renner-1"
                },
                {
                    "user_id": "Robin Vowell",
                    "user_href": "/profile/Robin-Vowell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel McDonnell",
                "href": "/profile/Daniel-McDonnell-10"
            },
            "answer_text": "Thank you for the A2A Katherine :-) 10 signs to help you analyze if your phone is being monitored Presence of unwanted apps.Battery is draining faster than ever.Getting suspicious texts.Overheating of the device.Spike in data usage.Malfunction of the device.Background noise while calling.Unexpected shutdown.",
            "date": "Answered February 23, 2020",
            "views": "451",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ralph Wells",
                "href": "/profile/Ralph-Wells-1"
            },
            "answer_text": "I believe the days of hearing clicking noises is way over. I don't think anymore unless you are a very sophisticated user with your own cointer-software you even can tell anymore. Remember one of the things that came out from Eric Snowden about US spying on all cell calls even our own citizens. ",
            "date": "Answered October 19, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Summers",
                "href": "/profile/Chris-Summers-22"
            },
            "answer_text": "What like they are calling your number , that should tell you they have access to your number . Are they impersonating you and spoofing your number so other people think it is you ? It could be they have access to your number . ",
            "date": "Answered October 4, 2017",
            "views": "29",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fernando Cordeiro",
                    "user_href": "/profile/Fernando-Cordeiro-4"
                },
                {
                    "user_id": "Frank Lewis",
                    "user_href": "/profile/Frank-Lewis-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joakim Welde",
                "href": "/profile/Joakim-Welde"
            },
            "answer_text": "If they’re really good you can’t, at least not from the technical side. You might get lucky and catch them indirectly, when they act on information they could only realistically have acquired through having tracked your phone. ",
            "date": "Answered December 15, 2016",
            "views": "59",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marie Frenchman",
                    "user_href": "/profile/Marie-Frenchman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Cardiff",
                "href": "/profile/Ted-Cardiff"
            },
            "answer_text": " You can’t, but assume that it is. There are laws in various countries against it, but the current super threat of terriorism gives rise to extrordinary methods of evading those laws by national agencies such as NSA and MI5, etc. Since all mobile/cell phone transmissions are carried by radio waves, they can be intercepted and decrypted. ",
            "date": "Updated August 29, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elias Chavez",
                    "user_href": "/profile/Elias-Chavez-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Wilhite",
                "href": "/profile/Edward-Wilhite-4"
            },
            "answer_text": "I thinks best to approach this as a human problem then a tech one. If your thinking parents then I would assume that they are and try to work on fixing that. How can I turn off the Life 360 without anyone knowing? If your looking at an abusive spouse or parent situation, then I have some tips for counter surveillance here: Do my parents have a right to stop me if I want to move out when I turn 18 and graduate? ",
            "date": "Answered February 18, 2020",
            "views": "398",
            "upvotes": " Answer requested by Terri Olekson"
        },
        {
            "author_info": {
                "name": "Andre Batchelder",
                "href": "/profile/Andre-Batchelder"
            },
            "answer_text": "If you did nothing wrong you shouldn't worry you shouldn't need to know but if you did something you shouldn't have don't worry they are tracking you and you can't avoid it you can even try to get off of the “grid” and they still will know where you are ",
            "date": "Answered January 30, 2018",
            "views": "339",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tsvetan Borisov",
                "href": "/profile/Tsvetan-Borisov"
            },
            "answer_text": "Check for strange SMS messages in your bill from the operator(detailed). Check for strange apps requesting connection s with no root firewall. Check device with a reputable anti virus software like AVG. For anything critical move to fully encrypted communication - telegram or signal app. ",
            "date": "Answered February 28, 2019",
            "views": "903",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kieth Moreland",
                "href": "/profile/Kieth-Moreland"
            },
            "answer_text": "I guess the first thing that ops into my mind is what about you...with all the crime in the country, the lack of confidence in the FBI upper management, ISIS and all the other rag-headed goat-boners running loose...what makes you worthy of being tracked? Can you give us a hint? ",
            "date": "Answered January 30, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Jaime Lopez",
                "href": "/profile/Jaime-Lopez-89"
            },
            "answer_text": "You do not have any way of knowing it's best to assume your not that important or entertaining to worry anyways. That camera installed on your phone is an open door to the web, always looking always watching ",
            "date": "Answered March 24, 2018",
            "views": "46",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Rod North",
                "href": "/profile/Rod-North-2"
            },
            "answer_text": "Phone will glitch battery will die very quickly you might notice certain things you didnt enter in your phone if tour not staring at it all day it's actually semi hard to notice…check your files for M spy or certain programs you didnt download ",
            "date": "Answered June 21, 2020",
            "views": "173",
            "upvotes": " Answer requested by Roksana Parvin Yasmin"
        },
        {
            "author_info": {
                "name": "Md. Amit Hasan",
                "href": "/profile/Md-Amit-Hasan-1"
            },
            "answer_text": "It’s easy to do. Spy apps are plentiful and can imperceptibly track text and e-mail messages, location, Web sites you visit, who you call and what photos and videos you shoot. The problem is these apps are difficult to detect and run invisibly in the background. ",
            "date": "Answered October 4, 2017",
            "views": "329",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mahbod Harandizadeh",
                "href": "/profile/Mahbod-Harandizadeh"
            },
            "answer_text": "All applicatins have a quick access for how many devices use your phone. For example when you use a telegram applivation when go to the setting and press privacy and security link then press Active sessions link you see how many devices use your account. ",
            "date": "Answered October 6, 2017",
            "views": "854",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manav Dhir",
                "href": "/profile/Manav-Dhir-7"
            },
            "answer_text": "You don't need to tell its for sure you phone is monitored. Specially mobile calls are monitored even you messges also social sites too. Even WhatsApp has all you back up when you install again they download all you chats where dose that goes to at there server. ",
            "date": "Answered December 1, 2018",
            "views": "522",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ilane Robinson",
                "href": "/profile/Ilane-Robinson"
            },
            "answer_text": "Take your phone apart and look for a tracker in your phone these are small and black. You can be GPS tracked through your mobile number Iphone and Android are the most monitored ",
            "date": "Answered March 18, 2020",
            "views": "367",
            "upvotes": " Answer requested by Kirn Gill"
        },
        {
            "author_info": {
                "name": "Hristo Samandjiev",
                "href": "/profile/Hristo-Samandjiev"
            },
            "answer_text": "If you want to know if your phone is hacked, you should take it to a specialist service center. There they will tell you if there is a problem or something is wrong. ",
            "date": "Answered April 15, 2018",
            "views": "583",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sara Bennett",
                "href": "/profile/Sara-Bennett-46"
            },
            "answer_text": "If they did’t have an accsess before it’s impossible but if they did that possible because they already could put the spy programm to your phone. ",
            "date": "Answered June 25, 2018",
            "views": "249",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Ferguson",
                "href": "/profile/Martin-Ferguson-8"
            },
            "answer_text": "Sunday just go somewhere without telling anybody and if you see something strange then you'll know ",
            "date": "Answered September 12, 2017",
            "views": "193",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ernest Montague",
                "href": "/profile/Ernest-Montague"
            },
            "answer_text": "Short answer is that you can’t on a modern phone. If it really worries you, remove the battery or buy another phone that’s a “burner” meaning pre paid that you don’t register under your name. ",
            "date": "Answered August 12, 2017",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ahmed Inuwa",
                "href": "/profile/Ahmed-Inuwa-5"
            },
            "answer_text": "It's hard to know if someone is tracking u, so just turn of ur location ",
            "date": "Answered July 7, 2020",
            "views": "194",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Harish Agawane",
                "href": "/profile/Harish-Agawane"
            },
            "answer_text": "have you even seen google notification on your phone ? we all been tracked all the time. Visit My Blogs : Home - Technology Tangle Harry's Life Free Job Posting : People Hunt ",
            "date": "Answered May 28, 2018",
            "views": "735",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suraj Pattanayak",
                "href": "/profile/Suraj-Pattanayak-4"
            },
            "answer_text": "everyone can known their device traced by someone, if your mobile phone location is Automatically turned on,before You would have already off the location. ",
            "date": "Answered December 3, 2017",
            "views": "871",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thompson B. Zachariah",
                "href": "/profile/Thompson-B-Zachariah"
            },
            "answer_text": "Thanos Not Realising He didn’t have the gems. How the hell can you not realise you don’t have the gems when You WILL feel it’s power circulating in your body.  Thanos not even knowing the gems isn’t there is kind of stupid.  We can clearly see that this THANOS KNEW he had no gems… THE CREATORS WANTED THIS DUDE TO LOSE SO BAD… When they changed his angle to show him up close. it has the hand angled differently… I see you MCU. Thought no one would spot it? I knew it the moment i saw it. Made no sense.   It’s sad. No way THAT THANOS would NEVER know the gems weren’t there. Thanos isn’t this CARELESS.  And You are telling me while Everyone was chasing and beating Thanos for the gauntlet and while Iron Man Charged up for a good 10 secs. Thanos watched like he couldn’t do shit? Man…. Thanos would’ve rushed Iron Man so hard. No way did Thanos have his ambition to kill half the universe to just be gone like that. Thanos wasn’t even injured or anything. His WTF moment stopped him? Made no sense.  ALL i have to say is PLOT ARMOUR. We all know Barely anyone in the Avengers could’ve beaten this guy single handedly. It’s sad… Real Sad…  Wanted Thanos to win… It’s whatever…. ",
            "date": "Answered December 13, 2019",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arun Prakash",
                "href": "/profile/Arun-Prakash-336"
            },
            "answer_text": "Only one way to avoid your screen monitoring….. is to download Third party apps to control your internet data… then your spy will difficult to get a data from you… Eg; dataeye app (didn't allow data to spy app) ",
            "date": "Answered October 3, 2017",
            "views": "677",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Lloyd",
                "href": "/profile/John-Lloyd-43"
            },
            "answer_text": "I’d leave it at home or put it in someone else’s car and let it go where they go. ",
            "date": "Answered March 11, 2017",
            "views": "123",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Robles",
                "href": "/profile/Larry-Robles"
            },
            "answer_text": "Pls.write here your answer and explanation, this problem. Tnx. To guide and support me this. Solution and solving problem. ",
            "date": "Answered November 23, 2017",
            "views": "797",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lisa Reyna",
                "href": "/profile/Lisa-Reyna-14"
            },
            "answer_text": "You can find out ask her ? ",
            "date": "Answered August 6, 2018",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Purtle Ryan",
                "href": "/profile/Purtle-Ryan"
            },
            "answer_text": "Who is tracking your phone? ",
            "date": "Answered August 12, 2018",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ryan Horton",
                "href": "/profile/Ryan-Horton-27"
            },
            "answer_text": "If you have an iPhone then yes ",
            "date": "Answered April 29, 2018",
            "views": "394",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Donn Mcfall",
                "href": "/profile/Donn-Mcfall"
            },
            "answer_text": "CALL YOUR PROVIDER ",
            "date": "Answered April 28, 2019",
            "views": "126",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chan Pion",
                "href": "/profile/Chan-Pion"
            },
            "answer_text": "Yes, I know but many needed me. ",
            "date": "Answered October 6, 2017",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James McCarty",
                "href": "/profile/James-McCarty-35"
            },
            "answer_text": "HOW! ",
            "date": "Answered February 4, 2019",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gilbert Lye",
                "href": "/profile/Gilbert-Lye-1"
            },
            "answer_text": "Yes ",
            "date": "Answered August 12, 2018",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adan Rameriz",
                "href": "/profile/Adan-Rameriz"
            },
            "answer_text": "Plz ",
            "date": "Answered May 1, 2019",
            "views": "132",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Varsha Chinky",
                "href": "/profile/Varsha-Chinky-1"
            },
            "answer_text": "No ",
            "date": "Answered August 9, 2018",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fiona Smith",
                "href": "/profile/Fiona-Smith-105"
            },
            "answer_text": "Yes ",
            "date": "Answered October 24, 2017",
            "views": "127",
            "upvotes": "0"
        }
    ]
}