{
    "title": "How to stop being dependent on modern technology, such as a mobile phone or laptop - Quora",
    "tags": [
        "Dependency",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth ‘Lizbeth’ Thornton",
                "href": "/profile/Elizabeth-Lizbeth-Thornton"
            },
            "answer_text": "This may be a time that you will have to monitor yourself. I would research methods other people have found successful. Know also that there doubtfully there will be a one stop solution. “Device” attachment is not your dilemma only and it does not sound like an easy mountain to climb. I began to implement small scale rules that helped my daughters..no cell phone texting in car...No phones at meals, things like that. I watched a cousin drive up from Florida for Thanksgiving but spent the entire visit on his phone. That “dog won’t hunt” here. Best of luck to you..I really wish you well. ",
            "date": "Answered April 10, 2019",
            "views": "105",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alexandra Wolf",
                    "user_href": "/profile/Alexandra-Wolf-9"
                },
                {
                    "user_id": "Michael Nagle",
                    "user_href": "/profile/Michael-Nagle-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rhys Wilson",
                "href": "/profile/Rhys-Wilson-12"
            },
            "answer_text": "you need to build resilience without it. Do you rely on your calendar on your phone? Keep a diary. Do you wake up to an alarm? When was the last time you woke up to your local area breakfast show? How many times do you send an email to your boss or colleagues? Go and talk to them and get their thoughts in real time. quite simply don't take the easy immediate response. Go and find the person don't just look for the mailbox ",
            "date": "Answered September 10, 2017",
            "views": "136",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Romhay Zbello",
                    "user_href": "/profile/Romhay-Zbello-1"
                }
            ]
        }
    ]
}