{
    "title": "How can we improve energy efficiency? - Quora",
    "tags": [
        "Energy Efficiency"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ned Ford",
                "href": "/profile/Ned-Ford"
            },
            "answer_text": "This is going to be a very short answer for a very large topic. Google ACEEE. The American Council for an Energy Efficient Economy is the premier advocate for efficiency in this country, and collates and consolidates a lot of the best thinking globally on the subject of efficiency. In the U.S. we basically have two major approaches to efficiency implementation, and a larger number of less well appreciated avenues to promote research and development. Our utilities run efficiency programs. The programs are expected to demonstrate cost-effectiveness through proper use of a few standardized economic tests. The implementation is left to state policy or the individual utility, and it is pretty good, but there are some exceptions. More important than the exceptions, the utilities spend about $8 billion per year and create savings worth about $30 - $35 billion per year. Each year’s savings installs hardware which lasts anywhere from a couple of years to a couple of decades. You can also google Consortium for Energy Efficiency, but their reports are less helpful to the layperson than ACEEE and some other organizations. The other major approach is Federal appliance and energy standards. These standards are a group of policies, not a single set or organized program, and they affect everything from vehicles to lightbulbs. Federal standards are raised when all major manufacturers have the ability to produce a competitive product that meets a proposed new standard, and the standard guarantees economic savings in excess of any added cost. Often the act of setting the standard causes the cost of the more efficient product to drop toward the price of the less efficient product which was displaced. Refrigerators are one of the best examples, but these standards have affected the majority of appliances and home energy-consuming products over the years. In 2019 the utility programs are savings approximately twice as much as the Federal standards in terms of new reductions per year. It is best to regard the utility programs as driving efficiency, while the Federal standards sweep up the bottom of the barrel by eliminating the worst products. Some technologies thrive and become more efficient without standards. Some technologies and practices are pretty far out of the experience of ordinary people, such as increased efficiency for generators, transmission equipment, and smart grid management of voltage on transmission lines. And efficiency gains are a constant objective for wind and solar manufacturers. You can spend a lifetime learning about efficiency. I know because I’ve been doing it for 35 years. ",
            "date": "Answered June 17, 2019",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nijeesh",
                "href": "/profile/Nijeesh"
            },
            "answer_text": " Energy consumption is alarmingly rising in recent times. It can no further be blamed on high officials or other entities for not being responsible and protecting the environment and it's valuable resources. it time that environment protection becomes an household thing and responsibility of every individual. Of the major issues that are of high concerns are clean uncontaminated and usable water, energy driven from non-renewable resources, global warming, etc. With few basic steps at every household, we can actually take a big leap in go green movement. Likewise there are many products available in the market that will help you practice and implement it little effort. Say for example, all house lights up minimum of 3 lights, but we have never thought how we can save on the energy, with this. If we replace these with LED lights, we can definitely improve in energy efficiency. You are not only improving energy efficiency using an LED, but this also gives you great savings. LED lights save an extra 5% and have 25 times longer life than other lights. There are #way bulbs also available in the market that will consume as less as 80% lesser energy than incandescent bulbs. So we can definitely improve energy efficiency using LED lighting and also make a move towards saving the environment. Read more: http://anchor-world.com/blog/energy-efficient-led-lighting/ ",
            "date": "Answered October 27, 2017",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Smith",
                "href": "/profile/Richard-Smith-818"
            },
            "answer_text": "High school Question Alert. When you assert “our energy” what are you referring to? Your contry’s natural energy? Or the worlds’? Since Quora does not know directly where “our” is, some assumptions need to be made. One way to be efficient with our energy is not to waste it. Simple as that.  Eric Mariasis asked this question: How can we best be efficient with our energy? ",
            "date": "Answered June 17, 2019",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepak Deopa",
                "href": "/profile/Deepak-Deopa-7"
            },
            "answer_text": "According to any Rankine Cycle there are basically two meathods to improve efficiency To increase themean temperature of the steam before it reaches to the turbine.Decrease the temperature of the condenser.",
            "date": "Answered May 7, 2018",
            "views": "45",
            "upvotes": "0"
        }
    ]
}