{
    "title": "How long do computers last these days before becoming obsolete? - Quora",
    "tags": [
        "Consumer Technology",
        "Obsolete Technologies",
        "Obsolescence",
        "Desktop Computers",
        "Personal Computers",
        "Technology Trends",
        "Laptops",
        "Computer Hardware",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaime Torres",
                "href": "/profile/Jaime-Torres-68"
            },
            "answer_text": "If you buy a low end computer it’s arguably obsolete from the start. It’s not powerful enough to provide a good experience for today’s technologies. If you, however buy a high end computer today, it will fail long before it becomes obsolete for stuff that you can do with it now. However what usually happens is in 10–15 years time technologies have advanced so much that computers made now will be too slow to handle them. In addition, if a specific part fails, after 5–15 years you may have trouble buying it on the second hand market, so a lot of people decide to buy a new computer instead of bothering with second hand parts. If you bother fixing and maintaining them and maybe stock up on some second hand parts when you see them start running out, you could use your computer for 20–25 years even, before it becomes something people will laugh at, like Windows 95 is today. I’m sure there’s still some people in the world using computers from the 90’s with Windows 95 on them. ",
            "date": "Answered October 7, 2018",
            "views": "798",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Kado",
                "href": "/profile/Chris-Kado-1"
            },
            "answer_text": "Largely depends what you use it for and what kind of computer it is My current pc is a Lenovo I bought on Ebay over 10 years ago,I believe it was 3-4 years old when I bought it.8GB ram and 1TB hard drive,Win 7. I have reinstalled the OS a couple of times and replaced the video card,but everything is still running strong. My computer does everything I need it to do,and I havent had any issues.If this one breaks down Ill just go to the local electronic recycling thrift store and get a new one. Just because companies like Apple release another thousand dollar piece of plastic every year doesnt mean we should throw away our money when our old stuff still works. ",
            "date": "Answered October 7, 2018",
            "views": "598",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Don Shiner",
                    "user_href": "/profile/Don-Shiner"
                },
                {
                    "user_id": "Joseph o'Loughlin",
                    "user_href": "/profile/Joseph-oLoughlin-1"
                },
                {
                    "user_id": "Robert Gilsdorf",
                    "user_href": "/profile/Robert-Gilsdorf-1"
                },
                {
                    "user_id": "Darryl Gardner",
                    "user_href": "/profile/Darryl-Gardner-2"
                }
            ]
        }
    ]
}