{
    "title": "How much more can humanity advance in terms of technology? - Quora",
    "tags": [
        "Technology Trends",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "All past and present ages might amount to this: Archaic Memory and Divination.Subtle Power and Prophecy.Mechanical Knowledge. ←(Recently: You are here)These further ages might be predicted: Abstraction Interface.Interior Room Logic.Alternative Location.Self-Swallowing Problem.Identical Re-Identification Solution.Objective pattern formation, fascetation, rarification, and manifestation. (73 characters).Complete thought formation, parsing, and meaningful application. (64 characters).Improvements in intuitive and irrational reality. (48 characters).Integration of ideal environments. (32 characters).Attempt to make idealese. (24 characters).Collaboration to create meaningful environments. (48 characters).Attempt to solve the higher questions of existential dimensionism. (64 characters).Denominations of magical culture & acculturation. (48 characters).Semi-paradisal existence. (24 characters).Many orders of magical and manifestual symbolism. (48 characters).Transcept-tower holding between layers of coherent metaphysical dimension. (72 characters).Transcendent truth as phenomenal living thoughts. (48 characters).The biological immortal AND / OR Immortal living thought (each 24 characters).Lives in a universe of purely eternalized ideas. (48 characters).If this is the case, I have predicted the next 20 ages of technology! However, if I am correct about perpetual motion, there will be a degree of unpredictability past the point of inventing it, as it will open avenues to many new areas of research. PERPETUAL MOTION As of right now as far as I know, complete perpetual motion hasn't been built yet. However, some of my experiments indicate up-and-down movement from rest with no batteries or magnets. Designs:   The diagrams are basically free to build and develop. However, I cannot provide money. Some sort of prize or royalties are recommended to be given to me, but only if one or more of my designs works with profit. MY SUCCESSFUL OVER-UNITY EXPERIMENT 1, SUPPORTING THE SECOND DEVICE ABOVE, YOUTUBE:  SUPPORT FROM SCIENTISTS “Say, you talk about pulling something up an inclined plane with an equal weight. You're right. This is possible. And not at all a violation of conservation of energy.” —Ian Switzer, CEO of a Cornell engineering company THE 1ST OR 2ND SCIENTIFIC PROOF OF PERPETUAL MOTION Legal Questions Concerning Nathan Coppedge ",
            "date": "Answered March 1, 2018",
            "views": "244",
            "upvotes": " Answer requested by Sarah Millard"
        },
        {
            "author_info": {
                "name": "Charles Barnard",
                "href": "/profile/Charles-Barnard-2"
            },
            "answer_text": "Technology means tools. The limits of tools are the limits of physics. There is no reason to believe we are unable to: Perform whatever desired changes on the molecular level, when and where want them. Manipulate large masses to rearrange stellar systems or even galactic clusters. And everything in-between. But whether we do or not, is up to us. To date, we have done an awful job of predicting the side-effects of our technologies in use, particularly when scaled up. Nanotech Ethics studies were begun almost as soon as nanotechnology became known to the public was because K. Eric Drexler immediately saw the huge potential for damage by the use or abuse of the technology years before he published. In the ancient past we have caused huge devastation because of such ignorance. the well-known rocky crags and desert across the Mediterranean, North Africa, Lebanon, Syria, Iraq were all once covered in dense forests, and much of it was turned to desert directly by people doing exactly as they are today in the Amazon. It is our desires, rather than our needs which tend to push invention, along boredom, curiosity and many other factors, and those tend to push technology. ",
            "date": "Answered June 23, 2019",
            "views": "70",
            "upvotes": "0"
        }
    ]
}