{
    "title": "How to start learning MySQL - Quora",
    "tags": [
        "PHP MySQL",
        "Learning PHP",
        "Beginning Computer Programming Advice",
        "MySQL",
        "PHP (programming language)",
        "Learning New Things",
        "Learning",
        "Learning to Program",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Umair Abid",
                "href": "/profile/Umair-Abid"
            },
            "answer_text": "May be not even a lifetime, the question appropriate question should be \"when you can become comfortable with MySql\". Well, time is not really a constraint here, it all depends upon how quickly can you grip the basic concepts of mysql. If you have no prior experience of working with any relational and structural database then start learning from the basic in following order. How to create database in MySql?How to create tables in database and columns in table?What is primary key in a MySql table?What is a unique key in MySql table? At this point you should also become famililar with some datatypes of columns. When you are done with creating stuff you should move to next milestones. like How to insert a row  in table?How to select all rows from table?How to select limited rows from table?How to change order of selected rows?How to select rows from table having specific column(s) value(s)?How to group the selected rows of table? How to select rows from two or more tables?How to join two tables? At this point you should know about Left Join, Outer Join, Inner Join. When you will be done with selecting rows or data from tables you should proceed further by learning, How to update a row  in table?How to delete a row in table?How to Alter table in database? When you will be able to answer or know the answers of all above questions, you will know pretty much all the basic stuff of Mysql. Some advance concepts of MySql are stored procedures, triggers, constraints you can look into them too, to have a string grip over mysql. ",
            "date": "Answered June 19, 2014",
            "views": "142",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tandra Bilas",
                    "user_href": "/profile/Tandra-Bilas-1"
                },
                {
                    "user_id": "JoJo",
                    "user_href": "/profile/JoJo-986"
                },
                {
                    "user_id": "Dhawan Rohith",
                    "user_href": "/profile/Dhawan-Rohith"
                },
                {
                    "user_id": "Vadiraj RK",
                    "user_href": "/profile/Vadiraj-RK"
                },
                {
                    "user_id": "CH Praneeth",
                    "user_href": "/profile/CH-Praneeth-1"
                },
                {
                    "user_id": "Balaji Ranganath",
                    "user_href": "/profile/Balaji-Ranganath-1"
                },
                {
                    "user_id": "Mrinalini Sen",
                    "user_href": "/profile/Mrinalini-Sen-6"
                },
                {
                    "user_id": "Prince Jain",
                    "user_href": "/profile/Prince-Jain-447"
                },
                {
                    "user_id": "Feifan Lin",
                    "user_href": "/profile/Feifan-Lin-3"
                },
                {
                    "user_id": "Vasu",
                    "user_href": "/profile/Vasu-212"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shaikh Bilal Mehmood",
                "href": "/profile/Shaikh-Bilal-Mehmood"
            },
            "answer_text": "MySQL is the most popular Open Source Relational SQL Database Management System. MySQL is one of the best RDBMS being used for developing various web-based software applications. MySQL is developed, marketed and supported by MySQL AB, which is a Swedish company. This tutorial will give you a quick start to MySQL and make you comfortable with MySQL programming. To learn properly MySQL, Holberton School provides very advanced levels of learning and variety of options to learn the language. There are basic steps need to be done which are the following: 1. Create a database 2. Creating Tables: In the database, you can have many tables, and each table is a grid with information held in cells on the grid. You need to create at least one table to hold data in your database. In the area labeled \"Create new table on database [your_database_name],\" enter a name (for example: address_book) and type a number in the Fields cell. Fields are columns that hold information. In the address_book example, these fields hold first name, last name, street address and so on. If you know the number of fields you need, enter it. Otherwise, just enter a default number 4. You can change the number of fields later. Click Go. 3. The Data: Now that you have created a database, you can enter data directly into the fields using phpMyAdmin. Data in a table can be managed in many ways. A tutorial on ways to add, edit, delete, and search the information in your database gets you started. 4. GET RELATIONAL: This means the data from one of your tables can be used in conjunction with data on another table as long as they have one field in common. This is called a Join, and you can learn how to do it in this MySQL Joins tutorial. 5. WORKING FROM PHP: Once you get the hang of using SQL to work with your database, you can use SQL from PHP files on your website. This allows your website to store all its content in your database and access it dynamically as needed by each page or each visitors request. ",
            "date": "Answered May 12, 2017",
            "views": "71",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacquel Blue",
                    "user_href": "/profile/Jacquel-Blue"
                },
                {
                    "user_id": "Richard Sunderland",
                    "user_href": "/profile/Richard-Sunderland-4"
                },
                {
                    "user_id": "Alex Collins",
                    "user_href": "/profile/Alex-Collins-112"
                },
                {
                    "user_id": "Praveen Praveen Swengineer",
                    "user_href": "/profile/Praveen-Praveen-Swengineer"
                }
            ]
        }
    ]
}