{
    "title": "How to make a basement in an existing house - Quora",
    "tags": [
        "Basements",
        "Residential Construction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kim Mulligan",
                "href": "/profile/Kim-Mulligan-10"
            },
            "answer_text": "This is done quite often in Seattle. The whole city is built on glacial till and therefore no bedrock gets in the way. Much as described, the systems are separated from the foundation, railroad ties are stacked like lincoln logs underneath the structure and the house is raised over the ties and the ground is dug out by hand with a conveyor belt or a small excavator. In a city where land is scarce, people are doing this to add an extra floor and square footage to their homes. It can be dangerous. One basement on my block was done without permitting and the workers were under a house when the shoring collasped. Luckily no one was seriously injured and the remodel was red-tagged. It was an expensive shortcut for the homeowners and it could have been much worse. Make sure an expert is involved in the process. It’s a lot of work. ",
            "date": "Answered January 28, 2018",
            "views": "764",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kyle Smith",
                    "user_href": "/profile/Kyle-Smith-208"
                },
                {
                    "user_id": "John White",
                    "user_href": "/profile/John-White-363"
                },
                {
                    "user_id": "Scott Pedoto",
                    "user_href": "/profile/Scott-Pedoto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Ting",
                "href": "/profile/Joe-Ting-1"
            },
            "answer_text": "This is not a do-it-yourself project. It may not even be possible. Houses with existing basements sometimes collapse when people try to make the basement deeper by a few feet. The expensive option is to hire a house mover to move the entire house, hopefully close by. You then hire someone to dig out a hole and construct a basement in the same shape as the existing house and in such a way that the house can then be moved back over your new basement. As this is very expensive, this is reserved for houses of historical importance and for houses that are given away ‘for free’ just to remove it from the site, the land being much more valuable than the house. It is almost always cheaper to demolish and then build an entirely new house complete with basement. ",
            "date": "Answered January 27, 2018",
            "views": "499",
            "upvotes": "0"
        }
    ]
}