{
    "title": "How is technology disrupting your industry? - Quora",
    "tags": [
        "Disruption (business)",
        "Disruptive Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Seewack",
                "href": "/profile/David-Seewack"
            },
            "answer_text": " If you want to be successful in business, you should always be reinventing yourself. This is my core business philosophy. And it’s one of the main reasons why I decided to start an e-commerce company in an old-school industry, heavy duty truck parts, which is historically 10-15 years behind the auto parts industry. Because I know everyone who tries to fight against—or fails to adapt to—changing times always loses. Of course, there are endless examples of this, but Sears, Roebuck and Company (better known simply as Sears, the once-great American department store) always comes to mind. For a long time, Sears dominated the American retail landscape—it seemed like everyone bought everything from their catalog. But then the digital revolution and e-commerce came about, and Sears quickly fell behind. And today, while Sears is still hanging on by a thread, consistent waves of store closings and a total of $11 billion in losses since 2010 suggest the company’s days are numbered. Surely Amazon hasn’t helped, but Sears didn’t help itself, either, by stubbornly sticking to its old-school methods and neglecting to implement an effective digital strategy. Of course, there are plenty of stories that offer a similar warning. I’ve read enough of them to convince me to be an early adopter of technology throughout my career. For example, I digitized my company’s record-keeping and put GPS in my trucks in the early ‘90s, well before either of those technologies were commonplace. I’ve found that if you do a bit of research, you’ll almost always find that there’s a smarter, better, faster, more user-friendly option for nearly anything your company does, available via technology. Currently, I’m looking into how I can streamline things on both the consumer and supplier end. Right now, a lot of innovation caters to the increasing customer demand for immediacy. In other words, because of technological advancements, everyone wants everything now. So we’re all trying to keep up and speed up how we get our products and services to our customers. That’s a universal business trend. But more specifically to truck parts, there are plenty of ways technology is already changing or will soon change how we do things. And there are endless opportunities to optimize everything we do, from shipping to sales. These are some of the technologies I see changing the industry: Predictive inventory replenishment. Modern software applications can predict and plan for preventative maintenance. What if a fleet manager could know when it was time to replace a truck part before it actually broke? They could then order the parts proactively, have it ready to go when they need it, and avoid an out-of-commission truck sitting around for a week or longer while they wait for a delivery. Customers should have the necessary information to make better choices and get what they need faster.Mobile everything. You want everything about your website to be usable on mobile. If you own a repair shop, you can walk and scan your shelves, figure out what you need more of, order those parts, and know where they are, right in the palm of your hand.A full-service catalog for the whole industry. Right now, only OEMs know what parts are on each specific truck, and WDs have to access each individual manufacturer’s website in order to look up parts. So counterpeople have to visit multiple e-catalogs to find the parts required for a job. I’d like to see that change. My company, FinditParts, has built the largest collection of parts on one site, where you can look up any part by part number or any other cross-reference. My goal is to build the best electronic catalog in the industry, so customers don’t have to scour multiple catalogs to find what they’re looking for.Speeding up the training of new people in the industry. This old-school industry moves slow—and that extends to how long it takes to train new folks. I’d like to see digital tools speed up the training process. For example, our e-catalogs enable a new hire (or really anyone with a computer) to look up even the most complex parts by answering a few simple questions. Our lookup tool enables people to search for a part by number, then view its image to confirm it’s the right one.Trucking is an old-school business with a lot of smart, talented people who’ve been working in it for decades. But I fear many of them aren’t ready for what’s about to happen as digital trends gain momentum. For example, at the trucking conferences I attend, the speakers talk about these changes like they can worry about them next year, or even a few years down the road. But the world changes so fast now. And for that reason, the time to not only think about, but act on, these technology-driven changes is now. ",
            "date": "Answered March 14, 2019",
            "views": "1514",
            "upvotes": " View 329 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Subramanian Kathirrvelu",
                    "user_href": "/profile/Subramanian-Kathirrvelu-1"
                },
                {
                    "user_id": "Saurav Saha",
                    "user_href": "/profile/Saurav-Saha-58"
                },
                {
                    "user_id": "Gondaliya Nikhil",
                    "user_href": "/profile/Gondaliya-Nikhil"
                },
                {
                    "user_id": "Nikhil Raj",
                    "user_href": "/profile/Nikhil-Raj-245"
                },
                {
                    "user_id": "Marek Šperlich",
                    "user_href": "/profile/Marek-Šperlich"
                },
                {
                    "user_id": "Husnain Khan",
                    "user_href": "/profile/Husnain-Khan"
                },
                {
                    "user_id": "Vaibhav Goel",
                    "user_href": "/profile/Vaibhav-Goel-73"
                },
                {
                    "user_id": "Rahul Sharma",
                    "user_href": "/profile/Rahul-Sharma-10775"
                },
                {
                    "user_id": "Nithila Baskaran",
                    "user_href": "/profile/Nithila-Baskaran-1"
                },
                {
                    "user_id": "Abhinav Jain",
                    "user_href": "/profile/Abhinav-Jain-119"
                }
            ]
        },
        {
            "author_info": {
                "name": "Koen Broumels",
                "href": "/profile/Koen-Broumels"
            },
            "answer_text": "Not enough yet. Although I can see that ML mixed with smart cities are some of the things that could disrupt our work in municipalities.. Drone inspections, lidar for building or display/sign management.. Next would be mobility as a service with autonomous vehicles.. we have quite a big income on parking fees that will evaporate when this will happen.. ",
            "date": "Updated June 10, 2018",
            "views": "86",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daljit Stewart",
                    "user_href": "/profile/Daljit-Stewart"
                }
            ]
        }
    ]
}