{
    "title": "How does scientific and technology development affect the society and the environment? - Quora",
    "tags": [
        "Environmentalism",
        "The Environment",
        "Society"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jay Trang",
                "href": "/profile/Jay-Trang"
            },
            "answer_text": "Many of the other answers suggest technological innovation is a double-edged sword in the sense that there’s a gain in productivity yet more problems that come with it. While I wouldn’t dispute this claim completely, it’s wrong to think that we should cease to develop technology to solve our problems. In fact, if we cease to develop technology, the current issues we have will never be solved. Ideally, innovation leads to a technology with more benefits than a previous technology with lesser issues down the line. Take transportation. Not counting walking, we started with horse-riding. Horses can travel faster than a human can, but raising a lot of horses at once isn’t very cost-effective. Moreover, there is pollution from manure and horse fart everywhere. Then, we had cars. They can travel so much faster than horses that we actually measure their power as “horsepower.” (Go figure.) Now, cars do emit some gases, but if you measure how much gases are emitted per mile, it’s no contest. Petrol-powered cars win. Now, we are heading into an electric car age. Now, there is no more gases coming out of the tailpipe. The only issue is where the electricity is coming from, but as we know, there are a lot of zero-emissions, renewable energy sources developed right now. (Think solar, wind, geothermal, etc.) Something else to note, when technology develops, any issues that come up won’t be ignored, contrary to popular belief. Innovation requires engineers to look for any means to improve a technology by any means feasible. However, some engineers may think that some problems, such as zero-emissions or some other kind of regulation, will either hold them back, won’t fit their budgets and timelines, or is simply not feasible. There’s no need for sorrow here since there are many different kinds of engineers each solving their own set of problems, meaning there’s always a team of engineers who are working on any issue you can name. TL;DR, Technology doesn’t bring problems. It brings responsibilities. ",
            "date": "Answered July 26, 2018",
            "views": "62",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arjay Marangga",
                    "user_href": "/profile/Arjay-Marangga"
                },
                {
                    "user_id": "Maria",
                    "user_href": "/profile/Maria-2138"
                },
                {
                    "user_id": "Farag Ali",
                    "user_href": "/profile/Farag-Ali-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ming Lou",
                "href": "/profile/Ming-Lou-4"
            },
            "answer_text": "Science and technology are the main drive of the productivity but if they are used for the wrong purpose of economy --- satisfy the ever growing material needs and wants of ever growing population, they are a destructive force for the limited real value on earth and a destructive force for human future. Only when science and technology are used for the correct purpose --- human perpetual survival into endless far future, they are a constructive force. Now the science and technology are used for making money, and regardless the pollution it caused and resources exhausted. How much science and technology are used for preventing pollution and resources overuse? Very little, because that doesn’t make money. Science and technology are the tools for human purpose. It is the human that use them, decide how science and technology affecting the society and environment. ",
            "date": "Updated July 9, 2020",
            "views": "145",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maryco Simon",
                    "user_href": "/profile/Maryco-Simon-1"
                },
                {
                    "user_id": "Rochelle Villafuerte",
                    "user_href": "/profile/Rochelle-Villafuerte"
                },
                {
                    "user_id": "Arjay Marangga",
                    "user_href": "/profile/Arjay-Marangga"
                },
                {
                    "user_id": "Frets Dirt",
                    "user_href": "/profile/Frets-Dirt"
                },
                {
                    "user_id": "Lisa Malabon",
                    "user_href": "/profile/Lisa-Malabon"
                },
                {
                    "user_id": "Maria",
                    "user_href": "/profile/Maria-2138"
                },
                {
                    "user_id": "Glenda Villamor",
                    "user_href": "/profile/Glenda-Villamor"
                },
                {
                    "user_id": "MB Kerubin Castillo",
                    "user_href": "/profile/MB-Kerubin-Castillo"
                },
                {
                    "user_id": "Ricky Cruz",
                    "user_href": "/profile/Ricky-Cruz-51"
                },
                {
                    "user_id": "PUBG MOBILE TROLLING",
                    "user_href": "/profile/PUBG-MOBILE-TROLLING"
                }
            ]
        }
    ]
}