{
    "title": "How does the US Supreme Court decide which cases to hear? - Quora",
    "tags": [
        "Judicial Branch of the U.S. Federal Government"
    ],
    "response": [
        {
            "author_info": {
                "name": "Monika Kothari",
                "href": "/profile/Monika-Kothari"
            },
            "answer_text": "This is a really important question, because unlike the lower courts, the Supreme Court has almost complete discretion in setting its own agenda. The Court receives thousands of petitions per term, and grants cert on maybe around hundred of them, or even less. So the Court's case selection process is critical, arguably even more important than its decisions on the merits. The cases the Court selects will define the questions and issues the Court will address that term. This is a pretty simplified answer, but I'll try to at least survey this huge topic. There are some vague \"guidelines\" that generally inform how or why the Court might grant cert on a particular case [1]: Two or more courts of last resort (U.S. courts of appeals or state supreme courts) rendered conflicting decisions on the same important federal question.[2][3]A court of appeals or state court made a decision with respect to an important federal question that conflicts with Supreme Court precedent.A court of appeals or state court made a decision with respect to an important federal question in an area that the Court has not adequately addressed in the past, but which should be settled or clarified.Note: the Court also has original jurisdiction in state v. state cases. Of course, these are only guidelines. In reality, the Court can grant or deny cert whenever it wants to, and for any reason. The process is quite secretive (for both practical and strategic reasons), and what we know about it is what the Justices or their clerks have chosen to reveal. Apart from the above criteria, the Court is more likely to grant cert when: The United States is a petitioner in the case. (The Court is tends not to ignore issues the Solicitor General wants resolved.)A lower court strikes down an act of Congress. (The Court sort of has to intervene here...)Lots of amicus briefs are filed. (This signals that people care about the issue and the case is important.)The case is a \"good vehicle\" for a particular issue. (The facts are clear, the question and conflict straightforward, no jurisdictional or other procedural problems.)The issue has sufficiently \"percolated.\" (It's an issue that's been widely discussed in lower courts, so that the most critical arguments are readily available to the justices.)Many other factors that I won't bother to list. (Gettin' lazy...)But ultimately, it's not that useful to think about how \"the Court\" selects cases when what we're really talking about are the decisions of nine individuals, with input from their clerks. Each justice has a different philosophy in how they approach case selection. Some, like Scalia, have been more upfront than others about how they vote. But as I mentioned earlier, it's a pretty secretive process overall, and there are institutional and individual steps involved: The clerks of the justices in the \"cert pool\"[4] divide up the new petitions for that week and write memos with recommendations, which are then circulated to the rest of the clerks and justices.The justices review the memos individually, and may do additional research on some cases if they feel it's necessary. They each decide which cases may merit further review and put these on the \"discuss list,\" which is circulated among the chambers.The justices go over the cases on the discuss list at that week's conference. (The cases that don't appear on the discuss list are automatically denied.) There isn't usually much actual discussion; the \"discussion\" generally consists of a vote.The Rule of Four applies, which means that only four justices need to vote in favor of granting cert. This allows less popular litigants to be heard, but may lead to bad, 5-4 precedent on the merits. (Surprisingly, that doesn't happen often.) This actually results in some interesting strategic choices on the part of the justices, which I'll discuss next.In theory, justices should vote to grant cert when they believe the lower court erred, and they want to reverse the decision. However, the role of the Supreme Court has moved away from correcting errors, and towards shaping the law in specific ways. Different judges have different ideas about how doctrine should develop, either based on ideological or jurisprudential views. This makes their voting strategies a lot more complicated. For example, a justice may want to reverse a lower court decision that she thinks is wrong. This suggests she would want to grant cert. But if she knows that at least five justices will disagree with her on the merits, she'll vote against granting cert, because she doesn't want to create bad precedent. This is commonly referred to as \"defensive denial.\"On the other hand, a justice that agrees with the lower court's decision normally wouldn't grant cert. But she may really want to affirm the decision, and create good precedent or even just write related dicta. If she believes at least four justices will agree with her on the merits, she might vote to grant cert with that intention. This is called an \"aggressive grant.\"At the same time, the justices (sometimes) try to balance their ideological inclinations with their ideas of what role an ideal judge would occupy: the neutral decisionmaker. They want to appear legitimate, and they want to be consistent with their own views on their institutional role. So a justice may back away from an issue that's too politically divisive. Or she may vote to grant cert on a case she doesn't like, or that she'll lose on the merits, because it's an area of law that needs to be addressed.Remember, the Court has absolute discretion in choosing its own agenda. Each justice knows what he or she wants to see on the docket for that year, and seeks out those specific questions and issues in the petitions. They also know what they don't want to deal with, and set those cases aside.The justices consider a host of other factors, e.g. how likely it is that a better \"vehicle\" will arise on the same issue, how Congress and the president might react to a case, what the political salience of the issue is, etc.Cases that are selected unanimously are often some of the most divisive on the merits.So once the voting is complete, those petitions that earned at least four votes are granted cert and eventually added to the docket, scheduled to be argued, decisions are rendered, etc. Of course, there are a few different things that could happen along the way, e.g. dissents to denial of cert (attempts to persuade other justices to grant cert), GVR (grant, vacate, remand), DIG (dismissed as improvidently granted - which is embarrassing for everyone), CVSG (call for the views of the Solicitor General), holds, and other responses. But this is the basic gist of it. [1] See Rule 10 of the Supreme Court Rules. [2] A federal question is one that pertains to the Constitution, a federal statute, treaties with other nations, etc. \"Important\" is undefined here, and the justices may have differing opinions about what is or is not important enough. [3] For example, the Court granted cert on Schuette v. Coalition because it was a case where the 9th Circuit and 6th Circuit had ruled differently on exactly the same constitutional issue. [4] All of the justices except Alito are members of the cert pool. Traditionally, it's seen as a good idea to have at least a couple of pairs of eyes go over all the petitions. ",
            "date": "Answered January 23, 2014",
            "views": "428",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Curtis Fettinger",
                    "user_href": "/profile/Curtis-Fettinger"
                },
                {
                    "user_id": "Gerry Surette",
                    "user_href": "/profile/Gerry-Surette-1"
                },
                {
                    "user_id": "Jan Schmidt",
                    "user_href": "/profile/Jan-Schmidt-44"
                },
                {
                    "user_id": "Kenneth L Byrd",
                    "user_href": "/profile/Kenneth-L-Byrd"
                },
                {
                    "user_id": "Tim Tuttle",
                    "user_href": "/profile/Tim-Tuttle-6"
                },
                {
                    "user_id": "Mark-Anthony Canty",
                    "user_href": "/profile/Mark-Anthony-Canty"
                },
                {
                    "user_id": "Jonell Restivo",
                    "user_href": "/profile/Jonell-Restivo"
                },
                {
                    "user_id": "Debbie Bell",
                    "user_href": "/profile/Debbie-Bell-7"
                },
                {
                    "user_id": "Scott Borden",
                    "user_href": "/profile/Scott-Borden-1"
                },
                {
                    "user_id": "Vishnudas Pai",
                    "user_href": "/profile/Vishnudas-Pai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan MacNeill",
                "href": "/profile/Alan-MacNeill"
            },
            "answer_text": "The Supreme Court does, in 90+% of the cases (*) The way it works is (generally, there are exceptions) like this: A Court of Appeals writes a decision on a case of controversy, the losing side of that decision doesn’t like it.That side files a document with the Supreme Court requesting a “writ of certiorari”, basically, they are asking the Court to take the matter under review, which they do by demanding the Appeals court “Send them the record”.The requests are not vetted directly by the Justices, they are reviewed and summarized by their law clerks. Many Justices split this duty, via a mechanism “the cert pool”, whereby the cases are reviewed by only one or two of the clerks between all of the Justices participating in the pool. The clerk summarizes the argument, cites relevant precedential law, and provides other backup in a one page (give or take) summary page.All received requests are reviewed at a weekly (during the Court’s Session, usually October - late May/early June) meeting which contains only the seated Justices (not even secretaries or clerks are present). The Justices are polled for their opinion on issuing the writ. If four agree, the writ is issued and the case is (tentatively) docketed (it can be removed from the docket later if circumstances change).Justices do not have to believe the case needs reversing to approve the cert. They may want to reinforce the opinion of the appeals court, they may feel the need to resolve a discrepancy between two separate circuits, etc.(*) There are a few, relatively rare, circumstances where the Supreme Court is forced by the Constitution or by Law to take cases directly. Specifically Article III, Section 2, Clause 2 states “In all Cases affecting Ambassadors, other public Ministers and Consuls, and those in which a State shall be Party, the supreme Court shall have original Jurisdiction”. Additionally, Congress can (although they rarely do) specify that any disputes regarding a specific point of law can be “fast tracked” to the Supreme Court in legislation. Neither of these happen very often at all, basically once every few years. ",
            "date": "Answered December 26, 2017",
            "views": "852",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Walter Holtgrefe",
                    "user_href": "/profile/Walter-Holtgrefe"
                }
            ]
        }
    ]
}