{
    "title": "How has solar technology progressed over the past decade? - Quora",
    "tags": [
        "Solar Technology",
        "Solar Panels",
        "Solar Energy",
        "Sustainable Technology",
        "Alternative Energy",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Howden",
                "href": "/profile/Patrick-Howden"
            },
            "answer_text": "Cost per watt s far cheaper than when I got our 46 watt panel in 1985, but also the cost per total solar power house needed can br radical cheaper if you do the right thing as follows: Far better than 120 or 240 volt ac systems, TOTAL 12 VOLT dc Appliances driven by a small 46 watt Solar panel driving old car battery OFF-GRID with POWER DISTRIBUTION BOARD - cost could be about $300 off-Grid: powerful blender from a SMALL starter motor - homemade 12V rheostat bed warmer - reduced jug element to heat thermos water for coffee etc (never needed to boil) - direct solar water-heating & cooking if not wood stove - long life economical LED lights - 12 v TV + Antenna + cassette + instruments, games & toys + 2-way radios, players, CB and/or mobile radio, video / audio spy pen - There are two automobile Vacuum cleaners: one from the dump draws 1.8 amps, the other monster with attachments draws a whopping 7.8 amps & what a racket, both can act as air pumps for laundry on pipe reversal; or manual carpet-floor sweeper. House yachting submersible bilge pump + tiny check valve for rain tank & dam, mosquito & cockroach zapper, sewing machine, brilliant economical LED lights, flash-gun. 12 volt drill + screw-driver + many tools medium drill & attachments (jig, circular saw, sander, plane, grinder & kitchen items like mixers), micro tools, 12 v 30w solder iron, 24 volt welding from 2x12v batteries in series etc. Alternative laundry including 12volt vacuum cleaner bubbles in laundry bin water, hand or motor-rotated hot water pressure laundry, esky of laundry water on scooter or bike or boat trip, or standing on laundry in bowl whilst showering - ironing under mattress. Better than so-called “Rocket or Dakota Stoves” (though these could be considerably likewise improved with following HELIXTOVE), small smokeless controllable one-stick HELIXTOVE stove that has air-preheating & after-burning + tiny fan if extra rocket-heat needed. Bush oven sits on top. Prize-winning homemade 25yo, 3-wheel, dual, 1/4hp, 1WD, 40kg solar TRICAR needing no rego, licence or insurance on roads (not motorways), uses small gel car battery. SMALL ITEMS (some items worked from attached small solar panel without battery, though windup better in emergency): VOLTAP diode chain for items < 12 volts - `` tiny brilliant torch that needs only about 1 squeeze per week, shaver, calculators, stirrer, 3 clocks, watch, doorbell. Hose-reel garden pump where small solar panel drives its windscreen wiper motor directly - if not driven by a stream or wind - to drip-feed food plants. Blackout Kit = 12 volt battery charged by mains if you on grid, able to power small TV, fans, radio, mobile phone, camera, LED lights but $30 gets garden-charged & switchable Solar LED lamps for inside & emergency. INVERTER on Solar car battery for machines such as: mini microwave cooker, also to produce 240 or 120 V to drive mains adaptors to charge scooter, & other batteries for whipper snipper, chain saw, saw, tyre pump, hedge trimmer converted to a lawn mower + brush cutter with handle & 2 trolley wheels, Computers & Printers, table lamps. Bed Hot water bottle like 2 litre drink bottles heated by microwave etc to avoid water waste. KEEP COOL: We hand-spray our T-shirt with water, then have a small fan playing on the moist T-shirt in real heat waves, that usually gets too cold & we have to slow or redirect the fan. With 2 or 4 watt car fan playing on bare legs is much cooler than if fan playing on face, arms etc; fans can often save more than ½ air conditioning power that we find unnecessary even in Queensland. For low-humidity areas we have a tiny 12volt water evaporator; big home units are very economical & take little power to supply cool air ducted around to each room. For outside in the sun, my favorite is a white hat topped with a small solar PV panel powering a cute little fan built into the front brim. Air Conditioning: Simply have a fan blow air into a bucket of ice if available. Cool water drinks help + cool water swim or garden hose spray. All these replies are using the wrong type of inefficient fridge. Our old unit ``TOP-LOADING FRIDGE: Homemade most efficient 40L plastic trash drum = 12 volt, 2.3 average-watt unit under house, in breeze & shade + part-buried & never in hot kitchen, with 15 cms polyurethane foam all around; uses 30 times less annual energy than other fridges + good ice maker. Power from a car battery used for entire 12-volt house that is charged by the 46 watt solar panel. Fridge takes about 2 days to cool down. In cool climates, this outside fridge can be permanently off during winter. The unit uses a 12 volt DANFOSS Danish kit compressor system. TO KEEP WARM IN COLDEST WINTERS: 3 layers of box cardboard insulates on floors under carpets. Also on walls behind Book cases & cupboards against walls facing outside + in ceilings; there are millions needing it!!! Long socks on your hands are wonderful in bed etc. Hotwater bottle covered in a knitted bag keeps bed warm all night. Our 46 watt solar panel provides total house power including summer fridge, blender, fans, LEDs, pumps, TV & radio etc; but best of all a bed warmer comprising a rheostat - variable power resistor - inside a MILO or big coffee can which is placed in the bed. Save bathwater there till cold to warm house a little. In bed we have all 3 meals as well as watch TV, use computer & phone, read books, play & listen to music + radio etc. Our single-stick air preheating & after-burning Helixtove with flu heats wonders with no wood chopping. My Cornish long glassed veranda facing south warmed the home very well, Wellington gumboots are real warm outside; fill with water & walk around for a few minutes to clean boots & your feet. Migrate to warm New Zealand, Fiji, Vanuatu or Australia where we virtually have every day cloudless & no violence or racism etc. Note that if more than 22% intermittent energy is applied to the usual powerhouse, it destabilizes & needs an expensive gas turbine to accept more renewable ON-GRID contributors. However it has been professionally calculated that, USA being so wide, all power houses could be deleted - easier if energy is conserved - & if no wind or sun but plenty of hydro electric in one place, there is bound to be plenty of wind &/or sun to share in other places; so that only a 50 or 60 hertz sync trigger is needed. For $89 I have a new 80 watt solar PV panel from China, yet never needed. A better scheme I figured decades ago, was for government or a rich fat cat possibly subsidised by government, to Give every home a cheap 46 watt solar panel like we have + truck battery + regulator + instruction card so as to run an all-solar 12 volt house like hours. We charge an electric vehicle, run a 60L fridge, TV, fans, radio, pumps, small microwave, LED lights, coffee & bed warmer, micro scooter, tools, phones etc - - - Then collect a small fee, or less for dole & pensioner folk. Of course government would need to generate very little power then + anyone could buy more of those solar panels. Very Cheap! ",
            "date": "Answered July 19, 2019",
            "views": "63",
            "upvotes": " Answer requested by Joshua Siktar"
        },
        {
            "author_info": {
                "name": "Lucas Godburn",
                "href": "/profile/Lucas-Godburn"
            },
            "answer_text": "The most immediately observable advancement is the efficiencies, or rather, power densities of the Photovoltaic (PV) modules. High quality PV mods may have produced 175 watts then but now are averaging 300w or more for the same footprint. The materials are becoming less expensive and more durable. The degradation and efficiency losses are not as drastic as they had been. The racking materials are stronger and more standardized as well as better engineered to withstand storm conditions. Inverters are more efficient. They have become transformerless and therefore lighter, cheaper and quieter. The used to require some fairly tight tolerances of input to function properly. Now they are very flexible and even micro-inverters are available to increase efficiencies and this returns on money spent. Because solar has become more mainstream, it is easier to get and at a better price. Much of the mystery of engineering and installation has been mitigated by the above mentioned advancements. Not to be overlooked is the variety of financing options available for those who want to ‘go green’ or simply reduce their electric bill but don’t want to (or can’t) pay tens-of-thousands of dollars in cash to get Solar. ",
            "date": "Answered July 15, 2019",
            "views": "39",
            "upvotes": "0"
        }
    ]
}