{
    "title": "How would Trump's new healthcare plan work? - Quora",
    "tags": [
        "Healthcare in the Trump Administration",
        "Obamacare / Affordable Care Act",
        "Healthcare Reform",
        "Health Care Policy",
        "Healthcare and Medicine in the United States of America",
        "Health Insurance",
        "Donald Trump (politician, business person)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Henry R. Greenfield",
                "href": "/profile/Henry-R-Greenfield"
            },
            "answer_text": "This plan has been in development for 4 years. Gee it must be incredible, I dont know about you but I have been waiting for a long time and I was so excited to hear about it. So let’s take a look at how this plan is going to revolutionize health care coverage in America! Let’s start with what Sec of Human Services Azar said, ‘It is what it is’. What is it after 4 years of talking and saying what a great healthcare plan it is. $200 drug discount cards to Medicare recipients - well that solves nothing. No roll back on costs with big pharma, no change in the ridiculous prohibition on Medicare where they cannot negotiate prices with the pharma companies meaning outrageous prices that are sometimes 20X the rest of the world for the same drugs made in the USA! No money to pay for it as there are no appropriations, remember Congress appropriates money not the President, he cannot just conjure up anything. And who in the heck thinks that anything will be solved by $200 prescription cards which will disappear in a nano second. SO ZERO ON THAT PART.2nd is Out of network costs should not be allowed. And it is the policy of the USA to not have preexisting conditions. No legislation, non binding, no nothing, completely meaningless. ZERO AGAIN, PERFECT SCORE SO FAR.The ACA is up for a Supreme Court vote and it all hinges on ending the individual mandate which Trump and the Justice Dept both have said, (Trump in the same speech he touted his plan said he is getting rid of the individual mandate), which means THE ACA WILL BE DEAD WHICH MEANS 30 MILLION WILL LOSE HEALTH CARE COVERAGE, WHICH MEANS OVER HALF OF THOSE FOLKS HAVE PREEXISTING CONDITIONS. Wow that is less than zero, he not only took away those who are paying in like young folks but he killed the ACA so he did exactly the opposite of what he said he would do on point 2; HE TOOK AWAY HEALTH CARE FOR THOSE WITH PRE EXISTING CONDITIONS. Brilliant move Herr Trump.That my friends is that, literally nothing more. I read and reread it several times trying to find something I might have missed. This guy is worse than the salesman selling snake oil, it is like saying you have snake oil and the bottle is not only empty but full of spiders ready to kill you if you open it. The crowd by the way cheered him on. Mostly as always they looked bored, Trump talked in circles and Fox said afterwards he was brilliant. It was followed by commercials and memes saying he should have yet another Nobel Peace prize. He took bows endlessly while those outside with preexisting conditions realized that he is the cancer that is far worse than anything that they have. VOTE FOLKS NOW, IF YOU DON’T AND YOU DIE BECAUSE HE TOOK AWAY YOUR HEALTHCARE AND GAVE YOU POISON SPIDERS TO EAT INSTEAD IN THAT SNAKE OIL BOTTLE, IT IS YOUR OWN FAULT. Vote like your life depends on it, because in many cases, millions in fact, it does. ",
            "date": "Answered September 25, 2020",
            "views": "129",
            "upvotes": " View 375 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert Guentter",
                    "user_href": "/profile/Robert-Guentter"
                },
                {
                    "user_id": "Rob Shafer",
                    "user_href": "/profile/Rob-Shafer-3"
                },
                {
                    "user_id": "Brendan McNamara",
                    "user_href": "/profile/Brendan-McNamara-19"
                },
                {
                    "user_id": "BJ Anderson",
                    "user_href": "/profile/BJ-Anderson-2"
                },
                {
                    "user_id": "John Richards",
                    "user_href": "/profile/John-Richards-190"
                },
                {
                    "user_id": "Zack Smith",
                    "user_href": "/profile/Zack-Smith-403"
                },
                {
                    "user_id": "Bruce Todd",
                    "user_href": "/profile/Bruce-Todd-17"
                },
                {
                    "user_id": "Mike La Tour",
                    "user_href": "/profile/Mike-La-Tour"
                },
                {
                    "user_id": "Bill Mugan",
                    "user_href": "/profile/Bill-Mugan"
                },
                {
                    "user_id": "Sue Carol",
                    "user_href": "/profile/Sue-Carol-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shauna Case",
                "href": "/profile/Shauna-Case-1"
            },
            "answer_text": "It would be as clear as mud. Do you have taxable income over $250,000 per year? [Yes] or [No]If Yes, proceed to Question 3 on page 29If No, do you or any family members have any pre-existing conditions?List all conditions for you and all family members on the next 25 pages. Add all dates and name of physician and provider for everything including but not limited to all illnesses with all school attendance records and dates; wounds including childhood stitches, dates of all well baby care appointments with name of physician(s) and all nursing staff present and records relevant to dates; vaccinations with exact formulations and dates administered and by whom; number of pregnancies and whether pregnancy resulted in a live child and dates for all prenatal care and name of all physicians and nursing staff at all prenatal appointments including weight, vital signs and physician records; name of all prescriptions ever prescribed by any physician or physician assistant plus all physician records and dates related to the prescription(s); all X-rays including date, provider, and all physician records related to the X-rays; Oncology with dates and name of all physicians and nursing staff for all appointments and all hospitalizations including all physician records. If any information is not provided with the required information as stated above then you and/or the family member will not qualify for BGH (Bigly Great Healthcare) and will be required to pay the prevailing cost(s) as listed in the provided 971 page manual labeled “BGH Best Healthcare Practices and Costs as Determined by BGH.”Have you or a family member ever consumed any alcoholic beverages, beverages containing carbonation and/or sugar including but not limited to all processed sugars and fructose including milk products, provide name of beverage and dates purchased and consumed. [Yes} or [No} Provide grocery store receipts for any beverage items as described above for 1 (one) year from date of application. If any receipts are missing, BGH will be unable to process your application and you and/or the family member will not qualify for BGH (Bigly Great Healthcare) and will be required to pay the prevailing cost(s) as listed in the provided 971 page manual labeled “BGH Best Healthcare Practices and Costs as Determined by BGH.”There is no Question 3, skip to Question 7.Etc., etc., etc. ",
            "date": "Answered September 25, 2020",
            "views": "369",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bruce Todd",
                    "user_href": "/profile/Bruce-Todd-17"
                },
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-75"
                },
                {
                    "user_id": "Tonya Rolf",
                    "user_href": "/profile/Tonya-Rolf"
                },
                {
                    "user_id": "Endre Enyedy",
                    "user_href": "/profile/Endre-Enyedy-2"
                },
                {
                    "user_id": "April Moreno",
                    "user_href": "/profile/April-Moreno-38"
                },
                {
                    "user_id": "Howard Hudson",
                    "user_href": "/profile/Howard-Hudson-8"
                },
                {
                    "user_id": "Wayne Alberts",
                    "user_href": "/profile/Wayne-Alberts-1"
                },
                {
                    "user_id": "Winston H Reed",
                    "user_href": "/profile/Winston-H-Reed"
                },
                {
                    "user_id": "Lyle Andrusiek",
                    "user_href": "/profile/Lyle-Andrusiek"
                },
                {
                    "user_id": "Gary Miles",
                    "user_href": "/profile/Gary-Miles-49"
                }
            ]
        }
    ]
}