{
    "title": "How to get the speedometer on your car calibrated to be ensure its accuracy - Quora",
    "tags": [
        "Weights and Measures",
        "Tips and Hacks for Everyday Life",
        "Driving"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karl Brauer",
                "href": "/profile/Karl-Brauer"
            },
            "answer_text": "The car manufacturer calibrates the speedometer gear, and has to take into account the particular car's transmission ratios, differential ratio & tire diameter. The calibration is usually within a 1% to 5% tolerance range.  If your car is not up to factory specs however, then re-calibration is probably necessary for an accurate speed to be displayed. Permanent magnet and hairspring manipulation can accomplish this task. For a newer electronic speedometer there are some speedo re-calibrators that correct both the speedometer and odometer readings as an additional electronic device that gets installed between the speed sensor and the speedometer.  We have not tested such a device. In any event, calibrating your car's speedometer is not a task for the average do-it-at-homer, and we suggest that you bring your vehicle to a professional who has the proper equipment and experience to get it right. ",
            "date": "Answered June 14, 2012",
            "views": "81",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "Will Wister",
                    "user_href": "/profile/Will-Wister"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Dahlgren",
                "href": "/profile/Jack-Dahlgren"
            },
            "answer_text": "When I was small there used to be mileposts along the highway. They were spaced 1 mile apart. By maintaining an even measured speed of 60mph and measuring the amount of time it took you, you could determine if your speedometer was correct (at least at that speed). If you look closely, there are often mileage markings along the side of the road. Find a couple which are about 3 miles apart or so then measure your time and do the math. ",
            "date": "Answered May 17, 2012",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ellie-H-39"
                }
            ]
        }
    ]
}