{
    "title": "How is Twitter impacting our fight against the Corona virus? Is it being helpful or harmful? - Quora",
    "tags": [
        "Twitter (product)",
        "Society",
        "COVID-19 (2019-2020)",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suparna Saha",
                "href": "/profile/Suparna-Saha-116"
            },
            "answer_text": "Twitter playing a Vital role by Helping us to get latest Updates and news from various News Agencies. Various Government Officials and Ministers have Their account in Twitter, So that we can get latest Updates or Information by Seeing their tweets. Using our Twitter Account we Can Exchange our Views with other People that are Living in Other Region working In different Niche. therefore we get the Additional Knowledge of Current Status of the Safety Measures that are to be followed In this Difficult situation. As Because of the Lock Down, People are not allowed to Interact freely with others, Using Twitter and other Social Media sites People can Interact with each other while getting Online and Spend Their quality time with other people that facing the same situation. ",
            "date": "Answered April 14, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nikhil Sharma",
                "href": "/profile/Nikhil-Sharma-4"
            },
            "answer_text": "Hi! I’m finding twitter helpful in accessing credible information. You just need to make sure you read/follow the right handles. Avoid the noise. Twitter has introduced a new section which curates COVID-19 related updates from various verified sources. A quick glimpse will help you stay abreast with latest around the globe. Check out this article: 5 Reasons To Check Twitter For Finding Credible Information About #CoronaVirus ",
            "date": "Answered April 11, 2020",
            "views": "20",
            "upvotes": "0"
        }
    ]
}