{
    "title": "How did technology help improve navigation? - Quora",
    "tags": [
        "Google Maps Navigation",
        "Navigation Systems",
        "Navigation",
        "Improvements",
        "History of Technology",
        "GPS Navigation",
        "User Experience",
        "Technology Trends",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Williams",
                "href": "/profile/Robert-Williams-67"
            },
            "answer_text": "Hmm. Not sure it did. Brief history: 10k yrs ago Pacific Islanders managed to navigate the very large South Pacific ocean to very small islands. They did this by observing everything around them: the stars, waves, birds, smell of the air, wind action, clouds. They had accurate maps too. Made of beads on string. They were superb observers and good navigators. Fast forward a few thousand years, and we figured out how to use the earth’s magnetic field to tell direction (compass). But we no longer knew where we were going. Then an instrument called an Astrolab to determine latitude from the height of the sun. Still didn’t know where we were going (Remember Columbus thought he hit Asia.) Later still an accurate timepiece was developed (read the book Longitude - fascinating story). Now we could tell longitude as well. This allowed the development of accurate charts (what landlubbers call maps) which improved your chances of actually finding the place you were aiming for. In an eyeblink timewise, radio systems (Loran, etc) were deployed for coastal navigation. Properly adjusted Loran is accurate to a dozen meters or so. Then we figured out how to put satellites with (super) accurate clocks and locations into orbit along with receivers that do calculations that take Einsteinian time/space complications into account. This enabled several meter accuracy world wide. Google, take me home. Now we don’t know how to navigate any more. ",
            "date": "Answered August 23, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Hilbert",
                "href": "/profile/George-Hilbert-1"
            },
            "answer_text": "When the first traveler put the first boat into the water, he was completely at the mercy of the winds, currents, and weather. Later, they learned that by looking at the stars, they could figurer out their position. As they gained knowledge, they figured out that by putting knots in a rope and paying it out, they could figure out their speed. They could use the same rope to keep track of the depth of the water under them. For a long time, sailors did quite well with instruments the helped them use the stars and the Sun to navigate. When I was in the Navy, a part of my gear was called a “pit sword”. It was literally a long piece of iron/nickel, with electrical windings. This sword could be used to determine the ship’s speed through the water and display it where needed. We also had a large rotating motor-driven gyroscope that served as a compass. We had other (rather crude by today’s standards) electro-mechanical instruments that used inputs from the pit sword, the ship's gyro-compass, and wind speed instruments to send out a plot on a map to show the ship’s position at any time. These were just modern versions of what sailors had been using for centuries. Nowadays, we have GPS, RADAR, SONAR, and other very sophisticated navigational aids. These can tell us our position within inches. The above is a very incomplete description, just touching on the high points. The real issue is that once you can determine your exact position, it is a simple matter to navigate to any other place on Earth, safely and by the shortest path…Cheers!!! ",
            "date": "Answered August 23, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}