{
    "title": "How many songs can a 32 GB iPod Touch hold? - Quora",
    "tags": [
        "iPod Touch (Apple Product)",
        "iPod"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Young",
                "href": "/profile/William-Young-41"
            },
            "answer_text": "Depends on how much space you use for apps, and what quality the music is at. The quality of the music is listed my bitrate, such as 256kbps, and 128kbps. Those happen to be the 2 most used qualities, both are available through iTunes. We can divide the bit rate by eight and the multiply by the number of seconds to get the space required for each song. So we need to find out how long a song is, so lets take a look here Average Length of Top 100 Songs and find out. The apparent average seems to be about 227 seconds, great.  Ok now gets crunch some numbers, lets start off with high quality  256 / 8 = 32 KB per second32 * 227 = 7264 kb7264 / 1024 = 7.09 mbOk so a high quality song is about 7.09 mb Now for lower quality 128 / 8 = 16 KB per second16 * 227 = 3632 kb3632 / 1024 = 3.55 mbSo a low quality song takes about 3.55 mb, now we need to determine how much space is actually available. I have a 32gb iPhone so ill take a look at it and find how much space IOS takes up. In iOS settings, under general, there is a listing \"Capacity\" with shows how much space your phone has minus the iOS installation size, on my phone it appears to be about 27.2 gb, so lets use that number. assuming you don't install any apps on your iPod you should be able to store about 27.2 * 1024 = 27852.8 mb27852.8 / 7.09 = 3,928 (ish) songs at 256kbps27852.8 / 3.55 = 7,645 (ish) songs at 128kbpsNow we all know that anyone with an iOS device will probably install some apps, so lets find out how much extra space those will take up. Now ill average the space used for apps on my iPhone and iPad, it may not be a perfect representation, but it will do. You can get this by plugging in your iOS device to a computer running iTunes and looking at the storage breakdown at the bottom of the screen. iPhone space used for apps: 2.12 gbiPad space used for apps: 11.13 gbnow on average iPad apps take about 4x the space of an iPhone app, so if my iPad were an iPhone the actual space should be about 2.78 gb 2.12 + (11.13 / 4) = 4.90254.9025 / 2 = 2.45 gbok so lets run the numbers again with apps included 27.2 - 2.45 = 24.75 gb (for songs)24.75 * 1024 = 25344 mb25344 / 7.09 = 3,574 (ish) songs at 256kbps25344 / 3.55 = 7,139 (ish) songs at 128kbpsThats pretty good, but I bet that you would want some of your albums in high quality and some in lower. that way your favorite songs sound great, and the rest are ok, a good way to maximize storage space! lets assume that you want 1/4 the space for songs in high quality. 27.2 = 2.45 = 24.75 gb (for songs)24.75 * 2014 = 25344 mb25344 * (1/4) = 6336 mb (for high quality)6366 / 7.09 = 893 (ish) songs at 256kbps24.75 - 6366 = 18978 mb (for low quality)18978 / 3.55 = 5345 (ish) songs at 128kbps5345 + 893 = 6238 total songsso somewhere between 7645 and 3574 songs, but probably somewhere around 6k songs. ",
            "date": "Answered December 1, 2015",
            "views": "307",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Peralta",
                    "user_href": "/profile/David-Peralta-12"
                },
                {
                    "user_id": "James Quan",
                    "user_href": "/profile/James-Quan-15"
                },
                {
                    "user_id": "Chandrakanth Nb",
                    "user_href": "/profile/Chandrakanth-Nb"
                },
                {
                    "user_id": "Riyadh Ali",
                    "user_href": "/profile/Riyadh-Ali-5"
                },
                {
                    "user_id": "Tommy Pesavento",
                    "user_href": "/profile/Tommy-Pesavento-1"
                },
                {
                    "user_id": "Luciano Castillo",
                    "user_href": "/profile/Luciano-Castillo"
                },
                {
                    "user_id": "LAUREN FELLESON",
                    "user_href": "/profile/LAUREN-FELLESON"
                },
                {
                    "user_id": "Nick Gibson",
                    "user_href": "/profile/Nick-Gibson-7"
                },
                {
                    "user_id": "Jay Wacker",
                    "user_href": "/profile/Jay-Wacker"
                },
                {
                    "user_id": "Roland Waddilove",
                    "user_href": "/profile/Roland-Waddilove"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Pharr",
                "href": "/profile/Alexander-Pharr"
            },
            "answer_text": "OK, there are SO many ways to answer this. So let's assume we have high quality songs that are 7 megabytes each. Since iOS takes up about 5 gigabytes of space, the leftover space is 27 gigabytes. Since there are 1024 megabytes in a gigabyte, let’s multiply 27 by 1024. 27 * 1024 = 27,648 megabytes Now let's divide that by 7 megabytes, as earlier, we said that is the assumed size of a high quality song. 27,648 ÷ 7 = 3,945 songs. Now, let’s asssume we have a normal song that is 2 megabytes. 27,648 ÷ 2 = 13,824 songs. The numbers may differ based on the type of songs you want to store, but that's about roughly the amount of songs you can store. Hope that helps, yadda yadda yadda. ",
            "date": "Answered November 13, 2017",
            "views": "38",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Penny Amyot",
                    "user_href": "/profile/Penny-Amyot"
                },
                {
                    "user_id": "Yosida Peng",
                    "user_href": "/profile/Yosida-Peng"
                },
                {
                    "user_id": "Mereck Fandohan",
                    "user_href": "/profile/Mereck-Fandohan-3"
                },
                {
                    "user_id": "Nick Gibson",
                    "user_href": "/profile/Nick-Gibson-7"
                },
                {
                    "user_id": "Eva Black",
                    "user_href": "/profile/Eva-Black-8"
                },
                {
                    "user_id": "Sukhveer Singh",
                    "user_href": "/profile/Sukhveer-Singh-13"
                }
            ]
        }
    ]
}