{
    "title": "How are fugitives found? Most importantly, how is it decided which federal agency will have authority over that fugitive? - Quora",
    "tags": [
        "Federal Agencies",
        "Fugitives",
        "Federal Bureau of Investigation",
        "Federal Government of the United States",
        "Crime",
        "Police and Law Enforcement",
        "Government",
        "Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Davidson",
                "href": "/profile/David-Davidson-94"
            },
            "answer_text": "Fugitives are found through investigation. I won't go into what is done in a fugitive investigation, because 1) there are more things than I have the time or inclination to list & 2) I wouldn't want anybody using my answer to avoid apprehension. As for who has authority of a particular fugitive case an explanation follows. First, all federal warrants are maintained by and are the responsibility of the U. S. Marshal Service. U. S. Marshals have authority over all warrants. U. S. Marshals have primary responsibility over parole and probation violators, those that violate conditions of release after serving their custody sentence, persons that fail to appear as directed by the court (bond jumping) and escape from custody (except as explained below). That said, the agency that conducted the original investigation has the initial responsibility for arresting the subject of an indictment. However, most investigative agencies have a Memorandum of Understandin (MOU) with the U. S. Marshals that basically says that if the original agency doesn't affect an arrest within 72 hours of a warrant issuing, the responsibility for apprehension will be turned over to the U. S. Marshals. This applies to such agencies as DEA, BATF, IRS, etc. The main exception to these MOUs is the FBI. That agency, through agreement of the Department of Justice, maintains apprehension authority of their specific investigations. This also applies to escape from custody cases. If the person who escapes was originally the subject of an FBI investigation, then, by agreement, the FBI will assume the responsibility of apprehension. ",
            "date": "Answered May 13, 2020",
            "views": "34",
            "upvotes": " Answer requested by David Cervantes",
            "upvoters": [
                {
                    "user_id": "Alexandra Bodamer",
                    "user_href": "/profile/Alexandra-Bodamer"
                },
                {
                    "user_id": "Josh Evans",
                    "user_href": "/profile/Josh-Evans-111"
                },
                {
                    "user_id": "Gerry Surette",
                    "user_href": "/profile/Gerry-Surette-1"
                },
                {
                    "user_id": "Steven Haddock",
                    "user_href": "/profile/Steven-Haddock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Zaper",
                "href": "/profile/Peter-Zaper-1"
            },
            "answer_text": "The US Marshall’s Office is responsible for tracking down wanted fugitives from justice for federal offenses. They send out bulletins to all law enforcement agencies throughout the country. If the fugitive is stopped in a routine traffic offense the person is turned over to the Marshals. They also go out to the fugitive’s residence and other known places where he/she might go - a relative or girlfriend’s residence, etc. or other known haunts. They also notify train, bus stations as well as airports in case the fugitive attempts to flee the jurisdiction or country. Once apprehended the fugitive is taken to a federal correctional center for processing and then remanded to federal court for trial. ",
            "date": "Answered May 11, 2020",
            "views": "66",
            "upvotes": " View 4 Upvoters "
        }
    ]
}