{
    "title": "How does a bee fly? Could we fly like bees do? - Quora",
    "tags": [
        "Apiculture (Beekeeping)",
        "Aerodynamics",
        "Bees (insect)",
        "Common Misconceptions",
        "Entomology",
        "Insects"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Fraser",
                "href": "/profile/Jack-Fraser-11"
            },
            "answer_text": "According to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyways. Because bees don't care what humans think is impossible. That’s the quote from the beginning of the Bee Movie, which saw an unexpected and incomprehensible rise to internet meme-dom a couple of years back. However, this idea — that we don’t understand how bees fly — has been around for far longer, stretching back nearly 80 years. It is, of course, nonsense. We do understand how bees fly.  The origin of the myth is uncertain. A common origin story is that an (unnamed) Swiss physicist was asked by a female attendee at a dinner party how a bumblebee could fly, since they’re so much fatter (relative to their wing size) than things like birds. The physicist, so the story goes, did some rough calculations on the back of a napkin, and concluded that a bumblebee shouldn’t be able to fly. Of course, because he was doing very rough calculations, the physicist made a number of approximations, (depending on the version of the story) the critical approximation is either a fixed-wing approximation (like an aircraft), or a linearised oscillating aerofoil approximation (i.e. small “flapping” motion) Of course, the conclusion that should be reached by this is that this approximation was invalid. If you use an approximation to prove that X is impossible, but X clearly happens — it’s not that “science can’t explain X”, it’s that you used the wrong approximation! That nuance, however, often gets lost in the myth — people get too excited about “science not knowing” something, so they ignore the fact that we absolutely do.  So, how does a bumblebee fly. Well, first and foremost, we know that linear approximations (which ignore things like stalled airflow) must be wrong — since they say that bumblebees can’t fly. Therefore, you need to do the full aerodynamic treatment. What you discover, if you do this is that the way in which bumblebees simultaneously flap and rotate their wings during an oscillation cycle creates a dynamic stall above their wings, which in turn leads to a large-scale “leading edge vortex” being generated on the upper side of the wing. This vortex (temporarily) produces significantly larger lift than the linear approximation allows. In addition, bees are helped because of their small size, which means that the Reynolds number associated with their flight puts them firmly in the regime where the fluid is incredibly viscous. In short, because they’re so small, and their wings are moving so rapidly, the air around their wings acts like thick syrup (one might even say….honey?) , which allows them to generate much more lift than we, on a totally different scale, would normally intuitively predict.  There is obviously a bunch more complicated physics going on than this, but that’s the highlights: dynamic stalls producing vortices, and a small enough scale to be in the viscous regime. As you may notice, this represents some problems for the second part of the question: could we fly like they do? The answer is no — for a start, humans are far beyond the scale where we can treat air as a viscous fluid in the same fashion that bees do, we’re simply just too big. To generate the vortices is slightly more plausible (helicopters and suchlike do something qualitatively similar), but quite simply, there’s a very good reason that we don’t have planes that flap their wings as they fly! ",
            "date": "Answered April 25, 2018",
            "views": "678",
            "upvotes": " View 3.3K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lucas Fugita",
                    "user_href": "/profile/Lucas-Fugita"
                },
                {
                    "user_id": "Atul Saswat",
                    "user_href": "/profile/Atul-Saswat"
                },
                {
                    "user_id": "Dương Hồng Phú",
                    "user_href": "/profile/Dương-Hồng-Phú"
                },
                {
                    "user_id": "Yugal Shrestha",
                    "user_href": "/profile/Yugal-Shrestha-1"
                },
                {
                    "user_id": "Matt Conroe",
                    "user_href": "/profile/Matt-Conroe"
                },
                {
                    "user_id": "Bosca Fabian",
                    "user_href": "/profile/Bosca-Fabian"
                },
                {
                    "user_id": "Reyaan Hasaan",
                    "user_href": "/profile/Reyaan-Hasaan-1"
                },
                {
                    "user_id": "Ramesh Kumar",
                    "user_href": "/profile/Ramesh-Kumar-5735"
                },
                {
                    "user_id": "David Berger",
                    "user_href": "/profile/David-Berger-64"
                },
                {
                    "user_id": "Slaw Polanski",
                    "user_href": "/profile/Slaw-Polanski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Bee",
                "href": "/profile/Brandon-Bee-7"
            },
            "answer_text": "This particular Bee usually flies coach. I’m normally fairly disgruntled because the people in the seat in front of me repeatedly attempt to recline their seat, despite the fact that my knees have nowhere to go. I’m not even that tall! Nevertheless, I often have bruised knees after flying. Occasionally I get a first class upgrade. That’s the best! You can definitely fly like I do, and in fact, many people do. I recommend knee pads. ",
            "date": "Answered April 25, 2018",
            "views": "260",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adap Kuria",
                    "user_href": "/profile/Adap-Kuria"
                },
                {
                    "user_id": "Mandi Bailey",
                    "user_href": "/profile/Mandi-Bailey-2"
                },
                {
                    "user_id": "John Heinzel",
                    "user_href": "/profile/John-Heinzel"
                },
                {
                    "user_id": "Cristian M Ioan",
                    "user_href": "/profile/Cristian-M-Ioan-1"
                }
            ]
        }
    ]
}