{
    "title": "How should I pursue a career in Additive Manufacturing (3D Printing)? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Andrew Eydt",
                "href": "/profile/Andrew-Eydt"
            },
            "answer_text": "First, I would begin to learn the CAD design process by downloading a package and running through the tutorials.  Many have trial periods in the 30 day range - you should also qualify for a student package.  The specific software package shouldn't matter, but stick with one of the major ones to start: Autodesk Inventor, SolidWorks, Pro/Engineer Creo, and Solidedge.  The mental process is essentially the same for all packages, even though the mouse clicking syntax and menu structures are different. After that, I would suggest gaining an understanding of material properties.  This will help you to know the capabilities and limitations of the 3D printed parts.   Finally, a working understanding of traditional manufacturing techniques will allow you to appreciate the flexibility of 3D printing.  Also, in the case that a design does go to metal and is machined, cast, forged, etc. then you will be better able to tweak the design to allow for this manufacture. ",
            "date": "Answered January 1, 2014",
            "views": "16",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Murali Kalidindi",
                    "user_href": "/profile/Murali-Kalidindi"
                },
                {
                    "user_id": "Esh Nadendla",
                    "user_href": "/profile/Esh-Nadendla"
                },
                {
                    "user_id": "Siva Raman",
                    "user_href": "/profile/Siva-Raman-277"
                },
                {
                    "user_id": "Tafazzul Mahmood",
                    "user_href": "/profile/Tafazzul-Mahmood"
                },
                {
                    "user_id": "Nishchay Edmund Paschal",
                    "user_href": "/profile/Nishchay-Edmund-Paschal"
                },
                {
                    "user_id": "Vinod Kumar",
                    "user_href": "/profile/Vinod-Kumar-4469"
                },
                {
                    "user_id": "Siddhartha Sharma",
                    "user_href": "/profile/Siddhartha-Sharma-260"
                },
                {
                    "user_id": "Johnny Mnemonic",
                    "user_href": "/profile/Johnny-Mnemonic-30"
                },
                {
                    "user_id": "Harold Glascock",
                    "user_href": "/profile/Harold-Glascock"
                },
                {
                    "user_id": "Arjun Kholia",
                    "user_href": "/profile/Arjun-Kholia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stacey Clement",
                "href": "/profile/Stacey-Clement-3"
            },
            "answer_text": "I completely agree with Andrew that learning the CAD is an essential part of the process. Some other tools you may want to educate yourself on is Insight and GrabCAD is a free tool to check out. You may also want to check out different job boards to see what kind of positions interest you. Here is Fisher Unitech’s to start. Careers ",
            "date": "Answered October 12, 2018",
            "views": "265",
            "upvotes": "0"
        }
    ]
}