{
    "title": "How to still charge my phone with a laptop on sleep mode? How is that possible - Quora",
    "tags": [
        "Computer Sleep Mode",
        "Batteries",
        "Laptops",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Silverman",
                "href": "/profile/Andrew-Silverman-10"
            },
            "answer_text": "Some laptops are designed to continue to provide power to the USB ports when they’re in sleep mode. Some are further designed to only do this when the laptop itself is plugged in, or in some cases allow the user to change a BIOS setting that allows it to power USB from its own (larger) battery, precisely so the user can charge a device over USB from the laptop even while not actively in use. There’s no particular magic to it, it simply uses its own internal battery in that event, and will stop charging the device if its own battery gets too low. ",
            "date": "Answered April 7, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "KOMAL CHAHAL",
                    "user_href": "/profile/KOMAL-CHAHAL-1"
                },
                {
                    "user_id": "Shah Saiful",
                    "user_href": "/profile/Shah-Saiful"
                }
            ]
        },
        {
            "author_info": {
                "name": "Perris Calderon",
                "href": "/profile/Perris-Calderon"
            },
            "answer_text": "There are various levels of sleep, some levels on some machines leave the usb port energized so when you come out of sleep the hardware doesn’t have to re-mount Both of my laptops keep the usb port active and my phone charges in sleep, don’t know what you’d have to change to get yours doing it Make sure you’re not entering hibernate instead of sleep, that mode cannot keep the usb port active ",
            "date": "Answered April 7, 2017",
            "views": "415",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Justin Miner",
                "href": "/profile/Justin-Miner-2"
            },
            "answer_text": "Long story short, this entirely depends on the computer you have. For some hardware configurations it will be utterly impossible.For other configurations it is not enabled, but can be enabled with firmware changes. The update may come from a hack someone online found or from the manufacturer.It may have been factory enabled by the manufacturer.",
            "date": "Answered April 7, 2017",
            "views": "381",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frederik Wunderlich",
                "href": "/profile/Frederik-Wunderlich"
            },
            "answer_text": "This depends if the laptop has a smart USB for exactly that. You should consider reading your laptops manual and/or reaching out to your laptops manufacturer. ",
            "date": "Answered April 8, 2017",
            "views": "290",
            "upvotes": " Answer requested by Shah Saiful"
        }
    ]
}