{
    "title": "How should I end a presentation? - Quora",
    "tags": [
        "Presentation Tools",
        "Presentations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Schwarz Carigiet",
                "href": "/profile/Daniel-Schwarz-Carigiet"
            },
            "answer_text": "In my opinion, it's very very important to actually END the presentation at all. At university, I must have sat through hundreds of presentations from professors and students which just kind of stopped at some point, and the audience was never sure if the speaker was actually finished or whether they had just forgotten what they were talking about... Ugh. Nowadays, with just over 30 years' adult teaching and presenting experience in corporate environments, I make a point of clearly ending every presentation. I usually say something like: \"Ladies and gentlemen, that brings me to the end of my presentation. I hope you found it helpful - thank you for your time and attention.\" Usually this gets a round of applause (which is nice), but that's not why I say it. I think it's important to be courteous and to appreciate the time busy business people have carved out of their day to listen to you. I find it shows that I am aware of this and appreciate it. If it's a training-type situation, I'll typically add something inviting the audience to ask any questions they might still have, or to ask whether there is anything they would like me to show them again.  ",
            "date": "Answered April 1, 2016",
            "views": "43",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "SL",
                    "user_href": "/profile/SL-285"
                },
                {
                    "user_id": "Jorge Ruiz",
                    "user_href": "/profile/Jorge-Ruiz-268"
                },
                {
                    "user_id": "Tín Đồ Manga",
                    "user_href": "/profile/Tín-Đồ-Manga"
                },
                {
                    "user_id": "Ishu",
                    "user_href": "/profile/Ishu-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Stanton",
                "href": "/profile/Christopher-Stanton-7"
            },
            "answer_text": "There are a few different strategies to conclude with: The Joni Mitchell trick of using humor to, “leave them laughing as you go”Provide a brief summary (especially if there is a test afterwards)Finish with a question and answer session (when time permits)Ask attendees to fill out a quick feedback form (useful for improvement)No matter what, always make sure to slip in at least one wisecrack during the session. If you can make the room laugh, it tells you one important thing… they were listening! In an academic situation, summarizing is crucial because you will have a chance to bring up anything which may have escaped being mentioned during the main event. For sales talks, a final round of Q&A is vital in that your audience gets a chance to show some interest and you are able to talk into your strongest points. Even if it requires cutting things short, leaving time for a survey is crucial so that you can tailor future presentations in an optimal manner. ",
            "date": "Answered July 9, 2020",
            "views": "603",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "E. G. Moye",
                    "user_href": "/profile/E-G-Moye"
                }
            ]
        }
    ]
}