{
    "title": "How do design thinking and innovation relate to each other? - Quora",
    "tags": [
        "Design Thinking",
        "Innovation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Glinski",
                "href": "/profile/Patrick-Glinski"
            },
            "answer_text": "From what I've seen and what I practice, there are four points of view on what Design Thinking really is. Each has a different connection to innovation.   Design thinking helps a person form ideas through abductive reasoning. Abductive reasoning implies knowing throughout intuition (no formal proof), which is effectively a new thought. Innovation through new ways of thinking.Design thinking is a human centered way of viewing the world. By trying to solve problems through gaining insights around  people's needs, you're creating new perspectives which lead to new opportunities for innovation. Innovation through new perspectives.Design thinking is a series of methods that allow designers better communicate ideas. Completely new concepts are difficult for most people to grasp, so using a designer's lens on communications improves understanding. The communication of innovation.Design thinking is a series of steps to guide the innovation process. It's the meta name given to the activities involved in creating a new idea. Design thinking is innovation.",
            "date": "Updated March 9, 2011",
            "views": "18",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Grant Rawlinson",
                    "user_href": "/profile/Grant-Rawlinson"
                },
                {
                    "user_id": "Adharsh Dhandapani",
                    "user_href": "/profile/Adharsh-Dhandapani"
                },
                {
                    "user_id": "Tiffany Yu",
                    "user_href": "/profile/Tiffany-Yu-12"
                },
                {
                    "user_id": "Aiden Kenny",
                    "user_href": "/profile/Aiden-Kenny"
                },
                {
                    "user_id": "Dennis Mancini",
                    "user_href": "/profile/Dennis-Mancini"
                },
                {
                    "user_id": "Ilya Baraev",
                    "user_href": "/profile/Ilya-Baraev"
                },
                {
                    "user_id": "Thierry Blancpain",
                    "user_href": "/profile/Thierry-Blancpain"
                },
                {
                    "user_id": "Uday Gajendar",
                    "user_href": "/profile/Uday-Gajendar"
                },
                {
                    "user_id": "Allen Cheung",
                    "user_href": "/profile/Allen-Cheung"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelvin (KC) Claveria",
                "href": "/profile/Kelvin-KC-Claveria-1"
            },
            "answer_text": "Design thinking nurtures customer-centric innovation. That’s because the design thinking process forces UX pros, developers and others involved in innovation to focus on the people they’re designing for: the end users and customers. Here’s how Lara Hanlon, software product designer at IBM, sees the connection between design thinking and innovation[1]: “When you use design thinking, your users are your North Star. They are the premise for every action you take. You will measure your success based on the value you bring to them, actively involve them in your work to help you understand the problem, and get feedback on ideas along the way.” Another benefit of design thinking: it forces necessary restraint in the product innovation cycle. A critical step in design thinking is clearly defining “the challenge you are taking on, based on what you have learned about your user and about the context,” according to the Stanford University Institute of Design[2]. This provides focus and identifies which features and experiences should be dropped. The latter steps in the design thinking process—ideation, prototyping and testing—further validate the product features, processes and experiences that customers are looking for[3]. Footnotes[1] What is design thinking and why is IBM sharing its secrets?[2] https://dschool.stanford.edu/sandbox/groups/designresources/wiki/36873/attachments/74b3d/ModeGuideBOOTCAMP2010L.pdf?sessionID=68deabe9f22d5b79bde83798d28a09327886ea4b[3] How the design thinking process improves innovation and customer experience",
            "date": "Answered October 24, 2016",
            "views": "616",
            "upvotes": "0"
        }
    ]
}