{
    "title": "How can Bangladeshis start a scientific and technological revolution in their country? - Quora",
    "tags": [
        "Technological Revolutions",
        "Scientific Revolutions",
        "Bangladeshi Ethnicities and People",
        "Bengali (language)",
        "Bengali Ethnicity and People",
        "Revolution",
        "Bangladesh",
        "Scientific Research",
        "Technology Trends",
        "Science",
        "Technology",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohammad Gani",
                "href": "/profile/Mohammad-Gani"
            },
            "answer_text": "Scientific and technological revolutions cannot be ordered by societies, though they can be facilitated to grow or flourish. Why? The essence of the revolution is discovery and invention, which must come from individuals mad enough to try to do the impossible or do something others never did. Inventors and discoverers are odd people who just cannot stop their brains from thinking about odd things that other people just do not think about. Nobody knows beforehand, and indeed the very discoverer himself does not know it before the discovery, who will discover something. There is no way to prepare for a scientific revolution. Research and Development (R&D) is the name given to programs that deliberately look around for signs of somebody coming up with an innovative solution. As the level of income grows, and more so in education, R&D can foster the innovative spirits by funding trials or experiments. But the point remains: you just cannot order somebody to discover what nobody knows. Thankfully, with more people, there are more brains that are struck by odd ideas. Bangladeshi people have made many discoveries and will keep making discoveries. Let me introduce myself as a discoverer. It is an extremely odd story. It is odd, because unless one thinks in a certain way, one does not think in that way to see what ought to be obvious. Out of the thousands of ideas in economics that are new, here is one. See how you like it or not: Everybody knows that the planet has a fixed limited stock of natural resources. Geological changes do change the quantum of land or sea. But for all practical purposes, humans have been here for roughly 200,000 years, and the stock of natural resource during this time has been pretty much a constant.Now, everybody knows that people need natural resources from which they get the necessary food and the minerals (include water as a mineral).Everybody thinks that more people need more natural resources. But is this thinking right? It is not right, because in reality, more people need less natural resource. Ordinary heads will explode in disbelief: No, it cannot be true that more people need less resource. But that is the paradox: the fact is that in 2019, less than 4% of the global real output came from natural resource. The further back in history one goes, people got a larger and larger share of output from nature. 10000 years ago, 100% of the output came from natural resources.What has happened? So, take a pause and think. People have to do work, or use human resource, initially as natural labor, and later with unnatural intelligence. Just ask: if one man catches fish from one river, will he catch as much as two men catching fish from the same river? Be aware of what everybody misses: it is the same river that gave a certain amount of fish when one man caught the fish, but gave a larger amount when two men caught it. Did people need twice the river to get twice the fish, or did they get twice the fish from the same old river? What happened here?To recognize human labor itself as another factor of production is a terribly big discovery. Yet it should have bene obvious. People do see it and just forget it. If they did not forget, why would they ever worry that more people must need more resource? They did not: there are more people in the same old planet, and they are richer. While the natural resource remained the same, human resource increased to provide the increased output.Two major errors of thought crept up here. The first error is to presume exhaustion of resource by not making a distinction between the resource as a factor and the output from the resource as a product. Two men needed twice the fish, the output, but did not need twice the river, the resource. The careless intuition just overlooked this distinction to cry in pain: my god, now that there are two men, they must need two rivers, as if one man exhausts one river of all the fish there is so that the second man cannot catch any fish from the same river.The second error is that of monomania or which I shall call monophobia: the fear that there is just one factor, the natural resource, as if the human labor or human resource is not a factor of production. If the fearful mind could be trained to have courage and hope, it could recognize the human labor as another factor of production. One would then think: well, now that there are twice the people to do twice the work, what will the output be, given that the land (shorthand for all natural resources) remains the same as before?This is not merely a logical question of possibilities: it is a question of fact of actual occurrence. What did happen when more labor was applied to the same land? The answer is: the planet has the same land as before, but with more people working on it, there has been more output.Now there is mathematical logic. A constant does not explain a variable’s variation at all. If the same land generates more output, the increased output must have come from the additional human resource or something else, not from the land itself. The amount of the land is not relevant in explaining the output. This logic just kills the idea that more people need more land as patently absurd. Underlying is the reality of non-exhaustion, also called non-binding constraint. The land has not been exhausted, and is not a binding constraint on output: the amount of land does not determine the output in any way. This is a staggeringly strong stab at the intellect of the intuitive thinker. Why intuit rather than analyze?The fact that the human has knowledge with which production can be carried out is entirely beyond intuition. That people can actually educate others and make them more productive, or that they can heal the sick and make them more productive, or that they can inform and entertain others to improve the enjoyment of life , or they can manage and judge them and give them more rights and justice is an idea that just explodes the intuitive mind. 94% of the real output of the world in 2019 came from factors other than natural resource. That people can just sing or dance or pretend or tell stories or jokes and make a good living is something that the intuitive mind is yet to learn.And so goes my day and my night: a massive wall of absolute intuitive ignorance refusing to accept my economics. With ferocious regularity, people keep asking about their endless worries of how the increasing population is destroying the land. But people will never use any more than 10% of the earth’s land, and that is the fact.",
            "date": "Answered October 22, 2020",
            "views": "168",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Muhammad Abrar Zawad",
                    "user_href": "/profile/Muhammad-Abrar-Zawad"
                },
                {
                    "user_id": "Akif Bhuiyan",
                    "user_href": "/profile/Akif-Bhuiyan"
                },
                {
                    "user_id": "Akif Ul Islam",
                    "user_href": "/profile/Akif-Ul-Islam"
                },
                {
                    "user_id": "Noman Hossain",
                    "user_href": "/profile/Noman-Hossain-28"
                },
                {
                    "user_id": "Quazi Mushroof",
                    "user_href": "/profile/Quazi-Mushroof"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Hogg",
                "href": "/profile/Alexander-Hogg-1"
            },
            "answer_text": "It cannot. At least it can’t in the way that I suspect you are hoping. Bangladesh, in general, lacks the underpinning foundation and resources that such “technological revolutions” normally are preceded by. Infrastructure, network (data and comms) capacity and a number of other important support functions are below par (compared to world leading countries) in Bangladesh. Unless there is an extremely fortuitous breakthrough/invention pioneered from within Bangladesh I don’t think what you seem to want will happen. However, do not despair! There is much good in Bangladesh and even since as recently as between my first visit back in 2009 and my most recent one last year much has changed. Mostly for the better. It may be possible for Bangladesh one day to more widely get the attention and respect it deserves, but I don’t think that has come yet. It is possible though, as a key factor, i.e. rate of improvement, is better in Bangladesh than in most countries I have spent time in. If Bangladesh can keep this up, almost anything will be possible in the future! ",
            "date": "Answered October 22, 2020",
            "views": "58",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quazi Mushroof",
                    "user_href": "/profile/Quazi-Mushroof"
                }
            ]
        }
    ]
}