{
    "title": "How was Steve Jobs fired? - Quora",
    "tags": [
        "History of Apple Inc."
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Emerich Christian",
                "href": "/profile/Jeffrey-Emerich-Christian"
            },
            "answer_text": "I gained an interesting perspective having done the majority of the retained search work at Apple under John Scully and working closely with Steve Jobs on board restructuring governance and conducting Steve’s last two Board Searches. My meetings and discussions allowed me to observe Steve’s behaviors, characteristics, and leadership qualities that I have used to create The 60 Top Predictors of Great Leadership as well as insight into this event and others. I have talked indepth with John about many events during his tenure at Apple. John and I became close after his departure from Apple. He sat on the board of one of my software start ups and at one point I conducted all of his CEO search work in his career as a venture capitalist. In addition I count John as an important and valued mentor. Recently John gave me critical strategic insight on our new revenue acceleration software company. The biggest question regarding what can be considered one of the most momentous events in high tech history is whether Steve was fired at all. Unlike John, Steve responded as if it were an insult to broach a topic he had no patience for. Sometimes if I wanted an answer I had to ask the question more than once and in a different manner or context. Steve definitely saw the actions or manipulations of John and the board as being fired. John and the board described it as a resignation. However if you look closely at the events leading up to Steve's departure and take int consideration the board knew how Steve would react it is easy to assume it was a calculated effort to remove Steve from the company. At the time Apple’s financial performance was poor and it is easy to understand that both John and Steve pointed fingers at each other as to who was to blame. Steve required complete control over his product innovations. It is important to note that Steve recognized the talent and contributions of his team. Though he was a tough leader who had zero patience for mediocrity, Steve always enjoyed a type of mutual admiration with the people he prized. Though The Mac eventually saved the company, advanced features were not enough to sustain the high price and generate substantial revenue. John openly lobbied for removing Steve from heading the overall Mac product line and resources. It would have been impossible for John to not realize he was starting a turf war where only one would be left standing. Steve never told me much about what happened next. However with or without a well thought out strategy , ( my guess is without ) Steve went to the board requesting or most likely demanding, John’s ouster. Steve lost and knowing him even as little as anyone really did, resigned with some emotion. John understood corporate politics very well, knowing how to manage a board from his experience rising to CEO of PepsiCo. Steve never really learned that art other than realizing, when named CEO of Apple years later that he had to build his own board he could rely on to support him. In the early days at Apple, Steve saw the board as a possible threat and lacked the skills,experience and particularly the patience required to forge and nurture the individual relationships necessary to win the board’s ongoing support. John on the other hand knew all the maneuvers. As the CEO of Next and controlling shareholder Steve built his own board. There exists an interesting dynamic and an unwritten rule about board members. It is almost impossible for human beings to not recognize and follow a hierarchy and form alliances .Except in times of overwhelming corporate crisis a board member observes some degree of alligience to whoever found them and championed their candidacy. Steve’s new and rebuilt board trusted his judgment. As well they should have. Steve orchestrated the most significant turn around in US corporate history. Sometimes he and the board did not agree. On one occasion I was brought in to mediate. The board felt they should hire their first female boardmember. Steve told me that he was going to hire the best board member possible whether it was man,woman, dog or rock. I was retained to do the search. On his own he brought in Al Gore almost anticipating Apple’s future disputes with the US government. Steve soon after welcomed 2 of my candidates on to the Apple Board, one of them , a woman. ",
            "date": "Answered October 31, 2017",
            "views": "99",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Palmer",
                    "user_href": "/profile/Richard-Palmer-75"
                },
                {
                    "user_id": "Ankur Tripathi",
                    "user_href": "/profile/Ankur-Tripathi-169"
                },
                {
                    "user_id": "Aish",
                    "user_href": "/profile/Aish-134"
                },
                {
                    "user_id": "Tim Johnson",
                    "user_href": "/profile/Tim-Johnson-1150"
                },
                {
                    "user_id": "Animesh Mitra",
                    "user_href": "/profile/Animesh-Mitra-4"
                },
                {
                    "user_id": "Sachin Desai",
                    "user_href": "/profile/Sachin-Desai-91"
                },
                {
                    "user_id": "Sarah Hayes",
                    "user_href": "/profile/Sarah-Hayes-43"
                },
                {
                    "user_id": "Vineel Shah",
                    "user_href": "/profile/Vineel-Shah-3"
                },
                {
                    "user_id": "Jaskirt Brar",
                    "user_href": "/profile/Jaskirt-Brar-2"
                },
                {
                    "user_id": "Madeline Diamond",
                    "user_href": "/profile/Madeline-Diamond-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Lekuona",
                "href": "/profile/Nick-Lekuona"
            },
            "answer_text": "At the time that story developed, Apple was a public company and had a professional board of directors, including John Scully. We must understand that they had two completely different views of the world in general, and Apple in particular: for Jobs it was a kind of mission from God, delivering innovation and awesomeness, the rest be damned. For the board (and investors), Apple was a money-making machine, and they had to remove anything preventing it from making more revenues. It was quite obvious that those two philosophies were going to collide sooner or later, as it happened. Steve was aware of his limitations in how to professionally run a company, and that’s the reason why he brought Scully from Pepsi. But, at the same time, he thought he could keep throwing his steamroller of a personality around, as he did before, something which often didn’t necessarily go in the best interests of the company. He was abrasive and bullied everybody in disagreement with him, be workers, providers or customers. He was just 24 at the time, had no business training at all, liked to show off how he was smarter than anybody else in the room… quite a recipe for being more of a liability than an asset. The board actually didn’t fire him, but removed him of all power. No department nor staff reported to him any more, and he was left in a corner office doing absolutely nothing. To be fair, he was offered the possibility of holding a new position as a kind of “resident visioneer” so he could explore as much new and revolutionary stuff as he wanted, but that came with the condition that he’d have no say in the day to day operation of the company. That was unacceptable to him, so he resigned, sold his Apple stock (but one share) and left to found NeXT (poaching some Apple talent in the process). Then came Pixar and the rest is history… Actually I’d say the board had no choice but to do what they did. In hindsight, things could probably have been done in a much better way by all parties, but when egos clash and there is money at play… ",
            "date": "Answered December 3, 2017",
            "views": "107",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Piyush Dixit",
                    "user_href": "/profile/Piyush-Dixit-77"
                },
                {
                    "user_id": "Craig Zo",
                    "user_href": "/profile/Craig-Zo"
                },
                {
                    "user_id": "Riyadh Ali",
                    "user_href": "/profile/Riyadh-Ali-5"
                },
                {
                    "user_id": "Darren Leung",
                    "user_href": "/profile/Darren-Leung-10"
                },
                {
                    "user_id": "Mary S",
                    "user_href": "/profile/Mary-S-105"
                },
                {
                    "user_id": "Angelica Valerio",
                    "user_href": "/profile/Angelica-Valerio-2"
                },
                {
                    "user_id": "Prasad Deshmukh",
                    "user_href": "/profile/Prasad-Deshmukh-21"
                },
                {
                    "user_id": "Varun Singh",
                    "user_href": "/profile/Varun-Singh-787"
                },
                {
                    "user_id": "Gidz Paul",
                    "user_href": "/profile/Gidz-Paul"
                },
                {
                    "user_id": "Prateek Rawat",
                    "user_href": "/profile/Prateek-Rawat-29"
                }
            ]
        }
    ]
}