{
    "title": "How many games can a 500GB Xbox One hold? - Quora",
    "tags": [
        "Xbox One (video game console)",
        "Xbox (console series)",
        "Video Game Consoles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Vargas",
                "href": "/profile/Andrew-Vargas-18"
            },
            "answer_text": "It depends on the specific game we’re talking about. *Caveat: the 500GB hard drive in fact does not have 500GB of storage space, it in fact has ~362GB of space for media storage. For this answer I’m also ignoring apps and other similar functions as they are very small in terms or storage useage. *II: I’ll be using the a chart I found on google. The Destructoid Xbox One Game File Size Guide For the most part I went down the list and picked them, only skipping really small games and making sure to get as close to 0GB as possible. There is a decent variety of titles(some of which I own). Alien: Isolation- 24.41GB Angry Birds Star Wars- 1.81GB Assassin's Creed Chronicles: China- 3.25GB Assassin's Creed IV: Black Flag- 22.29GB Assassin's Creed Unity- 39.36GB Battlefield 4- 37.1GB Battlefield: Hardline- 45.33GB Borderlands 2- 23.34GB Borderlands: The Pre-Sequel- 13.84GB Call of Duty: Advanced Warfare- 48.97GB Call of Duty: Ghosts- 42.21GB Dead Rising 3- 26.9GB Destiny- 24.2GB Duck Dynasty- 8.93GB The grand total being ~14 games, 5 being over 30GB each(mainstream titles), 6 being between 30GB and 10GB(fairly popular but not having a buttload of content), and 3 titles that are under 10GB each(lesser known titles that may or may not be good). All in all an external hard drive is a good idea when it comes to game storage on any console, especially if you’re going to be playing the main stream titles like: Assassins creeds, Call of Dutys, (Bungie titles)Halo or Destiny, Elder scrolls, Fall outs, Gears of War, or even the Battlefield titles. ",
            "date": "Answered May 7, 2019",
            "views": "16",
            "upvotes": "0"
        }
    ]
}