{
    "title": "How does technology influence economic activity? - Quora",
    "tags": [
        "Economic Activity",
        "Economic Development",
        "Influence",
        "Technology Trends",
        "International Economics",
        "Economics of Everyday Life",
        "Economics",
        "Finance",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suresh Babu K",
                "href": "/profile/Suresh-Babu-K-50"
            },
            "answer_text": "How does technology influence economic activity ? Economic activity :- It means the buying and selling of goods and services , that involves money as a transaction medium. Technology and its correlation with Economics:- When we talk about technology, obviously the word innovation takes place. If we look that the Past , during Industrial revolution, the invention of Flying shuttle (Weaving machine) → made weaving production double, which lead to huge production of textiles.Steam Engine → made a huge revolution, by making transport of goods (export and import) and people easier.Telephone → communication is a strong pillar, of economic activity.In Present:- Digital revolution(Block Chain Technology, AI, Quantum Computing, etc.), Green Technologies (PVC Cell, Bio fuels, Li-ion battery cells, etc.) does have the same impact on Economy. Now, in this digital era nearly every person has a mobile , we order food through it, shopping , studying, even dating through it. So that’s why many countries and corporates who aspire to achieve greater economic growth invest more money in R & D. To conclude :-Economic activity is happening directly or indirectly through technology. ",
            "date": "Answered October 24, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}