{
    "title": "How can 3d printing be used? - Quora",
    "tags": [
        "How to Use X",
        "3D Printers",
        "3D Printing",
        "Printing",
        "Manufacturing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marianne Davis",
                "href": "/profile/Marianne-Davis-11"
            },
            "answer_text": "There seem to be the top uses for 3D printing, from my layperson’s view point. Just messing around with CAD and your favorite miniature (by far the most common - just look at Thingiverse or any other 3D repository)Prototyping (most common industrial usage)Prosthetics, like limb replacementDecorative items for your houseJewelry - this allows more complex pieces, even if you are just printing with wax to use a traditional lost-wax method of castingWearable art - not just jewelry, but 3D printed stuff integrated into clothing, fabrics, decorative bits for the fabric, decorative bits for an outfit (belts, anyone?)Part replacement for older high value equipment (I remember reading about a propeller on a Dutch, I think, tugboat. No one made them anymore and the part drawings had been lost so someone took a 3D scan of the old one, filled in all the voids and printed one up)Medical uses. This includes making models for complicated and rare procedures to give the medical team a chance to practice, printing implantable drugs in layers to control the absorption by the body, even making parts like a skull plate for someone who has lost part of their skull.Medical research. This includes making replacement organs, those implantable drug delivery things, bone scaffolding, heart patchesThose medical uses and research? I’m pretty sure things are moving from research into use and new research ideas are being tried out all the time.Buildings, bridges, construction.Food - fancy pastries and candy in shapes that are hard to form otherwise top the list of foods. In a way, cake decorators have their own 3D printing decorating tools in those cones with the different tips they use to make certain shapes in the frosting. In fact, I think I’ll go look for someone 3D printing frosting decorations now.I’m sure I missed a lot of uses, that there will be new ones added, that there is some other way of ordering these and that some things can be dropped from the list if you don’t consider something a “top” use. ",
            "date": "Answered November 25, 2019",
            "views": "446",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gina Langridge",
                    "user_href": "/profile/Gina-Langridge"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankit Gupta",
                "href": "/profile/Ankit-Gupta-2840"
            },
            "answer_text": "3D printers occur as a handly machine to print a lot of products and they have a lot of uses as well in the current age. Initially, 3D printers were used only to print the decorative items only using limited raw materials such as PVCs. However, the scope of 3D printing has widened much, and nowadays, they can be used for various purposes in addition to decorative printing. For instance, if you know even the basic use of 3D printing with just the plastics, you can design various daily use objects and sell them at a small or large scale to generate revenues. For instance, daily-use plastic products such as cups, tumblers, bottles, glasses, cookie cutters, smartphone case, bottle openers and a wide variety of such products can be printed out of 3D printers. While 3D printers involve very less wastage of the raw materials, the final results need very less post-processing and even the most intricate designs can be printed very easily without any extra effort.  Besides, if you wish to print something that would offer you a lot of popularity as well. Try printing vases using mud and ceramics as the raw materials in 3D printers. I know this is quite smudgy a job and it needs sophisticated 3D printers for it, but the results are really worthwhile and I think this is one of the newest applications of 3D printing that has helped the people achieve quite some success.  The 3D printers are also a part of some of the most prolific industries in the world. You would not believe it but these 3D printers already print some of the parts of automobiles and airplanes as well. They are used to print the prosthetics in the hospitals and they also print human body parts for the research needs. All in all, 3D printers are now used as a part of almost every industry, even food industry and you can bring them at home even to teach your kids a lot of things in science as well. ",
            "date": "Answered August 10, 2020",
            "views": "147",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhavin Rajput",
                    "user_href": "/profile/Bhavin-Rajput-6"
                },
                {
                    "user_id": "Naveen Mittal",
                    "user_href": "/profile/Naveen-Mittal-55"
                },
                {
                    "user_id": "Tushar Sharma",
                    "user_href": "/profile/Tushar-Sharma-1522"
                }
            ]
        }
    ]
}