{
    "title": "How is Apple’s new headquarters? - Quora",
    "tags": [
        "Headquarters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ayman Anthony Thompson",
                "href": "/profile/Ayman-Anthony-Thompson"
            },
            "answer_text": "Not sure of the perspective of this question, if you mean how is it as an Icon, what users think of it, or if it satisfies the persona of the Behemoth Apple. So I’ll crack at it from a bit of each. First, it was designed by world renowned British Architect Sir Norman Foster who was hand selected by Jobs himself. Given Jobs’ exquisite taste in design and knack for human experience, he chose the perfect candidate to build the headquarters. Foster’s background entails large structures across the globe from NYC to China that include other headquarters (HSBC, McLaren Automotive and a vast array of projects) for large corporations.   Jobs was quite the architecture enthusiast, known to drive the design behind the Apple stores with his vision, and the headquarters was no exceptions. As for the structure expression I believe that the beauty and simplicity of how and what Apple designs is captured in the most basic form of a circle. Heavy, yet elegant and dominate yet smooth quite Applesque. I mean c’mon it looks like it’s going to take off any minute and land on Mars! One of the key elements we try to embody in an architectural design is the personality of the owner. This is a near flawless execution of one of architecture’s pinnacle principals. You could put that building anywhere and if you know Apple you would say, yup thats theirs, not Google, Facebook, or Amazon, just Apple!  Change the (Built) World - Design and Construction Management Insights and Learning by Ay Thompson Special thanks to Ronnie Grondin and Harrison Boyle for the edits ",
            "date": "Answered June 9, 2017",
            "views": "41",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arun Nakkeeran",
                    "user_href": "/profile/Arun-Nakkeeran"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/V-Loubach"
                },
                {
                    "user_id": "Julie Teng Williams",
                    "user_href": "/profile/Julie-Teng-Williams"
                },
                {
                    "user_id": "Toh Wu Jie",
                    "user_href": "/profile/Toh-Wu-Jie"
                },
                {
                    "user_id": "Praneeth Kacham",
                    "user_href": "/profile/Praneeth-Kacham"
                },
                {
                    "user_id": "Harrison Boyle",
                    "user_href": "/profile/Harrison-Boyle"
                },
                {
                    "user_id": "Ronnie Grondin",
                    "user_href": "/profile/Ronnie-Grondin"
                },
                {
                    "user_id": "Anujayan Sugirtharan",
                    "user_href": "/profile/Anujayan-Sugirtharan"
                },
                {
                    "user_id": "Elijah Robert",
                    "user_href": "/profile/Elijah-Robert-1"
                },
                {
                    "user_id": "Miha Mitič",
                    "user_href": "/profile/Miha-Mitič"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Dahlgren",
                "href": "/profile/Jack-Dahlgren"
            },
            "answer_text": "The circular topology ensures that there are no shortcuts to getting where you want to. ",
            "date": "Answered June 1, 2013",
            "views": "494",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bijoy",
                    "user_href": "/profile/Bijoy-40"
                },
                {
                    "user_id": "C.V. Krishnakumar",
                    "user_href": "/profile/C-V-Krishnakumar"
                }
            ]
        }
    ]
}