{
    "title": "How important is it to upskill during the pandemic? - Quora",
    "tags": [
        "Life Advice for People in Their 20s",
        "Advice for Daily Life",
        "20s (age)",
        "Business",
        "Jobs and Careers",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aromal A",
                "href": "/profile/Aromal-A-13"
            },
            "answer_text": "“The pandemic has taught us many things”, you would have probably read a million emails, answers, and articles starting with this sentence. :D But wait, isn’t that true? Indeed! Of all the lessons that it taught, the most valuable one would be regarding the unpredictability of life. You are planning for the next decade of your life when you seriously don’t know what awaits you in the next second. Now, the answer to the question has become quite obvious. You need to keep on upskilling, all your skills require daily polish. Not just during this pandemic, but all through your journey. Upskilling is all about staying relevant and staying relevant is the need of the hour! But why is everyone concerned about upskilling during the pandemic? You have the best gift in your hands - time. You can use this wisely to bring out the best in you.Everyone, from students to corporate leaders are staring at an unpredictable future. No one has any clarity on how things are going to be or the situation of the job market once all this is over. Hence there is a natural pressure within people to come out with a couple of new skills in hand and also to polish their existing skills.But all you have to remember throughout this is that you have to enjoy the journey and not just the destination. Also, like someone said the other day - “It’s a pandemic and not a productivity competition” :D #happiness_is_success :3 ",
            "date": "Answered September 4, 2020",
            "views": "71",
            "upvotes": "0"
        }
    ]
}