{
    "title": "How to start a 3pl logistics company - Quora",
    "tags": [
        "Third-Party Logistics",
        "Logistics",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Augustin Kennady",
                "href": "/profile/Augustin-Kennady"
            },
            "answer_text": "Great question! Well, without giving away too many of our secrets, I’ll tell you by far the most basic way to start a 3PL company. There are really only three steps you need to take. It may sound extremely basic, but this is in fact all you need: A customer who needs things shipped. Do you know a business that needs their products or packages shipped from one place to another? This could be either freight forwarding or order fulfillment (if the latter, send them over to us at ShipMonk for bonus points). It sounds simple, but once you have this, you have the foundation of your logistics company. Now find another business that needs their products or packages moved from one point to another and build from there.Space to house products. This can be a 90,000 square foot warehouse. It could be an abandoned airplane hangar. It could be your father-in-law’s shed. As long as you have sufficient space to stage your work (whether that entails relabeling, repackaging, inventory storage, etc.), you will be fine.A shipping method. This can be as amazingly basic as schlepping the products and packages down to the post office or FedEx center every day, or as complicated as staging multiple on-site pickup times. But one way or another, you’re going to need a way to ship the packages.Beyond this point, it’s all a matter of personal taste, specialization, branding, building trust, and the important things that actually come with developing a successful 3PL. But if you want to start one, you only need those three things. Good luck out there! ",
            "date": "Answered April 26, 2018",
            "views": "29",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Gran",
                    "user_href": "/profile/Mark-Gran-1"
                },
                {
                    "user_id": "Rishi Dhaul",
                    "user_href": "/profile/Rishi-Dhaul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Sanguedolce",
                "href": "/profile/Bob-Sanguedolce"
            },
            "answer_text": "Like starting any other business, you need to start by gaining knowledge and experience. With knowledge and understanding you'll be able to develop a business plan and strategy that you can use to acquire capital and initial customers. It's important to recognize the 3PL Logistics businesses are generally capital intensive meaning that you need to invest in physical plant and equipment to manage and process shipments. Capital intensive businesses are generally more difficult to start because of the need to acquire greater capital funding before you can begin sales or operations. If you have no real experience in 3PL, a good first step might be for you to get a job in an existing 3PL business and learn the business from the inside. You'll not only learn what makes for a successful 3PL business, you'll gain knowledge of mistakes to avoid. As an employee of an existing 3PL, you'll also develop valuable business and customer contacts who may help you when you're ready to go out on your own. Good luck! ",
            "date": "Answered January 5, 2016",
            "views": "46",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krishnasish Behera",
                    "user_href": "/profile/Krishnasish-Behera"
                },
                {
                    "user_id": "Anthony Collins",
                    "user_href": "/profile/Anthony-Collins-74"
                },
                {
                    "user_id": "Van Penn",
                    "user_href": "/profile/Van-Penn-1"
                },
                {
                    "user_id": "Kunal Sharma",
                    "user_href": "/profile/Kunal-Sharma-335"
                }
            ]
        }
    ]
}