{
    "title": "I am horrible at math. Will it be okay to choose studying computer science in a university? - Quora",
    "tags": [
        "Computer Science Education Advice",
        "Career Advice in Computer Science",
        "Computer Science Education",
        "Studying",
        "Colleges and Universities",
        "Mathematics",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Park Moore",
                "href": "/profile/Matthew-Park-Moore"
            },
            "answer_text": "“I am horrible at math. Will it be okay to choose studying computer science in a university?” Being “horrible at math” says that you shouldn’t go into theoretical computer science, which is really a branch of mathematics - you prove theorems about computability, running time bounds, and so on. However, most people who want to major in Comp Sci are aiming for careers as software developers. There are a few areas of software development which use a lot of math, but most don’t. You can have a perfectly good career as a software developer without using any math beyond high school algebra, and even that isn’t needed all the time. Some people will tell you that people who are good at math are also good at software development, and vice versa. There is certainly a correlation, but it isn’t exact - I’ve met people who were good at either one and bad at the other. This all suggests you should aim more at Software Engineering or Information Technology degrees. Those tend to be more software development oriented. Although you should learn the details of any degree program you are applying to, because these fields have a lot of overlap and different colleges mean different things by them. Lastly, you should be aware that software development isn’t for everyone. Have a backup plan in case it isn’t for you. Matthew Park Moore's answer to Is a career in computer science really worth it? ",
            "date": "Answered January 8, 2020",
            "views": "192",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Underwood",
                "href": "/profile/Gary-Underwood-5"
            },
            "answer_text": "Probably not. ABET certified CS degrees require Calc I, Calc II, and discrete minimally. Calc III and Linear algebra are common as well. A less rigorous computer program is what you will need. Either CS that isn’t ABET or something related. Specifically, look at the degree requirements at the schools you are interested in. Talk to an advisor there to see what options they have that may fit you. ",
            "date": "Answered January 8, 2020",
            "views": "83",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Coey Minear",
                    "user_href": "/profile/Coey-Minear"
                }
            ]
        }
    ]
}