{
    "title": "I do not feel ready for community college. What can I do about this? - Quora",
    "tags": [
        "Community College",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joel Dykstra",
                "href": "/profile/Joel-Dykstra-1"
            },
            "answer_text": "Community college is basically the lowest rung on the ladder of higher education. Community colleges have a lot of classes, programs and resources to help students who aren’t quite ready for college. Probably the best thing you can do is adopt an attitude of patience and decide that you are going to put maximum effort into whatever you do no matter how far behind you think you are. There are really only three things you need to do for success: First, make sure you attend every class. Second, make sure you read everything that is assigned to you. Third, make sure you turn in every assignment that is assigned to you. If you do those three things, it will be difficult for you to fail (although not impossible). Other things you can do are: make sure you see your teacher at the first sign of trouble or if you have anything you don’t understand. Make sure you have a good advisor and that you take advantage of all resources that are available to you. ",
            "date": "Answered June 15, 2016",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas B Walsh",
                "href": "/profile/Thomas-B-Walsh"
            },
            "answer_text": "Before you write off community college try to clarify what your objective would be if you attended. Community college can serve a multitude of purposes: A low cost bridge (two or three years) to transferring to a four-year school to earn a BA degree.To earn a marketable certification to escape the \"part time/minimum wage\" trap.Discovering a marketable major. (Many young people matriculate at a four-year college without having identified a marketable major. Often this translates into extra, expensive semesters of schooling while they explore various alternatives.)Remedial classes.Learning for the sake of learning--fun.To repair a poor GPA.To earn an Associate's degree.In today's economy you are probably going to need some kind of credential beyond a high school diploma. Community college is one way to gain that credential. ",
            "date": "Answered April 21, 2016",
            "views": "166",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karen Martin",
                    "user_href": "/profile/Karen-Martin-37"
                }
            ]
        }
    ]
}