{
    "title": "I have a business idea. How do I fulfill it when I don't have much knowledge of a startup? - Quora",
    "tags": [
        "Business Ideas",
        "Business Advice",
        "Startup Ideas",
        "Business Strategy",
        "Entrepreneur Advice",
        "Startup Founders and Entrepreneurs",
        "Entrepreneurship",
        "Startup Strategy",
        "Business"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siddhesh Choughule",
                "href": "/profile/Siddhesh-Choughule-1"
            },
            "answer_text": "It's really great that u have an idea .So u have a goal where u can aim .So u require a lot of knowledge to hit the bulls eye. First suggestion will be just get started and try implementing the idea . Then read book related to marketing and study the growth of companies that exists with the same idea as yours . Or in case u have some unique idea then try marketing it in an efficient way . And rest u will learn from experience through failure and success . So u can't gain complete knowledge prior to starting but u can gain a overview by reading and consulting some entrepreneurs who r in the field . I hope this helps . ",
            "date": "Answered May 8, 2020",
            "views": "25",
            "upvotes": " Answer requested by Rohit Mahato",
            "upvoters": [
                {
                    "user_id": "Rohit Mahato",
                    "user_href": "/profile/Rohit-Mahato-110"
                },
                {
                    "user_id": "Mahendra",
                    "user_href": "/profile/Mahendra-275"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sesh Iyer",
                "href": "/profile/Sesh-Iyer-3"
            },
            "answer_text": "First Be sure about the Knowledge you want & which industry you want to start up. Learn through free or paid courses on Coursera, Udemy and LinkedIn learning to get the basic idea of your startup Network with someone who has an experience in starting a business from scratch & also search for like minded people around you to partner. ",
            "date": "Answered April 18, 2020",
            "views": "61",
            "upvotes": " View 2 Upvoters"
        }
    ]
}