{
    "title": "I have a 'region 1' DVD player. How can I m play a 'Region 2' DVD? - Quora",
    "tags": [
        "DVD Regions",
        "DVD Players"
    ],
    "response": [
        {
            "author_info": {
                "name": "Katrina Itab-Spooner",
                "href": "/profile/Katrina-Itab-Spooner"
            },
            "answer_text": "You need either a zero/all region player, which are surprisingly cheap (I have a few Region 2 discs also), or to order a Region 2 player online, which would likely be more expensive, at least for shipping. What I’m desperately holding out for is a machine that plays Blu Ray discs, and all regions of DVDs. Blu Rays are universal by design, so it’s been obnoxious trying to read in the specs whether the player can handle all DVDs. When the search terms include “universal,” it pulls up every Blu Ray player ever, with no DVD-specific info. Most of my huge collection is DVD, with a few dozen Blu Ray, and maybe a dozen Region 2 DVDs. The player I just got is supposed to be universal, even playing audio compact discs, but no Region 2. ",
            "date": "Answered February 13, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adam Spadaro",
                    "user_href": "/profile/Adam-Spadaro-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kris Sprouse",
                "href": "/profile/Kris-Sprouse"
            },
            "answer_text": "No, you can’t use a region 1 player to play region 2 dvd. You could use some region-free player programs to play your region 2 DVD discs, as region free player such as Leawo Blu-ray Player can play DVD discs from any region. Or you could make a copy of the region 2 dvd and remove the region code. ",
            "date": "Answered May 10, 2019",
            "views": "454",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Betty Stewart",
                    "user_href": "/profile/Betty-Stewart-43"
                }
            ]
        }
    ]
}