{
    "title": "I have been charging my phone in the same spot near my bed for two months. Why does looking at that cause me depression? - Quora",
    "tags": [
        "Depression",
        "Mental Health",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Katherine Grey",
                "href": "/profile/Katherine-Grey-10"
            },
            "answer_text": "I am not sure if you use 'depression' as a mood like some people or you are referring to a mental illness so I will adress the later as I don't do the first. So first of all it really depends when you last left your house/apartment and took some fresh air and a walk. Second of all it depends on whether you are having a depressive episode as in being depressed throughout the last (two) month(s) or few weeks back, or if you just started one. Third of all you may be making a subconscious connection between that charger and something in your life that triggers you, or you connect it to loneliness and monotony. And frankly it may not be any of those three, and it sucks but most of the time we have no objective reason for being depressed we just are. So maybe try to make a change- paint it your favourite colour (or if it currently seems it is black or grey or white try something colourful instead that doesn't hurt your eyes- like blue and green and maybe a splash of some funkier colour) or try changing the colour/texture of your changer. And the easiest option would be to find something more pleasing to look at and stare at it instead :) ",
            "date": "Answered August 28, 2018",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Leone",
                "href": "/profile/Richard-Leone"
            },
            "answer_text": "First of all. I’d suggest moving the phone out of the bedroom entirely. If you use it as an alarm clock, replace it with a real one that doesn’ emit light. They’ve been proven to be sleep-disruptors and the blue light and radio frequency emfs are unhealthy for you. This could actually be the source of the depression. There’s also the possibility of seeing your life as tethered to that phone. Try keeping the phone with you only when you really need it, and out of sight. Check email only as often as you need to, and keep it turned off as long as you can so it’s not on your mind. It should serve you, not the other way around. ",
            "date": "Answered August 28, 2018",
            "views": "4",
            "upvotes": "0"
        }
    ]
}