{
    "title": "I have a Seagate 3TB Expansion desktop drive, which is not powering up and is therefore undetectable when plugged in. How do I get it running again to access the data? - Quora",
    "tags": [
        "Seagate Data Recovery",
        "Hard Disk Drives (HDD)",
        "Data"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Wu",
                "href": "/profile/Frank-Wu-97"
            },
            "answer_text": "It’s likely the control board inside the external hard drive went on you and the disk is not getting any power. You would have to take it out of the enclosure and place it into another enclosure that you can buy on the shelves for relatively cheap. Or if you particularly don’t care about having an enclosure (of course this means you have other means of protecting the disk from ESD and shock for when you are taking it with you) you can always get those SATA to USB interface adapters, which most will come with a power adapter. ",
            "date": "Answered February 2, 2017",
            "views": "27",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Oc Realzeal",
                    "user_href": "/profile/Oc-Realzeal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Trahan",
                "href": "/profile/Todd-Trahan"
            },
            "answer_text": "You can try to take it out of the enclosure and connect it via sata cable or USB sata dock. It's always important to consider the possible causes: power surge, if it was dropped, faulty power cable. These will help determine the best course of action (including contacting a professional) depending on the value of the data. If you try the above and still no power then you have a hardware failure. ",
            "date": "Answered September 3, 2015",
            "views": "55",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erich Weiss",
                    "user_href": "/profile/Erich-Weiss-2"
                },
                {
                    "user_id": "Alp Berker",
                    "user_href": "/profile/Alp-Berker"
                }
            ]
        }
    ]
}