{
    "title": "I just got scammed of 7.54BTC in a coin mining scam that I hoped would yield a lot of profit. I have lost all I have to these scammers and don't know what to do. How did you recover stolen funds? - Quora",
    "tags": [
        "Cryptocurrency Mining",
        "Scammers",
        "Bitcoin Mining",
        "Coins",
        "Theft",
        "Fraud",
        "Scams",
        "Virtual Currencies",
        "Bitcoin",
        "Cryptocurrencies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kourtney Garcia",
                "href": "/profile/Kourtney-Garcia-6"
            },
            "answer_text": "I am going to have to go straight to the point with you as it is obvious you need instant help. I do not blame you for falling victim of such ugly scam. The problem for me is people constantly investing in fields they are not aware or knowledgeable about. Coin mining is probably not what you think it is and i believe that if you had made some more research, you would have known not to put as much as $80,000 into it. I understand that making investments is a priority but making smart investments is a lot more important. At this point, you would have to report your case to a good and reliable recovery company. I have also gotten scammed and i believe that i know better. I try to be as careful as possible but i am aware of the fact that there are lots of smart individuals dedicated to stealing and i could still fall victim. This is why after getting my funds fully recovered when i got scammed, i kept Revoltseal tech close still. I am sure that they have the skill and knowledge to help me get back my money just like they did for me in the past and have been doing for several fraud victims. So i suggest that you also find a top recovery company to help you with your recovery. Apart from the fact that Revoltseal Tech possess the necessary skills to pull off any recovery, they have a really hardworking and friendly team which has made relating with them on the long-term very easy. I believe that if you can find a company that possesses these attributes, you are on your way to making a successful recovery. I hope you make the smart choice and get your money back. ",
            "date": "Answered October 4, 2020",
            "views": "72",
            "upvotes": " View 835 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pakki rod nal Jarri S Toor",
                    "user_href": "/profile/Pakki-rod-nal-Jarri-S-Toor"
                },
                {
                    "user_id": "Topmost Research",
                    "user_href": "/profile/Topmost-Research"
                },
                {
                    "user_id": "Yvonne Benjamin",
                    "user_href": "/profile/Yvonne-Benjamin-10"
                },
                {
                    "user_id": "Def Camar",
                    "user_href": "/profile/Def-Camar"
                },
                {
                    "user_id": "Manns Babra",
                    "user_href": "/profile/Manns-Babra"
                },
                {
                    "user_id": "Sanath J Biruva's",
                    "user_href": "/profile/Sanath-J-Biruvas"
                },
                {
                    "user_id": "Peter Mccarthy",
                    "user_href": "/profile/Peter-Mccarthy-137"
                },
                {
                    "user_id": "Larry Chambers",
                    "user_href": "/profile/Larry-Chambers-39"
                },
                {
                    "user_id": "Catherine Solomon",
                    "user_href": "/profile/Catherine-Solomon-18"
                },
                {
                    "user_id": "Cherry Mascott",
                    "user_href": "/profile/Cherry-Mascott"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Kristen",
                "href": "/profile/Josh-Kristen"
            },
            "answer_text": "Cryptocurrency is generally deemed as pretty secure, but sometimes things do happen. Even top traders have had cryptoassets lost or stolen and, until quite recently, it seemed like there was very little one could actually do about it. Thankfully, there is a way to get your cryptocurrency back. We’ll be looking at the top ways to recover your lost or stolen crypto, and how to avoid going through something so traumatic in the first place. A law and an expert in crypto theft cases, bitcoinrecoverysolution atgmailcom could Decrypt. The longer you wait to start tracing your crypto, the more time you give thieves to transfer your assets to cold storage, send them to sketchy exchanges, or to tumblers to mix them up. If the funds are in an exchange, you’ll need to contact them and ask them to freeze your assets. This will buy you some time. For the legal system to actually work in your favour, you’ll likely need to know who stole your cryptocurrency. While you may be able to freeze funds against a John Doe, it’ll be challenging. Thankfully, one of the many benefits of cryptocurrency is that you can see where the coins have gone. If they go through an exchange, you’ll most likely be able to find out who the wallet holder is thanks to the bitcoin recovery process. From there, you can get a court order to reveal the thief’s identity and recover your stolen crypto. I hope this article was helpful trying to recover your stolen Bitcoin and recovering your stolen funds. Thanks. ",
            "date": "Answered October 26, 2020",
            "views": "51",
            "upvotes": "0"
        }
    ]
}