{
    "title": "I need to shield my room from EMF, how to do it? - Quora",
    "tags": [
        "Electromotive Force",
        "Electrical Engineering Advice",
        "Electricity",
        "Electrical Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "EMR Shielding Solutions",
                "href": "/profile/EMR-Shielding-Solutions"
            },
            "answer_text": "Here are a few strategies for Shielding various parts of your home from EMFs whether you are shielding a home in the process of being built or an already existing one. Breaker box:Your breaker box is a source of Low-Frequency (LF) magnetic AND electrical fields. You need to shield from BOTH types of radiation. If you are in the process of building a home, you can begin shielding from within the walls. Our Shielding Fleece, HNV80, shields from LF and HF electrical fields. To complement this, you should also use MCL61 Shielding Film to block the magnetic fields; this way both electrical and magnetic fields are taken care of. These solutions also need to be grounded as well, which can easily be done with a grounding plate or one of our grounding sets. To ground the MCL61, the grounding set MCL consists of 10 screws that hammer into each strip and are connected by a wire connector that ushers the harmful radiation our into a grounding plate that is connected to the wall nearby. Effective and simple.If your home is already constructed, you can block the LF electrical fields by painting a one meter radius around the box with our NSF34 paint. The paint must also be grounded to conduct the electricity out. The Grounding Set ESW and Grounding Strap EB2 are designed specifically with this purpose in mind as they are effective and discreet looking. Fridge:The Fridge is a source of LF Magnetic Fields and LF Electrical Fields. You need to shield the areas surrounding the fridge. We suggest using the HNV80 and MCL61 if you are internally shielding in the walls and using the paint if you are externally shielding. With LF radiation, it is not enough to simply shield the source; you must shield around the entire source as LF radiation patterns emit differently than HF radiation that can be concealed if only shielded at the source. Smart Meters:The Smart Meter is a notorious emitter of High Frequency (HF) radiation. It is necessary to paint around it in a 1m radius with a paint like HSF55 or HSF74 that offers a high attenuation. It is necessary for the paint to be grounded as it is electrically conducted and requires a grounding kit to siphon out the electricity safely. Cell Towers/Wi-Fi:The rule is that if you can see Cell Towers from your home, they are having an effect on your living space and you! They are a potent source of HF radiation and your home should be at the very least, shielded with HF paint on your interior walls. HF radiation is far reaching and if your home is undergoing drywall construction, it is beneficial to install MCL61 and HNV80 to prevent against HF magnetic and electrical fields which wall also block from Wi-Fi networks. You can avoid using a Wi-Fi network by hardwiring your electronics or using a magic jack. ",
            "date": "Answered July 24, 2020",
            "views": "121",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Morison",
                    "user_href": "/profile/Patrick-Morison"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Haddy",
                "href": "/profile/John-Haddy"
            },
            "answer_text": "For audio, the most likely sources of interference are conducted emissions. I'd first try isolating the power supplies between the two zones (laundry and music room) with some really good power line filtering. If the problem is radio frequency noise then a simple sheet of metal won't do much - it might attenuate the noise a little but a Faraday cage is the only way to achieve real isolation. A Faraday cage is a completely shielded room (including ceilings and floor) with isolated power connections and all wiring in and out fully filtered - think $$$ to do properly. ",
            "date": "Answered December 28, 2015",
            "views": "936",
            "upvotes": "0"
        }
    ]
}