{
    "title": "I noticed my laptop battery lasts longer when WiFi is on than when on airplane mode. Why? - Quora",
    "tags": [
        "Airplane Mode",
        "Battery Advice",
        "Wi-Fi Advice",
        "Laptop Batteries",
        "Computer Advice",
        "Laptop Advice",
        "Battery Life",
        "Wi-Fi",
        "Batteries",
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Syed Z Hosain",
                "href": "/profile/Syed-Z-Hosain"
            },
            "answer_text": "Your question: “I noticed my laptop battery lasts longer when WiFi is on than when on airplane mode. Why?” Thanks for asking me to answer, but I don’t know the answer. Under normal circumstances, turning off all radios (including Wi-Fi) should have less of a battery drain for sure (whether it is a laptop or cellular phone). Perhaps some application or background service (such as DHCP) on your laptop is trying to get to the Internet for information and constantly re-trying when it is unsuccessful. When it gets service on Wi-Fi, that application sleeps and doesn’t drain your battery. ",
            "date": "Answered May 6, 2019",
            "views": "75",
            "upvotes": " Answer requested by Mø Olanitori"
        },
        {
            "author_info": {
                "name": "Wilbert Frias",
                "href": "/profile/Wilbert-Frias"
            },
            "answer_text": "I have one of that strange answers. I was developing a windows service, it requires communication. But for some strange reason it was eating a lot of CPU(two windows of it would consume 100%, does not matter if celeron or i7). But I remembered a text in Internet explaining the use of delays or the use of “Thread.Sleep” to avoid this. So I put it on my code and voila, no more over use of CPU. Your wi fi is delaying something to eat CPU and battery. ",
            "date": "Answered May 5, 2019",
            "views": "52",
            "upvotes": "0"
        }
    ]
}