{
    "title": "I want to start an online business of my own but have no knowledge on how to begin in technological aspects.How do I start? - Quora",
    "tags": [
        "E-Commerce Advice",
        "E-commerce Strategy",
        "Entrepreneur Advice",
        "Online Shopping",
        "Entrepreneurship",
        "E-Commerce",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arsh Singh",
                "href": "/profile/Arsh-Singh-2"
            },
            "answer_text": "Online shopping platforms are proving to be of great help to people across the world, and making profits for themselves as well.With online ordering, you’re giving more customers more opportunity and access to your offerings. They don’t need to call.  A Workforce Management System is important which helps you to coordinate a variety of functions at once like different drivers, different customers, different orders. Obtain the required licensing. Check with your local Chamber of Commerce to find out exactly what licenses are required. While you can start this out small, you'll need help with either answering phones or a delivery driver for your deliveries. Decide the mode of transport you're going to use for deliveries. One should consider following points: Good website: It is very important to start off with a feature rich, secure website so that people trust you. SEO and social media friendly: These free sources will offer a constant traffic to your website. Adding social sharing button to your website will give you more visibility. Define target area: Start with small. It is always advisable to start your business with a focus on a limited area. This will help you focus all your energy on a particular market and building a stable brand name. Customize accordingly: What works in one city might not work in the other city so take care of the local favorites and customize your offerings so that it has something for everyone. Payment options: Provide various payment options to customers on your website as every customer may have a different preference. Mobile friendly: Your audience will want to access your website when on the move this will increase your reach. Efficient Staff: Ensure your customers get what they ordered and how exactly they wanted it. Hire good local drivers with complete geographical information to ensure faster and timely deliveries to customers. Everything has it’s pros and cons, so let's take a look at what works for and what goes against Online Food Ordering and Delivery business. PROS Efficiency. With orders being taken online, less people are needed to answer the phones. Employees can concentrate on other important activities. Efficient operation and improved service quality.Accuracy: Less mistakes on your end in taking down the order which results in getting the items that customers actually ordered.Faster & Convenient: Customers no longer have to wait in queue or hold on to the phone. They just visit your site, browse, select their favorites and in few clicks the order gets placed. There is a potential for increase in revenue, more repeat business, more volume, more happy customers.CONS Implementation Cost: For start ups, developing and implementing a system to accept online orders can get expensive. There are two ways to do it: your own system created from scratch, or buying a solution.Efficient Drivers & Delivery: Time equals money in any business and to be honest, managing the field workforce in this competitive environment can be complicated. It is difficult to keep track of each and every driver or delivery boy which in turn results in inefficiency and late deliveries. The best solution is that one can opt for a good Workforce Management System in market.Over the last decade, I’ve launched many apps and SaaS platforms for entrepreneurs and early-stage startups who’ve gone ahead and made hundreds and millions of dollars using these platforms. If you have an app idea and not sure where to start, I can help. Feel free to connect with contact details in my profile. ",
            "date": "Updated March 26, 2019",
            "views": "247",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tarique Ghani",
                    "user_href": "/profile/Tarique-Ghani-1"
                },
                {
                    "user_id": "Chandni Singh",
                    "user_href": "/profile/Chandni-Singh-60"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arya Mukhopadhyay",
                "href": "/profile/Arya-Mukhopadhyay-1"
            },
            "answer_text": "Welcome to the team! Do you know the person who owns the second largest e commerce venture in the history of the world?  I am talking about none other than Jack Ma.   Never in his life has he completed a sale himself or have written a single line of code.  So how did he build Alibaba? He just envisioned something and chose the right people at the right point of time who were instrumental to bring his vision to reality.  So, since you are the promoter of this venture and you have the vision of how you want to be, all you need to do is bring on some excellent developers and designers who will shape the technological side of your business while you worry about investment and the business aspect of it.  But the question still remains, how am I going to manage the technology side of my business? Option 1: Find out if there is somebody in your network or in your extended network who is interested to join the bandwagon. If yes, bring that person in the team, induct the guy and get going. Make sure that they guy knows what h is doing. (A small tip: Most of the e commerce sites now a days are built on Magento platform. So, if your guy says this keyword \"Magento\", think no more. He is your guy.)  Option 2: Outsource the technical part of the work to development companies and sit with them making them understand what you want and how you want it. They have people who are going to do the coding, development (front end and back end) and hand over the product to you. Hereafter, you will need some employees (recruit one or two guys) to maintain the technical side of things. This can be an expensive option.  Option 3: Go for e commerce store builders online and build a store of your own without having to know any technical aspect of it. Its simple and easy to build mostly based on drag and drop actions. This is cheap but they have certain limitations as well. Some of the market leaders when it comes to e commerce site builders are:  Ecommerce Software, Online Store Builder, POS - Free 14-day Trial by Shopify (Shopify)Ecommerce Software & Solutions ( Buildabazaar)Create Online Store, Sell Online India, Build Ecommerce Website (Zepo)\n ",
            "date": "Answered March 11, 2016",
            "views": "25",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vismay Agrawal",
                    "user_href": "/profile/Vismay-Agrawal-1"
                },
                {
                    "user_id": "Pragati Kamble",
                    "user_href": "/profile/Pragati-Kamble"
                },
                {
                    "user_id": "Likitha Reddy",
                    "user_href": "/profile/Likitha-Reddy-6"
                }
            ]
        }
    ]
}