{
    "title": "I'm bad at math and love computer science and programming. Should I pursue my interest or give up like others have said? - Quora",
    "tags": [
        "Computer Science Education Career Advice",
        "Career Advice and Computer Science Education",
        "Career Advice in Computer Science",
        "Computer Science Education",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeremy Stumbaugh",
                "href": "/profile/Jeremy-Stumbaugh"
            },
            "answer_text": "I wouldn’t consider myself a “math person”, but I did have to take the following courses to get my CS degree: Calculus I, Calculus II, Calculus III, Linear Algebra, Discrete Structures, Trig, College Algebra, Stats, Differential Equations, & Algorithms. Let me take that back, I’m not a math person at all. In fact I made it a rule of thumb to take only one math course a semester, because I knew that is all I could tackle (I had the time since I was a double major, and took anything below Calc I during the summer). All semesters, and this is in all seriousness, I studied strictly for and only for the math courses. I spent only the time required to finished assignments for my CS work, and I spent the rest of my free time studying math. The tutors or “Math Lab” knew me by first name basis along with my favorite color, foods, and music. I could probably list just as much stuff about them. I made a few B’s and a good handful of C’s in those math courses. However, I made it. Algorithms, while math intensive, I managed an A, and I still mastered and did well in math intensive CS courses like Artificial Intelligence. Don’t give up, I love programming, and when anything above calc I looks at me for anything I must write, I’ll have to do a good 30–60 minute review on the subject matter. I’m still ‘not a math person’, but I did it, and I really don’t regret it. I still tinker with AI since I’ve been out of school, and knowing the efficiency of an algorithm anymore is more of an ‘art form’ than a science to me (you just know). Granted, I haven’t had to really pin down which one is better when they are so close in performance, but again a short review and I could probably do it. In a nutshell, don’t give up, just be prepared to do a lot of hard work, more so than the other students who seems to get math by merely touching the text book. Also a lot of late nights. PS. I got a jr software engineer job 3 months out of school. ",
            "date": "Answered December 19, 2016",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yusef Kenneh",
                    "user_href": "/profile/Yusef-Kenneh"
                },
                {
                    "user_id": "Neon Lights",
                    "user_href": "/profile/Neon-Lights-16"
                },
                {
                    "user_id": "Candice Carter",
                    "user_href": "/profile/Candice-Carter-8"
                },
                {
                    "user_id": "Rachel K",
                    "user_href": "/profile/Rachel-K-58"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Gross",
                "href": "/profile/Joshua-Gross-8"
            },
            "answer_text": "I encourage you to look through them very very slight variations of this question that of been answered time and again on Quora. The simple answer is that lots of computer scientists consider themselves bad at math, and Computer science programs at different schools can have radically different math expectations. My school, Blackburn college, requires only one semester of calculus and one semester of discrete math. Many of our students do not do well in these classes, but perform well in computer science. Also, you don't have to graduate with a 3.8 GPA. It's nice, of course, but most students have rather modest grades. You're not expected to be a straight-A student, and you shouldn't expect this of yourself, either. Heaven knows I was not a straight-A student as an undergraduate; my A’s were few and far between. Good luck and welcome aboard! ",
            "date": "Answered December 8, 2016",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rachel K",
                    "user_href": "/profile/Rachel-K-58"
                },
                {
                    "user_id": "Balaji Shriram",
                    "user_href": "/profile/Balaji-Shriram"
                }
            ]
        }
    ]
}