{
    "title": "I'm starting community college in a couple of hours. What should I keep in mind as I aim to do my best and transfer in two years? - Quora",
    "tags": [
        "Community College",
        "Advice",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jennifer Reid",
                "href": "/profile/Jennifer-Reid-5"
            },
            "answer_text": "In addition to taking courses, make sure you are taking courses that will benefit you. Get in touch (within your first year) with colleges/universities to which you are interested in transferring. There may be a list or agreement between public universities and community colleges in your state of courses that will transfer.  Find where the tutoring centers or learning centers are located on your campus. In many courses you will benefit from having a study group. Working in groups is an essential skill for your working future. Be mindful of learning techniques and study techniques that work well for you. There may be a free or low-cost study skills course on your campus. Take advantage of that. Make sure you get quality advising on courses to take for transfer (since that is your goal.) Good luck and happy learning! If you are on a commuter campus (instead of residential) make extra efforts to find a community of people on campus that you enjoy. ",
            "date": "Answered September 26, 2015",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sonna Ishak",
                    "user_href": "/profile/Sonna-Ishak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Stagliano",
                "href": "/profile/Tom-Stagliano"
            },
            "answer_text": "Keep in continuous communication with the \"guidance office\" at your community college, to make certain, that for which ever major you wish to pursue for an eventual bachelors degree, that you take the correct prerequisites on your current path to an AA degree so that you can immediately start as a junior at the top public colleges in your state. And:  Have some fun.  Budget your time and manage your time wellJoin clubs and organizations.   Play some intramural sports.Make some close friends, learn how to use a study group, and do well in your courses. ",
            "date": "Answered September 21, 2015",
            "views": "442",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dilys Fong",
                    "user_href": "/profile/Dilys-Fong"
                },
                {
                    "user_id": "Jojo Asante",
                    "user_href": "/profile/Jojo-Asante"
                },
                {
                    "user_id": "Matt Elsen",
                    "user_href": "/profile/Matt-Elsen-1"
                },
                {
                    "user_id": "Anirban Ray",
                    "user_href": "/profile/Anirban-Ray-6"
                }
            ]
        }
    ]
}