{
    "title": "I'm a 12-year-old interested in coding, but all the sites for kid coding seem like they're for 5-year-olds and they don't teach anything about coding. What are some recommendations? - Quora",
    "tags": [
        "Learning to Program Advice",
        "Beginning Computer Programming Advice",
        "Website Recommendations",
        "Learning to Program",
        "Teenagers and Teenage Years",
        "Technology",
        "Computer Programming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rashi Verma",
                "href": "/profile/Rashi-Verma-171"
            },
            "answer_text": "I am really happy that people of my age understand the importance and are taking interest in learning to code. Trust me, that is probably the best decision you’ll make. There’s a very high scope for your future if you carry this skill along with you. Well, I understand your situation very well. I’m a 14 year old and I went through the same thing a year back. I was really interested in coding but every platform taught coding like they’re teaching a 5 year old. I mean, just the basic stuff. I was really confused and wasted quite of my parent’s money until I stumbled upon WhiteHat Jr on day.  WhiteHat Jr specifically is for kids of age group of 6–18 year old. Their motive is to turn the kids into creators themselves. WhiteHat Jr not only helps the kid to learn coding but also their curriculum is designed in such a way that they face challenges every now and then which makes them to use their brain and thus it increases their problem solving capacity. They also unleash all of the creativity in a student. Their curriculum is divided into 4 parts starting from beginners curriculum to professional curriculum, depending on the level and course specification you want to pursue. I’d definitely recommend you to enroll yourself into WhiteHat Jr. It’s probably the best ed-tech you could possibly find on internet. They stand out from the other ed-tech companies. They provide online 1:1 interactive classes to their student at the comfort of their home. That’s just not it, you know the best part? You even get the flexibility of time. Yes, you heard that right. You can choose the timing of your class yourself. Teachers at WhiteHat Jr are highly qualified and know how to teach students in a way that teaches them coding along with adding values to their characters. You can even have a free live demo class, you may visit the site to get more details - Live Online Coding for Kids | WhiteHat Jr. ",
            "date": "Answered August 3, 2020",
            "views": "14",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carol T",
                    "user_href": "/profile/Carol-T-26"
                },
                {
                    "user_id": "Rachelle Pierce",
                    "user_href": "/profile/Rachelle-Pierce-11"
                },
                {
                    "user_id": "Ankanksha Ranjan",
                    "user_href": "/profile/Ankanksha-Ranjan"
                },
                {
                    "user_id": "Preeti Sharma",
                    "user_href": "/profile/Preeti-Sharma-3260"
                },
                {
                    "user_id": "Sharad Pandey",
                    "user_href": "/profile/Sharad-Pandey-247"
                },
                {
                    "user_id": "Priyanshu Shukla",
                    "user_href": "/profile/Priyanshu-Shukla-191"
                },
                {
                    "user_id": "Priyanka Sharma",
                    "user_href": "/profile/Priyanka-Sharma-7303"
                },
                {
                    "user_id": "Ramesh Sharma",
                    "user_href": "/profile/Ramesh-Sharma-1848"
                },
                {
                    "user_id": "Palak Aggrawal",
                    "user_href": "/profile/Palak-Aggrawal"
                },
                {
                    "user_id": "Aditya Rathore",
                    "user_href": "/profile/Aditya-Rathore-339"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ananya Suresh",
                "href": "/profile/Ananya-Suresh-34"
            },
            "answer_text": "My kids are both enrolled in coding classes with WhiteHat Jr. They’ve been on it since schools were closed due to the pandemic. They’re 7 and 13 years old. I was actually going to enroll my 7-year-old only because he was insistent that he wanted to learn how to be a better builder on Minecraft. And I don’t even know if coding has anything to do with that, but I found that he and others he met on the game we're talking about it there. Since he was going to be without school indefinitely, I agreed. At least he’ll learn something new. Nope, it’s not a kiddie class that won’t teach you anything about coding. WhiteHat Jr. seems to have some of the top instructors in the field and they really have those in-depth lessons that will force you to learn otherwise you won’t move forward. A few weeks in, my son already had what looked like a mobile app prototype. At first, he won’t admit it but my 13-year-old finally said that he wanted to join the classes too. I think he was pretty impressed at what a 7-year old can do after just a couple of weeks or so. Although my eldest doesn’t have any prior coding knowledge, he still received a different set of lessons but the goal to learn to code is still the same. It appeared that they adjust those lessons according to the learning and comprehension capability of a child. Don’t worry too much about being around pre-schoolers when you start coding classes. WhiteHat Jr is worth checking out since they make studying interesting and enjoyable. At the same time, it’s not all fun and games. You will learn something and if you take it seriously, you might just become an expert by the time you complete their courses—that’s something I look forward to for my kids as well. ",
            "date": "Answered June 21, 2020",
            "views": "17",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aria",
                    "user_href": "/profile/Aria-534"
                },
                {
                    "user_id": "Bipin Suri",
                    "user_href": "/profile/Bipin-Suri"
                },
                {
                    "user_id": "Theo Lucia",
                    "user_href": "/profile/Theo-Lucia"
                },
                {
                    "user_id": "Karthik Keramalu",
                    "user_href": "/profile/Karthik-Keramalu-1"
                },
                {
                    "user_id": "Drishti Jain",
                    "user_href": "/profile/Drishti-Jain-2"
                }
            ]
        }
    ]
}