{
    "title": "I'm accepted at Carnegie Mellon, Wisconsin, Purdue, and Michigan (none of them in-state). Should I go to CMU for computer science even though I'm a social person that likes to party (plus it is more expensive)? - Quora",
    "tags": [
        "Carnegie Mellon University",
        "Computer Science Education Advice",
        "Academic and Educational Advice",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wes Winn",
                "href": "/profile/Wes-Winn"
            },
            "answer_text": "Short answer: Choose CMU. Honestly, getting out, being more social, going to parties, etc. is going to mean stepping a little outside of your immediate circle. As much as I’ve gone out and had drinks and stuff with software professionals, your average CS student won’t be doing keg stands anytime soon. CMU still has fraternities and sororities and there will be plenty of students out to have a good time, not to mention the fact that you’re a half mile from University of Pittsburgh so you’ve got that many more students out and about in the area. CMU is an extremely big name in CS. Even if your end goal is just graduate, get a job as a software developer at some company, and look for a good job, CMU will help a lot. It’s as close as you can get to an automatic interview in this field. That may come with some extra work, but honestly, either you’ve got a knack for the subject or not. If I’d have taken my Washington courses at a one-off, no-name school, I still have to learn basically the same shit, and pass basically the same test. What you do get with CMU is a group of world class instructors, some of the best PhD candidates (who are also TAs/tutors) in the country, and an alumni network that can be extremely helpful. And you can still go party! That’s kind of what I’m driving at. Pick a school, any school. If you’re good with the CS work, you’ll have time to go have fun, and you’ll be branching out from your major anyways to go and meet people. Even a super party school like Central Washington University would’ve allowed me to lock myself away, completely geek out on CS stuff, and not be partying at all. Conversely, I got into all sorts of ridiculous shit with a buddy of mine in public policy because I took electives that exposed me to a variety of new potential friends. Like everything in college, you get out what you put in. Some places have slightly more an edge than others, but you have to capitalize on opportunities! ",
            "date": "Answered October 7, 2020",
            "views": "31",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jayam Thaker",
                    "user_href": "/profile/Jayam-Thaker"
                },
                {
                    "user_id": "Anirudh Kannan",
                    "user_href": "/profile/Anirudh-Kannan-3"
                },
                {
                    "user_id": "Trinh Quoc Anh",
                    "user_href": "/profile/Trinh-Quoc-Anh"
                },
                {
                    "user_id": "Alec Hund",
                    "user_href": "/profile/Alec-Hund"
                },
                {
                    "user_id": "Siddharth Mahapatra",
                    "user_href": "/profile/Siddharth-Mahapatra-10"
                },
                {
                    "user_id": "Siddarth Sampangi",
                    "user_href": "/profile/Siddarth-Sampangi"
                },
                {
                    "user_id": "Ricardo Macias",
                    "user_href": "/profile/Ricardo-Macias-3"
                },
                {
                    "user_id": "Nikhil Khare",
                    "user_href": "/profile/Nikhil-Khare-1"
                },
                {
                    "user_id": "Praveen Kumar Singh",
                    "user_href": "/profile/Praveen-Kumar-Singh-156"
                },
                {
                    "user_id": "Steven Knudsen",
                    "user_href": "/profile/Steven-Knudsen-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark McCartin-Lim",
                "href": "/profile/Mark-McCartin-Lim-1"
            },
            "answer_text": "Getting admitted to CMU for computer science is pretty much winning the lottery. Not going would be throwing away a winning lottery ticket. The other schools need a strong application but are not nearly as impressive. I am actually not sure why CMU SCS, being so competitive, admitted you when you admit you are more of a party person. They reject lots of kids who devote their whole lives to studying to CS. So my guess is they must have seen something special in you. Maybe you don’t see it in yourself yet. Or maybe they are wrong. In any case, this is a once in a lifetime opportunity. If you are serious about studying CS, you should go to CMU. If for some reason you get to CMU, and you find you hate your CS classes, then you can switch into another major. That is better than going to another school that might have a softer CS program than CMU’s (pretty much any other CS program), because if CS is really what you’re passionate about, and it’s what you see yourself having a career in, then you owe it to yourself to dive deep. That’s the quickest way to find out if it’s what you want to do a career in. Most people don’t get the opportunity to go to a CS program as rigorous as CMU’s. For most people, they either have to go to graduate school or work in industry for a couple decades to learn how deep the rabbit hole goes in CS. And if you do switch out of the CS major at CMU (or just hang out with other majors), I am sure you will find plenty of social kids in the humanities and arts there. Remember that CMU is good for other subjects besides CS. But even in CS, I am sure you will find some social kids at CMU. They just might be more of the “geeky social” kind, preferring board games, roleplaying and making robots as hobbies, to say going to bars or frat parties. Pittsburgh also has a big college scene because it has more than one university. CMU kids may party a bit less than Pitt kids, but you can ultimately find whatever social life you’re looking for in that city. At least, you can find whatever you would find in Ann Arbor (Michigan), Madison (Wisconsin), or Lafayette (Purdue). In fact, Purdue is a great school, but from what I have seen, its city is more boring than Pittsburgh for social life. And not it’s not quite in the same league as CMU for CS. Madison and Ann Arbor are big college towns I haven’t visited, but I doubt that they have much if anything Pittsburgh doesn’t. Neither even has a major airport, and Pittsburgh does. Obviously, all these places pale in social life compared to NYC and LA. If you really care about social life, you should have applied to Columbia or USC. Then again, if you’re looking for that extra geeky social life that’s very non-NYC, then CMU may actually be better for that because it’s nerd HQ there. My point is that unless CMU is going to put you into massive debt, I can’t really think of a reason to choose any of the other three schools over them, unless you want to be a humanitarian and help someone get off of CMU’s waitlist. Worst case scenario, CMU made a mistake admitting you over the next guy on the waiting list, but that’s their bad not yours. ",
            "date": "Answered October 22, 2020",
            "views": "203",
            "upvotes": "0"
        }
    ]
}