{
    "title": "I'm about to start university. What type of tablet would a student best recommend for note-taking? - Quora",
    "tags": [
        "Note Taking",
        "Computer Advice",
        "Notes",
        "Tablet Devices",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ilias Ryspaev",
                "href": "/profile/Ilias-Ryspaev"
            },
            "answer_text": "I have tried several options. First was with note 4 mobile phone with a s-pen,second with note 10.1 2014 with s-pen,note 12.1 with s-pen,a simple Wacom tablet.In the end what worked for me best was simple paper + good pen + Evernote Premium. (Ocasionally I use the wacom tablet with MS onenote)Knowledge management system. Saving and retrieving information. What in the end helped me most with the decision was to use Elons approach to reason up from first principle. My goal is to efficiently download knowledge into my brain. To do that I need to map the to be acquired knowledge in a way that every bit is systematically connected to all the rest. And the most important part is to retrieve with the most minimum effort possible. Even such simple task as looking up in a content, or finding the content itself takes some seconds. So I needed first to choose best suited infrastructure. Using the various listed above devices I could store my notes in the cloud (Dropbox, Google drive, …). Retrieving from there is very similar to local computer file system. Searching for bits of information there, is hard. Google docs or Microsoft Word, the online cloud versions offer better search results compared to Dropbox et.al. solution but still, there are better storing and searching options. The second best solution for me was one note and the best solution Evernote. Devices. Note 4(and now its successors) is a big mobile phone. It's advantages were its availability, you carry it always with yourself. It has good camera to snap pictures into your notes. It is possible to increase its internal storage. Battery is replaceble. In landscape mode it has similar width like a A4 paper. Cons were its size, meaning the constant need to manually scroll down, the thickness unlike a thin paper. Few seconds of delays when opening/clothing camera or automatic turning off the screen to save battery. Note 10.1 and Note 12 from Samsung. Great devices to take notes. Downsides were the battery needs to be charged every 6 - 10 hours. Wacom Tablet. Easy to use. It just works. Great to take notes with it, especially with engineering subjects, where one needs to juggle around with long complicated formulas, which you need to copy to 99%. You just copy and edit the few parts, it helps to accelerate exercising tremendously. ",
            "date": "Answered January 5, 2019",
            "views": "628",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edward Claro Mader",
                "href": "/profile/Edward-Claro-Mader"
            },
            "answer_text": "A good stylus for making diagrams is an active stylus not a capacitive stylus. This limits your choice to a Windows-based or an Android-based tablet. As far as I know Apple does not have a tablet equipped with an active stylus, but this may change under Tim Cook's leadership. So between a Windows tablet and an Android tablet which one would you pick? I had experience using two old Android tablets (Asus Transformer, Samsung Galaxy Tab first gen) and three Windows tablets (Asus, Dell Latitude 10, Dell Venue Pro 7) but only the Dell Venue Pro supports an active stylus. It's fine but it could be better. The choice depends on your answer to a few questions: 1.  What's your (or your parents') budget?Most  large screen (10\" or more) tablets that have good active stylus support will cost >$500 and perhaps close to $1,000 if you pick one with 128GB SSD and faster CPUs. Right now it will be a toss up between Samsung Galaxy Note 10 (SGN) and Microsoft Surface Pro 3 (SP3). I'm not aware of any Android tablet with active pen that can match the SGN10 but there are Win-based tablets from third parties that just as good or better than SP3.  2. What size is right for you?7-8\" or 10-11\" or 12-13\" or >13\". It's hard to find an Android tablet > 11\". There are more options on the Windows side. My son uses a Sony VAIO duo hybrid (13\") but most tablet manufacturers can offer you the size you want, including Lenovo, Dell, HP, Acer, and Asus. 3. Do you prefer a particular pen recognition mechanism?I have a bias towards Wacom-based pens. Note that Asus just relased a cheap 7-inch tablet with Wacom support. The Dell Venue Pro (the one I have) and the Sony Vaio Duo 13 (my son's hybrid) use the N-Trig pens, I think. SP3 is also not Wacom. A few models are coming out  1-2 months that are Wacom based. HP is due to release a 13\" and 15\" hybrid (tablet/laptop convertible) in a few weeks (see picture below). 4. Will you use the tablet for other tasks besides note-taking?Do you want a tablet that can also serve as a laptop and/or a desktop PC (with or without a docking station)? Or do you prefer a separate tablet/desktop PC?  I have a bias towards hybrids since I've been using them for a while now. You can still get a tablet only and buy a separate Bluetooth keyboard. But IMO, Bluetooth devices are always problematic. 5. Are you tied up to a particular suite or ecosystem? MS Office and OneNote is now available in all platforms, so this is not much of a deal breaker. However, the soon-to-be released or announced touch-version of MS Office will be optimized more for-- you guessed it-- Windows 8.1 or higher.  ----------------Here's the next hybrid that makes me drool-- the HP Envy 15.5\" hybrid, though I would definitely wait for reviews to come in before spending $1000. I read that Apple will release new iPads in a few weeks. I was hoping they start supporting active pens. If they do, then you may want to consider them as well. Hope this answer is helpful. All the best.   ",
            "date": "Updated September 24, 2014",
            "views": "43",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saurabh Pitre",
                    "user_href": "/profile/Saurabh-Pitre"
                },
                {
                    "user_id": "Nachiket Deshpande",
                    "user_href": "/profile/Nachiket-Deshpande-4"
                },
                {
                    "user_id": "Jesse Beasley",
                    "user_href": "/profile/Jesse-Beasley"
                },
                {
                    "user_id": "Jeff Wright",
                    "user_href": "/profile/Jeff-Wright-10"
                },
                {
                    "user_id": "Annie Cielo Mader",
                    "user_href": "/profile/Annie-Cielo-Mader-2"
                },
                {
                    "user_id": "Navneet Viswanadha",
                    "user_href": "/profile/Navneet-Viswanadha-1"
                },
                {
                    "user_id": "Ben Llave Mader",
                    "user_href": "/profile/Ben-Llave-Mader"
                },
                {
                    "user_id": "Kiran",
                    "user_href": "/profile/Kiran-1001"
                },
                {
                    "user_id": "Artem Kliatchkine",
                    "user_href": "/profile/Artem-Kliatchkine"
                },
                {
                    "user_id": "Vyoma Madaan",
                    "user_href": "/profile/Vyoma-Madaan"
                }
            ]
        }
    ]
}