{
    "title": "If all the computers on earth (including smart phones, tablets, etc.) disappeared tomorrow, how long would it take to get back to the functionality we have today? - Quora",
    "tags": [
        "Apocalyptic and Post-Apocalyptic Hypothetical Scenarios",
        "Tablet Devices",
        "Computer Science",
        "Computers",
        "Technology",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Rolph",
                "href": "/profile/Don-Rolph"
            },
            "answer_text": "Your question as stated allows for a variety of loop holes. Lets explore, your question is: “If all the computers on earth (including smart phones, tablets, etc.) disappeared tomorrow” Notice that as stated, this did not include the parts for the computers. Nor did it include the manufacturing facilities. Nor did it include the electrical generation equipment. Nor did include anything but the computers in the vehicles: older vehicles will still work. Amusingly, thanks to radios, communications could (just) be maintained. Under these conditions a carefully crafted effort to leverage the parts remaining could boot strap the necessary computers fairly quickly and recovery is therefore measured in years of at most decades. Since this is relatively uninteresting, lets remove all semiconductors. This takes us back to the technology before about 1950. This is harder, because we would have to build non-computerized tube facilities to get electronics working again, communications would now be seriously disrupted (there are tube based radios, but very few). Recovery now takes decades to most of a century. We have a major die off during the recovery. So lets remove all electrical generating capacity and transmission infrastructure: we are now back to the 1880s or so. We now have a major die off (2/3 or more of the country perhaps). Technically since we know the technology, recovery could be faster than our history but the die off will impact our ability to govern and organize: perhaps one to two centuries, although possibly never. Technology is layered. Skim off only the top and recovery is quick. Skim off increasingly deep layers and, given our present dependence on technology, the impact becomes larger and larger. ",
            "date": "Answered June 19, 2018",
            "views": "148",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Maxwell",
                "href": "/profile/Richard-Maxwell-23"
            },
            "answer_text": "Sweet, merciful lord. You are one evil, sadistic, individual. Removing anything and everything that resembles a computer and then asking a technological society how long it will take to get everything back in working order. I like the way you think. This isn’t quite a Dave Consiglio Everyone Dies scenario, but I like it. Everyone will be affected in different levels. Third world countries will likely be the least impacted, since they are just starting to get ‘computerized’. Developing and First world countries will be impacted the worst, most developing countries economies are dependent on those, lazy, first worlders to buy their cheaper goods and the first world countries are just screwed. Too much technology dependence. Well, the first few things that come to my mind (from the view of a US citizen) are that society as we know it now will collapse and we will backslide quite a few decades, perhaps even a century or more. You do realize that world stock markets are all computer controlled these days? How about when you try getting cash from the ATM machine, because ALL THE STUPID CREDIT MACHINES ARE GONE. Will you demand that the teller give you ‘money’ (Those damn ATM machines never work when you need them to) and stare at them blankly when they tell you their computers are gone and they can’t pull up any information about your account or how much money you have stored with them. Can you say ‘global economy crash’? Our money is no longer based on gold or silver, but on some defined ‘value’ of our economic value. What do you do when there is no ‘value’ and nothing backing it up? You know all those fancy flying things (I like to call them airplanes)? They are going to make 911 look like piloting error when the thousands of them currently in the air around the world start falling all over major and minor cities. Every package waiting for a flight, FedEx, UPS, Amazon, the blood bank, that guy transporting a donor heart, all waiting an an airport that has just become useless. But, you won’t know about that because the news networks depend upon computers for communication. Along with that: That cargo ship with all of those awesome (insert the name of any country that produces and exports a product) (insert product name from previously mentioned country) is now a floating island in the ocean and will never deliver it’s thousands of tons of goods your/my country. Well, go ahead and text your bff … err, never mind that. Call them on your .. (Gosh, cutting the cord might not have been the best idea now). Well go to a payphone… (Where did those stupid things go? You couldn’t throw a rock and not hit a payphone). That old guy across the street? Sorry, I got an Xfinity bundle and their ‘VOIP’ phone service died along with every cellphone in existence. Why can’t you just Skype … hmm. Well, let me drive over to mom’s house and see how they are doing … now why won’t my Nissan Leaf start? It’s not like a car is a computer or anything, it’s a car … controlled by computer. Whew, well at least I don’t have to worry about running out of power. Our city is powered by a nuclear reactor and they don’t have to worry about fuel. Besides if one starts to get too hot, they have computer controls that …uhhh. Oh dear. Well, the coal power plants can still run … (not knowing about the amounts of automation in mining and mining equipment) … (or the computer management and computer systems in freight trains and tractor trailers or every other transportation system more advanced than a mule and cart) or … Ughh, well the sun will always shine so solar power will always be available, we just need to manufacture more …well, shoot. PS: You know all of those satellite things up in space? They are now just floating hunks of garbage now that the computers inside them are all gone and you might be surprised by the amount of information that used to flow through those things back when they had computers inside them. Sigh, I do pity those poor people on the ISS, can they manually undock and fly their escape capsule back to earth safely without any computer systems? No electricity means no manufacturing. No manufacturing means no microchips. No microchips means no computers. No computers means …(refer to the beginning of this paragraph for continuation of reading) Well, the Government will fix all of this! Right? Hello? Hey … Hmm, well the Federal Government can’t communicate with the State and Local authorities with all the phone systems down and that electricity stuff has become very addictive. Things will lapse back to local autonomy with information being passed by hand on paper. I would surmise that the governments would move quickly to secure things like fuel and food, rationing will become strict. Hopefully, they will listen to their think tanks that will tell them what steps they need to follow to produce the needed microprocessors to power each step of clawing our way back. There will be a mass exodus from cities back into more rural areas. No sewage, no running water, no food deliveries, no electricity, no heat, no AC, no … yeah. Cities are dependent upon their outlying and rural areas for support and a breakdown in communications and transportation will be rather severe on a town or city, the larger it is the worse it will be. I can see starvation being rampant if the recovery takes more than a few months. I see diseases coming to haunt us, that whole no sewage thing will be a bummer, specially if you don’t have any place to dig a proper outhouse. Hoarding would be common. Murder would rise, impressively. Why should you sit and starve while some jerk down the street sits on his fat ass. You got a gun (or a knife or a spear or a club or a …) and he has to sleep some time. Personally, I hope things like that would never come to pass; but the human animal has this nasty thing called a survival instinct that is a pretty powerful thing to overcome. Would we recover from this? Certainly. How long would it take? I could not even begin to guess. Communications, transportation, manufacturing, power generation, all of them gutted and broken, dependent upon those annoying computer thingies. If governments move swift and coordinate things quickly and efficiently AND the people stay calm and play nice with everyone else, I can see things coming back within a few months. If the chain breaks somewhere, it could be years or decades getting everything back up and the world would be a different place then. ",
            "date": "Answered June 18, 2018",
            "views": "203",
            "upvotes": " View 45 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonathan Fu",
                    "user_href": "/profile/Jonathan-Fu-6"
                },
                {
                    "user_id": "John Tilghman",
                    "user_href": "/profile/John-Tilghman"
                },
                {
                    "user_id": "Martin Wierimaa",
                    "user_href": "/profile/Martin-Wierimaa"
                },
                {
                    "user_id": "Willian Molinari",
                    "user_href": "/profile/Willian-Molinari"
                },
                {
                    "user_id": "Sam Ashton",
                    "user_href": "/profile/Sam-Ashton-16"
                },
                {
                    "user_id": "Wayne Ansell",
                    "user_href": "/profile/Wayne-Ansell-3"
                },
                {
                    "user_id": "Caden Blackman",
                    "user_href": "/profile/Caden-Blackman"
                },
                {
                    "user_id": "Richard Lione",
                    "user_href": "/profile/Richard-Lione"
                },
                {
                    "user_id": "Gary Madsen",
                    "user_href": "/profile/Gary-Madsen-9"
                },
                {
                    "user_id": "Maxwell Zen",
                    "user_href": "/profile/Maxwell-Zen"
                }
            ]
        }
    ]
}