{
    "title": "If a German pilot had to parachute out of his aeroplane over Britain during the 'Battle of Britain', what usually happened to him afterwards if he landed without injury? - Quora",
    "tags": [
        "Battle of Britain (WWII)",
        "Luftwaffe",
        "Bombers",
        "Fighter Aircraft",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Airplane Piloting",
        "Great Britain",
        "Aviation",
        "World War II",
        "Germany",
        "The United Kingdom",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Harry Linfield",
                "href": "/profile/Harry-Linfield"
            },
            "answer_text": "People like my dad, Home Guard, always had his rifle near to hand during air raids. Altho’ we were a couple of miles from town, there was a siren on the outskirts on our side & we could hear it all through the village, usually with plenty of time to take whatever shelter available. Contrary to what you may think, it was only the wealthy who had installed Anderson Shelters. Everyone else jumped into ditches if they were out, or under the kitchen table if we were at home. There was no chance we would be deliberately bombed, but there were several jettisoned by “wounded” bombers scuttling back for the Channel for home, one of which has been a pond ever since the next day. However, there was absolutely tons of metal coming out of the sky, from machine guns to AA shrapnel, so you kept you head down when it all started. The German formations had nearly always been scattered by the time they reached us, & most we saw were little more than silver specks in the sky, until they were returning. Later on, we had 3 POW’s working with us, & altho’ raids were very few & far between by then, these seemed to be able to hear their planes a few minutes before we did, & were running like hell for the hedge & ditch around the field. One of us had to stay with the horses & walk them to the edge of the field, & hope Gerry decided to keep his ammo for any Hurricane that happened along. I only know about one parachutist coming down in one of our fields, but we were less than 1/4 mile from an army camp, so Dad (with fixed “Belly-poker” Bayonet) & prisoner met the soldiers about halfway. I used to wonder why the PoW’s we had didn’t overpower Dad (they seemed to be twice his size & half his age) & run for home, After all, if the Canadians could fly out early morning & start coming home in mid afternoon, it couldn’t be far, could it? NB: “Belly-Poker” was probably Dad’s name for it, Officially a Mk2 Spike & I doubt anyone would have “liked it up’em”! It survived until the 1990’s as a useful tool for extracting stapled from fence-posts ",
            "date": "Answered October 30, 2020",
            "views": "243",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Meller",
                    "user_href": "/profile/Alexander-Meller-1"
                },
                {
                    "user_id": "Nikki Hayman Johns",
                    "user_href": "/profile/Nikki-Hayman-Johns"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Dukesh",
                "href": "/profile/George-Dukesh"
            },
            "answer_text": "They got made a prisoner. Usually interrogated, then sent to a POW camp. True story. My mother lived in Kent during the Battle of Britain, she and her friends often watched the planes fighting. One day, they saw a plane shot down. They knew it was a German Aircraft , and they saw the pilot bale out, and his parachute land in a field not far away. So they cycled over to the field. On the way, they met the local gamekeeper, on his bike, who had seen it too. He had his shotgun with him. They all went to the field. They saw the parachute laying in the field. As they went across the field, the pilot stood up from behind some hay bales, with his hands up. The gamekeeper pointed his shotgun at him. The pilot shouted in English “ hallo! “ he pointed at his waist where he had a pistol “ I give you gun!” And slowly pulled it out and threw it . “ my leg hurts” They went up to to him; and said “ sit down, it’s OK” My mother was a nurse. she spoke some German, as she had an Austrian cousin. It turned out that he also spokequhite good English. She had a look at his leg, it seemed his ankle was badly sprained. The gamekeeper gave him a cigarette. They decided that they should take him to the farmhouse while they waited for the police. They helped him across the field and got him to the farm house . Grandmother already had the kettle on so they had tea while the farmhand was sent to find the local policeman. About an hour later, he arrived, with two members of the local home guard in a car and the local doctor Every one saluted each other; the doctor strapped up his ankle. They all had some more tea , then the policeman said “” well sir, we have to take you to the police station, and wait for the Army to come and get you “ “Of course, thank you for the tea”. And off they went. Thé follow up is that in 1950, there was a knock on the door, and it was the pilot. He had spent the rest of the war as a POW in Scotland, then returned to Germany, and had got a job as a civil engineer, rebuilding Germany. He was visiting on business. He became a family friend. ",
            "date": "Answered October 8, 2020",
            "views": "725",
            "upvotes": " View 7K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Laura Hollister",
                    "user_href": "/profile/Laura-Hollister-6"
                },
                {
                    "user_id": "Clive Anderson",
                    "user_href": "/profile/Clive-Anderson-1"
                },
                {
                    "user_id": "Tom Wildy",
                    "user_href": "/profile/Tom-Wildy"
                },
                {
                    "user_id": "Gary Schuster",
                    "user_href": "/profile/Gary-Schuster-8"
                },
                {
                    "user_id": "Gregory Garland",
                    "user_href": "/profile/Gregory-Garland-1"
                },
                {
                    "user_id": "Garry Reimer",
                    "user_href": "/profile/Garry-Reimer-2"
                },
                {
                    "user_id": "John Chesire",
                    "user_href": "/profile/John-Chesire"
                },
                {
                    "user_id": "Carl Atkins",
                    "user_href": "/profile/Carl-Atkins-7"
                },
                {
                    "user_id": "Mike Dunning",
                    "user_href": "/profile/Mike-Dunning-8"
                },
                {
                    "user_id": "Chris Beatty",
                    "user_href": "/profile/Chris-Beatty-1"
                }
            ]
        }
    ]
}