{
    "title": "If buying a Tesla is a lifelong investment, why are people selling theirs? - Quora",
    "tags": [
        "Tesla Model S",
        "Electric Vehicles",
        "Electric Cars",
        "Tesla (company)",
        "Car Buying",
        "Investment Advice",
        "Personal Finance",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fateh Khalsa",
                "href": "/profile/Fateh-Khalsa"
            },
            "answer_text": "Not a Tesla owner here, but I think you could liken it a bit to buying an iPhone: Teslas are very technology focused products, so they actually have a lot more to do with the technology market than they do with typical automobiles. Apple designs their iPhones (and all of their other products, honestly) to be able to last many many years, with really only one main component that degrades and needs replacement in the short run - the battery. Anything else is just repairing damage caused by accidents (like cracked screens), not normal use. Tesla also designs their cars to last much longer than the typical automobile, with the only part needing regular replacement in the medium/short term (aside from damage caused in accidents) being… the battery! People could theoretically keep their iPhone for 5 or 6 years, with nothing being replaced except for the battery every two or so years - and it would work fine!! However, technology evolves, and by the time the latest iPhone is out, it has many new and exciting technological features out that previous iPhones don’t have, and even though their old phone works fine, they’d rather trade it in or sell it, and pay a bit more to have the new one with all the latest features and styling. This becomes an even easier decision if your phone already needed a battery replacement, or if you’re in a lease-equivalent model where you pay a monthly payment for the phone, and just get a new one every two years, and always have the payment. It’s the exact same situation with Teslas! Theoretically they’re built to last many many years, but every few years there are newer models with better and/or more interesting features (FSD?) and styling. So people decide to upgrade! Which becomes an especially easy decision if you’re already at a place where your battery is losing some of its original range/life, or if you’re in a leasing situation where you’re always going to have a monthly payment, and you might as well trade in and get the newest model :) Just my thoughts/analogy on it however! I’m not a Tesla owner, so I’d take this alongside all of the other more qualified comments from actual people who have direct experience! ",
            "date": "Answered February 13, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Doug Guderian",
                "href": "/profile/Doug-Guderian"
            },
            "answer_text": "There are always people who want and can afford the latest and greatest features in the newest models. Most of us have at least one friend who gets a new car every 6 to 18 months regardless of how it is performing. They just love having new cars. The reasons people sell Teslas are the same reasons that people sell any kind of cars at various millage points: coming off warrentee and the associated worries and perceived concerns about repairscoming off a leasechange of life situations - like being too old to drive or loosing your licenceunexpected financial challengesI typically drive my cars to about 200,000 km and at that point enough negative factors add up for me to replace the car. I expect that I will be driving my Tesla at least twice that far to 400,000 km because at this point (127,000 km) it is performing , feeling and looking like my other vehicles have at half the mileage. I will probably sell it or give it to one of my kids though before the end of its useful life because i want something more up to date and newer cleaner and more feature rich. If you check the stats, people with Teslas have higher satisfaction rates with their cars and turn them over less frequently than other cars, but the turnover numbers will never be zero. ",
            "date": "Answered January 24, 2020",
            "views": "42",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jerome A Atkinson",
                    "user_href": "/profile/Jerome-A-Atkinson"
                },
                {
                    "user_id": "Richard Petek",
                    "user_href": "/profile/Richard-Petek"
                },
                {
                    "user_id": "Greg Tsatsanis",
                    "user_href": "/profile/Greg-Tsatsanis"
                },
                {
                    "user_id": "David Lo",
                    "user_href": "/profile/David-Lo-50"
                },
                {
                    "user_id": "Jack Aubrey",
                    "user_href": "/profile/Jack-Aubrey-18"
                }
            ]
        }
    ]
}