{
    "title": "If cell phones are essentially just radios, why can't anyone just build a receiver to listen to calls? - Quora",
    "tags": [
        "Radio Stations",
        "Radio",
        "Telephones",
        "Wireless Technology",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Harvey",
                "href": "/profile/Robert-Harvey-41"
            },
            "answer_text": "Originally Answered: If cell phones are essentially just radios, why can't anyone just build a receiver to listen to calls? Oh you can. But you won’t understand what you are hearing. Beware of that silly word just. It tends to stop people thinking. Of Course a cellphone, at its most fundamental, is a radio transciever. It needs to be that because connection to the tower is by radio. But what is sent, and received is digital data, modulated in something like QAM. So witn a simple radio receiver, you would hear mush. You would need to understand the modulation scheme and build a matching demodulator. And you might be able to do that too. Congratulations. You now have a stream of 1s and 0s, with certain mathematical properties, like matching parity. But you don’t know what they mean . Which of them are control messages, which of them are digitised speech. Because the structure is both complex and encrytpted. ",
            "date": "Answered October 21, 2020",
            "views": "388",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Wilson",
                    "user_href": "/profile/Alan-Wilson-9"
                },
                {
                    "user_id": "Doug Scott",
                    "user_href": "/profile/Doug-Scott-29"
                },
                {
                    "user_id": "Robert Taylor",
                    "user_href": "/profile/Robert-Taylor-315"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nguyen Tran",
                "href": "/profile/Nguyen-Tran-310"
            },
            "answer_text": "Because they are not essentially radios anymore. Now they are cameras, maps, Internet portals, health trackers, social media, calculators, notebooks, etc. The normal call function of cellphones is rarely used nowadays. ",
            "date": "Answered October 21, 2020",
            "views": "225",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Bullen",
                    "user_href": "/profile/David-Bullen-5"
                }
            ]
        }
    ]
}