{
    "title": "If everything at a restaurant is 50% off, do you tip on the total price before or after the discount? - Quora",
    "tags": [
        "Restaurant Etiquette",
        "Waiters and Waitresses",
        "Tipping",
        "Discounts",
        "Manners and Etiquette",
        "Restaurants"
    ],
    "response": [
        {
            "author_info": {
                "name": "Timothy VanMeter",
                "href": "/profile/Timothy-VanMeter"
            },
            "answer_text": "So, despite what people want you to believe. Tipping is 100% optional. please hear me out. If tipping was not optional it would be added onto your bill automatically or included in the price. Instead the establishment leaves you the option to do so. A restaurant is 100% required by law to pay its employees minimum wage. That being said if a server makes 0 tips the place will then have to pay the difference. This is the law. They get away with paying less because people tip. I know this is a flawed system and I do tip. Very well, but I tip based on the service I get. If I’m treated like royalty or we cause problems I will generally tip up to 25% if we order drinks but the service is shit I will give 5% that way the person doesn’t have to pay to have had to wait on me. Do not let anybody tell you tip is anything but optional. Whether you agree with the system or not it is optional. There is no law requiring you to tip. And the fact that servers choose to wait tables is because they make decent money a lot of which is in cash and not reportable. You tip based on what you see fair and not a penny more. Until people stop tipping and forcing companies to pay their own employees things will never change. Remember a tip is a way of saying good job not here’s 5$ because your employer doesn’t think your worth minimum wage. I am by no means telling anybody not to tip. It’s an unfortunate system and it hurts the employees. However most servers know that people will tip how they tip regardless of if the service is good or bad. Which is the flip side of this messed up system. Which is why you should tip what you feel is fair and not a penny more. To answer your question… do you feel your server is worth less money because you got a discount? ",
            "date": "Answered May 6, 2019",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darlene Cumberland",
                    "user_href": "/profile/Darlene-Cumberland"
                },
                {
                    "user_id": "Scott Woods",
                    "user_href": "/profile/Scott-Woods-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Seymour III",
                "href": "/profile/George-Seymour-III-1"
            },
            "answer_text": "ALWAYS tip on the pre-discounted amount, regardless of whether the discount is a coupon, a gift card, the manager knows you and comped part of your meal, etc. The server didn’t do fifty percent less work than usual, did they? And you’ll still save money; if the bill was $100 and you tip 25% as a rule, then you’d spend $125. If your bill is half off then your total would be ($50+$25) $75, $50 less than you would have/intended to spend. At this point you could throw a little extra in for the server and still come out ahead, js…. ",
            "date": "Answered May 6, 2019",
            "views": "249",
            "upvotes": " Answer requested by Jake Champion"
        }
    ]
}