{
    "title": "If I feel that I should have joined the armed forces but did not, what are my career options now? - Quora",
    "tags": [
        "Armed Forces",
        "Military",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Romil Shendre",
                "href": "/profile/Romil-Shendre"
            },
            "answer_text": " (the above image is from Indian Army official face-book page)I think that you may be definitely be coming under one of this entryjoining in the Army means a person is highly patriotic or keen to see the change in the country.their are hell lot of option open for you 0nly determination willpower to do the thing is neededone of the inspirational story i want to share with you Every one must have heard about Asia biggest slum i.e DHARAVI slum. some of the youth come forward and started tourism business. They opened the website and foreign people come to dharavi nowadays to see what is dharavi all about.you will shocked when you will visit dharavi, you will find small industries imagine industry inside slum.whatever you do don't just do it for money or success you know that 3 idiots dialog Baccha kabil bano, kabil ... kamyabi to sali jhak maar ke peeche bhagegiDo whatever good things in your life, just think that you will not get another life.thanks for a2a. ",
            "date": "Answered March 22, 2015",
            "views": "241",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajarshi Chakraborti",
                "href": "/profile/Rajarshi-Chakraborti-1"
            },
            "answer_text": "If you still have the age, go for it. If not, or do not want to go it, you cannot select a \"profession/occupation\" to see how it feels. Its not possible. ",
            "date": "Answered March 22, 2015",
            "views": "88",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arunima Ghosh",
                    "user_href": "/profile/Arunima-Ghosh-57"
                },
                {
                    "user_id": "Ashmita Nair",
                    "user_href": "/profile/Ashmita-Nair-1"
                },
                {
                    "user_id": "Ashutosh Mukherjee",
                    "user_href": "/profile/Ashutosh-Mukherjee-30"
                },
                {
                    "user_id": "Anwesha Dey",
                    "user_href": "/profile/Anwesha-Dey-19"
                },
                {
                    "user_id": "Partha Das",
                    "user_href": "/profile/Partha-Das-172"
                },
                {
                    "user_id": "Goutam Sutradhar",
                    "user_href": "/profile/Goutam-Sutradhar-2"
                }
            ]
        }
    ]
}