{
    "title": "If lasting happiness is not in money, comforts and luxuries, where is it to be found? - Quora",
    "tags": [
        "Luxuries",
        "Sources of Happiness",
        "Comfort",
        "Developing and Maintaining Happiness",
        "Happiness",
        "Wanting and Making Money",
        "Money",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harsh Goel",
                "href": "/profile/Harsh-Goel-1"
            },
            "answer_text": "Bhagavad Geeta - Chapter 4, Shlok 41 Shri Krishna talks about 3 yoga- Karam,Gyaan&Sanyas all combined. Karam Yog- You have to perform all the duties based on your identity.If you are a son, it’s your duty to take care of your parents,if you are an entrepreneur it’s your duty to solve problems,if you are a doctor, it’s your duty to save lives of patients.Sanyas Yog- you have to be detached from the results of your actionYou have to take care of your parents irrespective of their behaviour toward you.you have to solve problems irrespective of profit & lossyou have to save patients irrespective of his ability to payGyaan Yog - whether you are rich or poor, please remember there is a mysterious divine force which is either testing you or trying you.if something good or bad happens it’s because of the almighty whether the business falls apart, the parents fall sick or the patient dies during the surgery.when you know this secret of life- You become a KaramGyaansanyasi & that is enlightenment. I call them the Wise Saint Warriors of 21st century. ",
            "date": "Answered May 25, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ekta Singh",
                "href": "/profile/Ekta-Singh-1137"
            },
            "answer_text": "It's very simple ….it is to be found in you. ",
            "date": "Answered May 19, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ankit Sharma",
                    "user_href": "/profile/Ankit-Sharma-7467"
                }
            ]
        }
    ]
}