{
    "title": "If my PC is not working, what should I check? - Quora",
    "tags": [
        "Personal Computers",
        "PC Gaming "
    ],
    "response": [
        {
            "author_info": {
                "name": "Aman Pandey",
                "href": "/profile/Aman-Pandey-304"
            },
            "answer_text": "I think i will suggest u all the possible ways,which u can try yourself,If your PC(Desktop) dosen’t starts because it happend with me just a week ago. First of let me tell some reasons for which PC doesn’t starts…starting from Common Reasons to the Wrost One’s. 1.Loose Wire Cables or Broken Cables. 2.Loose RAM or Dust In RAM Slots. 3.Lots of DUST in Heat Sink i.e. Over Processor. 3.CMOS Failure i.e. CMOS battery is no longer usable i.e Not able store BIOS Settings.(Sometimes). 5.Failure of RAM(you will expreiance a beep sequence in case of RAM failure which differ manufacturer to manufacturer). 6.BIOS Failure(CMOS Failure Leads to BIOS Failure). 7.PSU Failure(Repairable). 8.Motherboard Failure(In Very Rare Cases). 9.Processor Failure(Rarest of Rare). Now,I have told u all the possible reasons of which PC fails to start,Now i wil tell you how to ensure the issuue and hoe far You can Fix of it. 1.Check all the cables are ok not broken and they r seated properly for Further surety remove all the cables from Motherboard and reseat them Again specially thye 24PIN and 4Pin power cable. 2.Reseat the RAM,you may use blower to blow dust out but safely. 3.Clean the heat sink and reseat it with some new thermal paste. 4.Reseat the CMOS battery or Change it. 5.For the RAM failure check the Beep sound,and replace it. 6.Change the PSU and try again to start the PC. 7.For Processor failure You will also experience beep sequence.(FOR Beep sequence meaning checkout your PC or motherboard manufacturer) 8.Now the last option left is failure of motherboard,to make sure that your motherboard is no longer of use just remove the RAM sticks and turn ON the PC if it beeps then your Mother board is working Fine otherwise it’s dead now….but always start this things from 1st step i.e. checking the cables and reseating them. Lastly Only Do all of these if u have at least a slightly knowledge of doing these things….otherwise it will be best to visit the repair shop.:) THANKs! ",
            "date": "Answered September 30, 2018",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "E Education",
                    "user_href": "/profile/E-Education-6"
                },
                {
                    "user_id": "Nizamul Hoque",
                    "user_href": "/profile/Nizamul-Hoque-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sukhdeva Negi",
                "href": "/profile/Sukhdeva-Negi"
            },
            "answer_text": "When PC is not working, proceed step by step: 1.Check power, power cable or UPS, if using one. 2. PC on-off switch.when switching on check the LED indicator (Red led). 3. Check monitor, display cable (VGA cable) connected to PC. 4. If powering on, still you don't see anything on screen, it may be some hardware issue. Have to check inside your PC, i.e. RAM in most of the cases. 5. Otherwise it may be of motherboard issue. In this case, you have to take it to the nearest service center. 6. If you see some display on screen but not able to see Windows. Then probably, Windows OS is corrupt. 7. You can run recovery or clean install, but be sure of your data, it can be lost during process. If you are not sure,what to do, take PC to nearest support center.Though he may charge for this work to be done. Happy troubleshooting… ",
            "date": "Answered October 24, 2020",
            "views": "19",
            "upvotes": "0"
        }
    ]
}