{
    "title": "If NASA wanted to create the fastest spacecraft there ever was, then what would be its properties, how large would it be, how much would it cost and how fast would it be? - Quora",
    "tags": [
        "Spacecraft",
        "NASA",
        "Space Travel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Carson",
                "href": "/profile/Alexander-Carson-5"
            },
            "answer_text": "The “slam a ball bearing into the sun” answer is probably the most plausible, but with ridiculous amounts of funding, NASA can probably do better.  Source In the 1970s, some British researchers started to wonder how dificult it would be to go to other stars. It turns out that the only way to pack enough fuel density that is even remotely close to technical feasibility is nuclear fusion. So what does one do? Build a multi-stage fusion rocket, of course! The spacecraft, Project Daedalus, shown on right in the picture, would cost over $5 trillion, exceeding one year of Japan’s economic production, to build. However, it would be able to move at 7.1% of the speed of light, as well as reaching another solar system. Of course, that’s not the only nuclear solution to the problem of traveling really fast…  (Same image source as above) Nuclear Pulse Propulsion, or NPP, is a far more well-known scheme for interstellar rocketry. The idea is just to load a very resilient shell full of nuclear weapons, detonate the bombs one-by-one, and ride the blasts. Though estimates vary, it would probably have similar speeds and costs to Project Daedalus. Of course, there’s an even better, and far cheaper, solution:  (Source) This has a lot of the same “spirit-of-the-question” issues as the “chuck a metal ball into the Sun” answer, but just shine a flashlight. Photons of light move at the speed of light (duh), so NASA can just point a flashlight up and turn it on! This would set an unbreakable speed record for any space thing for, according to the link, only $19.95! But after that nuke-slinging insanity, beaming light just seems like a cop-out. ",
            "date": "Updated April 15, 2018",
            "views": "142",
            "upvotes": " View 198 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Breaux",
                    "user_href": "/profile/Michael-Breaux-1"
                },
                {
                    "user_id": "Ernestas Juška",
                    "user_href": "/profile/Ernestas-Juška"
                },
                {
                    "user_id": "Iurii Lupu",
                    "user_href": "/profile/Iurii-Lupu"
                },
                {
                    "user_id": "Samuel Auburn",
                    "user_href": "/profile/Samuel-Auburn"
                },
                {
                    "user_id": "Vedanth Kompella",
                    "user_href": "/profile/Vedanth-Kompella"
                },
                {
                    "user_id": "Dylan Chester",
                    "user_href": "/profile/Dylan-Chester"
                },
                {
                    "user_id": "Mike Nolan",
                    "user_href": "/profile/Mike-Nolan-91"
                },
                {
                    "user_id": "Caden Fluhart",
                    "user_href": "/profile/Caden-Fluhart"
                },
                {
                    "user_id": "Dan Rosenberg",
                    "user_href": "/profile/Dan-Rosenberg-8"
                },
                {
                    "user_id": "Allan Minder",
                    "user_href": "/profile/Allan-Minder"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel McCarthy",
                "href": "/profile/Daniel-McCarthy-93"
            },
            "answer_text": "It would actually be very small - based on current technology it would most likely work using light sails. light can push things under the right circumstances (like in a crookes radiometer). The idea is to have a small probe attached to a foldout lightweight sail which could catch light rays from the sun. We could launch these cheaply because of their low weight and then just turn them so that the sail catches the sun rays. The whole thing would keep accelerating constantly and hit massive velocities fairly quickly. It would only stop accelerating when it is too far from the sun. LightSail ",
            "date": "Answered December 6, 2017",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Chang",
                    "user_href": "/profile/Andrew-Chang-172"
                }
            ]
        }
    ]
}