{
    "title": "If someone don't care about us, why do we still care about them? - Quora",
    "tags": [
        "Social Psychology",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samantha Poe",
                "href": "/profile/Samantha-Poe"
            },
            "answer_text": "I’m a firm believer that the type of person we are drawn to is a direct reflection of ourselves. Now, it’s important to take into consideration that there will never be one end-all be-all answer for this question, as we’re such a unique and diverse race, but in my experience, it’s pretty simple. Insecurity or a lack of self-love will often lead people to seek validation, and validation means less coming from people who give it easily. When someone refuses to validate you (i.e. they don’t care about you in return), their validation suddenly seems much more valuable. Unavailability = instantly more valuable. Ask any sales team. Security and self-love will often lead one to be turned off by someone who is indifferent and disinterested, and more drawn to people who care for them in return. They’re confident that they’re worth being loved without having to fight for it. Again, people are vastly different, and there might be people who are the opposite from the above-stated observations. I think for most people though, it rings true, whether they realize it or not. Most of us are insecure. Most of us don’t value our worth as much as we should. So most of us, at some point, are drawn to people who don’t want us. In the end, I think it’s a deep-rooted need for validation. It would feel pretty dang good if the person who doesn’t validate you were to suddenly have a change of heart. Validate yourself, love yourself, be kind to yourself, and strive for a deep core belief that you deserve love. It took me a while, but I got there, and I’d like to believe that if I can get there, anyone can get there. Lastly, understand that your experience is not unique. You are not alone in this experience. But you are worth being loved back. Believe that. ",
            "date": "Answered June 12, 2018",
            "views": "385",
            "upvotes": " View 223 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Caroline Smith",
                    "user_href": "/profile/Caroline-Smith-800"
                },
                {
                    "user_id": "Tonya Hart",
                    "user_href": "/profile/Tonya-Hart-2"
                },
                {
                    "user_id": "Anna Epifani, CPCS",
                    "user_href": "/profile/Anna-Epifani-CPCS"
                },
                {
                    "user_id": "Arthur Nobili",
                    "user_href": "/profile/Arthur-Nobili"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MY-ACCNTS"
                },
                {
                    "user_id": "Layla Salem",
                    "user_href": "/profile/Layla-Salem-11"
                },
                {
                    "user_id": "Demetris Leptos",
                    "user_href": "/profile/Demetris-Leptos"
                },
                {
                    "user_id": "Broo Edwa",
                    "user_href": "/profile/Broo-Edwa"
                },
                {
                    "user_id": "Usha Thiyagarajan",
                    "user_href": "/profile/Usha-Thiyagarajan-2"
                },
                {
                    "user_id": "Orlando Rodriguez",
                    "user_href": "/profile/Orlando-Rodriguez-170"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anish Mukherjee",
                "href": "/profile/Anish-Mukherjee-17"
            },
            "answer_text": "I guess your question is concerned about someone whom you really care about. Let's take for an example, some one whom you might love. For the sake of the answer, I am assuming that you are really bothered about the other person's whereabouts, his/her well being. And you have always put them on a priority much before you do it to any thing else. Coming to your question, why is it, that we seem to care so much about some one who hasn't in any way reciprocated your caring by even 0.001%? This goes back to a very well stated fact that we all might be knowing. IGNORANCE. Think for a while, how many times in your entire life time, have you ever ignored some one? Think about the times when you ignored your parents when all they did was seeking out your own good? Think about the times when your well wisher, might be your mentor, your teacher or some one who genuinely wanted to help you told you to not to indulge in something that won't be good for you. All these times you have blatantly ignored them, without even caring for once. But did you ever think about how they might have felt? No. Coming back to a situation in which you are getting ignored by that some one of yours. Or to be more precise, why don't we, as we saw above, don't even dare to care about those who care about us. Because we take them for GRANTED. And trust me when I say, it's one of the worst feeling if you end up being on the side of the recipient. To overcome this, Ignorance is what I suggest. Seems a bit surreal. Ain't it? Ignorance,in a limited amount of course,might be put to the best use when you are applying it for your own good. By ignorance, I am not saying to be indifferent to what they say to you. Remember the reaction to what they say or do to you, is what matters. All I am asking you to do is, to not to be so concerned about your other half that in a way affects your own good. All that I am asking you to do is 1.Check up on your self first. 2.Prioritize your family, your career, your life much much before than theirs. Because, once they are not by your side, after all that you have given to them, is surely going to leave you empty handed, if you don't spend time nurturing your hobbies, your passion, your life. They say to seek the most coveted attention of some one whom you really care about, instead of finding out ways to seek their attention,focus that same attention on your self. On your own good. On your potential. Why is it so? Because it's human tendecy to get attracted to something which is doing fine all by himself. So instead of thinking of a hundred different ways to get their attention, focus on your self. Your life. Your family. And once they notice, that you are doing fine without them, they will come seeking out your attention. -Anish Mukherjee ",
            "date": "Answered June 15, 2019",
            "views": "54",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikita R.C.",
                    "user_href": "/profile/Nikita-R-C-1"
                },
                {
                    "user_id": "Caroline Smith",
                    "user_href": "/profile/Caroline-Smith-800"
                },
                {
                    "user_id": "Rick Grimmes",
                    "user_href": "/profile/Rick-Grimmes-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MY-ACCNTS"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-3765"
                },
                {
                    "user_id": "Haritha Hari",
                    "user_href": "/profile/Haritha-Hari-21"
                },
                {
                    "user_id": "Layla Salem",
                    "user_href": "/profile/Layla-Salem-11"
                },
                {
                    "user_id": "Usha Thiyagarajan",
                    "user_href": "/profile/Usha-Thiyagarajan-2"
                },
                {
                    "user_id": "Chelsi Tony",
                    "user_href": "/profile/Chelsi-Tony"
                },
                {
                    "user_id": "Vidushi Sharma",
                    "user_href": "/profile/Vidushi-Sharma-25"
                }
            ]
        }
    ]
}