{
    "title": "If the Sun disappeared completely, what would happen to the Earth and the rest of our solar system? - Quora",
    "tags": [
        "Hypothetical Astrophysics Scenarios",
        "Earth-Sun Relationship",
        "Hypothetical Astronomy Scenarios",
        "Hypothetical Planetary Science Scenarios",
        "The Solar System",
        "The Sun",
        "Earth (planet)",
        "Astrophysics",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ambuj Mishra",
                "href": "/profile/Ambuj-Mishra-23"
            },
            "answer_text": "If Sun disappeared completely..Then. After 8 minutes and 20 secondsThe gravitational field being a fundamental force field (propagates with the speed of light) will vanish i.e. we'll lose Sun's gravitational force.Thus Earth instead of orbiting ,will continue on a straight line which is tangential to the orbit at that instant. After one dayPlants will begin to die.99.99% of all natural biodiversity on earth will cease.Photosynthesis will stop immediately after the sunlight disappearsLarge plants can live for years as they have enough stored energy in the form of polysaccharide Starch (complex mixture of amylose and amylopectin).After one weekThe average temperature on earth will drop to 0 ℃In absence of Sun ,earth will start radiating heat and will start becoming colder.The current average temperature on earth is 14 ℃.(in presence of sun) After one yearThe average temperature on earth will drop to -73 ℃. Very few geothermal places like Iceland and Yellowstone will be inhabitable for humans. After 1–3 YearsOceans all over will be frozenThere'll still be water underneath ,as ice acts an insulator and earth's core will continue producing heat(almost 20% of current thermal energy)The temperature would stabilize at -240 ℃ after millions of yearsAfter 10–20 YearsAir will start turning into liquid, it will become cold enough for all the gases in air to condense and form clouds.It will rain ,but instead of water ,it will gases like Dihydrogen .Oxygen production will stop with photosynthesis. But we will have enough oxygen in the atmosphere to survive for 1000s of years .In a year ,Mankind breathes in about 6,000,000,000 Kg of Oxygen .Astonishingly, The atmosphere has stored 1,000,000,000,000,000 Kg of OxygenIn billions of YearsThere'll still be life on earth.Microbes living in hydrothermal vents in deep oceans will do just fine. These microbes produce energy through Chemosynthesis - A process independent of Solar radiation.. ",
            "date": "Answered February 1, 2017",
            "views": "103",
            "upvotes": " View 132 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Farahmand Toosi",
                    "user_href": "/profile/Farahmand-Toosi"
                },
                {
                    "user_id": "Christopher Daniels",
                    "user_href": "/profile/Christopher-Daniels-123"
                },
                {
                    "user_id": "Sanda Carcadia",
                    "user_href": "/profile/Sanda-Carcadia"
                },
                {
                    "user_id": "Walter Skilton",
                    "user_href": "/profile/Walter-Skilton"
                },
                {
                    "user_id": "Craig Timmons",
                    "user_href": "/profile/Craig-Timmons-2"
                },
                {
                    "user_id": "I Am Batman",
                    "user_href": "/profile/I-Am-Batman-37"
                },
                {
                    "user_id": "Tyler Greenawalt",
                    "user_href": "/profile/Tyler-Greenawalt"
                },
                {
                    "user_id": "White Thanos",
                    "user_href": "/profile/White-Thanos"
                },
                {
                    "user_id": "Ana Tomlinson",
                    "user_href": "/profile/Ana-Tomlinson-2"
                },
                {
                    "user_id": "Japhet Eze",
                    "user_href": "/profile/Japhet-Eze"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luke Harrison",
                "href": "/profile/Luke-Harrison-123"
            },
            "answer_text": "Ok. Let's say you're riding your bike. It's a nice, warm summer day. It's really bright outside too. Now, 92.96 million miles away (AU), the sun goes out. It just suddenly disappears. First of all, we wouldn't notice immediately. It would take 8.27 minutes for our earth to go dark. So hooray, we still have 8 minutes of sunlight left. 6 Minutes Until Darkness: You park your bike outside your favorite deli. You get something to eat. After a quick snack, you go outside to your bike. 3 Minutes Until Darkness: It's still a nice and sunny day. You hop on your bike and ride home. 3 Seconds Until Darkness: You're riding your bike home. Suddenly, you notice everything begins to fade. Everything before your eyes slowly fades to complete darkness. Soon enough, you hear a few cars stop and a few that crash. It's not any different for you. You crash your bike into a light pole, which isn't turned on yet. You fall and scrape your elbow. No big deal. The whole earth is dark. There is no natural sunlight anymore, the galaxy's stars begin to appear in the sky. Anyway, the sun is out. People are panicking, people are started to mob stores, just craziness. It got a little chilly, but the weather is still perfectly fine surprisingly. You don't need a jacket. 1 Day of No Sun: Temperature got a bit cooler, but perfectly habitable. Almost all plants are still alive. People are still panicking and think it's the end of the world. 1 Week of No Sun: This is where things get really different. First of all, you're probably going to experience a new Ice Age. The global temperature is 32 degrees F. There are no food shortages, no oxygen shortage, etc. Power still works (assuming everyone is still working most jobs). 2 Weeks of No Sun: Nothing really changed. Yes, it's still a bit cooler. And a lot of small plants have died. But we still have more than enough oxygen in the atmosphere to survive off of for a while. No food shortages yet, but as you can imagine, a lot of people are still raiding stores around the world. Let's fast forward a bit. 1 Year of No Sun: Now, we're talking about serious change. The global temperature is around -150 degrees F. We can still have electricity. Just sit in your home and stay warm, it will be getting colder. We still have plenty of oxygen. And there are some plants that are still alive due to slow metabolisms, like big trees. The surface over the oceans slowly freezes over, making earth become an ice ball. Few Decades of No Sun: This is where we panic. Remember, we still have plenty of oxygen. Large trees are still alive. But the temperature is freezing, and some humans have already died. That is if we hadn't come up with some plan. There are food shortages. The only warm place on our earth would be either a well heated home, or the bottom of the ocean floor near the heat vents. 1000 Years of No Sun: Well, count your blessings. We still have some oxygen. The global temperature is -400 degrees F. And earth is just an ice ball. The atmosphere would collapse at this point in time. So say good bye to oxygen, and welcome all the radiation that will enter our once beautiful earth. Can anything survive earth? Yes. Near the heat vents on the ocean floor, there are still living organisms in there. And they will survive for billions of years. They don't need sunlight. Just be aware, the surface of the ocean is frozen over. Few Things to Note: This will never happen. It is physically impossible for the sun to either disappear or burn out. So enjoy that Vitamin D. :) Also, even IF the sun disappeared. We would lose our orbit. We would fling into outer space. We would either keep flying through space, enter a black hole, or be picked up by another star that would let us survive. That would be cool wouldn't it? Just imagine being in a new solar system, orbiting Alpha Centauri or something. New planets, new discoveries. Anyway, hope this helped! ",
            "date": "Updated April 30, 2020",
            "views": "186",
            "upvotes": " View 167 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sanjay Jori",
                    "user_href": "/profile/संजय-जोरी-Sanjay-Jori"
                },
                {
                    "user_id": "Lui Peres",
                    "user_href": "/profile/Lui-Peres"
                },
                {
                    "user_id": "Manpreet Kaur",
                    "user_href": "/profile/Manpreet-Kaur-4828"
                },
                {
                    "user_id": "Omid Hematian",
                    "user_href": "/profile/Omid-Hematian"
                },
                {
                    "user_id": "Mike Tuohy",
                    "user_href": "/profile/Mike-Tuohy-4"
                },
                {
                    "user_id": "Edward Wilder",
                    "user_href": "/profile/Edward-Wilder"
                },
                {
                    "user_id": "I Am Batman",
                    "user_href": "/profile/I-Am-Batman-37"
                },
                {
                    "user_id": "Tyler Greenawalt",
                    "user_href": "/profile/Tyler-Greenawalt"
                },
                {
                    "user_id": "Zoë Sumra",
                    "user_href": "/profile/Zoë-Sumra"
                },
                {
                    "user_id": "Aliber Mayorga",
                    "user_href": "/profile/Aliber-Mayorga"
                }
            ]
        }
    ]
}