{
    "title": "If the government banned gas cars, how quickly could the USA switch to all electric? - Quora",
    "tags": [
        "Battery Electric Vehicles (BEV)",
        "Electric Vehicles",
        "Electric Cars",
        "Automotive Industry",
        "Cars and Automobiles",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chad Courtney",
                "href": "/profile/Chad-Courtney-1"
            },
            "answer_text": "About 70% of the US population could do almost all there charging from home today. At least for their typical commuting. There would need to be a build out of charging spots in apartment complexes, parking garages, street parking, and work parking. And fast charging infrastructure built out to handle the long distance drives (which likely would be less than 10% of the driving miles.) This could easily be built out in 5–10yrs if mandates were made to switch, and the EV transition happened that quickly. Not so worried about electricity generation - A total of 20% more electricity would need to be generated, but proper incentives of overnight charging for that 70% would put put most of that overnight when electricity production is low and there’s a lot of unused capacity. Meaning only a 6% increase in electricity production needed over the course of 5–10yrs, or < 1% increase in capacity a year. ",
            "date": "Answered August 7, 2019",
            "views": "167",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Voelker",
                    "user_href": "/profile/Martin-Voelker-2"
                },
                {
                    "user_id": "James Ryan",
                    "user_href": "/profile/James-Ryan-298"
                },
                {
                    "user_id": "Roger Phelps",
                    "user_href": "/profile/Roger-Phelps-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Parker",
                "href": "/profile/Robert-Parker-326"
            },
            "answer_text": "If you don’t mind starving it would be fine. But remember all your food arrives at all the grocery stores via ICE vehicles. Shutting those down would make you lose a lot of weight. In rural areas of the country a 300 mile range on an EV is alarmingly low and the charge time intolerably long. Many people in fly over country drive their cars 500–800 miles per 24 hr day. Truckers can go farther. ",
            "date": "Answered August 7, 2019",
            "views": "21",
            "upvotes": "0"
        }
    ]
}