{
    "title": "If the glass of a window was painted entirely with black paint, would any light at all come through? - Quora",
    "tags": [
        "Doing Research to Write a Book.",
        "Paint",
        "Visible Light",
        "Colors (vision)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Domski",
                "href": "/profile/Ted-Domski"
            },
            "answer_text": "That answer is entirely dependent on which wavelength of light (all light is in the electromagnetic radiation spectrum). Visible light is roughly light from 750 nm to 350 nm. So in the case of gamma radiation you would need multiple meters of paint to block it! Paint has what is called a hiding strength, this is a measurement of the thickness of the coating required to prevent light that passes through the paint, and then is reflected off the substrate from being allowed to escape. You’ll have encountered this if you have ever painted a wall or something else and can still see the color of the substrate coming through. So if we speak only in terms of visible light, if you applied a coat of paint which is about 2X (in reality slightly more)the hiding film thickness (remember hiding refers to light passing through the paint on the way IN AND OUT in this case it doesn’t reflect of the glass substrate so you need at least twice as much,) then you would for all practical reasons block all the visible light. ",
            "date": "Answered July 4, 2019",
            "views": "177",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "J. Rose",
                    "user_href": "/profile/J-Rose-81"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Townsend",
                "href": "/profile/Michael-Townsend-77"
            },
            "answer_text": "It depends on how opaque the paint you used it. Eventually, you should be able to apply enough layers to block out the light. ",
            "date": "Answered July 2, 2019",
            "views": "78",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "J. Rose",
                    "user_href": "/profile/J-Rose-81"
                }
            ]
        }
    ]
}