{
    "title": "If you were suddenly transported back in time to 1000 and 1750 with no technology or preparation, how could you 'wow' people of that era? - Quora",
    "tags": [
        "Sending Technology Back in Time",
        "Time Travel Scenarios",
        "Time (physics)",
        "Technology",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ernest W. Adams",
                "href": "/profile/Ernest-W-Adams"
            },
            "answer_text": "I guess that depends on what you define as technology. If I get whatever's in my pockets right now, not including my mobile phone, I would show them my Swiss Army knife and my Yale keys. The idea of stainless steel would be very appealing to anybody who could make steel in the first place, although I have no idea where you find vanadium or chromium or how you add them to the steel. Yale keys are a significant improvement over older kinds of locks, although it takes some fairly precision machining to make them. But I think a locksmith would be interested. They would also think the zippers in my clothing were pretty cool, and my very light plastic eyeglassses. They might be impressed by my shoes that are different for each foot and have a great deal of support and cushioning. To the Vikings, I could explain fore-and-aft sails and the advantages of being able to sail against the wind. So far as I know they only had square sails. This isn't difficult to prove with model boats. In 1000 AD, I would teach them Arabic numerals and the decimal point and point out the advantages of doing arithmetic with them instead of Roman numerals. If I were in a pretty backward area I could show people how to make concrete from limestone. This would take a while, however. The Romans had concrete, but I don't know how many people still remembered the formula after Rome was overrun. Obviously the biggie would be calculus, if I went to a time before Newton and Leibniz. Unfortunately, my calculus isn't that good. ",
            "date": "Answered October 3, 2015",
            "views": "18",
            "upvotes": " View 85 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aeyla Taibi",
                    "user_href": "/profile/Aeyla-Taibi"
                },
                {
                    "user_id": "Justice Varner",
                    "user_href": "/profile/Justice-Varner-1"
                },
                {
                    "user_id": "Tyler McMann",
                    "user_href": "/profile/Tyler-McMann"
                },
                {
                    "user_id": "Benjamin Basal",
                    "user_href": "/profile/Benjamin-Basal"
                },
                {
                    "user_id": "James Clark",
                    "user_href": "/profile/James-Clark-253"
                },
                {
                    "user_id": "Garrett Wayne",
                    "user_href": "/profile/Garrett-Wayne-1"
                },
                {
                    "user_id": "Peter W Carter MD",
                    "user_href": "/profile/Peter-W-Carter-MD"
                },
                {
                    "user_id": "Malik Mack",
                    "user_href": "/profile/Malik-Mack-1"
                },
                {
                    "user_id": "Moshe Schlussel",
                    "user_href": "/profile/Moshe-Schlussel"
                },
                {
                    "user_id": "Spencer Dreyer",
                    "user_href": "/profile/Spencer-Dreyer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miguel Lahunken",
                "href": "/profile/Miguel-Lahunken"
            },
            "answer_text": "I have. It is all top secret here in time. On one of my past probability timelines it will be  out in 2017. There are things so secret that they are censored out of the major searchengines. But, there was a movie, presented as a fiction, that represented theOrder of the Bell, titled \"Brotherhood of the Bell\" in 1970, before the modern\"conspiracy theory\", back when the old \"conspiracy theory\" was that the Jewscontrolled the world financially, which was not true.Here is a cut & paste about this situation today, the critic of which waskicked out of the forum, and had his comments deleted, for abusiveness. You willsee my answers.American Military Dictatorship to restore secret: vagal stimulation as effectiveas LSD. See Here It Comes: With Obama’s Victory, Treason Lobby Moves To Suppress Free Speech is how I gotcaught for the Clockwork Orange treatment. They will do it to everybody caughtknowing too much, now that that bill has passed allowing the armed forces tograb us all. You too. You now know too much, too. We all hope the Presidentvetos this bill. Here are the details about the time I got caught: When we werein the first grade, twins, Tommy and Frankie, and I went out on the town oneSaturday. We went in to the library and tried to find the biggest books to slamshut. then went around town testing every door. We found a certain back door andwent in. Once inside we found another door, and to our surprise there were abunch of guys around one guy who was all tied up, to say the disgustingleast. Yuckkk! Frankie yelled out, \"It's a rodeo\". The guys came after us but weescaped and ran through back yards and thickets until we lost them. Then nextweek two of them came into our classroom with the Principal and they pointed usout and said, \"That's them! Those boys must be punished!\" The Principal took usinto her office and said, \"This doesn't concern us. You may go back to class\".One afternoon during Summer vacation from the fifth grade, we were in theplayground playing World War II. I got stuck being a German, and as we played war I yelled out repeatedly the primary German syllable that Iremembered, \"ein\", pronounced \"eyennn\". The Freemason from across the street fromthe playground ran in, grabbed and shook me saying, \"Don't say that word! Don'tsay that word!\". Well, it turned out that \"eyennn\" is the Lost Word of the RoyalArch. Thinking of it also spikes dopamine. Let's be the majority. Some yearslater in the ninth grade. My buddie, Sandie, and I had eaten lunch in Chinatown,and we were on our way to the subway station when a homeless person, very rarein those days, said that he had been at a cocktail party and had spilled some ofhis Masonic secrets. He was kicked out of the lodge, he was fired from his job,and no one would hire him. His wife left him with the kids, and he lost hishome. He was as sober as a judge, and he told us all the Masonic secrets. In thetwelfth grade I wrote a required term paper. Mine was \"Superstition in America\"and in it I revealed the Masonic secrets. I got a 98% for it, graduated HighSchool, and went into the Army. When I got sick and landed in Valley Forge ArmyHospital the Freemasons zeroed in on me and gave me Hell, literally. Theythreatened me never to reveal certain things again. It has been my life'svocation revealing these things. That's where I got the LSD and the 71 electricshock treatments without anesthetic. Why 71? One day they gave me two in oneday. Anyway, that LSD treatment came to be called the \"Clockwork Orange\"treatment. With it they force you to watch films of horrible torments, forexample, inside Auschwitz, and you body switch, backward and forward in timeinto everyone in the film. I went further. I body switched into everyone I eversaw, in the future, and have relived it every other time I grew old and died, 36times. The other 36 times I got up after having passed out from an allergic beesting. Thank God for that bee. I am due to go there next time. I have an agenda!Guess what I am going to do rather than get captured again. ",
            "date": "Answered December 11, 2015",
            "views": "388",
            "upvotes": "0"
        }
    ]
}