{
    "title": "If you’re on the iPhone upgrade program, is it worth it to upgrade to the iPhone 12 Pro Max or stay with my iPhone 11 Pro Max? - Quora",
    "tags": [
        "iPhones (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leslie Martin",
                "href": "/profile/Leslie-Martin-24"
            },
            "answer_text": "From what I have seen the I phone 12 has some impressive new features However your I phone 11max can still hold its own ,the new features on the I phone 12 are a more powerful processor I phone 11 processor is A13 I phone 12 is A14 it is supposed to be the most powerful processor on the market to day its going to take. awhile for the competition to catch up .The other changes are on the cameras It has tthe capability to take low light pictures, better lenses ,these are the main improvement The I phone 12 has the same great battery as I phone 11 One other feature I should mention, G 5 internet that sounds great who doesn’t want faster up and down internet speeds, However there is a problem for now .G 5 internet Is in it’s early stages.you would be using the Internet G 4 for a while longer. I phone 12 also will have new charging system .I picked some of the most notable changes go to the Apple store to learn More Keep in mind you have recently purchased i phone pro max it cost you a great deal of money aInd until two days ago it was the Flag ship ,I phone 12 has changed nothing your I phone 11 is still a great phone and will perform as well as the iPhone 12 unless there is A MUST HAVE FEATURE stay with what you have Every year there will always be a new I phone you can never catch up ",
            "date": "Answered October 14, 2020",
            "views": "118",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jerry Ruiz",
                    "user_href": "/profile/Jerry-Ruiz-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dennis Ainsworth",
                "href": "/profile/Dennis-Ainsworth-2"
            },
            "answer_text": "Personally i am a big Apple fan and have all there mobile products, but to be truthful i would not upgrade from an iPhone 11 Pro Max to the iPhone 12 Pro Max. I do regularly upgrade my iPhones but i normally keep them for at least a couple of years, unless there is a new feature that. Is VERY important to you i would stay with your iPhone 11 Pro Max for at least another year. I suggest writing dow the improvements of one over the other and see if anything in that list that is crucial to you. I will just end by saying this does not distract from the iPhone 12 Pro Max’s capabilities which is an excellent phone.If you had an iPhone 8 i would certainly say yes upgrade without doubt. ",
            "date": "Answered October 15, 2020",
            "views": "47",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jerry Ruiz",
                    "user_href": "/profile/Jerry-Ruiz-13"
                }
            ]
        }
    ]
}