{
    "title": "If you were taken back 1000 years, how could you impact technology with your current knowledge? - Quora",
    "tags": [
        "Time Travel Scenarios",
        "Knowledge",
        "Technology",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Hitchens",
                "href": "/profile/Bill-Hitchens"
            },
            "answer_text": "You couldn’t. Almost none of the materials we take for granted even existed back then. Electricity didn’t exist. Steam power didn’t exist. Half of the things you know would be considered blasphemy or sacrilegious. Saying the Earth is a globe and orbits the Sun could get you killed. All of that is before we get to the language barrier. In the UK you’d need to speak Anglo-Saxon. In America you’d need to speak native American. With some luck you’d survive long enough to learn the language. With a bit more luck you might eventually be able to contact the leading scientists of the time. If you could find them, travel took a lot longer back then. It’s highly unlikely that you’d effect anything on a larger scale. There were no magazines, there was no postal service. Travelling overseas was risky. At best you might be able to write down everything you know and tell a few scientists. They’d probably think you were insane or possessed :) ",
            "date": "Answered December 15, 2017",
            "views": "65",
            "upvotes": " Answer requested by Tuan Ton",
            "upvoters": [
                {
                    "user_id": "Eason Wang",
                    "user_href": "/profile/Eason-Wang-47"
                },
                {
                    "user_id": "Raiden Smith",
                    "user_href": "/profile/Raiden-Smith-1"
                },
                {
                    "user_id": "Diego Vargas",
                    "user_href": "/profile/Diego-Vargas-73"
                },
                {
                    "user_id": "Jared Hancock",
                    "user_href": "/profile/Jared-Hancock-3"
                },
                {
                    "user_id": "Lucinda Hancock",
                    "user_href": "/profile/Lucinda-Hancock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Chiu",
                "href": "/profile/Richard-Chiu-11"
            },
            "answer_text": "Practical steam power and knowledge of pathogen/sanitation theory would be the big ones to set me up for life (which of these I was able to leverage first depends a bit on the social structure of the place I end up, but both are important). I also have a working knowledge of firearms and the basic chemistry of explosives, so eventually I’d be pretty important in military development (but it would take a lot of investment to set up, so I’d need cred first). I understand Newtonian physics level math, so I can invent engineering up through the industrial age. That would require even more cred, unless I happened to come to the attention of an existing genius. But ultimately I only have my own life-span to work in, so there are limits on what I can do. And sparking a “scientific revolution” requires broader social change, which my contributions would actually tend to inhibit despite my best efforts, because I’d end up making just one local nation-state vastly more powerful than it’s neighbors for a relatively short period of time. That doesn’t encourage widespread dispersal of technology and science, it gives the dominant culture every incentive to keep those things secret, and the power to enforce that. I could eventually set up a kind of academy for teaching technology and scientific methodology, but it would be highly exclusive and insular. Frankly, a huge amount of my time would be eaten up fighting stupid political brushfires and defending my title as “The Wizard”. Very tiresome, a problem that has not exactly gone away though it is less necessary for actual engineers to engage in it these days. Scientists still have to do it, though…and they’re currently losing rather badly even in academic settings, let alone the wider world. ",
            "date": "Answered December 16, 2017",
            "views": "287",
            "upvotes": " View 5 Upvoters "
        }
    ]
}