{
    "title": "If you could afford it, what drone would you buy and why? Either for commercial or hobby use, which small Unmanned Aerial System would you purchase? - Quora",
    "tags": [
        "DJI (company)",
        "Personal Drones",
        "Mechatronics",
        "Commercial Aircraft",
        "Remote-Controlled Vehicles",
        "Unmanned Aerial Vehicles and Drones",
        "Aircraft"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Lee",
                "href": "/profile/Matthew-Lee-399"
            },
            "answer_text": "You didn’t specify the exact ‘type’ of the drone I’d bought.   This is the Northrop Grumman RQ-4 Global Hawk and currently is the largest drone ever in service of any country (And of course, when it comes to something ‘Largest’ in defence industry, it’s of the U.S.) It’s about $223 millions a piece, not include operating cost (Fuel, maintenance,…) and hangar, runway leases - but since I have an unlimited budget, well… The Global Hawk as a basic Air Force package is equipped with Synthetic Aperture Radar which can create extremely detailed 3-dimensional images of terrains that it scanned.  (This is from a Global Hawk which showed the city streets after hurricane in Haiti, through these images, people can determine which streets are blocked and impassable due to damage). Professional drone photographers would hate me for sure.  Long range Electro-Optical/Infrared sensors.  I could see and differentiate people from background through these images thousands of feet in the skies. Pretty good for stalking my crush.  It can loiter (Fly around) a target for several hours on-end, and if tasked, can surveyed 40,000 square miles of terrains a day. …still stalking my crush.   NASA even employed this drone to study the ozone layer and transport samples of air pollutants and aerosols across the oceans when their researches required so. I’d leased this drone to some companies for quick transport with a high price to make myself a profit out of this thing as well as having money to maintain it, or some science agencies can opt for my drone to carry their research equipments to do independent research at high altitude. For a high price. lol.  … But in the end, I’ll still use it to stalk my crush, ya know?  REVISION: I swear to God there’s no ‘Small UAS’ within the description when I read it - or I was just being a twit writing this without looking. Either way, just for people who are looking for the question-following answer you party poopers. Just kidding. Well, here goes:  Batman! Or Northrop Grumman Bat - formerly named KillerBee. With only 10 feet wingspan, it could be very well considered a small UAV - and much so, it has all of the top-of-the-line features I could use to stalk my crush: Still / Real-Time / Infrared Cameras.EO/IR, SAR sensors.Kestrel MTI (A system which allows the drone to automatically target and track objects of interests within its field of view through several sensors and cameras.) - in this case, my crush.Laser range fingers and designator. (To mark that ***hole who’s trying to steal her for an immediate solution.) Radar jamming kit, chemical, biological and explosive detector. (Could be useful if I decided to lend this babe to some… companies.)Flare dispensers to shake off petty AA missiles of the National Guard.Psy Ops (Psychological Operations) equipment (Seriously use in real world as a platform to strike enemy combatants morale by blasting loud music or discouraging speeches using speakers). I’ll fly around and blast Baby by JB across the city and enjoy the chaos.  ",
            "date": "Updated March 18, 2017",
            "views": "208",
            "upvotes": " View 510 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajan Bhavnani",
                    "user_href": "/profile/Rajan-Bhavnani"
                },
                {
                    "user_id": "David Hoffman",
                    "user_href": "/profile/David-Hoffman-264"
                },
                {
                    "user_id": "James Hu",
                    "user_href": "/profile/James-Hu-22"
                },
                {
                    "user_id": "Nahom Assefa",
                    "user_href": "/profile/Nahom-Assefa"
                },
                {
                    "user_id": "Damien Filleul",
                    "user_href": "/profile/Damien-Filleul"
                },
                {
                    "user_id": "Burt Sheng",
                    "user_href": "/profile/Burt-Sheng"
                },
                {
                    "user_id": "Fred Heald",
                    "user_href": "/profile/Fred-Heald"
                },
                {
                    "user_id": "Redo Cherry",
                    "user_href": "/profile/Redo-Cherry-1"
                },
                {
                    "user_id": "Zack Hill",
                    "user_href": "/profile/Zack-Hill-11"
                },
                {
                    "user_id": "David Haldorsen",
                    "user_href": "/profile/David-Haldorsen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen E Hall",
                "href": "/profile/Allen-E-Hall-2"
            },
            "answer_text": "Why the production version of the X-47B of course. .A few years ago, I had the chance to go to briefings for a program we were working on at Northrop in El Segundo, CA. The program was the X-47b UCAS.   This is the closest thing I have ever seen to “Skynet”. This isn't your fathers drone, this isn’t a drone at all, it is an intelligent autonomous killing machine. No one sits in a control room flying this with a joystick. You tell it what to do and it goes and does it, on its own, without your intervention or control. Completely autonomousTakes off and lands by itselfCan land and take off from an aircraft carrier by itselfDoes mid air refueling by itselfDecides when to attack targets based upon mission parameters but the weapons are released by the machines discretion depending on the situationCan adapt and take on secondary targetsThis is the first robot that kills humans by design. It is real and its here now. X-47B Drone: Welcome to the Age Of Unfeeling Killer Robots The most prominent, and controversial issues, about drones stem from their potential autonomy. And no drone, for the moment, is actually autonomous. The X-47B can change all of this. While previous drones removed humans from the theater of conflict, the X-47B has the capacity to remove humans from the process entirely. It is impossible, then, to underestimate the significance of the X-47B and the implications of the carrier landings. Besides the myriad ethical issues that arise from using robots to inflict physical harm, and even kill humans, the fact is that the laws or armed conflict are not sufficiently equipped to address their deployment.  ",
            "date": "Answered March 22, 2017",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "April Vargas",
                    "user_href": "/profile/April-Vargas-26"
                },
                {
                    "user_id": "Felicia Montgomery",
                    "user_href": "/profile/Felicia-Montgomery-13"
                },
                {
                    "user_id": "Nathan Schmidt",
                    "user_href": "/profile/Nathan-Schmidt-9"
                },
                {
                    "user_id": "Rhett Caron",
                    "user_href": "/profile/Rhett-Caron"
                }
            ]
        }
    ]
}