{
    "title": "If you fly a drone (UAV) into a swarm of bees, are there any casualties, or do the bees adjust? - Quora",
    "tags": [
        "Apiculture (Beekeeping)",
        "Bees (insect)",
        "Remote-Controlled Vehicles",
        "Unmanned Aerial Vehicles and Drones",
        "Entomology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Reynold Conger",
                "href": "/profile/Reynold-Conger"
            },
            "answer_text": "Beekeeper. Bees are pretty good fliers. Of course there may be a few accidental hits of propellers on bees, but most of the bees will avoid the props. I had better define a swarm. A swarm of bees is a group of bees and their queen who are actively looking for a new hive. They are intent on staying together and staying with their queen. Thus they cluster closer together than otherwise. This would increase the number of prop hits. A lot of people see a group of bees flying around, or flying into an attack on a person or animal they think is a threat to their hive. There will be fewer bees than a swarm and they will be spaced further apart. There will be fewer prop strikes in this group because the bees are very agile fliers. For proof of this, try to swat a bee out of the air. It can be done, but with great difficulty. ",
            "date": "Answered January 17, 2019",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "G Saunders",
                "href": "/profile/G-Saunders-2"
            },
            "answer_text": "Just the other evening a customer wanted me to get photos/video of a swarm of yellow jackets coming in/out of a gap in the clapboards under the eaves of the roof at the back of the house. He wanted to be able to show the critter-getter exactly where they are, and they are most active at dusk. I put my super-bright LED headlights on a Mavic Pro, angled up, and hovered the drone just under the fascia board with it’s camera tilted up, and got very clear video of a few of the wasps coming and going, also showing that there wasn’t ‘a hole’ where they entered, which would have been easy block and bomb with knock-down spray, but the entrance is hidden under the fascia board, so the critter-getter will need to drill and/or remove the board to get to the nest. After a minute or so of hovering, the wasps came out in force and swarmed the lighted drone, luckily weren’t interested in us on the ground 20′ below. They chased the drone for several yards as I backed it away from the house then left it alone, no doubt doing little high-fives and celebrating that they’d driven the drone monster off. When the drone landed, there were several wasps diced up and splattered on it like leaves when I fly it too close to a tree, their guts streaked on the props and little bright yellow and black flecks of their exoskeletons stuck on the Mavic’s body. I Windexed them off and got the video to the customer. I don’t know about every kind of bee, but these Yellow Jackets didn’t ‘adjust’ to the drone at their threshold, they attacked it. The neighborhood has occasional nests of European Messenger Wasps, as big as a finger, very aggressive, and drawn to lights at dusk. I’m interested to see what they’ll do next chance I get… ",
            "date": "Answered October 10, 2018",
            "views": "132",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "The Kaptain",
                    "user_href": "/profile/The-Kaptain-1"
                },
                {
                    "user_id": "Jacob Ahumada",
                    "user_href": "/profile/Jacob-Ahumada-1"
                },
                {
                    "user_id": "Andrew Lindsey",
                    "user_href": "/profile/Andrew-Lindsey-3"
                }
            ]
        }
    ]
}