{
    "title": "Is 'Rectify' a highly underrated TV series? - Quora",
    "tags": [
        "Rectify (TV series)",
        "Underrated Things or People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anto Kiran",
                "href": "/profile/Anto-Kiran"
            },
            "answer_text": "I my opinon YES. I didn’t even hear about this series ubtil its name showed up in some “BEST SERIES IN NETFLIX” list. Like Kim England McGuirk has mentioned in the previous answer, it is truely an intelligent series. The writing of the series is so excellent and the viewers can visualize the character development on screen. Every main character in the series has increased depth with every episode. Some people can feel that its too slow.But for me it didn’t matter because it had amazing writing combined with great acting, the perfect blend you can expect to make a great television. It is one of the very few TV series where you can see the characters enjoying something very mundane activities, like for example, the lead of the series is released from the prison after serving 20 years facing death penalty,he was 18 while he got arrested and now 38 years old but has a mentality of a 18 year old ,beacuse he was kept in solitary confinement all his prison life and detached from the world.So, when he is realeased, he is fascinated by almost everything, like going shopping with his mother in Walmart or watching a sunrise or just sitting in his backyard.These scenes ,perfectly written and acted that it will feel like you are seeing a real person and not an act by the performing actor. The above is one example, but this thing happens throught the series for different characters and all of them were amazing. The relationships between the charcters is also great and will feel realistic and not forced. If someone enjoys characters(their depth and development) and plotline over pacing of the story AND If someone wants to watch good televison ,then RECTIFY is a great choice. ",
            "date": "Updated July 2, 2018",
            "views": "832",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suzanne Roush",
                    "user_href": "/profile/Suzanne-Roush"
                },
                {
                    "user_id": "Wendi Brown",
                    "user_href": "/profile/Wendi-Brown-4"
                },
                {
                    "user_id": "Pamela Boguzis",
                    "user_href": "/profile/Pamela-Boguzis"
                },
                {
                    "user_id": "Liz Shaw Powell",
                    "user_href": "/profile/Liz-Shaw-Powell"
                },
                {
                    "user_id": "Sabrina",
                    "user_href": "/profile/Sabrina-349"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kim England McGuirk",
                "href": "/profile/Kim-England-McGuirk"
            },
            "answer_text": "Yes - repeating the previous two answers - reduced viewership and in general, a rather slow plot development than what most Americans have patience for. It is what I call “intelligent tv”. It is a show that does not entertain and requires you to really look deeply at every expression and spoken word of each character- even the set design and seemingly unimportant background happenings need to be paid attention to. ",
            "date": "Answered August 25, 2017",
            "views": "390",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Katherine Lalli",
                    "user_href": "/profile/Katherine-Lalli"
                },
                {
                    "user_id": "Wendi Brown",
                    "user_href": "/profile/Wendi-Brown-4"
                },
                {
                    "user_id": "Laura Jay",
                    "user_href": "/profile/Laura-Jay-11"
                },
                {
                    "user_id": "Jyotinjai Sharma",
                    "user_href": "/profile/Jyotinjai-Sharma"
                }
            ]
        }
    ]
}