{
    "title": "Is 2020 really the worst year, or were there much worse years before? - Quora",
    "tags": [
        "Future Scenarios",
        "2020 U.S. Presidential Campaign and Election",
        "2020 (year)",
        "World History",
        "Politics",
        "History",
        "Experiences in Life",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Farrer",
                "href": "/profile/Richard-Farrer-4"
            },
            "answer_text": "I’m going to be controversial here. 2020 IS A GREAT YEAR. Yes, there are deaths, sickness and massive disruptions in the financial and labour markets. I’m not saying these are good things, and obviously they are terrible for people suffering because of them, but from a long term global point of view they are unlikely to be significant. No, why I suggest this is because governments have had to make hard decisions which they have put off for years and have the opportunity (whether they take it or not) to make their countries a bit fairer. Office workers have shown that working from home is practical, saving them commuting costs and time and saving companies office space. Salesmen (and even MPs!) have learnt that conference calls are adequate so they don’t need to travel half way round the world for a face-to-face meeting. All of these could lead to a reduction in travel and hence a reduction in CO2 emissions. And for those people who still have to go into the office, there is no longer the same problems with traffic and lack of parking. And that’s why I think 2020 is great, along such periods as 14th Century (Black death making labour scarcer so workers started to be paid) and the World Wars (technological innovation; and women got to show they didn’t have to just stay at home). That’s not to say that i would have wanted to live through them myself though. ",
            "date": "Answered July 23, 2020",
            "views": "226",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pietro Speroni di Fenizio",
                "href": "/profile/Pietro-Speroni-di-Fenizio-3"
            },
            "answer_text": "Much worse. Suppose you want to time travel, and you want to avoid bad years. I would suggest 1177 BC was definitely worse : 1177 B.C.: The Year Civilization Collapsed - Wikipedia Another you should stay away if you are going to time travel is 1347–1351 when the Black Plague arrived: Black Death - Wikipedia Then of course you have World War 1 with at the end the Spanish Flu. 1914–1920. World War 2: 1940–1945. But I would also avoid 1816 the Year Without a Summer - Wikipedia Then you had the famines. From the great Famine in Ireland: from 1845 to 1849 Great Famine (Ireland) - Wikipedia But if you want to avoid plagues, and famines, and wars, I would say any year in the middle ages was generally so shitty, I would take 2020 any time if I had to time travel. In short, count your blessings. ",
            "date": "Answered July 17, 2020",
            "views": "166",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chuck Finley",
                    "user_href": "/profile/Chuck-Finley-144"
                },
                {
                    "user_id": "Steve Brosnan",
                    "user_href": "/profile/Steve-Brosnan-2"
                }
            ]
        }
    ]
}