{
    "title": "Is 3D printing big for the aerospace industry? - Quora",
    "tags": [
        "Aerospace Industry",
        "3D Printers",
        "3D Printing",
        "Printing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sagar Joshi",
                "href": "/profile/Sagar-Joshi-33"
            },
            "answer_text": "The Aerospace industry has been witnessing a quantum of change in the technologies targeting lightweight products, high-quality products, low part cycle time, and to address supply chain bottlenecks. 3D printing is one of the most promising technologies, which efficaciously addresses most of these areas with minimal waste and at a reduced time. The process further has environmentally friendly attributes and solves the supply chain complexity efficiently. Both, Aircraft manufacturers as well as engine manufacturers, have eagerly been relying on the technology in order to develop lightweight parts.  The global Aerospace 3D printing market is segmented based on the vertical type as Materials and Printers. The materials segment is expected to witness a higher growth in the aerospace 3D printing market during the forecast period, owing to the usage of a wide range of materials to print engine and structural components. Furthermore, development of new materials to 3D print components to withstand high temperature and extreme environment is also likely to boost the growth of material segment in the years to come. Major aircraft manufacturers, such as Boeing and Airbus, are expediting the adoption of this technology to achieve faster production process, reduce wastage, and shorten supply chain. Learn more about Aerospace 3D printing market here 3D Printing in Aerospace Industry. ",
            "date": "Answered January 22, 2019",
            "views": "72",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Khemant Kolpe",
                    "user_href": "/profile/Khemant-Kolpe"
                },
                {
                    "user_id": "Devesh Guwal",
                    "user_href": "/profile/Devesh-Guwal"
                },
                {
                    "user_id": "Ana Herriott",
                    "user_href": "/profile/Ana-Herriott"
                },
                {
                    "user_id": "Rahul Roy",
                    "user_href": "/profile/Rahul-Roy-1635"
                }
            ]
        }
    ]
}