{
    "title": "Is 3D TV dead? - Quora",
    "tags": [
        "3D TV",
        "3D Technology",
        "Technology Trends",
        "Television"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nadia Kovach",
                "href": "/profile/Nadia-Kovach"
            },
            "answer_text": "Yes, 3D is almost dead and here's why: Bad time. The hype surrounding 3D began after the release of Avatar's large screens in 2009, but when 3D TV was introduced in 2010, most consumers were not ready to abandon the newly purchased TVs due to the fact that from 2007 to 2009 it was a period of actively consumers were switching to DTV 2009, when all broadcast television broadcasting switched from analog to digital.The glasses. In the period of launching 3D TVs, different manufacturing companies used different systems for viewing with glasses, the most active of which was the “active shutter” and “passive polarization”. The principle of their work was different, and the main problem was that the ones used in each system were not interchangeable. If you had a 3D TV that required active glasses, you could not use passive glasses or vice versa.Price. Imagine you bought a TV and the glasses are great, but also you will need to invest in a 3D-enabled Blu-ray Disc player and/or buy or lease a new 3D-enabled cable/satellite box. Besides, with the beginning of streaming Internet broadcasting, you had to make sure that your new 3D TV is compatible with any Internet services that offer streaming 3D. Too many troubles, don't you think?The 2D-to-3D conversion. Manufacturers decided that turning on 2D-3D conversion in real-time was a good idea. Attention, spoiler. It was not. The conversion quality was objectively poor and inferior to viewing native 3D.3D is dim. Another mistake when creating 3D TVs was that the technology for increasing the luminous flux in 3D TVs was not included, as a result, the 3D image it turned out much dimmer than the 2D image.Not Everyone Likes 3D. Well, yes, this is a matter of taste, but as statistics show, it has a tangible effect on sales.",
            "date": "Answered October 22, 2019",
            "views": "942",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Silva",
                    "user_href": "/profile/Robert-Silva-38"
                },
                {
                    "user_id": "Randy Owens",
                    "user_href": "/profile/Randy-Owens-21"
                },
                {
                    "user_id": "Bruno Mailly",
                    "user_href": "/profile/Bruno-Mailly"
                },
                {
                    "user_id": "Coey Minear",
                    "user_href": "/profile/Coey-Minear"
                }
            ]
        },
        {
            "author_info": {
                "name": "John A. Rupkalvis",
                "href": "/profile/John-A-Rupkalvis"
            },
            "answer_text": "3D television was one of the most poorly marketed products in history. It had a potential that was not realized for many reasons. You don’t sell a product if you tell the potential customer false negative information about it. The content was produced by people who did not understand it and did it incorrectly. Rumors abounded and were believed. The customer was not told how to set it up and use it as it should have been. The passive 3D viewing glasses made a lot of sense, as they kept the cost down as compared to expensive autostereoscopic (no glasses) systems. Objections to them are ridiculous since millions of people have no problem with sunglasses, which have the same form factor. Other comparatively minor improvements were made for 2D products, but these were hyped to a gullible public. They were not limited to 2D but would have had the same advantages if used with 3D, where they would have been more noticeable. The best 8K televisions available today still are showing only distorted flat 2D, with everything from the closest object to infinity being smashed down to a single flat plane, and as such are not capable of as realistic images as the stereoscopic photographs produced as early as 1853. As a result, we are now back to the same old squashed, distorted 2D systems that people put up with for hundreds of years. ",
            "date": "Answered September 1, 2018",
            "views": "27",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Geo Mitchell",
                    "user_href": "/profile/Geo-Mitchell-1"
                },
                {
                    "user_id": "Tech Waver",
                    "user_href": "/profile/Tech-Waver"
                },
                {
                    "user_id": "Comet",
                    "user_href": "/profile/Comet-7"
                },
                {
                    "user_id": "Robert Silva",
                    "user_href": "/profile/Robert-Silva-38"
                },
                {
                    "user_id": "Randy Owens",
                    "user_href": "/profile/Randy-Owens-21"
                },
                {
                    "user_id": "Ron Kert",
                    "user_href": "/profile/Ron-Kert"
                },
                {
                    "user_id": "Parthibanjvpm Jvpm",
                    "user_href": "/profile/Parthibanjvpm-Jvpm"
                },
                {
                    "user_id": "Russell Rounds",
                    "user_href": "/profile/Russell-Rounds"
                },
                {
                    "user_id": "M. Vincent Holguin",
                    "user_href": "/profile/M-Vincent-Holguin"
                },
                {
                    "user_id": "Bernardo Siu",
                    "user_href": "/profile/Bernardo-Siu"
                }
            ]
        }
    ]
}