{
    "title": "Is Africa really developing? - Quora",
    "tags": [
        "South Africa",
        "Africa"
    ],
    "response": [
        {
            "author_info": {
                "name": "Francis Korkor",
                "href": "/profile/Francis-Korkor"
            },
            "answer_text": "Africa is growing, and people should stop constantly singling out Africa. If they are worried about regions of the world that are not growing, they should probably be worried about Europe and the EU, as the graph below shows Europe’ economic growth has stalled, and the European region is projected to experience virtually no economic growth till the year 2050. Sub-Saharan Africa together with Asia, currently have some of the fastest growing economies in the world, as shown on the graph below:  The collective GDP per capita of Africa currently in the year 2019, is ($1930), which is almost the same as India’s 2019 GDP per capita of $2199 (India is an Asian country with similar population as all of Africa) at about 1.3 billion people. So if people think Indian who have about the same per capita income as African countries are okay, why are they constantly painting Africa as poor? Second, countries around the world are not extremely ahead of African countries as people falsely believe. In our modern era, the differences between countries in terms of development is not very substantial, so it is not like the rest of the world is in the “computer age”, and African countries are in the “Stone Age”. If you are someone who has traveled just a bit, you would have realize that there can be several areas of Africa that are much more developed than some areas in Western countries. Western countries just happen to have more areas developed than Africa. Some projections by the world Bank indicate Africa in general, and Sub-Saharan Africa in particular, will soon witness very substantial growth in GDP and GDP per capita. PriceWaterhouse Coopers, is actually projecting a GDP for Africa that will be around $29 trillion dollars by the year 2050, almost equivalent to what the whole European Union’s (EU28) economy is projected to be by the year 2050. This will mean if Africa were a country, it will be around the same rank as India in either number three or number four position in the world. Personally, I prefer to use a very low growth rate of about 3.5% to project how Africa’s economy will be in about 30 years. Using this approach, I still arrive at an African continent with a very high collective GDP of about $9 trillion dollars. I you multiply the $9 trillion dollars by Africa’s GDP to PPP multiplier of about (2.9 average), you arrive at a “yuge” GDP (PPP) of $26 trillion dollars.   The high economic growth in Africa is already beginning to show in the number of people who are in the middle class:  You can see from the table above that even currently, apart from Europe and Asia, Africa has more people in the middle class than North America and South American continents respectively. People argue that middle class in America is far better of than middle class in Africa, but that is not very relevant. Reason is that the American middle class has to live their lives in America, and not in Africa, so there is no use making that comparison. I will conclude by stating that African countries have been growing all this while, but many people did not realize that. The way compound interest works is such that when Africa’s GDP was compounding on the initial GDP figure that was small, many people did not even realize African economies were growing, because compound interest on very small figures were still very small. However, the GDP figures for Africa are now reaching a substantial figure, such that further compounding will bring in very substantial increases in GDP per capita, and these will be noticeable in a very few years. Just take a look at the graph below:  It is only economists and technocrats who are able to look at the above nominal GDP graph of Africa and realize immediately that the above graph shows steps into “greatness”. ",
            "date": "Answered August 28, 2019",
            "views": "97",
            "upvotes": " View 48 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ame Yobi",
                    "user_href": "/profile/Ame-Yobi"
                },
                {
                    "user_id": "Dim Johnson",
                    "user_href": "/profile/Dim-Johnson-2"
                },
                {
                    "user_id": "Sese Dylan",
                    "user_href": "/profile/Sese-Dylan-5"
                },
                {
                    "user_id": "Joseph Mwema",
                    "user_href": "/profile/Joseph-Mwema-3"
                },
                {
                    "user_id": "Lazarus Baloyi",
                    "user_href": "/profile/Lazarus-Baloyi"
                },
                {
                    "user_id": "Sese Dylan",
                    "user_href": "/profile/Sese-Dylan-4"
                },
                {
                    "user_id": "Tangkat Sodo",
                    "user_href": "/profile/Tangkat-Sodo"
                },
                {
                    "user_id": "Suresh Tambe",
                    "user_href": "/profile/Suresh-Tambe-18"
                },
                {
                    "user_id": "Romeo Rwezaura",
                    "user_href": "/profile/Romeo-Rwezaura"
                },
                {
                    "user_id": "Ditiro Eugene Masebedi II",
                    "user_href": "/profile/Ditiro-Eugene-Masebedi-II"
                }
            ]
        },
        {
            "author_info": {
                "name": "Theophilus E.Daniel-Kagbare",
                "href": "/profile/Theophilus-E-Daniel-Kagbare-1"
            },
            "answer_text": "The economies of most African countries are growing, how much of that is translating to development another matter. Economic growth is not same thing as Economic development, as some tend to suggest in the answers. Just as physical growth is not same as personal development. Physical growth is not same as increase in capacity to analyze, deduct, comprehend. The increase in capacity ie to do things do and understand is not usually automatic. It takes deliberate dedication to training and education. Gross Domestic Product, the monetary value of goods and services produced, the measure of economic growth, is increasing year on year. The challenge is translating this to economic development. That requires some deliberate calibration and calculation. To entrench development will require a shift from the current level of economic management. Thankfully, in Nigeria, the Central Bank has taken key policy steps recently, with the support of the Presidency in this direction. But a long-term road-map and strategy is required. We've come to the limit of the framework of the Washington Consensus reforms. It's time for Africa's economic managers to demonstrate some deftness and come up with appropriate industrial policies. The following points highlights the level of work before Africa's macroeconomic managers to translate economic growth to lasting economic development. Primary Productuction still dominates GDP: manufactures as a fraction or percentage of GDP is still very small. Agricultural output is still either exported (instead of being processed and packaged) or largely consumed as such.-Inter-sectoral integration is still low: how much of a sector's output feeds or serves as the input of another, still lag behind.The amount of basic necessities, low-tech manufactures - paper products, toiletries, etc - we still import from Asia and elsewhere still leaves a lot to be desired.The level of capitalistic production and mechanization of production ie production carried out in factories as opposed to workshops and sheds is still relatively disproportionate.Financial system development: the financial system has evolved greatly. Africa's money is now increasingly in the hands of local financial managers, in African non-government-owned banks. The level of local financial intermediation and financial inclusiveness has boosted local savings and capital accumulation and increased the monetization of the economies and the availability of credit tremendously. However, there is yawning gap, in the financial system, for local well capitalized, well-structured, qualitatively staffed Development Financed Institutions to to champion long-term development by providing long-term credit facilities needed for the development of pivotal key sectors of the economy - the housing, maritime, manufacturing, infrastructure, etc.Government funds and public treasuries are still domiciled offshore, in Western banks, funding those economies.Investment in Human Capital Development needed to boost labour productivity is still embarrrasingly low.The effectiveness of public service and government bureaucracy still leaves a lot to be desired. The gap in the productivity of the private sector and public sector is yawning.Africa is in the post-economic adjustment period of late 1980s to ‘90s, which saw the entrenchment of market reforms, the beginning of a private sector-led development and roll back of the State from the economies. As well as political reforms which strengthened political institutions, fixed elections, etc. Laying a foundation for a semblance of civil order under constitutional rule, a basic essential for economic activities to thrive. There was a period of political adjustments and alignment in most of these countries in the immediate post-independence period which was not helped by world powers, against yhe backdrop of the Cold War, working their respective agendas in these countries. This was the period of civil wars, coups and counter coup de etats where most of the political institutions were very weak, where existent, and were seriously undermined by outside neolocolonial and imperialist forces. The fall of commodity prices in the global Recession of late 1970s into 1980s weakened governments further. Fiscal challenges were brought to the fore. Markets and market institutions were not existent. These ultimately begat the Washington Consensus reforms overseen by the IMF/World Bank. Those Structural Adjustment Program reforms laid the basis, at great social cost and distress, for a modern market-driven economy in Ghana, Nigeria, Kenya, Ethiopia, Tanzania, Angola, Zambia, etc. ",
            "date": "Updated May 15, 2020",
            "views": "464",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Suresh Tambe",
                    "user_href": "/profile/Suresh-Tambe-18"
                },
                {
                    "user_id": "Chris Twomey",
                    "user_href": "/profile/Chris-Twomey-3"
                }
            ]
        }
    ]
}