{
    "title": "Is a laptop considered a PC? - Quora",
    "tags": [
        "Personal Computers",
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Irné Barnard",
                "href": "/profile/Irné-Barnard"
            },
            "answer_text": "The acronym PC came about in the 70s and literally means Personal Computer. It was used to differentiate between a computing device (be that a desktop, screen, keyboard or something like a console all-in-one or even just something you plugged into a TV) designed for use by one person and not needing other computing resources. As opposed to the dumb-terminals (and other means) to interact with some shared computer somewhere like a MainFrame. This included things like Apple, Commodore, IBM originals & compatibles, etc. If using that same definition then a laptop is also a personal computer. In fact you could argue that your smart phone is a PC as well. In fact most smart phones today are much more powerful computers than the original PCs were. Somewhere in the 80s, a PC started to mean an IBM personal computer, and later a computer running Windows. I’m not sure where this came from, but this erroneous misunderstanding has become very prevalent - even to the point where many (who should know better) started to use it in this way. Perhaps it came about through some marketing situation (wouldn’t be the first time). Even using that mis-interpretation a laptop can still be considered a “PC”. Especially if it’s running Windows. Even to those mis-interpreting the meaning to be a computer running Windows, or compatible with the IBM system design (these days “evolved” into the x86 based computers of Intel and compatibles and the x86-64 based on AMD’s original design). For some there was a differentiation to further split things like laptops as not-PCs. Why this happened I cannot even imagine. Perhaps just because PC was so often used to mean a desktop in the past, that such definition started to become ingrained. But that’s a very unsatisfactory guess on my part. Personally I try to avoid calling something PC, since it means various things to various people. If I want to call something by a general name I just refer to it as a computer, else I use desktop, laptop, mobile, etc. It’s not perfect, but reduces the possibility of misunderstanding. Actually even those are not exactly clear cut names. E.g. many desktops are tower boxes and more often than not placed on the floor instead of on top of a desk. Laptops have variations too, e.g. the “notebook” idea which just means a cut-back laptop (at least in general). Not to mention, very few people work on a laptop while resting it on their legs - it’s very uncomfortable to do so, thus it’s usually placed on a desk or table instead. It really does become very confusing and inconsistent. Sometimes I feel a new set of names should be invented to more distinctly differentiate these things. But then I also know that no matter what something is called, humans would start to misuse it in new weird and (not so) wonderful ways. And we’re going to end up with similar inconsistent and misguided understandings, causing all sorts of confusion again. As someone else also answered: Things like “workstation” and “mini-computer” tended to mean a very high-end PC. Usually intended for graphics / 3d / video production. Though something which was considered a workstation 5 years ago is easily surpassed by a mid-range computer of today, never mind some 80s model workstation. E.g. the first CAD Workstation I used was a 386 24MHz with 4MB of RAM, a CGA graphics card and a 40MB HDD - even the lowliest phone today has many times better hardware than that, even the router through which I connect to the Internet is more of computer than that was. ",
            "date": "Answered December 6, 2017",
            "views": "157",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sheila M West",
                    "user_href": "/profile/Sheila-M-West"
                },
                {
                    "user_id": "Andrèa Garofalo",
                    "user_href": "/profile/Andrèa-Garofalo"
                },
                {
                    "user_id": "GaRbS",
                    "user_href": "/profile/GaRbS-1"
                },
                {
                    "user_id": "Tania W",
                    "user_href": "/profile/Tania-W-8"
                },
                {
                    "user_id": "Seniya Ratnayake",
                    "user_href": "/profile/Seniya-Ratnayake"
                },
                {
                    "user_id": "John B. Anderson III",
                    "user_href": "/profile/John-B-Anderson-III"
                },
                {
                    "user_id": "Woke Dude",
                    "user_href": "/profile/Woke-Dude-1"
                },
                {
                    "user_id": "Fenn Vector",
                    "user_href": "/profile/Fenn-Vector"
                },
                {
                    "user_id": "Paulius Zaranka",
                    "user_href": "/profile/Paulius-Zaranka"
                },
                {
                    "user_id": "Calvin Too",
                    "user_href": "/profile/Calvin-Too-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John B. Anderson III",
                "href": "/profile/John-B-Anderson-III"
            },
            "answer_text": "Yes a Laptop is a PC. Technically a PC is a Personal Computers! So your smartwatch, your cellphone, your desktop, your laptop, your tablet, even ebooks are all PC doesn’t matter if it’s an Apple Product or not. Now currently MS has been trying to market PC as any device running Windows and with a 98+% of all desktop/laptops it’s not a wholly inaccurate statement. With 500 million active Windows 10 machines. Steam Hardware & Software Survey open up the OS tab for the breakdown. Granted if we’re including Smart Phones then Linux is the winner with the Android Version Android (operating system) - Wikipedia having the most devices. However sales of devices doesn’t = active since I’ve seen how many people break their phones, some get these fixed others toss and get a new one. Then there are the people who buy a new one every year to have the latest. Typically the distinction is Desktop CPU/GPU or Laptop/Mobile CPU/GPU’s laptops are 99% of the time ~30% slower than their similar named desktop components. This is due to some Laws of Physics in particular Thermodynamics you see laptops have a lot less area to dissipate heat, and faster hardware creates more heat. ",
            "date": "Answered December 7, 2017",
            "views": "168",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Syanshi Liza",
                    "user_href": "/profile/Syanshi-Liza"
                },
                {
                    "user_id": "Tania W",
                    "user_href": "/profile/Tania-W-8"
                },
                {
                    "user_id": "Robert Gilsdorf",
                    "user_href": "/profile/Robert-Gilsdorf-1"
                },
                {
                    "user_id": "Alexander Desnoyers",
                    "user_href": "/profile/Alexander-Desnoyers"
                },
                {
                    "user_id": "Nico Bragg",
                    "user_href": "/profile/Nico-Bragg"
                },
                {
                    "user_id": "Woke Dude",
                    "user_href": "/profile/Woke-Dude-1"
                },
                {
                    "user_id": "Fenn Vector",
                    "user_href": "/profile/Fenn-Vector"
                },
                {
                    "user_id": "Paulius Zaranka",
                    "user_href": "/profile/Paulius-Zaranka"
                }
            ]
        }
    ]
}