{
    "title": "Is a future service that offers the streaming of both movies and video games likely? - Quora",
    "tags": [
        "Streaming Video Startups and Companies",
        "Streaming Content",
        "Video Game Industry",
        "Netflix (product)",
        "Streaming Video Content",
        "Games",
        "Video Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amanda Smith",
                "href": "/profile/Amanda-Smith-976"
            },
            "answer_text": "We all know Netflix has covered the massive range of audience to their platform with a wide range of movies, web series and more entertaining elements to watch on it. Even though Amazon Prime and Hulu being a competitor to Netflix they are far behind. Later on, evolution has been changed from video streaming to live game streaming. Now streaming your game like Pubg with your friends and broadcasting the several social media platform making fun and it's all trend now. Gamers who spend hours and hours in playing games have opted to some live game streaming platforms in order to make money out of it. We all know Disney is about to launch their new video streaming platform(Disney Plus) after breaking down the partnership with Netflix. Since Disney World is into movies, games and other kids show, you can expect Disney to start games streaming along with the video streaming services. Meanwhile, there was a buzz around the internet like Amazon also has planned to start a live game streaming platform. You could see the emerging video on demand services and live games, so you can expect a quick initiative from the top brands which could help them to move along with the trend. ",
            "date": "Updated October 1, 2019",
            "views": "178",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alex Schwanke",
                    "user_href": "/profile/Alex-Schwanke-1"
                }
            ]
        }
    ]
}