{
    "title": "Is Armenia a failed nation? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Damien Roth",
                "href": "/profile/Damien-Roth-3"
            },
            "answer_text": "I think it is a failed nation. I am not trying to be offensive but there are some things to realize why they are failed. Average Armenian still lives in 1915. If you try to make a sensible conversation with an average Armenian the conversation ALWAYS comes to “genocide” at some point. It literally sounds like they are BRAGGING about being a victim all the time; it’s bizarre and annoying because it doesn’t add anything to any conversation and it blocks the development of the relationships between their neighbors hence the rest of the world. They always talk about how they survived a genocide etc and they think their neighboring countries are the ones who should be blamed for their poor economy and social infrastructure. But they don’t see the fact that Israel, a real holocaust survivor nation, was born from their ashes and now they are one of the strongest and most influential countries in the world. Another thing; A nation’s progress happens through their folk. They need to accept their history and move on. There’s no point to feed the younger generation with hatred. The below pictures are average Armenian’s mindset and the lack of respect for national symbols are saddening. These kids are growing with hate. I’ve seen many similar scenes in Los Angeles. Kids and their grandmas/grandpas are stepping on Turkish flags like they are getting revenge, i think this is pathetic.    I’ve met and interacted with MANY Armenians who live in California and I can honestly say most of them are good people but extremely ignorant due to their parents. God forbid if you don’t agree with their genocidal claims they become hostile. I personally don’t think Armenia will be a developed country ever because their mindset is a huge block on development. ",
            "date": "Answered October 4, 2020",
            "views": "896",
            "upvotes": " View 52 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cici Yabgu",
                    "user_href": "/profile/Cici-Yabgu"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Laas-1"
                },
                {
                    "user_id": "Jonny Walker",
                    "user_href": "/profile/Jonny-Walker-136"
                },
                {
                    "user_id": "Kakashi Hatake",
                    "user_href": "/profile/Kakashi-Hatake-272"
                },
                {
                    "user_id": "Haluk Kosucu",
                    "user_href": "/profile/Haluk-Kosucu"
                },
                {
                    "user_id": "Emre Sermutlu",
                    "user_href": "/profile/Emre-Sermutlu"
                },
                {
                    "user_id": "Ravil Mansur",
                    "user_href": "/profile/Ravil-Mansur"
                },
                {
                    "user_id": "Sabir Salamov",
                    "user_href": "/profile/Sabir-Salamov"
                },
                {
                    "user_id": "Tolga Han",
                    "user_href": "/profile/Tolga-Han-1"
                },
                {
                    "user_id": "Nöktah Lehman",
                    "user_href": "/profile/Nöktah-Lehman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike G.Smith",
                "href": "/profile/Mike-G-Smith"
            },
            "answer_text": "Calling any nation failure is a crime and whoever asked this question either has some neonazi insights, or has no mind set. There are failed states which you can check wikipedia and other resources. However i dont like the phrase. It usualy relates to regions with the worst health, and economy capabilities and sometimes because of a corrupted government. Now back to idiotic question: the answer is No! And if you are not convinced search most famous armenian people around the world. Its same as searching most famous US people. Here are some faces you might know or would be surrpised to know are aemenians Charles Aznavour: Armenian-French singer-lyricistSerj Tankian: the lead vocalist, primary lyricist, keyboardist, and occasional rhythm guitarist of heavy metal music band system of downAngela Sarafyan: HBO’s Westworld series. She plays Clementine PennyfeatherCherEric Esrailian best know for movie The Promise. It is also available on netflix.Alexis Ohanian: co founder of social news website Reddit. Here is something fun to read about himBlack lives matter: Reddit founder and Serena William's husband Alexis Ohanian quits board - NZ HeraldSamval Karapetyan the richest armenian.James Philip Bagian engineer, physician, and NASA former astronut.Sayat-Nova famous musician and poet His songs and poems are in the Armenian, Georgian, Turkish, and Persian languagesAlex Manoogian industrial engineer, businessman, entrepreneur and philanthropist. he patented and brought to market the first successful washerless ball valve faucet, the Delta faucet. Alex Manoogian streets in Yerevan, the capital of Armenia; in Montreal, Quebec, Canada; and in Stepanakert, the capital of Nagorno-Karabakh, were named in his honor.Kim KardashianSebu Simonian best know for musician, singer, songwriter of the Los Angeles-based indie pop duo capital cities.Raymond Damadian physician, medical practitioner, and inventor of the first MR Scanning MachineEmik Avakian was an Armenian American inventor and owner of numerous patents including breath-operated computer, a mechanism that facilitates putting wheelchairs on automobiles, and a self operating robotic wheel that converts manual wheel chairs into automaticGeoffrey Zakarian Geoffrey Zakarian is an Armenian-American chef, restaurateur, television personality and author. He is the executive chef of several restaurants in New York City, Atlantic City and Miami.Kirk Kerkorian Kerkorian was one of the important figures in the shaping of Las Vegas and, with architect Martin Stern, Jr.described as the \"father of the mega-resort\". He built the world's largest hotel in Las Vegas three times, the International Hotel (opened in 1969), the MGM Grand Hotel (1973) and the MGM Grand (1993).He purchased the Metro-Goldwyn-Mayer movie studio in 1969.Arshile Gorky was an Armenian-American painter who had a seminal influence on Abstract Expressionism. He spent most his life as a national of the United States. Along with Mark Rothko, Jackson Pollock and Willem de Kooning, Gorky has been hailed as one of the most powerful American painters of the 20th centuryWilliam Saroyan was an Armenian-American novelist, playwright, and short story writer. He was awarded the Pulitzer Prize for Drama in 1940, and in 1943 won the Academy Award for Best Story for the film The Human Comedy",
            "date": "Answered October 21, 2020",
            "views": "88",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Anonymousquestioner-4"
                },
                {
                    "user_id": "Arman Ayva",
                    "user_href": "/profile/Arman-Ayva"
                }
            ]
        }
    ]
}