{
    "title": "Is a career as a mathematician realistic? - Quora",
    "tags": [
        "Mathematicians",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry Rountree",
                "href": "/profile/Barry-Rountree"
            },
            "answer_text": "What does “being a mathematician” mean to you? Teaching three classes of college algebra per semester as an adjunct faculty at a liberal arts college,Doing operations research at a civil engineering firm,Applying machine learning algorithms for a hedge fund….Those are pretty realistic careers for someone with a PhD in math. “…my family can't afford to risk the cost of education for anything other than a secure career path.” So don’t take their money. You’re going to have bad semesters. That’s perfectly normal and expected. One way to make them a hell of a lot worse is putting even more pressure on yourself to not waste your family’s money. If you’re good enough to have a university pay to you to get an undergrad degree, that’s a pretty good indication that you’re talented enough to make some kind of living at mathematics. If you’re not quite that good, then get a job, do the community college thing, and start getting that good. As to salaries and such, if you’re in the US the Bureau of Labor statistics has all kinds of good stuff. Here’s a link to get you started: U.S. Bureau of Labor Statistics Median pay for a mathematician in 2015 is >$111k/yr. Job outlook is “much faster than average” growth. Be sure to also check out operations research analysts (lower pay but even more growth) and actuaries (in-between salary, less growth). Good luck! ",
            "date": "Answered March 28, 2017",
            "views": "32",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nick Rodriguez",
                    "user_href": "/profile/Nick-Rodriguez-45"
                },
                {
                    "user_id": "Samuel Segun",
                    "user_href": "/profile/Samuel-Segun"
                },
                {
                    "user_id": "Jennifer Edeburn",
                    "user_href": "/profile/Jennifer-Edeburn"
                },
                {
                    "user_id": "Evan Moore",
                    "user_href": "/profile/Evan-Moore-24"
                },
                {
                    "user_id": "Agustín Chiappe Berrini",
                    "user_href": "/profile/Agustín-Chiappe-Berrini"
                },
                {
                    "user_id": "Liam Stigant",
                    "user_href": "/profile/Liam-Stigant"
                },
                {
                    "user_id": "Shane Ryoo",
                    "user_href": "/profile/Shane-Ryoo"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                },
                {
                    "user_id": "Lejun Hu",
                    "user_href": "/profile/Lejun-Hu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniil Kozhemiachenko (Даниил Кожемяченко)",
                "href": "/profile/Daniil-Kozhemiachenko-Даниил-Кожемяченко"
            },
            "answer_text": "Mathematical (and scientific in general) research is indeed akin to a tournament: if you “reinvented” something, you are simply late and have to occupy yourself with something else. This means that you have to be either “the fastest of them all” which is quite difficult, or research such fields that no one (or almost nobody) knows of. This, however, can lead to other people rejecting your results as insignificant or uninteresting. If, however, you are capable of attaining graduate courses, being an undergraduate, you almost surely have some skill. If you work not so fast, consult your supervising professor so that they guide your work in such a way that you’ll be able to publish your results. Hope, that helps. ",
            "date": "Answered October 7, 2016",
            "views": "70",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bramhatanu Banerjee",
                    "user_href": "/profile/Bramhatanu-Banerjee"
                },
                {
                    "user_id": "Hüseyin Güngör",
                    "user_href": "/profile/Hüseyin-Güngör"
                },
                {
                    "user_id": "Aarathi Anilkumar",
                    "user_href": "/profile/Aarathi-Anilkumar-1"
                }
            ]
        }
    ]
}