{
    "title": "Is automation the real reason behind increasing unemployment? - Quora",
    "tags": [
        "Unemployment Rate",
        "Reason",
        "Unemployment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "No, the real reason for increasing Unemployment is the Government failure to offer real-world Public Education in Small Business principles to all children. Insofar as many so-called “jobs” are dedicated to “unskilled labor,” then, as Automation eliminates those types of jobs, workers lacking education in Business principles would suffer. My solution is to teach Small Business principles in all Public Schools to all children, starting with Kindergarten all the way through High School (adapted for age group). A certain percentage of students would start their own businesses, taking the pressure off of the other workers. Also, those who remain employees would be the best employees in history, since they could see the Big Picture of how Business works. That would solve the problem of Unemployment forever. I invite computer models to test the soundness of my proposal. ",
            "date": "Answered October 29, 2019",
            "views": "45",
            "upvotes": " Answer requested by Arunabh Bhattacharya",
            "upvoters": [
                {
                    "user_id": "Shailesh Magar",
                    "user_href": "/profile/Shailesh-Magar-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Sweany",
                "href": "/profile/John-Sweany"
            },
            "answer_text": "When you look at the numbers, the way that robots work (Automation) Creates jobs, at the moment anyway. Cars used to be made almost entirely in one city. Now cars are made in dozens of cities, then they need to truck and ship them to an assembly plant. There are far fewer auto plant workers but many more truckers, rail workers, packers, and all the other jobs that are set up to get the parts together and ready for assembly. If there weren't robots making things there aren't enough workers around to hand make everything then ship it all over the place and put a few things together then ship again, and again. For globalism to work you need robots. Once there are robot trucks and robot packers and unpackers, robot forklifts, they wont need us and they wont have any customers. All this shipping is very profitable, and helps weaken unions, and centralizes wealth, and is very environmentally unfriendly.  But we are stuck with it. ",
            "date": "Answered February 6, 2017",
            "views": "136",
            "upvotes": " View 1 Upvoter"
        }
    ]
}