{
    "title": "Is an i3 Processor good for gaming? - Quora",
    "tags": [
        "I3 Processor",
        "Intel Core i3",
        "Central Processing Units",
        "Processors",
        "Laptops",
        "PC Gaming "
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Corzo",
                "href": "/profile/Justin-Corzo"
            },
            "answer_text": "Now I can not give you the best answer but I can sure as hell try. At the moment I have an i3 6100. It does it’s job relatively well and I am yet to have problems with it. For a while (because I am an idiot…) I was running Overwatch on my integrated graphics. *FacePalm*. It was able to run on low with shadows off for around 45 fps. There is also something weird with my Windows 10 that I will get back to later. So far the i3 has been doing the job fairly well and I am very happy with it. You should probably go for a i5 though it is just as someone else said more bang for your buck. If you have more money then go for an i7. I think for the price of it it does the job it is supposed to do decently well. From my experience I am very pleased with my i3. I was worried it wouldn’t be that good but it does it’s job quite well. I would’ve went with i5 6th gen but I kind of didn’t have a lot of money at the time and still don’t. :’( . I am hopefully going to get a job next year and I will be able to save my money up and upgrade my computer. It is hard to upgrade your pc when your 16 without a job. I don’t know if this even answered the question well I hope it did. Down to the question that I had. In Nvidia control panel in the manage 3d options you can set your graphics settings for your various applications. There is supposed to be a drop down bar that says choose preferred graphics processor. I don’t have that setting on my control panel. I have to change every setting manually which isn’t that big of a deal but it gets annoying every time I download a game. If someone could help me with that I would appreciate it. :P ",
            "date": "Answered September 20, 2016",
            "views": "35",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jair Gomez",
                    "user_href": "/profile/Jair-Gomez-15"
                },
                {
                    "user_id": "Ramkrishna Panigrahy",
                    "user_href": "/profile/Ramkrishna-Panigrahy"
                },
                {
                    "user_id": "Mazhar Sheikh",
                    "user_href": "/profile/Mazhar-Sheikh-28"
                },
                {
                    "user_id": "Aleksa Tošić",
                    "user_href": "/profile/Aleksa-Tošić"
                },
                {
                    "user_id": "Ruzan Pithawala",
                    "user_href": "/profile/Ruzan-Pithawala"
                },
                {
                    "user_id": "Khaled Ben Dhaou",
                    "user_href": "/profile/Khaled-Ben-Dhaou"
                },
                {
                    "user_id": "Avik Saha",
                    "user_href": "/profile/Avik-Saha-63"
                },
                {
                    "user_id": "Lunga Phakathi",
                    "user_href": "/profile/Lunga-Phakathi-1"
                },
                {
                    "user_id": "Andrias Dickson",
                    "user_href": "/profile/Andrias-Dickson"
                },
                {
                    "user_id": "Hameez Shaikh",
                    "user_href": "/profile/Hameez-Shaikh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shane Tennent",
                "href": "/profile/Shane-Tennent"
            },
            "answer_text": "I think you might feel a little silly, holding an Intel processor in one hand, and a game DVD in the other.  I'm going to go out on a limb here, and postulate that you would need a bit more than just the processor.  Just a bit. Let me introduce you to something called System requirements.  Every computer program has them.  Windows has them.  Games, most definitely have them.  They vary.  Some games require more in the way of computer hardware than others.  Right from the beginning, I have to ask... which specific Core i3 processor were you thinking of?  There are a bunch of them. In general, you can do much better for gaming, with a Core i5, or a Core i7... but honestly, if the processor you are thinking of purchasing meets the recommended system requirements for the specific single game you wish to play on the computer with said processor... then there is no reason not to have it. The problems start when you want to play more than just that one game.  See... your processor has to meet or exceed the recommended system requirements for any game you will want to play with that computer, if you want any kind of enjoyable gaming experience. This is why your processor is one of the places you really don't want to cut too many corners.  You want a faster processor.  The fastest you can purchase.  Not only the fastest, but the one with the most cores.  Why?  Because you don't want to have to purchase another processor next year to play the game that comes out then that you want to play.  Processors can be quite expensive when you want power.  So, you purchase the best you can get right now. So... again.  Can you manage some gaming with certain Core i3 processors?  Absolutely.  Would it be considered a good move in building a gaming computer with one?  Not at all. ",
            "date": "Answered August 8, 2015",
            "views": "71",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anurag Singh",
                    "user_href": "/profile/Anurag-Singh-3522"
                },
                {
                    "user_id": "NIVETHAN A/L RAJARAJAN -",
                    "user_href": "/profile/NIVETHAN-A-L-RAJARAJAN"
                },
                {
                    "user_id": "Abbas Razin",
                    "user_href": "/profile/Abbas-Razin"
                },
                {
                    "user_id": "Soumyadeep Das Bhowmick",
                    "user_href": "/profile/Soumyadeep-Das-Bhowmick"
                },
                {
                    "user_id": "Indrajit Mukherjee",
                    "user_href": "/profile/Indrajit-Mukherjee-20"
                },
                {
                    "user_id": "Repsol Repsol",
                    "user_href": "/profile/Repsol-Repsol"
                }
            ]
        }
    ]
}