{
    "title": "Is ABAP mandatory to pursue SAP HANA? - Quora",
    "tags": [
        "SAPLABS",
        "SAP ABAP Certification",
        "SAP ABAP (language)",
        "SAP HANA",
        "Relational Databases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alan Tan",
                "href": "/profile/Alan-Tan-70"
            },
            "answer_text": "Well, not everyone will understand this Canadian analogy…… “Is hockey mandatory to pursue skating”. Well technicall “no”, your an either play field hockey, or figure skating…. But if you are Canadian, neither options will have lots of opportunities. So, the short answer is “no”, it is possible to pursue ABAP and HANA separately without one another. But the long answer is although it is possible, doing one but not the other will significantly limit your opportunities. The fact is HANA was introduced because other databases run into significant performance limitation for SAP ABAP stack. So, while there are a few customer using HANA without an SAP ABAP application server, (I’d bet less than 10% of HANA customers do not have ABAP instances), HANA was designed with “simplifying ABAP stack” in mind, and in fact many SAP “Simplification” are ABAP code adopting HANA by either pushing down calculation to HANA, or optimize logic and data structure to take advantage of HANA. So in typical SAP Consulting lingo, it is possible but not recommended. ",
            "date": "Answered March 15, 2017",
            "views": "18",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Muthu Raja",
                    "user_href": "/profile/Muthu-Raja-39"
                },
                {
                    "user_id": "Biswajit Singh",
                    "user_href": "/profile/Biswajit-Singh-3"
                },
                {
                    "user_id": "John Yu",
                    "user_href": "/profile/John-Yu-98"
                },
                {
                    "user_id": "Ravi",
                    "user_href": "/profile/Ravi-1376"
                },
                {
                    "user_id": "Mahesh",
                    "user_href": "/profile/Mahesh-626"
                },
                {
                    "user_id": "Chethan",
                    "user_href": "/profile/Chethan-34"
                },
                {
                    "user_id": "Mohammad Farhan Alam",
                    "user_href": "/profile/Mohammad-Farhan-Alam"
                },
                {
                    "user_id": "Mohamed Asik S",
                    "user_href": "/profile/Mohamed-Asik-S"
                }
            ]
        }
    ]
}