{
    "title": "Is a computer a machine? - Quora",
    "tags": [
        "The Matrix (1999 movie)",
        "The Matrix (creative franchise)",
        "Machines",
        "Computer Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alicia Anderson",
                "href": "/profile/Alicia-Anderson-146"
            },
            "answer_text": "Short Answer: I would say yes, though it depends on how you define these words. Long Answer: The answer, of course, depends on your definition of \"machine\". When I think of the definition of \"machine\", I think back to learning the simple machines in middle-school science, so I'll look for a few definitions that are at least somewhat close to that general idea. (1) Wikipedia: (Machine) A machine is a tool that consists of one or more parts, and uses energy to achieve a particular goal. It's very general, but sure, this definition works. (2) Merriam-Webster Online: (http://www.merriam-webster.com/dictionary/machine, 1.e.1.) an assemblage of parts that transmit forces, motion, and energy one to another in a predetermined manner There were a few definitions that worked, but this was the most interesting to discuss, I think. (3) Reference.com: (the definition of machine, 3a) a device that transmits or modifies force or motion This one is more closely tied with the idea of general mechanics, but it should be interesting to discuss. (4) Reference.com: (the definition of machine, 1) an apparatus consisting of interrelated parts with separate functions, used in the performance of some kind of work This is the more general definition on Reference.com, and it fits with a very general popular notion of what a machine is. So, what is a computer? I have my own idea, but let's check Wikipedia: (Computer) A computer is a general purpose device that can be programmed to carry out a finite set of arithmetic or logical operations. This definition works pretty well. Basically, a computer is a device that performs pre-set operations. To make things a little simpler, let's restrict the definition to non-living computers. So, is a computer a machine by definition 1? Is a computer a tool? Well, if we assume that a computer can be programmed for the purpose of performing calculations that humans might not want to do themselves, then it definitely is. Maybe the first few computers in existence might have been too simple to be considered tools, but I don't think we should throw out the definition just for those, because clearly they would eventually be improved to the point where they could do calculations faster than humans.Does a computer consist of one or more parts? I don't see how it couldn't. What constructed device isn't made of parts, or couldn't be considered a part as a whole?Does a computer use energy? Again, I'm not sure how it couldn't. Naturally, the computers we're familiar with run on electricity. Theoretically, they don't have to, but I'm not sure how anything could happen at all without using some type of energy. Energy is a very broad concept.Does a computer achieve a particular goal? If the computer is being used in any meaningful capacity, it must have been programmed at some point. Though it's possible that the programmers didn't have a goal in mind, I would say that a computer's goal is to finish executing its instructions (normally a tough goal to achieve because computers run in loops, but a goal nonetheless). I suppose you could that a computer that wasn't programmed isn't a machine, but a car not in use doesn't achieve a particular goal either, and it's a bit easier to agree that a car is a machine.So, I'd argue that it fits definition 1. There are a few arguments against that might work, but it would likely be a meaningless syntax debate. How about definition 2?  Is a computer an assemblage of parts? Yes, for the same reason as stated in definition 1.Do the parts transmit forces, motion, or energy among themselves? Definitely. The computers we know transmit electricity from part to part. Again, this is basically the same argument as stated above... they don't theoretically have to transmit electricity, but it would be very hard to get anything done without some transmission of energy.Does a computer transmit energy in a predetermined way? Absolutely. The way is predetermined when the computer is programmed.I'd say that by definition 2, it's even clearer that a computer is a machine. Let's move on to definition 3.  Is a computer a device? Yes, by definition.Does it transmit or modify force or motion? Now that's a little trickier. Most modern computers have some mechanical parts, such as a hard disk, but you could build something that qualifies as a \"computer\" using only electronic parts. That said, technically even the movement of electricity qualifies as both motion and force. This goes back to previous arguments: it would at least be very difficult to make a device capable of performing operations that uses neither force nor motion in any capacity.I'd say it fits definition 3. I guess I should stop and address one point, though. My arguments so far have assumed that no computer can exist that doesn't manipulate energy or rely on force or motion. Though I can't see any way that this could happen, I don't have the tools I need to prove that (though I would be delighted if someone could prove me wrong). Let's move on to the last definition:  Is a computer an apparatus? Looking up definitions says that basically an \"apparatus\" is a device with purpose. I argued that computers have purpose above.Does a computer consist of interrelated parts with separate functions? Normally yes, but I suppose it could be theoretically possible to build a computer with one \"part\". That said, by this definition (depending on interpretation), some of simple machines are excluded from this definition of \"machine\", since some of them (such as the inclined plane) are only a single part and have no \"interrelation\". But I suppose it's possible that a computer might someday exist that fails to meet this criterion.Is a computer used in the performance of some kind of work? Well, if \"work\" here means \"tasks\", then certainly. If \"work\" is meant in the mechanical sense as being force multiplied by distance, then still yes. I've previously established that computers manipulate forces. As long as those forces operate over a certain distance, then it's \"work\", and I'm not sure you could have a productive computer where nothing moves at all.So, I would absolutely say that a computer is a machine. Of course, it depends on your definition of the two terms, and even the definitions I used have a few loopholes, but computers as we know them certainly qualify. Note that I also chose definitions of \"machine\" that corresponded with the usage that I thought made the most sense. There are certainly definitions of \"machine\" somewhere that a computer does not fit. One last point: I realize that this question may not warrant the lengthy \"proof\" I've given it, but hey, that's half the fun of answering things on Quora. ",
            "date": "Answered June 13, 2013",
            "views": "73",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "JANGA JNAPIKA",
                    "user_href": "/profile/JANGA-JNAPIKA"
                },
                {
                    "user_id": "Pasha Ostadi",
                    "user_href": "/profile/Pasha-Ostadi"
                },
                {
                    "user_id": "Dhruv Gupta",
                    "user_href": "/profile/Dhruv-Gupta-437"
                },
                {
                    "user_id": "Kaushik Gudapati",
                    "user_href": "/profile/Kaushik-Gudapati"
                },
                {
                    "user_id": "Ankush Jain",
                    "user_href": "/profile/Ankush-Jain-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eugene Miya",
                "href": "/profile/Eugene-Miya"
            },
            "answer_text": "Short answer: yes. The architecture of computers has changed: computers now are 1) more electronic and 2) more digital. And example of an older, more mechanical computer was the Colossus (Colossi as there were nearly a dozen made) which had pulleys (one of the basic machines). These changes, of course, have people asking what constitutes a computer. They accomplish the same work in different ways. ",
            "date": "Updated June 18, 2013",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kaushik Gudapati",
                    "user_href": "/profile/Kaushik-Gudapati"
                },
                {
                    "user_id": "Mark Savchuk",
                    "user_href": "/profile/Mark-Savchuk"
                }
            ]
        }
    ]
}