{
    "title": "Is any idea truly original? - Quora",
    "tags": [
        "Discover",
        "Ideation",
        "Originality",
        "Ideas",
        "Business Ideas",
        "Discoveries",
        "Startup Ideas",
        "Innovation",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lukasz Laniecki",
                "href": "/profile/Lukasz-Laniecki"
            },
            "answer_text": "What does it mean, a ‘truly original idea’? ‘Not derived from something else’ or ‘preceding all others in time’, or ‘showing a marked departure from previous practice’? In dictionaries we can find all three definitions of the word ‘original’. An idea which would not be derived from something else would be like a unicorn. An idea which precedes all others in time (in other words, is new), but which is also clearly derived from something else? Happens all the time. Just like an idea which shows a marked departure from previous practice. It all depends on the specific definition of a ‘truly original idea’ upon which we will agree. I think the first definition is pointless. There is no point trying to prove to others that we only used our own brain and that everything happened inside our own brain, with no outside influence or inspiration. Apart from the fact that we might never be able to do that, it’s very selfish and its purpose is to depreciate the contribution of others. The second and third definitions, on the other hand, make perfect sense. We can almost always say who was the first person to come up with this new idea (who used something for the first time, who developed something which didn’t exist before, who found a new intersection, or who as a first person solved a particular problem). That it was derived from something else? That some other product/ idea/ thing/ thought inspired this person? Does it mean that our invention/ idea/ product/ thought lacks originality? Of course not. We all get inspired all the time. Our brains are constantly looking for ways to connect the dots. That’s how they operate. Without this ability we wouldn’t be able to come up with any idea. So I’d go as far as saying that were it not for our brains’ ability to be inspired and connect and move around pieces of information (picked by them from the outside world) we would never be able to produce even a single idea. ",
            "date": "Answered December 5, 2016",
            "views": "24",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jacob Maurer",
                    "user_href": "/profile/Jacob-Maurer-5"
                },
                {
                    "user_id": "Thulasizwe Dlamini",
                    "user_href": "/profile/Thulasizwe-Dlamini-1"
                },
                {
                    "user_id": "Kelly Charles",
                    "user_href": "/profile/Kelly-Charles"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Jones",
                "href": "/profile/Will-Jones-246"
            },
            "answer_text": "Let’s try to be rigorous in defining this. My answer is yes, but it’s predicated on assumptions you may disagree with, so let’s get those out in the open. What is an idea? At minimum, an idea seems to be related to some kind of thought that can generate the will to act upon the external world. Was the first person to drink water having an idea? Was the first person to use wood to create fire having an idea? I think so. Was the first person to see a fire that was spontaneously created having an idea? I think not. They were rather having a perception. They were merely being conscious. So in this sense, let’s say that an idea is a thought that expresses the intention of acting on the external world by exerting one’s will. Next, we must ask what is it to be original? Something that is original has never before been done — an action, an utterance, etc. — by anyone at any point. It is the origin from which all other actions are replicated, or are hence reactions. Using logical reduction, we must then ask ourselves — as humans, we create fires using wood. We learned to create fires using wood. Therefore, it must logically follow that at some point in time, somebody exerted the intentional will to create fire using wood for the first time. Note two components of this answer: 1) this person did not carry out this action accidentally. Therefore, it may have been that somebody before them indeed created fire from wood unintentionally, but this observation inspired a thought which had the potential to become intentional will to action. In this sense, ideas are a) causal inference about reality and b) are suggestive of a reality in which we are actors who act upon the external world. Think about what this then entails. Every time we discover a novel object — perhaps a rock formation, a mountain, a car, we then have the capacity to generate thoughts that express an intention to act upon those objects. Thus, every novel encounter with a new object creates the potential for original ideas. Lastly, notice an implication of the above. We needn’t necessarily have access to physical objects to generate ideas about them. We may, in fact, be capable of creating via thought an object that does not exist in the world. Nevertheless, I conjecture that it must be an arrangement of objects that already exist. On a deeper level, if you accept the argument above, you must then grapple with another problem: there are no ideas prior to perception of objects; ideas are thus the product of acting on already present objects. So let me turn the question back on you: does that make them original or not? ",
            "date": "Answered June 19, 2018",
            "views": "602",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chithmini Hettiarachchi",
                    "user_href": "/profile/Chithmini-Hettiarachchi-1"
                },
                {
                    "user_id": "James Jay",
                    "user_href": "/profile/James-Jay-50"
                }
            ]
        }
    ]
}