{
    "title": "Is buying a refurbished mobile phone good or should I go for a new one? - Quora",
    "tags": [
        "Refurbished Products",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Swamulu Kakumani",
                "href": "/profile/Swamulu-Kakumani"
            },
            "answer_text": "Deciding to Buy a Refurbished Cell Phone The decision to actually buy a refurbished cell phone has several parts, including the issue of whether buying any cell phone is really necessary. Other considerations include price, risk, and what kind of cell phone is actually wanted. Sometimes the right cell phone will be a refurbished phone; other times it will not be. Reasons to Buy a Refurbished Phone The most obvious reason to buy a refurbished phone is price. A refurbished phone is less expensive than a similar new phone, everything else being equal. Everything else is not always equal, and it is sometimes possible to find a deeply discounted new phone that is a better deal than a refurbished phone would be. Buying a refurbished phone is also a good way to stick with a favorite model a bit longer, even after the company has moved on to a new design. There are people who really like having the newest, flashiest gadget, but there are other people who really prefer to stick with what works for them. Finally, buying refurbished phones is one way to help reduce waste. Though many electronics companies now recycle their used products, reusing an item as many times as possible before recycling saves a lot of energy. Precautions Necessary With a Refurbished Phone The most serious risk with buying a refurbished phone is that it might not actually have been refurbished. Phones also sometimes come with histories, such as an unpaid balance from the previous owner. Finally, many people buy refurbished phones as an affordable way to replace a cell phone that has been lost or stolen. In such cases, the refurbished phone has to be added to an existing cell phone plan, and not all phones are compatible with all plans. Here is a list of ways to deal with these kinds of problems. Credits to : E-bay Blog and you can find more information here. Every start-up kick starts its journey with a hypothesis and YNew is no exception. Given the limitations of classifieds as a channel to sell & buy used devices, we launched a pilot store to solve the perils of individual sellers & buyers with a compelling value proposition for both the parties. Our attempt proved to be successful at a local level but we found it challenging to build a scalable business model. Our efforts of concurring with the existing ecosystem paved the way for immense learning and forced us to take a deep-dive in to the industry to excavate unexplored opportunities within this space. However building a two-sided platform is a daunting task and as a resource constrained start-up staying on in the game was a roller-coaster ride. YNew - India's most trusted re-commerce brand since 2012 for unboxed, refurbished and pre-owned smartphones, tablets, laptops and desktops of reputed brands. ",
            "date": "Answered July 18, 2016",
            "views": "38",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gyana Ranjan Sahoo",
                    "user_href": "/profile/Gyana-Ranjan-Sahoo-53"
                },
                {
                    "user_id": "Sahil Raza",
                    "user_href": "/profile/Sahil-Raza-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Preet Pandya",
                "href": "/profile/Preet-Pandya-1"
            },
            "answer_text": "The concept of Refurbished smartphones is not a new thing in western markets, but it wasn’t until recently that this term was well-known in India. Refurbished phones are not new phones. These phones have been used by consumers before, though they might not be used for a very long time.Refurbished phones have been used before and yes, there might be some minor scratches on the body, but They are not second hand phones.  When consumers return a faulty handset with a minor defect, it is repaired and sold as refurbished handset. phones are tested by the company and most of the time they come with same warranty. Advantages of buying Refurbished PhonesGood Price – The best part of refurbished phones is that they cost less than a new phone, but deliver the same experience. you can end up with a great deal if you know what you are looking for. Environment friendly – By buying refurbished phone, you help reducing electronic waste So if you take environment seriously, that is one more reason to buy a refurbished phone. Doubly tested – These handsets have been tested by company, by users and then again by skilled technicians so they go through more rigorous testing than new phones. Sites which sell refurbished goods in India like Togofogo, Greendust, Amazon Refurbished, Overcart, Value Cart and even Quikr is Selling Refurbished devices. If you are interested in buying a Xiaomi device i suggest you to go with Valuecart they are the official sellers for Refurbished Xiaomi devices. DisadvantagesAll electronic stuff, be it new phones or refurbished phones could be faulty, and that’s why there is warranty and return policy. If you are buying from a reputed seller and are buying a popular branded smartphone, you are not at any greater risk. Sites which sell refurbished goods in India like Togofogo, Greendust, Amazon Refurbished, Overcart, Value Cart and even Quikr is Selling Refurbished devices. PrecautionsRefurbished phones, like new smartphones may be defective and hence, return policy and warranty are very important. Also check efficiency of customer care department of the retailer you are buying from. Check phone accessories, ports and Battery Make sure that all inbox accessories are functional. Check IMEI number If you are buying from a lesser known retailer, make sure you check the IMEI number, which is usually available under battery or can be accessed by dialing *#06#. You should use IMEI number and contact manufacturer who can fill you in regarding the history of the phone and let you know if the phone was ever stolen, Don’t buy dated phones, Check Software  The phone should not have any suspicious third party app pre-installed on it which you cannot identify. Also make sure that the pone is properly reset to factory condition and is free from any content from previous owner.  PRO TIPIf you have the budget you should go with a brand new device for saving few bucks and buying a Refurbished phone might end you up in losing all you money But if you are really on a tight budget and want a high end phone with flagship experience i suggest you can go with the refurbished goods and until you are buying from trustworthy sources, there is not much reason to hold back. You can go ahead and enjoy a sweet deal. ",
            "date": "Answered March 18, 2016",
            "views": "13",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gyana Ranjan Sahoo",
                    "user_href": "/profile/Gyana-Ranjan-Sahoo-53"
                },
                {
                    "user_id": "Avinash Prabhu",
                    "user_href": "/profile/Avinash-Prabhu-9"
                },
                {
                    "user_id": "Ashok Samota",
                    "user_href": "/profile/Ashok-Samota"
                },
                {
                    "user_id": "Marcel Bischof",
                    "user_href": "/profile/Marcel-Bischof-2"
                },
                {
                    "user_id": "Md Rashid Alam",
                    "user_href": "/profile/Md-Rashid-Alam-14"
                },
                {
                    "user_id": "Sahil Raza",
                    "user_href": "/profile/Sahil-Raza-3"
                },
                {
                    "user_id": "Shreekara P Mathad",
                    "user_href": "/profile/Shreekara-P-Mathad"
                },
                {
                    "user_id": "Rudra Singh",
                    "user_href": "/profile/Rudra-Singh-392"
                },
                {
                    "user_id": "Navneet Raj Aneja",
                    "user_href": "/profile/Navneet-Raj-Aneja"
                },
                {
                    "user_id": "Sameer Patil",
                    "user_href": "/profile/Sameer-Patil-38"
                }
            ]
        }
    ]
}