{
    "title": "Is burning wood harmful to the environment? - Quora",
    "tags": [
        "Wood Burner",
        "Burns and Burning",
        "Woodworking Crafts",
        "Wood",
        "Fire",
        "Environmental Science",
        "Environmentalism",
        "The Environment",
        "Materials Science and Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ronald W. Garrison",
                "href": "/profile/Ronald-W-Garrison"
            },
            "answer_text": "Good question. Strictly speaking, I would think it is, but I don’t think there’s enough of it available to cause anywhere the amount of atmospheric mayhem that fossil fuels do. Or to go farther: If we burned as a big a proportion of the wood on the planet as we do of the coal and oil, it might rival what fossil fuels do. But we can’t, because wood is harder to use for a given amount of energy at large scales; and if we relied on it completely, we could never support anywhere near the present population, so the damage to the environment would be much less as a result. OTOH wood does a lot of harm to the interior environments that people inhabit. Indoor air pollution, in very poor places, due to using wood for cooking, or worse things like animal dung, is thought to cause a horrible amount of breathing problems worldwide. Burning stuff indoors also is a big problem for laundry and other housekeeping activities. ",
            "date": "Answered December 24, 2018",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pete Smoot",
                "href": "/profile/Pete-Smoot"
            },
            "answer_text": "As with most questions like this, it depends. Forest in California depend on burning every now and again. Thus, burning the forest or wood harvested from the forest might be beneficial. If you’re burning invasive foreign species, you might be doing great good. For example, a good kudzu bonfire might be a great thing in the deep south. Wood is a great renewable resource. We’ll probably never run out of trees whereas we eventually will run out of fossil fuels. Burning trees is carbon neutral, more or less. The smoke from wood burning stoves can cause smog. Where I live in a Northern California valley, we are not allowed to burn wood on some days because the smoke gets trapped in the valley. If enough of it is burned, the air gets unhealthy. ",
            "date": "Answered December 24, 2018",
            "views": "48",
            "upvotes": "0"
        }
    ]
}