{
    "title": "Is being a digital nomad lonely? - Quora",
    "tags": [
        "Digital Nomads"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gigi Griffis",
                "href": "/profile/Gigi-Griffis"
            },
            "answer_text": "It depends a lot on who you are and how you travel. Personally, I was much lonelier living in Denver full-time than I have been traveling full-time. Because loneliness isn’t about how many people are around you. It’s about connection. And it’s possible to feel disconnected and lonely anywhere. Of course, my experience isn’t the only experience. Many nomads are lonely. Others aren’t. It really seems to depend on the person, how much they enjoy their own company, how much they enjoy making new friends and creating new communities, and, importantly, how they travel. Being a digital nomad doesn’t have to mean moving every few days or every week or even every month. I know nomads who have two or three communities that feel like home to them and they bounce back and forth between them, with lots of new travel in between. One nomadic couple I know goes to South Africa, Switzerland, and Utah every single year. In between, they have plenty of other adventures, but those communities feel like home to them and they keep going back and building them up. I personally do this a bit with Paris - going back every year or two and spending more and more time with my wonderful girl friends there—a group that grows and shifts over the years. Others don’t have places they return to, but do travel slowly enough to make friends and feel connected to their communities. Staying for three months or six months or even a year or two in a new place can still feel very nomadic, but also allow you to really connect with a place and its people. Finally, some digital nomads (myself included) include good friends on our itineraries every year, which helps us stay connected to the people who matter most to us. This year, I spent four months living in my best friend’s town (a place she moved to fairly recently and I’d never been before). Last year, I invited a good friend to come live with me in Amsterdam for a week. Etc. etc. The bottom line is that being a digital nomad is a lifestyle that’s about total freedom. If you feel lonely, you can go live in your best friend’s town, invite someone to travel with you, or stay in a place longer and focus on building up your community. ",
            "date": "Answered May 12, 2016",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abena Edugyan",
                    "user_href": "/profile/Abena-Edugyan-2"
                },
                {
                    "user_id": "Janus Christiansen",
                    "user_href": "/profile/Janus-Christiansen"
                },
                {
                    "user_id": "Rog Fung",
                    "user_href": "/profile/Rog-Fung"
                },
                {
                    "user_id": "Sara Speiss",
                    "user_href": "/profile/Sara-Speiss"
                },
                {
                    "user_id": "Anna Kryszak",
                    "user_href": "/profile/Anna-Kryszak"
                },
                {
                    "user_id": "Dwuan Watson",
                    "user_href": "/profile/Dwuan-Watson"
                },
                {
                    "user_id": "Aayush Kumar Poddar",
                    "user_href": "/profile/Aayush-Kumar-Poddar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erika Awakening",
                "href": "/profile/Erika-Awakening"
            },
            "answer_text": "Ah, it's very timely that someone would request my answer to this question. YES, the answer is yes. A friend of mine who is a very successful travel blogger reached out to me the other night and admitted he has been feeling very lonely. That it is hard on him to meet people and say goodbye 3 days later, over and over again. This coincided with me feeling very isolated too. It's not just the travel that can be isolating. Most of us who quit our jobs really bailed from mainstream society. When I quit my job, suddenly I could spend months at a time in the mountains that I love ... but none of my friends could do the same, because they all had jobs or at least family obligations that tied them down. And so over time we grew apart more and more.  I kinda hit rock bottom with this the past year, as I grew into ultra-isolation while focusing on healing my cat. So I used one of my favorite tools (Holistic Belief Reprogramming, which is my version of EFT tapping and other spiritual practices).  Well, awesome things are happening. Through a series of synchronicity, last night I ventured to a Non-Violent Communication (NVC) practice group (the first of its kind in this community). Amazingly, one of my college roommates was there. It turns out she is in this area too and already has a deep community here. So I'm going to start building my community here. And feeling very excited about it :) Now, if you are moving every few days, it's going to be harder to cultivate that community. There are though, global online communities you can join so that you at least have that commonality with people all over the world. Personally I don't like to move every few days except for short periods of time. I don't like being geographically bound but I do like having community and roots. So each person needs to get in touch with their feelings and needs (NVC style) and then create a happy lifestyle from that grounding. Cheers.   ",
            "date": "Answered May 12, 2016",
            "views": "812",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                }
            ]
        }
    ]
}