{
    "title": "Is chemical engineering chemistry? - Quora",
    "tags": [
        "Engineering Education",
        "Chemical Engineers",
        "Chemical Engineering",
        "Higher Education",
        "Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shreyas Pathreeker",
                "href": "/profile/Shreyas-Pathreeker-1"
            },
            "answer_text": "No, it is not. However, a strong understanding of the underlying concepts of process chemistry is fundamental. A chemical engineering student learns about processes and their associated dynamics, such as materials flow and heat exchange. For example, let's assume you wish to make Hydrochloric Acid. You will need raw materials for this, which could be sodium chloride and water. Electrolyze these to obtain Hydrogen Chloride gas. Dissolve the gas in water to get Hydrochloric Acid. This is an established process, so you do not necessarily have to deal with it's chemistry. What a chemical engineer does could be designing an absorption tower for contacting the gas and water, or developing the heat exchange equipment for the reaction, or very often, both. Monitoring the process is also the job of a chemical engineer. This may not be a comprehensive example, due to its tiny representation of the vast chemical engineering industry.  Note: Phenomena such as polymerisation, which are strongly linked with the chemical engineering sector, do involve a significant amount of chemistry. This where the term 'interdisciplinary' comes in. Leave the 'why and how does this happen?' to the chemist. Think about 'how do I scale this up from the lab to a commercial plant?'. That's the job of a chemical engineer. ",
            "date": "Answered April 23, 2016",
            "views": "37",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sankalan Ghosh",
                    "user_href": "/profile/Sankalan-Ghosh-4"
                },
                {
                    "user_id": "Tan Rou Jing",
                    "user_href": "/profile/Tan-Rou-Jing"
                },
                {
                    "user_id": "Sudhang Varshney",
                    "user_href": "/profile/Sudhang-Varshney"
                },
                {
                    "user_id": "Shreyank Hampi",
                    "user_href": "/profile/Shreyank-Hampi"
                },
                {
                    "user_id": "Deepan Mukherjee",
                    "user_href": "/profile/Deepan-Mukherjee-2"
                },
                {
                    "user_id": "Ahmed Mohsen",
                    "user_href": "/profile/Ahmed-Mohsen-41"
                },
                {
                    "user_id": "Adnan Bandey",
                    "user_href": "/profile/Adnan-Bandey-1"
                },
                {
                    "user_id": "Nicholas Yap",
                    "user_href": "/profile/Nicholas-Yap-15"
                },
                {
                    "user_id": "Amrutha Raghu",
                    "user_href": "/profile/Amrutha-Raghu"
                },
                {
                    "user_id": "Milan Bhatt",
                    "user_href": "/profile/Milan-Bhatt-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Souhitya Sen",
                "href": "/profile/Souhitya-Sen"
            },
            "answer_text": "There’s a basic difference between Science and Engineering. Science is the study of the physical world while Engineering applies that scientific knowledge to design process, build structure etc. Chemistry is the subject that deals with the structure, properties and reactions of different substances while Chemical Engineering is associated with the design and operation of the chemical plant that requires not only knowledge of chemistry but also that of physics. I will tell you what major chapters we study in Chemical Engineering and how they’re connected with Chemistry or Physics. Heat Transfer: Here we study different modes of heat transfer (Conduction, Convection and Radiation) and apply that knowledge to deal with the heat produced/lost during an industrial chemical process by designing equipment, for example, heat exchanger. So this area is “Physics dominated”.Mass Transfer: This area resembles Physical Chemistry. Here we learn about the separation techniques to separate valuable materials from other valuable materials or from unwanted ones by distillation, absorption, adsorption, extraction, membrane separation technique, electrochemical separation technique etc.Reaction Engineering: Here we learn reaction kinetics - a purely “Chemistry thing” and then applying that knowledge, we design reactors.Process Control: This area is quite different from any other field. Here by using advanced mathematical tools, we design automated systems that can be incorporated in a chemical plant.Fluid Mechanics: The term ‘Mechanics’ suggests that a lot of Physics is involved in this. We try to understand the dynamics of fluid flow. It has major applications as many industrial processes involve flow of fluid (liquid and gas) through pipe/tube etc.Thermodynamics: The scientists (both Physicists and Chemists) learn thermodynamics and so does Chemical Engineers. The difference is an engineer’s main job is to apply the theoretical knowledge in practical field. Manufacturing AC, refrigerator, humidifier etc are some typical examples on this context.Process Calculation: This is again a “Chemistry thing”. Here we learn the stoichiometry of a chemical process.Transport Phenomena: This is nothing but the stream that connects 3 areas having many things in common - Heat Transfer, Mass Transfer and Fluid Mechanics.The scope of each of the chapters is much broader than what I’ve written here. But what I wanted to mean is that Chemical Engineering is not Chemistry. It is the branch that teaches us how to run a chemical process plant which, apart from requiring knowledge of reactions, also requires knowledge of “physical things’’ that take place around the chemical boom! ",
            "date": "Answered May 23, 2017",
            "views": "15",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Abel",
                    "user_href": "/profile/Anthony-Abel-3"
                },
                {
                    "user_id": "Manish Tiwari",
                    "user_href": "/profile/Manish-Tiwari-1101"
                },
                {
                    "user_id": "Surajit Samui",
                    "user_href": "/profile/Surajit-Samui-2"
                },
                {
                    "user_id": "Rad",
                    "user_href": "/profile/Rad-149"
                },
                {
                    "user_id": "Shirsendu Mitra",
                    "user_href": "/profile/Shirsendu-Mitra"
                },
                {
                    "user_id": "Sundara Vadiveal",
                    "user_href": "/profile/Sundara-Vadiveal"
                },
                {
                    "user_id": "Tooba Fatma",
                    "user_href": "/profile/Tooba-Fatma"
                }
            ]
        }
    ]
}