{
    "title": "Is Cyberpunk 2077 overrated? - Quora",
    "tags": [
        "Cyberpunk 2077 (2020 game)",
        "Cyberpunk",
        "Overrated Things or People"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Lawson",
                "href": "/profile/William-Lawson-97"
            },
            "answer_text": "It isn’t actually “rated” yet, because the game isn’t out. Whether it’s overhyped is a different question. I wouldn’t go there at this point. Hype is subjective and I would say most of the people who are “hyped” for the game aren’t clear with everything that’s been confirmed to be part of it, that’s a LOT of information that was scattered out throughout the recent two years and some of that information can be pretty challenging to find. I’ve been keeping an eye on this game since 2O13 and there’s next to nothing I don’t know about it other than information that’s been deliberately withheld by the company itself. That stacks up to a smaller essay of info confirmed by Projekt Red so far, and all of that is really just a smaller glimpse of everything that will probably be coming with the full package on launch. Judging from what some players know about it, this game could be underhyped. So personally, no, I wouldn’t mistake it for overhyped, it LOOKS like it’s overhyped because the hype is just enormous, but I’d say it’s very much tempered when compared to the big picture. ",
            "date": "Updated July 24, 2019",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Liam Abir",
                    "user_href": "/profile/Liam-Abir"
                },
                {
                    "user_id": "Dez Dandy",
                    "user_href": "/profile/Dez-Dandy"
                },
                {
                    "user_id": "Alex Krasko",
                    "user_href": "/profile/Alex-Krasko"
                },
                {
                    "user_id": "Jonah Billerbeck",
                    "user_href": "/profile/Jonah-Billerbeck"
                },
                {
                    "user_id": "Samuel Lass",
                    "user_href": "/profile/Samuel-Lass"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Bezar",
                "href": "/profile/Daniel-Bezar"
            },
            "answer_text": "We can decide that once the game comes out April 16, 2020. Considering everything that has been shown about this game, I’m excited for it considering how lack luster a lot of AAA games have been lately…I’m looking at you Anthem. Right now I want a solid single player game, a game that isn’t bogged down by four different additions, wasteful DLC and the like. Cyberpunk 2077 will be the game that will set the standard of top quality games, a standard a lot of formerly upheld companies have forgotten over greed. So let’s wait and see, though for me I’m hyped. ",
            "date": "Answered August 11, 2019",
            "views": "772",
            "upvotes": "0"
        }
    ]
}