{
    "title": "Is COMSATS a good university for getting a BSCS? - Quora",
    "tags": [
        "COMSATS Institute of Information Technology",
        "Bachelor of Science in Computer Science",
        "College and University Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "FaiQa SalEem",
                "href": "/profile/FaiQa-SalEem-2"
            },
            "answer_text": "Yes Of course COMSATS has Ranked very highly in pakistan and internationally National (By Higher Education Commission) CIIT has been ranked number 03 in General Category in 2015.CIIT has also been ranked number 06 in overall universities within Pakistan in 2015.Ranked Number 2 in Research Productivity among all universities of Pakistan in 2015.Ranked Number 1 in Computer Science and IT Category in 2012.For further details please visit: https://www.comsats.edu.pk/AboutCIIT/Ranking.aspx CIIT’s Rankings & Reputation International TIMES Higher Education (THE) Rankings: CIIT has been ranked #301-400 in the 2018 Times Higher Education ‘Engineering and Technology’ subject ranking.CIIT has been placed among top 601-800 World Universities in THE World Universities Rankings (WUR) 2016-17 and 2017-18, where CIIT was ranked 1st in 2016-17, and 2nd in 2017-18 within Pakistan.CIIT has been ranked 137 in the prestigious TIMES Higher Education (THE) BRICS & Emerging Economies Rankings for the year 2017CIIT has been ranked among 141-150 in THE Asia University Rankings 2017CIIT has also been ranked among 150-200 top young universities of world by THE 2017.QS Rankings: In the year 2017, CIIT has been ranked at 190th position in Quacquarelli Symonds (QS) Asian Universities Rankings 2017CIIT is ranked among top 250 Asian Universities as per QS University Rankings 2014, 2015 and 2016.In 2016, CIIT was among 401-500 in QS World University Rankings by Subject CS & Information Systems in 2016.In 2015, CIIT was at number 301 in 301-400 QS World University Rankings by Subject Mathematics 2015-16.Other Rankings and Achievements: CIIT is ranked at # 2 in Information Technology University’s (ITU) Quality Research Ranking 2016 of over 200 Universities.CIIT is ranked at #2 in University Ranking in Pakistan and # 967 in the World University Ranking 2015-2016 by Middle East Technical University (METU) Turkey.CIIT has been awarded three Stars rating out of a total of five by QS Star Rating System in 2013. Besides, five stars have also been awarded to CIIT in Teaching, and Learning, Facilities and Engagement.may these info in helpful to uh",
            "date": "Answered May 9, 2018",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Usman Munir",
                    "user_href": "/profile/Usman-Munir-52"
                },
                {
                    "user_id": "Kashif Arif",
                    "user_href": "/profile/Kashif-Arif-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Waqas Piracha",
                "href": "/profile/Waqas-Piracha-2"
            },
            "answer_text": "COMSATS is a decent enough university but being a graduate i feel that we lack the necessary exposure. The labs are state of art, and the facilities are good enough. Most theoretical teachers are highly qualified, but i personally feel that the lab instructors are under qualified and enough emphasis is not paid on lab projects and lab activities. So in general, it depends on how much interest you take in labs. If you want to learn no one can stop you from learning, but in general the lab atmosphere is not such which compels you or forces you the learn any way. However, i would advice you that if possible go to FAST for CS as the course curriculum is far more up to date with some of the most recent courses such as machine learning also included in their curicullum. ",
            "date": "Answered July 16, 2017",
            "views": "27",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Moiz Ally",
                    "user_href": "/profile/Moiz-Ally"
                },
                {
                    "user_id": "Muazzam Saqib",
                    "user_href": "/profile/Muazzam-Saqib"
                },
                {
                    "user_id": "Huzaifa Imran",
                    "user_href": "/profile/Huzaifa-Imran-8"
                },
                {
                    "user_id": "Shahroz Nadeem",
                    "user_href": "/profile/Shahroz-Nadeem-4"
                },
                {
                    "user_id": "Zara Tariq",
                    "user_href": "/profile/Zara-Tariq-7"
                },
                {
                    "user_id": "Tehseer Ali",
                    "user_href": "/profile/Tehseer-Ali"
                },
                {
                    "user_id": "Ali Raza",
                    "user_href": "/profile/Ali-Raza-1659"
                }
            ]
        }
    ]
}