{
    "title": "Is complete synergy between two or more computers possible? - Quora",
    "tags": [
        "Synergies (economics)",
        "Computer Engineering",
        "Computer Hacking (security)",
        "Computer Networking",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Max Christy",
                "href": "/profile/Max-Christy"
            },
            "answer_text": "There are ways to do this. You could store a file on a cloud-based storage system, accessing from both systems. You could also set up a network drive that is mapped to both computers. Mapped meaning you have setup the drive on both computers. This would show up as just another harddrive in your explorer view. Im fairly sure there are plenty of ready out of the box systems, where you just need to connect the external harddrive to wifi or ethernet. If using Windows, you can also set up a shared folder on your computers. It acts similarly to a network drive, with slower performance. Also the computer with the file you want to access, must be turned on when you go to open and save the file. That is just concerning file sharing. If you wanted to have the exact same desktop on both computers, you may want to look into setting up a small domain on your computers. This will require a cheap server (in your case an old computer running ~ 2GBs RAM). You will also need to be running Professional/Ultimate/Enterprise versions of Windows on all your client computers, and have a copy of windows Server isntalled on your server. Probably not interested in this option, there is a steep learning curve for setting up domains. If you have Apple, you can use a network drive. I believe they sell just such an item, not the Time Machine external backup, but other networked hard drives. The setup is easier if you get Apple branded products. ",
            "date": "Answered August 24, 2015",
            "views": "296",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jim Knopf",
                    "user_href": "/profile/Jim-Knopf-1"
                }
            ]
        }
    ]
}