{
    "title": "Is China more capitalist than the US? - Quora",
    "tags": [
        "Capitalism",
        "China",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Ahluwalia",
                "href": "/profile/Sean-Ahluwalia"
            },
            "answer_text": "They both operate under the global capitalist market and thus have variations of capitalism for their economic system. The United States economy is dominated by privately-owned enterprises and features very little national-level economic planning or direction (which is not the same thing as regulation); the Chinese economy has a large state sector and an active role for state-directed activity through state owned enterprises and through use of the financial system to direct economic development. The United States economy is best described as a “standard” relatively free-market capitalism, whereas China’s economy is best described as state capitalism. Ideologically the People’s Republic of China is socialist, meaning its official aim is the development of a socialist economy and society. Officially the Chinese economic system is called a “socialist market economy” but it is hard to consider it socialist while stock markets exist, widespread private ownership of industry exists alongside state ownership, wage labor remains the dominant and often sole source of income, and the state sector keeps its profits as retained earnings. Only time will tell if China will actually be able to make a successful transition to some form of socialism in the future. ",
            "date": "Answered November 5, 2017",
            "views": "12",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Grant Hartlage",
                    "user_href": "/profile/Grant-Hartlage-1"
                },
                {
                    "user_id": "Dongdong Huang",
                    "user_href": "/profile/Dongdong-Huang-3"
                },
                {
                    "user_id": "Jordan Scuffle",
                    "user_href": "/profile/Jordan-Scuffle-1"
                },
                {
                    "user_id": "Henry Resheto",
                    "user_href": "/profile/Henry-Resheto"
                },
                {
                    "user_id": "Tony Mcdonald",
                    "user_href": "/profile/Tony-Mcdonald-31"
                },
                {
                    "user_id": "Brian Johnson",
                    "user_href": "/profile/Brian-Johnson-429"
                }
            ]
        },
        {
            "author_info": {
                "name": "Xiaoming Guo",
                "href": "/profile/Xiaoming-Guo-11"
            },
            "answer_text": "Yes. The core of capitalism is the market competition. The US is using its hegemony power to manipulate the market so the US can have a monopoly profit. American’s hegemony power for monopoly profit destroy the market competition and betrait the capitalism. The best capitalism is perfect competition. Perfect competition has diminishing profit. Whenever a products is made in China, the price dropped and the profit diminished. So China plays a role in the global economy as a market competitor. China is making the world economy more capitalism. China is pushing capitalism to the world so to facilitating the coming of communism. Marx concluded that communism can come to the world as a whole and only after the world has developed capitalism fully. The US prevented capitalism to develope in the developing world, and China initiated BRI to spread capitalism to the world. ",
            "date": "Answered September 21, 2020",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brandon Persaud",
                    "user_href": "/profile/Brandon-Persaud-21"
                }
            ]
        }
    ]
}