{
    "title": "Is giving smart phones to kids good for them or bad? - Quora",
    "tags": [
        "Children and Technology",
        "Bad",
        "Good",
        "Smart People",
        "Mobile Technology",
        "Intelligence",
        "Children",
        "Technology",
        "Parenting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Kord",
                "href": "/profile/Ted-Kord-4"
            },
            "answer_text": "It’s not just a bad idea, it’s a horrible idea.  Imagine you’re the teacher in charge of a standard California high school class of 40 students. 15 of your students kids smoke 2 or more packs of cigarettes a day, another 10 smoke a single pack per day, and all the rest smoke something less than a pack a day. The 15 kids who smoke 2 or more packs a day are addicted to nicotine. As a teacher, you don’t allow them to smoke in class. But the pack of cigarettes is in their pocket and they’re constantly craving the relief that only a cigarette will appease. You I might be showing them how to simplify an equation, but all they can think about is the sweet, sweet tobacco in their pocket. When surveyed, about half of teens admit they are addicted to their smartphones. And those are just the one’s admitting to it. Most addicts won’t admit they have a problem. Cell Phone Addiction is a real thing. It effects adult who, presumably, have more control of themselves. But according to Lena Firestone… The percentage of smartphone users who would actually be classified as addicted is estimated between 10-12%, according to the director of the Center for Internet and Technology Addiction, Dr. David Greenfield. However, in a survey of cell phone users, Dr. Greenfield found that around 90% of Americans fall in the category of overusing, misusing or abusing their devices. A recent study also found that 50% of teens feel that they are addicted to their devices.  Cell phone and their apps are designed the way slot machine manufacturers design their products, and with the exact same result in mine, to keep people glued to them. My grandfather was a strong man. He was an Army Sgt. when WWII began and didn’t get out until after the allies occupied Berlin. He quit smoking cold turkey after the war and never drank more than a glass of wine a night. He believed in hard work and moderation in all pleasures. After my grandmother died he started going to casinos with his second wife and burned through tens of thousands of dollars. The machines just grabbed hold of him and wouldn’t let go. No the same psychological tools used to keep him in front of a slot machine are used by Silicon Valley to get and keep people’s attention. If adults can’t moderate their behavior with these devices, how the hell can we expect children to moderate their behavior. In addition to cell phones being addicting, they are also fun. For those over 30 try to imagine going to school with… …your entire record collection…  …your favorite toy…  …all your video games…  …your favorite TV shows…  …You Tube videos…  …movies…  …porn…  …the ability to pass not to anyone, anywhere…  …a spy camera…  So kids have all this at their disposal, and many are completely addicted to using all that, and they’re supposed to concentrate on this.  I catch probably 2 dozen kids a day texting or playing video games, but if I really applied myself I could catch 4 or 5 dozen kids on their phone in a day. We’ve been directed to not “touch” students cell phones by administration, so NO…we don’t take their phones away.  Distraction from learning is the most benign result of kids with cell phones. It’s not uncommon for students to text a friend in another class and arrange a mutual trip to the bathroom. Hopefully, the purpose of the meeting is just to hang out with a friend for a few minutes. But in all to many cases the cell phones are being used to coordinate bathroom trips for the sake of sharing or selling marijuana.  Cell phones are involved in most cheating incidents. If I give out homework 1st period, by 3rd period numerous kids will have been sent a picture of someone’s completed paper. Sometimes the answers are “air dropped” to the entire class. Cell phones allow students to cheat on an industrial scale. But the worst thing about cell phones is that the majority of kids spend so much time looking at that flashing little screen that they’ve lost all interest in anything else. More than half my freshmen have NEVER read a book. Most lack to ability to concentrate long enough to read 5 pages of a textbook. Many have absolutely no interest in anything…sports, comic books, even driving. My own nephew is a 16 year old cell phone addict and he’s absolutely disinterested in learning to drive. He’s also a D student. No subject in school interests him as much as his cell phone. ",
            "date": "Answered June 13, 2019",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kunjan Trivedi",
                    "user_href": "/profile/Kunjan-Trivedi-9"
                },
                {
                    "user_id": "Paul Tang",
                    "user_href": "/profile/Paul-Tang-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayush Tyagi",
                "href": "/profile/Ayush-Tyagi-63"
            },
            "answer_text": "Bad, and I can say that because I have used one in 10th and that was not even smartphone but that phone certainly did not helped me in any way . So in my opinion do give phones to kids however they can use your phone as a help to keep it up with their projects . Other thing is if your kid is studying at some other place and you want to keep an eye on him then you can give him a phone but it would certainly have demerits. Moving on to health, a phone is truly injurious for kids health and if I had to point out one part I would say eyes..hope I helped you..thanks ",
            "date": "Answered January 1, 2019",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arushi Tyagi",
                    "user_href": "/profile/Arushi-Tyagi-26"
                }
            ]
        }
    ]
}