{
    "title": "Is Google Home Mini wireless? - Quora",
    "tags": [
        "Google Mini (discontinued Google product)",
        "Google Home Mini",
        "Google Home (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jas Singh",
                "href": "/profile/Jas-Singh-233"
            },
            "answer_text": "Yes, it is. It uses a wireless network from your Router to go about and do it’s operations around your home and to do what you ask of it. You have to set it up using the Google Home app which allows you to: Connect to a networkIssue the mini commands such as “turn the lights on” (also via Google Assistant)Alter any settingsConnect services (and make some default) i.e. Spotify or Play MusicWireless connectivity also allows the mini to connect to other Google devices such as a Chromecast, so in a command you can get mini to cast a video to your TV, for exampleIn addition to wireless capability, it also has support for Bluetooth which could be used to connect to other devices such as smartphones and allow you to play music or take callsThanks for the A2A. Hope this helps! ",
            "date": "Answered February 6, 2019",
            "views": "35",
            "upvotes": " Answer requested by Mary Ribourg",
            "upvoters": [
                {
                    "user_id": "Dev Manghnani",
                    "user_href": "/profile/Dev-Manghnani"
                },
                {
                    "user_id": "Sneha Mandan",
                    "user_href": "/profile/Sneha-Mandan-1"
                },
                {
                    "user_id": "Ivan DK",
                    "user_href": "/profile/Ivan-DK"
                },
                {
                    "user_id": "Wenwen Tao (陶雯雯)",
                    "user_href": "/profile/Wenwen-Tao-陶雯雯"
                },
                {
                    "user_id": "Tamim Swaid",
                    "user_href": "/profile/Tamim-Swaid"
                },
                {
                    "user_id": "Yair Livne",
                    "user_href": "/profile/Yair-Livne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jared Zimmerman",
                "href": "/profile/Jared-Zimmerman"
            },
            "answer_text": "I’m not on the hardware team but I do have a background in hardware design that I can use to make some generalities. Batteries, especially high capacity quality ones with little memory effects tend to be quite expensive. Due to the inexpensive target total material cost, I assume that a decision was made in the product development process that targeted a price under what would be if a battery was included. While many contributing factors come into play this could have been a major contributing factor. Completely wireless devices with batteries also tend to to have a higher expectations of portability, e.g. use outside the home. Companies can’t really control how devices are used once they’ve been purchased and put out into the world. It doesn’t really matter what you say a device is for, or how to use it, people will do what they want. But then you have to deal with the complications of supporting use case you never intended, suddenly you’re supporting tethered wifi connections from phones at the beach. If you want to use Google Home (full size device) unplugged you can get a Battery Base off amazon. If you’re open to to possibly voiding your warranty of the Google Home Mini you could get a high capacity battery pack like the Anker PowerCore and connect it via mini-usb to the input power port on the Google Home Mini. ",
            "date": "Answered May 24, 2018",
            "views": "73",
            "upvotes": " View 6 Upvoters "
        }
    ]
}