{
    "title": "Is giving him space in my long distance relationship going to make things worse or better? - Quora",
    "tags": [
        "Long-Distance Relationship Advice",
        "Long-Distance Relationships",
        "Relationship Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anjali Mishra",
                "href": "/profile/Anjali-Mishra-331"
            },
            "answer_text": "Since you are asking this question, it means that your ship is not sailing as smoothly as you would like. In situations like these ( especially in long distance relationships) it's very difficult to assess what is actually going on in the other person's mind. But i can assure you that it's always better to give the other person some space to breathe and figure out what they want in any relationship. Because if you just force your opinions and decisions on them, there will come a time that you'll just drift apart. And that to emotionally. And after that, its nearly impossible to bridge the gap. Giving him space is kind of a good solution. It's like a test of your relationship. If things become better after that, then your relationship will be stronger than ever. You'll be more comfortable and closer to each other. But if things take a turn for the worse, then you may have misunderstood the signals your partner was giving to. I hope and pray that this doesn't happen to you. But should it happen, you should find solace in the fact that you got out of a relationship in which you were wasting your time. If the other person doesn't put in the same amount of effort and commitment as you, then you'll always end up feeling drained. Which is not going to be healthy for you in the long run. So, whatever his stand his, accept it gracefully because my dear, the heaven's always got a better plan for you than you have for yourself. And one final piece of advice. Whatever happens, do not wait forever for his answer. Give him space, but give him a strict and straight forward deadline. No matter how much you love him, he is not entitled to leave you hanging forever and ever. And if he keeps you waiting and doesn't seem to put in any effort,then don't hesitate to move on. I know it'll be excruciatingly painful, but you'll be alright after some time. It's your right to be happy. And you have to, in no way, feel guilty about the decisions you take for your happiness. Good luck girl. I hope everything works out for you. Let me know. :) ",
            "date": "Updated August 15, 2018",
            "views": "23",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Natasha Abidin",
                    "user_href": "/profile/Natasha-Abidin"
                },
                {
                    "user_id": "Liv Rachel",
                    "user_href": "/profile/Liv-Rachel"
                },
                {
                    "user_id": "Jeanette Luong",
                    "user_href": "/profile/Jeanette-Luong-2"
                },
                {
                    "user_id": "Stephanie Fernandez",
                    "user_href": "/profile/Stephanie-Fernandez-27"
                },
                {
                    "user_id": "Kelly Clarke",
                    "user_href": "/profile/Kelly-Clarke-53"
                },
                {
                    "user_id": "Jailisa Jones",
                    "user_href": "/profile/Jailisa-Jones"
                },
                {
                    "user_id": "Rika Reeks",
                    "user_href": "/profile/Rika-Reeks"
                },
                {
                    "user_id": "Athica Mohamed",
                    "user_href": "/profile/Athica-Mohamed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annabelle Smith",
                "href": "/profile/Annabelle-Smith-64"
            },
            "answer_text": "Do what is best for the both of you. If he tells you that he needs some space and time to sort things out, give it to him, and trust him. Always ask him what he needs if you're unsure, and he should do the same to you. Every couple is different, everyone has different needs. Make sure you talk to each other to figure one another out. Some couples find that they grow closer by regularly spending time together, while others like to take breaks so they have more to share when they talk again. There is no right or wrong, but there is healthy and unhealthy. And healthy relationships communicate and compromise. :) ",
            "date": "Answered June 2, 2020",
            "views": "486",
            "upvotes": " Answer requested by Michelle Altubar"
        }
    ]
}