{
    "title": "Is Huawei watching us? - Quora",
    "tags": [
        "ZTE Corporation",
        "Huawei Smartphones",
        "Huawei Devices",
        "Intelligence Agencies",
        "Surveillance",
        "Huawei (company)",
        "Espionage and Spying",
        "Android Devices",
        "International Relations",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roy Tong",
                "href": "/profile/Roy-Tong-10"
            },
            "answer_text": "Do you think a Chinese private company has the time and money to watch you. It is because Cisco Networks lobbies the trump administration to prevent the Chinese from obliterating them to oblivion, Cisco Networks is at least 2 years behind the Chinese in terms of Technologies and 3 times more expensive. The trump administration then starts to do dirty politics and spin lies to the world. Did you ever see any proof given by the Americans? CIA, NSA, FBI, US military have all been hacking, stealing and spying on these Chinese companies, universities, governmental agencies (Edward Snowden via Wikileaks) over the years but has not found one single bit of evidence …. Zip …. Zero … nothing. Instead it was those American companies that were caught assisting the Americans (CIA, FBI, NSA, US military) to spy globally on everyone. Companies like Apple, Facebook, Google, Yahoo, IBM, Dell l, Intel, Qualcomm, Cisco Networks, Junipter Networks, AT&T, UPS and a lot more was caught when Project PRISM was leaked by Edward Snowden via Wikileaks. I do not know how many of these American companies are still assisting in spying and stealing information globally. ",
            "date": "Answered April 20, 2019",
            "views": "271",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Changzheng Li",
                    "user_href": "/profile/Changzheng-Li"
                },
                {
                    "user_id": "Franklin Wien",
                    "user_href": "/profile/Franklin-Wien"
                },
                {
                    "user_id": "Xile Ba",
                    "user_href": "/profile/Xile-Ba"
                },
                {
                    "user_id": "Meng Lee",
                    "user_href": "/profile/Meng-Lee-51"
                },
                {
                    "user_id": "Alexander Kolesnik",
                    "user_href": "/profile/Alexander-Kolesnik-1"
                },
                {
                    "user_id": "Jeffrin Syow",
                    "user_href": "/profile/Jeffrin-Syow-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Lacno",
                "href": "/profile/Adrian-Lacno"
            },
            "answer_text": "First ask yourself, what values do you have to offer that they have to use their billions dollars infrastructure to “watch” you. You have this thinking because most likely grow up in a society like US who is master in paranoid and the self space ideology. Private company like FB, google watching you is because they want to know more about you so they can sell you more product, just like in the scene in the movie Minority Report when Tom Cruise walked into a mall. Companies like Intel, and microsoft has closest access to your information on you HD. They have backdoor. This information was published. Huawei devices so far have no evidence of backdoor. Global nations have been asking US to prove it if they have evidence instead shouting loudly about it. ",
            "date": "Answered April 20, 2019",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Franklin Wien",
                    "user_href": "/profile/Franklin-Wien"
                }
            ]
        }
    ]
}