{
    "title": "Is Hightech Solutions a genuine online data entry company? - Quora",
    "tags": [
        "High-Tech Solutions Pte Ltd",
        "Data Entry Outsourcing",
        "Data Entry",
        "Online Jobs",
        "Job Searches"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sreekrishnan SK",
                "href": "/profile/Sreekrishnan-SK"
            },
            "answer_text": "Ok here is my experience . I planned to do data Entry because of urgent need for cash. I searched all over the internet and apps and finally found a convincing one. I contacted them via email and WhatsApp. . A lady responded. She told I need to pay ₹3400 as registration fees and she also showed so many proofs. She told I need to type 500–550 pages of word document from uneditable PDF file within 24 days. They said they will give ₹20000. I borrowed amount form my friends and paid them via paytm to their bank account. Then they send the details of work and a word file called Memorandum of understanding stating that if they cheated me then I can go to court with this form. First page of word file.  Last page of word file.  By the first look of this I know that it's not a real one but I didn't cared. Then by evening they send the working materials to my mail. I saw that and had a doubt. I called that lady but didn't took the call instead she replied this on WhatsApp  I was shocked. I called on another number and she told me to call to helpline. I called and a person from that side cleared my queries. I did the work day and night and I send the finished work(word file) to them. They mentioned it will take 5–6 days to check the finished word file. After few days I got this mail.  I lost ₹3400 and 24 days of hard effort. So my advice is to not to pay anyone in advance who says he will give the work online. And if they say it's a genuine company then ask for CIN number. Thanks. ",
            "date": "Answered February 23, 2017",
            "views": "86",
            "upvotes": " View 38 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deepa Sawant",
                    "user_href": "/profile/Deepa-Sawant-1"
                },
                {
                    "user_id": "Anjali Sabharwal",
                    "user_href": "/profile/Anjali-Sabharwal"
                },
                {
                    "user_id": "Praveen Meghwal",
                    "user_href": "/profile/Praveen-Meghwal-11"
                },
                {
                    "user_id": "Lahari Mallareddy",
                    "user_href": "/profile/Lahari-Mallareddy"
                },
                {
                    "user_id": "Thrivikram Lucky",
                    "user_href": "/profile/Thrivikram-Lucky"
                },
                {
                    "user_id": "Annu Rani",
                    "user_href": "/profile/Annu-Rani-35"
                },
                {
                    "user_id": "Khushboo Kathuria",
                    "user_href": "/profile/Khushboo-Kathuria-3"
                },
                {
                    "user_id": "Meghna Joseph",
                    "user_href": "/profile/Meghna-Joseph-4"
                },
                {
                    "user_id": "Siddiqhiya Roshan Ara",
                    "user_href": "/profile/Siddiqhiya-Roshan-Ara"
                },
                {
                    "user_id": "Rupesh Waghmare",
                    "user_href": "/profile/Rupesh-Waghmare-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aswin K B",
                "href": "/profile/Aswin-K-B"
            },
            "answer_text": "I don't know about high-tech solutions. But I know the company Biostar data management. They are like this we can't compete their task. They find deep mistakes we typed.  ",
            "date": "Answered November 26, 2018",
            "views": "23",
            "upvotes": "0"
        }
    ]
}