{
    "title": "Is it possible for a PC to have too much RAM? - Quora",
    "tags": [
        "Computer Memory",
        "Random-Access Memory",
        "Personal Computers",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brett Watters",
                "href": "/profile/Brett-Watters"
            },
            "answer_text": "Typically there is no real issue with having too much RAM. There would be a few strange exceptions. Older OSs (say 32-bit versions of Windows) are limited to 4GB of RAM so any more is just wasted. Likewise Windows (Home) has a limit of 128GB of RAM. Most consumer/desktop mother boards don’t support this so it typically isn’t an issue… baring installing Home on a big server or something. RAM does use power. So, having 64MB of RAM when you only use 8MB is a small waste of power. For desktop, this is a dollars in power per year, but for a tablet or laptop, it can have significant effects on battery life. RAM also takes up space (again more an issue for laptops/tablets) and cost money. Paying for 64GB of RAM when you only use 16MB is a waste of money. Finally, there is a limit of how much RAM you can realistically use based on the rest of the hardware. Most applications which use large amounts of RAM typically use a lot of processing power and often graphics/video. A lower-end machine with 64GB of RAM may not be able to effectively use that memory simply because its processor, hard drive, graphics card, etc. is simply too slow to be feeding data to that much RAM. For example, a CAD program or video editing program which might actually benefit from having 16GB or 32GB of RAM… probably isn’t going to run well on a laptop or tablet anyway. ",
            "date": "Answered August 21, 2019",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Marsh",
                "href": "/profile/Brian-Marsh-4"
            },
            "answer_text": "the CPU/Chipset may support a maximum amount of ram - that amount may be less than what can physically be installed. Typically the additional ram is just “ignored”/not available for usage but the computer otherwise works - in some cases it may cause it not to work. (This was the case about 12 years ago with some having a 3GB ram limit from the CPU/chipset but physically 4 GB of ram could be installed, I’ve read about some similar cases on newer systems, but don’t have specifics immediately available) One other possible small side-effect of lots of ram - is slightly longer boot times - as computers do a quick check on the ram as it starts up - more ram takes longer to check. Rarely some applications may not function if there is too much ram, but again, this was more of an issue over 10 years ago, and generally isn’t seen with modern apps. Other then that, all current modern Operating Systems will use all available ram for caching, so it speeds up all other operation of the computer, even if a particular application won’t make use of the additional ram. ",
            "date": "Answered August 21, 2019",
            "views": "132",
            "upvotes": "0"
        }
    ]
}