{
    "title": "Is it possible to still make it big on YouTube or social media, or has the industry become too saturated? - Quora",
    "tags": [
        "Entertainment",
        "The Internet",
        "YouTube",
        "Social Media"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dhruv Dhankar",
                "href": "/profile/Dhruv-Dhankar"
            },
            "answer_text": "The simple answer is Yes. Although the no. Of YouTubers / content creators is increasing rapidly we should also consider the amount of viewers who are consuming this content. An audience wants something new and refreshing . Obviously the good old creators are still there and have audiences attention but if you are creative enough, if you are willing enough , if you bring something fresh in the game then definitely people will watch it and appreciate it. ( I am a new youtuber as well and honestly being successful on YouTube is easy than it will be tomorrow and so on) ",
            "date": "Answered June 26, 2018",
            "views": "353",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shubham Dangi",
                    "user_href": "/profile/Shubham-Dangi-20"
                },
                {
                    "user_id": "Abhishek Astalkar",
                    "user_href": "/profile/Abhishek-Astalkar"
                },
                {
                    "user_id": "Karen Swyszcz",
                    "user_href": "/profile/Karen-Swyszcz"
                },
                {
                    "user_id": "Sri",
                    "user_href": "/profile/Sri-455"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Hahn",
                "href": "/profile/Eric-Hahn-26"
            },
            "answer_text": "According to Tech Crunch, there are 1.5 billion logged in users visiting YouTube every month. 1.5 billion! YouTube has 1.5 billion logged-in monthly users watching a ton of mobile video I couldn’t find out how many YouTube marketers there are, but I am willing to bet that it is not even close to being enough to saturate a market of that size. So, yes, it is still very possible. Cheers! ",
            "date": "Answered June 27, 2018",
            "views": "134",
            "upvotes": " Answer requested by Alexandra Way"
        }
    ]
}