{
    "title": "Is it OK to use your phone while charging? - Quora",
    "tags": [
        "Smartphone Battery Life",
        "Smartphone Batteries",
        "Battery Life",
        "Batteries"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Oldman",
                "href": "/profile/John-Oldman-5"
            },
            "answer_text": "The answer is simple. When you use your phone (like turned on Internet with apps running) will fuck your battery. Do not believe those minds who would argue by saying its okay to use the phone while it’s charging. Believe me, they would have serious change of opinion after a few weeks or even months. “Let’s say you are charging the phone (nowadays corp giants manufactures phones with non removable batteries) and you are turning on Internet Data and watching a video on a browser or app like Youtube.” ^ that, is affecting your in built battery draining and charging at the same time. Did you know the major consumption of power from the battery is by the screen and inbuilt spy sensors including spywares running behind the system process. Also, a major consumption can be witnessed from installing some power hogging apps. The only way to save the phone and the battery is to take the PREVENTIVE approach. Not even god will save your phone if it falls in water even with sealed case. Mind you, the service centers would love to have your phone and charge you a hefty sum and that’s why they still exist and getting the business. No corporate ‘greedy’ company will manufacture a fault proof phone. If they have to survive in the business and make more money users have to buy their phones frequently and that’s what they’ve done and been successful so far. Finally, you wanna see your entire life monitored and recorded via phone and sometimes sold to other people? Stop right there, put on your glasses and go through the rules and guidelines with privacy policy in your phone. A good practice would be to close all running apps on top in your phone and put into charging. Cheers! ",
            "date": "Answered April 26, 2019",
            "views": "817",
            "upvotes": " View 58 Upvoters",
            "upvoters": [
                {
                    "user_id": "E. V. G",
                    "user_href": "/profile/E-V-G"
                },
                {
                    "user_id": "Sai Prateek Devarinti",
                    "user_href": "/profile/Sai-Prateek-Devarinti"
                },
                {
                    "user_id": "Rajesh Aj",
                    "user_href": "/profile/Rajesh-Aj-2"
                },
                {
                    "user_id": "Nicky Pergolini",
                    "user_href": "/profile/Nicky-Pergolini"
                },
                {
                    "user_id": "Harshit Nagpal",
                    "user_href": "/profile/Harshit-Nagpal-4"
                },
                {
                    "user_id": "Toney Mathew",
                    "user_href": "/profile/Toney-Mathew-2"
                },
                {
                    "user_id": "Harsh Rai",
                    "user_href": "/profile/Harsh-Rai-77"
                },
                {
                    "user_id": "Sagar Kurkutiya",
                    "user_href": "/profile/Sagar-Kurkutiya"
                },
                {
                    "user_id": "Aakash Kumar",
                    "user_href": "/profile/Aakash-Kumar-552"
                },
                {
                    "user_id": "Shweta Kushwaha",
                    "user_href": "/profile/Shweta-Kushwaha-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prajay Basu",
                "href": "/profile/Prajay-Basu"
            },
            "answer_text": "You can use your phone normally while its charging, just make sure: You are using a genuine charger (or one that is from a reputable brand).The phone doesn’t feel too hot to touch.You are not near any liquids.Now, these are the hoaxes that cause this question to be asked frequently: Taking a call while charging can electrocute youUsing your phone while charging can cause it to explodeUsing your phone while charging damages the batteryAll of these can be easily debunked, and while some are partially true, these rare occurrences are mostly due to faulty chargers (most electrocutions), faulty phone designs (Note7) and liquid damage. Let’s start with how the power supply in the phone works while charging: 110–240V (AC) gets converted to anywhere from 5–20V (DC) by the charger5–20V is converted to 3.7–4.35V for the battery charging circuit3V-4.35V from the battery charging circuit is converted to 0.5V-1.8V for the chipset (newer chipsets run at lower voltages usually)Out of all of these voltages, only the mains voltage has enough energy to electrocute a person. Most chargers, however, are isolated from the mains power on the USB side and will not electrocute you, even if you have wet hands. Only poorly designed chargers will leak mains voltage. And this mains voltage is often the reason for the explosions too. The Note7 battery design had multiple faults, and it would still explode if the user was not using the phone while charging. This proves that the cause of the electrocutions and the explosions is due to a faulty charger (and sometimes faulty batteries) and not the phone itself. If you feel any tingling sensation during charging, or if the touch screen registers false touches, then your charger is most likely not isolated well enough, and you should immediately dispose of the charger and buy a new one. The last myth is that the battery is destroyed if you use it while charging, and usually the myth is never backed by a scientific fact, because there isn’t any. When you use your phone while charging, the phone charges the battery at a slower rate than normal, to allow enough power for the processor/screen. If anything, it increases the battery life by a very small amount because it is charging slowly and generating less heat inside the battery (that causes it to degrade). It is true that using the phone while charging generates more heat, because of the added heat due to the conversion of 5–20V from the charger to 3.7–4.2V, on top of the heat generated from charging the battery and conversion of 3.7V-4.2V to 0.5–3.3V required by the processors, but the phones have multiple safeguards to prevent dangerous situations: Charger shuts down if it overheats or if moisture is detected inside the USB port.Phone processor (CPU + GPU) switches to lower speeds as temperature increasesPhone reduces radio power (e.g., switch to 3G/slower WiFi)Charging rate is lowered as temperature increasesCharging software shuts off charging as a temperature limit is reachedThe OS shuts off the phone once a temperature is reachedThe battery physically disconnects from the circuit when a temperature is reachedSo you should not worry about high temperatures. However, it is well known that batteries function best at room temperature, so it would be ideal to not game on your phone while charging. ",
            "date": "Updated February 9, 2019",
            "views": "1181",
            "upvotes": " View 193 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeter Laurente",
                    "user_href": "/profile/Jeter-Laurente"
                },
                {
                    "user_id": "Demon Bass",
                    "user_href": "/profile/Demon-Bass"
                },
                {
                    "user_id": "Sai Prateek Devarinti",
                    "user_href": "/profile/Sai-Prateek-Devarinti"
                },
                {
                    "user_id": "Anders Rosted",
                    "user_href": "/profile/Anders-Rosted-1"
                },
                {
                    "user_id": "Omar Salah",
                    "user_href": "/profile/Omar-Salah-107"
                },
                {
                    "user_id": "Seiri Roscent",
                    "user_href": "/profile/Seiri-Roscent"
                },
                {
                    "user_id": "Aayoush Kumar",
                    "user_href": "/profile/Aayoush-Kumar-1"
                },
                {
                    "user_id": "Savio Paramunda",
                    "user_href": "/profile/Savio-Paramunda"
                },
                {
                    "user_id": "David Deitsch",
                    "user_href": "/profile/David-Deitsch"
                },
                {
                    "user_id": "Jonathan Gomez",
                    "user_href": "/profile/Jonathan-Gomez-243"
                }
            ]
        }
    ]
}