{
    "title": "Is it even worth it to buy older versions of the iPhone? - Quora",
    "tags": [
        "Value",
        "Smartphone Shopping",
        "Apple (company)",
        "iPhones (product)",
        "Apple Products and Services",
        "Shopping"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Wilkinson",
                "href": "/profile/Steve-Wilkinson-15"
            },
            "answer_text": "It depends on what you are looking for. I think you're safe with the 5s for the next couple years (the typical length of a cell contract... although, you'er better off buying it outright and picking the best prices from the telcos!). The big limiting factor for the iPhone is the amount of RAM it has. If you go too old, you'll end up with a model that has 512K RAM (like, say a 4s, iPad mini, or iPad 2). It won't run the current version of iOS well at all. That said, the next version of iOS (iOS 9) is supposed to make this better, but I'm not counting on that. I think the days for the 512K iOS devices are pretty numbered (if they aren't already obsolete). But, I'm pretty sure iOS devices produced beyond this point are going to come with 2GB RAM. My guess is that once this happens (possibly starting this fall... the iPad Air 2 already has 2GB, and features that need it are already being implemented), we'll even see the 1GB RAM iOS devices start to feel slow or out of date (feature-wise)... which would be most of Apple's current iOS product lineup. So, if you don't mind bigger devices (iPhone 6 being the smallest), then I'd wait for the 6s. If you need to have one right now, and prefer the smaller size, or don't need the bigger size (and a few other things from the 6), I'd actually get a 5s and save some money. The other problem with older devices (or even lower end devices like the 5c), is storage space. If you don't need to take a lot of photos/videos or use some other app with huge storage needs, I think you could barely get by with a 16GB, but I'd recommend no less than 32GB. 8GB is just asking for troubles. People with 16GB devices often have issues keeping them clear enough to have operational free-space, let alone space for OS upgrades. (Yes, even though iOS is pretty advanced about memory management, it still needs some 'temp' space to operate properly. If you fill it too full, it gets less stable and needs more 'reboots'). ",
            "date": "Answered August 2, 2015",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alison Joy Hasselquist",
                    "user_href": "/profile/Alison-Joy-Hasselquist"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Kubiak",
                "href": "/profile/Robert-Kubiak"
            },
            "answer_text": "My rule of thumb is you can get away with one number older than the current.  So the 6 is out, 6S will be next (of whatever the next 6 is called). You are OK with 5 and 5S. I have an 5S and it is just fine. I'd aim for a 5S, if you can.The reason you want a newish iPhone is that you want to be able to update the OS when it comes out. New Operating System (OS) updates use more resources from the processor/memory to run, but give you extra features.  If your phone is too old, you won't be able to run the latest OS or you will be able to update, but it will slow down the phone tremendously. You could always just stop updating the OS, but as time passes, apps start using features from the new OS and stop working on your old OS. Also, new apps you might want will require the newer OS. My son went through this with an iPod touch. In the end, he just got a newer version, because he couldn't get any of the games his friends were playing.  You really want apps to work on your iPhone. Any phone can make calls and text, but iPhones and Android smartphones have the advantage of a large app library. Also, I'd stay away from the 5C. It is really just the 4S guts in a new package/name. It was meant to be a cheaper model to compete with cheaper  smartphones, but it will not last as long as a 5/5S because of its more limited processor/memory.That said, I haven't used a 5C, maybe someone else has a first-hand opinion on it. How is it holding up? ",
            "date": "Answered August 1, 2015",
            "views": "71",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Grayson Cash",
                    "user_href": "/profile/Grayson-Cash-2"
                },
                {
                    "user_id": "Felipe Guerrero",
                    "user_href": "/profile/Felipe-Guerrero-1"
                },
                {
                    "user_id": "Erick Gaxiola",
                    "user_href": "/profile/Erick-Gaxiola"
                },
                {
                    "user_id": "Jonathan Boeykens",
                    "user_href": "/profile/Jonathan-Boeykens"
                },
                {
                    "user_id": "Shawn Feigum",
                    "user_href": "/profile/Shawn-Feigum"
                }
            ]
        }
    ]
}