{
    "title": "Is increasing life expectancy increase population growth rate? - Quora",
    "tags": [
        "Growth Rates (economics)",
        "Life Expectancy",
        "Longevity",
        "Populations"
    ],
    "response": [
        {
            "author_info": {
                "name": "David H. Relkin",
                "href": "/profile/David-H-Relkin-2"
            },
            "answer_text": "Absolutely. The essence of population growth is its exponential nature. You are quite correct in realizing what most do not: that the increase in population is largely due to our ability to save man from virtually every type of illness by medication, surgery, and transplantations. Parenthetically, the general overall material conveniences that we now possess, indoor plumbing, understanding of viruses and bacterial infections, vaccinations and the processes of acquiring immunity—including, as an example, the eradication of polio which most people under the age of 70 have never heard of. I anticipate an argument against my position: one could argue that the elderly do not contribute to the enormous increase in population growth because they cannot have children. This argument is a complete misunderstanding of population growth and wholly irrelevant to the issue and its significance. The increase of “life expectancy” is based not only on the ability of man to extend his life, but, more importantly, on the ability to reduce the death rate of children. Expectancy is a averaging of the two. The ability of modern medicine, to use the general term, to secure the health of infants even at the sixth month of pregnancy has grown enormously. The blanket opposition of a certain socio-economic group—largely middle-class white women—to abortion at any point during pregnancy is both nonsensical and political—not moral. Though they claim that their position is based upon some vague idea of a “sanctity of life,” this is a total fabrication. Firstly, the so-called “abortion clinics” do not, by and large, perform abortions, but rather ensure that children are born healthy. The claim that these protests are in the name of Christian morality is obscene. The Church never asserted that even a still-born full term child was a “person” or was somehow or other “sanctified.” whatever they believe that means. “Sanctity” was always used by the Church to recognize the spirituality of a place—generally of a church—never a person. Even a tortured explication of “sanctity” has nothing to do with an unborn child since all human life is essentially evil and born in sin. One can never enter the Kingdom of Heaven unless they reach an age at which they can “accept Jesus as their savior or redeemer.” Christianity has always maintained that unless a child was born alive, he could not be baptized and could never enter paradise. (Notably, Dante places the still-born infant in purgatory, not in Heaven, or Paradise.) In addition, the Church has since its beginnings always taken the position that even a full term yet still-born fetus could not even be named. This is the reason that this type of feigned righteous indignation never existed until the resurgence of the disenfranchised middle class led by hate mongers who identified themselves with the purveyors of untruth. (A person may be able to live with injustice, but he will never be able to accept falsity. This is obviously a discussion for another time.) Rather, these self-styled members of the Army of Jesus make the most arrogant of claims: that those who have performed abortions are evil. The principles of Christianity and its leaders would surely find this self-righteous invective vile. These groups are notoriously violent, hateful and even murderous. The doctors and nurses who work in these pre-natal clinics—notwithstanding the reductive and politically charged name these arch-enemies of faith give to these medical offices—have been the object of violence and even murder by these “Armies of Jesus” who profess the sanctity of life, except for those who do not have sanctity. Their conduct discloses their true morality: they picket these offices with the most vile and disgusting insults whose object is the fundamental degradation of women—not the recognition of their spirituality. The ability of medicine to “save” a fetus at the moment of fertilization can only take place outside a mother, in vitro, so it may be preserved for its later growth or to be “carried” by a mother or a surrogate—which practice this group also paradoxically opposes. To return to the original question, contrary to expectation, the largest population increases occur in poverty. Generally, they have no recourse to birth control, and though they do not live as long as Western Societies have come to expect, they have more children. Thus, China, which for the last 50 years has been more than 95% indigent, rose to over 1.7 Billion persons by 2000, and was correctly recognized by its political system as a threat to prosperity and development. (The resulting human depravity caused by parents leaving their daughters to die of the elements was a result of a social inequality which arose from economics but cannot be laid at the feet of social programmers.) ",
            "date": "Answered May 24, 2020",
            "views": "245",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Boettcher",
                "href": "/profile/James-Boettcher"
            },
            "answer_text": "Increase in life expectancy is not only driven by more people living longer. It is also driven by fewer children dying.Decreases in infant mortality, and deaths of young adults from disease, war, accident, etc. means that more people live long enough to get old.So decreases in mortality in general will show as an increase in average life expectancy.Having more young people reproducing drives up population faster than post reproductive people living longer. If post reproductive people continue to work, they have resources to  aid their children and grandchildren. So those children can have more children. Combined, the two can drive population growth.With higher education levels, access to birth control, a secure social safety net, a longer productive work life, and less childhood and young adult mortality, parents are inclined to have fewer children, so birth rates will decrease. Parents and grandparents then have more resources to invest in the children and grandchildren they do have. ",
            "date": "Answered June 14, 2016",
            "views": "22",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "DIYA PATEL",
                    "user_href": "/profile/DIYA-PATEL-285"
                },
                {
                    "user_id": "Gouna Loud",
                    "user_href": "/profile/Gouna-Loud"
                }
            ]
        }
    ]
}