{
    "title": "Is it better to transfer from a community college or from a 4-year university to a better school? - Quora",
    "tags": [
        "College Transfers",
        "Community College",
        "The College and University Experience",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Heckman",
                "href": "/profile/Steve-Heckman-1"
            },
            "answer_text": "Let’s make the assumption that you are accepted to the “better school” no matter which option you pick. In addition, for the sake of the discussion, let’s also assume you compete two full years, so you are transferring as a junior.If you transfer from the four-year university, the end result is your get to transfer. You just have a more “prestigious” college on your diploma. If you went to a community college… You most likely saved a significant amount on tuition.You lived at home, so room & board was also cheaper.If you have completed two years at a community college, you would also now have an associates degree. If you have to drop out of college for any reason, you at least have this to fall back on. Way better than “some college” on a resume (in the past, I had several jobs where a two-year technical degree was required)Note that an AS degree is generally designed for transfer, while an AAS is designed for direct employment after graduation.At the end of the day, there are advantages to using a community college first. The primary advantage of going to a four-year university is you get the “full college experience” for all four years (but as many find out, if you are really not college-ready, it can end badly). ",
            "date": "Answered May 18, 2020",
            "views": "297",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arnold Cervantes",
                "href": "/profile/Arnold-Cervantes"
            },
            "answer_text": "Personally, I’m biased towards identifying a school and staying put until the four-year degree is completed. Objectively and practically, it IS better to attend a communty college and then transfer. The amount of money saved at a community college is ridiculous. However, the risk always exists that the community college credits won’t be completely accepted by the new college. Instead of just two more years, it may be three or two and a half because of this reason. You may need to take a class over again because the new college may like their class versus the same exact one from the communit college. I had the experience of two of my classes being reduced one unit each so I needed to take two labs to make up for the loss. Bottomline, if money is no object, in terms of experience, it is better to start off at the place where you will ultimately graduate. ",
            "date": "Answered May 17, 2020",
            "views": "39",
            "upvotes": "0"
        }
    ]
}