{
    "title": "Is it possible for robots to override commands just like they did in Terminator and I, Robot and hurt someone? - Quora",
    "tags": [
        "The Terminator (1984 movie)",
        "Terminator (creative franchise)",
        "Robots",
        "Robotics",
        "Science Fiction (genre)",
        "Artificial Intelligence",
        "Hypothetical Scenarios",
        "Movies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terence McQuillan",
                "href": "/profile/Terence-McQuillan"
            },
            "answer_text": "Is it possible for robots to override commands just like they did in Terminator and I, Robot and hurt someone? As a general answer, no. However, if a robot was able to override its programming, at that point it would probably be considered (at least in my opinion) to be fully sentient. Now for a specific answer regarding the Terminator franchise. In only one movie (T2) did a Terminator override its programming. The TerminatorT-800 programmed to kill Sarah Connor. Only failed because the Resistance sent Kyle Reese back to protect her. Override? No.Terminator 2T-800 sent to protect John Connor, programmed to follow his commands. In the end, allows itself to be destroyed, despite John ordering him not to. Override? Yes. However, one command was to protect John, and termination of self to change the future could be seen as following that command.T-1000 programmed to kill John Connor. Override? No.Terminator 3T-850 sent to protect John Connor. Programmed to obey Kate Brewster. Override? No.T-X programmed to kill John Connor and his future lieutenants, partial success. Override? No.Terminator 4Unique case, as Marcus was a human with cybernetic implants, so had a lot more free will to begin with. Not counting it either way.Terminator 5“Pops” was sent to protect Sarah Connor (and encourage her to hook up with Kyle Reese). Beyond that, we never find out what his operating parameters were, Override? Probably not.Terminator 6T-800 “Karl” was sent to kill John Connor, succeeded. Override? No. However, as a Terminator’s CPU is a learning computer, and it had no further instructions, it became self-aware enough to have regret for its actions and gave itself a new mission.I will not look at I, Robot as I only saw the movie once, and never read the books. ",
            "date": "Answered March 24, 2020",
            "views": "159",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhijeet Das",
                    "user_href": "/profile/Abhijeet-Das-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leigh Harvey",
                "href": "/profile/Leigh-Harvey-12"
            },
            "answer_text": "The short answer is no. A computer can only follow its programme. However ai projects are extremely complex computer programmes. In even simple programmes the computer does not always act like you would expect due to the differences in human and computer thinking. An extremely minor example is the “YouTube algorithm” in the early days of YouTube (this may still apply but I haven’t heard of it for a while) YouTube accounts would freeze for an hour or so when they reached 300,001 views. The reason for this was because at 300,000 views the account was changed to a more in depth algorithm to track how much money was earned. The programmer in charge told the computer to switch to the new algorithm once it had more Than 300,000 views. He expected, as would any reasonable person that at 300,000 it would switch. Instead he should have said => 300,000. This is an innocuous case of the programme not reacting how expected but the reality is with extremely complex programmes we can’t be sure exactly how they will react because we don’t think quite like computers. ",
            "date": "Answered March 25, 2020",
            "views": "139",
            "upvotes": "0"
        }
    ]
}