{
    "title": "Is it worth it to buy a OnePlus Nord 5G (aka OnePlus Z)? - Quora",
    "tags": [
        "OnePlus Smartphones",
        "OnePlus (company)",
        "5G (wireless communication)",
        "OnePlus One (product)",
        "Wireless Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sham Shad Amad",
                "href": "/profile/Sham-Shad-Amad"
            },
            "answer_text": "Yes, it is totally worth to buy one plus 8 nord 5g smartphone in such a cheap price launched by one plus. After a very successful release of One Plus 8 series in India, now the company has recently launched its all-new Oneplus Nord series. One plus Nord series is a new smartphone launched by One plus in android based with mid-range features is available in Europe, India, the Special Administrative Region of Hong Kong, and Malaysia. One plus Nord 5g launch date in India was 21st July 2020. Although OnePlus Nord 5G Online Price in India is based on different variant available on Amazon where you can buy this easily. You can check price on amazon This Nord series of one plus is one of its kind of phone by One Plus since after One Plus X, which was released in Aug 2015. It is also known as one plus 8 nord 5g smartphone or One Plus 8. Quick Oneplus Nord 5G Review in India GENERAL SPECSPERFORMANCECAMERABATTERYNETWORK CONNECTIVITYDISPLAYDESIGN👉👉Read moreOnePlus Nord 5G Online Price In India 2020, Best Review, Specs & Features ",
            "date": "Answered August 25, 2020",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashish Kulkarni",
                "href": "/profile/Ashish-Kulkarni-100"
            },
            "answer_text": "It depends on your priorities. The OnePlus Z is rumoured to cost INR 24,999 for the 6GB RAM + 128GB ROM variant. It will come with the 765 or 765G SoC and a triple- or quad-camera setup (most likely main 48MP, wide 16MP, depth 2MP, and maybe macro sensors). The OnePlus Z will probably come with OxygenOS based on Android 10 out of the box, making it one of the best software experiences at this price point. The OnePlus Z/Nord will have a 4300 mAh battery with 30W charging (probably WarpCharge 30T) There are phones like the Redmi K20 Pro which offer 8-series Snapdragon processors at this price point, however, so it makes more sense to buy that instead. But the OnePlus is the better choice if you value a smooth, ad-free user interface. The 7-series chipset will be good enough for games like PUBG or COD, but over time it may slow down more than an 8-series one. The benefit of the 7-series SoC is that you will get considerably better battery life. ",
            "date": "Answered June 17, 2020",
            "views": "29",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ramakrishna Kulkarni",
                    "user_href": "/profile/Ramakrishna-Kulkarni-3"
                },
                {
                    "user_id": "Pallavi Airani",
                    "user_href": "/profile/Pallavi-Airani-1"
                }
            ]
        }
    ]
}