{
    "title": "Is it ok to have sex in a school? - Quora",
    "tags": [
        "Relationships and Sex",
        "Sex Advice",
        "Schools",
        "Adult Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashutosh Singh",
                "href": "/profile/Ashutosh-Singh-3508"
            },
            "answer_text": "No, never even if you are a boy and if you are a girl then stop thinking about such activity. In today’s time, it is very common among school kids, all want to have sex from a very early age. Let me take the opportunity to tell you what sex means. See sex is not an object for the human being. If you want to enjoy your life than sex is a part of it. If you are a girl/boy you are going to exchange your body part with others. It’s a great feel don't spoil it. When we remove our clothes in front of anyone we allow him/her to connect with us mentally, soul and physically. In early age (today’s kids) are very fascinated with movies and they say that they are in love but really?? are you in love you are just thinking that you are in love because you have seen some movies (a love story). Just think the story acter or actress who was there do they were the kid in that move No. We make movies but we don’t teach our children that the things in that movie are frictional and all things must happen at the right time. Small girls of class 8–12 who want to have sex with their partner let me be very frank with you no matter what your BF says he will leave you someday and if he will not leave you then its good he will be there with you when you will get married so don't run to have sex today you have a long life to have sex. It will be the first time when you will allow someone to enter into your body so wait don't run there are more ups and down focus on your study only so sex when you are 100% sure in life that you have achieved all and now its time to full fill your desire and do it with a right person. and to the boys don't do sex just for curiosity simply stop watching porn get out from your home play in the ground stop spending hours on the phone it will eat up your brain. Do you really want to have sex with someone who has chances that if you will not earn well or don't get a job at the right time she will leave you. If I would have been in your place I would choose to be virgin until the right time. How can you remove your clothes in front of anyone it is your body have some self-respect for yourself. So, Stop thinking all this focus on your study you have a long life you will get many chances just wait for the right time. Rip: My English ",
            "date": "Answered August 12, 2019",
            "views": "16",
            "upvotes": "0"
        }
    ]
}