{
    "title": "Is it true that the original Tesla cars are currently having reliability issues? - Quora",
    "tags": [
        "Electric Cars",
        "Tesla (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Trausti Thor Johannsson",
                "href": "/profile/Trausti-Thor-Johannsson"
            },
            "answer_text": "The earliest 2013 Tesla Model S did have some issues. Door handles broke, they are most often fixed under warranty or free of charge. The earliest Tesla Model S did have some issues with mist forming on the rear lights, easy to fix and most often fixed under warranty. Both issues happened on mine February 2014 car. None of these issues have happened on my 2015 car. These are not big issues. Both are fixed while you wait and usually only annoying. Now ask people who own nicer V6 versions of Volkswagen, Range Rover, BMW about issues. Many have real serious issues. Often no one knows why and car gets to be stuck for weeks at the dealer. Most issues are serious. But we are so used to them, they are not news. No I am not saying everyoyhas issues, but many do. I know how annoying it was for my kids to enter on the same side for a week or two, but at least I had my car. Volkswagen Touareg Problems and Complaints - 14 Issues ",
            "date": "Answered September 24, 2019",
            "views": "242",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Frank Zucco",
                    "user_href": "/profile/Frank-Zucco"
                },
                {
                    "user_id": "Daniel Dudgeon",
                    "user_href": "/profile/Daniel-Dudgeon"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Seth Chazanoff",
                    "user_href": "/profile/Seth-Chazanoff-1"
                },
                {
                    "user_id": "Moray Taylor",
                    "user_href": "/profile/Moray-Taylor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Blair Korchinski",
                "href": "/profile/Blair-Korchinski"
            },
            "answer_text": "Not really. Most of Tesla’s reliability problems are small. Bad door handles, computer displays leaking fluid, and so on. An interesting brake problem is that, since the brakes don’t get used a lot, there is a minor corrosion problem where the brake pad is held in the caliper. So you need to take the pad out and put a dab of grease there every so often. The brakes still work, there are no parts required, it’s a minor issue, but it still gets reported as a reliability thing. Then there’s the Model X. I don’t know who thought those doors were a good idea, but anything that complicated is going to break. Every car with doors that open like that has door problems. Gull-wing Mercedes, Bricklin, whatever. Bad idea. They do look cool though. ",
            "date": "Answered December 4, 2019",
            "views": "90",
            "upvotes": "0"
        }
    ]
}