{
    "title": "Is it true that each year the earth is getting closer to the sun? - Quora",
    "tags": [
        "Earth-Sun Relationship",
        "The Solar System",
        "The Sun",
        "Earth (planet)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruno Gilissen",
                "href": "/profile/Bruno-Gilissen"
            },
            "answer_text": "Orbital mechanics are actually complex and chaotic. I don't mean with chaotic that there are no physical rules governing them - of course there are - but that they fall under chaos theory (Chaos theory - Wikipedia). Chaos theory is probably best known for its \"butterfly effect\" where a butterfly in Brazil may help cause a typhoon in the Philippines by the small input he gives into the displacement of air, to give one example. In a human lifetime we are of course never going to notice any change but over millions of years and longer, it becomes more and more unpredictable. In fact there's a name for the period over which we can do reasonable estimations: Lyapunov time (Lyapunov time - Wikipedia). For our orbit around the sun, the Lyapunov time is in the order of only \"a few tens of millions of years\". [1] That may seem like a long time since you and I are long gone by then, but considering the sun still has about 5 billion years of life left in it, it means we really can't say how or where earth is going to end up then. Are we going to be far away when the sun swells up? Are we going to be absorbed in the sun's radius when our star will become a red giant? Will we be swung out into the coldness of interstellar space? Or will we crash into one of the fellow planets that orbit the sun? We can't say. People who study climate change over earth's history know that this complicates things and have to take orbital changes into account. Let's highlight some of the complexities.  1. Earth's orbit is elliptical, not circular To start this, let's make it clear that there's not just one fixed distance between the earth and the sun at all. It increases and decreases over the course of a year because, simplified, earth has an elliptical orbit with the sun at one focus of the ellipse.  [The distance between earth and the sun varies depending on the time of the year. In northern hemisphere's winter when we're at perihelion - the closest point to our star in our orbit - we're at 147.10 million km from the sun; when we're checking out the bikinis on the beach in the northern hemisphere - at aphelion - we're 152.10 million km away from it.] Even though that may not be a very eccentric ellipse - almost a perfect circle even - it's still significant since right there you have about 5 million kilometers difference already. Whatever distance our orbit changes further from or closer to the sun in our lifetime will pale in comparison. Between January and July, we are gradually moving away from our shiny giver of life while for the rest of the year we're moving back closer with that distance. (Which, incidentally, is NOT the reason for the seasons! The tilt of the North-South axis to this elliptical movement is.)  2. The elliptical orbit precesses This elliptical trajectory is not fixed in location. This route that earth takes each year precesses: the points of closest and furthest passing move along. The main reason for that precession (Apsidal precession - Wikipedia) is general relativity, but it also happens slightly due to small tugs of the gravity of other celestial bodies. These tiny tugs have an effect over time.  [The elliptical orbit of our planet around the sun has a precession. Other planets have their own elliptical orbits and precessions, bringing every one of them closer and further away to each other at different times, further complicating the interactions between all the members of the solar system's family. If you want precision then it's more complex than your own family's interactions, even with Uncle Leo's affair and your cousin Anna taking over the business.]  3. The elliptical orbits of other planets are not perfectly ecliptic All the elliptical orbits of all the planets in our solar system almost lay in one perfectly flat plane... almost.  [All the planets and most other bodies in our solar system orbit the sun in a nearly flat plane... but not quite. The ecliptic plane is defined by earth's orbit, or in this 2D image the line between the center of the sun and the center of the earth. In strict sense only earth orbits the sun in the ecliptic plane then, the rest of the planets have a slight inclination on that. Mercury tops it, with more than 7 degrees. Pluto orbits with more than 17 degrees inclination to the ecliptic, but lost its status as a planet and was degraded to dwarf planet. Poor Pluto.] What that means for our orbit around the sun is that there will be tiny perturbations above and below the ecliptic too; pulls to below or above it, if you will. This makes the whole problem 3D and not just a move away or towards the sun in one flat plane.  4. Tidal effects widen orbits The moon and the sun (and in a very tiny degree also other planets [2]) work together to create tides on our planet and every now and then make sure innocent tourists get caught out by high waterlines somewhere so they can't make it back to the restaurant or their hotel before sitting it out for a few hours, anxiously hoping that the rise in water level stops before the tiny island they ended up on is completely submerged. Earth gets a stretch and a squeeze because of these tidal effects and that's of course most noticeable on the liquids which are free to flow over the surface: the oceans and the seas. This causes bulges on our planet. It may seem strange that these bulges are not aligned with the gravitational pull from the moon and sun, but are a bit ahead of those axes. The reason is friction and time: as earth rotates faster than the direction of the gravitational pulls, it tends to drag these bulges along with the faster rotation and there's a lag in time for the adjustment to take place. These frictional forces make earth's spin slow down, gently making our days last longer, while the bulges give a gentle gravitational pull on the moon, pulling it forward in its orbit. That in turn makes the moon want to increase its distance from the earth gradually. Said in a fancier term, the angular momentum is preserved.  [The bulges caused by gravitational pull from the moon - and not drawn here, but also from the sun - cause the moon to be pulled a bit forward in its orbit. This causes the moon to move away from earth by almost 4 cm a year. Similarly, earth causes a tiny bulge on the sun, which pulls earth forward in its orbit, widening the orbit ever so slightly.] Angular momentum is also preserved in the sun-earth case of course. The effect is that earth's years are stretched longer and longer and our orbit around the sun is widened, year by year, by a very tiny amount. As a consequence, planets have the tendency to end up in a spin-orbit resonance. In the case of Mercury for example, a tiny planet close to the sun that has felt this effect without mercy for these reasons, there's a 3/2 resonance. That means that one Mercury day lasts two Mercury years. Yes, Mercurians - if they existed - would celebrate two birthdays per day; bring out the cake and give me those kisses, ladies. [3] Another example of these tidal effects is that the moon always faces the same side to us on earth (give or take a few percent). I probably don't have to add that gravitational bulges on the sun of other planets complicate this again.  5. The eccentricity of the orbits change in time As if that's not complicated enough, the elliptical orbits change in eccentricity over time. This means that they can become a bit more circular at some times and a bit more elliptical at other times.  [The eccentricity - an amount that signifies how elliptical or how circular planetary orbits are - varies over time. When earth's orbit is more eccentric, the difference between perihelion and aphelion will be more than 5 million km, otherwise it will be less.] At the moment, the earth's eccentricity is reducing, so our orbit is becoming a bit more circular. That means there will be a slow reduction in the 5 million km distance difference between January and July.  6. The sun is losing mass, but also gaining a tiny bit People often say the sun is \"burning\". This so called burning is nothing like the burning of a match or your furnace. The sun is powered by nuclear fusion. Chemical elements smash into each other in the high densities and temperatures and fuse into bigger or heavier chemical elements. These fusions of elements also cause a stream of other exotic particles, like positrons and neutrinos and of course the gamma rays, which make our sun so positively radiant. Thanks to this ferocious fusion, we here on earth reap the benefits of the energy it provides us, enabling life in the first place. The sun loses a whole bunch of particles because of it though, and therefore the sun gets lighter and lighter gradually. This also puts a limit on the life of the sun, since it won't have enough particles to fuse in eternity. Losing a little change every day can bankrupt you in the long term, when the outwards pressure the fusion provides won’t be able to counter the inwards pull of gravity.  [The main process driving our star's fusion is the proton-proton chain. As a byproduct of the fusion of Hydrogen nuclei - which are basically just protons - neutrinos and positrons are created, together with a whole release of energy in the forms of gamma rays. The positrons create more gamma rays when they encounter an electron and annihilate. Neutrinos are extremely unlikely to interact with anything and they just escape, draining mass away from the sun without impediment. The end product of this manner of fusion is Helium, which can also escape the sun, further making our star lose weight; as if she's on a program to fit into a new dress she saw in the boutique.] Fusion is the main reason for mass loss of the sun, with both mass loss due to actual particles lost but also due to the conversion of mass into energy, according to Einstein's famous equation [math]E= mc^2[/math]. But there's another reason the sun loses mass: high energy particles in the sun's atmosphere can get ejected and flow away. This creates a so called solar wind, where earth for one is bathing in.  [Different mechanism can cause particles in the outer layers of the sun to get ejected and become the source of the solar wind. The associated mass is also lost to the sun and part of it flows over the planets, causing beautiful auroras when they interact with the magnetic fields there and giving a reason for people to travel to Alaska or Canada in winter.] Apart from that, dust and meteors, comets and other things floating around in space can of course be pulled in by the sun's gravity and cause mass gain.We on earth are not the only ones who can get hit by meteors, after all. The sun is much more likely to get hit by one. Considering that the loss of mass due to fusion alone is in the order of 4 million tons per second (yes, second!), it's safe to say that the gain of mass is insignificant in comparison. Most of the material floating around has been scooped up in the formation of the solar system already. The solar wind seems to blow off about 1.5 million tons of particles per second. That's a huge loss of mass. Yet considering the overall weight of the sun, it's not a very big deal. But to be fair, considering that if the sun loses mass and angular momentum has to be preserved (or the gravity gets a bit less if you'd like) the orbit of earth should widen a bit because of it. Over a year that seems to be in the order of centimeters. Peanuts.  7. Our planet is also losing and gaining mass Our closest star is of course not the only celestial body subject to a diet and/or weight gain. Earth has its own dietary program. For our piece of rock about 40,000 tons of weight is gained in the form of dust plus other particles, including particles from the solar wind. Cosmic rays can get absorbed too, contributing to a bit of mass gain. Global warming increases the weight by about 160 tons a year (thermal energy has mass). [4]  [Meteor showers are one of the reasons the earth picks up about 40,000 tons of dirt a year. Worse than a kid playing outside in the sand.] But earth loses more than it gains. Nuclear fission in the earth's core causes a loss of around 16 tons a year, when heavy atoms like Uranium disintegrate. Radioactive decay of other elements, including the decay caused by human activity in nuclear power generation, is responsible for a bit more. You'd probably think of the obvious loss of weight in sending space probes to do wonderful discoveries around other planets, yet that is really a very very tiny amount of mass. The biggest debit lies in the loss of light gasses, where the tiny particles can get enough kinetic energy to escape our planet's gravitational influence. In that way, we lose Hydrogen in the order of around 95,000 tons a year and Helium in around 1,600 tons. The helium loss is alarming to scientists who need it for their research and whose hearts break when they see it used for recreation, like with birthday party’s balloons.  [Light gasses like Hydrogen (H or H2) or Helium (He) can more easily obtain the required energy to escape a planet's atmosphere and gravitational influence. This causes a leaking of mass into space for that planet. You could probably invent a pseudo-science diet based on this principle, coming to think of it.] Overall, I've found a net loss of some 50,000 tons a year. Again, this weakens the gravitational influence, widening our orbit ever so slightly.  8. Other planets affect our orbit As already suggested in the other points, earth's orbit is not immune to the other planets. Other planets cause tidal bulges on the sun, redistributing mass, and these in turn influence earth's orbit. These planets of course also have a direct gravitational effect on us and they are influenced themselves in turn by other planets, including earth. It's all one big package of complex interactions, whereby each little change has a tiny effect on the rest, in turn having its own effect. This complex interaction is known as the n-body problem (n-body problem - Wikipedia). Good luck solving that.  [A simulation of a 10-body problem: our solar system's 8 planets and the dwarf planet Pluto are included, as is the sun. Due to the difficulties in scale the square root of the distances to the sun are displayed, otherwise the inner planets would end up shown inside the sun here. Earth's trajectory is dark blue here. Brrr, not so easy.Source: http://www.lactamme.polytechnique.fr/Mosaic/images/NCOR.s10.7500.D/display.html]  9. The sun wobbles, as does earth It's also worth noting that the sun doesn't just rotate around it's own center of gravity. Rather, our star dances around a barycenter (Barycenter - Wikipedia). That causes the sun to wobble in the solar system, again changing the distance between earth and sun. Same goes of course for the earth and moon, where it's not as if the earth has a certain distance to the sun and the moon orbits that. No, the moon makes the earth wobble on its trajectory as well, swinging us to the inside and to the outside of the average path and moving us away further and then again closer to the sun.  [The moon and the earth rotate around a common barycenter, a point where the masses of the two bodies balance. Therefore the moon swings the earth around, making it dance to the inside and outside of the average path.]  10. The sun expands When you ask for a distance to the sun, are you referring to the distance between the centers of gravity, or possibly between the geometric centers? Are you referring to the distance of the surfaces? If so, where do you define the surface; will a part of the atmosphere do or do you need something solid enough, what density do you consider the surface? The distance to the surface of the sun will vary over time because the sun swells up. That's because our star is dependent on a delicate balance (Hydrostatic equilibrium - Wikipedia) between wanting to contract due to gravity and wanting to expand due to the pressure and temperature of the fusions and contraction taking place inside.  [The hydrostatic equilibrium of the sun is an exercise in balance. On the one hand the huge gravity wants to contract the particles of the sun towards the center of gravity. On the other hand the energy of the fusions and contraction gives a kick that may enable particles to escape outwards and exerts a pressure from the inside.] Due to the loss of mass, but while fusion and contraction pick up pace, the gravity will lose out a little. That will weaken the pull on the outer layers, making them move outwards and swelling up our star while brightening it. Near the end of our star's lifetime other types of fusion take over and it will swell even more, becoming a red giant as the cooling of the surface then will change the color.  [Even before the endgame, when she will change into a red giant, the sun swells up slightly and gradually when gravity loses out little by little to the internal pressures and temperatures. Unlike people, the sun loses weight while she's getting bigger.]  11. Solar radiation and the solar wind exert a pressure on our planet. This flow of energy and particles from the sun also exert a pressure on earth, pushing it away as the momentum of the photons and particles does its job. Granted, it's small, but again, over the whole surface of earth facing the sun and over enough time, it adds up again. Related to that, and given that the earth rotates around its own axis, there's even a very interesting resulting force: the Yarkovsky effect (Yarkovsky effect - Wikipedia). That though should be such a small effect that it's usually only considered for small bodies orbiting the sun, like asteroids or meteoroids.  Conclusion There are probably plenty of other small effects, all causing possibly significant differences in outcome over a long enough span of time. Often answers to a question like this only consider one or two aspects. As the joke goes with engineers: scientists will disregard everything that is inconvenient. People who make calculations here take certain assumptions and disregard other effects as well. That can be a great estimation but it has its limitations, especially when time goes by. This doesn't mean that we can say absolutely nothing about it and should just give up and throw our hands in the air. It just means that you should add a timescale to whatever claim you make and specify what effects you take into account and disregard. To me it seems that the loss of mass of sun, together with the tidal effect, the loss of mass of the earth and the fact that the gravitational pull of other planets will be greater when they're closer to us in their orbits behind us from the sun (and not on the other side of the sun than we are), that the orbit of earth will widen and that we will not - in the reasonably short term - be moving closer to the sun. When I've searched the net a bit to find a value, I've seen estimates of that increase in the range of 1 cm to 15 cm a year. All take into account certain effects, disregarding others, as I stated. It seems that overall though, we're talking about an increase and not a decrease in distance to the sun. It also seems that we're not talking about significant amounts but centimeters per year. Clearly you need some computing power and a good software code for better estimates. As an aside, an astronomical unit, once defined as the average distance between the earth and the sun, is now defined as exactly 149,597,870,700 metres, so we can't base our answer on this concept (Astronomical unit - Wikipedia). Did even astronomers recognize that this stuff is too hard to base a definition on?  Footnotes: [1]From http://www.aanda.org/articles/aa/full_html/2011/08/aa16836-11/aa16836-11.html: Although it is now possible to integrate the motion of the Solar System over time periods of more than 5 Gyr, which is comparable to its age or expected lifetime (http://...Laskar & Gastineau 2009), it is clear that the chaotic behavior of the solution will still limit its validity to a few tens of Myr. (La2010: a new orbital solution for the long-term motion of the Earth - J. Laskar, A. Fienga, M. Gastineau1 and H. Manche) or an older paper:Page on gla.ac.uk [2] Again, these tiny influences add up over long spans of time. Venus has the highest planetary tidal influence on earth at only about 0.011 percent of the sun's tidal effect. That's why it's safe to ignore it on short term calculations. [3] One day on Mercury lasts two years: start at noon on day 1, looking straight up to the sun. The next time you can do that is in step 15, two complete orbits later:  [4] I've launched my own Quora question for this, since I'm not sure how this is calculated: Is earth gaining mass due to global warming (only considering the global warming here)? ",
            "date": "Updated July 31, 2020",
            "views": "88",
            "upvotes": " View 102 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swami Ramany",
                    "user_href": "/profile/Swami-Ramany"
                },
                {
                    "user_id": "Mugwima Njuguna",
                    "user_href": "/profile/Mugwima-Njuguna"
                },
                {
                    "user_id": "Trupti Shende",
                    "user_href": "/profile/Trupti-Shende-4"
                },
                {
                    "user_id": "Kevin Hagerty",
                    "user_href": "/profile/Kevin-Hagerty-12"
                },
                {
                    "user_id": "Isaac Velasquez",
                    "user_href": "/profile/Isaac-Velasquez-9"
                },
                {
                    "user_id": "Coy Catrett",
                    "user_href": "/profile/Coy-Catrett"
                },
                {
                    "user_id": "Morgan M Rooney",
                    "user_href": "/profile/Morgan-M-Rooney"
                },
                {
                    "user_id": "Mike Nofi",
                    "user_href": "/profile/Mike-Nofi"
                },
                {
                    "user_id": "Jeffrey Mixson",
                    "user_href": "/profile/Jeffrey-Mixson-2"
                },
                {
                    "user_id": "Anderson Tavares",
                    "user_href": "/profile/Anderson-Tavares-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reginald Smith",
                "href": "/profile/Reginald-Smith-3"
            },
            "answer_text": "ALL THESE ANSWERS ARE ABSOLUTELY WRONG. ITS THE WORSE ANSWERS I HAVE EVER HEARD. the earth distance from the sun is relative to the observer. Out measures suggest the earth typical distance from the sun is 93,000,000 miles. This distance is from the observer viewpoint. This doesn't mean the distance IS LITERALLY 93 MILLION MILES FROM IN THE HUMAN SENSE OF MEASUREMENT. as for time, the universe is expanding. We don't know this rate this expansion. the expansion of the universe is much faster than any rate of expansion in our solar system. The stories that the universe expands while the solar system doesn't is false. The galaxies are moving further apart. HOWEVER, THE EARTH COULD HAVE A NEW SUN OR MULTIPLE ONES BEFORE THE SUN BECOMES A RED GIANT in 5 -7 billion years. THE MILKY WAY AND ANDROMEDA GALAXY IS EXPECTED TO COLLIDE IN 4 billion years. Its 2.5 million light years away from the milky way. BUT THE EFFECTS will be noticeable well before then. the entire star arrangement of the milky way could be restructured. the planets, orbits, mass, and range of factors in the solar system will change. By the time a sun is a red giant, the earth could be well out the way. BUT, GRAVITY AND MASS OF SOLAR SYSTEM WILL CHANGE over time. the destruction would likely be from this collision rather than the sun red giant phase. the earth movement from or towards sun over time is no set rate and unknown. as Andromeda and the milky way become closer to a collision, the gravitational effects become more profound. the sun could be displaced entirely from the solar system. Our nearest star Alpha Centauri is around 4.4 light years from the sun. The Andromeda galaxy is 2.5 million light years from the Milkyway. the possibilities the earth and other solar system planets could be captured by any number of other stars is very huge. the earth could have a new star, orbit around a larger planet, or be injected from the solar system in interstellar space. the sun-earth distance of 93 million miles over the next millions of billions of years is relative to observer. but not reflective of reality, expansion of space, size of milky way, and changes in gravity ",
            "date": "Answered November 14, 2018",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "PRajith R",
                    "user_href": "/profile/PRajith-R-3"
                }
            ]
        }
    ]
}