{
    "title": "Is it worth the upgrade from AirPods to the AirPods 2? - Quora",
    "tags": [
        "AirPods 2",
        "AirPods",
        "Apple (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suhail Dada",
                "href": "/profile/Suhail-Dada-3"
            },
            "answer_text": "At their core is the new ‘H1’ chip, which replaces the proprietary W1 chip in the original AirPods. H1 is all about efficiency: AirPods 2 pair faster, have 30% lower latency (great for gamers), switch devices twice as fast and boost talk time 50%. Apple also says H1 delivers a more stable connection, though it was already excellent with AirPods. Which brings us to H1’s headline feature: “custom audio architecture”. In practice, this means AirPods 2 are voice activated. Simply say “Hey, Siri” and it can make calls, switch songs, adjust the volume, provide directions, answer questions and much more. Previously activating Siri required a double-tap on an earphone. AirPods have always been about convenience, and AirPods 2 step this up.  AirPods 2 are voice activated Apple On the flip side, AirPods 2 have no sound quality improvements. AirPods have always delivered adequate audio without troubling the output of specialist brands like Bose and Sony and that continues. Sales show AirPods do enough for most buyers, but AirPods 2 won’t be winning over audiophiles. Battery Life – Necessary Bumps As mentioned above, AirPods 2 have 50% longer call times but – in reality – the upgrade from two to three hours was essential and merely brings them in-line with the competition. More impressive, is you’ll now get over 24 hours of battery life from the AirPods 2 case which should be enough to last a week or more between case charges. AirPods 2 also offer three hours of listening time or two hours of talk time from just 15 minutes of case charging. That’s impressive, but AirPods did the same. Instead what grabs attention is the new AirPods 2 Wireless Charging Case. Visually it looks almost identical to the wired case barring a tiny charging indicator at the front, but it will work with any Qi charger. The case is also compatible with AirPods, but at a significant cost which brings us to…  Apple AirPods Wireless Case Apple Price – Wireless Costs The good news is AirPods 2 have the same asking price as AirPods, but throw in wireless charging and things get a little more eye-watering: AirPods / AirPods 2 – $159 (£159)AirPods 2 with Wireless Charging Case – $199 (£199)Wireless Charging Case (sold separately) – $79 (£79)At $159, AirPods 2 are good value and those who value wireless charging should be happy to pay the $40 premium for the Wireless Charging model. That said, buying the wireless case separately is expensive. To put this in content: the excellent OnePlus Wireless Bulletscost $10 less than this case ($69) and deliver better sound quality. AirPods 2 line-up and the new Wireless Charging Case Apple Early Verdict AirPods 2 are a solid (if unspectacular) upgrade which bring welcome battery, efficiency and usability improvements to the original model. That said, I can understand why Apple didn’t call them AirPods 2 since they feel more like a v1.5. ‘AirPods 1S’, if you like. Those who waited for AirPods 2 won’t be disappointed, but there’s little point upgrading if you already own AirPods. Ironically, given their identical price, design and naming, I suspect many buyers won’t even notice the differences – welcome though they are. Personally, after more than two years, I’d have liked Apple to have been a little more ambitious. But AirPods 2 make the necessary changes to stay competitive and, as such, they remain the best defacto option for the vast majority of iPhone owners. ",
            "date": "Answered March 26, 2019",
            "views": "32",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eugene Vivino",
                    "user_href": "/profile/Eugene-Vivino"
                },
                {
                    "user_id": "Clint Deverson",
                    "user_href": "/profile/Clint-Deverson"
                },
                {
                    "user_id": "Bert Green",
                    "user_href": "/profile/Bert-Green-1"
                },
                {
                    "user_id": "Mohamed Zimnaan",
                    "user_href": "/profile/Mohamed-Zimnaan"
                },
                {
                    "user_id": "Casey Clarke",
                    "user_href": "/profile/Casey-Clarke-35"
                },
                {
                    "user_id": "Thomas Jadallah",
                    "user_href": "/profile/Thomas-Jadallah"
                },
                {
                    "user_id": "Jordan McArthur",
                    "user_href": "/profile/Jordan-McArthur-2"
                },
                {
                    "user_id": "Jaden Yenjai",
                    "user_href": "/profile/Jaden-Yenjai-1"
                },
                {
                    "user_id": "Joseph Moore",
                    "user_href": "/profile/Joseph-Moore-224"
                },
                {
                    "user_id": "Varun Veda",
                    "user_href": "/profile/Varun-Veda-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishi Rich",
                "href": "/profile/Rishi-Rich-3"
            },
            "answer_text": "Well let’s look at what has changed in the new AirPods: Now you can summon Siri by a voice command. No more need to double tap on the AirPods first. Advantage: it’s easier and more convenient - but not having it isn’t a deal breaker.The chipset has been upgraded from the Apple W1 to an H1 chip in the new AirPods. Advantage: as stated above - Siri voice command. Plus additionally you now have a faster connection with low latency of sound while gaming as well as faster switching of devices when using AirPods with multiple Apple products. Not that the earlier ones were any slouch at it.H1 shall also bring in enhancements to the audio quality as Apple has explained. Now how much better do the new ones sound is something that needs to be experienced to give an opinion on. So let’s wait and watch on this one.The talk time has increased significantly. The AirPods will last longer in terms of talktime battery life and this one is a boon for you if you answer tons of calls everyday. However the music playback times are still the same.So based on what you value more, now you can take a decision. I haven’t mentioned the wireless charging aspect, as that is something you can buy as an additional separate accessory for your existing AirPods. If wireless charging is your need then that can be done on your existing AirPods too by spending a fraction of what you may spend in buying new ones outright. ",
            "date": "Updated December 4, 2019",
            "views": "16",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Blache",
                    "user_href": "/profile/David-Blache"
                },
                {
                    "user_id": "Sebastian Lugo Nuñez",
                    "user_href": "/profile/Sebastian-Lugo-Nuñez"
                },
                {
                    "user_id": "Mrinal Agarwal",
                    "user_href": "/profile/Mrinal-Agarwal-12"
                },
                {
                    "user_id": "Steve Rajan",
                    "user_href": "/profile/Steve-Rajan-3"
                }
            ]
        }
    ]
}