{
    "title": "Is it possible to get a free PC? - Quora",
    "tags": [
        "Personal Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Promeathues Carlos",
                "href": "/profile/Promeathues-Carlos"
            },
            "answer_text": "Honestly if you live in some first world country odds are you would often find computers being discarded even if they are perfectly in good condition. You can go the dump depots were people usually drop their electronic stuff as other things they do not use. if you are a pack rat this would be your heaven. I sometimes pass by to check to see if someone threw something i need. But most of the time they are more of a hassle than free. You can cannibalise the computers thrown there and assemble your own, odds are you might need to buy a new hard disk and RAM but you might get luck which may mean you need to go there regularly which is then a hassle than its worth. Laptops which is new and can run many applications today cost around 200 euros. which is a good buy if you ask me. For under 400 euros you could build medium powered rig that could last for a long long time even up to 10 years. As long as you do not plan to play games and edit videos your cost will be low. For browsing, almost all of the current generation of processors which are even around 45 euros a pop will be fine. Then head to the depot to try to find a flat screen monitor and you are all set. Do not scrimp on the keyboard and mouse, as they are the dirtiest bit of computers so it would be better to get one new. You have no idea how much germs are on a used keyboard. honestly unless its a hand me down computer or just like in my case i have a computer shop and regular clients usually give back stuff to me so if i was a pack rack i would have 100s of computers…most the stuff i send back to Asia to donate to the public schools. Even after 6 years most are still working fine. ",
            "date": "Answered October 11, 2016",
            "views": "856",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thao Tran",
                    "user_href": "/profile/Thao-Tran-89"
                },
                {
                    "user_id": "Tom Calver",
                    "user_href": "/profile/Tom-Calver-1"
                },
                {
                    "user_id": "Vladislav Zorov",
                    "user_href": "/profile/Vladislav-Zorov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philippe Lhoste",
                "href": "/profile/Philippe-Lhoste"
            },
            "answer_text": "Yes, of course. I don’t know in your country, but in mine, in France, near Paris, I live in a relatively large building (some 140 apartments) and we have a room where people put stuff they no longer want, to be picked up by the city’s waste disposal. There, we regularly find abandoned PC. Sometime, the Ram has been removed, sometime the hard disk is no longer there, and sometime they are just functional, but a bit obsolete, of course. We also find 17″ 4:3 screens, great for use as secondary screens, loud speakers, etc. Another way is to work in a relatively big company that sometime renew their computers. In France, they have the right to give the old ones away to the employees. ",
            "date": "Answered October 11, 2016",
            "views": "793",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shane Neary",
                    "user_href": "/profile/Shane-Neary"
                },
                {
                    "user_id": "Garry Taylor",
                    "user_href": "/profile/Garry-Taylor-5"
                },
                {
                    "user_id": "Vladislav Zorov",
                    "user_href": "/profile/Vladislav-Zorov"
                },
                {
                    "user_id": "Yves Granger",
                    "user_href": "/profile/Yves-Granger"
                },
                {
                    "user_id": "Didier Szende",
                    "user_href": "/profile/Didier-Szende"
                }
            ]
        }
    ]
}