{
    "title": "Is it hard to get an American Express card? - Quora",
    "tags": [
        "American Express Centurion Card",
        "American Express (company)",
        "Credit Cards"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diego G. Smith-Domiano",
                "href": "/profile/Diego-G-Smith-Domiano"
            },
            "answer_text": "It depends on the card that you are applying for. If you have a good payment history and no recent late payments, you could get a Green or Gold charge card with a FICO of 660 or so. Amex credit cards are generally harder to get than their charge cards, as they require a higher FICO score, a perfect payment history and low utilization. ",
            "date": "Answered February 25, 2019",
            "views": "61",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Minami Ai",
                    "user_href": "/profile/Minami-Ai"
                },
                {
                    "user_id": "Fred Avocado",
                    "user_href": "/profile/Fred-Avocado"
                },
                {
                    "user_id": "Kamalesh Chauhan",
                    "user_href": "/profile/Kamalesh-Chauhan"
                },
                {
                    "user_id": "Vijay Londhe",
                    "user_href": "/profile/Vijay-Londhe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Yoong",
                "href": "/profile/Joseph-Yoong"
            },
            "answer_text": "No, at least not in Singapore. Many off us prefer either Visa or Master Card here, and we do not prefer Amex. The reasons that we did not prefer Amex here was that… few retails prefer Amex, as their sales charges levied by Amex on these retailers were rather high, as compared to Visa and Master Cards,the users of Amex cards (ie we), had to pay very high annual membership fees, which were too costly for us to maintain, since we have cheaper alternative cards in the marketplace. Why should we pay more when we can have cheaper ones, right?not many Bank offer Amex cards too! Not sure why, but almost all banks issue Visa or Master cards.I believe Amex should change their marketing strategies if they were to succeed in Asia. ",
            "date": "Answered February 23, 2020",
            "views": "27",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Apo",
                    "user_href": "/profile/Michael-Apo"
                },
                {
                    "user_id": "Mahesh Jethalia",
                    "user_href": "/profile/महेश-जेथलिया-Mahesh-Jethalia"
                }
            ]
        }
    ]
}