{
    "title": "Is it Good Idea to sell old phone at InstaCash? - Quora",
    "tags": [
        "Old Phones",
        "Online Selling",
        "Buying and Selling",
        "Mobile Phones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sakshi Jain",
                "href": "/profile/Sakshi-Jain-391"
            },
            "answer_text": "Yes, Yes, Yes, A big Yes. Firstly i would like to share what is instacash who don’t know about this. InstaCash is the platform for selling old phones in 60 seconds at the best price. And yes, you can sell your phone in a few minutes. I sold my 2 years one plus 3T here and got 12000 which is a good amount according to me. Things I love about instacash Home pick up facilityInstant paymentAnd I love their customer support team, they are the best.When you are new to something, you face problems, the same thing happened to me. I tried to sell my phone through app but i missed few steps in diagnose system which brought the price drop in my phone and i gave them 1 start at the play store. ( That was my mistake) People who don’t know about the diagnose system read this: They have implement a intelligent algorithm in their app which detects the condition of your phone by doing some test and you skip some test, the price drops. The same happened with me. Their customer care team called me, I was very angry that time but they explain the situation and helped me in the diagnose process and at last i got the decent amount of my phone. This makes me update the review to 5 star on google play store. They are doing a great job. Their main motive is to make people aware of that “Mobile e-waste is a harm for our environment and health also” so if we can put them for some good use then why not. Mostly we forgot about our old phone when we buy a new phone and later it gets converted in E-waste. India’s only 5 % e-waste gets recycled and 95% e-waste gets handled by the local scraper. This is really a big thing and we are ignoring this. I am not blaming you because i was doing the same thing previously but when i came to know that there are people who really cares about the e-waste then i took a initiative to be a part of this. I have read where people complain about the instacash that they are not offering good price, their app is not working good. I have a thought on this ‘Nothing is perfect”. Share your problem with them and they will surely bring a solution for you. Now it’s our duty to make more and more people aware of this that they should sell their old phone instead of keeping them at home. They launched a E-waste campaign in Jaipur on World environment day so people can drop their old phone and get something in return. They have collected hundred of phones there. Click here to know more: India’s First Mobile E-Waste Kiosk Launched by InstaCash Comment here if you want to discuss more. ",
            "date": "Answered June 13, 2018",
            "views": "118",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rakesh Mishra",
                    "user_href": "/profile/Rakesh-Mishra-1216"
                },
                {
                    "user_id": "Prateek Goel",
                    "user_href": "/profile/Prateek-Goel-7"
                },
                {
                    "user_id": "Abhishek Anand",
                    "user_href": "/profile/Abhishek-Anand-814"
                },
                {
                    "user_id": "Jianyuan Loh",
                    "user_href": "/profile/Jianyuan-Loh"
                },
                {
                    "user_id": "Puneeth Simha",
                    "user_href": "/profile/Puneeth-Simha-1"
                },
                {
                    "user_id": "Milan Shah",
                    "user_href": "/profile/Milan-Shah-42"
                },
                {
                    "user_id": "Priya Vyas",
                    "user_href": "/profile/Priya-Vyas-27"
                },
                {
                    "user_id": "Yuvaraj Gaali",
                    "user_href": "/profile/Yuvaraj-Gaali-1"
                },
                {
                    "user_id": "Krishnakumar G",
                    "user_href": "/profile/Krishnakumar-G-47"
                },
                {
                    "user_id": "Deepanshi",
                    "user_href": "/profile/Deepanshi-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shrey Goswami",
                "href": "/profile/Shrey-Goswami"
            },
            "answer_text": "Yes. Nothing could be better than InstaCash to Sell Old Mobile. The InstaCash is a very good platform to sell old mobile. The support team at instacash is very helpful and they guided me to the whole process to sell my phone easily in no-time. It is quite surprising that I got very good value of my old phone without worrrying for any negotiations and trust issues that we usually face in the mobile market. This platform could replace the traditional ways of selling old phone. I must suggest you to surely sell your old phone at InstaCash to get best price for the old phone without any worries. Few things which I liked about this platform are: Instant PaymentDoorstep Pickup which they offer as they have picked order from my office.No worries about Trust Issues on Selling Old Phone.",
            "date": "Answered November 19, 2018",
            "views": "59",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryan Chan JC",
                    "user_href": "/profile/Bryan-Chan-JC"
                },
                {
                    "user_id": "Yosuf Ahmed",
                    "user_href": "/profile/Yosuf-Ahmed-1"
                },
                {
                    "user_id": "Prateek Goel",
                    "user_href": "/profile/Prateek-Goel-7"
                },
                {
                    "user_id": "Jianyuan Loh",
                    "user_href": "/profile/Jianyuan-Loh"
                },
                {
                    "user_id": "Puneeth Simha",
                    "user_href": "/profile/Puneeth-Simha-1"
                }
            ]
        }
    ]
}