{
    "title": "Is it better to buy a separate SD card and OTG cable rather than buying an OTG pendrive for my phone? - Quora",
    "tags": [
        "USB On-The-Go (OTG)",
        "SD Cards"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siddharth",
                "href": "/profile/Siddharth-164"
            },
            "answer_text": "Specifically for SD card and OTG cable v/s OTG pen drive: a) SD card can be used with most phones. Unless your phone doesn't have a microSD card slot , you can use upto 400 GB microSDXC card inside any phone. However if your phone doesn't have a microSD card slot , you have following options: a) use a USB SD card reader with an OTG cable b) Use a pen drive with a USB OTG cable c) Use a USB OTG pen drive that plugs in directly into the charging port of your phone. The second category of pen drives come with microUSB or USB type C connector. You can either use them directly or with an adapter. Between these three choices the only difference is the cost and the speed. USB pen drives function at 480 Mbps or 60 MBps (USB 2.0) or 5 Gbps i.e. 625 MBps (USB 3.0). SD cards are a bit slower at 10 MBps for class 10 , UHS class I speeds and 30 MBps for UHS III speeds. But SD cards are easier to store in comparison to pen drives. It's your call. You have to decide whatever you want more - speed , or convenience. ",
            "date": "Answered July 12, 2018",
            "views": "21",
            "upvotes": " Answer requested by Sachin Dhadange",
            "upvoters": [
                {
                    "user_id": "Sahil Goyal",
                    "user_href": "/profile/Sahil-Goyal-316"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prem Jhamnani",
                "href": "/profile/Prem-Jhamnani-1"
            },
            "answer_text": "According to me, it is better to buy an OTG pendrive. OTG pendrive means it provides the storage with the OTG itself so you dont have to carry pen drive separately. It is attached with it. So it increases the utility as you have to carry only one object through which two purposes are served one for OTG and one for pendrive. Buying separately means you have to always carry otg cable as well as pendrive. Absenteeism of either otg or pen drive will prohibit you from doing your work. So purchase OTG Pendrive which is a hybrid of cable as well as pen drive. But if you have to regularly connect different pen drives on your phone, then buy only OTG cable because OTG Pendrive will not allow you to insert other pendrives. So you have to choose according to your use. ",
            "date": "Answered October 20, 2018",
            "views": "692",
            "upvotes": " View 1 Upvoter "
        }
    ]
}