{
    "title": "Is it okay to use a laptop while it is charging? Why or why not? - Quora",
    "tags": [
        "Laptop Batteries",
        "Laptop Recommendations",
        "Battery Life",
        "Batteries",
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shane Tennent",
                "href": "/profile/Shane-Tennent"
            },
            "answer_text": "Let's start with your battery.  The life of the LI-ON battery is measured with two metrics.  Charge Cycles, and Depth of Charge.  You really only have a limited number of charge cycles before the battery really stops holding a charge.  However... how many charge cycles you have, depends on how deep the charge is.  You have 800-2000 micro charge cycles or so (depends on the quality of the individual cells, how many cells, maH rating of the battery, etc), but you only have 300-600 deep charge cycles.  The thing is.... you'll burn through the micro charge cycles faster than you would the deep charge cycles. This is why LI-ON battery manufacturers recommend that when you use it on the battery, you DO not charge it until it is below 50%, and closer to 25%.   Now, you might be thinking that since it seems like the more you charge at one time, the longer the life of the battery... but it doesn't really work that way.  If you drained the battery completely every time, the number of charge cycles versus depth of charge doesn't work out in your favor.  Optimal charge point is 25% to 50% of total capacity.  Newer laptops are even being released with anti-micro charge circuits, where the laptop won't charge the battery unless it has been discharged a minimum amount, and once the battery is \"topped off\", it won't charge again until it is below that minimum. Now.  Is it OK to use the laptop while it is charging?  Absolutely.  It is expected.  Why?  Well, for one thing, most laptops now will underclock the processor, dim the screen, and otherwise cut power usage to give you longer battery time... when you are using it on the battery.  So, to get the full performance out of the laptop, either you have to go in and manually change ALL the settings related to power consumption, or you have to plug it into the power adapter to get the full performance.  Thus, your experience with games playing slower on battery makes perfect sense. Now.. if when you say \"Because playing game without charging is slower than charging.\" you actually mean that in BOTH examples (without charging and with charging) the laptop is plugged into the power adapter... then if you haven't been monkeying with your power settings, you might have a problem.  Something serious... as in Motherboard Issue.  It might also be a matter of using the wrong power adapter.  Like... if you purchased a replacement adapter that puts out 65 watts, and the original adapter was 90 watts. I assumed though, that \"without charging\" means on battery, and \"with charging\" means plugged into the power adapter. ",
            "date": "Answered June 23, 2015",
            "views": "1853",
            "upvotes": " View 186 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mosiur Rahman Masud",
                    "user_href": "/profile/Mosiur-Rahman-Masud-1"
                },
                {
                    "user_id": "Manindra Sahadev",
                    "user_href": "/profile/Manindra-Sahadev"
                },
                {
                    "user_id": "SH Shawon",
                    "user_href": "/profile/SH-Shawon"
                },
                {
                    "user_id": "Deep Barua",
                    "user_href": "/profile/Deep-Barua-10"
                },
                {
                    "user_id": "Gourav Dey",
                    "user_href": "/profile/Gourav-Dey-56"
                },
                {
                    "user_id": "Dhananjaya Kanishka",
                    "user_href": "/profile/Dhananjaya-Kanishka"
                },
                {
                    "user_id": "Aly Greg",
                    "user_href": "/profile/Aly-Greg-1"
                },
                {
                    "user_id": "Ranjith Kumar",
                    "user_href": "/profile/Ranjith-Kumar-1859"
                },
                {
                    "user_id": "Sagar Chowdhury",
                    "user_href": "/profile/Sagar-Chowdhury-8"
                },
                {
                    "user_id": "Karan Kotian",
                    "user_href": "/profile/Karan-Kotian-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karl Young",
                "href": "/profile/Karl-Young-10"
            },
            "answer_text": "I work mostly on energy storage for electric vehicles and stationary storage applications, and wanted to share some thoughts; because some of the recharging methods mentioned by the others here sound...... different. LCO has been the main Li-ion chemistry used for personal electronics; which has a nominal voltage of 3.7V.  It has the highest specific-energy (Wh/kg) among all of the other commercialized Li-ion chemistries, and least expensive. As it is true with all Li-ion chemistries, if LCO is treated with some TLC, then it can be a great battery companion for you.  Besides providing a comfortable environment (e.g. dry, 55-85F, low shock), the slower you charge or discharge from it, the longer it will be a good pal to you. Please remember, chemical batteries like Li-ion work on ion exchange to charge and discharge electrical energy.  That physical movement of Li-ions in and out of the cathode and anode structures is called intercalation (rough definition).  In time, there will be noticeable wear-n-tear in those structures, especially if the temperature got high or if you try to accelerate the charging/discharging with high current. One of the problems developed from fast-charging is the growth of dendrites from the cathode (later from the anode too).  These are long spiny lithium spikes that grow outwards from the electrode (reminds me of urchins).  In some cases, they reach through the separator and contact with the other electrode.  This shorts out the cell, and has caused fires and explosions. So, with a good BMS with good programming, things that could ruin your afternoon won't happen.  Having worked on BMSs too, high quality hardware will yield a high quality BMS; but only if it is programmed properly too. I've kept my Sony Vaio laptop plugged in more than 95% of the time for the past 4-years; and every week, the Sony battery checker would always tell me that my battery condition is Excellent.  I doubt that assessment is based on time-in-service.  Since this is an ultrabook design, the battery is not a big capacity one, but I still get more than 2-3 hrs of continued use on battery alone. Sony has it programmed to stop charging at 79-80% full.  In the EV world, we usually program the BMS to charge up to about 95% full, but slow down by the 85% mark.  We are more concerned with packing as much energy as possible to make sure the vehicle can have maximum range (like getting home).  The life of the cells do not suffer if you don't try to charge it like a maniac. However, there are special maniac charging methods that won't create problems, and might even extend cycle-life.  Ah, but that's another discussion for another time..... ",
            "date": "Answered February 29, 2016",
            "views": "1135",
            "upvotes": " View 45 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Priyanshu Gupta",
                    "user_href": "/profile/Priyanshu-Gupta-90"
                },
                {
                    "user_id": "Keo Vutheikun",
                    "user_href": "/profile/Keo-Vutheikun"
                },
                {
                    "user_id": "Sorin Greu",
                    "user_href": "/profile/Sorin-Greu"
                },
                {
                    "user_id": "Cj Lastra",
                    "user_href": "/profile/Cj-Lastra"
                },
                {
                    "user_id": "Jevie Jarongay",
                    "user_href": "/profile/Jevie-Jarongay"
                },
                {
                    "user_id": "Melissa Chung",
                    "user_href": "/profile/Melissa-Chung-7"
                },
                {
                    "user_id": "Bharath Yadav",
                    "user_href": "/profile/Bharath-Yadav-15"
                },
                {
                    "user_id": "Yohanes Adi Nugroho",
                    "user_href": "/profile/Yohanes-Adi-Nugroho"
                },
                {
                    "user_id": "Naufaldi Rafif Satriya",
                    "user_href": "/profile/Naufaldi-Rafif-Satriya"
                },
                {
                    "user_id": "Kawojue Raheem",
                    "user_href": "/profile/Kawojue-Raheem"
                }
            ]
        }
    ]
}