{
    "title": "Is it true that charging mobile in solar energy effects the battery? - Quora",
    "tags": [
        "Solar Panels",
        "Solar Energy",
        "Battery Life",
        "Sustainable Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hugh Leyton",
                "href": "/profile/Hugh-Leyton"
            },
            "answer_text": "Hi, . . . What are you talking about. . . Electricity is electricity, regardless of where it comes from. . . . The only difference is how fast you charge your mobile. . . Quite often the supplied charger, will fully charge in just a few hours. . . That can be useful but not good for the battery. . . I prefer to charge over the 8 hours of night time, nice and slowly and also charge when the battery id down to 40% and only charge up to about 80%. . . But if you use a solar source, then how can you control the voltage and charging rate. ? . . . . You can easily get those USB outlets that are designed to plug in the cigarette lighter in vehicles. . . . That might be a suitable regulator between a solar panel and your mobile phone. ",
            "date": "Answered August 4, 2019",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tanbir Ahmed",
                    "user_href": "/profile/Tanbir-Ahmed-85"
                },
                {
                    "user_id": "Tamphasana Thingbaijam",
                    "user_href": "/profile/Tamphasana-Thingbaijam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meredith Murphy",
                "href": "/profile/Meredith-Murphy-34"
            },
            "answer_text": "They also come in the form of straps, with solar cells on the outer surface and a rechargeable battery inside. ... Solar chargers used to charge a phone directly, rather than by using an internal battery, can damage a phone if the output is not well-controlled, for example by supplying excessive voltage in bright sunlight. Best answer: The best way to use solar power is to pick up a portable battery pack with a solar panel built-in or a solar panel array with USB ports built-in for charging. Both of these options will help to keep your phone charged by harnessing the power of the sun. Go to my Profile and you can find all about Solar Energy material there... ",
            "date": "Answered August 9, 2020",
            "views": "313",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jana Barnett",
                    "user_href": "/profile/Jana-Barnett-10"
                },
                {
                    "user_id": "Robyn Graham",
                    "user_href": "/profile/Robyn-Graham-61"
                },
                {
                    "user_id": "Brandi Phelps",
                    "user_href": "/profile/Brandi-Phelps-10"
                },
                {
                    "user_id": "Janice Tucker",
                    "user_href": "/profile/Janice-Tucker-37"
                },
                {
                    "user_id": "Jean Richardson",
                    "user_href": "/profile/Jean-Richardson-55"
                }
            ]
        }
    ]
}