{
    "title": "Is it possible for humanity to change? - Quora",
    "tags": [
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim H. White",
                "href": "/profile/Jim-H-White-1"
            },
            "answer_text": "It is not impossible to change humans beings, but the only one you have Cosmic permission to change is yourself. To change yourself, it is normally necessary to better understand a few questions such as: What sort of universe do we live in?;Who are we, as a member of the humans species?;Why are we here?; andDo we have a Destiny?Most of what you have been taught about the above has been purposefully perverted away from any sort of Cosmic Truth, so that you remain Fear-based and controllable by those with power and vast riches. According to my studies, and with help from a guide, my understanding of the above is as follows: This is an abundant, generous universe which has selected for life and such species as human beings. It also Loves us beyond our ability to comprehend that Love;We humans are eternal, spiritual beings who will have a string of bodies made of stardust. The bodies will all die but we are life and life cannot die;We are here to become love-focused beings who step out of Fear, turn around and start our personal version of The Way towards living Love; and,We have an initial Destiny to become such a Great example of living Love that others choose to become like us, and we then have a Destiny to become Love Personified.While only a few humans have reached our final Destiny, many are now approaching that endpoint as humans now living. With all the nonsense sent our way, it is difficult to change, because we are taught to Fear change (even though everything in this universe changes). We even get many lives so that we can finally choose to take control of our own processes of change, rather than let others continue to control us. Remember, in a universe of change, change cannot be avoided! ",
            "date": "Answered May 16, 2020",
            "views": "67",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raji Iyer",
                    "user_href": "/profile/Raji-Iyer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sethuraman Ravikumar",
                "href": "/profile/Sethuraman-Ravikumar"
            },
            "answer_text": "It is very much possible to change human beings over a long period of time in a slow manner. There is no fast track. Our Indian history depicts that we have been invaded and ruled by somebody or the other for more than 1000 years. Our genes are habituated to look for survival at any cost and slave mentality set in. We are very good servants not masters. We are not self disciplined and do a great job under watchful eyes. We are too loyal to our masters to gain some extra personal favours even at the cost of division in the family. English exploited us well on this score. Just at the click of the button (Indian Independance), we expect everything to change over a night. However it is slowly happening and it may take another 4 to 5 generations to pass through to see the change. In normal times we lack patriotism. I wish to share my personal life experience. I am youngest in my family and all my four elder brothers settled in US. They visit India once in two years. They used to bring in lot of times which attracts customs duty. Through some surmise or through bribery walk out of customs as heros, when they can easily pay the duty and walk out like a king. Immediately they find fault with our system as everything is out of place. You are educated and earning a good salary, why can’t you pay the duty before finding fault with our system. I am not sure whether they still do this or not! They are very good people till they board the flight back to India. My parents insisted that I should also settle in US. When my eldest brother asked about this I told him that I wish to be a king in my own hut rather than a slave in a palace which created a friction in the family for some time and now settled. My reason is that I have no right to change the destiny of children. Their off springs are neither Americans or Indians. It may take another 2 to 3 generations to normalise. MY perception is I have no right to change the course of children. In spite of living in US in good positions, we don’t live like americans. Only the exchange value gives them the benefit when they visit India. What we enjoy like, maids/servants in the normal course, they can’t afford there. Irrespective of wherever we live, our gene will show our true colurs.! ",
            "date": "Answered May 16, 2020",
            "views": "18",
            "upvotes": "0"
        }
    ]
}