{
    "title": "Is it true that using your smartphone while charging it destroy your battery power over the long term? - Quora",
    "tags": [
        "Electronic Battery Life",
        "Smartphone Battery Life",
        "Smartphone Batteries",
        "Electronic Batteries",
        "Battery Life",
        "Batteries",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Taylor",
                "href": "/profile/Mark-Taylor-172"
            },
            "answer_text": "No, that's not true.  The phones and batteries of today are very resilient, and about the only thing that you can do to them that will hurt them is to leave them fully discharged for long periods of time.  I answered another question earlier with the text below that I wrote.  There might be some good information in it for you: The best thing to maintain a long battery life is to charge it often.  Modern phones all use Lithium Ion batteries, which will last longest when charged often at discharges are shallow.  This is the opposite of the older NiCd batteries. For older NiCd batteries you would want to discharge quite a bit before charging.  The chargers back then were not smart chargers, and if left charging too long would cause damage to the batteries long term.  All modern phones have circuitry to fully charge Li batteries with zero chance of overcharging (barring a circuit malfunction which is EXTREMELY rare.) Even if discharged 100% daily, the new lithium batteries will still far outperform the older NiCd batteries.    The only way to kill one of these new batteries is to allow it to fully discharge, and let it sit for months and months at full discharge.   ",
            "date": "Answered May 6, 2016",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Livgren",
                    "user_href": "/profile/Martin-Livgren"
                },
                {
                    "user_id": "Fu Lei",
                    "user_href": "/profile/Fu-Lei-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karl Young",
                "href": "/profile/Karl-Young-10"
            },
            "answer_text": "Actually, it's the opposite.  Keeping your phone fully charged as much as possible will extend the battery life.  Here are the two main reasons: Battery life degrades from the cycling effects of charging and discharging.  So, the less you cycle and the less you do deep cycling, the longer the life.When using your phone while plugged in will allow the charging power to operate your phone, not discharging your battery.  If you have a phone that only pulls power from the battery, then you are charging while discharging; which means minimal cycling.Also very important:  do not keep your phone in a place that's warmer than 135F (45C), like in a car parked in the sun in a warm-hot climate w/o AC going.  Heat degrades Li-ion chemistry rapidly.  That's another reason to avoid fast charging whenever possible if your battery heats up too much. ",
            "date": "Answered May 6, 2016",
            "views": "560",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Martin Livgren",
                    "user_href": "/profile/Martin-Livgren"
                },
                {
                    "user_id": "Vinayak V. Nair",
                    "user_href": "/profile/Vinayak-V-Nair"
                }
            ]
        }
    ]
}