{
    "title": "Is it ethical to produce genetically modified food? - Debate With Us! - Quora",
    "tags": [
        "Arguments and Argumentation",
        "Government"
    ],
    "response": [
        {
            "author_info": {
                "name": "Achyuthan Sanal",
                "href": "/profile/Achyuthan-Sanal"
            },
            "answer_text": "Ok. This is a very controversial topic but only because people don’t even know what GMO’s are. No, they aren’t crops “sprayed with chemicals”. They are organisms that have their genome modified. Which means their genes are changed slightly. No, organic food isn’t “better” than genetically modified food, only people who want to feel special buy them. They are ignoring science.  From the talk- A billion people go to bed hungry in this world, every day. That number is rising, and it is rising pretty rapidly, and that’s very disgraceful. We’ve used our imagination to thoroughly trash this globe. Potable water, arable land, rainforests, gas, oil, they’re going away, and going away very soon. Unless we innovate ourselves out of this mess, we’re going away too. The question is “can we do that?” We can, it’s clear that we can make food that can feed billions of people without raping the land that they live on. We’ve never needed progress in science more than we need it now. People wrap themselves in their beliefs and they wrap themselves so tightly that you can’t set them free. Not even the truth will set them free. Everyone is entitled to their own opinion, but do you know what they’re not entitled to? They’re not entitled to their own facts. I wrote a story about genetics engineered food(for The New Yorker), and people went crazy. I couldn’t understand why people thought these were “frankenfoods”, why they thought moving molecules around in a specific, rather than haphazard way, was “trespassing on nature’s ground”. The Food and Drug Administration (FDA), Environmental Protection Agency (EPA), and USDA maintain that GMOs are safe for human and animal consumption. To those of you who think genetically modifying an organism is against “nature” then you’re wrong too. Humans have been selectively breeding organisms for thousands of years, which is basically a slower version of genetically modifying them. How do you think bananas were made? You see this-?  That is the result of hundreds of years of selective breeding. For hundreds of millions of people in developing countries today, bananas are a dietary staple—the least expensive source of nutritious calories. This is how they looked like before we made them into how they are today-  Humans have been tweaking the genetics of our favourite produce for millennia. To refuse that is to be purely ignorant. Check out this article for more examples- Here's what fruits and vegetables looked like before we domesticated them GMO’s actually reduce the amount of pesticides that is applied. For example, one of the most common GMO crops is Bt corn, which is genetically modified to produce the insecticide(it does not affect humans at all) Bt toxin. By making this toxin, the corn is able to resist pests naturally. The Bt gene is commonly genetically engineered into crops like corn, cotton, and soybeans. It comes from a naturally occurring bacteria known as Bacillus thuringiensis. This gene produces a protein that is toxic to several pests and insects, which gives the GMO plants a natural resistance. As such, the GMO crops don’t need to be exposed to harmful pesticides as often. In fact, an analysis of 147 studies from 2014 found that GMO technology has reduced chemical pesticide use by 37% and increased crop yields by 22%.[1] Other GMO crops have been modified with genes that help them survive stressful conditions, such as droughts, and resist diseases like blights, resulting in a higher yield for farmers. Additionally, genetic modification can increase the nutritional value of foods. For example, rice high in beta carotene, also called golden rice, was developed to help prevent blindness in regions where local diets are chronically deficient in vitamin A. Moreover, genetic modification may be used simply to enhance the flavor and appearance of foods, such as the non-browning apple. In addition, current research suggests that GMO foods are safe for consumption. Now let’s tackle the topic of allergies. There have been no reports of allergic reactions to GMO foods currently on the market. According to the FDA, researchers who develop GMO foods run tests to ensure that allergens aren’t transferred from one food to another. In addition, research has shown that GMO foods are no likelier to trigger allergies than their non-GMO counterparts.[2] If you have a soy allergy, both GMO and non-GMO soy products will prompt an allergic reaction. Similarly, there’s a common concern that GMO foods may aid the progression of cancers. Because cancers are caused by DNA mutations, some people fear that eating foods with added genes may affect your DNA. This worry may stem partly from an early mice study, which linked GMO intake to a higher risk of tumors and early death. However, this study was later retracted because it was poorly designed. Currently, no human research ties GMO intake to cancers. The American Cancer Society (ACS) has stated that there’s no evidence to link GMO food intake to an increased or decreased risk of cancer.[3] Watch this Ted talk for more information-  It’s also worth noting that any food labeled “100% organic” does not contain any GMO ingredients, because U.S. law prohibits this. However, if a product is simply labeled “organic”, it may contain some GMOs. Due to genetically modified food, billions of people don’t go hungry in this world anymore. To be against it is to be purely selfish and ignorant. Footnotes[1] A meta-analysis of the impacts of genetically modified crops - PubMed[2] The allergenicity of genetically modified foods from genetically engineered crops[3] Common Questions About Diet, Activity, and Cancer Risk",
            "date": "September 28, 2020",
            "views": "43",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kashif Vortex",
                    "user_href": "/profile/Kashif-Vortex"
                },
                {
                    "user_id": "Nikk Shah",
                    "user_href": "/profile/Nikk-Shah-2"
                },
                {
                    "user_id": "Sona Kenway",
                    "user_href": "/profile/Sona-Kenway"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jashan Brar",
                "href": "/profile/Jashan-Brar-36"
            },
            "answer_text": "Absolutely. You have many good examples: Flavr-savr tomatoes: It is a genetically modified variety of tomatoes, which has helped us get rid of the discomfort of rotten tomatoes. Tomatoes contain an enzyme B-galactosidase responsible for rotting of tomatoes. Thanks to biotechnology, it has been able to significantly reduce it's effect. The shelf-life of tomatoes has increased significantly.Wheat: Traditionally, wheat was not-so-rich in B-carotene, a class of vitamin-A, required for healthy eyes and preventing nyctalopia (night-blindness).Broccoli: Broccoli is a hybrid variety bred from wild cabbage plant and Brassica. It is much rich in Vitamin-K, than cabbage and Brassica. And the list goes on…In short, genetically modified food is a boon for humanty, as it is much superior in shelf-life and nutritional content. ",
            "date": "September 27, 2020",
            "views": "57",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sona Kenway",
                    "user_href": "/profile/Sona-Kenway"
                },
                {
                    "user_id": "Nikk Shah",
                    "user_href": "/profile/Nikk-Shah-2"
                },
                {
                    "user_id": "Yusuf Gelle",
                    "user_href": "/profile/Yusuf-Gelle-1"
                },
                {
                    "user_id": "Achyuthan Sanal",
                    "user_href": "/profile/Achyuthan-Sanal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debdarsha Biswas",
                "href": "/profile/Debdarsha-Biswas"
            },
            "answer_text": "Why not ? GMO or genetically modified food, Contains all the good stuff of the original plant, but additionally it does’nt contain all the possible harmful effects of the Plant  ",
            "date": "October 1, 2020",
            "views": "54",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arabinda Tele Tech",
                    "user_href": "/profile/Arabinda-Tele-Tech"
                },
                {
                    "user_id": "Arnav Gander",
                    "user_href": "/profile/Arnav-Gander"
                },
                {
                    "user_id": "Achyuthan Sanal",
                    "user_href": "/profile/Achyuthan-Sanal"
                },
                {
                    "user_id": "Manthan Shah",
                    "user_href": "/profile/Manthan-Shah-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raina Wolf",
                "href": "/profile/Raina-Wolf-1"
            },
            "answer_text": "I don’t eat food with GMO, I eat only organic foods so and I don’t know to much about it as I don’t pay much attention to stuff like this. Eating food with GMO is essentially eating food with chemicals sprayed on it, no thanks ",
            "date": "September 27, 2020",
            "views": "61",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikk Shah",
                    "user_href": "/profile/Nikk-Shah-2"
                },
                {
                    "user_id": "David Thomas",
                    "user_href": "/profile/David-Thomas-805"
                },
                {
                    "user_id": "Kyle Prado",
                    "user_href": "/profile/Kyle-Prado-2"
                }
            ]
        }
    ]
}