{
    "title": "Is it really necessary to constantly upgrade our devices? - Quora",
    "tags": [
        "Is It Necessary to X",
        "Computers Vs. Smartphones",
        "Smartphones Vs. Laptops",
        "Laptops",
        "Computers",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saumya Khimsaria",
                "href": "/profile/Saumya-Khimsaria"
            },
            "answer_text": "Not at all. I do not think it is necessary to keep on upgrading our devices. First of all they are quite expensive. Second the new devices have very less new features than its predecessors. The primary reason why people upgrade device is to stay with the time and to stay at par with the latest technology. Mobile phones these days can serve one atlest 2–3 years. Laptops can serve from 4–5 years. Smart Watch, Smart TV etc are still in developing stages so it doesn't make any sense upgrading them. Thanks for A2A. HOOE IT HELPED.\\U0001f600 ",
            "date": "Answered October 3, 2016",
            "views": "130",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ravi Teja",
                    "user_href": "/profile/Ravi-Teja-599"
                }
            ]
        },
        {
            "author_info": {
                "name": "Munipalle Lakshmi Narasimha Rao",
                "href": "/profile/Munipalle-Lakshmi-Narasimha-Rao"
            },
            "answer_text": "Computers and accessories are controlled by Americans like that of medicines. They are greedy and want to have continuous income at your expense so that they can become rich. They even give you firmware with bugs so that it will be faulty after set time. Only new parts require new system. That way they can make more money. The stone tools and wooden tools can not be programmed that way. We are victims of modern fraud. Medicines will not cure but they wish you to use till your life ends. I have worked with the first ibm table top computers with dos. That thrill is gone. You have to answer many questions before you start typing a small letter. How I wonder what we are. ",
            "date": "Answered October 3, 2016",
            "views": "28",
            "upvotes": "0"
        }
    ]
}