{
    "title": "Is it true that 5G is not about speed? - Quora",
    "tags": [
        "5G (wireless communication)",
        "Speed"
    ],
    "response": [
        {
            "author_info": {
                "name": "OKportal Technology",
                "href": "/profile/OKportal-Technology"
            },
            "answer_text": " Credit image: What Is 5G 5G encompasses lots of advancement and speed is only one of them. Thus, indeed, speed does not tell the whole story. With the rapid advancement of technology, as we move from 4G to the upcoming 5G, internet users all around the world are expecting more increasingly faster connectivity. Consequently, there is some reason to speculate that 5G is not about speed. The U.S. seems to be obsessed with speed. Whether it be for fast cars, fast money or their fast mobile network speeds, consumers in the U.S. are obsessed. While that’s not necessarily a bad thing, it is a thing and when it comes to 5G, consumers will do well to change the narrative and move away from a ‘speed matters’ mantra. Although speed did matter in the 4G era, it won’t in the future 5G world. That’s not to say you shouldn’t expect faster speeds with 5G as you will certainly get them. But the fact you are getting them is more of a by-product of the other big benefits of the new-world network technology. The real benefits of 5G. For now, it's just important to understand that speed is not the goal of 5G. Likewise, it does not technically matter how fast 5G speeds will be. What matters with 5G is not the speed at which data travels but the capacity of data that can travel at the same time. When you then combine this with lower levels of latency the end result is quicker access to data. To the point where the act of sending out a data request and receiving a reply to that request is perceptually non-existent. Most importantly, this is irrespective of the size of the data request. For want of a better word, it is instant data.  Hope you like the answer! OKportal Technology ",
            "date": "Updated July 23, 2019",
            "views": "615",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "ShivaKumar Varikuppala",
                    "user_href": "/profile/ShivaKumar-Varikuppala-3"
                },
                {
                    "user_id": "Atul Salgaonkar",
                    "user_href": "/profile/Atul-Salgaonkar"
                },
                {
                    "user_id": "Atif Shahzad",
                    "user_href": "/profile/Atif-Shahzad-66"
                },
                {
                    "user_id": "Malik Dawood Usama",
                    "user_href": "/profile/Malik-Dawood-Usama"
                },
                {
                    "user_id": "Imran Haneef",
                    "user_href": "/profile/Imran-Haneef-5"
                },
                {
                    "user_id": "Imran Malik",
                    "user_href": "/profile/Imran-Malik-505"
                },
                {
                    "user_id": "Epiphany Professional",
                    "user_href": "/profile/Epiphany-Professional"
                },
                {
                    "user_id": "Sumaira Nazim",
                    "user_href": "/profile/Sumaira-Nazim"
                },
                {
                    "user_id": "Dawood Usama",
                    "user_href": "/profile/Dawood-Usama"
                },
                {
                    "user_id": "Asif Zaheer",
                    "user_href": "/profile/Asif-Zaheer-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Hannent",
                "href": "/profile/Bob-Hannent"
            },
            "answer_text": "Yes, and no. 4G can already do gigabit speeds, ultrafast speed was promised on ‘LTE Advance’ at least three years ago and you can find references to gigabit speeds. Furthermore, 99% of users 99% of the time wouldn't benefit from consistently higher speeds even if they were available because that's not how most people use their phone most of the time. Sure, it would be nice to make 'Insta', ‘FB’ or 'Snapchat’ more snappy (pun unintended) but reliability is what people are really craving. 5G’s primary solution is to high traffic cell sites. The biggest problem for the previous generation cellular technology is that it falls over when lots of people turn up at a cell site. Train stations, shopping malls, stadiums and concert venues are all massive challenges for the networks. Especially when you have stampedes of users like in a train station at rush hour, waves of users as the trains arrive and depart will overload the cell site. The solution to this is smarter cells with more adaptive technology to allow it to pick out the huge numbers of users. Also they have added mmWave technology which is extremely short range but very high speed, great for venues. 5G also brings another benefit from this mmWave technology: the cellular providers can compete with fixed line broadband. But fixed wireless broadband at mmWave depends on the cellular networks building out extremely large numbers of picocells, like one on every other street light. Not only does this require municipal involvement, it's also going to require a huge speculative investment and long roll-out. Also, mmWave is absorbed easily by things like rain and trees, so I have questions about availability. Another major feature for 5G is improved support for different QoS (quality of service) for different types of customer. This is being sold as 'low latency' in the hype, but the reality is that cell sites only have a certain capacity for processing data and the more low latency traffic you have it will overload the cell more. So, ultra low latency 5G is really about M2M (machine to machine) and is being touted for real time traffic systems and self-driving cars more than people playing the latest computer games or video chatting. Note: I can already get 14ms ping on 4G which is about equal to VDSL where I live. I am online rallying against 5G, not because the technology and certainly not because of any health issues (which the nutjobs are out in force about without evidence). But I am campaigning on the principle of truth in advertising and cutting the hype. We get slow 4G in stations because of density, but why don't I get 400Mbps when I am looking at a cell tower in a low density area? Because the cellular networks haven't invested and I have no confidence that they will invest sufficiently in 5G. Finally, it's important to note that 5G brings precisely zero benefit to rural users. Rural users are currently neglected and under served and that's a shame. ",
            "date": "Answered June 3, 2019",
            "views": "110",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ovinia Rustandy",
                    "user_href": "/profile/Ovinia-Rustandy"
                },
                {
                    "user_id": "Andre Camp",
                    "user_href": "/profile/Andre-Camp-1"
                },
                {
                    "user_id": "Ivan Laksono",
                    "user_href": "/profile/Ivan-Laksono"
                }
            ]
        }
    ]
}