{
    "title": "Is it possible to run the whole country on solar farms? - Quora",
    "tags": [
        "Solar Farming",
        "Solar Panels",
        "Solar Energy",
        "Sustainable Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chad Courtney",
                "href": "/profile/Chad-Courtney-1"
            },
            "answer_text": "Theoretically yes it’s possible, but it would require storage of one form or another. Hydro-pumped storage, battery storage, etc. That said, it’s most likely not going to be the least expensive route to go renewable, no specific one renewable is going to be the least expensive renewable route for that matter. What would be the least expensive route to go 100% renewable in a country is to have a mix of renewables, what that mix is is going to depend on your country. Don’t get me wrong, if you have an over abundance of one source such as Icelands Geothermal, Norway and Costa Rica’s Hydro, … then you can go 100% on that one renewable. But for most, a mixture of Solar and Wind with storage (pumped Hydro, battery, etc) can get us there. It may be that you want to build out enough that would actually produce 120%+ of the electricity that we’d need throughout a year, so that we don’t need to overbuild storage, as it would be cheaper to do so. The excess electricity production could be used to produce hydrogen through electrolysis if we don’t simply stop them like we stop fossil fuel power plants when we don’t need their extra production. And one of the easiest ways of having storage for cheap is to integrate V2G and paying car owners to pull some of their cars electricity when demand is high, and charging them when it’s low at a lower rate. Just imagine if only 10% of the cars in the US were EV - that’s 25M cars (we’ll be there before you know it.) Now if the average car has 75kWh battery and let’s say we’re only allowing 15kWh to be given, that’s 375GWh of energy on tap for those peakers. And when we’re at 50% of all cars being EV? So, the big point of this is to not limit ones scope to thinking of just one renewable, or just what’s available today, but where we’re going and what can we do at lower cost than continuing use of fossil fuels. ",
            "date": "Answered September 5, 2020",
            "views": "102",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bernhard Scheffler",
                    "user_href": "/profile/Bernhard-Scheffler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Albertson",
                "href": "/profile/Christopher-Albertson-3"
            },
            "answer_text": "It would only work if you had a very good way to store electric energy. If batteries were cheap enough everyone would have a battery in their home large enough to last them serval days and utility companies would have larger ones so they could supply power at night. But today, storage is not cheap so it is unlikely we can use 100% solar power. Many years from now there will be a surplus of use automotive batteries from electric cars. The batteries will have reduced capacity and not be desirable for use in cars but tens of thousands of these semi-used-up batteries might be stacked in a huge facility in a remote place and used to store power cheaply. Another cheap way to store power is with huge weights, weighing many tons. These are hosted what power is cheap and lowered to generate power at night. The same could be made with railroad tracks. A train is run uphill during the day and allowed to run down hill at night. ",
            "date": "Answered September 4, 2020",
            "views": "43",
            "upvotes": "0"
        }
    ]
}