{
    "title": "Is it true that people in the 1990s didn't have internet or smartphones? - Quora",
    "tags": [
        "History of the Internet",
        "1990s",
        "Internet Service Providers",
        "Ancient History",
        "The Internet",
        "Technology",
        "Smartphones",
        "History",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vijyu R",
                "href": "/profile/Vijyu-R"
            },
            "answer_text": "In India it was rather rare to find a Computer Desktop system (with the old CRT monitors) and we had a Computer Laboratory back in our school in the early 1990’s and guess what ? The students and teachers had to remove our shoes and socks off to enter into the laboratory (since the Viruses could affect the systems) and the room was separate & having an Air Conditioned system inside a classroom and there were Computer teachers and we had to wait for our turn to touch the system and learn from it. Internet explorer had to be dialled and connected with another external server and network was established. So Internet was a luxury up to the 2000 era. If a CRT Black and White or Colour Television itself was a rare thing for the early 1990′s in India, there were only Landline phones by BSNL in India, and Pagers came in later. After that say by the year 2000 onwards the basic Bar model Mobile devices and connections came. After that came the Blackberry and QWERTY mobiles came in vogue. Smartphones came in only after the 2011 Cricket World Cup in India, which we had won under MSD's captaincy. ",
            "date": "Answered October 7, 2020",
            "views": "27",
            "upvotes": " Answer requested by Nikhil Soni"
        },
        {
            "author_info": {
                "name": "Andy Cohen",
                "href": "/profile/Andy-Cohen-22"
            },
            "answer_text": "The internet, as we know it, has existed for almost 30 years but widespread use didn’t begin until the late 90s, like 98 or 99. Smartphones didn’t exist until the 2000s. ",
            "date": "Answered October 7, 2020",
            "views": "33",
            "upvotes": "0"
        }
    ]
}