{
    "title": "Is it possible to accidentally talk to a spirit? - Quora",
    "tags": [
        "Spirits (ethereal)",
        "Spirit"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenda Elise",
                "href": "/profile/Kenda-Elise"
            },
            "answer_text": "Is it possible to accidentally talk to Spirit… If you’re thinking about someone who’s recently passed, talking to him or her either out loud or in your mind —Yes. But that’s on purpose, not accidental. Spirit is able to use many electronic devices to get an urgent message across; You might hear a message come through your television speakers, on the car radio during a broadcast, over the telephone and/or while listening to voicemail. I’ve even received messages on old YouTube videos; Was searching for a piece of old tube radio babble on YouTube; As it turns out, the bit that I randomly chose contains someone saying, “How are you Kenda?” (in fact, I didn’t hear it until I listened to the clip on Audacity; Stunned, I then went back and verified it was on the YT video) To further compound the weirdness, the original vid was uploaded 7 years prior, still amazed by that one. If you were talking to yourself out loud and heard someone answer you, yep that qualifies as accidentally talking to Spirit. If it only happens once then you’ll count it among your unexplained experiences (When people find out what I do occasionally someone will pull me to one side and say, “I’d never tell anybody else this but— “) If you tried to talk to Spirit and now regret it, then that’s on purpose as well —No backsies I’m afraid, but don’t worry about it; most likely Spirit knows you regret it —we who actually record don’t even get communication ALL of the time and some of us record every week. ",
            "date": "Answered April 8, 2017",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Davis",
                "href": "/profile/James-Davis-119"
            },
            "answer_text": "I think thought and emotion are far more communal than people realize. We draw, usually unconsciously, from the vast field of human thought—both that being created now and that created down through the ages. We “talk” or tap into all manner of currents of thoughs that fill space. Humanity is really part of one group consciousness, one brotherhood of mind, or at the lower level, one mass consciousness. We participate without realizing it in a community of souls including those in the body and those out of it. It is our individual thought and focus of attention that tunes us in to its close correspondences in the psychic worlds . We Commune at Night: Amazon.com: Dream Telepathy: Experiments in Nocturnal Extrasensory Perception (Studies in Consciousness) (9781571743213): Montague Ullman, Stanley Krippner, Alan Vaughan: Books And in the Day on a Global Scale:  And in the History of Discovery: Multiple discovery - Wikipedia ",
            "date": "Answered April 4, 2017",
            "views": "153",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Felicia Catherina",
                    "user_href": "/profile/Felicia-Catherina"
                },
                {
                    "user_id": "Chris Thomas",
                    "user_href": "/profile/Chris-Thomas-263"
                }
            ]
        }
    ]
}