{
    "title": "Is it possible that human surgeons will be replaced by robots in the near future? - Quora",
    "tags": [
        "Artificial Intelligence in Medicine",
        "Surgeons",
        "Robots"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander van Hattem",
                "href": "/profile/Alexander-van-Hattem-1"
            },
            "answer_text": "That depends on what you mean by \"near future\". In your lifetime or mine?  No. The technical challenges to be overcome are not so much the mechanics of a robotic surgeon; the da Vinci Surgical System is an example of how precise robotic instruments can be.  But da Vinci is not autonomous, it is controlled by a trained surgeon.  It is a tool, like a 21st century scalpel. Surgery is not like a production line, where a machine can follow the same set of instructions and come up with the same outcome every time.  Every human body is different, and even with the most advanced imaging technology we have available there are still things that you only see once the body has been opened up.  You need someone who can think, make decisions and weigh options, and the kind of AI that could do that at the level of a human surgeon is a long way away.  Heck, the technology to make a robot that can fold your laundry was a huge breakthrough that only happened very recently.  Also, more controversially and in spite of some stereotypes, surgeons have empathy, and they're with their patients for the long haul.  They're aware that they're operating on a human being, and there is a lot more to surgery than the cutting.  There is the pre-admission preparation, the decision to operate at all, and the care afterwards including management of complications.  A lot of those decisions are not clear cut, they involve careful consideration of the individual circumstances.  If you're talking about replacing surgeons, you have to wonder who's going to do those roles, since an intimate knowledge of the surgery is required through the patient's entire treatment course. 2000 years from now?  It may be feasible that in that time, autonomous robot surgeons could perform operations as well as human surgeons, but I still think that even then surgeons won't have been completely replaced. ",
            "date": "Answered April 9, 2015",
            "views": "94",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dina Mo'men",
                    "user_href": "/profile/Dina-Momen-2"
                },
                {
                    "user_id": "John Van Dinther",
                    "user_href": "/profile/John-Van-Dinther-1"
                },
                {
                    "user_id": "Prashant Tripathi",
                    "user_href": "/profile/Prashant-Tripathi-444"
                },
                {
                    "user_id": "Kharabela Das",
                    "user_href": "/profile/Kharabela-Das-1"
                },
                {
                    "user_id": "Imri Amariah",
                    "user_href": "/profile/Imri-Amariah"
                },
                {
                    "user_id": "Jose Martinez",
                    "user_href": "/profile/Jose-Martinez-2370"
                },
                {
                    "user_id": "Andes Wong",
                    "user_href": "/profile/Andes-Wong-2"
                },
                {
                    "user_id": "Connor Scott",
                    "user_href": "/profile/Connor-Scott-114"
                },
                {
                    "user_id": "Murlidhar Pamarthi",
                    "user_href": "/profile/Murlidhar-Pamarthi-1"
                },
                {
                    "user_id": "Matthew Lu",
                    "user_href": "/profile/Matthew-Lu-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Junaid Haroon",
                "href": "/profile/Junaid-Haroon-4"
            },
            "answer_text": "There is a general misconception in the public about what robotic surgery is about. Primarily due to sci-fi, when people think of robots, they think about autonomous humaoids with extremely complex AI. Something like this:  However, we are very far from the truth of surgical robots. These robots are complex tools that are utilized by surgeons to enhance their ability to operate in complex situations by using small incisions to introduce low profile instruments into hard to reach areas. These instruments reduce the tremor every human hand has and allow for comparable range of motion to the human wrist, allowing very complex procedures to be done with relative ease and might i add comfort since the surgeon is sitting in a corner of the room on a padded seat working on a console. It essentially looks like this:  Note that the guy on the left is the surgeon and scrubbed person is a skilled assistant whole helps change instruments and assist the surgeon as needed on the bedside. So, to answer your question, the robot is as likely to take over the surgeons job as the scalpel. It is a tool, meant to be used by highly skilled and highly intelligent surgeons. Artificial intelligence, at least what’s available mainstream is nowhere near being complex enough to make the multitude of decisions a surgeon makes in the OR. Here is a video of robotic lung surgery. Remember, there is a surgeon sitting somewhere in the room controlling those robotic arms you see.  ",
            "date": "Answered December 21, 2018",
            "views": "962",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prashant Tripathi",
                    "user_href": "/profile/Prashant-Tripathi-444"
                },
                {
                    "user_id": "Andes Wong",
                    "user_href": "/profile/Andes-Wong-2"
                }
            ]
        }
    ]
}