{
    "title": "Is joining niit university worth it? - Quora",
    "tags": [
        "NIIT University, Neemrana",
        "NIIT (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajat Srivastava",
                "href": "/profile/Rajat-Srivastava-49"
            },
            "answer_text": "Hi there, I am a third year student at NIIT University (NU). This is a good university for those who are willing to commit to themselves. Having spent two years of my life here at NU, I have seen myself getting better day by day, be it in terms of academics or co-curricular activities. NU provides you the platform to rise, but its you, who will have to decide how to use the facilities provided by your college to help them shape your personality and go out ultimately becoming a person you thought of before entering the college. NIIT University is one of those private colleges in India which stands on the pillars of quality of education, named brand, proper infrastructure and good placement records. I can assure anyone that the course structure here is well organised and NU has the edge over other institutes due to more than 30 years of experience of NIIT group. The professors teaching CSE- related courses are really good, with notable names like Dr Prosenjit Gupta from University of Minnesota, Dr Sudhir Kaiker from Canada, Prof Kamlesh Bajaj and Prof Navin Kapur from IIT D. Many students have worked with them and published research papers and gone to conferences. Students from NIIT University get placed at the top-notch companies of the country. For placements we have companies like Amazon, IBM, CTS, ZENSAR, PWC, Big Basket, Tech Mahindra etc. with the highest domestic package of 11 lakhs last year and highest international package was 47.9 lakhs. ",
            "date": "Answered July 10, 2018",
            "views": "745",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pratinav Shrivastava",
                    "user_href": "/profile/Pratinav-Shrivastava"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prashant Lakhotia",
                "href": "/profile/Prashant-Lakhotia"
            },
            "answer_text": "Well, Thanks for A2A. How you see the word ‘worth’? Do you have many options and you are just looking out for some review for all the colleges and then would decide? Or is it that you just have this university & you want to know , how is it to be in NIIT University. For later case, I would suggest please you go through this link on what i think about NU. Prashant Lakhotia's answer to What is your review of NIIT University, Neemrana, RJ, IN? ",
            "date": "Answered June 17, 2016",
            "views": "971",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kartikeya Vats",
                    "user_href": "/profile/Kartikeya-Vats"
                },
                {
                    "user_id": "Anand LAKHOTIA",
                    "user_href": "/profile/Anand-LAKHOTIA-2"
                }
            ]
        }
    ]
}