{
    "title": "Is Japan more like South Korea or like China? - Quora",
    "tags": [
        "Japan - South Korea Relations",
        "China and Japan",
        "Culture of Japan",
        "Korean Peninsula",
        "South Korea",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "King Wu",
                "href": "/profile/King-Wu-21"
            },
            "answer_text": "Japan is neither like China nor South Korea. Japan has a unique language, history, and culture. It has learned a lot from ancient Chinese dynasties, mainly the Tang Dynasty, and borrowed Chinese characters. Modern Japan studied like Western powers and formed a unique Japan. South Korea has been deeply affected by the Chinese dynasty for thousands of years, including the Song, Yuan, Ming, and Qing dynasties after the Tang Dynasty. In the last century, Japan colonized South Korea for many generations, and then South Korea was torn into two parts, North and South by the war between China and the United States, and semi-colonized by the United States for a long time. The history of China and Japan is continuous, but South Korea is not. The characters used in South Korea are no longer used by their ancestors, nor are their beliefs the beliefs of their ancestors. More than half of people in Korea believe in Christianity or Catholicism, and only 1-2% in Japan and China ",
            "date": "Answered April 3, 2020",
            "views": "226",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Allan Scafe",
                    "user_href": "/profile/Allan-Scafe"
                },
                {
                    "user_id": "Steve Kervin",
                    "user_href": "/profile/Steve-Kervin"
                },
                {
                    "user_id": "Sanku Mursog Jamtia",
                    "user_href": "/profile/Sanku-Mursog-Jamtia"
                },
                {
                    "user_id": "Jason Freedman",
                    "user_href": "/profile/Jason-Freedman-6"
                },
                {
                    "user_id": "John Wright",
                    "user_href": "/profile/John-Wright-1566"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Wright",
                "href": "/profile/John-Wright-1566"
            },
            "answer_text": "In my opinion, Neither. I feel like S. Korea and China share more similarities with each other than either of them do with Japan. Sure there are minute details like ramen, use of chopsticks, bowing, etc., but in terms of overall culture, Japan doesn’t seem to be swimming in the same direction as the other two. Please correct me if I’m wrong. Thank you. ",
            "date": "Answered April 3, 2020",
            "views": "257",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chyntiawati Kurniawan",
                    "user_href": "/profile/Chyntiawati-Kurniawan-1"
                },
                {
                    "user_id": "Steve Kervin",
                    "user_href": "/profile/Steve-Kervin"
                },
                {
                    "user_id": "Mk At",
                    "user_href": "/profile/Mk-At"
                },
                {
                    "user_id": "Sanku Mursog Jamtia",
                    "user_href": "/profile/Sanku-Mursog-Jamtia"
                }
            ]
        }
    ]
}