{
    "title": "Is living underground dangerous? - Quora",
    "tags": [
        "Passive Houses",
        "Sustainable Design",
        "Sustainable Development",
        "Subways",
        "Sustainability",
        "Danger and Dangers",
        "Homes and Houses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Snyder",
                "href": "/profile/Chris-Snyder-77"
            },
            "answer_text": "These answers have some nice pictures of underground homes, and I don’t disagree with the respondent’s premise that the structural considerations of living in an earth sheltered home can be safely dealt with. However, there is another silent invisible risk that is often ignored and needs to be dealt with that not only potentially affects underground homes, but also any building that uses materials mined from regions of the world that are considered to have a high risk of radon emissions. It is not well known that mined materials, such as all the ingredients of concrete, can emit significant amounts of radon that can build up in an airtight house and result in levels in excess of the legal maximum of 4.0 picocuries of radioactive particles /liter of air. The US government has no requirements for testing and labeling building materials as to their level of radon emissions, therefore anyone building anything new should test the mined building materials they propose to use before incorporating large quantities of them into the building, in order to find materials with the least amounts of radon emissions, and if you discover high levels of radon in existing buildings, consider encapsulating all mined materials with an air-barrier paint and installing a balanced pressure ventilation system with heart or energy recovery to mitigate radon inside a well-sealed building, using a re-useable radon meter to determine what levels of ventilation are needed to mitigate the radon down to acceptable levels. Most schools for professional architects and engineers teach that radon is something that leaks out of the soil surrounding a building and gets drawn into a leaky building, so they recommend making basements airtight and having a drainage plane of air surrounding a building so that is radon is ever detected, one can depressurize that drainage plane and suck radon out of the soil before it can leak into the building. However, this can be insufficient if the building is super airtight and you have built with materials like locally sourced concrete that are actually emitting radon within the building, in which case my recommendations in the previous paragraph become necessary. ",
            "date": "Answered September 30, 2019",
            "views": "312",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Grace",
                "href": "/profile/Mark-Grace-8"
            },
            "answer_text": "YES! However…. These guys don’t seem to be in any danger…  Nor these…  Or these…  These guys seem quite happy…  And these too!  In fact, as long as your home has been designed and built with the help of professionals (structural engineer, architect, passive design specialist… edit: and come to think of it, possibly a geologist!), there’s no reason why living underground shouldn’t be perfectly healthy, safe, comfortable AND sustainable. Furthermore… owing to the superb thermal stability of the ground (which is about 12 dec C in the UK below 2m from the surface), the internal air should be somewhat stable all year round and require only minimal conditioning. Just remember to get some sunlight every now and again! Edit 2: Links to further reading and images: 6 Fascinating Underground Homes That Go Above and Beyond Underground house ideas Underground Homes: 10 Amazing Underground Homes - ODDEE ",
            "date": "Updated November 28, 2016",
            "views": "266",
            "upvotes": " View 429 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amer Riaz Ghazi",
                    "user_href": "/profile/Amer-Riaz-Ghazi"
                },
                {
                    "user_id": "Cristina Garagarza",
                    "user_href": "/profile/Cristina-Garagarza"
                },
                {
                    "user_id": "Life Simpli",
                    "user_href": "/profile/Life-Simpli"
                },
                {
                    "user_id": "Roy Murianki",
                    "user_href": "/profile/Roy-Murianki-1"
                },
                {
                    "user_id": "Shruti Hegde",
                    "user_href": "/profile/Shruti-Hegde"
                },
                {
                    "user_id": "Christelle Gaillard",
                    "user_href": "/profile/Christelle-Gaillard"
                },
                {
                    "user_id": "Ahmad Syazani",
                    "user_href": "/profile/Ahmad-Syazani-2"
                },
                {
                    "user_id": "Dev Kumar",
                    "user_href": "/profile/Dev-Kumar-482"
                },
                {
                    "user_id": "Cathy Garrett",
                    "user_href": "/profile/Cathy-Garrett-7"
                },
                {
                    "user_id": "Mani Karuppiah Senthil",
                    "user_href": "/profile/Mani-Karuppiah-Senthil"
                }
            ]
        }
    ]
}