{
    "title": "Is OnePlus Nord worth buying? - Quora",
    "tags": [
        "OnePlus Smartphones",
        "Smartphone Shopping",
        "OnePlus (company)",
        "Smartphones Recommendations",
        "OnePlus One (product)",
        "Mobile Phone Recommendations",
        "Mobile Technology",
        "Shopping",
        "Android (operating system)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manmohan Rao Korlapu",
                "href": "/profile/Manmohan-Rao-Korlapu-1"
            },
            "answer_text": "I think I'm the most eligible person to answer this question, as I'm using one. There was a lot of hype around OnePlus Nord. The people at OnePlus told they worked many days designing the phone. But, I don't know why it took much time because there is nothing great with the phone. I don't mean it's bad but it's not great either. Let me explain you. I don't speak the spec -sheet, if you want it, look the page: OnePlus Nord - Full phone specifications Lets start with design and look, the phone looks just “okay” with glass slabs front and back and a plastic frame. At this price point they should have gone with metal frame atleast. Yes, the phone do really feel like a cheap one in hand, not solid not sturdy. Believe me, the Poco M2 pro/Redmi Note 9 pro which is at half the price feels much better and elegant. Talking about the cameras, At the back they have given four cameras, but only one main camera works good. The remaining three are useless. At front they have given dual cameras and again the ultra wide camera is useless, they should have given single good camera and saved the design. The camera at back is much better than the front one. The cameras are not so good and not so bad, they are like “okay, for the price”. Coming to the display, it's a Super Amoled display. I personally didn't like the display, the colours aren't good and vibrant. I have compared some phones with half the cost, they felt much better. But, no complaints here, the display too, not bad not good, just an average panel. Coming to the refresh rate, it's 90 Hz, it's definitely better than the traditional 60 Hz, but nothing to boast about, even the low budget phones now are coming with high refresh rates. Here comes the core, the processor which runs the phone, Snapdragon 765G. It's a mid range processor. It's drives your daily tasks effortlessly and serves casual gaming. This phone isn't meant for heavy gaming. 5G is useless in some regions, so there is no point in talking about that. The phone has a approximate 4000mah battery, I don't speak about SOT. The phone lasts longer if used in 60Hz rather than 90Hz. For a moderate user, it lasts for a day, for a heavy user it will suffice for 6 to 8 hrs. I suggest using in 60Hz. You can see the difference between the refresh rates only while scrolling through apps or documents and some very light games like subway surfers or Temple run. (The games like PUBG mobile or COD mobile or any other big titles, which are heavy can't reach more than 40 fps maximum, so it doesn't matter if it's 60 Hz screen or 90 Hz screen or more) OxygenOS is not completely bloatfree, there are also some useless apps that comes pre-installed and can't be uninstalled but can be disabled. Finally, the phone is not so great and not bad either. It's just “average” elements packed together. But, the phone doesn't deserve the price. It should have been priced 7% to 10% lower than the present price. The ideal and best suitable variant is 6gb ram + 128 gb internal, and they didn't have this variant purposefully. The 8gb ram and 12gb ram with sd765 are mindless. If you can live with 64gb then go with the 6gb+64gb variant. But my suggestion, there are much better phones in the same price bracket, have a look at them. And if you feel this answer is anyway useful, an upvote would be epic. Thank you.🙂 ",
            "date": "Updated October 20, 2020",
            "views": "35",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alkash Mohsin",
                    "user_href": "/profile/Alkash-Mohsin"
                },
                {
                    "user_id": "Sudhakar",
                    "user_href": "/profile/Sudhakar-137"
                },
                {
                    "user_id": "Aryan",
                    "user_href": "/profile/Aryan-293"
                },
                {
                    "user_id": "Niharika Hawelia",
                    "user_href": "/profile/Niharika-Hawelia"
                },
                {
                    "user_id": "Vishnu Bhattacharyya",
                    "user_href": "/profile/Vishnu-Bhattacharyya"
                },
                {
                    "user_id": "Manas Cool",
                    "user_href": "/profile/Manas-Cool-1"
                },
                {
                    "user_id": "Vidya Raman P A",
                    "user_href": "/profile/Vidya-Raman-P-A"
                },
                {
                    "user_id": "Rakesh Sharma",
                    "user_href": "/profile/Rakesh-Sharma-888"
                },
                {
                    "user_id": "Sunny Bisht",
                    "user_href": "/profile/Sunny-Bisht-5"
                },
                {
                    "user_id": "Akshay Saini",
                    "user_href": "/profile/Akshay-Saini-73"
                }
            ]
        },
        {
            "author_info": {
                "name": "Engineer",
                "href": "/profile/Engineer-110"
            },
            "answer_text": "The OnePlus Nord is a mid-range device, but it still has plenty to offer. It comes with the Snapdragon 765G processor, up to 12GB of RAM, four rear cameras, a big battery with Warp Charge 30T, and 5G support. Due to its affordable price tag, OnePlus had to cut some corners. In addition to opting for a slower processor compared to the Snapdragon 865 you get in the OnePlus 8 series, there’s also no wireless charging or an IP rating. You also get less base RAM and storage (India only) compared to the company’s flagships, and plastic rails around the phone instead of the more premium and durable metal. Is One Plus Nord worth Buying? The handset is more than powerful enough to handle everyday tasks with ease, offering similar performance as the two-year-old Snapdragon 845. However, if you plan on playing heavier games such as Real Racing 3 and Fortnite, you may have to look elsewhere. As noted in our review, you’ll experience some performance issues with titles like these. One of the biggest reasons to buy the OnePlus Nord is for the software experience. OxygenOS is one of the best skins out there, offering plenty of useful features while keeping a stock-like feel. That means the OS isn’t as modified as those you get on Samsung and Huawei devices, and there’s not a lot of bloatware on board. OnePlus also has a great track record when it comes to software updates, shipping out the latest versions of Android faster than most of the competition. Other reasons to go for the OnePlus Nord include an affordable price tag, 5G support, and a great AMOLED display with a 90Hz refresh rate. The build quality is excellent as well, as is the overall design of the handset. The OnePlus Nord's camera system is nothing to write home about. However, there are a few drawbacks you have to keep in mind, with the biggest one being the camera setup. While the main sensor does a solid job, the other three lenses are nothing to write home about. If camera quality is a priority for you, the Pixel 4a is a much better option. There’s also no headphone jack on board, nor is there a microSD card slot. This is especially worrisome considering that the base variant of the phone in India only comes with 64GB of storage. If these two things are important to you, something like the Galaxy A51 5G might be more up your alley. There are other alternatives available as well, which we’ll take a look at later on. Also, while the battery of the OnePlus Nord is a decent size, the battery life isn’t the best in class. But it’s not bad and should get you through the day with ease. ",
            "date": "Answered August 30, 2020",
            "views": "87",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Clarky Aarav Tyagi",
                    "user_href": "/profile/Clarky-Aarav-Tyagi"
                },
                {
                    "user_id": "Karl Brown",
                    "user_href": "/profile/Karl-Brown-81"
                },
                {
                    "user_id": "Bhaavika Silpa",
                    "user_href": "/profile/Bhaavika-Silpa-1"
                },
                {
                    "user_id": "Harshilkumar Tarunbhai Patel",
                    "user_href": "/profile/Harshilkumar-Tarunbhai-Patel"
                }
            ]
        }
    ]
}