{
    "title": "Is onboarding an essential component of an MVP? - Quora",
    "tags": [
        "Onboarding",
        "Minimum Viable Product (MVP)",
        "Lean Startup Advice and Strategy",
        "Lean Startups"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samuel Hulick",
                "href": "/profile/Samuel-Hulick-2"
            },
            "answer_text": "I think not skimping on UX at ANY part of the customer journey is absolutely crucial, but I wouldn't mistake \"UX\" with \"software/interface\" necessarily. If you're super early stage, there's a chance that heavily investing in a product-based onboarding flow will be the wrong move, as you'd be doubling down on tons of unproven assumptions about the problem you're solving, and many of those assumptions may be wrong. Instead, I'm a huge proponent of holding off on formalizing your onboarding interface and instead \"being\" your onboarding interface; find every opportunity you can to check in with people and directly assist them as possible. This will lead to all kinds of conversations that you wouldn't otherwise have had and greatly inform which directions you should formalize around. That said, that's my recommendation for B2B SaaS companies. If your product is significantly consumer-facing, and especially if it's reliant upon success in the app store, then ensuring your product is easily adopted without your assistance from day 1 would be a very good idea. ",
            "date": "Answered December 30, 2014",
            "views": "360",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Philip Wattis",
                    "user_href": "/profile/Philip-Wattis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kir Nik",
                "href": "/profile/Kir-Nik"
            },
            "answer_text": "I would say that the two hypotheses from Eric Ries' \"Lean Startup\" is very useful here. For a startup, you'd want to run tests against two assumptions:1. The Growth Hypothesis: you can acquire users at acceptable cost2. The Value Hypothesis: your proposition is valuable for your users - typically measured as users' propensity to go back to you for repeat interactions after the first time So, if you only want to test your Value Hypothesis with an MVP, you're perfectly fine holding your testers by hand, running through the whole process with them and showing how to use your service. This personal on-boarding will allow you to skip building technological on-boarding within your app. If you're looking to test the Growth Hypothesis as well, you'll need to understand conversion from realistic acquisition channels into usage. Whether it's paid ads, word of mouth, PR, etc. - if a user acquired from a specific channel leaves your app after 30 seconds, that should be considered a bounce, and therefore be excluded from usage for purposes of calculating conversion. But a simple on-boarding process can easily reduce the chance of that happening. You would have to build an on-boarding MVP here. ",
            "date": "Answered September 30, 2015",
            "views": "345",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Philip Wattis",
                    "user_href": "/profile/Philip-Wattis"
                }
            ]
        }
    ]
}