{
    "title": "Is PayPal stock a good investment in 2020? - Quora",
    "tags": [
        "PayPal (product)",
        "Investment Advice",
        "Stocks (finance)",
        "Stock Markets"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Seidelmann",
                "href": "/profile/Ryan-Seidelmann"
            },
            "answer_text": "Like the other guy that answered I own Mastercard and Visa. However I recently purchased a small sliver of Paypal. MA and V are trading now at all time highs and PYPL is down something like 10% from it’s most recent highs. They also acquired Honeybee lately and I really don’t know what they will do with it but they paid $4 billion for it. I like stocks that are trading down because of a large acquisition. I figure the lost revenue in the investment is priced in so I should perhaps buy and see if that investment becomes accretive. PYPL also managed to acquire and close on 70% of Gopay. This gives them a foothold in the coveted Chinese market which other fintechs are trying to get into themselves. Over all I own way more MA and V then I do PYPL but I have my eggs in three baskets now. I will continue to slowly add to my shares of PYPL on any over all market weakness and buy any pullbacks. ",
            "date": "Answered December 28, 2019",
            "views": "135",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nick Moylen",
                    "user_href": "/profile/Nick-Moylen"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Miller",
                "href": "/profile/David-Miller-1805"
            },
            "answer_text": "Paypal did better than I expected in the past year, it’s up 32.55%. I don’t own it but I think it’s a reasonable investment. I had several choices in the financials/payments segment that I liked better: Visa, which is up 45.25% in the same period, and Mastercard which is up 60.49%. I think for the coming year, Visa and Mastercard still look better than Paypal, and I will hold them, as well as Fiserv, which is up 61.35%. ",
            "date": "Answered December 27, 2019",
            "views": "98",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Seidelmann",
                    "user_href": "/profile/Ryan-Seidelmann"
                },
                {
                    "user_id": "Mike Demsky",
                    "user_href": "/profile/Mike-Demsky"
                }
            ]
        }
    ]
}