{
    "title": "Is Quantum Computing worth learning? - Quora",
    "tags": [
        "Quantum Computing",
        "Computer Science",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Malcolm Shute",
                "href": "/profile/Malcolm-Shute"
            },
            "answer_text": "Yes, and no... but that's a property of you, not the subject. All subjects are worth learning if they get you excited enough to want to learn them. As you imply, learning involves investment (of your time and effort).It is only if this investment is a joy and a pleasure that you stand any chance to get anywhere with it. In fact, I would be tempted to state the corrolary, too: if a subject really does grab your interest, and get you excited, you won't be able to stop yourself from dipping into it, and learning about it. I suppose what you really mean by your question, though, is \"Is Quantum Computing likely to end up as a dead-end, a blind alley?\" No, I personally think it is destined to be the next big thing (after the steam-engine for the industrial revolution, and the computer, for the information revolution). Even if it turns out not to be quite that revolutionary, it will certainly cause a significant change of direction for the current information revolution. ",
            "date": "Answered November 6, 2015",
            "views": "39",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vinicius Viana",
                    "user_href": "/profile/Vinicius-Viana-5"
                },
                {
                    "user_id": "Keerthi",
                    "user_href": "/profile/Keerthi-395"
                },
                {
                    "user_id": "Piotr Kurek",
                    "user_href": "/profile/Piotr-Kurek-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shakespeare-James"
                },
                {
                    "user_id": "Ștefan Nastasă",
                    "user_href": "/profile/Ștefan-Nastasă"
                },
                {
                    "user_id": "Mudassir Hasan",
                    "user_href": "/profile/Mudassir-Hasan-2"
                },
                {
                    "user_id": "Sakares Saengkaew",
                    "user_href": "/profile/Sakares-Saengkaew"
                },
                {
                    "user_id": "Samuel Phiri",
                    "user_href": "/profile/Samuel-Phiri"
                },
                {
                    "user_id": "Joshua Matos Gonzalez",
                    "user_href": "/profile/Joshua-Matos-Gonzalez"
                },
                {
                    "user_id": "Robert Huang",
                    "user_href": "/profile/Robert-Huang-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allan Steinhardt",
                "href": "/profile/Allan-Steinhardt"
            },
            "answer_text": "Caveat: This is an informed opinion not fact... The nature of quantum computer is profoundly different from classical computing. It is also profoundly different from anything humans have ever sought to devise.  As such it is almost certain to be a niche player in the arsenal of computational machinery humans produce and commingle with.  Informatics and informations systems are unlikely to be the first or even the last domain where quantum computing dominates.  For example: in quantum everything must be done in superposition. You can't just lookup data classically as part of quantum, it is an all or nothing proposition at present. You must lookup data in a so called oracle which finds the superposition of all possible answers when accessed by a superposition of all possible inputs.  Writing code in the hierarchical sense we envision for Turing machines, distributing partial or complete results, all that, and more, is difficult in quantum.  Learn quantum computing to be fascinated and a bit 'hip'. But to get a leg up on the informatics market after graduating, better to study something more prosaic. ",
            "date": "Answered November 6, 2015",
            "views": "71",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Keerthi",
                    "user_href": "/profile/Keerthi-395"
                },
                {
                    "user_id": "Ștefan Nastasă",
                    "user_href": "/profile/Ștefan-Nastasă"
                },
                {
                    "user_id": "Mana Kunimatsu",
                    "user_href": "/profile/Mana-Kunimatsu-2"
                },
                {
                    "user_id": "Jim Revithis",
                    "user_href": "/profile/Jim-Revithis"
                },
                {
                    "user_id": "Asif Shaikat",
                    "user_href": "/profile/Asif-Shaikat"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shakespeare-James"
                },
                {
                    "user_id": "Amanda Osvaldo",
                    "user_href": "/profile/Amanda-Osvaldo"
                },
                {
                    "user_id": "Sauradeep Debnath",
                    "user_href": "/profile/Sauradeep-Debnath"
                },
                {
                    "user_id": "Jonathan Pang",
                    "user_href": "/profile/Jonathan-Pang-10"
                },
                {
                    "user_id": "Arghyadeep Giri",
                    "user_href": "/profile/Arghyadeep-Giri-1"
                }
            ]
        }
    ]
}