{
    "title": "Is Ravi Agrahari's science and technology book worthy for the UPSC CSE preparations? - Quora",
    "tags": [
        "UPSC 2016",
        "Civil Services Exam of India",
        "Computer Science Engineering",
        "Union Public Service Commission of India",
        "Indian Administrative Service Preparation",
        "Indian Administrative Service",
        "Exam and Test Preparation",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anup Mapari",
                "href": "/profile/Anup-Mapari"
            },
            "answer_text": "I didn't use any book for science and technology. So can't tell you specifically for Ravi Agrahari sir’s book. But can suggest you what many successful aspirants do for science and technology. Prelims - If you see the questions UPSC ask in science and technology for prelims they are generally the terms which are in the news in the recent years. So you can specially see from current affairs magazine, test series papers , what concepts are trending in science and technology. Accordingly know something related to that. Don't have to do research on every topic. Just take every basic information available on internet.Read any basic book for science and technology if you are not from science background and have basic understanding about everything. Make some 20- 30 pages notes.Further, If possible see the RSTV science reporter program. Take quick overview of every episode if you found new things which can come in exam. Note them down in your notes.Mains- For mains they generally ask two types of questions. Either opinion based or factual (Core science).For opinions based see some toppers answer sheet how they write those answers. And practise some questions for yourself.For factual questions you cant do everything under the sun. If they ask you to write about any specific mission NASA or ISRO took some years before, how can you know about every mission or satellite. So once IRA ma'am said that very people know about such questions. So you just have to write something near to that topic if you don't know anything. But don't just leave questions. Also don't just write anything absurd.Have basic understanding and applications based knowledge about newest technologies like Big data, AI. You must know this things.Learn to see the trend. Since some years cyber issues are always in the news or data issues. So you can expect opinions based questions or policy based questions on this topic.Follow government policies on science and technology issues carefully.Rest be assured that there will be some questions in science and technology for which nobody will be ready for. So be ready for unexpected and write them with the overall knowledge you possess. ",
            "date": "Answered August 18, 2020",
            "views": "407",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Hari Poojan Singh",
                    "user_href": "/profile/Hari-Poojan-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raja Rajyavardhan Singh",
                "href": "/profile/Raja-Rajyavardhan-Singh"
            },
            "answer_text": "The best way to prepare Science and technology is to study from the Internet + Newspapers + NCERTs. Obviously staying connected to the UPSC syllabus is important. Static books are not regularly updated and they mostly contain the material that is already being asked in the examination. So, to a certain point, it would be redundant to rely on a particular book. Ravi Agrahari’s is a bulky book and it would not serve your purpose. It will remain on your shelf for a very long time. Prepare as per the syllabus, use the internet extensively and can use any science and technology book for reference. You can also refer to this site, they provide the best study material available in the market. My Account - Study Material ",
            "date": "Answered August 21, 2020",
            "views": "100",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rajkumar Vaishya",
                    "user_href": "/profile/Rajkumar-Vaishya-6"
                }
            ]
        }
    ]
}