{
    "title": "Is Ratan Tata really as great as he is portrayed? - Quora",
    "tags": [
        "Ratam Tata"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prateek Bohra",
                "href": "/profile/Prateek-Bohra-3"
            },
            "answer_text": "Is Ratan Tata really as great as he is portrayed? Yes, I feel so. There are very few names globally as diversified and widespread as Tata group. Every conglomerate of that Stature has to follow basic tricks and trades of businesses to win deals, expand and grow. And ultimately give back to the society in a bigger way. Its not an NGO but an extremely succesful business actively involved in charitable causes. Its not a monarchy (a family run business) anymore but a true democracy (For the people, by the people) of the corporate world. Talking about Ratan Tata Sirs recent donations, when some other corporate are busy growing and accumulating money, Tata has made donations even when there are some big companies in Tata group facing huge losses in current economic turmoil. Some also distributed bonuses as promised. This shows that their people (employees) and social work is much more important than these challenges which are bound to happen in the conglomerate as big as Tata Sons and which they will ultimately overcome. Honestly, I feel globally there is a need of many more Tata group like business empires than Walmarts or Reliances or Amazons of the world for a better tomorrow. No doubt the others are important but if I highlight one out of many benefits possible: Widening income gap, which is a huge worry globally, can be controlled to a great extent if more such democratic companies shine on the big stage. ",
            "date": "Answered October 16, 2020",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nelson Sequeira",
                "href": "/profile/Nelson-Sequeira-17"
            },
            "answer_text": "All big business houses like Tata, Mahindra,Birla,Reliance always like the policies of the current govt. When Congress is there they will say their policies are good. When BJP is there they will say their policies are good. They will never stand up for good bureaucrats like Raghuraman Rajan or someone else. So personally I don't feel Taras are so good as they portray. Many Tata companies are involved in government projects and it is tough to believe that they get projects without bribing. As a human ,Ratan Tata is very humble and he doesn't show off like the Ambanis. Also I guess they do not take revenge for older enmities . ",
            "date": "Answered January 26, 2019",
            "views": "38",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Gaikwad",
                    "user_href": "/profile/Rahul-Gaikwad-32"
                },
                {
                    "user_id": "Shubham Yadav",
                    "user_href": "/profile/Shubham-Yadav-506"
                },
                {
                    "user_id": "Vikas Gowda",
                    "user_href": "/profile/Vikas-Gowda-20"
                },
                {
                    "user_id": "Gyan Gupta",
                    "user_href": "/profile/Gyan-Gupta-1"
                }
            ]
        }
    ]
}