{
    "title": "Is radio the most reliable broadcasting technology? - Quora",
    "tags": [
        "Radio Broadcasting",
        "Radio and Television Broadcasting",
        "Broadcasting",
        "Radio Stations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeremy Smith",
                "href": "/profile/Jeremy-Smith-408"
            },
            "answer_text": "Much like any signal over air waves there will always be issues with reception in area, however, as long as cars have radios instead of tv's, and radio is played in business for customers and employees alike, plus the availability to turn on a windup or battery op radio when power fails causing loss of reception, then I would have to say YES it is still the most reliable because it's the most available. Tv and social media are great but when those both fail for any reason radio is always there. Not to mention online radio and sat radio the options are plentiful. If you're on the other side of the country you can still listen to your local radio, where as you would only have local channels on tv for the area you're in at the time. ",
            "date": "Answered June 23, 2017",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Everhart",
                "href": "/profile/Mark-Everhart-3"
            },
            "answer_text": "This is a broad, vague question. However, I’ll give a response from one angle. In the event of an EMP attack or a Coronal Mass Ejection from the sun which devastates solid-state electronics and the electric power grid, it would be possible for rudimentary (Morse code) radio communications (transmitting and receiving) to be restored by citizens having access to the basic materials of wire, batteries, magnets, steel food cans, oxidized metals or fool’s gold (or certain other crystal minerals), aluminum foil, and sheet plastic, for example. If you’ve got an automobile ignition coil, you’re going to have an even better transmitter. Such materials are easy to scrounge up. You might even get really lucky and find a hobbyist’s cache of old discrete components, such as vaccuum tubes, resistors and capacitors. Then you could do voice communications. So, if by reliable you mean the ability to establish a basic functional level of mass communications for an appreciable distance with a very modest amount of technological expertise, a small amount of time to assemble, and simple raw materials, I would say that under these conditions at least, the answer is yes. ",
            "date": "Answered June 14, 2017",
            "views": "270",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ali Elgin",
                    "user_href": "/profile/Ali-Elgin"
                },
                {
                    "user_id": "Gerard Perera",
                    "user_href": "/profile/Gerard-Perera"
                },
                {
                    "user_id": "Arzu Abasov",
                    "user_href": "/profile/Arzu-Abasov"
                }
            ]
        }
    ]
}