{
    "title": "Is technology good for kids in the future? - Quora",
    "tags": [
        "Future Kids",
        "College Advice for Careers",
        "Children",
        "Technology",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Preetesh Bora",
                "href": "/profile/Preetesh-Bora"
            },
            "answer_text": "Technology will always be good to some extent for future generations. Its should help our life instead of affecting it. That's what is not happening. Technology will be so advanced in coming decade that life will be more of mechanical one. While writing this just reminds me of , “I love this world because it is imperfect. It is imperfect, and that's why it is growing; if it was perfect it would have been dead. Growth is possible only if there is imperfection. I would like you to remember again and again, I am imperfect, the whole universe is imperfect, and to love this imperfection, to rejoice in this imperfection is my whole message.” So where there will be perfection (as with growing technology) in lives for future generations there will be boredom. They will not be able to cherish life to extent they should be. ",
            "date": "Updated March 23, 2016",
            "views": "261",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saurabh Bora",
                    "user_href": "/profile/Saurabh-Bora"
                },
                {
                    "user_id": "Nishit Shukla",
                    "user_href": "/profile/Nishit-Shukla-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mona Nahmias",
                "href": "/profile/Mona-Nahmias"
            },
            "answer_text": "Like anything else technology needs education. How to use it to our own benefits, how to apply it in everyday life, for future employment. It has its dark side too, point them to the kids, and tell them why it is wrong, and how to avoid them. ",
            "date": "Answered February 11, 2020",
            "views": "105",
            "upvotes": " Answer requested by Ayad Nadum Alani"
        }
    ]
}