{
    "title": "Is there a sensor that could detect the touch of a fabric? - Quora",
    "tags": [
        "Sensors",
        "Fabrics and Textiles",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajiv Vasudev",
                "href": "/profile/Rajiv-Vasudev-1"
            },
            "answer_text": "Yes there are sensors who can detect the touch of fabrics and identify the presence of fabric further more the sensors can identify the fabric structure colors and composition also. The sensors work on tactile and visual imaging. Tactile:A tactile sensor is a device that measures information arising from physical interaction with its environment.The advanced tactile sensing is able to feel the fabric like human hands. Visual Imaging: cameras with high resolution capture the images ,processes them to microscopic analysis (Every fibre appear different in microscope compares it with already stored data for assessment. Colors are processed and checked through spectrometers. Both are very much useful for spying and military operations to check the presence of humans. More details are on What sensor can be used to detect clothing or fabric? ",
            "date": "Answered August 7, 2018",
            "views": "364",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek Mishra",
                    "user_href": "/profile/Abhishek-Mishra-1307"
                },
                {
                    "user_id": "Mihir Sharma",
                    "user_href": "/profile/Mihir-Sharma-79"
                },
                {
                    "user_id": "Sunil Karotiya",
                    "user_href": "/profile/Sunil-Karotiya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Choudhary",
                "href": "/profile/Abhishek-Choudhary-10"
            },
            "answer_text": "Sensor can detect something but can not differentiate the stuff explicitly to that much detail. An Ultrasonic based sensor or IR based sensor can detect that there is something obstruction, but never gives you the detail about their intrinsic properties. For that purpose, a human intelligence at operator console is required to review the detail of object. For example, Skilled police in security checkup at airport, skilled doctors at display in Ultrasonography of womb, skilled operator at flaw detection in track. These days smart sensors can at least give you the detail of acoustic impedance of medium. Acoustic impedance is the resistance or degree of attenuation of any penetrating wave. Higher the attenuation, more dense the substance is. Using this feature you can differentiate cloth among other types of cloth, but not cloth among different types of stuffs. ",
            "date": "Answered December 13, 2017",
            "views": "421",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elina Mukherjee",
                    "user_href": "/profile/Elina-Mukherjee"
                },
                {
                    "user_id": "Abhinav Akash",
                    "user_href": "/profile/Abhinav-Akash-6"
                },
                {
                    "user_id": "Shameel",
                    "user_href": "/profile/Shameel-4"
                }
            ]
        }
    ]
}