{
    "title": "Is there a legitimate reason for banning Huawei products? - Quora",
    "tags": [
        "Bans and Banning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Udit Garg",
                "href": "/profile/Udit-Garg-87"
            },
            "answer_text": "Today people are divided into two groups: one group is saying ban is right and second says ban is wrong. According to second group people, US has ban Huawei so that Huawei progress should slow down and company shut down but this is wrong reason to support Huawei. I am giving link of 9 cases which have been mist potential reason behind this ban. 1. Motorola Issue: Ex-Motorola engineer guilty of stealing trade secrets 2. Miraj Diamond Glass: Huawei Sting Offers Rare Glimpse of the U.S. Targeting a Chinese Giant 3. PanOptis Judgement: https://www.mintz.com/sites/default/files/media/documents/2019-03-21/PanOptis%20v%20Huawei%20-%20Final%20Judgment.pdf 4. SolarEdge Issue: SolarEdge Files Patent Infringement Lawsuit Against Huawei and Distributor in Germany 5. Cisco Lawsuit: Cisco sues Huawei over intellectual property 6. T-Mobile Robot Theft: https://www.nytimes.com/2014/09/06/business/t-mobile-accuses-huawei-of-theft-from-laboratory.html 7. Nortel Networks Issue: Nortel hacked to pieces 8. Apple Trade Secrets: How Huawei Targets Apple Trade Secrets 9. Vodafone Networks: Vodafone Found Hidden Backdoors in Huawei Equipment After reading all these cases, no one should oppose ban imposed on Huawei. Any edit is welcome. ",
            "date": "Answered June 9, 2019",
            "views": "351",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nong Lao",
                    "user_href": "/profile/Nong-Lao-5"
                },
                {
                    "user_id": "Ishwor Gurung",
                    "user_href": "/profile/Ishwor-Gurung-7"
                },
                {
                    "user_id": "Yashwant Choudhary",
                    "user_href": "/profile/Yashwant-Choudhary-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roy Tong",
                "href": "/profile/Roy-Tong-10"
            },
            "answer_text": "Dirty trump political smear campaign against HuaWei and China is forcing all Chinese and American companies to break all partnerships and alliances. Yes, HuaWei was already planning for this eventually after ZTE…. Currently all android running in China are open source and not google (no Google, YouTube or Google Map…. Replaced by Tencent and Baidu). HuaWei mobile sold in China are all China android and not Google Android. If all China mobile manufacturers could work together with tencent and baidu to come out with a third platform….. google might be forced out of the Mobile OS market (Top 5 android manufacturers beside Samsung are all Chinese) Personally I was lucky to get my hands on HuaWei China android mobile and I find the user experience more fulfilling because of richer applications and also free movies and music (need to see advertisements, pay then can bypass advertisements) New HuaWei phone would not be running Android Mobile OS in the future release. Even if Trump or google reverse their decision HuaWei and most probably all Chinese mobile manufacturers (maybe even Samsung will take opportunity to dump google android mobile OS) will support a third non-American mobile OS system (Beside Samsung and Apple … the rest of the mobile phone manufacturers are all Chinese) Also these events by trump shows to Chinese technology companies that they need to be self reliant and would start to create a non American eco-system. Currently HuaWei is starting to mass produce together with Taiwanese chips sets that will replace Qualcomm, Intel, Broadcom and others Thus in the future Chinese companies would be forced to produce mass quantities of chips and OS and software and unless American companies can compete and replace against low cost, high flexibility manufacturing of infrastructure intense China connected to the world, American would gradually be replaced by the Chinese. Most probably American would start their steep demise against the world starting from 5G deployment onwards (HuaWei is about 2 years ahead of her competitors, 1/3 the prices, full of features and applications and high customer services. Case in point …. Australia who ban Chinese technologies in NBN (fibre broadband), Singapore (both countries have about the same costing …. Source : Singtel and Optus) …Australia: 50 Mbps cost about $60-$70, pay as you use digital line and no free applications. Singapore uses Chinese technologies: 500 Mbps cost $29, free unlimited talk time on digital line, a lot of free applications . Thus USA would follow the scenario … more expensive and lower quality 5G network… US consumers and corporations would pay more for lower quality and 2 years behind products and services. Remember project prism (Edward Snowden via Wikileaks) …. It was the American government (NSA, FBI, CIA, US military) and American companies (Microsoft, Facebook, Twitter, Yahoo, Apple, Goggle, Intel, Qualcomm, Networks, Junipter Networks, AT&T, IBM, Dell, HP, UPS and a lot more) that was caught red handed hacking, spying and stealing source codes and information globally. Think about it how is it possible after years and years of hacking, spying and stealing of information from all companies globally, Chinese governmental agencies, Chinese military, Chinese universities, innocent Chinese citizens that the Americans could not provide any single bit of evidence to support their smear campaign. ",
            "date": "Answered May 21, 2019",
            "views": "18",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Feijun Yan",
                    "user_href": "/profile/Feijun-Yan"
                },
                {
                    "user_id": "Amit Jain",
                    "user_href": "/profile/Amit-Jain-335"
                },
                {
                    "user_id": "Leng Tang",
                    "user_href": "/profile/Leng-Tang-3"
                },
                {
                    "user_id": "Béa Tremblay",
                    "user_href": "/profile/Béa-Tremblay"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Zlatan-Klein"
                },
                {
                    "user_id": "Ian",
                    "user_href": "/profile/Ian-1238"
                },
                {
                    "user_id": "Chee Keong Lim",
                    "user_href": "/profile/Chee-Keong-Lim-2"
                },
                {
                    "user_id": "Bruce Hung",
                    "user_href": "/profile/Bruce-Hung-2"
                },
                {
                    "user_id": "Chen Jin",
                    "user_href": "/profile/Chen-Jin-12"
                },
                {
                    "user_id": "Liping Zhang",
                    "user_href": "/profile/Liping-Zhang-29"
                }
            ]
        }
    ]
}