{
    "title": "Is the OnePlus Nord N10 worth buying in India? - Quora",
    "tags": [
        "Smartphones in India",
        "Smartphone Shopping",
        "OnePlus (company)",
        "OnePlus One (product)",
        "Mobile Phone Recommendations",
        "Shopping",
        "Android (operating system)",
        "Technology",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Techyshaala In",
                "href": "/profile/Techyshaala-In"
            },
            "answer_text": "OnePlus Nord N10 5G was introduced in Europe. Oneplus Nord N10 5G comes with hole-punch displays and come with stereo speaker support. Oneplus Nord N10 5G initially going to be sold in Europe, though OnePlus has confirmed availability in North America at a later stage. OnePlus has not announced availability or pricing for the Indian market yet. It’s a downgraded version of OnePlus Nord.  Specifications: Display: 6.49-inch FHD+ IPS LCD Display With 90Hz Refresh Rate (Corning Gorilla Glass 3) Processor: Qualcomm Snapdragon 690G (downgraded version of 765G) Memory: 6GB LPPDR4x RAM + 128GB UFS 2.1 Storage, miscroSD Card support Camera: 64MP+8MP+2MP+2MP | 16MP Front camera Battery: 4300mAH Rear-fingerprint scanner Pros: 3.5mm JackmicroSD card slotStereo SpeakersBattery Is decent with 30T warp chargerCons: Plastic bodyNo AMOLED displaymacro & monochrome cameras are uselessTalking about the price, in Europe, it is around GBP 329 (about Rs 30,000). Will this phone be launched in India? So the first thing is that phones are expensive in Europe and their prices in India are very low. If this phone is launched in India between 15-20k then we can think about that, but if this phone goes above 20K then it is not worth buying. There are many options in the market that provide better performance and features. Now let’s see at what price OnePlus Nord N10 will be launched in the Indian market. After that, we can decide whether it is worth it or not? ",
            "date": "Answered October 29, 2020",
            "views": "96",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anoop Antony",
                    "user_href": "/profile/Anoop-Antony-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shakti S",
                "href": "/profile/Shakti-S-10"
            },
            "answer_text": "Simple answer is no for this price you can get very good smartphones from realme and Xiaomi . I used MIUI, oxygen os and realme UI there is not much difference in fluidity but if you want close to stock Android then you can choose realme too . If you don't want privacy and satisfied with ads then you can go for Xiaomi too. ",
            "date": "Answered October 26, 2020",
            "views": "15",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anoop Antony",
                    "user_href": "/profile/Anoop-Antony-19"
                },
                {
                    "user_id": "Chandu",
                    "user_href": "/profile/Chandu-213"
                }
            ]
        }
    ]
}