{
    "title": "Is the Dominican Republic’s technology up to date? - Quora",
    "tags": [
        "Dominican Republic"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lori Reyes",
                "href": "/profile/Lori-Reyes-1"
            },
            "answer_text": "Yes! As for other answers, I know a store in DR that sells the iPhone at the same time is launched in the US, and I guess there are more stores like this as Apple has several official sellers there, also people just order everything online and get them at the same time as in the US. If there is one thing that Dominican Republic is up to date is in technology, virtually everybody has a smartphone, even the poorest person you can imagine has at least a flip phone. The geographical location of the Caribbean makes it easy to transmit the phone signals, and I remember when the cellphones started to boom and everybody had one in DR my parents traveled to several Latin American countries that are supposed to be better off and they were surprised that not everybody (including doctors) had cellphones and it was so difficult to find a phone, while even my siblings and I and the maid in my house in DR had cellphones. Nowadays I don’t know anybody in the DR that with the required money wouldn’t have the same latest technology that people have in developed countries at the same time. Now, if you are talking about healthcare technology for example, you will find the latest technology, but only in private hospitals, the same happens with other kinds of technologies. The government usually makes ridiculous investments in super technological tools and then never give maintenance to them and that makes it look like the country is not up to date, but at a private level and home wise we could be compared to any rich country. ",
            "date": "Answered February 21, 2018",
            "views": "566",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christian Irizarry",
                "href": "/profile/Christian-Irizarry"
            },
            "answer_text": "The DR is emerging as a Technological State (Although not at super speed) The Majority of the Population has access to Phones and Computers although they may not be of the highest quality, The country is still a growing economy though it is one of the fastest growing economies in the american continent! The DR’s Technological Economy and Scene is growing and booming as the Population is rapidly buying phones (Mostly Androids) and Gaming is growing in Popularity, Aswell as the tourism bringing more industrialization!. To answer your question bluntly, The DR’s Technology is well up to date and doing well in its field, It is not the most high on the list but defiently not low or lagging behind.  School Children using Goverment-Funded PC’S. ",
            "date": "Answered February 21, 2018",
            "views": "689",
            "upvotes": "0"
        }
    ]
}