{
    "title": "Is there a way to make my DVD player play Blu-Ray discs? - Quora",
    "tags": [
        "Can I Do X?",
        "What Is the Best Way To Do X?",
        "DVD Players",
        "Blu-ray",
        "DVD"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luc Boulesteix",
                "href": "/profile/Luc-Boulesteix"
            },
            "answer_text": "Optical media such as DVDs, CDs or Blu-rays are basically the digital equivalent of old music records. They have a surface on which is etched various features (pits and bumps) which are used to represent pieces of information.  DVD During the reading process, a laser is projected onto the disk surface while the disk rotates at a fixed speed. The way the light bounces back from the disk allows the player to determine whether it has encountered a pit or not, hence allowing it to read the data on the disc. Modern optical media is expected to have a certain size, with the most common (and largest) form factor being that of the 4.7 inch disk. You can’t really make them larger than that while remaining practical (ask laserdisc). To increase the amount of data on a disc, you need to be able to increase the amount of bumps/grooves on a disc. given the format’s fixed size, this means reducing the size of said features (increasing density) is the only option. Here’s the thing: DVD uses 650nm light for its laser. That puts a hard cap on how small of an object we can resolve. In order to make these features smaller, we also need to make the reading laser’s wavelength smaller as well. Blu-ray disks thus use 405nm light for its laser. This allows a Blu-ray player to resolve the smaller on-disc features, where a DVD or CD player could not. That’s why DVD players can’t play Blu-ray discs: the mechanisms for reading/writing data are completely different and incompatible. Not to mention that Blu-ray’s main advantage is higher resolution video thanks to the format’s greater capacity (25GB single sided vs 4.7GB). But DVD players don’t support HD video in the first place and often run on SCART or composite. Even if you got a Blu-ray disc working in the first place, you’d probably still be forced to watch the content in Standard definition. ",
            "date": "Answered February 21, 2019",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Derek Jacobsen",
                    "user_href": "/profile/Derek-Jacobsen-7"
                },
                {
                    "user_id": "Robert Storms",
                    "user_href": "/profile/Robert-Storms-1"
                },
                {
                    "user_id": "Daniel Dillon",
                    "user_href": "/profile/Daniel-Dillon-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lizz Grey",
                "href": "/profile/Lizz-Grey"
            },
            "answer_text": "Let’s just say, you can’t. Reasons are explained clearly by the former answers. I’m here to provide some solutions. Solution 1: Buying a Blu-ray Player (Duh) Solution 2: Playing Blu-ray disc on PC. you need an internal or external blu-ray drive on your PC and a decent Blu-ray player software to apply this solution. Here are some player software recommendations, among which, Leawo Blu-ray Player is free and can play Blu-ray discs perfectly fine as far as I know. You can also try the others. Solution 3: This is a little advanced solution. You can actually “Copy” the content on your Blu-ray disc to a DVD disc in order to play it with your DVD player later. To apply this solution, you need a professional software like Leawo Blu-ray Copy. They are having a Summer sale and if you buy now you may be able to save some bills. This is the link, Leawo 2018 Summer Giveaway Gifts & Half-Price Ultimate Bundles ",
            "date": "Answered May 22, 2018",
            "views": "176",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alec Rogers",
                    "user_href": "/profile/Alec-Rogers-1"
                },
                {
                    "user_id": "Random Human",
                    "user_href": "/profile/Random-Human-63"
                },
                {
                    "user_id": "Hilarie Echavarria",
                    "user_href": "/profile/Hilarie-Echavarria-1"
                },
                {
                    "user_id": "Brígida Cury",
                    "user_href": "/profile/Brígida-Cury"
                },
                {
                    "user_id": "Jcdough .",
                    "user_href": "/profile/Jcdough"
                }
            ]
        }
    ]
}