{
    "title": "Is there any connection between obsolescence and planned obsolescence? - Quora",
    "tags": [
        "Planned Obsolescence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Murton",
                "href": "/profile/Peter-Murton"
            },
            "answer_text": "Sure, there’s ‘any connection’. Obsolescence is when something is no longer useful. For example, you could choose to buy a horse to ride to your office job in the city, but that would probably be kindof silly for most. Cars have obsoleted horses for urban commuting. Planned obsolescence is when a company intentionally makes their own product obsolete in order to sell more of their next product (forcing repeat business.) Batterygate: How Apple secretly slowed down older iPhones and why it's such a big deal Obviously both involve, well, ‘obsolescence’. But the former is natural/accidental/competitive, while the latter is sinister, destructive, and abusive of monopolistic power. (Apple obviously believes that due to the power of their monopolistic ‘moat’ if they cripple the existing base of iPhone 6, those unknowing victims will choose to replace with an iPhone 8 or X instead of one of their competitors.) ",
            "date": "Answered August 23, 2019",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Micheal Chang",
                "href": "/profile/Micheal-Chang-1"
            },
            "answer_text": "Is there any connection between obsolescence and planned obsolescence? Obsolescence is when something existing is displaced by something new - FAX machines displaced TELEX machines which in turn was displaced by the internet. Planned obsolescence is a buzz phrase people like to use, but in reality it’s just another way of saying something is made by “cutting corners” in order to reduce cost - you wouldn’t say a cheap pair of shoes is planned obsolescence just because they don’t last, so why would you say a car is planned obsolescence? You get what you pay for, so buyer beware. ",
            "date": "Answered August 22, 2019",
            "views": "18",
            "upvotes": "0"
        }
    ]
}