{
    "title": "Is Tim Cook a good CEO like Steve? - Quora",
    "tags": [
        "Tim Cook (Apple CEO)",
        "Steve Jobs",
        "Chief Executive Officers",
        "Apple (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josh Osborne",
                "href": "/profile/Josh-Osborne-6"
            },
            "answer_text": "Thanks for the A2A. Tim Cook is a good CEO. Tim Cook is not a CEO like Steve Jobs. I’m very sure Steve knew this when he picked Tim. I’m pretty sure Jobs thought Tim was the best available CEO, and figured Tim would run Apple in a very different style. I’ve heard from a number of people, but specifically from Ive just a few days after Steve’s death that Steve frequently talked about how Disney was all but paralyzed after Walt’s death with everyone thinking about “What Walt would have done”, and “What Walt would have wanted”. He specifically told people not to try to do what Steve would do, but just to do what they think is right. So I’m very sure that Steve not only thought Tim would be a CEO unlike Steve, and that Steve thought that would be a good idea. That said, Tim is more open, he lets partners and customers know very little about future plans, but far far more then Steve ever did. He talks publicly about morals, ethics, and responsibilities, things Steve seldom did. Tim delegates far more to his employees then Steve ever did. I have never ever seen a bug with 200+ dups get closed with “Tim wants it that way. Not to be fixed”; I have seen multiple such bugs with “SJ wants it that way; Not to be fixed” Steve on the other hand was deeply involved with product design and marketing (in fact at Apple marketing and design are tightly linked…marketing isn’t something that happens after the product ships, it helps shape the product, ever wonder why so many Apple products actually solve a problem? That’s why!) Steve could mesmerize an audience. “Reality Distortion Field” isn’t a fun phrase people made up, it is a real thing (well, ok, and a fun phrase!) ",
            "date": "Updated April 25, 2017",
            "views": "107",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joni Lindemer",
                    "user_href": "/profile/Joni-Lindemer"
                },
                {
                    "user_id": "Matheus Salmi",
                    "user_href": "/profile/Matheus-Salmi"
                },
                {
                    "user_id": "Richard Golding",
                    "user_href": "/profile/Richard-Golding"
                },
                {
                    "user_id": "Sugam Agarwal",
                    "user_href": "/profile/Sugam-Agarwal-24"
                },
                {
                    "user_id": "Jiguel",
                    "user_href": "/profile/Jiguel"
                },
                {
                    "user_id": "Lee Brixton",
                    "user_href": "/profile/Lee-Brixton"
                },
                {
                    "user_id": "Jaya Hurip",
                    "user_href": "/profile/Jaya-Hurip"
                },
                {
                    "user_id": "Kenny Duthie",
                    "user_href": "/profile/Kenny-Duthie"
                },
                {
                    "user_id": "Ken Carriker",
                    "user_href": "/profile/Ken-Carriker"
                },
                {
                    "user_id": "Barbiana Washington",
                    "user_href": "/profile/Barbiana-Washington"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Barrett",
                "href": "/profile/Jack-Barrett-32"
            },
            "answer_text": "Well seeing as he grew Apple to a $1.4 trillion company I think it’s safe to say he’s doing very well indeed. Many criticise Tim for only caring about profits, but the reality is if that were true Apple would be in the same dire situation it was in 1995 selling literally whatever they could just to make some sort of profit, even if it meant PowerBooks with buggy software and potentially fire hazardous batteries. Steve was a great visionary and experimentalist, but his uneven product successes and inability to think rationally about business strategies inevitably led to his departure in 1985. After Apple acquired NeXT in ‘97 as a last minute attempt to save the company, Steve came back and hired Tim Cook within a year, who immediately solved Apple’s uneven supply problem by partnering with Foxconn. How? Because Tim is an incredible business leader, since Steve’s passing he’s been behind even more truly innovative products and technology like Face ID, the iPad Pro, AirPods, the 2019 Mac Pro, and of course the Apple Watch, which to date has saved countless lives and has been the #1 watch in the world consecutively. Plus all the money he’s invested into R&D and the millions donated to charitable efforts. Tim is also behind one of the main reasons I and millions of others worldwide use Apple products, privacy. He was the one who ensured preserving user privacy was the main principal behind all of their efforts, from Safari’s tracking limiter, the Secure Enclave, industry leading biometrics, limited and encrypted data collection, end-to-end iMessage encryption, on device processing, and of course not creating a backdoor entrance to their users’ data even when the United States government tells them to, twice. Many people say things like “If Steve was still alive the iPhone would still have a headphone jack”, but let’s not forget Steve removed the floppy disk, the SCSI port, and the ADB port from the iMac G3 in ‘98, that of which many Mac users used regularly. The 2008 MacBook Air also did away with the Ethernet port, the CD/DVD optical drive, and the FireWire port, the MacBook Pro of that same year also lost one of its FireWire ports too. So Steve was no stranger to removing features, I have no doubt the headphone jack would be removed under his leadership, I mean the original iPhone literally had a proprietary recessed headphone jack.. Seeing as every major smartphone company has gotten rid of the headphone jack and in turn realised their own wireless headphones I think it’s safe to say Tim knew exactly where the industry was going. Tim isn’t perfect, there’s no such thing as a flawless CEO, but just because he’s less quotable and charismatic than Steve doesn’t mean he’s less than. In the real world he’s the leader Apple needs, after all Steve wouldn’t have personally elected him as CEO before his death otherwise. ",
            "date": "Answered February 18, 2020",
            "views": "649",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Richardson",
                    "user_href": "/profile/Ben-Richardson-188"
                },
                {
                    "user_id": "Hamzah Malik",
                    "user_href": "/profile/Hamzah-Malik-1"
                },
                {
                    "user_id": "Călin Alecsandru",
                    "user_href": "/profile/Călin-Alecsandru-2"
                },
                {
                    "user_id": "Cemil Tokatlı",
                    "user_href": "/profile/Cemil-Tokatlı-3"
                },
                {
                    "user_id": "Rodney Lubega",
                    "user_href": "/profile/Rodney-Lubega"
                },
                {
                    "user_id": "Liran Cohen",
                    "user_href": "/profile/Liran-Cohen-26"
                },
                {
                    "user_id": "Ken Carriker",
                    "user_href": "/profile/Ken-Carriker"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Amine-Joestar"
                },
                {
                    "user_id": "James O’Leary",
                    "user_href": "/profile/James-O-Leary-5"
                },
                {
                    "user_id": "Michael Holland",
                    "user_href": "/profile/Michael-Holland-230"
                }
            ]
        }
    ]
}