{
    "title": "Is there a standard method for technology transfer in the US? - Quora",
    "tags": [
        "Technology Transfer",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebecca Zielke",
                "href": "/profile/Rebecca-Zielke-1"
            },
            "answer_text": "Yes and no. There are various existing mechanisms that have been in use for decades. Participating government agencies will have their own method of handling technology transfer because there is no standardized approach. Case studies over the years and even as recently as the 2019 NIST Green Paper “Return on Investment: Unleashing American Innovation” have identified the need to streamline the mechanisms currently in place and identify the best practices that can be implemented government-wide. Prospective applicants can seek additional guidance and clarity from online resources like government websites, Quora, and aShoGi. aShoGi not only provides government information but helpful guides on navigating SBIR, STTR, and related programs. aShoGi resources can be found at: https://www.ashogi.com/ ",
            "date": "Answered July 22, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Luke G",
                    "user_href": "/profile/Luke-G-132"
                }
            ]
        },
        {
            "author_info": {
                "name": "Konstantinos Konstantinides",
                "href": "/profile/Konstantinos-Konstantinides"
            },
            "answer_text": "No, but there are good practices and bad examples. Bad example: XEROX Parc in the 90’s; their UI technology was “stolen” by Apple and Microsoft Good example: Hewlett Packard and HP Labs in the 90’s, they had some of the best and more effective technology transfers between HP Labs and divisions ",
            "date": "Answered July 22, 2020",
            "views": "101",
            "upvotes": "0"
        }
    ]
}