{
    "title": "Is the use of visiting cards decreasing these days? - Quora",
    "tags": [
        "Visiting Cards",
        "Cards"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Sinha",
                "href": "/profile/Rahul-Sinha-113"
            },
            "answer_text": "Yes. Kind of. To survive the present market needs, the format changed but not the purpose. I remember when we used to visit any shop or meeting any specific person, we used to ask them to give their visiting cards or share ours. We do it now as well but the frequency is reduced. They keep visiting cards but you have to be specific to ask them to give their visiting card. Nowadays, if you meeting someone, they wouldn’t ask you for your visiting card but questions like- Are you on Whatsapp?What is your email? Are you on Hangouts?The reasons most of the people ask for social media information because - Go digital. As all areas going digital these days, contact sharing also became digital. Supporting paperless and cashless economy.Easy to store and find. I remember my father used to have this big file in which he used to alphabetically put all visiting cards. Now, all contacts are stored on the phone. A back up is available on email or cloud storage. It became time savvy, cost-effective and effortless. With a few clicks, you able to find a contact#Crowd effect. It is a psychological effect where a human follows the crowd's behavior. What we see, we learn. It shows we can adapt to the changes and learn fast.",
            "date": "Answered February 17, 2020",
            "views": "392",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kaaushik Maity",
                    "user_href": "/profile/Kaaushik-Maity"
                },
                {
                    "user_id": "Ayush Mishra",
                    "user_href": "/profile/Ayush-Mishra-487"
                },
                {
                    "user_id": "Sarath Maya",
                    "user_href": "/profile/Sarath-Maya"
                },
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srikrishna Raajan",
                "href": "/profile/Srikrishna-Raajan"
            },
            "answer_text": "I cannot say an obvious yes or now. I have come across many people thesedays who are seeking and having only electronic identity like vCard (Virtual visiting card), websites, twitter handles and so on. (as it has become convenient to connect) But I also see new websites/businesses started for printing visiting/business cards and other labelled stationeries. The usage has come down as people in/doing business limited/stopped to carry them around to all places. Some think why waste cards by giving them to all people as some might not even going to care (P.S: Should be taken in lighter note as some business cards are printed to be premium which comes at a cost) But say it or not, Humans are still primitive in the way the brain functions; and they are attached to visible and tangible materials. Giving a business/visiting card to a person by hand always have a higher note and adds value when compared to sharing a link/vCard over phone; people may remember the person when they see the card again and sometimes the messages/links are forgotten. Have a good day! ",
            "date": "Answered April 11, 2020",
            "views": "149",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        }
    ]
}