{
    "title": "Is transitioning out of oil and into renewable energy a bad idea? - Quora",
    "tags": [
        "Renewable Energy",
        "Wind Energy",
        "Crude Oil",
        "Natural Gas",
        "Solar Energy",
        "Oil (fossil fuel)",
        "Sustainable Technology",
        "Oil and Gas Industry",
        "Alternative Energy"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Mook",
                "href": "/profile/William-Mook"
            },
            "answer_text": "The cost and availability of energy determines the productivity of an industrial economy and everyone’s income. So, it very much depends on how its done. A good approach is to make hydrogen from sunlight and rain water with new type of solar panel at $70 per ton and using hydrogen to synthesize alkanes from atmospheric carbon dioxide at less than $5 per barrel and offer hydrogen at $2.50 per barrel equivalent to promote conversion. This would put legacy fuel producers out of business quickly and be a good thing for the economy. A bad approach is to regulate the use of legacy fuel increasing its price in the face of depletion and reducing energy availability while funnelling government money into high priced alternative whilst increasing taxation to pay for it all. This reduces the natural flow of capital into innovative solutions and keeps the legacy producers in business far longer than they ever would be otherwise. We are at present taking a bad approach. We have consistently done things as a nation that helps legacy energy producers at grave cost to society leading to excessive pollution, massive shortages, and huge social costs. For example, in 1956 Shell geophysicist Marion King Hubbert predicted that oil production in the USA would peak in 1970 since oil discovery in the USA had peaked in 1932 already, since it takes 38 years for oil production to match oil discovery. He also predicted looking at the rate of discovery world wide, that oil discovery would peak in 1962 and therefore all things being equal, oil production would peak in 2000. He suggeted that we should look at a program of massive ultra-low-cost nuclear plants that produced hydrogen from sea water at incredibly low cost and with that produce synthetic fuels from hydrogen and stranded coal until such time that we converted our society to use hydrogen directly. This is a simple matter since hydrogen burns under the same conditions as all other fuels in common use. When asked about the looming energy crisis in 1970 AEC Chair Lewis Strauss replied in 1956 that by 1970 energy would be too cheap to meter. He pointed out that the recent hydrogen bomb tests in the Pacific could flatten New York City with a population of 5 million at that time. The bomb costs $5 million and fit in a steamer trunk. $1 per person killed. Project Sherwood, then and still classified, indicated that with minor modifications the process that powered that bomb could be made to supply electrical power with no increas in cost or size. The amount of energy is the same, enough to supply all the energy needs of a New Yorker for 100 years. $1 for 100 years of power. On this basis Strauss concluded that energy by 1970 would be too cheap to meter, and that oil gas and coal companies would be reduced to supplying plastics pharmaceuticals and other similar products in the future as energy would be supplied by more advanced methods by 1970. Project Sherwood’s team was asked to testify before Congress. They tragically died in a helicopter crash during a Pacific bomb test. Strauss himself testified in their stead. However, instead of being asked about Sherwood he was asked about funding irregularities, and forced to quit. Meanwhile Shell fired Hubbert and called his use of the logistic function which is standard procedure in all extractive industries - a theory - and was denigrated in the press. Eisenhower organised a group of oil executives to study the problem and they said that by 1970 the US would get its oil from the Middle East and there would be no problem with that. When Congressman John Kennedy expressed the opinion that we shouldn’t take our advice about the future of energy from oil executives he was ridiculed. JFK replied that if we ignore the future that will put our enemies ahead of us, because they surely will not be taking advice from oil executives. Eisenhower replied no one is ahead of the USA technologically. This was 1957 and a few months later the Russians orbited Sputnik. This embarassed Eisenhower and propelled JFK to the spotlight. JFK won the presidential race in 1960 and famously set our course to the moon. This was to develop the advanced technology the USA needed to stay ahead industrially and meet the challenges of the 1970s. Part and parcel of this program was project NERVA (atomic rocket), NEPA (atomic jet), ORION (clean nuclear pulse). Thee all were incarnations of Strauss’ original Sherwood plan molten salt high temperature reactor (NEPA) 900 Cnuclear light bulb (NERVA) 3200 CICF fusion reactor (ORION) 100,000 C (too cheap to meter) Late November 1962 JFK received a report that the discovery rate of oil had peaked according to experts, confirming Hubbert’s prediction. We needed to take action to go off gold and embrace the petro-dollar and take military and intelligence action to make sure the USA got the lion’s share of the oil wealth going forward. In response JFK went to LANL and gave a speech on the future of energy detailing his hope that by 1970 we would depend on ultra-low-cost nuclear power and oil coal and gas would be of secondary importance in the production of plastics and other products.  Late November 1963 JFK was gunned down in Dallas Texas and the oil man Lyndon Baines Johnson ascended to the presidency. His first act as president was to curtail the 1964 budget of NASA, constrain its vision to landing a man on the moon, from a far wider vision of space and industrial development, and to re-classify and reduce unding for NERVA, NEPA and ORION. In 1964 he signed a UN mandated NPT which prohibited nuclear explosions of any type for any reason in space - effectively ending ORION. https://sfwriter.com/dyson-orion-death-of-a-project.pdf ",
            "date": "Answered October 23, 2020",
            "views": "151",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Micheal Vargas",
                    "user_href": "/profile/Micheal-Vargas-1"
                },
                {
                    "user_id": "Clement Liu",
                    "user_href": "/profile/Clement-Liu"
                },
                {
                    "user_id": "Salvatore Barrera",
                    "user_href": "/profile/Salvatore-Barrera"
                },
                {
                    "user_id": "Andrew Vanessa",
                    "user_href": "/profile/Andrew-Vanessa-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Hutchinson",
                "href": "/profile/Edward-Hutchinson-12"
            },
            "answer_text": "It is an extraordinarily good idea. It needs to be done carefully. Transportation is the one largest opportunity. In the US 200 million cars and light trucks are now using gas or diesel. They have an average expected useful life of 16 years. To meet air quality and CO2 goals for 2035, approximately half of that fleet should be replaced with EV’s that are charged from renewable generation. It would be better to move toward a masss-transit public transportation system as many European countries have done but that is very unlikely in the US. If 100 million new EVs will charge an average of 8 or 9 kWh per day that is about one trillion kWh per day. If an average PV or wind system generates for the equivalent of four hours per day at full power, then 250 GW of renewable generation will need to be added to the system over the next decade and a half. That is an installation rate of about 17 GW per year. In 2019 13 GW of PV were installed (not counting small non-commercial residential installations). Wind turbine installations in the US have been averaging about 6GW per quarter over the last year or two. So it is very possible that the generation capacity for charging 100 million EVs could be available by 2035. To do accomplish that level of increased electrical consumption, it will be necessary to massively alter the grid infrastructure, and even the model of generation, away from the 19th century vision of massive base-load generation and long distance transmission to load centers. A 21st century model may require massively distributing small generation closer to load centers, and including a large amount of battery storage, and smart grid load management. Rather than adjust the generation to match the load, some part of the load may need to be managed to match the available generation. With modern computers, the internet, and the battery and inverter systems we now have it would be possible, and those resources will continue to improve if there is a demand for them. I believe there will be. ",
            "date": "Answered October 23, 2020",
            "views": "37",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charlie Richmond",
                    "user_href": "/profile/Charlie-Richmond-5"
                },
                {
                    "user_id": "Brian Donovan",
                    "user_href": "/profile/Brian-Donovan-13"
                }
            ]
        }
    ]
}