{
    "title": "Is there any chance to see laptops in which we can insert SIM cards? - Quora",
    "tags": [
        "SIM Card Advice",
        "Aadhaar Cards",
        "Prepaid SIM Cards",
        "SIM Cards",
        "Cellular Service Providers",
        "Laptops",
        "Computer Hardware",
        "Computers",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Williamson",
                "href": "/profile/John-Williamson-263"
            },
            "answer_text": "I own an old Samsung NC10 Netbook, dating from 2008, which has a space for a SIM card, and was sold at a reduced price for a while by one of the cellphone service providers in the UK as a “special”. It is a waste of time, as the SIM can not be used for voice calls, and sharing the internet connection requires the computer to be fully turned on. I very quickly switched to using an external 3G based dongle, at first, one that connected by USB, and as soon as they became available at a sensible price, one which connected using Wifi. Both performed faster and more reliably than the built in 3G on the Netbook. Laptops with built in 3G or 4G capability are available to order from most makers. ",
            "date": "Answered October 27, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pauli Vaara",
                    "user_href": "/profile/Pauli-Vaara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dmytro Fadyeyenko",
                "href": "/profile/Dmytro-Fadyeyenko"
            },
            "answer_text": "I had some laptops that either had fully functional GSM/CDMA module with a slot for SIM card, or a space for such module. At least in one case that slot was accessed internally only (one had to open the case to insert SIM card), at least in two other cases a slot was on a side of the laptop. I never used these functionalities, because I either had CDMA to WiFi router with good Internet tariff, or could put my phone into Wi-Fi hotspot mode when I had unlimited Internet on it. So I just did not have real reason to pay for additional account. I suppose however that someone would prefer to pay for additional line, or make their employer to pay for it, rather then use an external device each time. ",
            "date": "Answered October 25, 2020",
            "views": "99",
            "upvotes": "0"
        }
    ]
}