{
    "title": "Is there any cure for COVID-19? - Quora",
    "tags": [
        "COVID-19 Treatments",
        "COVID-19 (2019-2020)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikhil Chaudhary",
                "href": "/profile/Nikhil-Chaudhary-85"
            },
            "answer_text": "When the whole world is on the lookout for one miracle drug to cure Covid19, 80% of the people are getting healed by their immunity. The answer for the rest of the 20% also lies in strengthening their immune system to fight back this miniscule monster creating havoc on humanity. All the people who are dying are mostly aged people, people with low immunity and WHO announced that diabetics are at a higher risk of Covid19. Does it ring a bell ? Even the doctors and nurses who contracted Covid19 were known to be working non stop 24 x 7. That means they were under very high stress levels. And high stress puts our immune system to sleep. Even after contracting Covid19 they did not stop working. Salute to their dedication but ultimately it took over their lives. In the 14th century the bubonic plaque mostly from 1347–1351, wiped out 50% of teh European population in just 4 years. This was also the end of the clergy supremacy and rise of science and art in the world famously known as the 'Rennaissance Revolution'. It opened people's mind towards logical thinking and helped them getting away from blind following of the clergy and religious leaders. I guess this time around it will be the end of blind following of the food industry, medical industry, technology industry which hire marketing giants to push untruth into our society only to sell their products. Anyways coming back to the cure part. There is an aggressive search for a medicine and also a vaccine for covid19. Vaccines are given to healthy people as a precaution so that they do not contract the actual infection. Vaccines are like dead bacteria and viruses (not exactly but for ease of understanding you can take it that way). When they are injected in the body, they do not create any infection or harm but our body reacts to it as if it is a real infection. In the process our body develops antibodies to it which will also immediately be produced if our body contracts real live virus or bacteria. But do you see that even in the case of vaccines it is ultimately the immune system that fights ? So here are a few tips that help immune system fight such infections: Vitamin C - This is needs by our immune system cells to navigate and kill the antigens. Precisely Neutrophils which make up to 70% of our innate immune system in terms of cells, need very high concentration of Vitamin C to function. Gooseberries, green chily, vegetables and fruits and everything that contain Vitamin C.Sunlight - Vitamin D and high temperatures are both very strong in fighting infections.Sleep - Stress puts your body in emergency mode. During emergency the body is prepared to fight the problem at hand to survive and all other issues can be handled later. For eg if there is a fire in the room, the body will prefer to save us by running out of the building. And any infection in the body can be fought once we are safe. But our stress never comes down and we are unable to fight that infection at all. Sleep destresses us and helps our immune system.Avoid sugar - sugar puts our immune cells to sleep as they eprefer sugar over bacteria. That's the precise reason why diabetics are at a higher risk.Spices and herbs - Spices and herbs are the best vegetables. They are like small packets of strong minerals, antioxidants and vitamins. Like a dose of supplement. Very powerful in promoting immune system and fighting external pathogens.Interaction with soil - the more bacteria and viruses you interact with, the higher the chances of preparong our immune system. The nature acts as a natural vaccine prompting our body to create more and more antibodies of different types. And sometimes when we contract any viruses of bacteria we are already ready with its antibodies because in the past some unharmful bacteria or virus for which antibody were created looked very similar to this dangerous variety. And the same antibody actually works.The immune system is very very powerful and focus on strengthening the immune system. Not on medicine or vaccine. They are only last resorts. Because earlier it was the bubonic plaque, SARS, Bird Flue, this tiem it is Covid19 and next time it will be something else. When you keep running someday it will catch you. But if we stand and fight, we will be prepared and win. Running is always a backup option available. So focus on your health, wellbeing and immunity. Medicine and vaccines are backup options when nothing else works. But hope that situation should not arise. I have been doing webinars on the subject and people who are implementing the learnings are now very comfortable. They feel empowered and not left in the lurch with fear of death. Empowerment is important and I am in a journey to do just that. Nikhil Empowering people with the knowledge of food and health to reverse diseases. ",
            "date": "Answered March 25, 2020",
            "views": "58",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charan Cherry",
                    "user_href": "/profile/Charan-Cherry-172"
                },
                {
                    "user_id": "Siddarth Ganesh",
                    "user_href": "/profile/Siddarth-Ganesh-1"
                },
                {
                    "user_id": "Jane Smith",
                    "user_href": "/profile/Jane-Smith-3005"
                },
                {
                    "user_id": "Ritesh Baranwal",
                    "user_href": "/profile/Ritesh-Baranwal"
                },
                {
                    "user_id": "Johnny Rudick",
                    "user_href": "/profile/Johnny-Rudick"
                },
                {
                    "user_id": "William La Chenal",
                    "user_href": "/profile/William-La-Chenal"
                },
                {
                    "user_id": "Haya Tanvir",
                    "user_href": "/profile/Haya-Tanvir"
                },
                {
                    "user_id": "Swathassi Kondapally",
                    "user_href": "/profile/Swathassi-Kondapally"
                },
                {
                    "user_id": "David Meredith",
                    "user_href": "/profile/David-Meredith-40"
                },
                {
                    "user_id": "Chevendra Venkataramaiah",
                    "user_href": "/profile/Chevendra-Venkataramaiah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christine Laing",
                "href": "/profile/Christine-Laing-6"
            },
            "answer_text": "There is no cure for COVID-19. There are treatments like ventilators and supplemental oxygen which are designed for example to help someone with rotting lungs breathe. There’s intense pain which can be at least helped by painkillers like acetaminophen (Tylenol in the US). There’s also the standard treatments for nausea, diarrhea, and vomiting. There are some anti-viral drugs (Remdesivir) which may have some modest effect in killing the virus. At best it reduces symptoms somewhat. Hydroxychloroquine is turning out to be worthless. It’s possible we may come up with a treatment that almost qualifies as a cure, possibly a cocktail of anti-viral drugs. A vaccine is our best hope but we may not have one for years. Most viruses can not be cured. We can treat HIV positive people with an impressive pile of medical miracles and get their HIV tests to be negative, but a few weeks after they quit their drugs they are as infected as ever. The only real solution we have right now is to isolate so that fewer people get it and then test extensively and track contacts when someone turns out to be positive. If we can do that the virus will become so rare that essentially no one has it. The path the US seems to be choosing is to let everyone get exposed and get it until so many people have had it that most of our contacts will no longer be contagious and the virus will die out. This is not even proven to be possible because we aren’t sure people can’t get it twice. In any case there is likely to be hundreds of thousands of death, millions of people seriously harmed, millions more really sick for a few weeks, and a whole bunch of countries that won’t let Americans visit. Also people will be miserable because almost everyone will lose a loved one or a friend or coworker. ",
            "date": "Answered May 13, 2020",
            "views": "644",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Hollis",
                    "user_href": "/profile/Frank-Hollis"
                },
                {
                    "user_id": "Larry Robinson",
                    "user_href": "/profile/Larry-Robinson-57"
                },
                {
                    "user_id": "Susan Wesner",
                    "user_href": "/profile/Susan-Wesner-1"
                },
                {
                    "user_id": "Jennifer Wright",
                    "user_href": "/profile/Jennifer-Wright-668"
                }
            ]
        }
    ]
}