{
    "title": "Is the US surprised by the Chinese 5G technology timing? - Quora",
    "tags": [
        "5G (wireless communication)",
        "US - China Relations",
        "Telecommunications",
        "Wireless Technology",
        "China",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Hannent",
                "href": "/profile/Bob-Hannent"
            },
            "answer_text": "Anyone who us surprised by the idea that China has moved out ahead in mobile technologies has not been paying attention. The USA has not been a leader in mobile technologies for a long while now and US companies have clearly been slowing down or selling off assets for a long time. You cannot look at Apple or Google and think that they represent the entirety of the market considering how much of their technology and the technology the networks are built from comes from other parties. For years now I have observed there is a trend that lasts centuries in the evolution of countries. A country will rise as the leader of something, it will achieve some dominance on the backs of hard work and sacrifice by their citizens. Then over time those people get tired and the leadership get complacent. Another country takes the baton in that area, innovates and builds their industry based on what came before. Then they follow the same pattern of getting tired and leadership getting complacent, then another country rises. This has happened around the world for the past few thousand years and I don't see it stopping, only accelerating as the world gets faster. Denying that you are no longer the leader in something isn't a way to be strong, attacking those who are leading the way forward doesn't help either. The only way to succeed is to look at what you've got, look at what you can do with it and look for future innovation before you become bankrupt laying on the laurels of the past. ",
            "date": "Answered June 16, 2020",
            "views": "410",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Frank Yang",
                    "user_href": "/profile/Frank-Yang-251"
                },
                {
                    "user_id": "Pooi-Hoong Chan",
                    "user_href": "/profile/Pooi-Hoong-Chan"
                },
                {
                    "user_id": "Chen Junda",
                    "user_href": "/profile/Chen-Junda-8"
                },
                {
                    "user_id": "Mohammad Montazeri",
                    "user_href": "/profile/Mohammad-Montazeri"
                },
                {
                    "user_id": "Keith Jenkins",
                    "user_href": "/profile/Keith-Jenkins-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew McGregor",
                "href": "/profile/Andrew-McGregor-12"
            },
            "answer_text": "I don’t know how they could be, as anyone even vaguely involved with networking standards development has seen 5G coming for many, many years. And it has been quite obvious who is in the driving seat too: Huawei, China Telecom, Tsinghua University and their suppliers. With a supporting cast of European tech companies, and some help from Japan. So, if any organisation or institution or government is surprised, it’s because they haven’t been paying attention. ",
            "date": "Answered June 17, 2020",
            "views": "710",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wee Beng Ng",
                    "user_href": "/profile/Wee-Beng-Ng-2"
                },
                {
                    "user_id": "Wah Ying",
                    "user_href": "/profile/Wah-Ying"
                },
                {
                    "user_id": "Paul McQuesten",
                    "user_href": "/profile/Paul-McQuesten-1"
                },
                {
                    "user_id": "C W CHAN",
                    "user_href": "/profile/C-W-CHAN-1"
                },
                {
                    "user_id": "Danny Wright",
                    "user_href": "/profile/Danny-Wright-35"
                },
                {
                    "user_id": "Johannes Christopher Flieger",
                    "user_href": "/profile/Johannes-Christopher-Flieger"
                },
                {
                    "user_id": "George Ghaleb",
                    "user_href": "/profile/George-Ghaleb"
                },
                {
                    "user_id": "Robert Thornton",
                    "user_href": "/profile/Robert-Thornton-2"
                },
                {
                    "user_id": "Sudarshan Konge",
                    "user_href": "/profile/Sudarshan-Konge"
                }
            ]
        }
    ]
}