{
    "title": "Is the Huawei Mate 30 Pro the best smartphone? - Quora",
    "tags": [
        "Huawei Smartphones",
        "Huawei Devices",
        "Smartphones Recommendations",
        "Huawei (company)",
        "Mobile Phone Recommendations",
        "Android Devices",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashish Kulkarni",
                "href": "/profile/Ashish-Kulkarni-3"
            },
            "answer_text": "No, it isn’t. It uses a rather heavy skin on top of Android, which is bound to start throttling performance some time down the road. Plus they still haven’t figured out the whole Google services obstacle. So performance and software are in question. They still are not at par in terms of photography as either Pixel 4 or iPhone 11. I have gone through multiple comparisons, videos, photo samples, and it just isn’t as point-n-shoot as the other two. Despite having a lot of dedicated hardware they still don’t have the kind of ML/DL expertise that the other two have. Camera shootout: Pixel 4 vs the best smartphone cameras around Here, have some references. Beyond all these very core and fundamental things, it just doesn’t have enough features to call it the “best” smartphone. ",
            "date": "Answered November 5, 2019",
            "views": "105",
            "upvotes": " Answer requested by Ajay Gupta",
            "upvoters": [
                {
                    "user_id": "Milo Cao",
                    "user_href": "/profile/Milo-Cao-3"
                },
                {
                    "user_id": "Gaurav Jey",
                    "user_href": "/profile/Gaurav-Jey"
                },
                {
                    "user_id": "Kirti",
                    "user_href": "/profile/Kirti-221"
                },
                {
                    "user_id": "Ravi Kumar Sharma",
                    "user_href": "/profile/Ravi-Kumar-Sharma-114"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravi Rana",
                "href": "/profile/Ravi-Rana-155"
            },
            "answer_text": "There is no doubt about it. the current flagship Huawei P30 Pro has an outstanding camera with multiple lenses, deft AI capabilities to improve images further and neat features such a slow-motion and night mode. The Mate 30 Pro takes all this to a new level with four rear cameras: a 40MP stills camera, another 40MP sensor designed for video, 8MP telephoto camera and 3D depth-sensing camera for grabbing depth information fast to improve low light performance and features like portrait mode. ",
            "date": "Answered September 23, 2019",
            "views": "122",
            "upvotes": " View 4 Upvoters"
        }
    ]
}