{
    "title": "Is Twitter dying or will it die soon? - Quora",
    "tags": [
        "Twitter (company)",
        "Twitter (product)",
        "Technology Trends",
        "Social Media Marketing",
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charlie Goldstein",
                "href": "/profile/Charlie-Goldstein"
            },
            "answer_text": "Dying? Well lets hope so. Twitter has several problems( in addition to still being in existence). 1)Its basis is vacuousness. And conceptually it sneers at the general public. Popularity is all perception, smoke and mirrors. You can buy followers. But the so called popular accounts are very likely nowhere near as popular as they are portrayed. I once found I was “following” Hillary Clinton ie some sort of autofollow. Likewise I’m bombarded with George Soros tweets even though I’ve blocked him 4 times. Try searching for Tommy Robinson and you’ll find it tough. 2)Shadow banning. If you don’t tow the globalist-liberal agenda, your posts are WAY down the feed engine rankings. Or removed entirely. No matter how popular you are. 3)Double standards. ISIS terrorists and the like are allowed free platform. As are Nazis. Yet post a link from the bible on homosexuality and you can get banned. Post government crime stats on immigrants or homosexuals = ban. Question an American government employees on their Russophobia - another ban.Question immigration policy, criticise radical Islam - ban! Twitter was sold to us as a communication tool. In truth its an anticommunication tool. Really its a new media propaganda product designed to manipulate and suppress public opinion. Think another Huffington Post. Hell it even works with 3rd world dictatorships to ban their dissidents! BTW Facebook also exhibits these traits. Twitter is nothing but a fraud. Why built a brand on Twitter only for fanatics and bigots to delete your account? ",
            "date": "Answered June 20, 2018",
            "views": "96",
            "upvotes": " View 76 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Leimer",
                    "user_href": "/profile/Paul-Leimer"
                },
                {
                    "user_id": "Terri Towel",
                    "user_href": "/profile/Terri-Towel"
                },
                {
                    "user_id": "Shubham Kumar",
                    "user_href": "/profile/Shubham-Kumar-280"
                },
                {
                    "user_id": "Paras Jain",
                    "user_href": "/profile/Paras-Jain-684"
                },
                {
                    "user_id": "Lee Meena",
                    "user_href": "/profile/Lee-Meena-1"
                },
                {
                    "user_id": "Natrix Nacken",
                    "user_href": "/profile/Natrix-Nacken"
                },
                {
                    "user_id": "Baron Tait",
                    "user_href": "/profile/Baron-Tait-1"
                },
                {
                    "user_id": "Chip Swinson",
                    "user_href": "/profile/Chip-Swinson"
                },
                {
                    "user_id": "Andrey Humski",
                    "user_href": "/profile/Andrey-Humski"
                },
                {
                    "user_id": "Aran Abhishek",
                    "user_href": "/profile/Aran-Abhishek"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gail Gardner",
                "href": "/profile/Gail-Gardner"
            },
            "answer_text": "I don’t know why people keep asking if Twitter will die soon. While they have not managed to successfully monetize, Twitter was created by and is supported by people who are obviously willing to keep it running. Influencers use it and none of my collaborators has stopped using it. Journalists and PR agencies are using it. Politicians are using it. The last time I updated my Quora bio for Twitter questions I had 98.2k followers. I don’t know the date, but it wasn’t that long ago. Now I have 103k followers. So it doesn’t sound to me like Twitter is dying. Like Facebook, they are censoring more and they are actively deleting accounts. For example, The CEO of Twitter Had His Account Suspended on Twitter, possibly by one of their algorithms. Throwing people out because of something they tweeted or retweeted in the past could cause them issues. If they delete enough influential people, maybe those people can get users to move somewhere else. But there really isn’t another media-backed social media platform with the benefits Twitter provides. People need to understand that some sites have the blessing of the wealthy elite who create and sustain platforms like Facebook, LinkedIn, Twitter, Quora, Reddit, etc. Independent alternatives are unlikely to succeed because they don’t have the financial means to compete against these. Eventually, they do let some of their properties decline (like MySpace) in favor of others. Or they may sell out to companies like Microsoft, Google, or Yahoo!, and the new owners may make a mess of things. But even when that happens, as long as they choose to keep them alive, they go on. No matter how much worse LinkedIn and Skype are because Microsoft bought them, we will still use them unless a better alternative becomes available. And if they decide to ignore them and let them die a long, lingering death, they will. How You Can Tell Which Are Media Backed 1.Their origination story is always “2 guys started the platform in: a) their dorm room or b) their garage.” 2. One or more big corporations offers to buy them, but they don’t sell. 3. Here’s a good one: on the same day, Twitter was mentioned across evening news stories on every channel, in soap operas on TV, on morning news, on sitcoms and even on Oprah. If you believe any PR agency is so good they can get all those properties to talk about their client on the same day, don’t go buying any bridges in Arizona. 4. The media hypes them as the next best thing since sliced bread, and they go public. ( See How to Spot a Pump and Dump - but don’t expect these darlings to ever get accused of that.) 5. Their IPO launches with a big price - and then drops like a rock. 6. They often seem to have no idea how they ever plan to make money, yet they keep growing and running. (Who is paying the overhead and why?) I am always reminded of the parody The Onion did about Facebook: CIA's 'Facebook' Program Dramatically Cut Agency's Costs Yes, there are newer social networks. People use Snapchat and Instagram. But that doesn’t necessarily mean they no longer use Twitter. Many use Facebook primarily to interact with friends and relatives they know IRL (in real life). Some use Twitter as though it were chat and only talk to people they already know. But many use Twitter to interact with people they do not already know. Maybe Snapchat and Instagram can be used for that; I don’t know because I don’t choose to use mobile devices. Influencers use a lot of different social networks. Which one we use most varies over time. Twitter has not declined in usage among collaborators I know. They still use it even though they may favor Facebook or Pinterest or LinkedIn or something else. ",
            "date": "Answered November 25, 2016",
            "views": "67",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raiontz",
                    "user_href": "/profile/Raiontz"
                },
                {
                    "user_id": "Nigel Furness",
                    "user_href": "/profile/Nigel-Furness"
                },
                {
                    "user_id": "John Schwartz",
                    "user_href": "/profile/John-Schwartz-20"
                },
                {
                    "user_id": "Shawn Mahi",
                    "user_href": "/profile/Shawn-Mahi"
                },
                {
                    "user_id": "Shawn Schmidt",
                    "user_href": "/profile/Shawn-Schmidt"
                },
                {
                    "user_id": "Gayle Washburn",
                    "user_href": "/profile/Gayle-Washburn-1"
                },
                {
                    "user_id": "Garrett Atkins",
                    "user_href": "/profile/Garrett-Atkins-4"
                },
                {
                    "user_id": "Karym Bentebbal",
                    "user_href": "/profile/Karym-Bentebbal"
                }
            ]
        }
    ]
}