{
    "title": "Is technology superior to politics? - Quora",
    "tags": [
        "Philosophy",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gustaf Broman",
                "href": "/profile/Gustaf-Broman"
            },
            "answer_text": "A set of questions that the average person can’t easily be persuaded into changing his mind about. If you accept this definition of politics, statements such as “politics is overrated” and “the modern world did not come about because of politics” (both of which I’ve been guilty of uttering myself) become rather ridiculous. It is in the same category of lazy thinking as: “if it wasn’t for religion, we would have permanent world peace by now”. And it’s not that these statements are necessarily false. They’re just not very helpful. They’re basically saying “if it wasn’t for HUMANS, we wouldn’t have any problems”. Thing is; humans are pretty neat and we are not disappearing any time soon. Maybe that’ll change when we invent artificial general intelligence and become obsolete. But in the meantime, we’re just gonna have to accept the facts: That humans are irrational. Especially those who delude themselves into thinking that they’re notThat humans are emotional and ideological. We start wars over insults and shiny objectsThat Humans dislike change. Especially regarding their own beliefs, opinions and meta-beliefs (like, that we’re even ideological to begin with)The best we can do is try to raise our self-awareness. That for the most part, we’re all just stupid monkeys trying to do our best about this whole “waking up on a floating rock”-thing.  So take a deep breath and say it with me: “I’m a clueless ape who doesn't know what’s going on, and that’s okay”. ",
            "date": "Answered October 18, 2020",
            "views": "167",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Val Bard",
                    "user_href": "/profile/Val-Bard"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Venable",
                "href": "/profile/Justin-Venable-3"
            },
            "answer_text": "No. Both are tools humankind uses to get things done. Technology can be divided by purpose, but the level we’ve come to causes advancement to be done by teams of individuals, not single doctors or mathematicians working without aid (by computer or by other community members). Politics can exist on a micro level, so even among a small group of researchers, some order and division of labor should exist, and despite current dysfunctions, that is the goal of politics. Technology can replace some of the labor, reducing but not eliminating the need for politics. So since they’re interrelated, neither is superior. ",
            "date": "Answered October 18, 2020",
            "views": "44",
            "upvotes": "0"
        }
    ]
}