{
    "title": "Is there a possibility that some ancient technologies were more advanced than what we have currently? - Quora",
    "tags": [
        "History of Technology",
        "Ancient Civilizations",
        "Ancient History",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Agyeman",
                "href": "/profile/Michael-Agyeman"
            },
            "answer_text": "It would seem a lot of technology has been lost and we still haven’t been able to replicate much of it: Stradivari Violins One lost technology of the 1700s is the process through which the famed Stradivari violins and other stringed instruments were built. The violins, along with assorted violas, cellos, and guitars, were constructed by the Stradivari family in Italy from roughly 1650-1750. They were prized in their day, but they’ve since become world famous for having an unparalleled—and impossible to reproduce—sound quality. Today there are only around 600 of the instruments left, and most are worth several hundred thousand dollars. In fact, the name Stradivari has become so synonymous with quality that it has come to serve as a descriptive term for anything considered to be the best in its field. Nepenthe The sheer sophistication of the technology wielded by the ancient Greeks and Romans is often quite astonishing, especially when it came to medicine. Among other things, the Greeks were known to treat the bereaved with Nepenthe, a primitive anti-depressant that was known for its ability to “chase away sorrow.” The drug is frequently mentioned in Greek literature like Homer’s Odyssey. Some claim that it might be fictional, but others have argued that the drug was real and used widely in ancient Greece. Nepenthe was said to have originated in Egypt, and its effects as “a drug of forgetfulness” have led many to compare it to opium or laudanum The Antikythera Mechanism One of the most mysterious of all archaeological artifacts is what is known as the Antikythera Mechanism, a bronze machine that was discovered by divers off the coast of the Greek island of Antikythera in the early 1900s. The mechanism consists of a series of over 30 gears, cranks, and dials that could be manipulated in order to chart the astronomical positions of the sun, moon, and other planets. The device was found among the remains of a shipwreck that scientists have dated to the 1st or 2nd century BC. Its true purpose is still not fully known, and the mystery behind its construction and use has puzzled researchers for years. The consensus now seems to be that the Antikythera Mechanism was a kind of primitive clock that could calculate lunar phases and solar years, which has led some to refer to it as the earliest example of an “analog computer.” Damascus Steel Damascus steel was an impossibly strong type of metal that was widely used in the Middle East from 1100-1700 AD. It is most famously associated with swords and knives. Blades forged with Damascus steel were known for their amazing strength and cutting ability, and were said to be able to slice rocks and other metals—including the blades of weaker swords—cleanly in half. The blades are believed to have been created using wootz steel, which was most likely imported from India and Sri Lanka and molded and blended to create a patterned blade. The special quality of the swords is thought to have derived from this process, which weaved together tough cementite and soft iron to form a metal that was as strong as it was flexible. Silphium Lost technologies aren’t always the result of too much secrecy or poor record keeping—sometimes nature just doesn’t cooperate. This was the case with Silphium, an herbal wonder drug that the Romans used as one of the earliest forms of birth control. It was based on the fruit of a particular genus of the fennel plant, a flowering herb that only grew along a certain shoreline in modern day Libya. The heart-shaped fruit of the Silphium plant was known to be something of a cure-all, and was used to treat warts, fever, indigestion and a whole host of other ailments. But it was Silphium’s powers as a contraceptive that made it one of the most valuable substances in the Roman world, to the point that the plant appears on several different pieces of ancient Roman currency. Women would drink Silphium juice every few weeks, and this would be enough to prevent pregnancy. Using the herb would even terminate an existing pregnancy if used correctly, which would make Silphium one of the earliest methods of abortion. Roman Cement Modern concrete was developed in the 1700s, and today the simple mixture of cement, water, sand, and rocks is the most widely used building material in the world. But the recipe developed in the 18th century wasn’t the first time concrete was invented. In fact, concrete was widely used throughout antiquity by the Persians, Egyptians, Assyrians, and Romans. The Romans in particular made extensive use of concrete, and they were responsible for first perfecting the recipe by mixing burnt lime with crushed rocks and water. Their mastery of its use allowed them to build many of their most famous structures, among them the Pantheon, the Colosseum, the aqueducts, and the Roman Baths. Like so many technologies of the Greeks and Romans, the recipe for concrete was lost during the descent into the Dark Ages, but just why remains a mystery. The most popular theory is that the recipe was something of a trade secret among stonemasons, and that the method for making cement and concrete died along with those who knew it. Perhaps even more interesting than the disappearance of Roman cement are the particular qualities that separate it from more modern Portland cement, which is the most common type of cement used today. Structures built with Roman cement, like the Colosseum, have managed to weather thousands of years of punishment from the elements and remain standing, but buildings constructed with Portland cement have been known to wear down much faster. This has been theorized to be the result of different chemicals that the Romans added to their cement, among them milk and even blood. These were said to create air bubbles within the concrete that helped the material to expand and contract in the heat and cold without damaging itself. and.. Greek Fire Perhaps the most famous of all lost technologies is what is known as Greek Fire, an incendiary weapon that was used by the military of the Byzantine Empire. A primitive form of napalm, Greek Fire was a kind of “sticky fire” that would continue burning even in water. The Byzantines most famously used it during the 11th century, when it was credited with helping to repel two sieges of Constantinople by Arab invaders. Greek Fire could be deployed in many different ways. In its earliest form it was poured into jars and thrown at enemies like a grenade or a Molotov cocktail. Later, giant bronze tubes were mounted on warships, and siphons were used spray the weapon at enemy vessels. There was even a kind of portable siphon that could be operated by hand in the style of a modern flamethrower. The technology behind Greek Fire certainly isn’t completely alien. After all, modern armies have now been using similar weapons for years. Still, the closest counterpart to Greek Fire, napalm, wasn’t perfected until the early 1940s, which would mean the technology was lost for several hundred years. The weapon’s use seems to disappear after the decline of the Byzantine Empire, but just why still isn’t known. Meanwhile, the possible chemical composition of Greek Fire has been widely studied by historians and scientists. An early theory was that the mixture included a heavy dose of saltpeter, which would make it chemically similar to gunpowder. This idea has since been rejected, because saltpeter wouldn’t burn in water. Instead, modern theories propose that the weapon was more likely a cocktail of petroleum and other chemicals, possibly including quicklime, niter, or sulfur. ",
            "date": "Answered November 3, 2016",
            "views": "24",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Uday Satone",
                    "user_href": "/profile/Uday-Satone"
                },
                {
                    "user_id": "John Georgiyev",
                    "user_href": "/profile/John-Georgiyev"
                },
                {
                    "user_id": "Paul Cervantes",
                    "user_href": "/profile/Paul-Cervantes-15"
                },
                {
                    "user_id": "Iro Apert",
                    "user_href": "/profile/Iro-Apert"
                },
                {
                    "user_id": "Dino Karas",
                    "user_href": "/profile/Dino-Karas-2"
                },
                {
                    "user_id": "Campbell McGown",
                    "user_href": "/profile/Campbell-McGown"
                },
                {
                    "user_id": "Jeff Witte",
                    "user_href": "/profile/Jeff-Witte-1"
                },
                {
                    "user_id": "Quincy Leathers",
                    "user_href": "/profile/Quincy-Leathers"
                },
                {
                    "user_id": "Kieron Michaels",
                    "user_href": "/profile/Kieron-Michaels-1"
                },
                {
                    "user_id": "Emerson Mersone",
                    "user_href": "/profile/Emerson-Mersone"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Riggsby",
                "href": "/profile/Matt-Riggsby"
            },
            "answer_text": "It seems exceptionally unlikely. There are, certainly, specific technical tricks which we’ve lost (certain ceramic glazes, for example) and things we can’t reproduce for reasons which have nothing to do with technological sophistication (murex dye and silphium, for example, come from species which have gone extinct). Others…well, we may have reproduced or be able to reproduce them, but we don’t know because the original technology is so vaguely described. Greek fire is a good example. Because it was a state secret, the formula for it wasn’t widely known, and there are contradictory statements describing its composition and how it operated, so there are a lot of open questions about what it may or may not have been. It seems entirely likely that there were multiple formulations of substances all of which were named “Greek fire.” We’ve come up with various conjectural formulations, any one of which, or even several of which, may be correct, but we don’t and probably can’t know if any of them are correct because there’s insufficient information to check against. And, as ever, various ancient technologies are caught up in a certain level of worshipful woo-woo obscuring the fact that they are, in fact, very well understood. The Pyramids didn’t require aliens, the Antikythera device is unambiguously an orrery reflecting a knowledge of orbital mechanics we know to be consistent with the times, and Roman concrete is durable mostly because (a) the Romans took far more care to compact it than we tend to in modern construction, (2) they were based on some very good natural materials which aren’t economically viable in modern construction but which we could use were we so inclined and (iii) surviving examples are in regions where preservation is naturally better. But ultimately this is all a bit of tangent. Even for stuff where we don’t quite understand the sketchily-described techniques of the time, that doesn’t mean we can’t do better. Any mechanical clock you may have around, with a spring drive and an escapement, is an order of magnitude more sophisticated than the Antikythera device. Damascus steel looks impressive, but we can inexpensively crank out superior alloys (and people in regions where Damascus steel was produced were mighty impressed by and enthusiastic importers of well-understood pattern welded blades, so let’s not forget that we’re inheritors of centuries of good marketing). And while we can’t know for sure, because the ancients didn’t have the medical or statistical sophistication to communicate enough information for us, I’ll lay odds that modern hormonal birth control is both more effective than silphium and less likely to result in a species of plant going extinct. I don’t doubt that there are ancient technologies which we wouldn’t be able to improve on given the limitations to which the original users were subject (Damascus steel and pattern welding may be close to the best you can do given Medieval limitations on pyrotechnology), but I doubt there’s a single significant thing the ancients did which we can’t do better now. ",
            "date": "Answered November 3, 2016",
            "views": "21",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Rimmer",
                    "user_href": "/profile/Matt-Rimmer-6"
                },
                {
                    "user_id": "Paul Popescu",
                    "user_href": "/profile/Paul-Popescu-1"
                },
                {
                    "user_id": "Peter Knutsen",
                    "user_href": "/profile/Peter-Knutsen-1"
                },
                {
                    "user_id": "David Vanderschel",
                    "user_href": "/profile/David-Vanderschel"
                },
                {
                    "user_id": "Ken Fishkin",
                    "user_href": "/profile/Ken-Fishkin"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Kwesi Abakah Dadzie",
                    "user_href": "/profile/Kwesi-Abakah-Dadzie"
                },
                {
                    "user_id": "Oliver Henry",
                    "user_href": "/profile/Oliver-Henry-3"
                },
                {
                    "user_id": "Ben Allen",
                    "user_href": "/profile/Ben-Allen-233"
                },
                {
                    "user_id": "Sven Williams",
                    "user_href": "/profile/Sven-Williams"
                }
            ]
        }
    ]
}