{
    "title": "Is there mind control technology? - Quora",
    "tags": [
        "Mind Control",
        "The Mind"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Daniel",
                "href": "/profile/Michael-Daniel-21"
            },
            "answer_text": "Thanks for A2A. Is there mind control technology? At this point in time, there is no publicly known method of controlling a person in a robotic fashion beyond old-fashioned hypnosis. I know this works, because I did it in High School. I’m also able to find and remove embedded programs. It’s not something that I do for entertainment, because I’m not that way inclined, and the instant stage-trance eluded me when I was interested in this. The most powerful technologies that can influence behavior which are publicly known, rely on targeted transmission. High directional acoustics can be directed at the target while no one else in the crowd can here it. “Hearing voices” can be unnerving but, unless the content appeals to some form of pre-existing guilt, triggering a paranoid response, the person is most likely to dismiss it. Such technology is portable and can be used to harass, but it’s still not likely to create a specifically desired outcome other than the person becoming extremely stressed and potentially deluded. I do know that a properly hypnotised person can be programmed to perform a specific task in response to a trigger and then have no memory of ever doing it, and I’ve seen such an experiment on tape. The subject was hypnotised and given two trigger words. The first activated a limp in his walk, the second de-activated it. In both cases, the trigger words were delivered on his cell phone. Even after watching the tape back, the subject had no memory of receiving the calls, or ever walking with a limp. Nothing was shown regarding the hypnotist “removing” the program afterward, but I think that he would have been responsible enough to undo the demonstration that he had created. Sadly, I’m also reasonably aware that PDHs (Pain-Drug Hypnoses) are used by unsavory PTBs (Powers that Be). There is no way that I’m going to describe how this is done, but I will put the information out there that selected subjects who survive* the process end up with a deeply embedded sub-entity (like having another personality watching over you), that can be activated, instructed, and then de-activated without the subject ever being aware of what happened. Even when the implanted personality is active, the person still appears to behave normally, and there’s no “walking around in a trance” like we see on TV.* Yes, the levels of pain and drugs required can kill. As far as electronic mind-control, I am aware of publicly disclosed military experiments that involved taking EEG impulses from a trained pilot and injecting those impulses into a trainee pilot. According to the little data that I’ve read on this, the results are very positive and the trainee pilots experience significant improvement in their flying skills. Obviously, this is done in real time with both trainer and trainee in identical simulators. Whether or not there’s yet an ability to record and play back, I don’t know. The potential of this technology is huge, if it can be recorded. By strapping a cap onto an athlete swimmer and recording the impulses, children could then wear play back caps that would teach them the motor-neuron connections to become good swimmers instead of the “sink or swim” lessons that many children have suffered. I’m hardly suggesting that all such children will become great athletes, because no two bodies are identical, but they’ll certainly develop enough skill to save themselves or others. Other target fields would include: keyboard (computer or music);other musical instruments;martial arts;specific sporting skills;dance;car driving;extremely fine motor-skills for surgery.I don’t see that this technology would be useful to change someone’s opinion or behavior and potential a student would already have to be interested in music before one would attempt to program the instrument into the student. ",
            "date": "Answered June 3, 2018",
            "views": "21",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrea Mecham",
                    "user_href": "/profile/Andrea-Mecham"
                },
                {
                    "user_id": "Luiza Ambarus",
                    "user_href": "/profile/Luiza-Ambarus"
                },
                {
                    "user_id": "Rowan Pray",
                    "user_href": "/profile/Rowan-Pray-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Francisco Pelgero",
                "href": "/profile/Thomas-Francisco-Pelgero-1"
            },
            "answer_text": "Hi Rowan, Mind control technology is more directing towards a direct control of mind through the ether. Which I think on this moment is not happening with every one. I believe there are indications that some people can be targeted by electronic machinery to bend their choices or behaviors. Mind control by media, news and movie is certainly happening, by programming the synapses in the brain with peoples subconsciousness. Here people get brain washed and they are taught how to behave and to act in life, all in all to keep the frequency of energy on a very low barbarian level and individualize the persons and try to divide more and more. In how far 5 g, and ionizing the atmosphere with chem trails plays a role to induce a mind control. I don’t know on this moment. People have to know that they have always control of their thoughts, when they choose to control their thoughts. Choosing positive thoughts, will raise the frequency of a Soul which projects a human life in the earth life projection. Critical thinking is very important. Turn of TV, throw away news papers, don’t watch movies, don’t play computer games. Formulate all the time pure positive thoughts which are good for you AND good for all people in the world AND good for Nature. The only way to create balance in yourself, balance between people and balance with Nature. It is time for people to communicate and to unite. Together you can massively create your futures. On this moment people are used to watch movies and create the future as is designed by the Deep State. Most people should not watch direction A.I. or mind control, they should more watch themselves and direct their attention inwards. Listen to the voice of your higher self which speaks to you through your intuition and conscience. Listen and you have always the right positive answer which will help you and others to empower themselves and their pure positive Soul. With best regards, Thomas Francisco Pelgero ",
            "date": "Answered June 6, 2018",
            "views": "713",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julia Curiel",
                    "user_href": "/profile/Julia-Curiel"
                },
                {
                    "user_id": "Jurij J. Dvořák",
                    "user_href": "/profile/Jurij-J-Dvořák"
                },
                {
                    "user_id": "Banu's Page",
                    "user_href": "/profile/Banus-Page"
                },
                {
                    "user_id": "Kalvin Paramore",
                    "user_href": "/profile/Kalvin-Paramore"
                },
                {
                    "user_id": "Dawn Gregory",
                    "user_href": "/profile/Dawn-Gregory"
                }
            ]
        }
    ]
}