{
    "title": "Is Tesla’s ‘full self-driving’ software starting to roll out to select customers? - Quora",
    "tags": [
        "Tesla Autopilot",
        "Self-Driving Cars",
        "Waymo Self-Driving Cars",
        "Tesla Model S",
        "Autonomous Driving",
        "Electric Cars",
        "Tesla (company)",
        "Driving",
        "Software and Applications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marc D Anagnos",
                "href": "/profile/Marc-D-Anagnos"
            },
            "answer_text": "Just yet more hype from a bunch of liars. It's still nothing more than a driver's assist, it can't drive the car itself, and there will definitely be accidents. A child can drive on the highway, there's far less chance of an accident. In fact, but hen you practice driving, the DMV says to spend most of your time in moderate city traffic. So now they think the software program can handle the nut cases who break every driving law in the book? I better start driving my 13 ton truck again, so when some do with their toys run into it, I'll wonder if there's a road plate in the highway. I also have cameras all over my truck, so everyone will know who's fault it is. ",
            "date": "Answered October 25, 2020",
            "views": "56",
            "upvotes": " Answer requested by Dab Alloti",
            "upvoters": [
                {
                    "user_id": "Charlie Richmond",
                    "user_href": "/profile/Charlie-Richmond-5"
                },
                {
                    "user_id": "Frank Zucco",
                    "user_href": "/profile/Frank-Zucco"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dab Alloti",
                "href": "/profile/Dab-Alloti"
            },
            "answer_text": "Tesla feels out the first “Full Self-Driving” beta software update to a select group of customers this week , CEO Elon Musk tweeted Tuesday . On an earnings call Wednesday , Musk said more Tesla owners would get the update as the weeks progress , with the goal of a \"wide release\" by the end of the year . Only those customers in Tesla's Early Access Program will receive the software update , that will enable drivers to access Autopilot's partially automated driver assist system on city streets . ",
            "date": "Answered October 22, 2020",
            "views": "78",
            "upvotes": " View 2 Upvoters"
        }
    ]
}