{
    "title": "Is there a culture of sexism in Silicon Valley? - Quora",
    "tags": [
        "Diversity in Technology",
        "Technology Entrepreneurship",
        "Women's Rights",
        "Sexism",
        "Silicon Valley",
        "Existence Question",
        "Entrepreneurship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eugene Miya",
                "href": "/profile/Eugene-Miya"
            },
            "answer_text": "Do you really have to ask? First, it's technically, very male-oriented, not merely male but geeky-male and also sometimes gay/transgendered male/bi- (I assert much of this is environmental not genetic). Second, this is not lost on the leadership of the significant companies. Third, it does not help that many of the women aren't technical. Fourth, this is not completely for lack of trying.  No one asks 'How many women were members of the original Homebrew Computer Club?' The big dividing line is hardware (you understand the Silicon; I certain know women EEs). Women getting into software is much easier.  If you know or knew some of the players, you would know the questions to better ask. I would also point to the index of Steven Levy's Hackers book. The local guy who really studied nerds was Lewis Terman (his son Fred founded the Stanford Engineering School).  You need to understand Bill Shockley and Hewlett and Packard.  Alas, there was an important representative in Anita Borg (whom I knew and referred technical women to Systers), and there are other women friends, and conferences which are trying to address this, e.g., the conference named after Anita, the Tappa Conference, etc. My involvement with the issue of recruiting women and \"minorities\" is past. I'm retired.  ",
            "date": "Answered April 2, 2016",
            "views": "499",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samer Hijazi",
                    "user_href": "/profile/Samer-Hijazi-4"
                },
                {
                    "user_id": "Jayesh Lalwani",
                    "user_href": "/profile/Jayesh-Lalwani"
                }
            ]
        }
    ]
}