{
    "title": "Is the future looking dark for humanity? - Quora",
    "tags": [
        "The Human Race and Condition",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Penturn",
                "href": "/profile/John-Penturn"
            },
            "answer_text": "There are always challenges but the one thing that there can be no room for is cynicism. In anything anywhere. It makes everything worse always. Everything. Science got us into much of the mess we have in the world & there’s every reason to believe that well applied it could get us out of it. We need our obstacles, even tragedies to get everyone working together to resolve things & to know ourselves. The meaning of life is to learn & this the great catalyst for that. The most powerful operating principle in life & then how it’s powerfully affecting you here - What you focus on expands. The more you focus on these negative feelings the more they expand & the more you attract & magnetize still more - in addition to feeling horrible & frequently as well. These are neural pathways embedded in your unconscious composed of negative emotions. The crowning glory of our mind that makes us better and/or worse then all other life forms is our imagination. Using it in combination with the above operating principle quite literally assures almost anything positive is possible. Thee will likely have to be some real bumps in the road top harness our psychological & physical resources to achieve this but it will be done. Its a matter of when - not if. We can easily achieve orders of magnitude more positive change (literally) but there is considerable laziness on behalf of the vested interests. It will occur but staying positive & proactive is not negotiable. Here’s what I’ve distilled as the way to stimulate all positive change in all areas: The meaning of life is - To Learn. Understanding morality is no kind of social & psychological construct is crucial. It is an outgrowth of our biological capacity for empathy. Out of which Love emerges that we exercise, because we are also intrinsically social creatures. Everything important in the most practical terms, is mostly composed of Love - Integrity, dedication, authentic sincerity, honesty (especially with oneself), courage, honour etc. & must be a component of everything done or its worthless. This is why emotional intelligence & empathy are just a form of this & the inevitable reason why it is the best predictor of all levels of the most profound happiness, fulfillment, success & prosperity in life. These are neural pathways embedded in your unconscious composed of negative emotions. The good news is they can be rewritten. Consider it a sign to attend to the underlying principle underlying all Psychological heath - paying attention to your emotions as they come up & positively dealing with them. Doing so can resolve virtually all issues but it is very much like building a pyramid, building the strong base on which to build a life sometimes goes up slowly - but soon enough it goes up very quickly indeed. Then you will always know that you are never part of the problem of all the ugliness in life and are instead part of the solution. Finally use all your creativity & passion to look for the beauty in everything you encounter & all you meet. Then be aware the most powerful operating principle of life is: What you focus on expands & that what you then attract & magnetize will be as a result to the degree you never hold onto a negative feeling/thought & focus on the foregoing. It's a kind of law of physics the unconscious is neverendingly relentless about enforcing. You deal with it or it deals with you. It’s always a choice. There is a something however to make this all work better & faster. Realizing that thinking about the future is often an excuse to worry. Staying in the right now empowers all of the above unspeakably. That’s the core truth all the talk of mindfulness is about. This way you know you are not a part of the problem of all the ugliness in the world - but part of the solution. Convincing just one other to do means they will & so on. That’s exponential growth. An example of which is a penny doubling every day (2 cents the second, 4 cents the third & so on. In under a month its a million & in a couple more, more money then exists. If you choose to do nothing or too little instead along these lines then others will leave you behind. It’s a choice & very much in your hands. Yes you are that powerful & it can only multiply by getting one other to go here to. Here’s another take with a must see 2 & 1/2 minute video that should should shake up expectations as well > John Penturn's answer to Will future humans be smarter than us? ",
            "date": "Updated September 14, 2019",
            "views": "14",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jason Hausenloy",
                    "user_href": "/profile/Jason-Hausenloy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zsolt Hermann",
                "href": "/profile/Zsolt-Hermann"
            },
            "answer_text": "No, we are actually ahead of great times. We are like a very sick person, fighting an unknown disease for a long time, finally receiving the correct, full diagnosis. As a result the proper treatment, leading to restored health can start. For the first time in our history we revealed that the root cause of all of our problems is our own, inherently selfish, egoistic and hateful nature. We can now finally see that we can't build a better world through social, economic our political changes as it is the “user” that needs changing from inside out. Thus we can start refining, upgrading our inherent nature so above it we acquire the capability of selfless, altruistic, mutual interconnections. Through such mutual connections we will be able to solve all of our problems and rise to a qualitatively much higher, effortless existence. On The Verge Of A Bright Future | Laitman.com ",
            "date": "Answered April 9, 2017",
            "views": "884",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Miesem",
                    "user_href": "/profile/Mary-Miesem"
                },
                {
                    "user_id": "JJ Ziebart",
                    "user_href": "/profile/JJ-Ziebart"
                }
            ]
        }
    ]
}