{
    "title": "Is the mobile app trend dead? What is next? - Quora",
    "tags": [
        "Fads and Crazes",
        "Future of Technology",
        "Wearable Technology",
        "Internet of Things (IoT)",
        "Mobile Technology",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pratik Das",
                "href": "/profile/Pratik-Das-44"
            },
            "answer_text": " Project Ara of Google is going to bring modular phones,it include a structural frame or endoskeleton that holds smartphone modules of the owner's choice, such as a display, camera or an extra battery. It would allow users to swap out malfunctioning modules or upgrade individual modules.   The Wearable glasses which are also rising are: 1. Google glass which is based on Augmented reality technology. It also have a front facing camera which has caused legal issues in some countries.  2. Oculus rift which is based on Virtual reality technology. The virtual reality has potential to revolutionize immersive gaming experience and immersive movie viewing experience.  Besides smart watches we have Fitness bands(activity trackers) which usually tracks heart beat rate and calorie. It may also use mobile app to display the data collected by the band wirelessly. Virtual reality, Modular phones and Flexible OLEDs mobile screen will be soon available as gadget in the tech-market.  Wearable technology is expected to rise as computer interaction becomes better and it will require big data.Smart watches and Fitness bands are the best examples of it available at present. Iot(Internet of Things) is the network of physical objects or \"things\" embedded with electronics, software, sensors, and network connectivity which can automatize most of the household and day to day activities.  Big Data Analysis done by the social media with e-commerce websites can revolutionize the online shopping. These all technologies have a great potential and can become next big thing as the Internet. ",
            "date": "Answered January 13, 2016",
            "views": "971",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nikhil Sharma",
                    "user_href": "/profile/Nikhil-Sharma-505"
                }
            ]
        }
    ]
}