{
    "title": "Is the Earth going away from the Sun or getting near to it? - Quora",
    "tags": [
        "Earth-Sun Relationship",
        "The Solar System",
        "The Sun",
        "Outer Space",
        "Earth (planet)",
        "Astrophysics",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Teddy Poster",
                "href": "/profile/Teddy-Poster"
            },
            "answer_text": "In a simple system with just the Earth and the Sun, the Earth would move away from the Sun for two reasons. One - the Sun is shedding mass and as the Sun loses mass, Earth moves further away - that’s basic Newtonian physics. The Sun loses mass very slowly so this is a slow effect. Two - Earth creates tides on the Sun and the Sun rotates ahead of the Earth and this tidal force draws the Earth away from the Sun. This effect is even smaller and has a tiny effect on drawing the Earth away from the Sun. But those aren’t the only factors. The other planets tug on Earth other and that can have an effect. Passing orbiting objects can have an effect as well. The solarsystem is dynamic. So, Earth is probably moving away from the Sun, very slowly but the effects of other planets might undo that. The math behind such models is pretty complicated, but Earth’s motion away from the sun is small enough that planetary effects might be the primary factor. That said, whichever way the Earth is moving - away or towards (probably away), the effects are very tiny and likely negligible even over millions of years. ",
            "date": "Answered July 20, 2020",
            "views": "37",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "P G Dharanesh",
                    "user_href": "/profile/P-G-Dharanesh"
                },
                {
                    "user_id": "Paul McQuesten",
                    "user_href": "/profile/Paul-McQuesten-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranjal Singh",
                "href": "/profile/Pranjal-Singh-806"
            },
            "answer_text": "The sun shines by burning its own fuel, which causes it to slowly lose power, mass, and gravity. ... As the sun loses its momentum and mass, the Earth can slowly slip away from the sun's pull. Our planet is assuredly not growing closer to the sun in orbit; in fact, our planet is slowly inching away from the sun. ",
            "date": "Answered July 18, 2020",
            "views": "238",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siri Isha",
                    "user_href": "/profile/Siri-Isha-4"
                },
                {
                    "user_id": "Hulk",
                    "user_href": "/profile/Hulk-85"
                },
                {
                    "user_id": "Eshaan Agrawal",
                    "user_href": "/profile/Eshaan-Agrawal-4"
                },
                {
                    "user_id": "P G Dharanesh",
                    "user_href": "/profile/P-G-Dharanesh"
                }
            ]
        }
    ]
}