{
    "title": "Is the Apple iPhone 12 Pro Max 5G the real complete 5G, or is it just minimalistic 5G? - Quora",
    "tags": [
        "5G (wireless communication)",
        "Telecommunications",
        "Wireless Technology",
        "Wi-Fi",
        "Mobile Technology",
        "Apple (company)",
        "iPhones (product)",
        "Apple Products and Services",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roberto Santocho",
                "href": "/profile/Roberto-Santocho"
            },
            "answer_text": "Q: Is the Apple iPhone 12 Pro Max 5G the real complete 5G, or is it just minimalistic 5G? A: Yes, Apple iPhone 12 Pro Max features complete 5G Apple’s iPhone 12 cover all 5G bands including mmWave for ultra high speeds, mid band and low band for the highest speeds at the longest range possibleIn fact, not only does the Apple iPhone 12 Pro Max feature full coverage, it offers more bands of coverage than any other phoneApple is using a new modem chip that is not available to the Android manufacturers, so Apple can cover more bands than anyone elseApple’s 5G is already delivering 2 Gbps on 5G high band is is more than twice as fast as all Androids that we have ever seen, this is years ahead of schedule because Androids were only supposed to be reaching 1 Gbps in 2021, then they were supposed to be reaching 2 Gbps in 2023 to 2025, Apple iPhone 12 Pro Max is well ahead of Androids in actual 5G speeds and number of bands delivered ",
            "date": "Answered October 15, 2020",
            "views": "14",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andes Wong",
                    "user_href": "/profile/Andes-Wong"
                },
                {
                    "user_id": "Zack Hill",
                    "user_href": "/profile/Zack-Hill-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Osborne",
                "href": "/profile/Josh-Osborne-6"
            },
            "answer_text": "It “only” implements two of the three major 5G profiles. The mmWave very fast very limited area (seriously walls block it, not all walls, but if it gets into your house it normally doesn’t make it through much of the way of interior walls; it would be good for a sports stadium, or deployed inside an airport), and “sub 6Ghz” where it is a little faster then LTE but not hugely faster (it does have better latency though). The other profile, the one it doesn’t implement is very very slow, I can’t rember if it works out to bits per second or Kbits per second, but slower then the original iPhone’s networking. That profile also sips power lightly, like you could run on it for a month+ (it is designed for things like tracking tiles, or putting on on field equipt so it can phone hone “pump#36127 isn’t doing so well, send a tech!”). Cell companies also havnt deployed this one, so while I think it might be useful (but it might delay receipt of phone calls and texts and such too much, I expect it gets some of this efficiency by only powering the radio up every few minutes or even just once an hour — so it might be useless for a phone) ",
            "date": "Answered October 15, 2020",
            "views": "12",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stefan Vervaeck",
                    "user_href": "/profile/Stefan-Vervaeck"
                },
                {
                    "user_id": "Omak Nidibad",
                    "user_href": "/profile/Omak-Nidibad"
                }
            ]
        }
    ]
}