{
    "title": "Is the correct term 'headquarter' or 'headquarters'? - Quora",
    "tags": [
        "Headquarters",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Trevor Krause",
                "href": "/profile/Trevor-Krause"
            },
            "answer_text": "For standard English \"Headquarters\" is almost always the correct noun to use. For some local English speakers in the Asian region \"headquarter\" may be acceptable and even \"normal\" in local conversations. \"Headquarter\" is generally only used in standard English as a form of the verb \"headquartering\" or \"headquartered\", usually future tense as in \"will headquarter\".\"Quarters\" in this usage doesn't imply one fourth or fourths, but is a derivation of a french word, quartier, meaning area or district. Such examples are the french quarter of New Orleans, meaning the districts of New Orleans that were once closely associated with the original french founders of the city. I believe that some major French cities have quarters or districts that are/were mainly inhabited by former french colonial citizens such as Algerians or Moroccans, and are known as the Algerian quarter or similar. Battalions of soldiers were originally housed or quartered in the dwellings of towns and cities that required their presence, whether by the choice of the townsfolk or not. These formations of soldiers required some known area where the military leaders could meet and plan their strategy, a command center or head, and from where commands could be issued to front line leaders. This became known as the Head Quarters as compared to the barracks or housing quarters or the fighting quarters or defending quarters.Civilian uses of the term \"Headquarters\" naturally in time flowed on from the military terminology. As one great philosopher once said \"Commerce is War, just not as many innocents get indiscriminately killed.\" ",
            "date": "Answered March 9, 2020",
            "views": "445",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Meher Mouli",
                    "user_href": "/profile/Meher-Mouli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Marshall",
                "href": "/profile/Terry-Marshall-25"
            },
            "answer_text": "Headquarters. Just unfortunate that it ends in an S, making it sound as if it’s more than one, which it can be. One size fits all! The computer firm‘s headquarters is in Baldington. The computer firm has headquarters in both Serville and Ponoby. ",
            "date": "Answered March 9, 2020",
            "views": "168",
            "upvotes": "0"
        }
    ]
}