{
    "title": "Is there a technology industry in Hawaii? - Quora",
    "tags": [
        "Jobs and Careers in Technology",
        "Technology Industry",
        "Hawaii (island)",
        "Hawai‘i (state)",
        "Industry",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Kiefer",
                "href": "/profile/Nick-Kiefer-6"
            },
            "answer_text": "In my opinion, not per se. There are avenues of scientific exploration being done here, in conjunction with the University of Hawaii, within fields such as marine biology, astronomy, meteorology, and a few other specialties for which Hawaii provides an environment conducive to research. However, I suspect you are alluding to something more like Silicon Valley - some kind of “engineering alley?” Hawaii has actually tried to lure tech companies here with tax incentives for start-ups. But the whole socialistic leaning of our State government made that brief period of reaching out to the tech world obsolete in a few years, and it never really went anywhere. It was too short-sighted, and companies just took advantage of it, with no real intention of the long-term commitment that would have benefited Hawaii. Unfortunately (or fortunately, depending on one’s perspective), Hawaii just doesn’t have a mentality that would foster a tech industry. :-) The University of Hawaii would have to be revamped or overhauled into a place where cutting edge technology is taught. Which means it would have to lure world class teachers and researchers. There would have to be a Stanford/Berkeley-Silicon Valley type of symbiosis connection to UH here, even if we could lure tech companies with a longer term perspective. Not gonna happen, imo. Our politics just doesn’t lend itself to business. :-( ",
            "date": "Answered April 27, 2019",
            "views": "939",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Haley Rymel",
                    "user_href": "/profile/Haley-Rymel"
                },
                {
                    "user_id": "Nainika Sudheendra",
                    "user_href": "/profile/Nainika-Sudheendra"
                },
                {
                    "user_id": "Jack Eastman",
                    "user_href": "/profile/Jack-Eastman-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Gelish",
                "href": "/profile/Anthony-Gelish"
            },
            "answer_text": "The Hawai’i Technology Development Corporation at the Manoa Innovation Center hosts a technology incubator that has resulted in several successful projects in a variety of industries from aquaculture and alternative energy to robotics. HTDC works with entrepreneurs, angel investors and venture capitalists to foster relationships aimed at growing new enterprises diversifying Hawai’i’s economy. Hawai’i hosts more than 2,000 tech companies employing more than 31,000. Verifone began in Hawai'i. The underpinnings of TCP/IP were developed in Hawai'i. So, yes. There is a vibrant tech economy in Hawai'i. ",
            "date": "Answered April 28, 2019",
            "views": "38",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Haley Rymel",
                    "user_href": "/profile/Haley-Rymel"
                }
            ]
        }
    ]
}