{
    "title": "Is Uber on an e-commerce platform? - Quora",
    "tags": [
        "Multivendor E-Commerce",
        "E-Commerce Websites",
        "E-Commerce Companies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Builderfly",
                "href": "/profile/Builderfly"
            },
            "answer_text": "Yes, Uber is an ecommerce platform. Initially, Uber started as an aggregator marketplace to connect service providers to customers. Uber platform enables connecting riders to the drivers to ease the commute. After the success of Uber as an online taxi and cab booking platform, Uber came with the concept of Uber Eats. Uber Eats is also following the same aggregator marketplace model. It allows different restaurants as well as food shops to connect with the platform and offer collaborated services to meet the demand of customers for home delivery of food. Like the typical ecommerce business, Uber also enables its customers and users to make an online payment via digital payment methods and pay in case. Uber also offers two apps and distinct dashboards for business as well as for the user. A business (Driver in case Uber driving app, and restaurant owner in case of Uber Eats) can check the online and offline profile. Chat and call to connect with the end-user, showcase the real-time navigation, get the work/order history, and are allowed to accept/ reject request/ order. Likewise, a customer-facing app enables users to check for the nearest options, call/chat to connect with the service provider, opt for payment options, refer and earn, can review later. Builderfly ",
            "date": "Answered January 24, 2020",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vikrant Raval",
                    "user_href": "/profile/Vikrant-Raval"
                },
                {
                    "user_id": "Aashish Kumar",
                    "user_href": "/profile/Aashish-Kumar-416"
                },
                {
                    "user_id": "Ashish Chaubey",
                    "user_href": "/profile/Ashish-Chaubey-71"
                },
                {
                    "user_id": "Binay Jha",
                    "user_href": "/profile/Binay-Jha-9"
                }
            ]
        }
    ]
}