{
    "title": "Is USB 3.0 the same as USB A? - Quora",
    "tags": [
        "Micro USB",
        "USB 2.0",
        "USB 3.0",
        "USB Powered Devices",
        "USB Type-C",
        "Flash Drives",
        "Universal Serial Bus (USB)",
        "Computer Hardware",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Johns",
                "href": "/profile/Chris-Johns-56"
            },
            "answer_text": "Yes and no. The number indicates the overall standard used which determines things like current capacity and bandwidth as well as how data is actually handled. So far all USB standards are backwards compatible so you can plug a USB 2 device into a USB 3 port albeit only with USB 2 levels of performance. USB 1.1 is now pretty much obsolete but still compatible with later standards. The letter indicates the form factor of the physical connector A is the common flat-ish connector which you tend to find on larger devices like PCs. Type B now tends to be mostly found on printers and modems as it tends to provide a more mechanically robust connection for semi-permanent connections. Both types also have mini and micro versions which are what you tend to find on smaller devices like phones and USB A to micro USB B tends to be the default cable supplied with most such devices. Again connectors are backwards compatible across standards. USB 3 also added the C type connector which allows for the full bandwidth and power supply of USB 3 in a fairly compact connector along with a few design improvements eg it’s symmetrical and a bit more robust and elegant looking. The C type connector also aims to provide good compatibility with other port standards like Displayport and Thunderbolt, especially for portable devices. ",
            "date": "Answered February 5, 2020",
            "views": "37",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Nangle",
                    "user_href": "/profile/Alex-Nangle-2"
                },
                {
                    "user_id": "David Wilmshurst",
                    "user_href": "/profile/David-Wilmshurst"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yowan Rajcoomar",
                "href": "/profile/Yowan-Rajcoomar"
            },
            "answer_text": "You are mixing up things here. USB 3.0 SuperSpeed (aka 3.1/3.2 Gen1) is just a specification which targets transfer speeds of 5 Gbit/s (625 MB/s) while USB A is a connector:  Cables which support the USB 3.0 will have blue plastic inside USB A connector compared to USB 2.0 connectors which are usually white. These are USB 2.0 Type A connectors:  And USB 3.0 ones, notice the blue colour inside the metal casing:  ",
            "date": "Answered May 4, 2019",
            "views": "85",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vachira Phuaklek",
                    "user_href": "/profile/Vachira-Phuaklek"
                },
                {
                    "user_id": "Kevin Bardool",
                    "user_href": "/profile/Kevin-Bardool"
                },
                {
                    "user_id": "Carolyn Jane Stan-Bishop",
                    "user_href": "/profile/Carolyn-Jane-Stan-Bishop"
                },
                {
                    "user_id": "Khyati Wikramanayake",
                    "user_href": "/profile/Khyati-Wikramanayake"
                },
                {
                    "user_id": "Damian Höster",
                    "user_href": "/profile/Damian-Höster"
                },
                {
                    "user_id": "Richard Taylor",
                    "user_href": "/profile/Richard-Taylor-147"
                },
                {
                    "user_id": "Alec Cawley",
                    "user_href": "/profile/Alec-Cawley"
                },
                {
                    "user_id": "Rahul Singh Bisht",
                    "user_href": "/profile/Rahul-Singh-Bisht-8"
                },
                {
                    "user_id": "Phillip Remaker",
                    "user_href": "/profile/Phillip-Remaker"
                },
                {
                    "user_id": "Douglas Barr",
                    "user_href": "/profile/Douglas-Barr-11"
                }
            ]
        }
    ]
}