{
    "title": "Is your smartphone listening to you? - Quora",
    "tags": [
        "Phone",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Parmenter",
                "href": "/profile/Dan-Parmenter-2"
            },
            "answer_text": "I had a pretty weird example of this the other day. I noticed that a colleague of mine was wearing an ermandegildo zegna jacket. Mentioned that I own a few shirts and jackets (bought from charity shops). He had no idea about the brand, but liked the jacket (it had been a gift). We had a 10 minute chat on the matter. Now… for the past week I've been getting nothing but banners for zegna. Never had those before, and now they are on loop. That is pretty suspicious if you ask me. Bit too much to be a coincidence. Never mentioned zegna in conversation before, and never seen a banner for zegna before. It’s not a common word. Absolutely my (samsung) phone has a voice recognition ‘assistant’, and the Google search bar is voice operated also. Plenty easy to get speech to text to work. I wouldn't be at all surprised if voice-scraping was going on. IBM blocked Siri on its internal networks years back because Siri was quite likely scraping everything all the time. IBM Outlaws Siri, Worried She Has Loose Lips  A few people have suspected that stuff like that is going on, and some security testers built an example app which did the job: Is your smartphone listening to you? - BBC News App spies on users' real-world conversations - BBC News It is entirely plausible that some apps installed on phones which have microphone access are doing this, and selling the scraped information to advertisers in order to target advertising. Or, in the words of the researchers “it’s certainly possible, and that's what we've proved. Whether it’s going on is another matter, but I suspect it probably is going on somewhere”.  Past few years Facebook has had the finger pointed at it, for being rather vague about why the app needs permanent microphone access… and what that might be for. Facebook is ‘using your phone to listen to everything you say’ “Facebook says explicitly on its help pages that it doesn’t record conversations, but that it does use the audio to identify what is happening around the phone.”  I have never run Facebook on a mobile device… Hmm. Certainly I was bothered about why so many of those free apps wanted microphone access. For privacy invasion yes. Think I will be uninstalling some, and going through the permissions to disable most of them from accessing the mic.  Of course, pretty unlikely that would stop the GCHQ smurf army. “Named after the children's television cartoon characters, \"The Smurfs,\" these tools allow the British spy agency to target individual smartphones. For example, \"Tracker Smurf\" that allowed high-precision geolocation, and \"Nosey Smurf\" that gave analysts access to a device's microphone. Meanwhile, \"Dreamy Smurf\" allowed analysts to switch stealthily activate a device that is apparently switched off.” ",
            "date": "Updated February 26, 2017",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joey Yulis",
                    "user_href": "/profile/Joey-Yulis"
                },
                {
                    "user_id": "Jerry Pletcher",
                    "user_href": "/profile/Jerry-Pletcher"
                },
                {
                    "user_id": "Rich Coyle",
                    "user_href": "/profile/Rich-Coyle-5"
                },
                {
                    "user_id": "Nyneke Dourden",
                    "user_href": "/profile/Nyneke-Dourden"
                },
                {
                    "user_id": "Sam A",
                    "user_href": "/profile/Sam-A-277"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shalom Crown",
                "href": "/profile/Shalom-Crown"
            },
            "answer_text": "There is a much more insidious way your phone could be listening to you (though probably not, assuming you aren’t a criminal). Apparently the FBI has software that circumvents the off switch. You think your phone is turned off but it isn’t, and it is recording your conversations and transmitting them somewhere. Here is a link to a CNET article that I found on this subject: FBI taps cell phone mic as eavesdropping tool It is also suspected that there is equipment that can detect where phones are, even if they are turned off, and even without batteries. Supposedly the Hizbullah has such equipment and used it to detect Israeli soldiers who were resting in a house, during an incursion into Lebanon. The house was targeted with a rocket, with unfortunate results. All this has caused a lot of paranoia about cell phones in armies around the world. When secret orders are to be given, all the participants in the briefing have to give up their cell phones, which have the batteries taken out and are moved to another room. ",
            "date": "Answered October 1, 2016",
            "views": "3",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carolyn Borchard",
                    "user_href": "/profile/Carolyn-Borchard"
                },
                {
                    "user_id": "Hiram Moore",
                    "user_href": "/profile/Hiram-Moore-1"
                },
                {
                    "user_id": "Chaya Rubenstein",
                    "user_href": "/profile/Chaya-Rubenstein"
                },
                {
                    "user_id": "David Ellwood",
                    "user_href": "/profile/David-Ellwood-4"
                },
                {
                    "user_id": "K Y Nilesh",
                    "user_href": "/profile/K-Y-Nilesh"
                }
            ]
        }
    ]
}