{
    "title": "Isn't data privacy the biggest issue for the world right now? - Quora",
    "tags": [
        "Data Privacy",
        "Information Privacy",
        "Internet Privacy",
        "Privacy",
        "Data",
        "Data Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saurabh Gupta",
                "href": "/profile/Saurabh-Gupta-376"
            },
            "answer_text": "I don’t think so! There are way more serious and dangerous issues which need every person’s immediate attention.Eg. - Rising pollution levels,Water scarcity,Decline in civic sense,Etc. There are even bigger issues that demand attention from governments and world leaders.Eg. - Global warming and Climate change,Terrorism,Deforestation,Etc. I guess you are referring to privacy of personal/individual data, i.e., the data from your email, social media platforms, messaging platforms, etc.To be honest, privacy over internet is a myth!If you think your data is not safe in someone else’s hands, then do not provide your details. We need to have certain level of trust over the service providers who receive our data.They also are aware of the security related issues and take appropriate measures to minimize the same.They let you know what your data will be used for, and take your permission for the same.Technically, you cannot blame them for these kind of usage of your information.But there is a certain boundary that this information can be used. This boundary is kind of rules from different governments to protect the interest of their citizens.If anyone if found violating these guidelines, they are subject to further investigation and penalties. After the Facebook-Cambridge Analytica scandal, Data Privacy has gained limelight, which is very good, but most of the people still do not understand what actually happened and are simply spreading wrong and misleading information and creating panic among others.If anyone pays a little attention to the whole incident, it can be easily understood that it was a breach of trust between Facebook and CA which resulted in that situation.It was also a failure from Facebook’s end to not have an eye on such activities. In the end, there were 2 things to note:1. The information which was termed as “breached data” was the one that was declared public by the users.2. The information was used to analyze and plan political campaigns. This incident was political so the government declared it wrong.But same thing happens everyday with each individual, in the form of advertising and ad-targeting.No one bats an eye to it, as a matter of fact people enjoy and encourage that. So the problem is with us.We like to show off on social media, bet get highly offended when someone uses our publicaly shared data. Hilarious! I agree that the agencies who store data must ensure proper guidelines are followed.But I also suggest everyone to share only that much amount of data which is not too personal. And if someone uses your shared data, you cannot blame them unless it is used in an unethical way, which is again vague and questionable. ",
            "date": "Answered July 5, 2019",
            "views": "329",
            "upvotes": " Not for Reproduction "
        }
    ]
}