{
    "title": "Jio being a 4G network does the battery drain faster? - Quora",
    "tags": [
        "4G (wireless communication)",
        "Reliance Industries Limited",
        "Reliance Jio (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sumesh Nandha",
                "href": "/profile/Sumesh-Nandha-1"
            },
            "answer_text": "LTE is designed for high-bandwidth: it can deliver lots of data, very fast. That works brilliantly for a website: in terms of Watts per MB then LTE is the best air-interface. But voice (VoIP, VoLTE) is a continuous stream of small packets with low data rate. Depending on the codec you only need say 10Kbps -- but you need to send those bits contiuously. So you have a very powerful chipset, with a very clever & power hungry modem driving a highly-linear (more power) wide-band (more, more power...) radio -- to deliver a few Kb. In terms of Watts per second or Watts per second of voice, LTE is poor. It's a bit like using your Ferrari as a golf cart and wondering why it costs so much in gas... The power consumption of VoLTE could also be reduced by using the DRX functionality in the MAC layer. This discontinuous reception (DRX) is designed to conserve UE battery power, but is optional and quite probably not used at the moment. Without DRX the UE is monitoring (and trying to decode) the BS every 1ms for data, but with DRX this could be reduced to having the UE only monitor the BS every 5/10/20ms. Most people are not using VoLTE today: they use CSFB (circuit switched fallback) typically to 3G. I wonder if the best idea might be to make an LTE handset with voice as CSFB back to original GSM - ie not 3G, nor 2.5G not GPRS or EDGE but CSFB to 2.0G voice-only old GSM with an incredibly power-efficient GMSK constant amplitude radio... Courtesy : Rupert Baines ",
            "date": "Answered April 20, 2017",
            "views": "136",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaditya S.Bh",
                    "user_href": "/profile/Aaditya-S-Bh"
                },
                {
                    "user_id": "Ashutosh Singh",
                    "user_href": "/profile/Ashutosh-Singh-558"
                },
                {
                    "user_id": "Raghavan Rangarajan",
                    "user_href": "/profile/Raghavan-Rangarajan"
                },
                {
                    "user_id": "Eeshan Miglani",
                    "user_href": "/profile/Eeshan-Miglani"
                },
                {
                    "user_id": "Rizwan",
                    "user_href": "/profile/Rizwan-90"
                },
                {
                    "user_id": "Ramesh Babu",
                    "user_href": "/profile/Ramesh-Babu-167"
                },
                {
                    "user_id": "Sandeep Kumar",
                    "user_href": "/profile/Sandeep-Kumar-16216"
                },
                {
                    "user_id": "Narahari Reddy",
                    "user_href": "/profile/Narahari-Reddy-4"
                },
                {
                    "user_id": "Amol Pawar",
                    "user_href": "/profile/Amol-Pawar-70"
                },
                {
                    "user_id": "Jitesh Ghanchi",
                    "user_href": "/profile/Jitesh-Ghanchi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mani Bharathi",
                "href": "/profile/Mani-Bharathi-90"
            },
            "answer_text": "Oh I am using Galaxy on 8 for the past 1 year with both airtel and jio sims. As per my observation Airtel 4G is consuming lot more battery. I am a bit hungry to know the answer and why? Then i came to understand that jio using volte for voice do if you are having volte supported 4g phone you will notice the difference. usually in Airtel 4G 3 hours of youtube will drain my battery from 100 to zero. but jio 4g gives more than 5 hours of youtube and with 25% battery left. My usual settings are primary sim is LTE for jio and secondary will be airtel 2g. this gives me better battery management. once after the jio 1gb data utilized then i will turn the jio off and will swith Airtel from 2g to 4g. because at a time we can keep only one sim at 4g mode. jio dont have 3g or 2g modes. For battery point of view Jio is lot more better side compared to other 4g networks due to the lack of volte support. i heard that airtel also working on volte technology so hope that they will bring asap. in terms of network coverage, jio 4g really good. for airtel 4g coverage sucks in many areas but 2g coverage of airtel is top notch. Thanks ",
            "date": "Answered September 25, 2017",
            "views": "77",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaditya S.Bh",
                    "user_href": "/profile/Aaditya-S-Bh"
                },
                {
                    "user_id": "Yash Sharma",
                    "user_href": "/profile/Yash-Sharma-720"
                },
                {
                    "user_id": "Surendhar",
                    "user_href": "/profile/Surendhar-5"
                },
                {
                    "user_id": "Varun Rawat",
                    "user_href": "/profile/Varun-Rawat-63"
                },
                {
                    "user_id": "Ankan Dutta",
                    "user_href": "/profile/Ankan-Dutta-12"
                },
                {
                    "user_id": "Nishant Goel",
                    "user_href": "/profile/Nishant-Goel-32"
                },
                {
                    "user_id": "Sneha R",
                    "user_href": "/profile/Sneha-R-35"
                },
                {
                    "user_id": "Ajinkya Chaskar",
                    "user_href": "/profile/Ajinkya-Chaskar-1"
                },
                {
                    "user_id": "Rajib Halder",
                    "user_href": "/profile/Rajib-Halder-10"
                },
                {
                    "user_id": "Vijay Sai Janardhan",
                    "user_href": "/profile/Vijay-Sai-Janardhan"
                }
            ]
        }
    ]
}