{
    "title": "My ass won't let my finger enter. I can enter pen but it doesn't give any pleasure. I used oil and water as lubricants. What is correct way to finger your ass? (I'm a boy) - Quora",
    "tags": [
        "Fingering (sexual act)",
        "Pleasure",
        "Sex"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Dis",
                "href": "/profile/Peter-Dis"
            },
            "answer_text": "The best way to finger your arse is to get someone else to do it. You can’t align your fingers properly when you self finger. You won’t get the best results. See my answers regarding fingering. Peter Dis's answer to Can straight men finger themselves? Peter Dis's answer to When you get fingered for the first time, why does it burn? if you are self-fingering then here are some tips. Relaxation is very important. Use the index finger on the hand that you normally use ( left or right). Put the tip of the finger at the entrance to the arse. Move the finger with a gentle tickling action. Be very patient and you will find that the entrance to the anus gradually loosens and you can very slowly enter. Remember to have your fingernail trimmed and cover your finger with water-based lubricant. There may be some pain the first few times you do this, you are not damaging the anus. In fact I wouldn’t use objects like pens as they are more likely to cause damage. Fingering should give you several pleasures. Firstly there is stretch. This is stretching of the sphincter muscles at the entrance to the arse. This can be highly pleasurable. Then there is the sensation of rubbing against the sphincter area. This is a very sensitive area and you can gain much pleasure from it. The third and probably hardest to achieve with self fingering is depth. The sensation of depth, going in deep, whether you do go in deep or not, is also very pleasurable. It’s interesting to think about what you feel when you do a bowel movement. I know that it means that the faces is going the other way ( out ), but the feelings are the same, you may have noticed that a large bowel movement actually feels very pleasant. That is because the faeces is activating the stretch pleasure as well as rubbing up against the sphincters. Please excuse my diversion, this all fascinates me. A safety warning. The sphincter area can feel pain so if there is something wrong you will know. Beyond the spinsters is the rectum. The rectum does not feel pain. You could do great damage in there and not know it. Be careful what you put inside and how far it goes. Nothing sharp and nothing too small that you might lose up there. You are unlikely to have any problems with fingers though. Unless you are able to clean out your rectum, you may get a small amount of faeces on your finger. Don’t freak out but ensure you properly wash that hand when you finish. Use hot soapy water, a brush and disinfectant . Also wipe down anything that you touched. If you are not careful about this the risk is that you or others will get gut infections. ",
            "date": "Answered March 14, 2020",
            "views": "18",
            "upvotes": " Not for Reproduction"
        }
    ]
}