{
    "title": "My daughter works way too many hours at her job. She’s 23 and works 80+ hours a week as a receptionist. It’s ridiculous. Should I email her boss? Should I send a lawyer to her work? - Quora",
    "tags": [
        "Receptionists",
        "Working Hours",
        "Hours",
        "Daughters",
        "Workplace and Professional Etiquette",
        "Work",
        "Parenting",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paula Arce",
                "href": "/profile/Paula-Arce-6"
            },
            "answer_text": "“Huh. She's only working eighty hours a week? She must be drowning financially, trying to make ends meet so she can afford rent and to live independently….” You have to understand: this was the first thought that popped into my head. The fact that you're freaking out about your young adult daughter working those kinds of hours tells me a few things: You're probably close to Baby Boomer age, and thus- forgive how I'm going to word this, but,People your age have no idea what kind of work it takes to survive in this economy in America.I'm not saying you've never worked, or that you didn't also work hard when you were young, but the fact that you're taking a bizarre personal offense to your daughter's work hours to the extent that you wish to SABOTAGE HER JOB WHEN WE'RE ON THE PRECIPICE OF A GREATER ECONOMIC RECESSION tells me a few things about you that you didn't mean to share: you lack empathy, you lack knowledge or awareness of the true Cost of Living in America, you lack knowledge of the minimum wage in your state and you don't understand how that affects your daughter's earnings. I'm assuming a lot right now, obviously. I'm assuming your daughter would much rather spend time with her friends than working the hours of two jobs. I'm also assuming your daughter lives in a one bedroom apartment in some state in the Union, which currently average about 1,700 dollars for a one-bedroom apartment. Ironically, they're more expensive than a two-bedroom apartment these days… I’m assuming your daughter is human and, at some point in her life, would like to experience the concept of Eating Food. For a lone human being living in a food desert, this can be costly: a three hundred or four hundred dollar endeavour to buy groceries every month. If you live a bit closer to markets, the average cost of groceries for a single person buying responsibly will average between 120 and 150 dollars a month. If you live in a farm-to-table capitol area like myself, you're one of the lucky ones: groceries for a single person cost between 100 and a 120 dollars a month. The FEDERAL minimum wage is something like seven dollars an hour right now. In California, it's become 13. I currently make pennies over the minimum wage (about 13.55 an hour) as a licensed, experienced security professional. Your daughter is a receptionist. Basically, I do her job. The only difference is, she was probably required to have endured debt to get a college degree before her job would hire her; I have college debt anyway despite being unable to finish my own schooling for personal financial reasons (despite personally wanting to finish my schooling and get my degree.). If I wanted to live on my own, I'd have to work over 70 hours a week to barely eke by; I'd have to work 90 hours a week if I wanted to also have savings for both emergencies and “a rainy day fund”. This is all, of course, if I don't have reliable roommates with which to share financial costs. I have friends who regularly work 90 hour work weeks and live in houses… with roommates. They are barely scraping by, despite earning over 14 dollars an hour. That is the world we live in as people in our twenties, thirties, and some in our forties. If you TRULY feel your daughter is overworking herself and you TRULY want to help HER? Petition the U.S government raise the FEDERAL minimum wage to just 15 dollars an hour. I've been fighting for that minimum since I was in high school, sixteen years ago. It didn't raise at all for over ten of those sixteen years, and when it did raise, it didn't raise for more than a few cents at a time. Do NOT, for Christ's sake, email your daughter's boss. If you have the means to hire a lawyer and throw your money around frivolously like that, contact your lawyer to get their help drafting a petition or to lobby the U.S government to raise the federal minimum wage. You may not care about your daughters peers and what happens to us, but your daughter is experiencing the same crap we all are, and she's in the same boat we are. If you want to extend a lifeline that HELPS her and will help her peers, petition the U.S government to raise the federal minimum wage to fifteen dollars an hour (even though, mathematically, it needs to be closer to 33 an hour…). When your daughter is earning more at her joh, she'll be able to afford to take a break and visit dear old mom and dad because she'll be able to afford the luxury of SPARE TIME. But if all you want to do is drown your daughter financially as well as professionally, AND contribute to keeping her and the rest of her generation drowning, by all means: email her boss. Call up your lawyer to discuss how best to sabotage your daughters’ employment. I'm sure your ADULT daughter will appreciate your concern for her and will respond by running home to her constrictive, loving, but not at all empathetic or understanding mother. After all, “Mother knows best!” Right? Exactly like the song Mother Goethel sings in the animated film, Tangled. :/ ",
            "date": "Answered September 5, 2020",
            "views": "39",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Igor Petrik",
                    "user_href": "/profile/Igor-Petrik"
                },
                {
                    "user_id": "Robyn Flux",
                    "user_href": "/profile/Robyn-Flux"
                },
                {
                    "user_id": "Ryan Johnison",
                    "user_href": "/profile/Ryan-Johnison"
                },
                {
                    "user_id": "Marta Karamuz",
                    "user_href": "/profile/Marta-Karamuz"
                },
                {
                    "user_id": "Tre Scott",
                    "user_href": "/profile/Tre-Scott-2"
                },
                {
                    "user_id": "Darienne Howard",
                    "user_href": "/profile/Darienne-Howard"
                },
                {
                    "user_id": "Makaia Warfield",
                    "user_href": "/profile/Makaia-Warfield-1"
                },
                {
                    "user_id": "Jaimee Bruer",
                    "user_href": "/profile/Jaimee-Bruer"
                },
                {
                    "user_id": "Isabelle Burnetta",
                    "user_href": "/profile/Isabelle-Burnetta"
                },
                {
                    "user_id": "B M",
                    "user_href": "/profile/B-M-160"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Joshua",
                "href": "/profile/Steve-Joshua-2"
            },
            "answer_text": "This is such an interesting question, and very ironic, because when I was exactly 23 years old, I was working fulltime in a plastic filler factory . . . you know, the Styrofoam “popcorn” filler you sometimes see inside the boxes & crates delivered to you, which cushions the contents. Yes, that’s actually an industry, and someone actually makes those things deliberately. It was a production line which had to go through many processes, and many days & nights, it was all I could do just to keep up with the production output, as I ran back and forth between the stages of production, somehow keeping everything on track and within the quota. I was a very dedicated worker, but I didn’t always understand how to balance out my obligations to my employer with even my most basic rights as an employee, because for me, the product production & shipping preparations took priority. Consequently, the lunch I brought with me, which my mom lovingly prepared, would go untouched the entire shift, so I would bring it home with me after work, fully intact the way my mom had handed it to me about 9 hours earlier. My mom noticed this, and asked me why I hadn’t eaten my lunch, so I told her that there was no time to eat at work, where I was extremely busy and couldn’t fall behind. The next thing I knew, my outraged mom was on the phone with the head plant boss, asking him why he was giving me so much work, that there was no time to even take a lunch break. At the time of her call, I had no idea of what she had done, but the next day at work, while I was busy with bagging the product, the plant manager walked over to my section, and told me something I will never forget. It’s been 46 years, but I still see in my mind’s eye my boss standing there, and I still hear his voice, and these were his exact words “Steve. Your mom called.” . . . I’m thinking, ‘oh dear God!’ “She says you haven’t been eating your lunch” . . . Me, ‘Oh please somebody, just kill me now!’ . . . “So make sure you take a lunch break today.” I recall responding, “Okay, thanks”, and I briefly considered crawling inside the very next 95 gallon bag I was about to fill with product . . . and yet surprisingly, I really wasn’t all that devastatingly embarrassed. Actually, at that moment, I was too busy at doing my job to feel anything, except I do remember being grateful that no one else was, at that moment, within ear-shot of my boss, AND, I remember being appreciative that the boss man had paid me a visit in my section, and a little relieved that I got the “ok” from the head guy himself to take my lunchbreak(in case anyone were to ask) . . . and at least now, because of that phonecall, my boss must have now realized my dedication to my job. And so, as the months passed, I kinda did become my boss’s “go to” guy. When crippling snows would blanket our county, and my boss could find no one else to work his plant, he would drive through several inches of roadway snow to pick me up at my house, and drive me to work, which gave us a chance to get to know each other on a more human level. There were other times when no one else would show up for work, and consequently, my boss and I were the only ones there to kick-start the machines back into production. Had I stayed with that job longer than the 8 months I was there, I have no doubt I could have received a promotion, or two, although beyond that, there was somewhat of a ceiling toward further advancement. Besides, at 23, I still had my wild oats to sow, & so I went looking for some summer adventure, which I found. It turned out to be the summer of my life. But to get back to the question at hand, it would seem to me that your daughter is probably content for the time being with her employment situation, although I am wondering if she is actually getting paid for those 80 hours, because if she isn’t, then beyond the labor legalities, she’s definitely being exploited, and her employer is, in a very real sense, stealing her time, which carries a very real monetary value. If she’s too intimidated to speak up, I would resist the temptation to intervene on her behalf, and instead I would talk with her about the situation. If she’s not getting paid for her time, then you need to remind her that unpaid employee work time is stolen time. If she IS getting paid for those 80 hours(and I’m assuming that 40 of those hours are at time + 1/2), but she has no time left to live her own life, then this is something which she will have to judge to either be worth it or not worth it. She could also suggest to her employer that he consider hiring another employee to handle the other half of her time and workload, but in any event, and whatever she decides, then really SHE and SHE ALONE should address her workplace situation with her boss, and not you. You must also consider that if you intervene in this, and her employment situation deteriorates in some way, or even disappears, then the blame could be placed on you. However, and having said all of that, you know your daughter’s mind & her personality better than anyone, so perhaps you have some insight into this situation which was not mentioned in your question. In conclusion, just keep in mind that, just because my mom’s method resulted in everything working out for my mom and me, doesn’t mean it will work out for you and your daughter. My mom got lucky on that one. But mom isn’t always right. ",
            "date": "Answered October 21, 2019",
            "views": "296",
            "upvotes": " View 56 Upvoters",
            "upvoters": [
                {
                    "user_id": "Libby Quill",
                    "user_href": "/profile/Libby-Quill"
                },
                {
                    "user_id": "Alexander Brigham",
                    "user_href": "/profile/Alexander-Brigham-3"
                },
                {
                    "user_id": "Dale Raymond Smith",
                    "user_href": "/profile/Dale-Raymond-Smith"
                },
                {
                    "user_id": "Kathryn Krueger",
                    "user_href": "/profile/Kathryn-Krueger-2"
                },
                {
                    "user_id": "Cristian Cruz",
                    "user_href": "/profile/Cristian-Cruz-16"
                },
                {
                    "user_id": "Ayo Mike",
                    "user_href": "/profile/Ayo-Mike-4"
                },
                {
                    "user_id": "Gabriela Bagalá",
                    "user_href": "/profile/Gabriela-Bagalá"
                },
                {
                    "user_id": "JC Graham",
                    "user_href": "/profile/JC-Graham-4"
                },
                {
                    "user_id": "Calysta McGinnis",
                    "user_href": "/profile/Calysta-McGinnis-1"
                },
                {
                    "user_id": "Sarah Scarborough",
                    "user_href": "/profile/Sarah-Scarborough-18"
                }
            ]
        }
    ]
}