{
    "title": "My microphone keeps picking up my computer sounds, how can I fix this? - Quora",
    "tags": [
        "Microphones",
        "Computer Advice",
        "Audio Equipment",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Filipe M. Cross",
                "href": "/profile/Filipe-M-Cross"
            },
            "answer_text": "That sounds like Microphonics or microphony, the phenomenon wherein certain components in electronic devices transform mechanical vibrations into an undesired electrical signal (noise). The term comes from analogy with a microphone, which is intentionally designed to convert vibrations to electrical signals.  Maybe the piece on your headset that holds the mic gets vibration from the rest of the headset and amplifies it through the mic or the cheap cables on the headset are working as a microphone. If you are good at DIY try changing the cables. The other option would be to lower the volume of the headset. Most people today just want loud. What ever it is they need it loud. If it is loud enough the mic may pick it up. ",
            "date": "Answered November 25, 2016",
            "views": "133",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashley Gittins",
                "href": "/profile/Ashley-Gittins"
            },
            "answer_text": "It sounds like it might be your mixer settings are causing the app (skype etc) to record the “mix” or a combination of your sound output and the microphone input. It depends on your OS and your sound drivers as to what this might be caused by, but you want to look for things like “recording source” or options that say it will record the “mix” or “what-you-hear” and turn those off or change them to “microphone”. Of course if your headphones are really loud then the microphone will pick up that as well, you should be able to tell the difference based on the quality of the sound. ",
            "date": "Answered November 26, 2016",
            "views": "118",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josh Sheldon",
                    "user_href": "/profile/Josh-Sheldon-10"
                },
                {
                    "user_id": "Guro Gengar",
                    "user_href": "/profile/Guro-Gengar"
                }
            ]
        }
    ]
}