{
    "title": "On average, how long did it take to build an Egyptian pyramid? - Quora",
    "tags": [
        "Pyramids of Egypt",
        "Ancient Egypt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Pfister",
                "href": "/profile/Michael-Pfister-5"
            },
            "answer_text": "This is a matter of great debate. Most estimates are 20–30 years to build something like Khufu’s pyramid, which contains anywhere from 2.3 million to 3 million blocks in the 2-ton range. We don’t even know how they managed to lift the blocks up the side of the pyramid for sure. :-) Sneferu, however, may be the greatest pyramid builder. He built three! The first one, known as the Medium Pyramid, had a core that looked more like a fat obalisk or step pyramid, and was finished on the outside with an outer sheath that completed the pyramid shape. This outer layer at some point collapsed, either through catastrophic failure or more gradual decay (also a point of major debate). His second pyramid is known as the Bent Pyramid, and it is unique for two reasons: First, it has a “bend” where the angle of rise changes about half-way up. Second, it retains most of its original limestone cladding, giving a better idea than any other pyramid what it probably looked like when it was new. Sneferu also built a final, third pyramid at Giza, using the same angle as the upper half of the bent pyramid in what is a beautiful example of precision engineering. I guess third time was the charm! :-) But the significance - the first two pyramids were never really completed. As a result, there are clues to their construction visible. In particular there are references to Sneferu’s reignal years written on blocks in the Bent Pyramid (I believe) that indicate when they were laid that indicate that a block laid half-way up the pyramid was laid 2 years after a foundational block. This means it may have only taken 3–4 years to build! Which is absolutely astounding. The fact that Sneferu had three built during his reign helps to further the idea that it went faster than the 20–30 years generally ascribed but the effort required to lay 2-ton blocks of stone every 20–30 seconds or so… Yeah. I can understand the controversy. So ultimately, we don’t know. I personally think it probably took something between the short (3 years) and long (30 years) estimates and settle on something more like 8–10 years, with a couple of those years being used to prepare the site and let the quarry get ahead on producing those massive blocks so that a supply of them would be pre-positioned at the building site. But in the end? No one knows… ",
            "date": "Answered June 24, 2016",
            "views": "92",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cecil Shive",
                    "user_href": "/profile/Cecil-Shive"
                },
                {
                    "user_id": "Tu Tran",
                    "user_href": "/profile/Tu-Tran-54"
                },
                {
                    "user_id": "Andy Piper",
                    "user_href": "/profile/Andy-Piper-7"
                },
                {
                    "user_id": "Roger Pearlman",
                    "user_href": "/profile/Roger-Pearlman"
                },
                {
                    "user_id": "Kunnal Sharma",
                    "user_href": "/profile/Kunnal-Sharma-3"
                },
                {
                    "user_id": "Cesilia Sanchez",
                    "user_href": "/profile/Cesilia-Sanchez"
                },
                {
                    "user_id": "Anirban Dutta",
                    "user_href": "/profile/Anirban-Dutta-23"
                },
                {
                    "user_id": "Siddharth Sarangan",
                    "user_href": "/profile/Siddharth-Sarangan"
                },
                {
                    "user_id": "Frank Lees",
                    "user_href": "/profile/Frank-Lees"
                },
                {
                    "user_id": "David R. Carpenter",
                    "user_href": "/profile/David-R-Carpenter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Hoch",
                "href": "/profile/Alan-Hoch"
            },
            "answer_text": "There is a basic fallacy in this question, namely that it implies that all Egyptian pyramids were basically the same. In fact, they came in all sizes with differing qualities of building, all of which combine to suggest possible time periods for construction. The most obvious and famous example of a pyramid is, of course, the Great Pyramid of Giza which the Pharaoh Khufu built as his tomb, which was built in the 4th Dynasty during the first half of the 26th century B.C. The quarry for the vast majority of the structure’s stone and the living quarters of the workers have been found, indicating that the Egyptians employed a quite sophisticated level of organization to make the process of construction as efficient as they could manage. It is thought that the number of workers - who were not slaves, but rather citizens paid for their work - varied considerably over the year according to the agricultural seasons. The growing cycle in ancient Egypt relied entirely on the Nile which itself followed a predicable pattern where the farmland would be flooded by the rising waters and replenished with nutrients after which that year’s crop would be planted. Then, after a few months more the result would be harvested. Point is that this pattern allowed for months of time when most people (the vast majority of ancient Egyptians were farmers) had nothing important to do. That freed up tens of thousands to work on government projects like pyramids, work that was considered a religious act of devotion. Thus, during the times when labor was plentiful the number working on the Great Pyramid could climb high, perhaps into the tens of thousands. However, more modern estimates put the required amount during this time as between 10 and 20 thousand. During the planting or harvesting periods, however, the numbers available fell to a year-round staff of a few thousand at most. Thus, the amount of stone laid was a good deal greater during the slack agricultural periods. Still, estimates are that the Great Pyramid still “merely” required from 10 to 20 years of effort to finish, although of course there might have been social issues involved that pushed the process to be hurried up or slowed down (such as the labor being required for some other project or a famine reducing the amount of people available, etc.), but the time and number of people required are generally thought to be less than many have assumed in both the past and present. But, the Great Pyramid is merely the largest and most impressive - also, arguably the best built - pyramid. There were plenty others that were a good deal smaller and built to a good deal less quality. Surprisingly, after the heights of the pyramids of Giza the size and quality steadily declined until by the time of the Middle Kingdom they were sometimes just relatively small piles of mud brick with a covering of stone. The reason for this is thought to be that unlike in the 3rd - 4th dynasties where the power of the pharaoh was near absolute, in the later dynasties the power of the ruler in comparison to the noble/priestly elite declined. This meant that the Pharaoh couldn’t monopolize the kingdom’s resources so completely, many now shunted to the construction of palaces, temples, the tombs of more minor officials, and so forth. Furthermore, the religion of ancient Egypt evolved where such mega-structures weren’t as important to obtain eternal life, but rather various rituals and abstractions like tomb paintings. This change also made the supposed achievement of eternal life more egalitarian and thus available more easily to a wider range of individuals, but who then required more diversion of resources to their needs and not merely that of the ruler. There was also the bonus that requiring less to achieve life-after-death reduced the risk that a Pharaoh might die before his tomb was ready, an event that might put his own afterlife in danger. There were, after all, plenty of rulers who didn’t have the sorts of 20+ year reigns required to guarantee the completion of a major pyramid. Thus, one of these later pyramids could have required only a few years to complete using far fewer workers. Of course, the great limitation of pyramids is that they do a great job of illustrating to everyone exactly where all the late Pharaoh’s goodies could be found and robbed. Added to the great effort required to build them and by the New Kingdom pyramids had for the most part been abandoned with the elite buried in tombs carved into the sides of mountains which were hoped to be harder to raid. ",
            "date": "Answered October 16, 2017",
            "views": "2",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cecil Shive",
                    "user_href": "/profile/Cecil-Shive"
                },
                {
                    "user_id": "Rob Johnston",
                    "user_href": "/profile/Rob-Johnston-13"
                },
                {
                    "user_id": "Tu Tran",
                    "user_href": "/profile/Tu-Tran-54"
                },
                {
                    "user_id": "Johanna Annette te Lintum",
                    "user_href": "/profile/Johanna-Annette-te-Lintum"
                }
            ]
        }
    ]
}