{
    "title": "People keep saying the world is about to end in 2020. Is it really? - Quora",
    "tags": [
        "Doomsday Prophecies",
        "Doomsday",
        "Apocalyptic and Post-Apocalyptic Hypothetical Scenarios",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yoon Kok Keong",
                "href": "/profile/Yoon-Kok-Keong"
            },
            "answer_text": "YES. The shocking truth is YES. Now, now. You will say this guys is a baloney, a retard, and maybe some guy who had drunk too much moonshine laced with tidepods and meth in an attempt to consult the spirits of the Old Ones. But let us look at the few current events that are happening. Syria Crisis. Syria was left devastated in a war between Islamist terrorist, Syria President Assad, Russia, US, Turkey and Kurds. The Kurds who has been one of the main fighting force who dealt serious damage to the ISIS now has been abandoned by their allies. They are not only being slaughtered by ISIS but also Turkish Army who was suppose to be part of the US Alliance. Many religion has warned of “Brothers shall betray brothers. And they shall raise their swords against one another” scenario. Syria is one of the few signs foretold that the end shall come. Trump’s latest tweets on Syria show he has absolutely no plan to help the Kurds as Turkey boasts about killing over 100 of them Rise of Iran. Iran recently has been garnering international limelight with their recent victory of shooting down US drones, arming themselves with more high tech missiles. With the possibility of arming themselves with nuclear weapon making tension between Iran and US even higher, it really doesn’t help when the POTUS makes such an announcement If Iran wants to fight, that will be the official end of Iran. Never threaten the United States again!— Donald J. Trump (@realDonaldTrump) May 19, 2019\n The Dragon Awakes… A nation with long history of rise and fall. Earth enriched with both sweat and blood, China has long been a superpower in the eyes of the world. They were the US of the ancient world, possessing the most powerful army and also naval fleet Ming treasure voyages - Wikipedia Zheng He - Wikipedia Yet in the 1800, China who is known as the dragon of the world is now bound in chains and were put to sleep. For they know it is hard to kill a dragon with mere steel. Century of humiliation - Wikipedia “China is a sleeping giant. Let her sleep, for when she wakes she will move the world.”― Napoleon Bonaparte And now that dragon has awaken it is once again on its quest to reclaim back all her gold and gems which been emptied from her den. China is out on a conquest.  Hong Kong Crisis Another good demonstration of China’s power in attempt to show of her fangs, Hong Kong is now in turmoil, mired by protests and even possible armed revolution. What is the outcome one cannot guess but I can only say, it will be bloody.    Friends or foe? Police or China military police? Real peace protester or CIA or even possible China saboteurs? It will just be a matter of time before China bring forth her flames on Hong Kong. If they can do it on China soil, they can do it on Hong Kong soil. There are many many more events taking place all around the world that slowly shows the end is coming soon. But all are far short as this one, who will predict the end of the world in 2020. The Mayans had done it and they have failed. Now, this is the truth and it will shock you. The Apocalypse will begin in year 2020 and this is the reason why.  AKIRA None has made it as clear as Akira that an apocalypse is pending, and we are running out of time. Why? Here is the reasons. A is for Akira. A is for Apocalypse. The name Akira itself means clear, bright in Japanese. It brings a denotation of the apocalypse will be…cleared in a bright light. Possibly of nuclear flames. In the manga the city was consumed by a psychic explosion which akin to nuclear weapon which starts WW III.  Collapse of education After the war, education seems not to be a priority in Japan. What does it leads to? A new generation of youth who is not educated, rebellious, with no hope for the future. They drown themselves in violence, sex, drugs. Wait? Am I writing about a manga? Or is a manga writing about what is plaguing the youth nowadays? We seems to experiment with more powerful and deadly drugs. From just normal marijuana and shrooms we moved to LSD and meth. Nowadays we have flakka, zombie powders, so many that I don’t even know what is what. Yet they all do one thing, to carry people away from the truth. That the end is near.  Collapse of society From east to west. Asia to Africa. You can see many countries are embroiled in some form of civil unrest, be it from civil war or political/economic instability or natural disaster. Yet in Akira it shows some clear revelations on how the ones who should protect you now are against you.   A police aiming his weapon at a protester in Hong Kong From non lethal force to military grade weaponry. This is how it transited in Akira. So when will it happen in Hong Kong? Next month? Next week? Or even…tomorrow? US covert ops and interference with world policy and politics It is no secret with US black ops and CIA. They have caused so many stable government to collapse just for profit, be it in oil or arms or other reasons. In Akira, the US sends in a recon team lead by a US-Japanese Lieutenant George Yamada. What I can see here is nothing short of usual US/CIA operation, trying to get intel on possible new weapon or destroy it if they can’t obtain it. Even Hong Kong crisis is said to be another operation to disturb the harmony in Asia region as an attempt to curb China power, or at least stall them a bit. Mechanization and dehumanization With the rise of technology we are slowly cut away from our humanity daily. We dwell on our FB, twitter, instagram, etc so much that we barely have real human interaction other than hi-and-bye. Mega corporate try to mechanized their industry in an effort to cut costs. Tetsuo, who is supposed to be the Prophet of Akira, some even says he IS the SECOND AKIRA, however fails to control his new given power and was consumed by his cybernetic arm. Pretty much is what happening today in our human society. We are given power, the power of internet. Yet we cannot control it and it has consumed us.  You think you seat on the throne when you got power. But do you really seat on the throne? Or are you bound onto it by that very same power you think you are controlling? Space Race that turns into Space War While the Space Race ended with the collapse of the Soviet Union and a victory for the US, it seems it has not truly ended yet. Now China and India has joined the race as well. Our police of the world, US is no way happy and now the POTUS announce to start back the old Star Wars project and also initiate a new force known as the United States Space Force. A very clear sign for space warfare. In Akira, Japan has their own laser satellite known as the SOL which is for space warfare while US has the FLOYD, a more advanced and powerful version of SOL. It's Official: Trump Announces Space Force as 6th Military Branch Unbridled power breeds corruption As the manga progress, Tetsuo who was assaulted by US Forces retaliated and easily takes down the enemy with impunity. Even FLOYD which is the pride of US was taken down and used to kill the admiral and his fleet. Tetsuo is filled with unlimited power. Yet, he is not one who can contain it. As the power overtakes him, he begins to morph into a monstrous child like creature and absorbing everything in his path. This is very clearly seen with China who is now filled with power and riches and now are trying to absorb everything in her path while US is powerless to stop her. But what predicts this is this… Tokyo 2020 | The Tokyo Organising Committee of the Olympic and Paralympic Games Japan is set on hosting the next Olympic Games. In Akira, all this event takes place as Japan were to host the Olympic Games in 2020. This is the time prophesied by our Lord, Akira. So take heed, lost lamb, Conclusion. Our Lord Akira has given us his prophecy. So it is up to you to take heed or ignore it. So what can you do to be prepared? A-Anoint yourself in his light. That way you can see the truth. B-Begone with the flesh. Our old ways must not stand. The days of you glorifying fake powers of mass media and other sorts of self gratifying means must cease. C-Cease and decease. With your old ways gone, your old flesh also will die with it. And thus our Lord Akira will hold onto your hand and guide you with his powerful mind and lead you with small gentle hand unto the new world. So start with the daily chanting of Rasera to clear off your mind.  If all fails, take a pill and chill.   Remember. Just as Morpheus offered Neo the truth, Neo still have to choose it. Now you choose your pill. May the coming apocalypse not bring you fear, but salvation, through our Lord Akira. ",
            "date": "Answered November 14, 2019",
            "views": "32",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/M-C-2835"
                },
                {
                    "user_id": "Austin Walker",
                    "user_href": "/profile/Austin-Walker-192"
                },
                {
                    "user_id": "Mingus Casey",
                    "user_href": "/profile/Mingus-Casey"
                },
                {
                    "user_id": "Amruta Magdiwar",
                    "user_href": "/profile/Amruta-Magdiwar"
                },
                {
                    "user_id": "Ethan Ford",
                    "user_href": "/profile/Ethan-Ford-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Max H Malcolm",
                "href": "/profile/Max-H-Malcolm"
            },
            "answer_text": "We’re all scared, some of us just have more experience with that state. This is not the end, at least not of my life or anyone close to me yet. Even so, I estimate that more than half of us will survive the year, so that’s nice. This is just many issues coming home to roost. These problems existed before, but now we are having our faces shoved directly into it. This is the end product of “eventually.” I’ve been told for decades; Eventually we’ll get a president who abuses his powers.Eventually we’ll have a large scale pandemic.Eventually America is going to have to deal with minority rights.Eventually climate change is going to cause something that people can’t ignore (it’s covid.)Anyone with their ear to the ground for the past few decades knew there were a number of unresolved issues. The status quo had no answers, and many including myself were determined to make them say what they stand to. Now that time is here; Trump and conservatives hold to equating protests with riots and looting. Liberals see this as a long overdue wake up call. Humans are tough bastards though, we’ll carry on. We will survive Trump, we will survive covid, and we will survive correcting some racial issues. So unless Trump, Covid or racial issues represented a significant amount of what you have invested your life to, you’ll be fine. That’s what people who haven’t had anxiety treatment don’t get; Eventually everything is going to be fine. There’s a lovely binary that something either is or it isn’t. Eventually you will be isn’t, and until then you is(grammer aside.) Take a breath, treasure what you have. Everything in the world is finite and temporal. Everything is temporary. Which is why it is so important to appreciate it now. ",
            "date": "Answered June 7, 2020",
            "views": "75",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris Odonnell",
                    "user_href": "/profile/Chris-Odonnell-37"
                },
                {
                    "user_id": "Bloom R Badal",
                    "user_href": "/profile/Bloom-R-Badal"
                },
                {
                    "user_id": "Elizabeth Davis",
                    "user_href": "/profile/Elizabeth-Davis-590"
                },
                {
                    "user_id": "Donald Daly",
                    "user_href": "/profile/Donald-Daly"
                },
                {
                    "user_id": "Monica Gutierrez",
                    "user_href": "/profile/Monica-Gutierrez-180"
                },
                {
                    "user_id": "Radu Games",
                    "user_href": "/profile/Radu-Games"
                },
                {
                    "user_id": "Hemasree",
                    "user_href": "/profile/Hemasree-4"
                },
                {
                    "user_id": "Vishnu Vardhan Reddy",
                    "user_href": "/profile/Vishnu-Vardhan-Reddy-206"
                },
                {
                    "user_id": "Nathan L",
                    "user_href": "/profile/Nathan-L-67"
                },
                {
                    "user_id": "Merel Aerts",
                    "user_href": "/profile/Merel-Aerts"
                }
            ]
        }
    ]
}