{
    "title": "Personally, what features make a smartphone useful? - Quora",
    "tags": [
        "Mobile Technology",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sergiu Antoniu Alexa",
                "href": "/profile/Sergiu-Antoniu-Alexa"
            },
            "answer_text": "Mostly, a well optimized hardware & software environment. In cases in which the hardware is well optimized to work well with the software, the battery can last far longer than on phones with batteries of the same size. Also, the CPU can perform way batter than on other phones that have the same CPU inside. For RAM management, the OS deals with this. And since Android and iOS are pretty bad at RAM management lately, there is no better example than Windows at RAM management, mainly because it only uses as much RAM as it needs. Other than a well optimized environment, I don’t really want anything else but a fully functional smartphone, that can go online, take and make phone calls, have mobile data, have a usable flashlight (this goes for iOS 4 -> iOS 6, Android 1 -> Android 6), have a good stereo setup (front facing speakers that have the same frequency response and that don’t get too loud in a phone call), a big front-facing camera with wide angle (see Xperia XZ1 Compact), a big rear-facing camera with step-by-step optical zoom (something that has only been somewhat well done by Samsung in the Galaxy S4 Zoom, as that redefines the term big camera on a phone), under 4.7″ screen size, a headphone jack, a USB port (micro, B or C, I really don’t care), capacitive NavBar buttons, fingerprint in power button, volume buttons zoom in the camera app. ",
            "date": "Answered August 6, 2019",
            "views": "241",
            "upvotes": " Answer requested by Toni Miguel"
        },
        {
            "author_info": {
                "name": "Amiel Malay",
                "href": "/profile/Amiel-Malay"
            },
            "answer_text": "That depends on what you need from your smartphone. Is it connectivity through instant messaging? Then you will need Messenger, Whatsapp, Facebook, and so on. Is it office productivity? Access to your office email, document collaboration, teleconferencing? Then you may need MS Office (mobile version), Is it online gaming? That will be Mobile Legends, PUBG, Fortnite, and so on. Is it for physical fitness? Google Fit, FitBit, Strava, etc. And so on… ",
            "date": "Answered April 11, 2019",
            "views": "42",
            "upvotes": " Answer requested by Toni Miguel"
        }
    ]
}