{
    "title": "Politics affects to scientific revolutions? How? - Quora",
    "tags": [
        "Scientific Revolutions",
        "Revolution",
        "Science",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Vasii",
                "href": "/profile/Dan-Vasii"
            },
            "answer_text": "In two ways: one, through financing, since fundamental research is not directly producing money; and through different economic policies, favoring or disfavoring certain technologies. Today technology, science and research are almost one monolithic entity… Sometimes technology affects society and triggers scientific revolutions, and then the politic establishment will oppose this scientific revolution, especially when is just a part of social revolution (like the Industrial Revolution, involving social movements preceding it, like la Fronde in France, the English Civil War won by Cromwell, the French Revolution; the scientific revolution involving the Renaissance and Enlightenment, was opposed by the Catholic Church). But scientific revolutions are not as obvious as social movements are. Today there is a scientific revolution, but imperceptible - because it involves first a fundamental change in the way children and adults are educated. The importance of STEM is gradually appreciated and acted upon; but it will take at least one or two generations until a scientific revolution will emerge due to that. Add to this the transitional period in which we live - society is turned up side down because we now are between the old Industrial Age and the new Post-Industrial Society, foretold by Alvin Toffler in his books (The Third Wave - First Wave - from hunter-gatherer to farmer(Agricultural Revolution, Antiquity+Middle Age); Second Wave, from farmer to worker (Industrial Revolution, Modern Age), Third Wave, from worker to brain-worker(Post-Industrial Revolution: AI+Robotics+3D Printing). ",
            "date": "Answered September 18, 2020",
            "views": "195",
            "upvotes": " Answer requested by Ziya Bektashi"
        }
    ]
}