{
    "title": "Project Fi (Google): What is Project Fi? - Quora",
    "tags": [
        "Google Fi",
        "Google Products and Services",
        "Wireless Technology",
        "Cellular Service Providers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nipun Sher",
                "href": "/profile/निपुण-Nipun-Sher"
            },
            "answer_text": " Project Fi is Google's very own wireless cellular network. Basically, it's Google's foray into being a MVNO. The service combines Wi-Fi, Sprint, and T-Mobile; depending on whichever network is the strongest, it would seamlessly switch to use that particular network. Google gives a better explanation:  Project Fi aims to put you on the best network wherever you go. As you move around, the best network for you might be a Wi-Fi hotspot or a specific 4G LTE network. We developed new technology that gives you better coverage by intelligently connecting you to the fastest available network at your location whether it's Wi-Fi or one of our two partner LTE networks. As you go about your day, Project Fi automatically connects you to more than a million free, open Wi-Fi hotspots we've verified as fast and reliable. Once you're connected, we help secure your data through encryption. When you're not on Wi-Fi, we move you between whichever of our partner networks is delivering the fastest speed, so you get 4G LTE in more places [Source] To get more details about how this would work, go here: Network. Here are some specifics about the service: As of now, the service is only available for Nexus 6. The service requires no contract and there is no termination fee.For $20 you get unlimited talk and text. In addition, you pay $10/GB for data.You would be paid back for any unused data. For example, if you get 2GB of data per month but only use 1.3GB, you get back $7 at the end of the month. Overages works the same way. To get more details about the plan, go here: PlanThe service is available only for individual users, i.e., everybody must buy their own plan. Additionally, there is no family plan, and thus, users can't share data with each other.It will provide coverage in 120+ countries, with the same data costs ($10/GB) as in the United States. However, you won't get 4G speed. In addition, you get unlimited international texts, and international calls will set you back by 20 ¢/min.Your phone number will live in the cloud, which would give you the ability to call and text from any device. To know how this would work, go here: ExperienceIt includes WiFi tethering.The service is invite only right now. If you want, you can sign up for it here. To me, this seems like a bold move from Google -- similar to Google Fiber. If successful, hopefully, this will put pressure on the two big telecom players, AT&T and Verizon, to drop their rates. However, I am not switching for couple of reasons: 1) I don't have a Nexus 6, and I am not too keen on coughing up hundreds of dollars just to use this service. 2) I am not too sure about the quality of coverage Project Fi will provide -- at least, right now. It's piggybacking on top of Spring and T-Mobile networks, which, compared to AT&T and Verizon, don't have the same quality of coverage (in my experience, at least). I lifted the following images from an article on The Verge [link below] which illustrate this point: How exactly does Google Fi's coverage stack up to AT&T and Verizon's networks?   AT&T 4G LTE coverage: Dark orange is LTE, orange is 4G, and light orange is 3G   Google Fi Coverage: Dark green is LTE, green is 3G, and light green is 2G   Google Fi on the left | Verizon 4G LTE coverage on the right.  From the images, you can see that Project Fi's coverage pales in comparison to AT&T's and Verizon's. Also, if I were in Montana I'd have this to say: Et tu, Google?  Useful Links-------------------> How does Google Fi's coverage compare to AT&T and Verizon? -> Google Wireless Service Undercuts Phone Plans-> Price comparison: Google's Project Fi versus Verizon, AT&T, Sprint, and T-Mobile Video by Google: Innovating in connectivity and communication  ",
            "date": "Answered April 22, 2015",
            "views": "164",
            "upvotes": " View 48 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kelvin Ho",
                    "user_href": "/profile/Kelvin-Ho"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Harsh Baranwal",
                    "user_href": "/profile/Harsh-Baranwal-23"
                },
                {
                    "user_id": "Rohit Raj",
                    "user_href": "/profile/Rohit-Raj-62"
                },
                {
                    "user_id": "Sandeep Nair",
                    "user_href": "/profile/Sandeep-Nair-60"
                },
                {
                    "user_id": "Slokesh Sloki",
                    "user_href": "/profile/Slokesh-Sloki"
                },
                {
                    "user_id": "Avaneesh Pandey",
                    "user_href": "/profile/Avaneesh-Pandey-1"
                },
                {
                    "user_id": "Tony Rednik",
                    "user_href": "/profile/Tony-Rednik"
                },
                {
                    "user_id": "Navreen Kaur",
                    "user_href": "/profile/Navreen-Kaur"
                },
                {
                    "user_id": "Shruti Dutt",
                    "user_href": "/profile/Shruti-Dutt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanghamitra Jagtap",
                "href": "/profile/Sanghamitra-Jagtap"
            },
            "answer_text": "3 new phones have been added to the Google’s Fi project – The Moto G6, V3, and LG G7. The Google Fi phone plan project will be a revolution in the market by providing good plans at a really cheap rate. There were very few phones added in the list of Google Fi’s project, their very own Google Pixel and Pixel 2 phones, Nexus 5X and 6P, as well as the Moto X4 and its Android One variant. The company has always been strict as to which phones the project will be supporting. The Google’s network anyways is different from its competitors but the Fi’s ability helps us to switch between the networks of T-Mobile, Sprint, and U.S. Cellular to provide users access to the strongest signal in a given area.  The service provides $20 for unlimited texts and calls plus $1 for 100 MB of data you can use and a ‘bill protection cover of $80. You can buy the phones via Fi’s site, the Moto G6 costs $ 199 which is currently available for preorder whereas the G7 ThinQ and the V35 ThinQ will come to Project Fi this month with a $50 Fi service credit for each preorder. More Benefits A huge benefit is “unlimited” plan every month only if you use 6 GB of data. For other months when you use less than 6GB the bill is up to $80. You can set a “Group plan” where six people can share the same account even for billing. The same plan for individual applies you but the plus point is you save $5 per person. Billing is handled centrally by the account owner, along with data limitations for each user (if needed) — Bill Protection data usage limits are also handled on a per-person basis. The Project Fi charges the group admin collectively but can also facilitate payments back to the account admin from each member to pay their share. Individuals can come and go from a Group Plan as they wish, without any contract. The Working of Project Fi It requires a special sim card and an app on your phone. The app authenticates you on T-mobile, Sprint and US cell and also switch between them based on a variety of factors. On the Pixel 2 and Pixel 2 XL, the eSim is responsible for switching between the other carrier sim and Project Fi.  Instead of using mobile data for calls and browsing you can use WiFi. The extra software ” WiFi assistant” will connect you to the nearest access point. Some Google voice special features are integrated into project Fi forward phone calls to your Fi number to any phone you want, as well as view voicemail, make calls and send texts with that number from any device using the Hangouts app and website. The Google’s Fi works internationally around 120 countries. You can call at a flat rate or even via WiFi internationally at lower rates. Data used internationally just comes out of your standard $10 per gigabyte bucket, but speeds can vary depending on the country you’re in. Why Google Fi? The pricing is really low then the competitors and the project extends worldwide, the only issue is limited phone access. The Project Fi simplifies most of the things worldwide and makes networking connection easy and simple. There are lots of cool features that make Project Fi a good choice, like the simplified billing, included international features and improved network coverage through the use of three carriers and Wi-Fi networks….Read more ",
            "date": "Answered June 4, 2018",
            "views": "524",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aniruth Narayana",
                    "user_href": "/profile/Aniruth-Narayana"
                },
                {
                    "user_id": "Raghav Mulgundkar",
                    "user_href": "/profile/Raghav-Mulgundkar"
                }
            ]
        }
    ]
}