{
    "title": "Should software be patented? - Quora",
    "tags": [
        "Software Patents",
        "Patent Law",
        "Patents",
        "Intellectual Property"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Paradies",
                "href": "/profile/Chris-Paradies-2"
            },
            "answer_text": "YES! All software is copyrighted from the time it is fixed in a “tangible medium of expression” (i.e. stored for retrieval somewhere). If the software is going to be published, then registration of a copyright in the software gives extra benefits: the right to sue;presumption of ownership;attorneys’ fees, if registered within 3 months of publication or before infringement takes place;statutory damagesRegistering a copyright in software is not straightforward. You have to know what portion of the software was created by you or your company or for you or your company. You’ll need a work made for hire agreement and/or assignment if the software was created by others. The copyright in the portion that was created by or for you is what you own. Any third party licensed libraries or the like must be disclaimed (or left unclaimed if separable from the portion copyrighted). It’s a good practice to keep documentation of your software development process and what code was actually developed from scratch during the process, who created it, what agreements were the rights to the code transferred under, and any portions of the code that were licensed from third parties and what license. Open source has it’s own issues. So make your copyright attorney aware of any open source licenses that your code is subject to (and the type of open source license). Now, about patenting software… Not all software is able to be patented. The software must be “patent eligible” under Section 101, new under Section 102, and nonobvious over the prior art under Section 103. You’re going to need a patent attorney for this, a good one. It’s not easy for even a patent attorney to say what will or won’t be able to be patented for software inventions. The law is continuing to evolve in this area so fast. Conclusion Use a state bar certified IP attorney & U.S. registered patent attorney for protecting your rights in software. This evolving area of law is not for the novice DIYer. Be prepared to pay extra for hiring the best attorney that you can find. You and your IP attorney may have to collaborate to find a way to protect your IP rights in software, as neither copyright nor patent law may be a good fit. Think about ways that you can distribute your offering without giving others access to the software. Can it be protected by trade secret law? How much about the operation of the software can be hidden from the end user? What terms of use and conditions can you place on the use of the software? ",
            "date": "Answered June 17, 2019",
            "views": "59",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amy Lau",
                    "user_href": "/profile/Amy-Lau-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "All software is automatically protected by copyright. Registration grants additional protection, such as having your legal fees paid after you sue. But that doesn't protect your patentable innovations. If your software has such an innovation, it should be patented.  For YOUR project, you would want to see a lawyer and determine if patenting it is appropriate and possible. ",
            "date": "Answered June 17, 2019",
            "views": "20",
            "upvotes": "0"
        }
    ]
}