{
    "title": "Should I buy a MacBook Pro? - Quora",
    "tags": [
        "MacBook Pro (product)",
        "MacBook",
        "Apple (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Orange Group Tech",
                "href": "/profile/Orange-Group-Tech-1"
            },
            "answer_text": "Short answer: no. Long answer: Unless you have a specific reason to. If you do iOS app development or want the seamless Apple ecosystem, go for it rather than an unstable hackintosh. Good factors about the MacBook Pro:1) The trackpad. The trackpad is amazing compared to many other Windows laptops that have awful trackpads. (Disclaimer: trackpad sucks on bootcamp) 2) Sound quality. The MacBook Pro has wonderful sound quality (sucks on bootcamp too). The audio is crisp that you’d be pampered by it and would really hate the sound quality of Windows laptops. Why won't I buy it? There are a few factors. 1) Battery life. Battery is horrible and needs to be constantly charged, which causes the battery to deteriorate super quickly. 2) Where are my **PORTS?!** To IT pros this may be controversial, but to a normal user that has a whole bucket of USB-A accessories including your flash drive and your external SSD, USB-C is not going to cut it without tangling yourself with dongles. 3) Graphics (for 13-inch version). It just sucks. Intel Iris Plus Graphics? Yuck. 4) macOS. macOS is one of the most buggy and unstable OSes, which is buggy (as said), bloated and slow. Trust me, ask around and you'd find that every Mac user has experienced at least 1 kernel panic in their life. And Apple just doesn't want to address this issue. 5) Display. This may be controversial. The display itself has a high resolution and is actually great, but it is the shiny type where when your kid touches the display lightly and you'd have a hard to remove smudge on it. You wipe with your finger instinctively. It gets worse. 6) Price. Apple priced themselves out of the market. Really. For this kind of specs, 4 USB-C ports and no other ports (ugghh if you have other USB-A accessories), a rubbish display that smudges when you touch lightly on it (even though the display in tech terms is good in resolution) and an absolutely shi t graphics, not worth spending S$2699 (or US$1799) for the 4 thunderbolt port version. ",
            "date": "Answered September 8, 2020",
            "views": "665",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tejas Shetty",
                    "user_href": "/profile/Tejas-Shetty-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sushruth Muralidharan",
                "href": "/profile/Sushruth-Muralidharan"
            },
            "answer_text": "Here is my honest experience with the Macbook Pro. After school, I was going to start college and needed a laptop. I convinced my dad to get me a laptop. I liked the sound of having an apple product, so decided to go ahead with getting a Macbook Pro. This was around mid 2011. This was before I gave importance to specs and other factors. It was more of a whimsical choice. It was expensive, but my dad did not mind investing in it. I started using my mac for regular stuff, torrenting and surfing :P. It was only after I bought it, I realised that was going to be much harder to game in it. I was disappointed at first, but after some searching, found out that there are games I could play directly or with the help of some wrappers. I also installed windows on dual boot for games where I could not find the right installation for OSX (Arkham city when it was just released). Since then, I have played counterstrike, cod mw, cod black ops, batman Arkham city (played on OSX too later when it was released), batman Arkham asylum, Dota, GTA SA, Assassin’s Creed 2, AC: brotherhood and Borderlands 2 on my mac. Most were at low settings, some of these games did lag at times, but on the whole, I was able to play all of them without making much of a fuss. I have used my macbook for coding in C++, PHP, Python and Fortran. Also have used both Mathematica and Matlab. I have run demo servers on my laptop when building websites for various reasons. My laptop was the server for a treasure hunt that my batch hosted in college. There were a few hitches when many people were accessing it, but on the whole it was fine in then end. I have also used my laptop for editing and composing videos and shortfilms . I have used adobe after effects, adobe premier pro and Imovie for all of these. The display and trackpad were always great with the mac, but the speakers were not too good. It was great to watch movies, but not with too many friends in a loud hostel environment. Whenever I tried to use some one else’s laptop, I found their trackpads very unnatural and hard to control. Now you should understand that I use my laptop in a very rough manner. I carry it around almost everywhere I go. I use it without shutting it down for months... possibly years together. I sleep with the mac open and kept next to me. It even had a terrible fall from on top of a table once. So bad, that the metal casing got a small dent. That also gave a small crack on my screen, which I realised only a few week’s later. It was not particularly visible. The Macbook Pro was and is one of the most durable laptops I have ever seen, and possibly in the entire market. Around 3 years in, the battery started loosing its ability to remain charged for long. OSX kept showing that the battery needed to be replaced, but I never heeded to it. I could hold charge for 2–3 hrs at best. I just kept on working with it like it was no big deal, relying more on the power adapter than the battery. In its five year run, OSX has crashed twice for me. But Time Machine was able to patch it up with no issues. Once in 2014 OSX crashed badly, and I was not able to even access the recovery mode to work with time machine. I was scared at that point. But I found a software called disk warrior which was able to fix all the errors and it was back to normal. I rarely used the CD/DVD drive it had. But after three years, when I tried to use the CD drive, I realised it was unresponsive. The apple store suggested it would be expensive to replace. It made sense to simply buy a cheaper USB CD/DVD drive then (not the apple one of course). The only apple peripheral I purchased was a thunderbolt to VGA adapter. I have used non-apple peripherals for everything else (usb to ethernet for my new macbook). After 4–5 years OSX did seem slow and lagged at some points, but it was never so bad that I felt like I needed a new laptop. In the same five year span, I have seen few friends, who use their laptops as much or almost as much as me, burn through two laptops (three for one guy) at the same cost if not more than the cost of my mac book pro. Then came the fateful day. I, as usual, was lying on my bed with my laptop. I got up and reached for my bag. When I pulled my bag towards me, I did not notice my laptop being pushed to the edge and eventually off the bed. It fell onto the ground, open, with the screen and keyboard facing the ground. The screen to keyboard angle, which was usually reached to an angle around 100 degrees at best now was stretched to 180 degrees. I picked up my laptop and looked at it. There were no scratches or cracks, but most of the pixels on the screen which were supposed to show black, were now showing green. If the whole screen was white, there were no issues. I realised that it could either be a connector issue or the screen must be damaged. Everything else worked fine. I took it to the apple store and asked the guy to open it up in front of me. We tried removing and re-fixing the connector, but there was no difference. He mentioned that replacing the screen was the only option. My father then convinced me that it probably was a wiser choice to invest in a newer model with better specs, since I use mine so frequently. He suggested that they could fix the screen later and use it as a spare laptop at home. Whatever need I had, I was able to somehow figure out a way for my mac to do it. It was a great multipurpose laptop. If you are sure you want a laptop for a specific purpose like gaming, you may want to do better research to see if there are laptops with specifications that better fit your needs. If you are just looking for a durable multi-purpose laptop this could be just what you need. It was a perfect fit for my needs and usage. I can’t imagine having done all the things that I did with my mac in one of my friend’s laptops. It is not a perfect laptop. I am not saying that everyone may have an overall positive experience with their Macs like I did. But I have loved my experience with the Mac. So I felt it was worth investing on another mac for the next five years or possibly more (provided I don’t drop face down it again :P ). ",
            "date": "Updated June 25, 2016",
            "views": "747",
            "upvotes": " View 298 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hitesh Lalwani",
                    "user_href": "/profile/Hitesh-Lalwani-42"
                },
                {
                    "user_id": "Tejas Shetty",
                    "user_href": "/profile/Tejas-Shetty-19"
                },
                {
                    "user_id": "F. Ben Martin",
                    "user_href": "/profile/F-Ben-Martin"
                },
                {
                    "user_id": "Vic Lau",
                    "user_href": "/profile/Vic-Lau-8"
                },
                {
                    "user_id": "Akash Verma",
                    "user_href": "/profile/Akash-Verma-96"
                },
                {
                    "user_id": "Jiten Garg",
                    "user_href": "/profile/Jiten-Garg-5"
                },
                {
                    "user_id": "Raymond Chow",
                    "user_href": "/profile/Raymond-Chow-59"
                },
                {
                    "user_id": "Ocean Athokpam",
                    "user_href": "/profile/Ocean-Athokpam"
                },
                {
                    "user_id": "Naushin Qureshi",
                    "user_href": "/profile/Naushin-Qureshi-2"
                },
                {
                    "user_id": "Rajinder Sanwal",
                    "user_href": "/profile/Rajinder-Sanwal"
                }
            ]
        }
    ]
}