{
    "title": "Should education be for life or livelihood? - Quora",
    "tags": [
        "Livelihood",
        "Education",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Satish Kumar",
                "href": "/profile/Satish-Kumar-5677"
            },
            "answer_text": "The point of education in a country like India is not worth it and everyone here is wandering in search of bread wining education . It has become the age long tradition of this country that education means only getting a decent job and to earn money. But the justification of education is beyond getting a job only. Speaking for myself it should not be for livelihood but for life. It must makes a sense of humanity .A well educated person must know to differentiate between moral & immoral,human and inhuman or justice and injustice.we should acquire a sense that what is the real purpose of life. Today millions of people have deep rooted grudge in their life and they do not enjoy the life .This is not because they are poor or they have hand to mouth existence ,it is so beacuse they were so busy in dreaming of exorbitant wealth that they did not learn the moral value of life. They are the people who did not learn to tackle the hurdles ,hardships or burden in life. Moreover Education is not limited to attaining degree and living a luxurious life but to learn good behaviour,good manner, humility and tackling ups & downs of life. ",
            "date": "Answered February 21, 2018",
            "views": "797",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Chintalapudi",
                    "user_href": "/profile/Rahul-Chintalapudi"
                },
                {
                    "user_id": "SITA RAMA DEVI ISUKAPALLI",
                    "user_href": "/profile/SITA-RAMA-DEVI-ISUKAPALLI"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sudhanshu Singh",
                "href": "/profile/Sudhanshu-Singh-204"
            },
            "answer_text": "No. Education is not for only livelihood. Education give you the eye to acknowledge the right or wrong things of life. It's human inside things how oneself grow his mindset. Yes, but if i talk about our indian people they forget the fact and always relate education is only require for livelihood. Education is meant for Self development, learning analysis on art of living, earn name- fame, spread education to others, learn righteousness toward society, learn devoir and duty. ",
            "date": "Answered August 26, 2020",
            "views": "31",
            "upvotes": "0"
        }
    ]
}