{
    "title": "Should I buy the Poco M2 Pro or wait for the Realme 7? - Quora",
    "tags": [
        "Xiaomi Poco F1",
        "RealMe",
        "Xiaomi Mobile Phones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Mamnani",
                "href": "/profile/Rahul-Mamnani-1"
            },
            "answer_text": "Ok you are talking about the under 15k segment so no doubt narzo 20 pro is best phone unser 20k. it has got all the features of realme 7 but additionally you are getting 65 watt charging which is insane in this price bracket it has got faster MediaTek helio g95 with 4500 MaH battery 65 watt charging FHD display. but if you want more stability you can definitely go for Snapdragon processor which is available in poco M2 Pro it is more or less same but you are getting a slight slower 33 what fast charging which is also fast but slower than 65 watt charging. More or less narzo 20 pro and poco M2 Pro are same but don't go for realme 7 if you are going for realme brand then I would suggest you to go for NARZO 20 Pro also you will not find any difference in processors MediaTek g95 and Snapdragon 720G are more or less similar. ",
            "date": "Answered October 6, 2020",
            "views": "956",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vamshi Krishna",
                    "user_href": "/profile/Vamshi-Krishna-1450"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mansoor",
                "href": "/profile/Mansoor-86"
            },
            "answer_text": "Its better if you wait for realme 7 as it is going to launch on September 3rd and its not far away…Realme 7 pro will be having amoled display and higher varient i.e. Realme 7 pro will have 65W charging..I can't reveal the entire specs before it's launch but surely it's going to be better than Poco M2 pro. So please wait if you can. Price will also be aggressive.. ",
            "date": "Updated September 9, 2020",
            "views": "448",
            "upvotes": "0"
        }
    ]
}