{
    "title": "Should I buy a OnePlus Nord or wait for a OnePlus 8T? - Quora",
    "tags": [
        "OnePlus Smartphones",
        "Smartphone Shopping",
        "OnePlus (company)",
        "Smartphones Recommendations",
        "OnePlus One (product)",
        "Smartphone Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramanpreet Kaur",
                "href": "/profile/Ramanpreet-Kaur-708"
            },
            "answer_text": "OnePlus Nord is a midrange device with 5G capabilities whereas OnePlus 8T is going to be a flagship smartphone which hasn't launched yet, if we look at the current specifications of OnePlus Nord and the leaked specifications of Oneplus 8T the OnePlus 8T outclasses the OnePlus Nord in every way you can even check the specifications for yourself as I will be putting them below, but yes if you can afford to buy the OnePlus 8T after when its launch then you should definitely buy the OnePlus 8T. Specifications of both the smartphones as I mentioned above are:- OnePlus Nord BODY Dimensions 158.3 x 73.3 x 8.2 mm (6.23 x 2.89 x 0.32 in) Weight 184 g (6.49 oz) Build Glass front (Gorilla Glass 5), glass back (Gorilla Glass 5), plastic frame SIM Dual SIM (Nano-SIM, dual stand-by) DISPLAY Type Fluid AMOLED capacitive touchscreen, 16M colors Size 6.44 inches, 100.6 cm (~86.7% screen-to-body ratio) Resolution 1080 x 2400 pixels, 20:9 ratio (~408 ppi density) Protection Corning Gorilla Glass 5 90Hz refresh rateHDR10+ PLATFORM OS Android 10, OxygenOS 10.5.4 Chipset Qualcomm SDM765 Snapdragon 765G (7 nm) CPU Octa-core (1x2.4 GHz Kryo 475 Prime & 1x2.2 GHz Kryo 475 Gold & 6x1.8 GHz Kryo 475 Silver) GPU Adreno 620 MEMORY Card slot No Internal 64GB 6GB RAM, 128GB 8GB RAM, 256GB 12GB RAM UFS 2.1 MAIN CAMERA 48 MP, f/1.8, 26mm (wide), 1/2.0\", 0.8µm, PDAF, OIS8 MP, f/2.3, 119˚ (ultrawide)5 MP, f/2.4, (depth)2 MP, f/2.4, (macro) Features Dual-LED flash, HDR, panorama Video 4K@30fps, 1080p@30/60/240fps, gyro-EIS SELFIE CAMERA Dual 32 MP, f/2.5, (wide), 1/2.8\", 0.8µm8 MP, f/2.5, 105˚ (ultrawide), 1/4.0\", 1.12µm Features HDR Video 4K@30/60fps, 1080p@30/60fps BATTERY Type Li-Po 4115 mAh, non-removable Charging Fast charging 30W, 70% in 30 min OnePlus 8T BODY DIMESIONS 162.8 x 75.5 x 8.4 mm (6.41 x 2.97 x 0.33 in) Weight 180 g (6.35 oz) Build Glass front (Gorilla Glass 5), glass back (Gorilla Glass 5), aluminum frame SIM Dual SIM (Nano-SIM, dual stand-by) DISPLAY Type Fluid AMOLED capacitive touchscreen, 16M colors Size 6.55 inches, 103.6 cm (~84.3% screen-to-body ratio) Resolution 1080 x 2400 pixels, 20:9 ratio (~402 ppi density) Protection Corning Gorilla Glass 5 HDR10+ 120Hz refresh rate PLATFORM OS Android 11, OxygenOS 11 Chipset Qualcomm SM8250 Snapdragon 865 (7 nm+) CPU Octa-core (1x2.84 GHz Kryo 585 & 3x2.42 GHz Kryo 585 & 4x1.8 GHz Kryo 585) GPU Adreno 650 MEMORY Cards slot No Storage 128GB 8GB RAM, 256GB 12GB RAM UFS 3.0 MAIN CAMERA Quad 48 MP, f/1.8, 25mm (wide), 1/1.43\", 1.12µm, omnidirectional PDAF, Laser AF, OIS 16 MP, f/2.2, 14mm, 116˚ (ultrawide) 5 MP, f/2.4, (macro) 2 MP, f/2.4, (depth) Features Dual-LED flash, HDR, panorama Video 4K@30/60fps, 1080p@30/60/240fps, Auto HDR, gyro-EIS SELFIE CAMERA Single 32 MP Features Auto-HDR Video 1080p@30fps, gyro-EIS BATTERY Type Li-Po 4500 mAh, non-removable Charging Fast charging 65W ",
            "date": "Answered October 6, 2020",
            "views": "86",
            "upvotes": " Answer requested by Rushi Pankade",
            "upvoters": [
                {
                    "user_id": "Rushi Pankade",
                    "user_href": "/profile/Rushi-Pankade"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amrit",
                "href": "/profile/Amrit-195"
            },
            "answer_text": "Both of these smartphones are from different segments buddy. One Plus 8T which is going to be unveiled on 14th October 2020 will be a pure flagship level smartphone with flagship level specifications while on the other hand One Plus Nord comes under a premium mid-range smartphone category it offers you a near flagship level experience but not a full fledged flagship level experience. And both of these smartphones will also be having a huge price difference between them so first of all you decide that you want, a flagship level smartphone or a premium mid-range level smartphone then according to your needs take a wise choice. Thank you. ",
            "date": "Answered October 6, 2020",
            "views": "72",
            "upvotes": " View 1 Upvoter "
        }
    ]
}