{
    "title": "Should I study in Estonia? How long can I stay in Estonia after graduation? - Quora",
    "tags": [
        "Study in Estonia",
        "Estonia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ukeme Jonah",
                "href": "/profile/Ukeme-Jonah"
            },
            "answer_text": "You should actively consider studying on low or cheapest tuition in Estonia.I will drop general guidelines on how to study on low tuition in this beautiful country: In order to apply to universities in Estonia, you need to prove that you have successfully completed the previous stage of study (secondary education if you apply for an undergraduate course, or a bachelor’s degree if you apply for a master’s program). If you are an international student applying to study an English-taught program, you’ll be required to show proof of proficiency in the English language. All internationally recognized language tests are equally accepted, but some Estonian universities may require you to sit a language test of their own. Depending on your course and the university you are applying to, you may be required to attend an interview, write an application essay, or present a portfolio of work. How to Apply for Visas International students who hail from a member state of the European Union do not require a student visa to study in Estonia. However, you’ll need to obtain a temporary right of residence in Estonia after arriving in the country. EU students should register with the local authorities within three months from the day of entry in Estonia. In addition, students must apply for an Estonian ID card within one month of obtaining the temporary right of residence. International students coming from non-EU countries should apply for a temporary residence permit for studying (TRP); this serves as the equivalent to a student visa. In order to obtain this document, you should contact your closest Estonian Embassy and check the specific requirements for your country of origin. The TRP must be renewed every year, at least two months before the date of expiration Fees and Funding Read more: Comprehensive Guide on how to Study on Cheapest Tuition in Estonia($1000-$8000) ",
            "date": "Updated April 27, 2019",
            "views": "27",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "No One",
                    "user_href": "/profile/No-One-1578"
                },
                {
                    "user_id": "Akash Munjal",
                    "user_href": "/profile/Akash-Munjal-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monika Adel-Singh",
                "href": "/profile/Monika-Adel-Singh"
            },
            "answer_text": "Estonia have some good universities. Tallinn University of Technology and Tartu University. Estonia don’t issue a study visa. Instead you need to apply for a temporary resident permit, which is issued for either 2 or 3 years depending on the length of your study. Basically, once your studies are finished, you have to have another ground for staying there. ",
            "date": "Answered February 22, 2018",
            "views": "43",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akhil Ramachandran ( അഖിൽ രാമചന്ദ്രൻ )",
                    "user_href": "/profile/Akhil-Ramachandran-അഖിൽ-രാമചന്ദ്രൻ"
                },
                {
                    "user_id": "Bashir Ahmed",
                    "user_href": "/profile/Bashir-Ahmed-357"
                },
                {
                    "user_id": "Jilson Jose",
                    "user_href": "/profile/Jilson-Jose"
                },
                {
                    "user_id": "Sreelesh p S",
                    "user_href": "/profile/Sreelesh-p-S"
                },
                {
                    "user_id": "Thomas Renaldi",
                    "user_href": "/profile/Thomas-Renaldi"
                },
                {
                    "user_id": "Ujjwal Kumar",
                    "user_href": "/profile/Ujjwal-Kumar-283"
                },
                {
                    "user_id": "Efraim Monsale",
                    "user_href": "/profile/Efraim-Monsale"
                }
            ]
        }
    ]
}