{
    "title": "Should I do an online course in food technology? - Quora",
    "tags": [
        "Food Technology",
        "Online Training",
        "E-learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lito Tiuseco",
                "href": "/profile/Lito-Tiuseco"
            },
            "answer_text": "Let me just say first that I left the food industry in the year 2005 after spending a few years in R&D. With that caveat, I would have to say that taste and flavor development is concerned with how to take qualitative human responses in a sensory evaluation test and make it quantitative, or data that can be the basis for making conclusions about the desirability/ marketability of a food product. So yes, there could be a role for a math and comp sci grad especially in the flavor development industry. Companies like Sensient and IFF come to mind, but I just dont know to what extent your talents will be used there because I was never part of a purely flavor oriented company. My work on the other hand did not require me to do complicated calculations or use specialized computer programs. MS Excel and MS Word were more than sufficient. In my opinion, if you ever decide to undergo an onljne course in FT, it should be more on the analysis/ interpretation of sensory evaluation data. ",
            "date": "Answered April 19, 2017",
            "views": "328",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kenneth Marikos",
                "href": "/profile/Kenneth-Marikos"
            },
            "answer_text": "I don't no of anyhing along those lines but it might be out there. Although cooking involves math and engineeing as such i also involves a great deal of chemistry. If i helps you and makes you happy and you can find such a course by all means take it. Please apply it in a practical sense. Just reading about it without doing it is wasted learning and knowledge. ",
            "date": "Answered April 19, 2017",
            "views": "124",
            "upvotes": "0"
        }
    ]
}