{
    "title": "Should I study science or engineering to invent new technology? - Quora",
    "tags": [
        "Invention and Inventions",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Peracchio",
                "href": "/profile/Tom-Peracchio"
            },
            "answer_text": "So many similar A2A questions on how do I become an inventor, what do I need to study to become an inventor. There is no one size fits all answer to any of these questions. From the science and technology side, there are many ways to approach it. You can study any field of science and come up with new ideas, and solve problems. As an engineer you can study any area of engineering, and see things that can be made better, products and processes that need improved. Great inventors, innovators, industrialists, all had one thing in common, a passion for their ideas, and a passion to turn their visions into reality. There are endless stories of \"inventors\" who were always tinkering with things. They had a burning desire to understand how things worked. There are many stories like that of Philo T. Farnsworth, the son of a Mormon farmer in Utah, who enjoyed science in high school. He asked his high school science teacher about an idea he had, and proceeded to draw on the classroom black board his ideas for a electronic television system. His high school teacher's ability to recall the incident many years later helped Farnsworth to win a patent battle. On Quora many people think that Thomas Edison is the devil, and Nikola Tesla is a god. They actually had many traits in common. Their belief in their ideas, and their passion to make them real, lead to their success, as well as their failures. Edison was blinded by his idea that DC current was the way to go. That belief lead to his greatest defeat in the War of Currents. Edison not only lost the battle of AC versus DC, he also lost control of his company, Edison Electric as a result. After losing the War of Currents, Edison's passion lead to many victories as well, as he invented, and re-invented the phonograph and brought music into our home. Tesla won out over Edison in the War of Currents, as he teamed up with another great inventor and visionary, George Westinghouse, to develop an AC current system that brought electricity into our homes. The victory over Edison in the War of Currents was Tesla's greatest victory. Later in life Tesla would be blinded by his passions as he became obsessed with his free energy idea. His failure to get his working model up and running lead to a nervous breakdown. Study famous people. Learn from their success, and learn from their failures. Try to understand when a burning desire can turn into a dangerous obsession. Question everything. Find something that really interests you, and learn everything you can about the topic. How does it work, how could it be made better. Being an inventor is not a field of study, it is a state of mind. ",
            "date": "Answered May 17, 2016",
            "views": "13",
            "upvotes": " Answer requested by Ethan Anderson",
            "upvoters": [
                {
                    "user_id": "Jurij J. Dvořák",
                    "user_href": "/profile/Jurij-J-Dvořák"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Anderson",
                "href": "/profile/John-Anderson-209"
            },
            "answer_text": "What are your passions? What are your interests? Are you more inclined to solve known problems in a new way, or to invent something totally new?  For example, in 1870, the American farmer wanted a stronger, faster mule that could pull a wider plow with steel blades that maintained a sharp edge longer, and an automatic manure spreader.  Not one farmer asked for a diesel combine, a pivot irrigation system, hybrid pest-resistant seeds, and urea-based fertilizers........  If you desire to make improvements to current systems, study technology. If you want to truly innovate, study BOTH science and technology - - and music, art, history, philosophy, and ......watch movies, read science fiction, listen to TED Talks.....and....pray / meditate a lot. As Thomas Kuhn (\"The Structure of Scientific Revolutions\") points out, revolutionary innovation seems to arise from people OUTSIDE the field who see the challenge with new eyes.   Innovations ahead will result from materials, genetics, software...... as well as the discovery of new uses for existing materials. For example, I recently wrote a patent for an inventor who discovered that an inexpensive 150 year old industrial chemical is safe in large doses, can cross the blood-brain barrier, and arrests a deadly brain disease - perhaps even cure / reverse it!  The inventor is NOT a chemist, a biochemist, a geneticist, nor a neurologist. His expertise is far afield from each of these disciplines - - - and had be looked within those fields, he would have never pursued the \"wild ideas\" leading to this radical new therapy. ",
            "date": "Answered May 3, 2016",
            "views": "757",
            "upvotes": " View 1 Upvoter "
        }
    ]
}