{
    "title": "Should I get a 240Hz monitor in 2020? - Quora",
    "tags": [
        "Counter Strike: Global Offensive (video game)",
        "Display Technologies",
        "LCD Monitors",
        "Computer Monitors and Screens",
        "Personal Computers",
        "2020 (year)",
        "PC Gaming ",
        "Computer Hardware",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Cox",
                "href": "/profile/Robert-Cox-294"
            },
            "answer_text": "Well it’s like this you run in to the fact that most people can’t tell the difference. The audio industry has made money off it for years. “ With a new ultra low distortion of .0002” from Holman’s Apt 1 amp, thing is get below 1% and you need test gear to find it out. (Yep I was a Audio nut ) Sure can’t hear it. Most people can’t see the difference between 144Hz and 240Hz. Next problem is that the 240Hz will be a TN panel. Those are fast but they are poorer video qualty than IPS or VA panels, colors looked washed out and the viewing angle is not as wide. Then to get that refresh rate with a AAA game takes a top end Video card. I would say the only way to decide is to go some place that they can switch between the two and let you see if it looks like it is worth it. I don’t think you will see it. So no I would not buy one because someone gushes over the specs. ",
            "date": "Answered June 18, 2020",
            "views": "126",
            "upvotes": " Answer requested by John Bluescab",
            "upvoters": [
                {
                    "user_id": "Jack Ward",
                    "user_href": "/profile/Jack-Ward-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vladislav Zorov",
                "href": "/profile/Vladislav-Zorov"
            },
            "answer_text": "Considering the question is tagged with “CS:GO”, I’d say yes - it’s not hard to run that game at hundreds of FPS, and the higher the refresh rate the better for that game (it makes everything less blurry when you spin around, it’s easier to see enemies even when you flick the mouse). My computer isn’t that new anymore, and it can still do 400-500 FPS in CS:GO - I’m pretty sure even a 480 Hz monitor would be beneficial (but, for now, only prototypes exist, you can’t buy one). Of course, CRT monitors are still best when it comes to motion blur. Apparently there the phosphors only glow for less than 1 ms, so you pretty much don’t see any incorrect images (in terms of where your eyes are tracking and what picture is actually showing at that time). To achieve a similar effect with a TFT, without using ULMB[1], it would have to run at more than 1000 Hz (and your game would have to run at more than 1000 FPS, there’s no point in all of those refreshes if no updated data is going to be shown).  Footnotes[1] Motion Blur Reduction (ULMB, LightBoost, etc)",
            "date": "Answered June 18, 2020",
            "views": "488",
            "upvotes": " View 1 Upvoter "
        }
    ]
}