{
    "title": "Should I buy a 5G phone? Or is it too early? - Quora",
    "tags": [
        "5G (wireless communication)",
        "Wireless Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hilton Peter",
                "href": "/profile/Hilton-Peter-1"
            },
            "answer_text": "With the second generation of 5G phones hitting the US market this spring and 5G advertising everywhere, it's worth considering whether to buy a 5G phone right now. We're seeing 5G phones on the market now or coming soon from LG, Motorola, OnePlus, Samsung, and TCL, and as far as we know Apple is still preparing its 5G iPhone for September. Is it worth the extra bucks to jump over to 5G? Well, if you intend to spend less than $500 on a phone, then you can ignore 5G entirely. Yes, 5G does bring some advantages, but it's probably only going to be on relatively costly phones this year and 4G service will be great for the next several years. 5G is still a bleeding-edge feature in 2020, and it will remain a cutting-edge one in 2021. If you're buying a top-of-the line phone you intend to keep for the next several years on Sprint, T-Mobile, or Verizon, 5G is good future-proofing. You may not have 5G in your area now, but you probably will in the next two years, and today's phones support the next few years of those carriers' technologies. That said, if you're on AT&T, I don't see the advantage yet. No matter the carrier, there's no downside to getting a phone that also has 5G if it's the phone you want anyway. In the US, we can't buy Samsung Galaxy S20 series phones without 5G! So if the S20's 8K video recording or amazing screen attracts you, that's what you should be buying the phone based on. ",
            "date": "Answered July 30, 2020",
            "views": "69",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Mihhail Gotovtsev",
                "href": "/profile/Mihhail-Gotovtsev"
            },
            "answer_text": "Wait for it! Right now 5G is a gimmick function on some flagship phones, that already can be used, but not that wide spread and those phones are expensive. Network provides usually tend to do upgrades and roll outs for Christmas shopping. This way they can offer and sell more new phones and plans. I would expect to have the 5G roll this Christmas, maybe next, but Vodaphone and ATnT are alredy buying equipment. There are higher than average chances that after this year Christmas you will be able to get a 5G phone and a good network plan a lot cheaper than now. ",
            "date": "Answered May 12, 2019",
            "views": "115",
            "upvotes": " Answer requested by Martina Marrocchini"
        }
    ]
}