{
    "title": "Should we go with big data, or cloud computing? - Quora",
    "tags": [
        "Cloud Services",
        "Cloud Computing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manmeet Singh",
                "href": "/profile/Manmeet-Singh-610"
            },
            "answer_text": "See there is a very big difference between the Big Data(Problem) Hadoop(is Solution) and Cloud Computing is like accessing the data requirement according to the user. Big data refers to the Information whereas cloud computing refers to the getting the information. But, as we go for the training both have the future scope. Basically, it depends upon your interest if you are good at coding or especially at java then go for the Big Data as I would Suggest. Although, coding is required everywhere. I know, that it would be in the paragraph that will be irritable for you to read. But trust me it will help you in the future. Here is the solution to the training problem and for the future scope.  Conclusion – Cloud Computing vs Big Data Analytics Cloud Computing and Big Data Analytics have truly impacted the way organizations function and humans operate. Cloud Computing provides benefits which are applicable to all sizes of businesses and all kinds of individuals. Data is perceived as a resource and organizations are scrambling to implement Hadoop to exploit this resource. It is interesting to know that although these technologies have become mainstream, companies are still investing huge amounts in R&D. We can expect more growth in Cloud Computing and Big Data Analytics in the coming years. I recommend you to go for Cloud Computing. BEST OF LUCK FOR THE FUTURE!!!!!!!!! ",
            "date": "Answered January 22, 2019",
            "views": "94",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manmeet Singh",
                    "user_href": "/profile/Manmeet-Singh-1222"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Badera",
                "href": "/profile/Andy-Badera"
            },
            "answer_text": "This is not an either-or. Chances are you want to go with big data, in the cloud. Throw everything in something like Azure’s Data Lake, for easy, unstructured, longterm, low cost data storage and later retrieval. Let someone like Microsoft who bundles up and manages Hadoop as Azure HDInsight do the heavy analytical lifting for you. If your needs aren’t that intense, consider Microsoft’s Power BI. For something in-between, consider integrating with Azure ML (Machine Learning). Either way, your data lives in the cloud, and is processed in, or interacted with from, the cloud. Let others worry about the non-subject matter specific infrastrcture, while you focus on doing what you’re actually doing. ",
            "date": "Answered March 27, 2018",
            "views": "202",
            "upvotes": "0"
        }
    ]
}