{
    "title": "Should I buy a manufacturer refurbished phone? - Quora",
    "tags": [
        "Refurbished Products"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sunil Kumar",
                "href": "/profile/Sunil-Kumar-7143"
            },
            "answer_text": "Yes and no. There are certain circumstances that justify buying a refurbished phone for example if you’re on a tight budget or you want to save some money then it’s okay to buy. From my personal experience, there’s nothing wrong in buying refurbished products as long as you buy them from a reputable seller with long manufacturer warranty (not seller) cover. Some manufacturers like Apple, HP, Dell, Epson, and the like sell refurbished goods on their own with complete warranty cover and service. So, you can take advantage of it. This way you can get access to latest products without paying their actual cost. Note: There’s a bit of risk associated with refurbished products but if you know how and from whom to buy refurbished ones then there should not be any problem. If you’re going to buy a refurbished phone then I strongly recommend you to read this guide “8 Things You Must Check Before Buying Refurbished Electronics.” Here I’m listing advantages and disadvantages of buying a refurbished product. First let me clear there’s nothing like brand new product, however, as mentioned earlier, you can also buy refurbished. Advantages of Buying Refurbished Electronics You get huge discount on such products sometimes more than 50 percent.Most of the refurbished goods come with warranty as new ones. You get the same tech support as you would get with a new product.Such products also come with easy return policy; which lets you return the product in case you don’t like it.They are like new ones just someone (manufacturer) has checked its functionality and fixed some issues.You can get access to latest products without spending actual product cost.Disadvantages of Buying Refurbished Electronics Everything pertaining to reconditioned products is not good. Here are some disadvantages of owning a re-manufactured product: Though you get warranty but its period is very limited say 15 to 90 days. Some prominent companies give complete warranty as you buy new product such products are good to buy.You would not be able to understand what was fixed or reconditioned in the item.You may find some dents on the products.If product is coming with seller warranty then you cannot visit brand store for repair.",
            "date": "Updated December 18, 2019",
            "views": "552",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhay Singh Rao",
                    "user_href": "/profile/Abhay-Singh-Rao"
                },
                {
                    "user_id": "Mihdar Fauzi",
                    "user_href": "/profile/Mihdar-Fauzi"
                },
                {
                    "user_id": "Gulammohyuddin Mukdiwala",
                    "user_href": "/profile/Gulammohyuddin-Mukdiwala"
                },
                {
                    "user_id": "Christos Mauratzotis",
                    "user_href": "/profile/Christos-Mauratzotis"
                },
                {
                    "user_id": "Jash Shah",
                    "user_href": "/profile/Jash-Shah-158"
                },
                {
                    "user_id": "Rahul Nyamagoud",
                    "user_href": "/profile/Rahul-Nyamagoud-1"
                },
                {
                    "user_id": "Suraypratap Sharma",
                    "user_href": "/profile/Suraypratap-Sharma"
                },
                {
                    "user_id": "Chidi Nwogbaga",
                    "user_href": "/profile/Chidi-Nwogbaga"
                },
                {
                    "user_id": "Zara Shamim",
                    "user_href": "/profile/Zara-Shamim"
                },
                {
                    "user_id": "Sanskar Shekhar",
                    "user_href": "/profile/संस्कार-शेखर-Sanskar-Shekhar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma Johnson",
                "href": "/profile/Emma-Johnson-1183"
            },
            "answer_text": "Refurbished phones are a buzz these days. In simple words, a refurbished phone is a used phone that has been returned by the original buyer due to some defects or because the buyer changed their mind. After it’s returned the manufacturer rectifies the defects and the phone is then made available for resale under the refurbished category. In my personal opinion, it is absolutely fine to buy a refurbished phone as long as you buy it from a trusted seller within their warranty. A refurbished phone will allow you to enjoy all the latest technologies at a much lower price. Let us take a look at some of the advantages of a refurbished phone Refurbished phones are an ecological choice- To manufacture a smartphone or a tablet, a lot of harmful substances are used such as lead or arsenic. If these substances are not disposed properly, it can cause serious threat to the environment. If you buy a refurbished iPhone instead of a new one, you will contribute in limiting the use of these harmful substances.Refurbished phones are pocket-friendly- With every release, the cost of the latest iPhone sees an increase. By buying a refurbished iPhone, you can enjoy all the latest technologies at a much lower price.Refurbished phones have much longer life than first thought- It is a general perception that refurbished phones don't last longer. However, if you buy a refurbished phone from a trusted seller like Smart Cellular, you can make worry-free investment as all the refurbished products sold by Smart Cellular come with a one-year warranty.Disadvantages of refurbished products Uncertainty about accessories- With new devices, you also get free branded accessories. However in case of refurbished products, that may not be the case. Maximum Satisfaction at Smart Cellular SmartCellular is one of the most reliable websites for buying a refurbished product. They are dealing with refurbished phones for ages and hence they know all the pros and cons of the refurbished phones. Also, all the refurbished products are graded with the reliable PEG grading system which assures quality and the 12-months warranty policy is in place to ensure that they make a worry-free investment. Hence, if you are sceptical about a refurbished product, don’t hesitate to shop around Smart cellular. ",
            "date": "Answered August 4, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raj Chakraborty",
                    "user_href": "/profile/Raj-Chakraborty-16"
                }
            ]
        }
    ]
}