{
    "title": "The Future: How will the world end? - Quora",
    "tags": [
        "Future of the World",
        "Doomsday",
        "Apocalyptic and Post-Apocalyptic Hypothetical Scenarios",
        "The Future"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Sibson",
                "href": "/profile/Keith-Sibson"
            },
            "answer_text": "Depends what you mean by \"end\".  Planet Earth ceases to exist as an orbital body The Sun nears the end of its stellar cycle, grows to enormous size and the Earth is swallowed. This will happen, but is about 4-5Bn years out. A massive impact shatters the Earth, this would require a body larger than Mars (the Earth already survived a Mars-size impact, which created the Moon). Extremely unlikely, since all large bodies in our solar system are in stable orbits. A rogue star or large planet enters our system and catapults the Earth out of orbit of the Sun. We have a pretty good bead on nearby star systems, none are coming near us, and this is extremely unlikely anyway.  All life on planet Earth is extinguished An unprecedented giant solar flare vaporizes the surface of the Earth. While dangerous solar flares are a reality, our Sun is very stable and this is unlikely to occur.  A huge comet 5 times the size of the one that killed the dinosaurs impacts the Earth causing an extinction event. Note that it would have to be extremely large to kill all life. Even with the largest known comet, some microbial life would still survive. Note that I say comet, not asteroid. There are no asteroids in our Solar System capable of causing a total extinction, but there are millions of unknown comets. The human race is wiped out Now we're getting into more plausible territory. A much smaller comet or asteroid would be entirely capable of wiping out the human race. There is precedent with the dinosaur killer, and while some humans might survive with enough warning, civilization would most assuredly be over for at least a thousand years.  A human created genetically engineered plague could kill everyone. It would have to be genetically engineered. Nature is crafty enough not to create diseases that wipe out their hosts entirely. Even with a 100% fatality rate for infections, the chances of a total extinction are low. Some humans, properly quarantined would likely survive. An \"apocalypse\" This is commonly understood as the \"end of the world\", but doesn't mean the extinction of our species or even permanent damage to the Earth's ecosystems. Generally it means the end of the world as we know it, the destruction of civilization on a global scale. There are too many scenarios to list here, but some examples might be:  Large scale nuclear war or EMP attackAn extremely virulent plagueModerate asteroid or comet impactRunaway global warming or other environmental catastropheSuper-volcano eruption... and of course, alien invasion!All in all, the human race is in pretty good shape. We're highly adaptable, and so there's an extremely low risk of us being wiped out entirely. ",
            "date": "Answered August 20, 2013",
            "views": "28",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthias Mouton",
                    "user_href": "/profile/Matthias-Mouton"
                },
                {
                    "user_id": "Devin Miller",
                    "user_href": "/profile/Devin-Miller-63"
                },
                {
                    "user_id": "Ronald W. Goetz",
                    "user_href": "/profile/Ronald-W-Goetz"
                },
                {
                    "user_id": "Dymond Wilson",
                    "user_href": "/profile/Dymond-Wilson-4"
                },
                {
                    "user_id": "Jim Anastassiou",
                    "user_href": "/profile/Jim-Anastassiou"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/BRIAN-NGUYEN-484"
                },
                {
                    "user_id": "Patricia Cooper",
                    "user_href": "/profile/Patricia-Cooper-18"
                },
                {
                    "user_id": "Spandan Roy",
                    "user_href": "/profile/Spandan-Roy-10"
                },
                {
                    "user_id": "Quan Le",
                    "user_href": "/profile/Quan-Le-74"
                },
                {
                    "user_id": "Amanda Verdino",
                    "user_href": "/profile/Amanda-Verdino-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Winters",
                "href": "/profile/Steve-Winters-9"
            },
            "answer_text": "Great disasters that the world has never seen before are about to occur based on events that the Bible has predicted that are now coming true! The 7 Year Tribulation is about to start on earth that the Bible has predicted! * Earthquakes are on the rise & 33 active volcanoes right now * World War 3 is about to start based on specific wars that the Bible predicts * Yellowstone will erupt soon & wipe out ¼ of the US * California & west coast wiped out from a 10.0 Earthquake coming soon * NYC & East Coast wiped out from a Tsunami coming from the Canary Islands coming soon * Meteors soon hitting the earth in larger numbers as part of the 6th Seal mentioned in the Bible JESUS CHRIST spoke about this time COMING SOON. Luke 21:25-28 \"There will be signs in the sun, moon and stars. On the earth, nations will be in anguish and perplexity at the roaring and tossing of the sea. People will faint from terror, apprehensive of what is coming on the world, for the heavenly bodies will be shaken.” The Solution: The Rapture. Jesus is taking his people off of this earth SOON! (Probably this year!) Luke 21:26-28 \"At that time they will see Jesus Christ coming in a cloud with power and great glory. When these things begin to take place, stand up and lift up your heads, because your redemption (Rapture) is drawing near.” How to get into the Rapture (before the Tribulation starts): * You don't need to go to church as Christ lives in your heart and not at a church. * Say a one time prayer* to ask Jesus Christ into your life & that you recognize he is Lord who came in the flesh to die for your sins on the cross & to forgive you of your sins so that you may enter heaven when you die or when the Rapture occurs. DAILY: READ a chapter of your (NIV) Bible and apply it to your daily life!REPENT of all your sins! Avoid drinking, sex before marriage, evil movies, songs etc.ASK God what you can do for him TODAY! Then find one person to help - with your money or in any other way you can. This directly builds your home & your rewards in heaven!*Make sure you’re doing these 3 tasks DAILY so you will be included in the SOON Rapture! Don't let pride stop you from entering the heavenly gates!* ",
            "date": "Answered May 16, 2017",
            "views": "468",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Pope",
                    "user_href": "/profile/Jeff-Pope-25"
                },
                {
                    "user_id": "Ralph Summers",
                    "user_href": "/profile/Ralph-Summers-1"
                }
            ]
        }
    ]
}