{
    "title": "Was ENIAC the first computer or Z1? - Quora",
    "tags": [
        "Harvard Mark 1",
        "Computer History Museum",
        "ENIAC"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Engheim",
                "href": "/profile/Erik-Engheim-1"
            },
            "answer_text": "The short answer is Z1. But to elaborate. One can argue at length about the definition of a computer, but regardless of what definition you use I think it is hard to claim ENIAC was the first. The most likely reason ENIAC is so often regarded as the first was that it was in the press early on. There was a lot of publicity around it. While the British Colossus which was made earlier was kept a secret until the 1960s because it was used for code breaking. Konrad Zuse which created the Z1 during WWII, created several updated versions during the war. The Z4 was made at the end of the war. I would probably regard his Z3 as the first computer for the following reasons. It was a digital computer, it had memory, it could read stored programs for punched tape. It even had floating point arithmetic and could do loops and control logic. While Z1 could do much the same stuff, my understanding was that it was more of a demonstration model of capability. It is unclear how much it was used but the Z3 built in 1941, so several years before ENIAC, was used for statistical analysis of the stresses on aircraft wings, in particular the problem known as wing-flutter. The Z1 is important in computing history because it lead to a whole series of later computers all the way up to Z22. The Z5 e.g. was the first built to order mainframe in Germany. In my opinion ENIAC lacked a lot of important things that the Z1-Z4 computers had or developed. ENIAC was not digital. That means it is not a natural grand parent of today’s computers. It did not have stored programs that it could read like the Z1. IMHO that is a pretty significant part of a computer. Konrad Zuse also developed the first high level language for his computers, called Plankalkül. So I think he did too many essential parts of what constitutes computing today not to be recognized as the father of today’s computers. Of course the ideas of machine based computing existed many places and if he had not done it somebody else likely would have. But that is the nature of invention. It isn’t quite as dependent on individuals as we are often led to believe. ",
            "date": "Answered July 11, 2018",
            "views": "560",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mats Söderlind",
                    "user_href": "/profile/Mats-Söderlind"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phillip Remaker",
                "href": "/profile/Phillip-Remaker"
            },
            "answer_text": "There is a saying among computer historians: Any computer can be the “first computer” if you let me put an unlimited number of modifiers between “first” and “computer.” ENIAC came from my alma mater, and I have gotten into the habit of describing ENIAC as: The first successful, general, electronic, digital computer. And ENIAC wasn’t just an experiment - it produced real results, generating ballistics tables for the US Army, a task once done laboriously and manually by human “computers.” I don’t know as much about Z1. A quick perusal of the Wikipedia article shows that it was a binary computer, but was mechanical in nature. Though electrically driven, it was not electronic. It certainly predated ENIAC, but seems it was never pressed into service for a specific task. Computer historians can reasonably argue that the Antikythera mechanism was the first computer, or that the The Babbage Difference Engine was the first designed computer, or that The Hollerith Machine was the first practical computer. But for me, with my naked, admitted bias, I would dare to call ENIAC the first computer, certainly the first computer that resembled the modern electronic computer that we use today. The 1961 monograph Electronic Computers Within The Ordnance Corps lists the evolution of computers used by the Army from 1945 to 1960, and sets ENIAC squarely at the base of that tree.  You can quibble about ENIAC’s firstness, but you can’t deny its far-reaching influence. ",
            "date": "Answered November 1, 2016",
            "views": "49",
            "upvotes": " View 43 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ira J Perlow",
                    "user_href": "/profile/Ira-J-Perlow"
                },
                {
                    "user_id": "Rob James",
                    "user_href": "/profile/Rob-James-179"
                },
                {
                    "user_id": "John David",
                    "user_href": "/profile/John-David-511"
                },
                {
                    "user_id": "Jeffrey Simnacher",
                    "user_href": "/profile/Jeffrey-Simnacher"
                },
                {
                    "user_id": "Toby Thain",
                    "user_href": "/profile/Toby-Thain"
                },
                {
                    "user_id": "Ken Fishkin",
                    "user_href": "/profile/Ken-Fishkin"
                },
                {
                    "user_id": "Joachim Pense",
                    "user_href": "/profile/Joachim-Pense"
                },
                {
                    "user_id": "Paulina Jonušaitė",
                    "user_href": "/profile/Paulina-Jonušaitė"
                },
                {
                    "user_id": "Timothy Johnson",
                    "user_href": "/profile/Timothy-Johnson-6"
                },
                {
                    "user_id": "Damien Donovan",
                    "user_href": "/profile/Damien-Donovan"
                }
            ]
        }
    ]
}