{
    "title": "Was the original Tesla coil intended to offer free energy? - Quora",
    "tags": [
        "Tesla Coil",
        "Free Energy",
        "Nikola Tesla",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Beaty",
                "href": "/profile/William-Beaty"
            },
            "answer_text": "At one point Tesla said that his earliest coils were part of an experiment to create light directly, by generating “Hertz-waves” of extremely short wavelength. (His coils were driven by a custom high-speed dynamo designed to produce high-frequency AC, up to 60,000 cycles per second.) If the waves could be made short enough, they would be the same thing as light-waves. But Tesla maxed out at around 1MHz, yet visible red light is 460,000 times higher in frequency. So, didn’t work! (Everything else Tesla did was just a spinoff from these high-freq, high voltage power supplies.) Another story was that Tesla predicted that, when a capacitor was discharged, its voltage wouldn’t just leap to zero. Instead it would overshoot, go negative maximum, go back to zero again and overshoot, etc. Over and over. It would oscillate like a fast pendulum, or like a ringing bell. A capacitor then acts like the electrical version of a tuning-fork, ringing if “struck.” Experiments with small coils soon showed Tesla that this ringing would create absolutely immense voltages, but without needing hundreds of thousands of turns of wire, as was needed with the well-known Ruhmkorff spark-coils (induction coils, the step-up transformers.) These transformers were long used in physics laboratories worldwide Tesla pushed it, and soon was creating fifteen-foot lightning bolts …when the previous world record for Ruhukorff coils was about five feet (achieved by the best physics labs in Europe.) His voltage step-up effect was created by resonance, not by the turns-ratio of a transformer. He only needed relatively few turns on the coil, with very small weights of copper. A new discovery! So, his coils were used for making scientists look bad …when bested by some unknown American inventor who didn’t even have a college degree. Fifteen feet! But then Tesla discovered that the high-voltage, high-frequency signals were acting weeeeeeeird! You could zap yourself with thousands of volts, without being electrocuted (you might get a small burn on your skin though. Unless you held a metal wrench in your hand, and let the huge sparks strike that instead.) Even better, a disconnected Crookes tube held nearby would light up brightly. (Crookes tubes were not perfect vacuum, but instead were akin to neon signs or mercury vapor lamps.) And, if Tesla’s coil was connected to a single long wire, there would be a large current in the wire, even though there was no circuit present (the end of the wire was just hanging in space, connected to nothing.) A little AC motor, connected in series with such a wire, would start spinning. A “single-wire motor.” Electric power, without any closed circuit. Electricity wasn’t like a flywheel, instead it was more like an organ-pipe. Another new discovery. So, his coils were used for performing unusual physics demonstrations: some apparently “impossible” effects. (Perhaps Tesla was inspired by his professor Poschl from college, who performed all sorts of weird physics-demos during his classroom science lectures. Tesla had created some brand new physics-tricks for teachers to perform!) Also, Tesla noticed that, with a long narrow coil (like a long tube wound with wire,) whenever he resonantly drove just one end, then the entire coil would “ring,”…yet that coil was a single wire. No electric circuit. The entire coil would still “ring” even if the coil was divided in half, moved many yards apart, and the cut ends connected with a long wire. Two separate coils, connected with one wire, would behave as one. A single long wire, large AC currents, with no circuits! Violating physics! (Apparently.) With this new trick Tesla could send significant AC energy along a single conductor, even powering lights and motors, whenever a resonating half-coil was placed at either end of the conductor. If instead, the two coil-ends were connected to the Earth (the Earth being the single conductor, wide and two-dimensional,) his trick still worked! At least it did when the two coils weren’t hundreds of miles apart. This then was the origin of Tesla’s first type of “broadcast power,” having the two halves of a single coil be connected to the ground surface, where exciting one coil would excite the other distant coil. So, the Tesla Coils inherently contains the secret to single-conductor “circuits,” which then led directly to broadcast-power?!! A half-coil is a “current-wave launcher,” sending pulses out along the ground surface? (To how far a distance could the two coils be separated, and still behave like just one coil? Tesla, he needed some miles of deserted farm-land, for secret experiments! Jump on the train going West!) Once those experiments were completed, the end result was his giant tower in Long Island, powered by huge dynamos and coal-fired steam turbines. Tesla intended to send the coal-energy to all sorts of tiny grounded coils, at hundreds miles distance. But the money ran out before the smooth metal fifty-megavolt upper terminal was completed. So, the tower could never be tested. (Everybody laughs at an untried new idea. If everybody was unlucky, then the joke’s on them, where Tesla’s giant tower would have worked exactly as advertised, if any investor had stepped up to let him complete the final piece.) Here’s an artist-conception from the Beograd Tesla museum, showing Tesla’s broadcast system in action. Ships at sea can be powered via a fairly small, high-resonance antenna.  Free energy? Tesla never mentioned “free energy” until forty years later, during an interview in 1933, when he announced the discovery of a vast source of “cosmic energy” flowing from the sun. (It wasn’t light, since Tesla claimed that it flowed continuously 24/7, even during the night.) Obviously it was different than the above “Broadcast Power” system. Tesla said that the free-energy receiver would be enormous, the size of a factory, and that he was working hard to figure out a smaller version. He died ten years later, never having divulged the secret. (But maybe he succeeded in making it small, and his infamous “Pierce Arrow” car was powered by free energy, rather than by Broadcast Power.) . ",
            "date": "Updated July 25, 2020",
            "views": "833",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kenneth Lundgren",
                    "user_href": "/profile/Kenneth-Lundgren"
                },
                {
                    "user_id": "Renjith Chandrasekharan",
                    "user_href": "/profile/Renjith-Chandrasekharan"
                },
                {
                    "user_id": "Rishi Chatterjee",
                    "user_href": "/profile/Rishi-Chatterjee-4"
                },
                {
                    "user_id": "Kevin Bar",
                    "user_href": "/profile/Kevin-Bar"
                },
                {
                    "user_id": "Ian Woollard",
                    "user_href": "/profile/Ian-Woollard"
                },
                {
                    "user_id": "Arrow Gedam",
                    "user_href": "/profile/Arrow-Gedam"
                },
                {
                    "user_id": "Antonije Vuković",
                    "user_href": "/profile/Antonije-Vuković"
                },
                {
                    "user_id": "Noel Puklowski",
                    "user_href": "/profile/Noel-Puklowski"
                },
                {
                    "user_id": "Jim Murphy",
                    "user_href": "/profile/Jim-Murphy-49"
                },
                {
                    "user_id": "Morris Lepore",
                    "user_href": "/profile/Morris-Lepore"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Polakowski",
                "href": "/profile/John-Polakowski"
            },
            "answer_text": "The original Tesla coil was intended to transfer power wirelessly. By wirelessly, I mean literally - without wires- NOT through the air. The Tesla coil worked as many others have stated by achieving a resonant condition. The resonance was between the coil and the earth. To achieve resonance with the earth requires an extremely good ground connection, which is why Tesla had an extensive distributed ground system at Wardenclyffe. The primary coil was the “driving coil” and the secondary coil was an impedance matching transmission line, matching the top capacitance to the earth. When in resonance, nodes are created along the transmission line. The top capacitance was the voltage node, and the earth connection was the current node. to receive power an equivalent Tesla would be setup remotely, which would resonate with the local Tesla coil. The energy would be conducted/guided by the incredibly high conductance of the earth ",
            "date": "Answered February 12, 2020",
            "views": "46",
            "upvotes": "0"
        }
    ]
}