{
    "title": "Was the floppy disk a failure? - Quora",
    "tags": [
        "Floppy Disks",
        "History of Computing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Admire",
                "href": "/profile/Joseph-Admire"
            },
            "answer_text": "No. That something is a failure because it has become obsolete is a non sequitur. Floppy disks were, for quite a few years (and I got into personal computing when floppy disks were still very much relevant, in the early 1990's), the best, cheapest and most convenient method of moving files around between computers and packaging software for installation. They weren't perfect by any means, of course - they were prone to data corruption and you had to handle them carefully - but they were the best we had for a long time. They were naturally supplanted throughout the 1990's as various factors combined to make them obsolete - the increasing size of files themselves that made packaging them on floppy disks impractical, the introduction of recordable CD's and later DVD's which made it easy to package and store large files, the development of high-speed Internet which made it possible to transmit large files in timely fashion - but people were still using floppy disks, and floppy disk drives, well into the 2000's, even if they were no longer their primary means of data storage and transport. I wouldn't be surprised if, some twenty years from now, someone is asking this question about recordable CD's and DVD's. ",
            "date": "Answered March 30, 2018",
            "views": "242",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Andres Felix",
                    "user_href": "/profile/Andres-Felix"
                },
                {
                    "user_id": "Victor Eijkhout",
                    "user_href": "/profile/Victor-Eijkhout"
                }
            ]
        },
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "No - it was a massive success! Floppy disks were introduced in the late 1960s, and really took off after the advent of the personal computer. Once drives were being produced in sufficient quantity for them to become economical, they became a practical requirement for personal computers. At the end of the floppy disk era, part of what killed them was proprietary standards. The LS120 could hold 120 MB of data, and Zip disks could hold 100 or 250 MB… but the companies that made them kept them proprietary, so the prices of drives and disks did not come down the way they had for previous generations. Thus, these did not become standard equipment on PCs. With the maximum non-proprietary standard storage format for floppies holding 2.88 MB, CDs became the preferred media for software distribution, and with networking becoming common, the need to use media to transfer files between computers went down. They remained standard in PCs until 2002. For over 20 years, they were the dominant portable storage format among PCs, and many millions of them were sold. I don’t see how that can be called a failure. ",
            "date": "Answered March 30, 2018",
            "views": "29",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Mark Miller",
                    "user_href": "/profile/Mark-Miller-89"
                },
                {
                    "user_id": "Gino Lee",
                    "user_href": "/profile/Gino-Lee"
                },
                {
                    "user_id": "Andrew Anderson",
                    "user_href": "/profile/Andrew-Anderson-29"
                },
                {
                    "user_id": "Darrell Wade Penner",
                    "user_href": "/profile/Darrell-Wade-Penner"
                },
                {
                    "user_id": "Gregg Brooke",
                    "user_href": "/profile/Gregg-Brooke"
                },
                {
                    "user_id": "Saurabh Barjatiya",
                    "user_href": "/profile/Saurabh-Barjatiya"
                },
                {
                    "user_id": "Giorgos Polydoros",
                    "user_href": "/profile/Giorgos-Polydoros"
                },
                {
                    "user_id": "Antonio Quiteves",
                    "user_href": "/profile/Antonio-Quiteves"
                },
                {
                    "user_id": "Darin Richard Roberts",
                    "user_href": "/profile/Darin-Richard-Roberts"
                }
            ]
        }
    ]
}