{
    "title": "We all know the phrase 'when you know better, you do better' but how many of us really believe that? Is there anyone else who thinks that it's not nearly enough to just 'know' better? - Quora",
    "tags": [
        "Advice for Everyday Life",
        "Knowledge",
        "Phrases",
        "Belief and Beliefs",
        "Phrase Definitions",
        "Philosophy of Everyday Life",
        "Human Behavior",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Duke",
                "href": "/profile/Greg-Duke-2"
            },
            "answer_text": "I wouldn't go do far ad saying “not nearly enough\" but I would definitely say it's only half the battle. You may know what you need to do to be better at this or that, or to be a better person, but that doesn't mean you're able to implement your knowledge into your actions successfully. Much of what we do is habit. It's the way our brains work. We get used to doing something a certain way and then that “way\" gets logged into our more subconscious mind and thus becomes habit, you dont need to think about it anymore, it's both a habit and instinctive action. Now, if you want to replace this action with a more effective one, of which you have the knowledge… you'll need to really put your effort into this. You have to now push back your old way of doing it but still, you remember it because you cannot forget by choice! And you have to learn a new action and repeat it enough times that it gets logged into your subconscious. ",
            "date": "Answered December 31, 2019",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amnah Zafar",
                "href": "/profile/Amnah-Zafar-1"
            },
            "answer_text": "when you know better or have the knowledge you try to practically use it. but its not always the case. its something depend on individual variations. some people like to share some like to keep it to themselves. yess its not enough to just know one must do better to bring change in this world but if you not even try to do then its like Mind without Sound! and the person will surely become useless. ",
            "date": "Answered December 29, 2019",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "William Sutton",
                    "user_href": "/profile/William-Sutton-56"
                }
            ]
        }
    ]
}