{
    "title": "What role do computers play in human life? - Quora",
    "tags": [
        "Roll",
        "The Moon (astronomy)",
        "NASA",
        "Cancer"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Korg",
                "href": "/profile/Don-Korg"
            },
            "answer_text": "The essence of computing in today’s modern world is the ability to convert light and sound into digital representations as patterns of binary bits which can then be deconverted on suitable hardware devices, and since there is nothing in nature that suggests this is possible, then we could regard it as a fairly significant miracle and a testament to the creativity and ingenuity of the one or two people who had the vision to actualise it. I entered the world of computing in the 60s when I became involved in the development of Heathrow’s air traffic control system. Back then, data was fed into a computer using 5-hole paper tape, 5 bits of which were sufficient to represent the 26 letters, so there was also 7-hole tape which embraced the ten digits and grammatical characters. We had things called electronic data displays that were character driven cathode ray tubes which could display 80 characters and 12 rows, on which you could display alphanumeric characters, and one of my first jobs was to present them in different shapes and designs, and for users to guess what the characters were, the aim being to eliminate any confusion between L and 1, S and 5, 0 and O etc, the final resut was used for aircraft call signs, so quite important that air traffic controllers correctly identify them. The air traffic control system was in effect a gigantic interrupt handler. Dotted across the UK are radar sites that send digitised information to things called plan position indicators (radar screens) that were part of position consoles situated at Heathrow. Each position console was an array of buttons and switches, and every time an operator pressed one of them, this would activate a hardware interrupt that caused the control program to execute the appropriate sub routine. Computing is based on 2 fundamental precepts – indirect addressing and interrupt handling. The folders we see on our desk top are pointers to the data we want, and every time you touch the screen of your smart phone, this causes an interrupt in the otherwise quiescent state of the device causing the appropriate program to execute In the early 80s, I was a senior software engineer with Bell Telephone Laboratories, and in their engineering department they were carrying out benchmark tests on bit mapped terminals, but back then, it appeared that nobody had much idea what to do with them. You could program each pixel trio to get different combinations of the primary colours red, green and blue, but nothing meaningful was coming out of it until someone had the bright idea to create patterns and shapes that looked like the letters A to Z, a to x, 0 to 9 etc, all of which eventually led to the birth of Microsoft Word. The real innovation was the introduction of 64-bit computers and screens that could refresh faster than the human eye is capable of resolving, thus the illusion of seamless moving images was born. The early voice to digital mechanisms were painfully inefficient, but nowadays you get perfect vision and sound. Screens have a pixel density of about 90 per inch, but smart phones can cram thousands of the bleeders into a square inch, ",
            "date": "Answered May 6, 2018",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Maxwell",
                "href": "/profile/Richard-Maxwell-23"
            },
            "answer_text": "Well, computers are becoming fairly ubiquitous these days. Your smart phone is a computer. Your Android/Apple tablet is a computer. You know that thing you swipe your credit card into to pay for things? It’s a computer. Have you ever seen a kid’s toy that can talk and respond to things they say? That’s a computer as well. Pretty much all modern cars have computers in them, they aren’t 4Ghz, over clocked, 4K HD, screaming gaming monsters, they are small and fairly slow, but they are more than capable of monitoring and accessing all the parts and pieces of a car. So in addition to being able to surf the web, send emails and watch youtube videos on your personal computer. You can use the computer in your smart phone to play games and send text messages to friends. There are specialized computers that only do a few simple tasks (Kids toys or credit card machines), they may be small and simple but it is still a computer. Here is a link I scrounged up from Wikipedia about computers, it covers a wide range of devices that qualify as computers. Computer - Wikipedia I am sure others could come up with other items or probably even better descriptions of things, but the basic thing is that computers are everywhere, whether you realize it or not. PS: That digital watch you or your friends wear? I am pretty sure that’s a computer as well. ",
            "date": "Answered May 22, 2017",
            "views": "42",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishnu Suresh",
                    "user_href": "/profile/Vishnu-Suresh-196"
                },
                {
                    "user_id": "Rohit Malik",
                    "user_href": "/profile/Rohit-Malik-331"
                }
            ]
        }
    ]
}