{
    "title": "What are the downsides of retiring in Maui, Hawaii? - Quora",
    "tags": [
        "Maui",
        "Hawaii (island)",
        "Hawai‘i (state)",
        "Retirement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Quiggle",
                "href": "/profile/Jeff-Quiggle"
            },
            "answer_text": "The main drawback is going to be the very high cost of living anywhere in Hawaii. Property, whether you rent or buy, is going to be more expensive in Hawaii than nearly anywhere else in the US. Everything else is more expensive than most of the US, not only because property is much more costly but also because almost everything is shipped in from the mainland US. Overall cost of living is over 2/3 more than the rest of the US, according to Newsweek (Hawaii, where toilet paper costs more than anywhere in the world, is the most expensive place to live in the U.S.). I think a second drawback is going to be island fever. Basically, the Islands are all very small places, and over time can feel claustrophobic, especially for your typical mainland American who is used to being able to just drive wherever. Get tired of Maui? Well, you’ll need to at the very least get on a ferry, but most likely you’re on a plane to Honolulu, or to the Mainland. So while Hawaii is a wonderful place to visit, if you want to retire there, you better be very wealthy, both to afford the high cost of living, and to pay for occasional trips back to the Mainland. ",
            "date": "Answered December 11, 2018",
            "views": "593",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harold Mendelson",
                    "user_href": "/profile/Harold-Mendelson"
                },
                {
                    "user_id": "Gary McCarty",
                    "user_href": "/profile/Gary-McCarty-5"
                },
                {
                    "user_id": "Andrew S.E. Erickson",
                    "user_href": "/profile/Andrew-S-E-Erickson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Roy",
                "href": "/profile/Paul-Roy-49"
            },
            "answer_text": "Most people mention that it is expensive, and this is true. But there is also the issue of health care. Or the near absence of it. Our hospital is OK if you break a bone or something, but for anything serious you're going to need to fly to Oahu or the mainland. There aren't many specialists here. I needed to get a root canal done. There are fewer than 10 dentists on the entire island who offer the service. And only 2 who take my insurance. Not exactly swimming in choice, and a root canal is a basic procedure. As you age, you'll probably need specific healthcare to address your issues. Unless you want to fly somewhere else for a medical appointment, don't retire on Maui. ",
            "date": "Answered January 15, 2020",
            "views": "464",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jon Bourgetti",
                    "user_href": "/profile/Jon-Bourgetti"
                }
            ]
        }
    ]
}