{
    "title": "What are the applications of the first law of thermodynamics? - Quora",
    "tags": [
        "First Law of Thermodynamics",
        "Thermodynamics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Radhakrishnan (Arkay) Nair",
                "href": "/profile/Radhakrishnan-Arkay-Nair"
            },
            "answer_text": "The First Law of Thermodynamics is the most important principle in the science of heat. The law shows us that matter and energy are the same; matter at rest and matter in motion. In Chemistry we come across a similar law called the Law of Conservation of Mass which tells us that the total amount of matter in the universe is also constant. These 2 laws combined with Newton’s Laws of Motion and Gravitation give us a complete picture of the Universe as matter at rest and matter in motion. Matter at rest is usually visible to humans in the form of solids and liquids. Substances in gaseous form are sensible to touch, smell and sound. All the matter in plasma form are sensible as heat, light, electricity and magnetism. Plasma is a pool of protons, electrons and neutrons, unbound, that are in motion at high speeds that pervade all space in the universe. Newton showed us that light is corpuscular. Now we must realize that all forms of so called electromagnetic spectrum is matter in plasma form moving at the speed of ‘c’ or below. This would lead us to another interesting and mind-blowing inference. “The total amount of light in the Universe is constant”. That means there is no nuclear reaction in the Sun! The Sun is merely reflecting (like a mirror) and refracting (like a lense) light that falls upon it coming from all other stars in the universe. Nature is simple. Ockham principle. ",
            "date": "Answered December 14, 2018",
            "views": "43",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mehar Sharma",
                    "user_href": "/profile/Mehar-Sharma-27"
                },
                {
                    "user_id": "Yusuf Shehu",
                    "user_href": "/profile/Yusuf-Shehu-12"
                },
                {
                    "user_id": "Zilanoor Zilanoor",
                    "user_href": "/profile/Zilanoor-Zilanoor"
                },
                {
                    "user_id": "Muhammad Rizwan",
                    "user_href": "/profile/Muhammad-Rizwan-515"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shrey Patel",
                "href": "/profile/Shrey-Patel-39"
            },
            "answer_text": "The first law of thermodynamics thinks big: it deals with the total amount of energy in the universe, and in particular, it states that this total amount does not change. Put another way, the First Law of Thermodynamics states that energy cannot be created or destroyed. It can only be change form or be transferred from one object to another. This law may seem kind of abstract, but if we start to look at examples, we’ll find that transfers and transformations of energy take place around us all the time. For example: Light bulbs transform electrical energy into light energy (radiant energy).One pool ball hits another, transferring kinetic energy and making the second ball move.Plants convert the energy of sunlight (radiant energy) into chemical energy stored in organic molecules.You are transforming chemical energy from your last snack into kinetic energy as you walk, breathe, and move your finger to scroll up and down this page.Importantly, none of these transfers is completely efficient. Instead, in each scenario, some of the starting energy is released as thermal energy. When it's moving from one object to another, thermal energy is called by the more familiar name of heat. It's obvious that glowing light bulbs generate heat in addition to light, but moving pool balls do too (thanks to friction), as do the inefficient chemical energy transfers of plant and animal metabolism.  ",
            "date": "Answered March 22, 2016",
            "views": "499",
            "upvotes": " View 56 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chethan Chandra",
                    "user_href": "/profile/Chethan-Chandra-5"
                },
                {
                    "user_id": "Ahmed Amged",
                    "user_href": "/profile/Ahmed-Amged-5"
                },
                {
                    "user_id": "Dhruv Shah",
                    "user_href": "/profile/Dhruv-Shah-683"
                },
                {
                    "user_id": "JAMES IFEOLUWA",
                    "user_href": "/profile/JAMES-IFEOLUWA-1"
                },
                {
                    "user_id": "Abdalla Ali",
                    "user_href": "/profile/Abdalla-Ali-84"
                },
                {
                    "user_id": "Ishita Jha",
                    "user_href": "/profile/Ishita-Jha-23"
                },
                {
                    "user_id": "Avinash Ahq",
                    "user_href": "/profile/Avinash-Ahq"
                },
                {
                    "user_id": "BIKORIMANA Evode",
                    "user_href": "/profile/BIKORIMANA-Evode"
                },
                {
                    "user_id": "Ayush Patidar",
                    "user_href": "/profile/Ayush-Patidar-11"
                },
                {
                    "user_id": "R Jobs",
                    "user_href": "/profile/R-Jobs"
                }
            ]
        }
    ]
}