{
    "title": "What is automated customer service? - Quora",
    "tags": [
        "Customer Experience",
        "Automation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Woodard",
                "href": "/profile/Chris-Woodard-21"
            },
            "answer_text": "Automated customer service is customer service rendered through automation, or simply, customer service without human CS reps. Automated CS includes using robots for live chat support and creating self-help web pages or mobile customer service apps for customers. Automated customer service is getting more popular these days because of its benefits over traditional human-mediated service. First, it’s cheaper to fund because you only need software or AI instead of people to employ. A company can save on wages, training, and infrastructure if they assign the CS line to an automation tool. Another advantage is that it’s available 24/7. It doesn’t work in shifts or during office hours. Finally, automated customer service wins because it’s fast. Quick query resolution scores high on customer service surveys, and this one easily goes to automation because a human can’t beat a robot’s response time. Automation has been hailed the future of customer service with some even saying that it will eventually replace call centers. That, I think, is a bit exaggerated. Service still needs a personal touch, and that’s why human conversations will continue being significant in business. Traditional customer service providers can up their game with personalization, and that’s something you can achieve Tenfold. It’s a CTI technology that links phones to CRM, ERP, and other data systems for a single unified view of the customer. It’s the key to providing customers a personalized service—even during the interaction. You can learn more about CTI from this free ebook, Benefits of CTI at our website. Hope you can check it out! ",
            "date": "Answered April 20, 2018",
            "views": "991",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karl Crisostomo",
                    "user_href": "/profile/Karl-Crisostomo-1"
                },
                {
                    "user_id": "Aiza Rabi",
                    "user_href": "/profile/Aiza-Rabi-1"
                },
                {
                    "user_id": "Michelle Galang",
                    "user_href": "/profile/Michelle-Galang-3"
                },
                {
                    "user_id": "Aira Panganiban",
                    "user_href": "/profile/Aira-Panganiban-4"
                },
                {
                    "user_id": "Ice Mendoza",
                    "user_href": "/profile/Ice-Mendoza-1"
                },
                {
                    "user_id": "Jeg Lee",
                    "user_href": "/profile/Jeg-Lee"
                },
                {
                    "user_id": "Jaquelyn Arellano",
                    "user_href": "/profile/Jaquelyn-Arellano"
                },
                {
                    "user_id": "Matt Tantuan",
                    "user_href": "/profile/Matt-Tantuan"
                },
                {
                    "user_id": "Angela Cruz",
                    "user_href": "/profile/Angela-Cruz-7"
                },
                {
                    "user_id": "Darwin Vasquez",
                    "user_href": "/profile/Darwin-Vasquez-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danielle A. Harrison",
                "href": "/profile/Danielle-A-Harrison"
            },
            "answer_text": "How Automation Technology Can Humanize Your Customer Experience Automation offers three main CX benefits There are three ways in which automation can give your customer experience a serious boost. 1. Greater capacity to focus on high-touch customer interactions Many tasks that your customer support personnel do manually, such as identifying the customer, retrieving account details, and logging the issue, are routine and require little thought. Unfortunately, these are the tasks that consume most of your employees’ time.  By automating these mundane tasks, your human workers have greater capacity to focus on the human side of customer support. Let the machine take over the simple parts of the job so your reps can really dig into the problem, understand what the customer wants, and provide the most thoughtful solution. 2. A simpler user experience Customers want to do minimal work. After all, they’re paying you to deliver a product or service. Why should they have to exert any more effort? Making sure your user experience is simple and straightforward is a good way to minimize customers’ efforts. Automation can help with this, too.  For example, instead of making visitors to your site search for something, a chatbot could pop up and ask them exactly what they’re looking for, then direct them to the right page. If they make purchases from your site on a regular basis, automation technology can deploy prompts to ask the user if they’d like to purchase the same item as last time. These tools not only help you provide a seamless customer experience, they also reduce cart abandonment by making the checkout process as easy as possible. 3. Greater self-service Your customers don’t want too many responsibilities when it comes to doing business with you. At the same time, self-service is often the most efficient way to solve a problem. Take the call center nightmare example. Simply writing your issue to a chatbot on the company’s website is far easier than spending an hour on the phone. With automation, customers have instant access to tools that will enable them to solve problems painlessly and fast.  Self-service capabilities also serve your employees. There is nothing fulfilling about spending your time inputting data. By freeing up your staff to focus on the more complex aspects of their roles, they will be more engaged and experience less frustration. Don’t pass up on automation Adding automation technology to your customer experience strategy makes your service more human, as counterintuitive as it may seem. Automation improves efficiency and workflow for your staff, and ease of use for customers. When implemented correctly, it’s a win-win. Click here to read the full article. ",
            "date": "Answered August 28, 2018",
            "views": "217",
            "upvotes": "0"
        }
    ]
}