{
    "title": "What is quantum computing? - SCIENCE TALKZ - Quora",
    "tags": [
        "The Universe",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shubham Sharma",
                "href": "/profile/Shubham-Sharma-8986"
            },
            "answer_text": " Quantum computing is the use of quantum-mechanical phenomena such as superposition and entanglement to perform computation. Computers that perform quantum computations are known as quantum computers. Quantum computers are believed to be able to solve certain computational problems, such as integer factorization (which underlies RSA encryption), substantially faster than classical computers. Quantum computing began in the early 1980s when physicist Paul Benioff proposed a quantum mechanical model of the Turing machine.  There are several models of quantum computing, including the quantum circuit model, quantum Turing machine, adiabatic quantum computer, one-way quantum computer, and various quantum cellular automata. The most widely used model is the quantum circuit. Quantum circuits are based on the quantum bit, or \"qubit\", which is somewhat analogous to the bit in classical computation. Source- Wikipedia Image source- Google We explore the biggest insane questions only Science can answer- Science Beings ",
            "date": "July 26, 2020",
            "views": "101",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Naman Makkar",
                    "user_href": "/profile/Naman-Makkar-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "P.r. Mahesh Kumar",
                "href": "/profile/P-r-Mahesh-Kumar"
            },
            "answer_text": "Quantum computing is an area of computing focused on developing computer technology based on the principles of quantum theory, which explains the behavior of energy and material on the atomic and subatomic levels. Classical computers that we use today can only encode information in bits that take the value of 1 or 0 Quantum computing is the use of quantum-mechanical phenomena such as superposition and entanglement to perform computation. Computers that perform quantum computations are known as quantum computers. Quantum computers aren't limited to two states; they encode information as quantum bits, or qubits, which can exist in superposition. Qubits represent atoms, ions, photons or electrons and their respective control devices that are working together to act as computer memory and a processor. ",
            "date": "July 26, 2020",
            "views": "20",
            "upvotes": " Submission accepted by Alex Benny "
        },
        {
            "author_info": {
                "name": "Mehul Borad",
                "href": "/profile/Mehul-Borad-1"
            },
            "answer_text": "well like you have 1–0 (binary bits) in normal computers(lets call them *N.C*) and operations bw them lead to logical computation like you have gates AND NAND OR NOR XOR for logical operations ) quantum computers(lets call them *Q.C*)use q bits which can exist in infinite quantum states(probability states) and operations like entanglement and other quantum phenomenon can be used to compute loads of stuff that normal computers cant do (because the q bits are based on probability they are best for probability problems) but they *cant* do what normal computers do the best .THINK OF IT LIKE when you want to measure length of about 1mm - 1m u use a normal ruler(NC) but when u want to measure length of 1km -100km u use a sattelite (QC) and both of them are the best in their doamin of use (even thoung the latter tkes lot more skill and money) ",
            "date": "July 9, 2020",
            "views": "45",
            "upvotes": " Submission accepted by Alex Benny "
        }
    ]
}