{
    "title": "What is going to change on Earth as the sun expands? - Quora",
    "tags": [
        "Earth-Sun Relationship",
        "The Solar System",
        "The Sun",
        "The Universe",
        "Cosmology",
        "Earth (planet)",
        "Astrophysics",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marium Ghulam Nabi",
                "href": "/profile/Marium-Ghulam-Nabi"
            },
            "answer_text": "When the Sun will expand it will consume Mercury and Venus, and reach Earth. According to Alex Wolszczan, an astronomer at Pennsylvania State University “A similar fate may await the inner planets in our solar system, when the sun becomes a red giant and expands all the way out to Earth's orbit some five billion years from now “ When the Sun will expand the atmosphere on the Earth will become hotter and hotter , the oceans will boil up and almost everything on Earth will die. According to Don Kurtz, astrophysicist at the University of Lancashire \" The future of the Earth is to die with the sun boiling up the oceans, but the hot rock will survive \" However the changing of sun may provide hope to other planets. When stars change into red giants, they change the habitable zones (the region where liquid water can exist) of their system. As a star remains a red giant for almost billion years, it may be possible for life to arise in the outer solar system, which will be closer to the sun.  ",
            "date": "Answered March 9, 2019",
            "views": "221",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Caleb Webb",
                "href": "/profile/Caleb-Webb-26"
            },
            "answer_text": "It slowly gets hotter and hotter, then the atmosphere blows away and then the oceans boil and everything dies (mostly) then the outer layer of the sun will actually engulf earth and we’ll be looking like a piece of bacon that was fried too long. Then the outer layers slowly dissipate and new elements are given off and all that is left is a white dwarf and some really fucked up inner planets. ",
            "date": "Answered March 4, 2019",
            "views": "7",
            "upvotes": "0"
        }
    ]
}