{
    "title": "What is the best online resource to teach my 8-12 year old kids some coding (fundamentals)? - Quora",
    "tags": [
        "Teaching",
        "Learning to Program"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mudit Goel",
                "href": "/profile/Mudit-Goel"
            },
            "answer_text": " For an 8-year-old kid: Start with a basic drag-and-drop interface using Blockly on Code.org.Then switch to a more sophisticated platform like Thunkable (it uses Blockly) to build real-world apps.If you need a dedicated teacher, you can contact Coding Elements.For 12-year-old child: Start with a simple programming language like Python. You can find tutorials on YouTube.Then move on to building real-world projects.For data science and machine learning projects, you can easily use Python.For web development or mobile app development, you can use React Native, which requires knowledge of Javascript. (Once you know Python, switching to any other language will take only a few days).I would be able to suggest in more detail if you can tell me the expected goal. Because the curriculum will change depending on your end goal. However, my recommendations above are quite broadly applicable. You can check out our full curriculum here: Coding for Kids by Coding Elements. Our teachers are trained in SEL (social and emotional learning) so that they connect with kids on a human level. And we promote a growth mindset in kids with the power of our words.Our projects are real-world projects. Students have to think about the problems they see in the world around them and build a solution to solve those problems.We focus on teaching transferable skills, as opposed to teaching a particular technology. We will sometimes use 2–3 languages within a single project. ",
            "date": "Updated March 3, 2020",
            "views": "19",
            "upvotes": " View 76 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sk Afroze Sulthana",
                    "user_href": "/profile/Sk-Afroze-Sulthana"
                },
                {
                    "user_id": "Gunashekar Chowdary",
                    "user_href": "/profile/Gunashekar-Chowdary"
                },
                {
                    "user_id": "Atish Shah Rouniyar",
                    "user_href": "/profile/Atish-Shah-Rouniyar"
                },
                {
                    "user_id": "Akhil Akhil",
                    "user_href": "/profile/Akhil-Akhil-365"
                },
                {
                    "user_id": "Sonia Verma",
                    "user_href": "/profile/Sonia-Verma-421"
                },
                {
                    "user_id": "Himanshu Kumar",
                    "user_href": "/profile/Himanshu-Kumar-3260"
                },
                {
                    "user_id": "Alana Najimudeen",
                    "user_href": "/profile/Alana-Najimudeen"
                },
                {
                    "user_id": "MOHAN TANDAN",
                    "user_href": "/profile/MOHAN-TANDAN"
                },
                {
                    "user_id": "Riddhi Jain",
                    "user_href": "/profile/Riddhi-Jain-87"
                },
                {
                    "user_id": "Poojitha Ravuri",
                    "user_href": "/profile/Poojitha-Ravuri-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael David Cobb Bowen",
                "href": "/profile/Michael-David-Cobb-Bowen"
            },
            "answer_text": "I think the first thing to do is get them to appreciate the power of the command line. So put together some cheap linux machines and get them used to it. If you put them online, they may start to believe that everything is browser based. That’s a crippling concept. You have got to show them the raw stuff and get them comfortable. I remember getting all of my kids on Ubuntu, and so they got used to that. But when I wrote a small counting loop in Ruby my daughter was absolutely spellbound that the computer could count to a million in under a second. So we went on from there. Well, how long would it take to count to 2 million? Oh, for that we need a variable to represent the number to count to… None of my kids cared much about coding but now one of them does webstuff for her marketing job. But the point was that they knew what was under the hood. Getting kids to understand how to navigate a linux file system is huge. ls, cd, pwd, cp, rm(!), history, grep, cat, ln, more. Teach that. There will not always be jobs for coders, but there will always be jobs for sysadmins. A kid who learns linux in middle school should be immediately employable by high school graduation. Coders will distinguish themselves. Teach them all how to use the machine. ",
            "date": "Answered December 23, 2017",
            "views": "678",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Poorva Sonparote",
                    "user_href": "/profile/Poorva-Sonparote"
                },
                {
                    "user_id": "Paul Brinkley",
                    "user_href": "/profile/Paul-Brinkley-1"
                },
                {
                    "user_id": "Marti LaChance",
                    "user_href": "/profile/Marti-LaChance"
                },
                {
                    "user_id": "Steve Stevens",
                    "user_href": "/profile/Steve-Stevens-9"
                }
            ]
        }
    ]
}