{
    "title": "What is not changed by technology? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Hope Mogale",
                "href": "/profile/Hope-Mogale-1"
            },
            "answer_text": " I know a number of things that technology could not change and after so many attempts these still remain the same. Understand that one of the major reasons why technology could not change these things was not because technology couldn’t change them all rather that it was unecessary and also wasn’t a wise business decision to change them. Now the list is long of things technology cannot replace however I will only name 5. Clothes Peg (Clothes Pin)A peg has been around for a long and even today it is still used to hang clothes. No amount of technology has manged to replace a peg or take its job. A peg is still the de facto standard in any country on earth and it is well known for doing one job and one job only which is hanging clothes to dry. Even if human beings invent robots will still use the Pegs to hang clothes. The is no alternative. Notice that washing machines with dryers have been invented but the Peg still exists today and will do so forever. 2. Pencil A pencil is simply the most elegant tool for writing your thoughts. A pencil as simple as it is it cannot be replaced or even made simpler. It erasable and cheap to produce and mostly harmless. Even though you cannot use it for everything especially on official documents because rubber can erase it. A pencil still remains useful today and and it is here to stay. Legend has it that when astronauts were faced with the need for a special pen to use in space. Someone emerged from the crouwd and said there is no need for that special pen because we already have a special one that doesn’t cost a dime and he showed them a pencil. 3. Oil PumpJack (Nodding Donkey) An Oil PumpJack is used as an over the ground reciprocating piston pump to lift oil out of the oil well. PumpJacks have been around for a long time and as long as crude oils is mined they will be used. Even if humans discover oil in other planets PumpJacks will still be used there as well because they work so well. Invented by Walter Trout PumpJacks have become the standard in the oil industry. 4. Clothes Hanger or Coat Hanger Coat hanger or Clothes hanger have been around for as long as clothes have existed. No amount of technology will replace them it is something you have to make piece with that a triangular clothes hanger will hangon to your coat until the next time you need it without worries. 5. Rubber band Used mostly by banks to hold federal notes. Rubber bands are very important though people take them for granted. Handle large quantities of paper money and you will see it’s impossible without rubber bands and no amount of technology will ever change that. There are many other things that technology will not change no matter how hard it tries. Things like a Potain Crane, Cooking Pots, triple beam balance, baby pin, Soda Can and etc. Technology revolves around the rule of “If it works, has no side effects and not expensive and hard to find then don’t change it… Otherwise make plan, innovate and come up with something better.” —- Hope Mogale ",
            "date": "Answered May 8, 2018",
            "views": "646",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Andrew Olson",
                "href": "/profile/Andrew-Olson-33"
            },
            "answer_text": "One wag said the only two jobs that will survive are prostitution and law. I'm not entirely sure they were wrong. Both professions are intrinsically dependent on human factors, particularly imperfections. That said, well, I'll leave the rebuttal to “Do Androids Dream of Electric Sheep\", by Philip K Dick. Even if you've seen Blade Runner, the original book is well worth the read. ",
            "date": "Answered November 3, 2019",
            "views": "36",
            "upvotes": "0"
        }
    ]
}