{
    "title": "What should I do if I want to have a career in computers and technology but I have a learning and math disability? - Quora",
    "tags": [
        "Learning Disabilities",
        "Disability and Disabilities",
        "Learning",
        "Computers",
        "Technology",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Bell",
                "href": "/profile/Bill-Bell-33"
            },
            "answer_text": "You might not be aware of the wide array of occupations in this field: Computer and Information Technology Occupations. Although this page suggests that most require degrees of some sort I know of people in some of these jobs without degrees that do quite well. Answering your question more directly, a lot of the jobs in the field require only limited mathematics ability and can be learned in a variety of ways. It depends what you find attractive about a career in IT. I would say pick one of the areas and find some way of experimenting in it. Do a course or two on-line, watch some youtube videos, try some techniques on your own computer equipment. Be patient with yourself because people that aren’t patient with themselves have a hell of a time staying the course in this type of work. Trust me, I know. ",
            "date": "Answered October 24, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Joshua Gross",
                    "user_href": "/profile/Joshua-Gross-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Crespi",
                "href": "/profile/Jerry-Crespi"
            },
            "answer_text": "Don’t put off those subjects without studying them first. There are lots of tech and computer jobs that do not require programming, math etc. First learn some things in the field BEFORE you decide that you cannot or do not want to pursue them further. Doing that is like not tasting some food and deciding you won’t like it without even knowing how it tastes. ",
            "date": "Answered October 23, 2020",
            "views": "48",
            "upvotes": " Answer requested by Alexis Todd"
        }
    ]
}