{
    "title": "What's the worst customer service experience you've ever had? - Quora",
    "tags": [
        "Customer Feedback",
        "Online Customer Support",
        "Customer Experience",
        "Customer Service"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Stockemer",
                "href": "/profile/Sean-Stockemer"
            },
            "answer_text": "Living in Germany. That sounds broad and vague, but I am constantly appalled at the level of customer service I receive here. Especially in restaurants. It’s typical for a server to come to the table and ask for a drink order in a dry, emotionless tone. “What would you like to drink?” (or God forbid “What do you want?”) I can pretty much accept that servers, here, are really ordertakers and nothing more. Or I’ve accepted it, really. What’s harder to accept and even more appalling is a lack of customer service in American fast food chains. I was at a McDs a few months ago, and ordered for me and my kids. To insure that they got fresh burgers, I ordered their cheeseburgers with no onions but mine …whatever, I like their onions. When the tray of food was finished, before I left the counter, I hefted my burger. It had obviously been under the heat lamp for a good 20–30 minutes. The bun was hard and crunchy. I pointed this out to the shift leader, and asked for another one. He picked it up and felt it through the wrapper and verbally disagreed with me. Again, in slow…he told me that I was wrong. So he sets it down on the tray again. The manager on duty was nearby and noticed what was happening. He came over and asked if everything was ok. I repeated myself (this burger is old and hard, I’m pretty sure it’s been under the heat lamp for almost a half hour and I’d like a fresh one) then he too hefted my McDouble. Next he set it down and proclaimed, as well, that I was mistaken. I was speechless. Absolutely speechless. I’ve been eating McDs for 37 years, that I can remember. Since before they came to be widespread in Germany. I spent a few years working in fast food, as a teen. And another 13 years in the restaurant business. I’m well aware of McDs quality standards, and they were obviously not met on this occasion. I took my food and walked away. I won’t return. I didn’t bother asking for someone’s name or phone number. There’s no point. Customer service in Germany is a fucking joke. From time to time, however, I am surprised. I was at my favorite hardware store about 6 months ago buying tile for my bathroom. I was so impressed by the guy who helped me that I asked to speak to his supervisor when he returned a phone call. He couldn’t help me there, though. He explained that he is the department head, and that he was just doing his job. I sung his accolades and asked that he pass my compliments along to his boss, because his service was outstanding. It really wasn’t incredibly outstanding by my standards (rather good or better than average), but by German standards this guy was on a whole different level. ",
            "date": "Answered January 18, 2017",
            "views": "15",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishnu Raghavan",
                    "user_href": "/profile/Vishnu-Raghavan-17"
                },
                {
                    "user_id": "Rachael Kieselstein",
                    "user_href": "/profile/Rachael-Kieselstein"
                },
                {
                    "user_id": "Sarah Blake",
                    "user_href": "/profile/Sarah-Blake-130"
                },
                {
                    "user_id": "Stephanie Taylor Hobson",
                    "user_href": "/profile/Stephanie-Taylor-Hobson"
                },
                {
                    "user_id": "Jess Helm",
                    "user_href": "/profile/Jess-Helm-1"
                },
                {
                    "user_id": "Leonore Christine",
                    "user_href": "/profile/Leonore-Christine"
                },
                {
                    "user_id": "Juen Lin",
                    "user_href": "/profile/Juen-Lin"
                },
                {
                    "user_id": "Rohit Valasapalli",
                    "user_href": "/profile/Rohit-Valasapalli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Oscar Romero",
                "href": "/profile/Oscar-Romero-21"
            },
            "answer_text": "Well—I had many bad experiences—however-there is one just comes to mind all the time. I think because it really got me by surprise. I was not expecting that response from the business owner….whom still seem hurt by my comment. Maybe I was rude when I said it. Here is the story—Happened few years back. I have a favorite place I go and get pizza—new York style pizza. I do love their pizza. That is the main reason I took our out of town guests to eat there when they asked for a place to have a nice lunch. We got there—ordered few pizzas and pasta—I think. This is a place in Tijuana-this restaurant’s owner is an American citizen. Easy to tell just by his appearance and his strong accent when he speaks Spanish. My guests were from USA—so, as the owner comes by our table—he asked: “how is the food”? To which I responded: “Good you asked, it is quite terrible.” He then looked at me quite upset and asked what was the problem—to which I responded, “all our food is quite salty—Hard to eat it. Too much salt!.” He simply did not respond and just took off, obviously upset. So, we try our best to eat what we could and then got ready to go, after we paid. When we were almost out of their patio—he yelled at us: “Who said the food was salty?” I then turned around and said to him-”Allow me to have my guests tell you, please”. Then-one by one, all my two guests confirmed that in fact our food was very salty, everything. He then just turned around and stormed into his restaurant. No apologies, no comment, no nothing. Even though this event happened, I still go there and order their pizzas—I love their veggie pizza—I do think is the best of the best—When is not too salty of course. And, while I am there, he does recognize me and never says anything to me….even though he is quite effusive with all of his other customers. I surprises me that—when a customer asks for feedback—he gets it and then-get upset about it. Instead of fixing the problem or at least looking into the problem. Number one problem with customer service—ONLY when we see the issue from the customer’s perspective—we might be able to solve a problem. However—if we somehow, take things personal, we will never learn and will continue making same mistakes. I hope one of these days someone else will also let him know—sometimes, his food has too much salt…and be able to correct that issue. I think he did—as of lately, his pizzas has been quite good—to my taste. ",
            "date": "Answered March 10, 2019",
            "views": "1",
            "upvotes": "0"
        }
    ]
}