{
    "title": "What is one good thing that happened for humanity this year in 2020? - Quora",
    "tags": [
        "Future of Humanity",
        "Humanity (attribute)",
        "Future Scenarios",
        "2020 (year)",
        "The Human Race and Condition",
        "Important Life Lessons",
        "History",
        "Experiences in Life",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Moche",
                "href": "/profile/Jeffrey-Moche"
            },
            "answer_text": "trump!!! And in several ways, which all boil down to one. The world is collapsing on several fronts. There’s a worldwide rightwing political movement; global warming is becoming an irreversible threat to the planet; extreme wealth disparity is laying bare some essential flaws of capitalism; we over-consume, blah blah blah. But the most central figure that has more impact and on more fronts is probably trump. And WE, human civilization, are like the extreme alcoholic. It seems like our only hope is to “hit bottom”, and HARD! trump is that cold slap in the face, if we can manage to learn the proper lessons from it. I’m not at all optimistic. But perhaps we’ll wake up. Without trump though, we were on a slow burn anyway. They’ve been talking about the threat of global warming for decades. American politics has been in shambles for many years. The toxic problems that come from capitalism were not going to change. On top of all this though, we not only have to recognize that we have a problem, but have acceptable plans to make a transition. I have notions about those, but have no audience that’s listening. ",
            "date": "Answered September 21, 2020",
            "views": "61",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Mikhail Rozhkov",
                    "user_href": "/profile/Mikhail-Rozhkov-1"
                },
                {
                    "user_id": "Igor Skryabin",
                    "user_href": "/profile/Igor-Skryabin"
                },
                {
                    "user_id": "Johan Van Niekerk",
                    "user_href": "/profile/Johan-Van-Niekerk-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dimitri Scholz",
                "href": "/profile/Dimitri-Scholz"
            },
            "answer_text": "We realized that many workloads cand be done remotely. This will decrease empty commuting in the future, end consequently help us to protect environment. ",
            "date": "Answered October 27, 2020",
            "views": "45",
            "upvotes": " View 3 Upvoters"
        }
    ]
}