{
    "title": "What types of things could commonly be found on cars made 50 years ago that would be rare to find on a car made in 2020? - Quora",
    "tags": [
        "Car Design",
        "Classic Cars",
        "Automotive Industry",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Blair Blakely",
                "href": "/profile/Blair-Blakely-1"
            },
            "answer_text": "What types of things could commonly be found on cars made 50 years ago that would be rare to find on a car made in 2020? Let’s see…50 years ago….that would be 1970. Now, this is from the American perspective and will discuss mostly American made cars since ‘imports’ had not achieved the saturation in the U.S. market that they have today. If you went to a new car dealership in October of 1970, you might have done so just to see what the offerings by the ‘Big Three’ were for the 1971 model year since the ’71 models were usually introduced around the end of September in most cases. There would be some exterior styling changes and some interior trim changes from the 1970 models and there might be some changes in the ‘available options’ for the new model. Now, ‘standard’ and ‘optional’ equipment varied depending the line offered by the manufacturer. American auto manufacturers at that time usually had three ‘platforms’. a ‘compact’, ‘intermediate’ and ‘full size’ platform. three different sizes of cars and even in the same platform they offered different levels of equipment. But, for the ‘average’ new American car for 1971 most of them had much in common. Unless you bought a higher end offering that had many standard features that are optional on the lower models of the same car one of the first things you would notice is…window cranks. A crank to raise and lower the windows. Power windows were an option on most cars and not even offered on some cars. Want to lock the doors? you reached up and pushed a knob on the window sill down. On all the doors. A few cars had central locking and power locks might be available on some models. What’s this, no power seats? and just one wide seat in the front and not two individual seats? That’s an option (extra cost) on many cars at the time. Now there might be a gear shift on the column since the ‘automatic’ transmission was becoming more common though at optional cost. But on a lower level ‘economy’ car the shift lever might control a three speed manual transmission. Stick shifts in a console on the floor were available on many cars but again, an extra cost option. The car you are looking at on the showroom floor may have an AM radio in the dash or the optional AM/FM or AM/FM tape player (8 track). Now let’s open the hood. Unless it’s a ‘compact’ economy car from that particular manufacturer, you will probably find a cast iron V-8 under the hood. There were still plenty of in-line six cylinders around but those would be found on the cheaper compacts and intermediates. And you could find a carburetor under the air cleaner. If it’s an intermediate or full size car it might have the optional power brakes and/or power steering. Maybe even air conditioning. But these were extra-cost options on most cars. Other things you might not notice unless you crawled around under the car … drum brakes all around. And only a couple of weird American cars were front wheel drive. Rear wheel drive was the norm. I could go on and on but you get the idea. New cars sold in American in 1970 were considerably different than the cars of today. ",
            "date": "Answered October 23, 2020",
            "views": "687",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Camilli",
                    "user_href": "/profile/Anthony-Camilli-2"
                },
                {
                    "user_id": "Glen Cowgill",
                    "user_href": "/profile/Glen-Cowgill-1"
                },
                {
                    "user_id": "Donald Jarocki",
                    "user_href": "/profile/Donald-Jarocki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mick Parker",
                "href": "/profile/Mick-Parker-19"
            },
            "answer_text": "Many, many things, some for the better, some worse. 1/4 vent windows in the front doorsThe rare option of A/CExcellent fresh air ventilation systems (for those without A/C)No rear demisterNo passenger side exterior mirrorInterior rear view mirror did not have the prismatic night/day function.Seatbelts had only just been made legal on front seats, but the rears weren’t (in Australia) and we had great fun as kids playing ‘corners” in the rear seat.Floor mounted dip switchHorn ringsPull-out headlight switchPull out wiper switchLuxury models had infinitely variable instrument dimming by rotating the headlight switch - unlike a lot of modern “bright/dim only” options.7″ round sealed beam headlights.Push-button radios where you pulled out the button to set the memory.Mechanical tuning dial on the radioAccessory radio antennas, some with a little red light on the tipUniversal “mud spats” that would fit almost any carFull size spare wheel, the same wheel/tyre as the other 4.Exterior key lock on the passenger door.Boot (trunk) key lockBonnet (hood) release lever at the grilleGlass fusesGenerators with external regulators6V electricsLucas electrics!!Engine driven fansPushrodsFibre cam timing gears.DOHC (except for few imports like Alfa Romeo and Cosworth engines)CarburettorsChokesSecondaries! Hitting them was our version of “V-tec kicked in yo!”3 speed manuals4 speed manualsColumn shift manuals3 speed autos12mpg from a 6 cylinder.Under-dash “umbrella” handbrakesFloor mounted handbrake between the driver’s seat and doorDrum brakes on the frontNo power assistance for the brakes14″ wheels with wide tyresChrome trim rings on wheelsRed-band and white-band “performance” tyresMetal “hub caps” or full wheel covers. Many of them very ornate.Real chrome (or polished stainless) body accents, not fake plastic chromeRear drive in small cars (up to the late 70s, even most of the small imports where rear drive).Chrome bumpersOver-ridersMetal grillesMetal badgesWind-up windowsDoors that shut with a solid clunkLack of reverse lights (some were incorporated into the blinker system).A proper cigarette lighter, with a metal socket (not a plastic power outlet).Ashtrays - a multitude of them around the car, including rear doors and the back of the front seats.Metal dashboardsNo centre consoleBench seat with optional buckets.Vinyl trim with expensive optional cloth.No front head restraints (not needed legally until 1972 in Australia).The ability to tell cars apart at first glance, and instantly know which brand it was.Massive C-pillar blind spots. Oh, wait, 2020 designers have brought them back in plague proportions…..",
            "date": "Answered October 23, 2020",
            "views": "23",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Keasal",
                    "user_href": "/profile/David-Keasal"
                },
                {
                    "user_id": "Kevin Wills",
                    "user_href": "/profile/Kevin-Wills-22"
                },
                {
                    "user_id": "Peter Rowland",
                    "user_href": "/profile/Peter-Rowland-17"
                },
                {
                    "user_id": "Alistair MacRae",
                    "user_href": "/profile/Alistair-MacRae"
                },
                {
                    "user_id": "Dave Lee",
                    "user_href": "/profile/Dave-Lee-493"
                },
                {
                    "user_id": "Alex Johnson",
                    "user_href": "/profile/Alex-Johnson-465"
                },
                {
                    "user_id": "Les Mikesell",
                    "user_href": "/profile/Les-Mikesell"
                },
                {
                    "user_id": "Yms Bushan",
                    "user_href": "/profile/Yms-Bushan"
                },
                {
                    "user_id": "Christopher Lester",
                    "user_href": "/profile/Christopher-Lester-12"
                },
                {
                    "user_id": "John Privett",
                    "user_href": "/profile/John-Privett"
                }
            ]
        }
    ]
}