{
    "title": "What type of technology was used to capture bees in flight? - Quora",
    "tags": [
        "Apiculture (Beekeeping)",
        "Bees (insect)",
        "Flying",
        "Flights",
        "Entomology",
        "Insects",
        "Technology Trends",
        "Airlines",
        "Air Travel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ranvijay Raj",
                "href": "/profile/Ranvijay-Raj-1"
            },
            "answer_text": "Drone to Drone: Can Bees Help Make Better Flying Robots? NEWS Nov 22, 2018 Original Press Release from the University of Queensland  Credit: Devcore [CC0], from Wikimedia Commons  If you've ever lost your balance standing on a bus that takes a sharp turn at speed or felt your car skid when you drive around a corner too fast, you've experienced the effects of centrifugal force. Turning while simultaneously moving forwards creates a force that pulls the turning object away from the direction of the turn. The faster you're going and the sharper the turn, the more centrifugal force you experience, and the more likely you are to lose control. This is why we and other animals tend to slow down when we approach a turn. Scientists have observed this behaviour in a few animals; however, Professor Mandyam Srinivasan's lab is the first to mathematically analyse the relationship between speed, curvature, and centrifugal force in this phenomenon. Bees maintain constant centrifugal force while turning The study by PhD student Mr Mahadeeswara Mandiyam and Professor Srinivasan at the Queensland Brain Institute, UQ, used a high-speed-multi-camera system to capture video footage of bees loitering outside their hive when the entrance was temporarily blocked, creating a 'bee cloud' outside the hive. This type of semi-outdoor, 'bee cloud' experiment is the first of its kind, and is significantly closer to reality than previous experiments used for studying collision avoidance behaviour in bees. The high speed videos were analysed mathematically to study the flight behaviour of bees in the cloud. Professor Srinivasan and Mr Mandiyam hoped to better understand the complex manoeuvre of maintaining a desired flight trajectory while turning without disruption from centrifugal force. The bees' speed, acceleration, and sharpness of turn were all computed using vector calculus to investigate how bees maintain control while turning. The scientists found that bees' speed decreases when entering a turn, and increases when exiting. This mathematically confirms observations of turning behaviour of other animals such as fruit flies, bats, and horses. Significantly, bees were able to maintain a largely constant centripetal acceleration while turning, regardless of how sharp the turns were or how fast the bees were travelling, which minimised the effects of centrifugal force on their flight path. Centripetal force pulls an object towards the centre of the turn, while centrifugal force pushes it away from the centre. Bees slow their speed to keep forces constant The researchers hypothesised this constant centripetal acceleration was the result of active efforts by the bees to reduce 'sideslips', or the loss of control caused by excess centrifugal force (like when a bus turns too quickly and you fall over) by managing their speed. \"When a bee is making a turn, it cleverly reduces its speed in an appropriate way so that the centrifugal force that it experiences is always constant,\" Mr Mandiyam said. \"The sharper a turn is and the faster the bee is going, the greater the centrifugal force that the bee will experience; the bee deals with this problem by slowing down when it makes sharper turns,\" he said. Interestingly, the bees showed no preference for left or right turns, which can be an important aspect of collision avoidance in animals. The researchers also found that bees held about the same amount of acceleration during both loitering turns and close encounters with other bees, meaning the bees' turning dynamics were the same, regardless of the context. The researchers are now exploring the sensory information used to guide collision avoidance manoeuvres during these close-encounter turns. Towards creating better flight control Bee flight patterns have long been of interest to Professor Srinivasan and his lab. They hope to use a greater understanding of bee flight behaviour to incorporate in aerial robots and ground vehicles with advanced flight control and navigational abilities. \"Our main goal is to see how bees avoid collisions, which is the central aim of my PhD,\" Mr Mandiyam said. \"This understanding can be used in robotics, and also applies to aircraft, as well as ground vehicles. \"If the vehicle needs to negotiate a sharp turn, it has to do so in such a way that the centrifugal force is within certain manageable limits, otherwise it can shoot off in what's called a sideslip.\" \"We can apply our knowledge of how bees perform coordinated turns to these situations to avoid sideslips in aerial and ground vehicles.\" This article has been republished from materials provided by the University of Queensland. Note: material may have been edited for length and content. For further information, please contact the cited source. Reference: Mahadeeswara, M. Y., & Srinivasan, M. V. (2018). Coordinated Turning Behaviour of Loitering Honeybees. Scientific Reports, 8(1), 16942. https://doi.org/10.1038/s41598-018-35307-5 ",
            "date": "Answered October 22, 2020",
            "views": "136",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}