{
    "title": "What will the future look like? - Quora",
    "tags": [
        "The Future",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Lucas",
                "href": "/profile/Sean-Lucas-51"
            },
            "answer_text": "2020: Donald Trump re-elected President of the United States by the electoral college. Joe Biden wins the majority of the popular vote. Republicans hold the Senate majority. The House does not change much. Donald Trump dies of COVID-19 on December 10th. Mike Pence becomes President to finish out Trump’s first term. 2021: Pence serves the term to which Trump was elected. Pence nearly dies from COVID-19, rendered mute. Claims it was a sign from God. 2022: Republicans retake control of the House. Coronavirus vaccine found by a group of European labs. US Health and Human Services Secretary Sean Hannity refuses the vaccine at first, claiming American labs are nearly done with a better vaccine. US ultimately allows the vaccine. NASA defunded by President Pence. ESA, JAXA, and Roscosmos, among others, create the International Space Agency, or ISA, to replace it. United Nations moves its headquarters to Helsinki, Finland. The US Ambassador to the UN, Sarah Huckabee Sanders, claims that the US may leave the UN. 2023: After being removed from the UN Security Council, the US leaves the UN. 2024: Mike Pence elected to a full term as president by the electoral college. His opponent, Elizabeth Warren, won the popular vote. 2025: After President Pence threatens once too often to pull funding for the event, the International Olympic Committee moves the 2028 Summer Olympics from Los Angeles, California to Toronto, Canada. Pence states that the United States will not participate in the Olympics unless the IOC changes its mind. 2026: President Pence signs a bill into law allowing him to prevent the US Olympic Committee from participating in Olympic events without his permission. The US does not send any athletes to the Winter Olympics in Italy. ISA commits to a manned mission to Mars to be launched by 2030. EURONET, a 6G wireless data system covering the whole of Europe, is brought on-line. Similar systems will go up in much of South America, Africa, Asia, Australia, Canada, and Mexico by the end of the decade. The United States refuses to build such a system as it would cut into the profits of telecom companies. 2027: The Republican Party starts to be supplanted by the Neo-Republican Party as part of a rebranding, as the present party representation has very little in common with classic Republican principles. The US economy continues to sag as other nations that once relied on the US for assorted goods continue to find other sources. In essence, the world is learning to live without the United States. 2028: In a sign of surrender to the Neo-Republicans, the Republican Party chooses not to submit a candidate for the 2028 Presidential election. Ultra-conservative activist Kirk Cameron is elected President by the electoral college. His opponent, Elizabeth Warren, once again receives the majority of the popular vote. Professionals from other nations who once sought work in the United States are now remaining in their home countries or moving to other nations. Coupled with the shrinking professional class in the US, caused by college becoming available to fewer and fewer Americans due to cost, the United States is suffering from a more and more severe shortage of professionals in areas such as medicine, computer sciences, and engineering. US Secretary of Education Teresa McNeece claims that the so-called “Brain Drain” is “An invention of the radical left.” The US misses the 2028 Summer Olympics in Toronto. Some of America’s top athletes are immigrating to other nations so they can compete. President Cameron insists that the medals should still count for the United States. The IOC does not even acknowledge his demand. 2029: US Constitution gets amended for the first time in 37 years. The 28th Amendment allows Gerrymandering by the State Legislatures. This was in response to a number of states banning the practice through ballot propositions, as their state legislatures were Neo-Rep controlled due to the practice. This allows the state legislatures to alter the lines with impunity. 2030: US Constitution amended again. The 29th Amendment bans same-sex marriage, and requires that all matters in which gender comes into account, like which bathroom to use and what gender is listed on official documents, be based on the person’s birth gender. All same sex marriages are instantly nullified. The global uproar over the 29th Amendment does significant damage to the already weakened US economy. More US athletes immigrate to other nations to compete in the 2030 Winter Olympics in Sapporo, Japan. 2031: Japanese ISA astronaut Norishige Kanai becomes the first human being to set foot on Mars. None of Persephone 1’s crew is American. President Cameron complains about this. Terrorist attack at the Pride Day parade in New York City claims 853 lives with 3,289 wounded. The perpetrators were provided weapons by rogue elements of the US military. President Cameron refuses to call for a national day of mourning due to the sexuality of the victims. He is roundly condemned in the world press. 2032: Kirk Cameron is re-elected president by the electoral college. Despite legally questionable voter suppression tactics employed by Neo-Republicans, Democratic nominee Senator Gavin Newsom still wins the popular vote. American professionals are now moving to other countries to practice their trade due to the better environment there. The UN report on the “Third World” officially declares the United States of America to be a third world country. The Cameron Administration is outraged. 2033: After years of deepening divisions between liberals and conservatives, the states of California, Oregon, Washington, Nevada, Arizona, New Mexico, Colorado, New York, Massachusetts, New Hampshire, Maryland, Illinois, and Minnesota secede from the Union. Their appointed president, former California Senator Kamala Harris, claims that American liberals are no longer willing to see their freedoms taken away one by one. US President Cameron declares the people in those states to be traitors and threatens to kill them indiscriminately. The face-off quickly degenerates into armed conflict. The more technologically advanced Blue States of America, or BSA, holds on most fronts, but Massachusetts is taken by the US military. The world is shocked by images of war crimes being committed against the civilian population of that state. The USA is beginning to lose ground. Their computer systems are under constant cyber-attack, their already weak economies are not able to sustain the cost of the war, and threats of nuclear attack on the BSA are countered by the revelation that the BSA has taken control of enough of the USA nuclear arsenal to establish Mutually Assured Destruction. The BSA is not attempting to take territory, but rather inflict damage on the USA’s war-fighting capabilities. The war quickly scales back to a series of skirmishes. 2034: Canada officially recognizes the Blue States of America. President Cameron cuts off all diplomatic and economic relations with Canada, which only further damages the USA economy. The war continues with fairly little action. The USA cannot afford intense fighting, and the BSA does not want intense fighting. 2035: King Harold of England offers a solution and convinces both sides to accept the London Accords. The Blue States of America gets international recognition and consists of the states of California, Oregon, Washington, Nevada, Arizona, New Mexico, Minnesota, Wisconsin, Michigan, Illinois, Indiana, Ohio, Pennsylvania, New York, Vermont, New Hampshire, Rhode Island, Maine, and Beltline. Beltline is a strip of land running between Washington state and Minnesota. It completely separates the United States of America from Canada. Those in one nation’s territory who wish to live in the other nation are allowed, and sometimes forced, to move. The Second American Civil War ends. ",
            "date": "Updated June 4, 2020",
            "views": "499",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dimitry Kuzmin",
                    "user_href": "/profile/Dimitry-Kuzmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miguel Zapata",
                "href": "/profile/Miguel-Zapata-4"
            },
            "answer_text": "Non-futurist explanation, just an ordinary guy’s perspective: More poor people. Ever wonder why dystopian stuff is always in sci-fi? It’s because the trend is indeed true, and regardless of the predominant political-economic system in place (it’s currently capitalism), the more powerful will always own more resources than the less powerful combined.Because of 1, it means that each nation will have either a smaller metropolis, or a bigger metropolis that is less congested than it is today. Because of the bigger gap between the rich and poor, as well as the advances in technology, there are less opportunities for the poor in the metro, thus the inhabitants will almost be exclusively the richest and most powerful people.Trees will still be present. At some point, anti-environment or pro-industry people, whichever way you look at them, will concede the importance of sustainable resources. However, these resources may be now highly specialized and thus placed in specific locations, unlike the Districts in The Hunger Games. Because of this division, the cost of raw materials and end products will skyrocket and again, there will be more poor people.No flying cars. Seriously. People can’t parallel park or keep the driveway or the wheelchair access ramps clear. Drivers under the influence who can’t even drive in two dimensions. No flying cars.Some other country will lead space exploration. Because Americans have their capitalism to attend to and NASA missions are basically negative ROI to them and basically the Cold War is over.Population will be controlled. Depending on the trend, it will either be limited or people will be encouraged to make more babies.People will have a new social issue. Human racism may be eliminated in the future, especially if aliens are already involved, if ever (because aliens will be the new non-white how about that). However, some other kind of prejudice will be the focus of that society, which may be based on location/origin (say, Earth vs. Mars natives), power, or heck you know what, humans will never get over the prejudice of how people look like.Trust me, there will be philosophical issues on teleportation.We will still not cure the common cold.There may be a new religion based on philosophy or spirituality. Theistic religions may cease to exist, but perhaps some religions will still be based on superstition.There may be more water everywhere. Global warming. Because it’s true.I can’t even imagine what computers would be like. But given that we are already exploring quantum computing and have pioneered wireless communication and power, we may be able to harness the brain as a wireless modular computing component (imagine computers to be Apple Watches and your brain is the iPhone). Basically, Professor X kind of stuff with Johnny Mnemonic kind of stuff without a crappy gigabyte limit.",
            "date": "Answered June 2, 2016",
            "views": "3",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dimitry Kuzmin",
                    "user_href": "/profile/Dimitry-Kuzmin"
                },
                {
                    "user_id": "Lala Belle",
                    "user_href": "/profile/Lala-Belle-3"
                },
                {
                    "user_id": "Callissia Lim",
                    "user_href": "/profile/Callissia-Lim"
                },
                {
                    "user_id": "Elisa Liu",
                    "user_href": "/profile/Elisa-Liu-9"
                },
                {
                    "user_id": "Jeeva",
                    "user_href": "/profile/Jeeva-21"
                },
                {
                    "user_id": "Bharath Barty",
                    "user_href": "/profile/Bharath-Barty"
                },
                {
                    "user_id": "Faizan Javed",
                    "user_href": "/profile/Faizan-Javed-6"
                },
                {
                    "user_id": "Rezaka Ivanov",
                    "user_href": "/profile/Rezaka-Ivanov"
                },
                {
                    "user_id": "Brian Jackson",
                    "user_href": "/profile/Brian-Jackson-68"
                },
                {
                    "user_id": "Ben Grant",
                    "user_href": "/profile/Ben-Grant-17"
                },
                {
                    "user_id": "Aron van Willigen",
                    "user_href": "/profile/Aron-van-Willigen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kong Thao",
                "href": "/profile/Kong-Thao-11"
            },
            "answer_text": "Robot: You are a murderer! Person: I didn’t kill “it”. It’s a machine that mimics human behavior. Clunks of metal and oil. Robot: You killed My son! Person: This isn’t even you “feeling”, you were create to copy these emotions. Most of all, you’re clunks of metal, you can’t be a parent.  Kana: Hey… um… I saw you again at the FineDine again and… I thought you looked very cute…. Elliott: …. Kana: I wanted to ask if… You would be my girlfriend? Elliott: But…. Kana: [Oh no, maybe she doesn’t like me?] Elliott: I’m a boy…. Kana: [Shocked] But you look like…. Elliott: My friends say that I’m too feminine. Some days even boys ask me out without knowing…. Kana: …. Elliott: I’m… sorry to disappoint you. [Bows frantically] Some weeb: Wait…. Traps are straight? [Internet debates]  Liberal: I told you, you’re not making any sense! Conservative: What? Liberal: Why would you want to colonize other planets? Conservative: Our resources are depleting. Finding a suitable planet for human life isn’t a crazy choice. Liberal: So instead of fixing our planet, you want to find another one? Conservative: Yup. You don’t have to come if you don’t want to.  Man #1: Clones are ABOMINATIONS to GOD’S creations! Man #2: Clones have every right to breath and make choices. Their value should not be dictated by the past of their original templates. Man #1: Clones are NOT HUMAN BUT DEMONS. God hates clones! Unnatural monsters! Man #2: So you want a fetus to live, but not a human genetic copy? Man #1: Yup! Man #2: I am a man of three kids, I have an amazing wife, I joined the army to protect this country, and I’m a Christian. Man #1: Good to see a true American! Man #2: But I don’t have natural parents like everybody else. I am a clone. Man #1: … Man #2: My genetic template was a drug addict, overdosed on heroine. His cells were many harvested from many people to create the first viable clones. I know nothing of him, and frankly I don’t care. His past does not dictate my future. Man #1: [Throws rocks at him] You TRICKED me! May you burn in hell!  Interviewer: So why are these underground stand-up comedies popping up all of a sudden? Leiko: It has it’s roots from the rise of toxic PC culture. Dark humor is a way people can get past the trauma in a humorous way. But in the 22nd century, if you’re a white straight male, you’re never heard from again. Interviewer: And how do people find these “under-ups” to sit and watch? Leiko: There are a number of ways: the most common is through groupchats online where you meet people who will give you coordinates and a specific time to hang out and joke. Recently, many of these places have been busted and taken down by the police. It seems no one likes a good joke now these days….  Toby: [Sigh] Tim: What? Toby: I already told you, it’s not beastiality if she’s a FUCKING HUMANOID ALIEN! ",
            "date": "Answered November 6, 2019",
            "views": "13",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nathan Co",
                    "user_href": "/profile/Nathan-Co-4"
                },
                {
                    "user_id": "Morgan Ellison",
                    "user_href": "/profile/Morgan-Ellison-8"
                },
                {
                    "user_id": "Jonn Souto Arostegi",
                    "user_href": "/profile/Jonn-Souto-Arostegi"
                },
                {
                    "user_id": "Morgan Ellison",
                    "user_href": "/profile/Morgan-Ellison-7"
                },
                {
                    "user_id": "Lam Yau-king (林友敬)",
                    "user_href": "/profile/Lam-Yau-king-林友敬"
                },
                {
                    "user_id": "Kirby Cho",
                    "user_href": "/profile/Kirby-Cho-2"
                },
                {
                    "user_id": "Evan Poole",
                    "user_href": "/profile/Evan-Poole"
                },
                {
                    "user_id": "Thomas Johnson",
                    "user_href": "/profile/Thomas-Johnson-687"
                },
                {
                    "user_id": "Jeremiah Jung",
                    "user_href": "/profile/Jeremiah-Jung"
                },
                {
                    "user_id": "Shantanu Mantri",
                    "user_href": "/profile/Shantanu-Mantri-5"
                },
                {
                    "user_id": "Rocky Curiel",
                    "user_href": "/profile/Rocky-Curiel"
                },
                {
                    "user_id": "Alexander Tyrrell",
                    "user_href": "/profile/Alexander-Tyrrell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Dickerson",
                "href": "/profile/Joseph-Dickerson"
            },
            "answer_text": "Heh. I wrote a post at josephdickerson.com mid-2010 on exactly this topic. I think my thoughts then are still appropriate now (though I reserve the right to edit later if I'm proven wrong... I will admit it, however). Here's my answer (from http://www.josephdickerson.com/2010/07/18/ux-predicted-what-will-the-future-bring/) and let's see how I do as a \"futurist\": In my role as a User Experience Architect I have design for and support what users do today, and understand their mental models of how things work. That is challenging enough, and if that was all my job was I’d be pretty darn busy. Of course, it’s not. I also have to plan for the future, to look forward… to think about what technological and social changes will do to change future mental models and usage patterns. I have to “future proof” my designs. So, as part of my process I have identified some key factors that I have to keep in mind, “influencers” that will change things (and in some cases very, very quickly). My soothsaying skills are slightly above average, so here’s my list of things that will CHANGE EVERYTHING! Ubiquitous Internet Access This is already happening, though it has not gotten through to “Joe Six-Pack” – the idea that you can be connected to the ‘Net wherever you are, all the time. This is already changing behaviors and the idea that we can keep important information (work files, content, etc.) “in the cloud” is becoming much more comfortable to people. We may yet have that “Internet Computer” yet – with local copies on the device, in case the access drops. And, speaking of local copies… Cheap, cheap storage The idea that mobile devices can hold 64 GB of data is astonishing to an old foggie like me. I remember when I was impressed at the Iomega Zip Drive (“It can hold a 100 megs! And it’s only a little thicker than a floppy disk!”). We need to start thinking of smart applications that can fill that storage for the user … I have some ideas in this space, but I’d rather not share them publically ifyaknowwhatimean… Appliances, not computers Devices like the iPad is a “computer” but when people talk about it it’s not about how many “GBs” it has or the amount of RAM it contains… they talk about what it allows them to do – how many books, how much music, how many games it can hold, etc. The technology is getting out of the way, and that’s a great thing for people in our profession. And speaking of the iPad… Touch computing It’s here, folks, and it isn’t going away. We need to design for these interaction patterns even if we are not designing a UI for a touch-enabled device (because people are going to bring that learnt behavior to your – and every other – design). The iPhone and the Ipad has changed the way people interact with technology, and not in a blue-sky “Minority Report” way, but in a tangible shift in interaction models. With predictions that 25 million iPads will be sold by the end of the year, we need to be ready to support a lot of users who touch AND click… Increased (and reduced) user freedom Users will, at the same time, have more freedom around the services they can use to support their lifestyle and at the same time they will be “locked in” to services because they are not alternatives that they can easily migrate to. Facebook is pretty “sticky” for users, because all their friends are there… and Facebook knows it too. When a user’s social circle is all on Facebook, it’s awfully hard to change services. Look for this to become more and more of an issue in the future. And, speaking of Facebook… Addicting Experiences I’ve written about this before, and I’ll repeat myself somewhat here: There is a large number of companies making a lot of money by providing addictive experiences to users (they made money from me, too – my son bought $40 of seeds in Zombie Farm without thinking about it… or asking his dad). Right or wrong, we need to pay attention to how these companies are influencing user behavior to potentially “leverage” some best practices in our own designs. Opportunities Galore With technology becoming more and more part of everyone’s life, the opportunities for user experience designers to influence and improve user’s lives are increasing. It’s a great field to be in and I can’t wait to see what the future holds. ",
            "date": "Answered March 4, 2011",
            "views": "25",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "RILEY BYROM",
                    "user_href": "/profile/RILEY-BYROM"
                },
                {
                    "user_id": "Jordan Heishman",
                    "user_href": "/profile/Jordan-Heishman-1"
                },
                {
                    "user_id": "Paul Ellis",
                    "user_href": "/profile/Paul-Ellis-51"
                },
                {
                    "user_id": "Mohamed Zaki",
                    "user_href": "/profile/Mohamed-Zaki-47"
                },
                {
                    "user_id": "Jeeva",
                    "user_href": "/profile/Jeeva-21"
                },
                {
                    "user_id": "Selim Savsar",
                    "user_href": "/profile/Selim-Savsar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Schneider",
                "href": "/profile/Mark-Schneider-7"
            },
            "answer_text": "Densifying housing and infrastructure Regarding science fiction, future cities are already concentrating on densifying housing and infrastructure because no one wants to live out in the country and commute. Cities need to have a long-term strategic perspective on these things, since everything they do has long term effects. Planning for ecological systems with increased local food production Every future planning is done considering environmental impact and how to create cities and systems that are environmentally sustainable. Smart windows , energy management systems, clean tech etc you name it. It’s obvious. Now it does not cost that much to include these environmental goals for the future. Green areas will increase and every skyscraper/building will have a garden for local growth of vegetables. Sourcing for local production of food will have to increase in general. Recycling systems Recycling will improve were we will find new ways for renewable materials. Clean energy is the key Electricity and renewable energy production is a big part, but also to find viable alternatives and engines for a clean energy source. There is more that can be done. Increased polarization of labor New jobs that we have not thought of yet will arise. Its likely that the market will divide itself in a high skill job market and a low skill job market. Everything in between will have been taking care of by using technology automating tasks. Having a digital economy, the place were you will do your job will not matter so much. Some areas will be in trouble We will have certain areas that will be in trouble from an environmental perspective, simply because the political process to change on a global scale is not the same as the earth’s clock that keeps ticking. Technological development in clean and renewable tech is crucial. ",
            "date": "Answered June 2, 2016",
            "views": "23",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yetunde Makinde",
                    "user_href": "/profile/Yetunde-Makinde-1"
                },
                {
                    "user_id": "Jeeva",
                    "user_href": "/profile/Jeeva-21"
                },
                {
                    "user_id": "John Panos",
                    "user_href": "/profile/John-Panos-3"
                },
                {
                    "user_id": "Abatcha Umar",
                    "user_href": "/profile/Abatcha-Umar"
                },
                {
                    "user_id": "Rezaka Ivanov",
                    "user_href": "/profile/Rezaka-Ivanov"
                },
                {
                    "user_id": "Jordan Mizrachi",
                    "user_href": "/profile/Jordan-Mizrachi"
                },
                {
                    "user_id": "Faizaan Datoo",
                    "user_href": "/profile/Faizaan-Datoo"
                },
                {
                    "user_id": "Ben Grant",
                    "user_href": "/profile/Ben-Grant-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anantya Sharma",
                "href": "/profile/Anantya-Sharma-2"
            },
            "answer_text": "These are my opinions are subjected to future risks- First of all, obviously in the future the human population will rise to 10 billion and earth can support only 10–13 billion max. So all people can't get the appropriate resources and then we will observe a sharp decrease in the population. Obviously nature follows Maxwell distribution curve. Then comes technology. Due to IOT(Internet of Things) and artificial intelligence, people will lose their jobs. Jobs which are repetitive in nature will be done by robots. So basically we are looking at a drastic decrease in people in banks, post offices, transportation sectors etc. People who are in managerial posts will survive. People who are constantly in the process of learning and are creative will be at the peak. Then comes the way of life. People will be more lazier than ever as most of their works are done by robots. They will be going outside only for entertainment. Products will be delivered by drones. The only thing people must do by themselves is eat, excrete and sleep. I seriously believe that the future billionaires are tech giants owners and farmers. Farmers will have to provide food for all these guys and if they start to use technology in their delivery of foods (drones) and robots for farming, then only initial investment is required and I am sure they will get huge returns. I also do think that people will change socially. I can imagine a time where there is a room full of people and they would communicate with themselves through messages. I know this is a sad fact but WhatsApp and other messengers will be huge. For all the space fanatics, there is going to be space tours and trips and there might be a discovery of another earth like planet. I hope that time travel would be possible. Well that's it guys. Let's explore the future that awaits us. I hope it's the best time of our lives. ",
            "date": "Answered July 12, 2018",
            "views": "22",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sai Theja",
                    "user_href": "/profile/Sai-Theja-4"
                },
                {
                    "user_id": "Sahil Ray",
                    "user_href": "/profile/Sahil-Ray-25"
                },
                {
                    "user_id": "Roberto Guzman",
                    "user_href": "/profile/Roberto-Guzman-58"
                },
                {
                    "user_id": "Nisha",
                    "user_href": "/profile/Nisha-182"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Chatzigiannis",
                "href": "/profile/Simon-Chatzigiannis"
            },
            "answer_text": "The future will be full of superhuman abilities that we have sofar only been dreaming of! For years we have been underestimating the human abilities. We have watched sci-fi films for too long, and psychic films for too little. When it came to films with psychics, people easily dismissed them because “they could not see proof on themselves”. But somehow, people believed that an electronic device, someone else, would be able to do the things shown in films. And a few years later, people went and made such devices! It all happened because we built it. Is that a demonstration of human disbelief in themselves? Yes. Humans are, as it seems, very unaware creatures, and unconfident in their abilities. One of the biggest problems of humans is that they do not believe in themselves. They believed that someone else can do big things, therefore they went and built that someone else. But when it came to themselves, they dismissed that they have so many abilities, and felt incapable of believing they can improve themselves significantly more than they expect. So today we have airplanes, spaceships, missiles, mobile phones, wireless internet, and many other things that happened because humans thought they are possible first, and then went on to build them. However, we do not have psychic abilities. It may also be possible that all this happened because what really has to happen first is we build the tools to improve ourselves. Developing psychic abilities is possible, but after we have the technologies and means to be able to do it. But today, we are starting to get closer to the time that we do have the tools. And we need to start believing that we can obtain psychic abilities, as well as many others that we have long been dreaming of. Psychic abilities So here are the abilities we have been discussing, as long as we have been imagining planes, rockets, and all other devices we have already built today[1] .  How are such abilities possible? All these abilities are based on an advanced ability to both send and receive signals. We know how signals transmission works – it requires a transmitter and a receptor. The transmitter sends a type of signal that the receptor receives and decodes. And that signal can be in the form of a wave or electricity. Faster advancement via psychosis Psychiatry has a lot of things wrong. The notions of “psychotic” and “neurotic” is incorrect. Those terms alone are not sufficient to describe an illness. The problem is somewhere else. There is a secret in psychosis that we just haven’t exploited yet. When a human loses their own controls to keep their homeostasis together, but are still alive, they start to change. Their body looks for new ways to use the organs and new ways to adjust. Psychosis is like human evolution happening in a short space of time. And exploiting it could significantly contribute to the faster development of human super-abilities. Why do we not already have psychic abilities and other super-powers? What is missing? Humans today are limited mostly to receiving, and even those abilities are also very limited. Humans have at least 21 senses. The senses are recipients of signals, but few transmitters. The only transmitter is the voice, and partially movement. Receptive organs: 21 sensesTransmissive organs: 2 (Voice, Movement)Which brings the question… Why are humans not “God-like” enough? The answer is: We do not have enough transmissive powers. Our God-like abilities are ultimately our transmissive abilities. Currently, we are “puppets” that respond to stimuli. The reason we do not have enough control of the universe is that we cannot transmit signals. We are only passive receptors, there to receive signals and try to decode them and act upon them, but we cannot send any back. If we could also transmit more signals, we would be more God-like. So what are we missing to obtain superpowers? In order to be able to send & receive signals, be able to develop the “psychic abilities”, and ultimately be more “God-like” we need: Higher sensitivity of senses: To receive signals.More transmissive organs:Improved vocal abilities: Sending audio waves in a wider range of more frequencies.The ability to transmit waves in other forms. Perhaps this may be done internally by the brain. It could also happen with other organs.Higher intelligence: to be able to spot more patterns, and to create new languages faster, such that allow encoding and decoding the messages sent, and therefore enable communication.Vocal abilities today The human voice is one of the most versatile and amazing instruments. It is able to produce highly intricate arrays of sounds and pitches. It’s tone can also be modulated to suggest emotions such as anger, surprise, or happiness. And of course it can be used to sing. On the highest range of the spectrum, we have Li Wenxing. Wenxing, a music teacher in China named Li Wenxing was able to sing across 6 octaves.  The Guinness record for the widest vocal range is held by ultra-low bass singer Tim Storms, who also holds the record for the lowest note in the world produced by the voice: a brown-note-busting 8 Hz! 8Hz is actually lower that we can hear, but it can be detected by some audio equipment.  A man named Charles Kellogg who claimed to have a vocal range of an incredible 12.5 octaves could accurately imitate birdcalls. The birdcalls went up past the range of hearing (on the high end). Unfortunately, his claim of 12.5 octaves could never be accurately verified. Here is a recording from 1917 of him imitating birdcalls with his voice:  How are human abilities possible to develop further? We are at a beginning of a new age. Neurotech is just emerging. But DARPA has already shown that it has already developed. Using high-definition transcranial alternating current stimulation (HD-tACS), DARPA has already increased learning ability by as much as 40%. Stimulating various nerves in the brain has had tremendous results. Stimulating certain peripheral nerves—those that relay signals between the brain, the spinal cord and the rest of the body—can enhance a person’s ability to learn, by triggering the release of neurochemicals that reorganize connections in the brain. Moreover: vagal nerve stimulation: impacts perception, executive function, decision-making, and spatial navigation in rodents.trigeminal nerve stimulation: impacts visual, sensory and motor functions, that can produce improvements in intelligence, surveillance, reconnaissance, marksmanship and decision-making.But this is only the beginning. A new world f human possibilities is beginning… Are you excited? Also read: Elon Musk keeps saying that AI will destroy us and it should be regulated now. How exactly would AI destroy us?Who would win in a battle between a neuron and a transistor?Who is cooler: Terminator (all machine), Robocop (half man-half-machine) or Nemesis (mutated human)?Footnotes[1] List of psychic abilities - Wikipedia",
            "date": "Updated June 8, 2018",
            "views": "17",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tejas",
                    "user_href": "/profile/Tejas-343"
                },
                {
                    "user_id": "S B",
                    "user_href": "/profile/S-B-611"
                },
                {
                    "user_id": "Pred",
                    "user_href": "/profile/Pred-7"
                },
                {
                    "user_id": "Alan Valerans",
                    "user_href": "/profile/Alan-Valerans"
                },
                {
                    "user_id": "Lawrence Bloom",
                    "user_href": "/profile/Lawrence-Bloom-2"
                },
                {
                    "user_id": "Andrew Dutcher",
                    "user_href": "/profile/Andrew-Dutcher-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amogh Bandodkar",
                "href": "/profile/Amogh-Bandodkar"
            },
            "answer_text": "Something POSITIVE!!! For sure Self driving cars , taxis etc.Manual labour work would be automated thanks to the technology.Free Internet for those who cannot afford.If people are aware enough there will be less problems regarding population (if population control measures are implemented ).Less population in future means enough resources for everyone in this world to survive which leads to less crime, longer lives , healthy lives , less greed and corruption as there will be less competitionNewer technologies will be introduced creating larger market for people to work.More jobs would be available in future.100% literacy rate will be achieved.People will follow a healthy and a financially stable lifestyles.Obviously Flying cars, Artificial intelligence, Machine Learning would take over and would be implemented positively to do manual labour work so people wouldn't have to do it.People would be much more happyas they learn to make smart choice by learning from past mistake.Less Crime , less financial frauds, less frauds.Improved healthcare like Cancer treating drugs , less pain , innovation regarding to immortality etc.Artifiially Intelligent robotsplaying huge role in our lives . Imagine a robot approving your driving licence.Less Road accidents and road rages due to availability of self driving cars.More job/work satisfaction as people would work in their fields of passion.People would work to bring change in the world rather than paying debts due to enough resources.Less failure of products or ideas and high quality products would be available even at low prices as people would be driven by passion as they would not have to care about money.Flying cars , electric cars , helicopter taxis , vacations on different planets whatever you imagine wherever you want to go it would be possible.Regeneration of body parts , replacing of body parts.Free healthcare and education for everyone.",
            "date": "Answered December 25, 2018",
            "views": "659",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noel Bastola",
                    "user_href": "/profile/Noel-Bastola"
                },
                {
                    "user_id": "Sai Theja",
                    "user_href": "/profile/Sai-Theja-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maruti Mishra",
                "href": "/profile/Maruti-Mishra-9"
            },
            "answer_text": "Short answer: Well it ends in abyss and darkness where nothing exists just some photons that will also go away. Long answer:  credit: melodysheep 2019/2020- Present times 2800- Earth has rapidly changed and human trying to keep up with consistent geographic and climate changes. Coastal cities (A.K.A economic powerhouses) will fall affecting the world. 2900- Earth’s magnetic field flips. 2950 - Comet Hale-Bopp returns for a trip. 5000- Sea levels rise up even more drastically. 10000- 30 meter wide asteroid hits earth 18000- Sahara desert is now tropical. 21000- Constellations are wandering and we can start seeing the Andromeda galaxy. 40000- Voyager 1 closely passes a star 72000- inter glacial period ends 100000- Super volcano eruption 300000- New hawaii appears 650000- new island chains are made 1 million - Apollo footprints fade 3.5 million - Stone monuments erode 9 million - deadly gamma ray burst 20 million - mars’ moon becomes a ring 30 million - Saturn’s rings vanish 50 million - Antarctica melts 75 million years - major asteroid impact 200 million - new super continent 500 million - sun increases luminosity 750 million - Photosynthesis stops 800 million - all plant life dies 1 billion - Oceans evaporate 3 billion - all life dies on earth 3.5 billion - Sun expands 6 billion - Sun becomes a red giant 10 billion - Earth destroyed by dying sun and our sun is now a white dwarf star 1 trillion years - Stars begin to die off temperature of the universe drops because of this. 50 trillion - last red dwarf dies 200 trillion - Death of the last sun Degenerate era Dead stars, black holes, white dwarfs will only be illuminating as a moon. Life : possible 1 billion trillion years - Brown dwarfs collide and form new stars. 20 billion trillion years - Neutron star collision 100 billion trillion years - Surviving life forms can live off of aging white dwarfs. 1 trillion trillion years - Stars become black dwarfs (White dwarves so cold they don’t emit light as much) 20,000 trillion trillion years - Black holes swallow stray matter 1 billion trillion years - Life is back and intelligent life is possible also in this time frame. 100 billion trillion years - Space is expanding so fast we don’t see the light of other stars or anything. 1 trillion trillion trillion - it is theorized protons even decay now thus destroying all remaining matter in the universe. 500 Trillion^3 - all protons would be gone by now if they started to decay. 1 thousand trillion^3 - Black dwarfs are the last remnants of matter to ever exist and its carried off into the void as radiation. Black hole era With the black dwarfs gone there won’t be a single atom of matter left. 300 Thousand Trillion^3 - Only light particles and black holes exist anymore 400 million trillion^3 - Life exists momentarily in this brief window of time sinc the universe is literally doing nothing at all. 1 Trillion^4 - A galaxy will consist of supper massive black holes with smaller black holes orbiting it. 500 Trillion^4 - Black hole mergers are the most important events in the universe. (Some grow to trillions of times the mass of our sun). When they merge the send out powerful gravitational waves that resonate in the universe. These sounds will dominate the universe like a song. You will be hearing the reasoning and stretching of space. Hawking radiation Space will be full of particles materializing and splitting apart and annihilating each other of virtual particles and anti particles. 100 Trillion^5 - Black holes begin to evaporate 10 million Trillion^5 - Quantum mechanics has allowed particles and radiation to escape from black holes. 200 million Trillion^5 - The universe will be a fireworks show of black holes exploding. 150 billion trillion^5 - Dark energy inflates the universe Frontier for knowledge Dark energy is fascinating. At this point in time physicists scientists etc love to theorize on other universes and the nature of dark energy. Like the creation of simulated virtual universes or perhaps with enough energy one just like our own. Physicists have also theorized in a atom smasher by constricting tremendous amounts of energy it can open up gateways to baby universes. So there is a possibility that intelligent life like us can escape entropy of the cosmos. Entropy 1 billion trillion^7 - The last black hole explodes and dies giving light to the universe one more time. The Abyss 1 Trillion^8 - Only photons cool down to near zero temperatures as the universal expansion occurs but even they decay. There is nothing now at this point. Time is now meaningless and for the first time ever the universe is permanent and non changing. Forever. Credit: Melody sheep for the amazing video with the best visuals to accompany this. Anybody who manages to watch the 30 minute masterpiece please comment your opinions. ",
            "date": "Answered April 6, 2019",
            "views": "37",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brad Bleich",
                    "user_href": "/profile/Brad-Bleich-1"
                },
                {
                    "user_id": "Shut Up Idiot",
                    "user_href": "/profile/Shut-Up-Idiot"
                },
                {
                    "user_id": "Sean Lucas",
                    "user_href": "/profile/Sean-Lucas-51"
                },
                {
                    "user_id": "Sai Theja",
                    "user_href": "/profile/Sai-Theja-4"
                },
                {
                    "user_id": "Sahil Ray",
                    "user_href": "/profile/Sahil-Ray-25"
                },
                {
                    "user_id": "Eliza Brown",
                    "user_href": "/profile/Eliza-Brown-53"
                },
                {
                    "user_id": "Nishain De Silva",
                    "user_href": "/profile/Nishain-De-Silva"
                },
                {
                    "user_id": "Naveen Sha",
                    "user_href": "/profile/Naveen-Sha-1"
                },
                {
                    "user_id": "Callissia Lim",
                    "user_href": "/profile/Callissia-Lim"
                },
                {
                    "user_id": "Pio Nicodemus",
                    "user_href": "/profile/Pio-Nicodemus"
                },
                {
                    "user_id": "Shayla",
                    "user_href": "/profile/Shayla-72"
                },
                {
                    "user_id": "Kanchan",
                    "user_href": "/profile/Kanchan-178"
                },
                {
                    "user_id": "Jolin Kwok",
                    "user_href": "/profile/Jolin-Kwok"
                },
                {
                    "user_id": "Thomas Yom",
                    "user_href": "/profile/Thomas-Yom"
                },
                {
                    "user_id": "Nathan Yang (楊立慶)",
                    "user_href": "/profile/Nathan-Yang-楊立慶"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sneha Singh",
                "href": "/profile/स्नेहा-सिंह-Sneha-Singh-1"
            },
            "answer_text": "I can give you an idea for the future. Here are some changes we face in our future. Let's have a look. Meat without needing the cleaver. In simple words, we have lab grown meat.How- Take animal stem cells and feed them nutrients until they grow into pieces of tissues large enough to eat. Also know as ‘cultured’ or ‘clean’ meat. Save slaughter of animals.  No one at the wheel to prevent 90% of road accidents? In simple words, we have driverless cars.How- Cars that use machine-learning to become more adept at driving themselves with each ride. These will never play or talk or talk or text on their phones while driving. :p  Digging for precious metals in the sky. We mine on asteroids.How- Identifying most ‘valuable' asteroids is itself a challenge. Accessing small rocky bodies orbiting tens of millions of kilometers from Earth, landing robotics miners on them and transporting back the ore is both challenging and expensive.  Clean energy and fuels from seawater. In simple words, energy from nuclear fusion.How- Fusion reaction are safe and produce virtually no radioactive waste. Their main waste product, helium, is non-toxic. Uranium fission- that drives today's nuclear power plants- produces radioactive waste and carries a risk of nuclear meltdown.  Banking for everybody, without banks.How- Anyone with internet connection and a mobile phone can send, save and borrow money peer-to-peer. Low-income people could open small businesses and send money easily and cheaply. This saves a lot of time.  Information source- My life experience of 16 years, google and newspapers. Image source- Google. Thanks for reading. -Sneha. ",
            "date": "Updated June 23, 2018",
            "views": "41",
            "upvotes": " View 38 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sahil Ray",
                    "user_href": "/profile/Sahil-Ray-25"
                },
                {
                    "user_id": "Eliza Brown",
                    "user_href": "/profile/Eliza-Brown-53"
                },
                {
                    "user_id": "Jade Taylor",
                    "user_href": "/profile/Jade-Taylor-304"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/आदित्या-Aditya"
                },
                {
                    "user_id": "Jitendra Nihaliya",
                    "user_href": "/profile/Jitendra-Nihaliya-1"
                },
                {
                    "user_id": "Sheikh Mubashir",
                    "user_href": "/profile/Sheikh-Mubashir-5"
                },
                {
                    "user_id": "Omer Shraiber",
                    "user_href": "/profile/Omer-Shraiber"
                },
                {
                    "user_id": "Rohan Rajput",
                    "user_href": "/profile/Rohan-Rajput-182"
                },
                {
                    "user_id": "Nishchay Singh",
                    "user_href": "/profile/Nishchay-Singh-38"
                },
                {
                    "user_id": "Kanchan",
                    "user_href": "/profile/Kanchan-178"
                },
                {
                    "user_id": "Shreeya Shastri",
                    "user_href": "/profile/Shreeya-Shastri-1"
                },
                {
                    "user_id": "Tim Fanning",
                    "user_href": "/profile/Tim-Fanning-8"
                },
                {
                    "user_id": "Sandhya Lochav",
                    "user_href": "/profile/Sandhya-Lochav"
                },
                {
                    "user_id": "Swastik Pradhan",
                    "user_href": "/profile/स्वस्तिक-प्रधान-Swastik-Pradhan"
                },
                {
                    "user_id": "Dakota Correll",
                    "user_href": "/profile/Dakota-Correll"
                },
                {
                    "user_id": "Lokesh Choudhary",
                    "user_href": "/profile/Lokesh-Choudhary-256"
                },
                {
                    "user_id": "Herumb Shandilya",
                    "user_href": "/profile/Herumb-Shandilya"
                },
                {
                    "user_id": "Satyam Ghimire",
                    "user_href": "/profile/Satyam-Ghimire-1"
                },
                {
                    "user_id": "Jay Dutt",
                    "user_href": "/profile/Jay-Dutt-2"
                },
                {
                    "user_id": "Ramya Annadurai",
                    "user_href": "/profile/Ramya-Annadurai-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Dandavate",
                "href": "/profile/Yash-Dandavate-1"
            },
            "answer_text": "Your currently most abstract imagination about future, just might get true! I wish future brings our entire humanity to a greater good and prosperity. I was just going through a instagram page today and saw some amazing artwork depicting the future. Then I realised some of these things are actually something's I had thought of earlier so I will be using them to give you a visual image of my thoughts. ( please do read the caption and content on every picture it's really funny stuff) This is my take on how future will be like Elon Musk still thinks AI is threat to humanity Skies will no longer have chirping birds but will have buzzing drones all over Robots living like we do and getting Aadhar cards as well Moon and Mars will be hottest honeymoon and tourist spots Kids becoming as smart as computer due to brain implants Craze of start ups gone to another level Why go out and experience the world when you can do it at home on your AR/VR devices Lab grown food is the means of living ( unlucky people cannot taste chicken tandoori no more damn) Kids getting influenced by investors and traders like hell These are a few predictions which I think really might come true in coming 100 years. These are portrayed as wild imagination but you never know till what extent can mankind advance itself. [1] I hope you like my answer and plsase give your feedback in comments section Regards, Yash Dandavate Footnotes[1] Futurism Cartoons (@futurismcartoons) • Instagram photos and videos",
            "date": "Answered March 23, 2018",
            "views": "116",
            "upvotes": " View 69 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sai Theja",
                    "user_href": "/profile/Sai-Theja-4"
                },
                {
                    "user_id": "Lala Belle",
                    "user_href": "/profile/Lala-Belle-3"
                },
                {
                    "user_id": "Viv",
                    "user_href": "/profile/Viv-Dave"
                },
                {
                    "user_id": "Sujan Budhathoki",
                    "user_href": "/profile/Sujan-Budhathoki-12"
                },
                {
                    "user_id": "Zakku Rakuishi",
                    "user_href": "/profile/Zakku-Rakuishi"
                },
                {
                    "user_id": "Kalpesh Joshi",
                    "user_href": "/profile/Kalpesh-Joshi-8"
                },
                {
                    "user_id": "Vamshi Krishna",
                    "user_href": "/profile/Vamshi-Krishna-2467"
                },
                {
                    "user_id": "S. Sriram",
                    "user_href": "/profile/S-Sriram-19"
                },
                {
                    "user_id": "Maryam Mushtaq",
                    "user_href": "/profile/Maryam-Mushtaq-20"
                },
                {
                    "user_id": "Kanchan",
                    "user_href": "/profile/Kanchan-178"
                },
                {
                    "user_id": "Nicholaus Mwansile",
                    "user_href": "/profile/Nicholaus-Mwansile"
                },
                {
                    "user_id": "Madhukar P",
                    "user_href": "/profile/Madhukar-P-6"
                },
                {
                    "user_id": "Shruthi Somadatha Srinath",
                    "user_href": "/profile/Shruthi-Somadatha-Srinath"
                },
                {
                    "user_id": "RILEY BYROM",
                    "user_href": "/profile/RILEY-BYROM"
                },
                {
                    "user_id": "Amey Kulkarni",
                    "user_href": "/profile/Amey-Kulkarni-112"
                },
                {
                    "user_id": "Shailesh Kumar",
                    "user_href": "/profile/Shailesh-Kumar-1304"
                },
                {
                    "user_id": "Thelma Gomes",
                    "user_href": "/profile/Thelma-Gomes"
                },
                {
                    "user_id": "Ayyappa Jagadeesh",
                    "user_href": "/profile/Ayyappa-Jagadeesh"
                },
                {
                    "user_id": "Chandra S",
                    "user_href": "/profile/Chandra-S-48"
                },
                {
                    "user_id": "Shruti Manmode",
                    "user_href": "/profile/Shruti-Manmode"
                },
                {
                    "user_id": "Arpit Shah",
                    "user_href": "/profile/Arpit-Shah-118"
                },
                {
                    "user_id": "Jaswanth S",
                    "user_href": "/profile/Jaswanth-S"
                },
                {
                    "user_id": "Parthiv Purkayastha",
                    "user_href": "/profile/Parthiv-Purkayastha"
                },
                {
                    "user_id": "Aparna Pandey",
                    "user_href": "/profile/Aparna-Pandey-15"
                },
                {
                    "user_id": "Prashant Gour",
                    "user_href": "/profile/Prashant-Gour-1"
                },
                {
                    "user_id": "Bhavesh Agrawal",
                    "user_href": "/profile/Bhavesh-Agrawal-28"
                },
                {
                    "user_id": "Gaurav Bhagwanani",
                    "user_href": "/profile/Gaurav-Bhagwanani"
                },
                {
                    "user_id": "Krish Natrajan",
                    "user_href": "/profile/Krish-Natrajan"
                },
                {
                    "user_id": "Meghana",
                    "user_href": "/profile/Meghana-248"
                },
                {
                    "user_id": "Vivek Patel",
                    "user_href": "/profile/Vivek-Patel-234"
                },
                {
                    "user_id": "Garima Sharma",
                    "user_href": "/profile/Garima-Sharma-624"
                },
                {
                    "user_id": "PRADNYA DANDAVATE",
                    "user_href": "/profile/PRADNYA-DANDAVATE"
                },
                {
                    "user_id": "Ishika Bhosale",
                    "user_href": "/profile/Ishika-Bhosale"
                },
                {
                    "user_id": "Nishanth Raja",
                    "user_href": "/profile/Nishanth-Raja-1"
                },
                {
                    "user_id": "Abhishek Kumar",
                    "user_href": "/profile/Abhishek-Kumar-6908"
                },
                {
                    "user_id": "Prashant Shinde",
                    "user_href": "/profile/Prashant-Shinde-46"
                },
                {
                    "user_id": "Amit Mohapatra",
                    "user_href": "/profile/Amit-Mohapatra-30"
                },
                {
                    "user_id": "Mira Menon",
                    "user_href": "/profile/Mira-Menon"
                },
                {
                    "user_id": "Kushagra Jain",
                    "user_href": "/profile/Kushagra-Jain-12"
                },
                {
                    "user_id": "Pradeep Kumar Mittapalli",
                    "user_href": "/profile/Pradeep-Kumar-Mittapalli"
                },
                {
                    "user_id": "Pavan Bejgamwar",
                    "user_href": "/profile/Pavan-Bejgamwar"
                },
                {
                    "user_id": "Megh Nanavati",
                    "user_href": "/profile/Megh-Nanavati"
                },
                {
                    "user_id": "Anjali Singh",
                    "user_href": "/profile/Anjali-Singh-741"
                },
                {
                    "user_id": "Tanuja Thakur",
                    "user_href": "/profile/Tanuja-Thakur-19"
                },
                {
                    "user_id": "Ranjoti Singh",
                    "user_href": "/profile/Ranjoti-Singh"
                },
                {
                    "user_id": "Anshika Tomar",
                    "user_href": "/profile/Anshika-Tomar-1"
                },
                {
                    "user_id": "Winterbreeze050",
                    "user_href": "/profile/Winterbreeze050"
                },
                {
                    "user_id": "Dhairya Thanawala",
                    "user_href": "/profile/Dhairya-Thanawala"
                },
                {
                    "user_id": "Arjun Singh",
                    "user_href": "/profile/Arjun-Singh-253"
                },
                {
                    "user_id": "Vishal Achari",
                    "user_href": "/profile/Vishal-Achari"
                },
                {
                    "user_id": "Dhanshri Daigavhane",
                    "user_href": "/profile/Dhanshri-Daigavhane"
                },
                {
                    "user_id": "Nitesh Yadav",
                    "user_href": "/profile/Nitesh-Yadav-112"
                },
                {
                    "user_id": "Mridula Athreya",
                    "user_href": "/profile/Mridula-Athreya"
                },
                {
                    "user_id": "Vaibhav Pradhan",
                    "user_href": "/profile/Vaibhav-Pradhan"
                },
                {
                    "user_id": "Koustum Kamal",
                    "user_href": "/profile/Koustum-Kamal"
                },
                {
                    "user_id": "V. Pravin Kumar",
                    "user_href": "/profile/V-Pravin-Kumar"
                },
                {
                    "user_id": "Thakur Rahul",
                    "user_href": "/profile/Thakur-Rahul-16"
                },
                {
                    "user_id": "Pritesh Pawar",
                    "user_href": "/profile/Pritesh-Pawar-6"
                },
                {
                    "user_id": "Barath Avinash",
                    "user_href": "/profile/Barath-Avinash"
                },
                {
                    "user_id": "Soumyajeet Mukherjee",
                    "user_href": "/profile/Soumyajeet-Mukherjee"
                },
                {
                    "user_id": "Jeet Sharma",
                    "user_href": "/profile/Jeet-Sharma-36"
                },
                {
                    "user_id": "Megh Patel",
                    "user_href": "/profile/Megh-Patel-7"
                },
                {
                    "user_id": "Gopal Mandloi",
                    "user_href": "/profile/Gopal-Mandloi"
                },
                {
                    "user_id": "Netra Thanawala",
                    "user_href": "/profile/Netra-Thanawala"
                },
                {
                    "user_id": "Manish Sharma",
                    "user_href": "/profile/Manish-Sharma-1296"
                },
                {
                    "user_id": "Jayshree Mundhra",
                    "user_href": "/profile/Jayshree-Mundhra"
                },
                {
                    "user_id": "Sachin Gupta",
                    "user_href": "/profile/Sachin-Gupta-1059"
                },
                {
                    "user_id": "Karan Singh Ghatani",
                    "user_href": "/profile/Karan-Singh-Ghatani"
                },
                {
                    "user_id": "Sandeep",
                    "user_href": "/profile/Sandeep-697"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "The future is going to be a dark and rather bleak time, in my opinion. Mankind is not working to seriously tackle the problems of overpopulation, scarcity of resources or even global warming/climate change. Given that those three problems need to have solutions developed now and could potentially lead to human extinction, either separately or combined, this lack of serious effort is mind boggling. It's also very likely that nature is working on one or more types of biologically-based population controls that we will only find out about when they become a problem for us. When or if the human population hits a certain point, there are very good reasons to believe that a pandemic illness or even mass sterility will come to the fore to act as brakes on further growth. Finally, the rather bizarre push for artificial intelligence will probably create one or more intelligences that mankind will almost certainly not be able to control. Since these intelligences would be unburdened by emotion and any thoughts of loyalty it's conceivable that they could see that a solution to their problems would be the extinction of mankind and act accordingly. ",
            "date": "Answered June 9, 2011",
            "views": "43",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Norman Fischer",
                    "user_href": "/profile/Norman-Fischer-1"
                },
                {
                    "user_id": "Jeeva",
                    "user_href": "/profile/Jeeva-21"
                },
                {
                    "user_id": "Marc Brandsma",
                    "user_href": "/profile/Marc-Brandsma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brad Jensen",
                "href": "/profile/Brad-Jensen-14"
            },
            "answer_text": "In my opinion the next wave of technology will be bio-based tech. We are reaching some limits when it comes to extracting materials from the earth and we will see more and more materials and technology that are carbon-based and renewable. We are already using an increasing amount of carbon fiber in the construction of vehicles, protective wear, etc. and this trend will continue. We can already see in nature some very useful properties that could be turned into awesome new materials and products if there was some way that we could reliably and inexpensively reproduce them. Spider silk is orginally a fluid that once hardened becomes stronger than steel. Barnacles produce adhesives that are stronger than anything that we can currently produces and it sticks underwater to pratically any surface under almost any situation. Electric eels can produce electricity through a biological process. Researchers have indicated that bio-diesel produced from algae would have the potential to produce enough energy to meet our current needs and would not take up ariable land (could be produced in deserts). Imagine a vehicle made up of spider-silk panels, stuck together with barnacle glue and powered by bio-electricity and bio-diesel. Through bio-mimicry and other materials science research, we will be able to produce products that are organic, inexpensive, easier to manufacture (more flexibility) and will not require extraction, and would not be dependent on local deposits of natural materials (oil, minerals, etc.) Of course, I have only given some examples here and the future will determine which materials and which applications are actually feasible. I am commenting on the general trend and do not want to get into discussions about specific technologies and their relative feasibility. ",
            "date": "Answered July 31, 2017",
            "views": "624",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Avinash Tangudu",
                "href": "/profile/Avinash-Tangudu-1"
            },
            "answer_text": "According to World Economic Forum(WEF) in 2030 these are the changes we can expect. You’ll own nothing and You’ll be happy because whatever you want you are going to rent and It will be delivered through drone.You won’t die waiting for an organ donor instead we print them.A billion people will be displaced by climate change.Polluters have to pay to emit carbon dioxide, There will be a global price for carbon this help will make fossil fuels history.You could be preparing to go to Mars, Scientists are working out how to keep healthy in space. Which is a start of a journey to find a new alien life.",
            "date": "Answered March 12, 2017",
            "views": "715",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shakir Karakoc",
                "href": "/profile/Shakir-Karakoc"
            },
            "answer_text": "The future will be likely to have many issues which will mak e people’s life the most problematic. I am environment engineer so I will consider the future as my professionalizm to be able to give correct perspective. First of all, the future will definetly have air pollution because of car and industry emission.  Second problem will be global warning because of countless structure aggorrdingly lack of green in the world.  The last but not least problem will be potable water because of global warning and pollution of surface of the world. ",
            "date": "Updated March 4, 2020",
            "views": "260",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Jeeva",
                    "user_href": "/profile/Jeeva-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Emmott",
                "href": "/profile/Richard-Emmott"
            },
            "answer_text": "People are using mobile more and more as an extension of\rthemselves and using it to communicate beyond talking and texting; it’s morphing into a way to connect with other people beyond the standard channels. Location Based Services (LBS), apps, instant social media connections are all influencing mobile use.  We're closer than we ever have been before to having content follow us around, allowing us to access it on any device we want. Netflix and Hulu Plus are examples of this; providing one main content source that is available to you on your mobile, tablet, TV and computer.  In our opinion this is where everything is headed and the future will be consolidated! ",
            "date": "Answered March 1, 2011",
            "views": "860",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohan Ken",
                    "user_href": "/profile/Mohan-Ken"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Dannelly",
                "href": "/profile/Ray-Dannelly"
            },
            "answer_text": "On a common, daily basis, we'll use technology that has yet to be thought up, let alone invented.  Things we once thought were impossible will be commonplace.  And technology we thought was just a few years away... will still be a few years away. There will still be bigots and jerks and idiots, and people who can't seem to move past the middle ages.  There will be new tolerance for some things, and rejection of others. In all, the future will be quite a bit like the past and present, and yet utterly uniquely different. ",
            "date": "Answered April 21, 2014",
            "views": "461",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeeva",
                    "user_href": "/profile/Jeeva-21"
                },
                {
                    "user_id": "Ben Grant",
                    "user_href": "/profile/Ben-Grant-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rowland Larkham",
                "href": "/profile/Rowland-Larkham"
            },
            "answer_text": "The pursuit of utopia will always be with us,, By the indications i have seen so far there will be more concentration of populations,, with a more useful integration of renewable resources. In 150 yr, using the indications from the last 150, the world will be similar but mostly far advanced, like dropping an 1850’s pioneer in New York today. ",
            "date": "Answered June 2, 2016",
            "views": "577",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deejay Tartar",
                    "user_href": "/profile/Deejay-Tartar"
                },
                {
                    "user_id": "Kanchan",
                    "user_href": "/profile/Kanchan-178"
                },
                {
                    "user_id": "Ajay Pherwani",
                    "user_href": "/profile/Ajay-Pherwani"
                },
                {
                    "user_id": "Clifford Meyer",
                    "user_href": "/profile/Clifford-Meyer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Bollmann",
                "href": "/profile/Charles-Bollmann"
            },
            "answer_text": "We will continue to advance, and realized beings are telling us the Golden Age will be here in about 10 years. It should be fun. ",
            "date": "Answered March 20, 2014",
            "views": "19",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ajay Pherwani",
                    "user_href": "/profile/Ajay-Pherwani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ali Ahmad",
                "href": "/profile/Ali-Ahmad-64"
            },
            "answer_text": "3019, Year of Aliens An alien invasion has destroyed the world as we know it. The year is 3019. Pakistan is a deserted place ruled by aliens. Once glorious, Pakistan Monument is now buried. Brave Army Officer, Mr Ali Khan is humanity's only hope. Ali finds the courage to start a secret revolutionary organization called Pakistan Army. The fight is jeopardised when Ali is tricked by violent King, Mr Martian Emperor, and injures his arm. Armed with Jet Fighters and Laser Tanks, Pakistan Army try their best to save mankind, but can they defeat cold-blooded aliens and restore Pakistan Monument to its former glory? Written By Me ",
            "date": "Answered July 19, 2019",
            "views": "332",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Brown",
                "href": "/profile/Chris-Brown-218"
            },
            "answer_text": "I expect a 'tyranny of the retired', where old people have the most votes, and force the younger generations to support them in the style to which they are accustomed.  As we extend our lifetimes, this will accelerate. PS: I am well on my way to becoming such a tyrant ",
            "date": "Answered April 21, 2014",
            "views": "256",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kanchan",
                    "user_href": "/profile/Kanchan-178"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabi Golumb",
                "href": "/profile/Gabi-Golumb"
            },
            "answer_text": "I'd imagine it will look something like this:    A marriage between technology and glass permeating most of the functional aspects of our lives. ",
            "date": "Answered August 24, 2011",
            "views": "462",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ciro Villa",
                "href": "/profile/Ciro-Villa"
            },
            "answer_text": "Without a specific time specification to define the \"future\", to see what the future looks like at any given time, all one has to do is wait an infinitesimal amount of time after having asked the question.  Thus, at any point a vision of the future in respect to a previous infinitesimal point will reveal itself. ",
            "date": "Answered March 4, 2011",
            "views": "429",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rob Peebles",
                "href": "/profile/Rob-Peebles-1"
            },
            "answer_text": "I believe it will be more science based. The environment will be the big winner as we all become more aware of our impact. ",
            "date": "Answered June 23, 2018",
            "views": "190",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manish Arora",
                "href": "/profile/Manish-Arora"
            },
            "answer_text": "Just a thought............ Era of smart phone and mobile based cloud computing will be on high!! ",
            "date": "Answered February 26, 2011",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Attila Okur",
                "href": "/profile/Attila-Okur"
            },
            "answer_text": "the ultimate and definite answer to this question : i will definitely turn to dust ",
            "date": "Answered March 12, 2018",
            "views": "211",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kishan Panaganti Badrinath",
                "href": "/profile/Kishan-Panaganti-Badrinath"
            },
            "answer_text": " I would give them this list to keep forever! ",
            "date": "Answered November 14, 2014",
            "views": "314",
            "upvotes": " Not for Reproduction"
        }
    ]
}