{
    "title": "What is 'clean coal'? - Quora",
    "tags": [
        "Clean Coal",
        "Coal",
        "Alternative Energy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Helman",
                "href": "/profile/Daniel-Helman"
            },
            "answer_text": "Let me add to @Jim Gordon's answer: Coal starts out as wood, and through burial and millions of years, turns into a rock which people burn.  It is high in hydrocarbons.  The low-sulfur coal is generally from plants in a freshwater setting (before it turned to a rock) while the high-sulfur coal formed in saltwater lagoons, etc.  The low-sulfur coal has been given the name \"Clean Coal\" by the coal industry, for marketing purposes.  Burning regular coal produces a lot of sulfur dioxide, which turns into acid rain (that is, sulfuric acid), and is responsible for deforestation and other devastation. As far as I know, @Ryan Carlyle's and @Mike Bernard's answers contain wonderful information, but these technologies can be (and are) applied to both types of coal. PSNotice how the US and other trade walls against Chinese solar panels has just started to destroy the solar panel sector of their economy?  The Chinese were hugely subsidizing their industry, and the US has just imposed very large tariffs.  Moreover, the Chinese subsidies are being challenged internationally, as being unfair to domestic production elsewhere.  The rule is that any subsidy can be met with a fine, I think.  It is an odd system, when it comes to global wellbeing. http://www.reuters.com/article/2012/10/09/usa-china-solar-idUSL1E8L8J8C20121009?type=marketsNewshttp://www.forbes.com/sites/gordonchang/2012/10/07/sun-sets-on-chinas-solar-industry/ Please note that I was up in Seattle in 1999, protesting against the WTO (World Trade Organization) for precisely this reason.  The trade laws don't protect people or the environment, and have no mechanism to allow for democratic input.  The people who wrote the documents could have made exceptions for subsidies based on environmental or humanitarian reasons.  The governments involved still could, if they wanted to.  It is something to lobby for -- that the WTO ought to allow for countries to subsidize environmentally sound technologies without fear of being sued by other countries for dumping cheap goods on the global marketplace.  (There should also be a provision to allow countries to impose high duties on goods which are produced in an inhumane fashion, to discourage exploitation.)  This is not rocket science.  I'm not sure why we were not successful in 1999, but I do remember that a police officer confiscated a pin of mine because I had walked into a \"no protest zone\" where you weren't allowed to be political.  It had a cute picture of dolphins, and it said \"Dolphins Oppose the WTO.\" ",
            "date": "Answered October 10, 2012",
            "views": "712",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandy Perlmutter",
                    "user_href": "/profile/Sandy-Perlmutter"
                },
                {
                    "user_id": "Brian Donovan",
                    "user_href": "/profile/Brian-Donovan-13"
                },
                {
                    "user_id": "Jorge Soda",
                    "user_href": "/profile/Jorge-Soda"
                },
                {
                    "user_id": "Ryan Carlyle",
                    "user_href": "/profile/Ryan-Carlyle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yahya Elamrani",
                "href": "/profile/Yahya-Elamrani"
            },
            "answer_text": "What is clean coal? It is a whole range of technologies ,including carbon capture utilization and storage (CCUS) that captures carbon emissions from sources like power plants. That CO2 is then stored or used so it doesn’t enter the atmosphere. Does it work? So far, not well. Clean coal technology has not been widely deployed at a large scale in the world, and many clean coal projects have ended in failure. There are also ongoing debates about whether several common deployments of the technology actually reduce overall emissions. Will clean coal ever work? Experts from places like Oxford University and the Clean Air Task Force say it must. Globally, coal is typically the cheapest, most readily available fuel—especially in developing countries—and coal consumption is expected to rise 18 percent by 2040. Without carbon capture, burning all that coal will likely blow through the 2 degree warming threshold agreed in the the COP 21 Agreement. So, in summary, getting to a place where clean coal is cost-effective and deployable on a large-scale appears to be a ways off. But it’s probably too early to consider it a false prophecy. There are some promising projects out there and money is continuing to pour into clean coal research. ",
            "date": "Answered December 17, 2016",
            "views": "26",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeanne Paquette",
                    "user_href": "/profile/Jeanne-Paquette-1"
                },
                {
                    "user_id": "Bruno Alberto Valverde Bustamante",
                    "user_href": "/profile/Bruno-Alberto-Valverde-Bustamante"
                },
                {
                    "user_id": "Saad Se((tdw",
                    "user_href": "/profile/Saad-Se-tdw"
                },
                {
                    "user_id": "Jovi George",
                    "user_href": "/profile/Jovi-George-1"
                },
                {
                    "user_id": "Peter Hawkins",
                    "user_href": "/profile/Peter-Hawkins-2"
                },
                {
                    "user_id": "Daniel Wong",
                    "user_href": "/profile/Daniel-Wong-83"
                },
                {
                    "user_id": "Stephen Frantz",
                    "user_href": "/profile/Stephen-Frantz"
                },
                {
                    "user_id": "Sameera Bharadwaja H",
                    "user_href": "/profile/Sameera-Bharadwaja-H"
                },
                {
                    "user_id": "Ranjam Arora",
                    "user_href": "/profile/Ranjam-Arora"
                },
                {
                    "user_id": "Rob Denehy",
                    "user_href": "/profile/Rob-Denehy"
                }
            ]
        }
    ]
}