{
    "title": "What are some really cool gadgets to buy? - Govision USA - Quora",
    "tags": [
        "Gadgets (technology)",
        "Fashion and Style",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Buster Smith",
                "href": "/profile/Buster-Ecks"
            },
            "answer_text": "It all depends on your specific and unique definition of cool. Personally I tend to sway towards gadgets that make my life easier. One gadget that I've had the longest of probably all of my gadgets would be my KeySmart. While I didn't invest in the KickStarter, I grabbed mine shortly after they officially publicly launched. At the time I had too many keys on my keychain and wanted to better maintain them. I invested and never looked back. I started with 6 keys and a USB thumb drive. Today I have 3 keys, a bottle opener, and a USB thumb drive. I like it so much that I've purchased a few more to have spare parts, give to friends, and store a second set of keys. I was also wary about airport security. They tend to open and fan out the keys, and when realizing there are no knives, they hand it back over. My pretty sharp can-opener even got through without a problem.  The second gadget would be my portable car jumper. For years, I had a bit and clunky 25-pound charging unit that was meant to be portable, but often sat in my garage until it was needed. Kinda pointless if my battery dies while I'm out and about. Then I discovered an actual portable car jumper. It weighs about a pound or two and, including accessories, is about the size of a woman's hand purse. This tiny unit remains in my vehicle and has proven that it can jump start my vehicle without a problem at least 4 times before needing a re-charge. A great, nifty gadget for road trips. My only warning is to get a high quality unit. The cheaper units have very undesired problems.  Magnetic phone mounts for cars are another great gadget. I travel frequently, and a quality magnetic mount is great! Magnetic means minimal moving parts, so less chance of the mount breaking. Anytime I’m in my vehicle, I’m using this mount. I toss my phone up there and it remains. When I need navigation, I set the location and can simply glance over at the screen instead of holding it in my hand or relying on a passenger. Though make sure this is legal in your region before you take the plunge.  For me, that's really it off the top of my head. I've tried minimalistic wallets but didn't like them most because I like for my ID to be in a clear screen as I venture to bars often. If this wasn't the case, I'd likely invest in the KeySmart Urban Slim Wallet.  I've dabbled with tile and key trackers -- again, to each his own. I don't lose my keys or wallet enough to make use of this and even if I do, I have spare keys that I can easily access.  ",
            "date": "August 13, 2020",
            "views": "476",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kevin Smith",
                    "user_href": "/profile/Kevin-Smith-2939"
                },
                {
                    "user_id": "SC Skin Care USA",
                    "user_href": "/profile/SC-Skin-Care-USA"
                },
                {
                    "user_id": "Isabelle A. Isbell",
                    "user_href": "/profile/Isabelle-A-Isbell"
                },
                {
                    "user_id": "Ganeshdev Chavhan",
                    "user_href": "/profile/Ganeshdev-Chavhan"
                },
                {
                    "user_id": "Olivia Dunn",
                    "user_href": "/profile/Olivia-Dunn-59"
                },
                {
                    "user_id": "Jeff Obunga",
                    "user_href": "/profile/Jeff-Obunga"
                }
            ]
        }
    ]
}