{
    "title": "What are the classes of Cyberpunk 2077? - Quora",
    "tags": [
        "Cyberpunk",
        "Science Fiction (genre)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Brunch",
                "href": "/profile/Tony-Brunch"
            },
            "answer_text": "The Cyberpunk 2077 Classes are: NetrunnerTechieSolo Let’s talk about Cyberpunk 2077 Classes in details: Netrunner The Netrunners are the super hackers of Night City. In the board game, they explore the Internet using brain-computer interface implants, tracking information to sell to other parties, such as Fixers. His skills relate to various branches of hacking, programming, electronics, and cybersecurity. Recently, we got to witness the Cyberpunk 2077 Netrunner in action at E3 during a hands-off preview where they hack into an enemy turret and force it to open fire on their enemies. Techie Cyberpunk's techies are artisans, at least on the tabletop version. They are underground characters who do engineering \"off the record\" for a variety of clients. They survive Night City by building, fixing, and modifying technology, a skill in high demand among the citizens of this neon-soaked underworld. Solo Solos are, as their name suggests, lone mercenaries. They take work as hitmen, bodyguards, and other violent jobs for whoever can pay. Many have military experience, perhaps in a corporate military, and those who do not die can replace lost limbs with cybernetic prosthetics. They are the fighters and skilled in a variety of Cyberpunk 2077 weapons. ",
            "date": "Answered August 15, 2020",
            "views": "248",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Noor Muhammad Khan",
                    "user_href": "/profile/Noor-Muhammad-Khan-12"
                },
                {
                    "user_id": "Jason Turner",
                    "user_href": "/profile/Jason-Turner-364"
                },
                {
                    "user_id": "Darrell Waddleton",
                    "user_href": "/profile/Darrell-Waddleton"
                },
                {
                    "user_id": "Dylan Burns",
                    "user_href": "/profile/Dylan-Burns-87"
                },
                {
                    "user_id": "Riley A Hancock",
                    "user_href": "/profile/Riley-A-Hancock"
                },
                {
                    "user_id": "Noor Samand",
                    "user_href": "/profile/Noor-Samand-2"
                },
                {
                    "user_id": "Alex Coomb",
                    "user_href": "/profile/Alex-Coomb"
                },
                {
                    "user_id": "Alex Coomb",
                    "user_href": "/profile/Alex-Coomb-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Lawson",
                "href": "/profile/William-Lawson-97"
            },
            "answer_text": "There is no set class system in Cyberpunk 2O77, but the skills can be categorized under 3 different ones, the Solo, the Netrunner and the Techie. The Solo is a street warrior-like mercenary, focusing on combat prowess, melee, guns, etc. Some are agile like V from the 2O18 demo, like to use mantis blades to scale walls and dismember enemies, dodge, slide, etc.Or there’s Jackie who’s the opposite of V, more of a strength-based solo, high strength allows you to finish off opponents with your bare hands, rush up to defensive turrets and rip them off their stands to use it manually, use gorilla arms to manually pry open closed doors, heavy weapons, etc. The Netrunner is a hacker, they can release viruses into a network of enemies, they can hack terminals to unlock doors, they can fry their opponents cybernetics and brain, shut down surveillance cameras and hack many different design elements like defensive turrets to become hostile to their owner, bench pads to increase the press weight and crush an unsuspecting enemy working out, soda machines to start chain-spitting soda to distract enemies, sparring robots to go berserker and kill anything in the vicinity, etc. The Techie class is the least elaborated on class so far, but they’re supposed to be the best at engineering, such as weapons, cyber implants, etc, they manipulate technology their own way to survive in Night City, how will this class actually work and what will it be able to do is largely unknown at this point. Now these classes aren’t defined, nor can they be chosen at the start of the game, similar to earlier Elder Scrolls games, you create your own class from abilitites and attributes, mix up different kinds of cyberware, progression perks and stats “resemblant” of these classes. ",
            "date": "Answered July 14, 2019",
            "views": "181",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alex Davis",
                    "user_href": "/profile/Alex-Davis-100"
                }
            ]
        }
    ]
}