{
    "title": "What is video conferencing? - Quora",
    "tags": [
        "Web Conferencing",
        "Video Conferencing",
        "Skype (product)",
        "Streaming Video Content"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tomasz Bołcun",
                "href": "/profile/Tomasz-Bołcun-1"
            },
            "answer_text": "Video conferencing is a real-time, audio-visual form of online communication, organized with the help of browser-based, desktop, or mobile applications. This technology helps to connect people scattered around the globe and enables them to get together in an online meeting room. This is why video conferencing has been on an immense rise over the past few months and still is. Since the COVID-19 turned everything inside out, the number of online events went through the roof. Long before the lockdown disrupted the way we live, video conferencing software has been one of the most crucial means of online communication in terms of private web calls with family and friends. Most importantly, it comes to running a business and educational activities. Companies of all shapes and sizes have embraced video meetings and web conferencing to cut down the business travel costs, save time, and nuisance necessary to organize traditional, onsite meetings held in office conference rooms. Introducing a video conferencing solution in an organization was a way to swiftly connect and collaborate with employees, managers, associates, business partners, or freelancers from every corner of the planet. ",
            "date": "Answered October 29, 2020",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christy Perez",
                "href": "/profile/Christy-Perez-43"
            },
            "answer_text": "Nowadays, video conferencing is one of the best tools for conducting business meetings. The main benefits of video conferencing include more efficient meetings with the exchange of non-verbal communications and a stronger sense of community among business contacts, both within and between companies, as well as with customers. It is a live, visual connection between two or more people residing in separate locations for communication. At its simplest, video conferencing provides the transmission of static images and text between two locations. At its most sophisticated, it provides transmission of full-motion video images and high-quality audio between multiple locations.  ",
            "date": "Answered March 3, 2020",
            "views": "255",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jackie Harris",
                    "user_href": "/profile/Jackie-Harris-221"
                },
                {
                    "user_id": "Deepak Malik",
                    "user_href": "/profile/Deepak-Malik-510"
                }
            ]
        }
    ]
}