{
    "title": "What is the special theory of relativity by Einstein? - Quora",
    "tags": [
        "Albert Einstein (physicist)",
        "Physicists",
        "General Relativity",
        "Special Relativity",
        "Speed of Light",
        "Theory and Theories",
        "Relativity (physics)",
        "Cosmology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yan Yan",
                "href": "/profile/Yan-Yan-337"
            },
            "answer_text": "Albert Einstein’s theory of relativity is actually 2 separate theories: his special theory of relativity, postulated in the 1905 paper, The Electrodynamics of Moving Bodies and his theory of general relativity, an expansion of the earlier theory, published as The Foundation of the General Theory of Relativity in 1916. Einstein sought to explain situations in which Newtonian physics might fail to deal successfully with phenomena, and in so doing proposed revolutionary changes in human concepts of time, space and gravity. The special theory of relativity was based on 2 main postulates: firstly, that the speed of light is constant for all observers; and secondly, that observers moving at constant speeds should be subject to the same physical laws. Following this logic, Einstein theorized that time must change according to the speed of a moving object relative to the frame of reference of an observer. Scientists have tested this theory through experimentation - proving, for example, that an atomic clock ticks more slowly when travelling at a high speed than it does when it is not moving. The essence of Einstein’s paper was that both time and space are relative, rather than absolute, which was said to hold true in a special case, the absence of a gravitational field. Relativity was a stunning concept at the time; scientists all over the world debated the veracity of Einstein’s famous equation, E=mc^2, which implied that energy and matter were equivalent and, more specifically, that a single particle of matter could be converted into a huge quantity of energy. However, since the special theory of relativity only held true in the absence of a gravitational field, Einstein strove for 11 more years to work gravity into his equations and discover how relativity might work generally as well. According to the theory of general relativity, matter causes space to curve. It is posited that gravitation is not a force, as understood by Newtonian physics, but a curved field, an area of space under the influence of a force, in the space-time continuum that is actually created by the presence of mass. According to Einstein, that theory could be tested by measuring the deflection of starlight travelling near the sun; he correctly asserted that light deflection would be twice that expected by Newton’s laws. This theory also explained why the light from stars in a strong gravitational field was closer to the red end of the spectrum than those in a weaker one. For the final 38 years of his life, Einstein attempted to find a unified field theory, in which the properties of all matter and energy could be expressed in a single equation. His search was confounded by quantum theory’s uncertainty principle, which stated that the movement of a single particle could never be accurately measured, because speed and position could not be simultaneously assessed with any degree of assurance. Although he was not able to find the comprehensive theory that he sought, Einstein’s pioneering work has allowed countless other scientists to carry on the question for what some have called “the holy grail of physicists.” ",
            "date": "Answered March 7, 2018",
            "views": "509",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maxwell Shedd",
                    "user_href": "/profile/Maxwell-Shedd"
                },
                {
                    "user_id": "Abdul Shareef",
                    "user_href": "/profile/Abdul-Shareef-13"
                },
                {
                    "user_id": "Bhaswar Chakraborty",
                    "user_href": "/profile/Bhaswar-Chakraborty-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saviour Joseph",
                "href": "/profile/Saviour-Joseph"
            },
            "answer_text": "Actually bro theory of relativity is way more simpler than most people think, I guess you are a beginner so I will explain you the root of this theory in simple language… sir Isaac Newton acknowledged us that why we are not floating in air, it's because the existence of gravity and his definition of space was like- that space is just a blank platform on which these masses are dancing, and his space was just SPACE. But after 400yrs Einstein came out with his space and he told us that why do every mass in space has gravity. He told us the real reason behind the gravity which is - Let's have an example- suppose a bedsheet is hunged from all of its four corners now if you put a soccer ball on it than the soccer ball will stretch the bedsheet you can imagine it easily, now if you put a smaller ball aside of the the soccer ball you will see that the smaller ball is getting attracted towards soccer ball, why? Because the bedsheet has been stretched in, now assume the bedsheet is space and ball is earth( any mass) and the smaller ball is moon. Now the more heavy ball you put on the bedsheet the more it gets stretched, which means more gravitational force, one more thing, space doesn't have any up and down like the bedsheet does so it will attract from all side, that's the startup of the relativity theory. Now comes the energy, what is energy, you know space gets attracted by energy and mass is a kind of energy in itself, now imagine 2 planets of same mass, now you know both will have same gravitational force because they have exactly same mass, but if body B starts to move it will add up some kinetic energy,so, the energy of the mass + the kinetic energy = more energy than the body A which is still. Now the most beautiful part of relativity theory, it's about the relationship between space-time, space and time are bonded to each other, let's have an example again, imagine a massive mass like sun(body A) and small mass like earth (body B), now take 2 watches of exactly same time, go put each of them on both masses, come back to you place and open your monitor and watch through the cameras, you will see that the time in watch A is too much slow compared to the watch B where watch A completes it's one minute the watch B has already completed an hour, what because the bigger the mass is the more space-time gets bend, but if you go and visit both of them you will see it's just like a normal watch…well that's what time is, it's strange….. That's was the poles of the revolutionary theory of relativity. Pls tell me was it helpful or not. ",
            "date": "Answered November 14, 2016",
            "views": "14",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rahul Chetia",
                    "user_href": "/profile/Rahul-Chetia-14"
                },
                {
                    "user_id": "PRASHANTH KORI",
                    "user_href": "/profile/PRASHANTH-KORI-1"
                },
                {
                    "user_id": "Pahal Castro",
                    "user_href": "/profile/Pahal-Castro"
                },
                {
                    "user_id": "Tanmay Dixit",
                    "user_href": "/profile/Tanmay-Dixit-42"
                },
                {
                    "user_id": "Thanush Kumar",
                    "user_href": "/profile/Thanush-Kumar-5"
                },
                {
                    "user_id": "Pran Singh",
                    "user_href": "/profile/Pran-Singh-11"
                },
                {
                    "user_id": "Twinkle Mehra",
                    "user_href": "/profile/Twinkle-Mehra-3"
                },
                {
                    "user_id": "Ramprasad Vangapandu",
                    "user_href": "/profile/Ramprasad-Vangapandu"
                },
                {
                    "user_id": "Sahlil Ge",
                    "user_href": "/profile/Sahlil-Ge-1"
                },
                {
                    "user_id": "ShivaTeja/ (శివతేజ)",
                    "user_href": "/profile/ShivaTeja-శివతేజ"
                }
            ]
        }
    ]
}