{
    "title": "What is happening to my laptop's touchpad? - Quora",
    "tags": [
        "Touchpads",
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shane Tennent",
                "href": "/profile/Shane-Tennent"
            },
            "answer_text": "Have yah replaced the touchpad? I say again…. in yer diagnostic travels…. did yah replace the touchpad? What was the result? I remember back in Ought Seven, when people were just a-startin’ tuh feel the pinch from the Great Capacitor Plague, we had us one of them Customer fellers come into the shop with one of them there Dell Inspiron laptop thingamajiggers.  Ain’t technology grand, I tell you what. Now that there laptop had itself a touchpad problem where you’d be a-using it, and the mouse pointer would begin to wander all over the screen. It wandered no matter what OS was running. So we done replaced the hardware in question. And that there problem done went away, I tell you what. So that’s why I’m a askin’ you. What happened when yer touchpad done got replaced? Did yer mouse pointer still wander about the confines of that plastic bezel around the display (you have to put heavy emphasis on the first syllable of the word display… read it like DISplay to get the accent right) after you done went and replaced the touchpad and palmrest? If you didn’t… what’s stopping you?  I’m going to let you in on a little trade secret. Good computer repair technicians make guesses. We do. Yes, I know I’m saying I’m good at something… oh the hubris, the arrogance… … anyway, we make guesses. We try really hard to weigh the guess against the work involved, the ability to reverse the fix if it is wrong. We use the diagnostic process not only to identify what is wrong, but to eliminate all the things that aren’t wrong. Holy shit if I had a nickel for every time I went to fix what the customer said was wrong only to find a pile of OTHER more important stuff that needed to be fixed first… I’d have a friggin buttload of nickels. However, there are times when we need to pull the trigger and commit to a repair path, without knowing whether it will work, but knowing full well that we just committed specific resources to finding out. AKA ordering a replacement part when you only know through the process of elimination that this part *should* be the cause of the problem. It does happen. Being a good technician is more about reducing the possibility of an incorrect repair path…. then actually choosing the incorrect repair path. I know going in that no matter how certain I feel, there’s always a chance of failure or missing something. Could it be hardware? Have you removed your copy of Windows to get it out of the way? You know… boot the laptop to a LiveCD of some version of Linux… like Linux Mint. That distro has EXCELLENT hardware detection and compatibility out of the box. Like… better than any other distro really. I’m not saying that people love Mint over Ubuntu in how it looks… but Mint tends to take less finagling (no finagling at all actually) to get it to work with your hardware. You download the disk image, make a bootable flash drive, and boot to it. If the touchpad works fine… you know your problem was software and something in Windows. If the touchpad has the same exact problem in a completely different OS with completely different software drivers for the touchpad, then the problem is hardware. So you used a couple of programs you read about somewhere. That was a good step. Now, you can move your other foot and take another step. Determine if the problem is hardware or software. ",
            "date": "Answered December 19, 2016",
            "views": "11",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Astrid King",
                    "user_href": "/profile/Astrid-King"
                },
                {
                    "user_id": "Alex Pregel",
                    "user_href": "/profile/Alex-Pregel"
                },
                {
                    "user_id": "Alexander Goodwill",
                    "user_href": "/profile/Alexander-Goodwill"
                },
                {
                    "user_id": "J. Sabra",
                    "user_href": "/profile/J-Sabra"
                },
                {
                    "user_id": "Israel Gomez",
                    "user_href": "/profile/Israel-Gomez-7"
                },
                {
                    "user_id": "Tristan Johns",
                    "user_href": "/profile/Tristan-Johns"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donald Stollery",
                "href": "/profile/Donald-Stollery"
            },
            "answer_text": "No offense to anyone who posts their questions on this site, but how in the world are we supposed to answer a question like this? Please provide some information so we know where to start. Like a customer said to me last Friday. “My computer dun’t work. What do ya think?” Answer, “I don't a clue. Might you provide me with some information so I know where to begin?” And his less than helpful response was, “what the hell kind of a computer repair store is this anyway?” It is a repair business that has a less than 2 percent return rate. But one of the keys to my success is my ability to yank, pull, and beg the user to be helpful before I begin the task at hand. User input is essential to covering all the bases. Hopefully other readers will benefit from what we hear every single day and then keep it in mind when you post your questions or frequent your local repair shop. What seems to be the problem? It don't work. Do you need to type in password in order to get to the Desktop? What's a Desktop? The picture thingy. Oh, why didn't you say so? For your password do you use upper/lower case letters and if so, which ones? Huh? Upper or lower case. Huh? Biggies or Smallees? Oh, why didn't you say so? My bad. I may have to rebuild your computer and reinstall your email account if you use an email client that's physically ON or installed ON your computer. Example, if you use GMAIL this is a non-issue, because the actual account isn't ON your computer, but on their website so it won't be impacted by issues with your machine. I have Good Mail. GMAIL. Good Mail. (I had his machine running so I clicked on his GMAIL account.) Pointing I said, as you can see GMAIL. Why did YOU change it from GOOD MAIL TO GMAIL? Good grief. Moving on. Lastly, you mentioned when you came in that the unit was running slow so while we were speaking I was running Malwarebytes and in 17 minutes it identified 4631 pieces of Malware, viruses, and PUP (potentially unwanted programs.) IMPOSSIBLE. I had 5 anti virus programs. About that - more is not better. In fact, they end up working against one another reducing the protection they're supposed to provide. Additionally, all of them are expired. Well I can't afford to pay for new software every time I turn around. That's up to you of course, but it's your main line of defense against Internet criminals. XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX That info was provided as a way to allow you to assist anyone who knows a lot more about computer repair that the User. I've also advised my customers who contact me BEFORE they bring their machine to me. I ask them to write down a list of the problems they're having along with any questions they may have. Helps them AND the Tech. Hope this helps. Merry Christmas to everyone on this site. ",
            "date": "Answered December 19, 2016",
            "views": "650",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krista Landon",
                    "user_href": "/profile/Krista-Landon"
                },
                {
                    "user_id": "Bearded Amish Ed",
                    "user_href": "/profile/Bearded-Amish-Ed"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Daniel-4808"
                },
                {
                    "user_id": "James Moriss",
                    "user_href": "/profile/James-Moriss"
                },
                {
                    "user_id": "Braden Bjorgum",
                    "user_href": "/profile/Braden-Bjorgum"
                },
                {
                    "user_id": "Paul Lally",
                    "user_href": "/profile/Paul-Lally-2"
                },
                {
                    "user_id": "Shane Tennent",
                    "user_href": "/profile/Shane-Tennent"
                }
            ]
        }
    ]
}