{
    "title": "What is the best way to save energy? - Quora",
    "tags": [
        "Energy Efficiency"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jolly Willson",
                "href": "/profile/Jolly-Willson"
            },
            "answer_text": "Energy should be saved at any cost if we want to save our future generations from energy crisis. You can read these energy saving tips to save energy at home in best way. 1. Drain water from your hot water tank. Draining water from the hot water tank regularly can help a lot when it comes to saving energy. This is because, sediments inside the tank can reduce the efficiency of your tank. Draining even just a quart of water from the tank once every two to three months would already help a lot. 2. Cover your foods when you store them inside the refrigerator. It is important to cover or wrap foods that you store inside your refrigerator. This is because, foods that are uncovered can release moisture inside the cooling unit. When that happens, it actually makes the compressor work harder, which means more energy consumed. 3. See if you have a butter conditioner insider your refrigerator. It is always best to check on your user’s manual, even when it comes to making use of your refrigerator. This is because, it can also help you determine if your unit has a butter conditioner. This part of a refrigerator is actually a heater, and it is best if you can turn it off. 4. Don’t keep your old refrigerator running. It is possible that you are still using your old refrigerator at your garage, especially in times when you need extra space. However, it would actually serve you better if you just obtain a new unit, even just a small one. This is because, old refrigerators can actually consume a lot of energy, due to their being inefficient. 5. Attain the ideal temperature for your refrigerator. If you are going to make your refrigerator cooler than you need it to be, then you would be consuming more energy than necessary. With that, you have to take note of the proper temperature for the different parts of it, such as the freezer and the fresh food compartment. To check on their temperatures, just make use of a thermometer for it. 6. See that your refrigerator’s door seals are tight. You have to make sure that your refrigerator seals are really tight, so that cool air would not escape through it. One of the best things to do for it is to close the door while letting a paper hang half inside the unit and half outside of it. If you can pull the paper out easily, then it means that the door seals are not airtight. 7. Don’t let your kids leave their TV sets turned on. If your kids have their own rooms and each of the rooms has a TV set inside, then you should make sure that they are turned off when no one is using. With that, you should constantly remind your kids that they have to turn off the TV sets when they leave their rooms. Aside from that, make it a practice to constantly check on their rooms, just to make sure. 8. Make use of ceiling fans. If you want to have a substitute for air conditioning, you can actually install ceiling fans inside your place for it. Ceiling fans can actually make a room more comfortable by providing sufficient movement of air. Because of that, you won’t have to turn on your air conditioner a lot of times. There are many more energy saving solutions which will really change your life. ",
            "date": "Answered July 20, 2018",
            "views": "408",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alladi Jagannath",
                "href": "/profile/Alladi-Jagannath"
            },
            "answer_text": "I presume that you meant saving energy and not power! Energy can be saved mainly by avoiding wastage. For example an incandescent lamp converts less than twenty percent of the energy into visible light. The rest of the energy is dissipated as heat. This can be achieved by changing to a more efficient type of lamp such as led Wastage of energy can be reduced by switching off appliances when not in use. Using induction heating for cooking also saves energy. Unlike gas, induction heating only heats the bottom of the utensil and does not waste energy by heating the air around. You may be increasing your energy bill but will be saving on gas. Induction heating is more economical than non subsidised gas. It is also safer. Increasing the thermostat setting can save energy on airconditioning. If comfort is our objective, then we should focus on reducing the humidity rather than temperature. If we reduce the speed of the blower, the temperature of the evaporator falls, and go below the dew point, as the heat is not carried away. This makes the moisture in the air condense and reduces the humidity. Though the air may be warmer, it will be comfortable. Other areas where energy can be reduced include having bath in cold water and avoid using geysers. ",
            "date": "Answered October 14, 2016",
            "views": "901",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Godwin George",
                    "user_href": "/profile/Godwin-George-18"
                },
                {
                    "user_id": "Ashish Devnani",
                    "user_href": "/profile/आशीष-देवनानी-Ashish-Devnani"
                }
            ]
        }
    ]
}