{
    "title": "What is your opinion on technology? - Quora",
    "tags": [
        "Opinions",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liam Dacre",
                "href": "/profile/Liam-Dacre"
            },
            "answer_text": "Technology will pave the way for a new era in human history. Using technology we have the potential to stop aging, enhance our own bodies and transcend the biological limitations of the human body. It has the potential to change what it means to be human. It also has the potential to stop/reverse climate change and terraform other planets which means that we can create other planets just like Earth. In the future we could also use technology for interstellar travel and create Dyson Spheres around stars including our sun and distributing over 90% of the energy for our own needs. However, it could also create a much more unstable world than before if it got into the hands of terrorists or the wrong people. For example, weapon technology is advancing all of the time and has the potential to destroy the entire world. Also, AI will take over everything and once it becomes sentient it could wipe out humanity or it could create a much better world than we ever imagined possible. Communication is also changing. For example, by 2020 the 5G mobile phones will come out but in addition to this we will have the ability to text using our brainwaves via a visor attached to our heads. Furthermore, by 2040 virtual telepathy will be the dominant and most popular form of communication due to the shear speed. Also, virtual reality has enormous potential for the future. For example, we could develop nanobots that shut off all sensory information and download their own information meaning that we could fully experience ourselves in artificial worlds. Job interviews, education and holidays could all take place in VR. ",
            "date": "Answered October 25, 2017",
            "views": "102",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nazarene Joy Nicor",
                    "user_href": "/profile/Nazarene-Joy-Nicor-1"
                },
                {
                    "user_id": "Gabrielle Lane",
                    "user_href": "/profile/Gabrielle-Lane-12"
                },
                {
                    "user_id": "Hamri Ouissale",
                    "user_href": "/profile/Hamri-Ouissale"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Redford",
                "href": "/profile/John-Redford"
            },
            "answer_text": "Technology is a trick that hominids have been exploiting for the last million years. All other animals have to make do with pretty much what their own bodies are capable of. Hominids figured out that they could use stuff outside their bodies to kill their food and keep themselves warm. They didn’t need claws and fur - rocks and fire did just as well. That worked great, and so they got steadily better at chipping rocks and making fire. Not only that, but they found that they could share rocks and fire, which you really can’t do with your own claws and fur. Now their whole tribe could advance instead of just one individual, and so their social cooperation skills advanced enormously. There might be a thousand buffalo in a big herd, but that’s a pretty small human town. Now no one individual had to master everything about this technology stuff - it could be shared among many. That implies language and education. Now technology is so elaborate that it needs hundreds of millions of minds to hold it all. No single nation can manage it on their own, as even the determined and brilliant Russians discovered during the Cold War. The Pentagon is frantic about this, because they can’t tell if there’s malware on the chips they buy. Finding the one person on earth who knows how something really works is getting harder and harder! ",
            "date": "Answered September 23, 2018",
            "views": "5",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jose Bonife",
                    "user_href": "/profile/Jose-Bonife"
                }
            ]
        }
    ]
}