{
    "title": "What is going to be the next 'big thing' in the next 5-10 years? - Quora",
    "tags": [
        "Time-sensitive Questions on Quora",
        "Next Big Things",
        "Google Play",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vatsalya Tandon",
                "href": "/profile/Vatsalya-Tandon"
            },
            "answer_text": "There would be a lot of things that would come up in the next 5-10 years that would completely revamp our modern society. That would probably be called the 4th Industrial Revolution. Take a look ahead- In 1998, Kodak had 170,000 employees and sold 85% of all photo paper worldwide.Within just a few years, their business model disappeared and they got ban krupt.What happened to Kodak will happen in a lot of industries in the next 10 year - and most people don't see it coming. Did you think in 1998 that 3 years later you would never take pictures on paper film again?Yet digital cameras were invented in 1975. The first ones only had 10,000 pixels, but followed Moore's law. So as with all exponential technologies, it was a disappointment for a long time, before it became way superiour and got mainstream in only a few short years. It will now happen with Artificial Intelligence, health, autonomous and electric cars, education, 3D printing, agriculture and jobs. Welcome to the 4th Industrial Revolution. Welcome to the Exponential Age.Software will disrupt most traditional industries in the next 5-10 years.Uber is just a software tool, they don't own any cars, and are now the biggest taxi company in the world. Airbnb is now the biggest hotel company in the world, although they don't own any properties. Artificial Intelligence: Computers become exponentially better in understanding the world. This year, a computer beat the best Go player in the world, 10 years earlier than expected. In the US, young lawyers already don't get jobs. Because of IBM Watson, you can get legal advice (so far for more or less basic stuff) within seconds, with 90% accuracy compared with 70% accuracy when done by humans. So if you study law, stop immediately. There will be 90% less laywyers in the future, only specialists will remain. Watson already helps nurses diagnosing cancer, 4 time more accurate than human nurses. Facebook now has a pattern recognition software that can recognize faces better than humans. In 2030, computers will become more intelligent than humans. Autonomous cars: In 2018 the first self driving cars will appear for the public. Around 2020, the complete industry will start to be disrupted. You don't want to own a car anymore. You will call a car with your phone, it will show up at your location and drive you to your destination. You will not need to park it, you only pay for the driven distance and can be productive while driving. Our kids will never get a driver's licence and will never own a car. It will change the cities, because we will need 90-95% less cars for that. We can transform former parking space into parks. 1,2 million people die each year in car accidents worldwide. We now have one accident every 100,000km, with autonomous driving that will drop to one accident in 10 million km. That will save a million lifes each year. Most car companies might become bankrupt. Traditional car companies try the evolutionary approach and just build a better car, while tech companies (Tesla, Apple, Google) will do the revolutionary approach and build a computer on wheels. I spoke to a lot of engineers from Volkswagen and Audi; they are completely terrified of Tesla. Insurance companies will have massive trouble because without accidents, the insurance will become 100x cheaper. Their car insurance business model will disappear. Real estate will change. Because if you can work while you commute, people will move further away to live in a more beautiful neighborhood. Electric cars will become mainstream until 2020. Cities will be less noisy because all cars will run on electric. Electricity will become incredibly cheap and clean: Solar production has been on an exponential curve for 30 years, but you can only now see the impact. Last year, more solar energy was installed worldwide than fossil. The price for solar will drop so much that all coal companies will be out of business by 2025.With cheap electricity comes cheap and abundant water. Desalination now only needs 2kWh per cubic meter. We don't have scarce water in most places, we only have scarce drinking water. Imagine what will be possible if anyone can have as much clean water as he wants, for nearly no cost. Health: The Tricorder X price will be announced this year. There will be companies who will build a medical device (called the \"Tricorder\" from Star Trek) that works with you phone, which takes your retina scan, you blood sample and you breath into it. It then analyses 54 biomarkers that will identify nearly any disease. It will be cheap, so in a few years everyone on this planet will have access to world class medicine, nearly for free. 3D printing: The price of the cheapest 3D printer came down from 18,000$ to 400$ within 10 years. In the same time, it became 100 times faster. All major shoe companies started 3D printing shoes. Spare airplane parts are already 3D printed in remote airports. The space station now has a printer that eliminates the need for the large amout of spare parts they used to have in the past.At the end of this year, new smartphones will have 3D scanning possibilities. You can then 3D scan your feet and print your perfect shoe at home. In China, they already 3D printed a complete 6-storey office building. By 2027, 10% of everything that's being produced will be 3D printed. Business opportunities: If you think of a niche you want to go in, ask yourself: \"in the future, do you think we will have that?\" and if the answer is yes, how can you make that happen sooner? If it doesn't work with your phone, forget the idea. And any idea designed for success in the 20th century is doomed in to failure in the 21st century. Work: 70-80% of jobs will disappear in the next 20 years. There will be a lot of new jobs, but it is not clear if there will be enough new jobs in such a small time. Agriculture: There will be a 100$ agricultural robot in the future. Farmers in 3rd world countried can then become managers of their field instead of working all days on their fields. Aeroponics will need much less water. The first petri dish produced veal is now available and will be cheaper than cow produced veal in 2018. Right now, 30% of all agricultural surfaces is used for cows. Imagine if we don't need that space anymore. There are several startups who will bring insect protein to the market shortly. It contains more protein than meat. It will be labeled as \"alternative protein source\" (because most people still reject the idea of eating insects). There is an app called \"moodies\" which can already tell in which mood you are. Until 2020 there will be apps that can tell by your facial expressions if you are lying. Imagine a political debate where it's being displayed when they are telling the truth and when not.Bitcoin will become mainstream this year and might even become the default reserve currency. Longevity: Right now, the average life span increases by 3 months per year. Four years ago, the life span used to be 79 years, now it's 80 years. The increase itself is increasing and by 2036, there will be more that one year increase per year. So we all might live for a long long time, probably way more than 100. Education: The cheapest smartphones are already at 10$ in Africa and Asia. Until 2020, 70% of all humans will own a smartphone. That means, everyone has the same access to world class education. Every child can use Khan academy for everything a child learns at school in First World countries. We have already released our software in Indonesia and will release it in Arabic, Suaheli and Chinese this Summer, because I see an enormous potential. We will give the English app for free, so that children in Africa can become fluent in English within half a year. ",
            "date": "Updated May 30, 2016",
            "views": "219",
            "upvotes": " View 87 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Albert Stève Nyobe",
                    "user_href": "/profile/Albert-Stève-Nyobe"
                },
                {
                    "user_id": "J. Andrew Goodman",
                    "user_href": "/profile/J-Andrew-Goodman"
                },
                {
                    "user_id": "Justice Varner",
                    "user_href": "/profile/Justice-Varner-1"
                },
                {
                    "user_id": "Ken Wong",
                    "user_href": "/profile/Ken-Wong-33"
                },
                {
                    "user_id": "Alexander Danan",
                    "user_href": "/profile/Alexander-Danan"
                },
                {
                    "user_id": "John Wagner",
                    "user_href": "/profile/John-Wagner-254"
                },
                {
                    "user_id": "Dr Shanmugavel",
                    "user_href": "/profile/Dr-Shanmugavel"
                },
                {
                    "user_id": "Sarah Rose Pua",
                    "user_href": "/profile/Sarah-Rose-Pua-2"
                },
                {
                    "user_id": "Bill Oloo",
                    "user_href": "/profile/Bill-Oloo"
                },
                {
                    "user_id": "Sritam Pradhan",
                    "user_href": "/profile/Sritam-Pradhan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raviteja Chirala",
                "href": "/profile/Raviteja-Chirala"
            },
            "answer_text": "The world today has so many evolutionary things than revolutionary which is a great sign of progress. We have got to let them run until they break their threshold and give us an opportunity to innovate new stuff to keep up the needs.   Self driving zip cars : We're seeing how Uber is advancing every day. People love it not because of it's new technology or anything but it revamped the very old business from the ground and made it much simpler. Likewise, Ola Cabs (company) in India has done the same or even better job in reaching out to general audience. Imagine if the cars are self-driving too? I am sure companies like Google (company), General Electric are spending resources towards this. We should be expecting their presence more and more going forward.                                                                                                                                                                                                            Why are we desperate for them? Amount of time people are spending in driving per day could be more resourceful. Most of the accidents are drink and driving,using mobiles etc are human blunders. They're taking over the actual feel of driving a luxury car like BMW or Mercedes.Hyperloop : This is phenomenal. There is a very good reason why Elon Musk is backing it up strongly. For years now, we have accepted the time it takes to travel from point A to point B. Because it's what we were told that it takes this much time. Hyperloop broke that stigma and presents a great way to make travel faster, efficient(no fuel) and safer. It just began it's beta run and not too long away to get into mainstream.       3D Printing : This technology has been there for years but has never seen the broad day light like it should have already. Highly undervalued sophisticated technology. Ofcourse it's gonna take longtime to get mid sized consumers understand and use it for personal stuff but companies like SpaceX (company) or popular Car makers has a huge scope to make it a mainstream design approach.                                                                                Payments : Very traditional approach broken by PayPal (product) a while back and then big players like Google (company), Apple has got a good hands on to break this process. Apple has seen a good success so far with Apple Pay. However majority of the world still uses Credit Cards, Cash as a day to day payment channel. This has got to break. We are changing this slowly and hence mobile payments, payments through watch etc came. It's gonna spread even more with stuff like thumb impressions, watch payments etc                                                                                                              Artificial Neural Networks : Well, it needs no introduction any more. Despite this has been there for decades we're still crawling in getting to achieve what we want. Simulation of Human Brain proved to be very challenging. The more you learn about human behavior the more complicated it gets. There is a lot of potential taking advantage of Artificial Intelligence. Automating atleast some of the human work would give us great opportunity to focus on other important things. There is always another side of a coin like it could endanger human species etc but I don't see how it will happen.                                                    Solar Energy : We're already seeing how much Electric Cars, trains, buses etc Probably Flights and Rockets too soon. However, in generating this electricity we have a great Solar Power generating system(Sun) which is free. It was and is challenging how to store this huge amount of solar energy and convert it into Electric Energy. Companies like SolarCity (company), Tesla are putting a great deal of resources here and here we see products like  Powerwall. Well, its just beginning. We have a lot to cover like cars, houses, even phones(why not).                   ",
            "date": "Answered May 27, 2015",
            "views": "342",
            "upvotes": " View 41 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kshitij Gera",
                    "user_href": "/profile/Kshitij-Gera"
                },
                {
                    "user_id": "Gordon Ng",
                    "user_href": "/profile/Gordon-Ng-26"
                },
                {
                    "user_id": "Jacqwin Joy",
                    "user_href": "/profile/Jacqwin-Joy-1"
                },
                {
                    "user_id": "Bernardo Marcial",
                    "user_href": "/profile/Bernardo-Marcial"
                },
                {
                    "user_id": "Eric Demby",
                    "user_href": "/profile/Eric-Demby-3"
                },
                {
                    "user_id": "Dawebwiz Dawebwiz",
                    "user_href": "/profile/Dawebwiz-Dawebwiz"
                },
                {
                    "user_id": "Tai Williams",
                    "user_href": "/profile/Tai-Williams-6"
                },
                {
                    "user_id": "Jean Pierre Souchon",
                    "user_href": "/profile/Jean-Pierre-Souchon"
                },
                {
                    "user_id": "Andrew Mcdavid Jr",
                    "user_href": "/profile/Andrew-Mcdavid-Jr"
                },
                {
                    "user_id": "Heath Rogers",
                    "user_href": "/profile/Heath-Rogers-4"
                }
            ]
        }
    ]
}