{
    "title": "What should be done to stretch the anus prior to anal sex in order to prevent pain and damage? - Quora",
    "tags": [
        "The Rectum and Anus",
        "Anal Sex",
        "Sex Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Buster Smith",
                "href": "/profile/Buster-Ecks"
            },
            "answer_text": "What should be done to stretch the anus prior to anal sex in order to prevent pain and damage? Three things: Lube, Slow, Relax First and foremost, LUBE. Lube is your friend. Don’t use it sparingly, feel more than free to use too much. Your anal cavity is NOT self lubricating like a vagina is, so you’ll need to lube it yourself. Use lube in the beginning and don’t be afraid or even hesitant to add more as the activity continues. Start prepping yourself with small objects then work yourself up. Start with a finger (and lube), then upgrade to two fingers. And remember to go slow. If you feel comfortable here, consider a third finger or a toy. Anal plugs come in a variety of sizes and shapes. Start small and slowly work your way up to a size you’re comfortable with. Again, lots of lube and take your time. Plugs are the easiest tool to gain a comfort level with in terms of anal. Relax your body, insert, and allow your body to get used to the feelings. Heads up, it will feel like you’re pooping at first.  Note: Butt plugs are typically made of silicon, metal, and glass. If you opt for a metal or glass, use your breath or warm water to warm it up first. A cold plug often does not help you relax to insert it.  Regarding the lube, stick to a water based lube. Water based is going to be the easiest to use and clean up, plus it will not damage toys and condoms. The down side if that for prolonged sex, you’ll often have to re-apply it from time to time. Prior to having anal sex, it’s often best and gives you peace of mind if you ensure you’re clean. This can be done by using the bathroom prior to having sex. You can go a step further by using a douche to ensure you’re clean inside. An enema can also be used to inject lube into your anal cavity to assist with anal sex. ",
            "date": "Answered December 12, 2017",
            "views": "409",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Ruhlen",
                    "user_href": "/profile/Tim-Ruhlen"
                },
                {
                    "user_id": "Mick McLovin",
                    "user_href": "/profile/Mick-McLovin"
                },
                {
                    "user_id": "Brian Sneider",
                    "user_href": "/profile/Brian-Sneider"
                },
                {
                    "user_id": "Lauren Anderson",
                    "user_href": "/profile/Lauren-Anderson-48"
                },
                {
                    "user_id": "Josh Reid",
                    "user_href": "/profile/Josh-Reid-85"
                },
                {
                    "user_id": "Van Nook",
                    "user_href": "/profile/Van-Nook"
                },
                {
                    "user_id": "Md Seraj",
                    "user_href": "/profile/Md-Seraj-12"
                },
                {
                    "user_id": "Sam Frank",
                    "user_href": "/profile/Sam-Frank-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Smith",
                "href": "/profile/Steve-Smith-903"
            },
            "answer_text": "The other answer was good but failed to say to use a suitable slick lube with one then 2 or 3 fingers initally stretch your anal sphinctor before moving to a butt plug or dildo use water based or silicon based lube or failing that try some organic coconut oil its solid at room temperature and is readily absorbed into the body a tittle goes a long way its all organic. It's very important if you are using a home made dildo or butt plug (a thick wax candle or banana or zuchine / courgette) to remember the shop bought ones designed for anal stimulation will have a flared base so it can't be pulled up into your gut which the home made ones easily can and if they do its an embarissing trip to hospital to have it surgically removed. The other thing to say is when you feel comfortable to try anal sex with a guy especially if he has a really thick or long penis make sure you lube up first and try sitting on his penis that way you control the depth and speed of penetration, try pushing out as he enters you like expelling a poo that relaxes your anal spinctor. And finally make sure he uses a condom ( not with oil based lube as it destroys rubber condoms) if you don't know his sexuall health, as STIs and HIV are quickly absorbed into your blood stream by his sperm and if he is infected it will quickly pass to you. Enjoy !! ",
            "date": "Answered December 6, 2017",
            "views": "583",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Thomas",
                    "user_href": "/profile/David-Thomas-2279"
                },
                {
                    "user_id": "Mick McLovin",
                    "user_href": "/profile/Mick-McLovin"
                },
                {
                    "user_id": "Lauren Anderson",
                    "user_href": "/profile/Lauren-Anderson-48"
                },
                {
                    "user_id": "Kalindy Buckley",
                    "user_href": "/profile/Kalindy-Buckley"
                },
                {
                    "user_id": "LizLikezTo Play",
                    "user_href": "/profile/LizLikezTo-Play"
                },
                {
                    "user_id": "Van Nook",
                    "user_href": "/profile/Van-Nook"
                },
                {
                    "user_id": "Daljit Sambhi",
                    "user_href": "/profile/Daljit-Sambhi"
                },
                {
                    "user_id": "M Holland",
                    "user_href": "/profile/M-Holland-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raj Acharya",
                "href": "/profile/Raj-Acharya-34"
            },
            "answer_text": "Practice. Use Butt Plug to stretch/relax anal opening. If you can’t find butt plug you can use some other object. But use only those object which can be hold tightly from outside using hand. Unlike vagina, anus pulls object inside so use a longer object. You can use large Radish, large Carrot etc too. Put on a condom and using lots of lube penetrate regularly. If you use butt plug, you can even sleep holding this whole night. You can take a larger butt plug or other object day by day as person become more comfortable ",
            "date": "Answered December 6, 2017",
            "views": "205",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Srini",
                    "user_href": "/profile/Srini-247"
                },
                {
                    "user_id": "Van Nook",
                    "user_href": "/profile/Van-Nook"
                },
                {
                    "user_id": "Anil",
                    "user_href": "/profile/Anil-336"
                },
                {
                    "user_id": "Naveen Kumar",
                    "user_href": "/profile/Naveen-Kumar-5664"
                },
                {
                    "user_id": "Rushi Patel",
                    "user_href": "/profile/Rushi-Patel-85"
                },
                {
                    "user_id": "Ajay Kumar",
                    "user_href": "/profile/Ajay-Kumar-1176"
                },
                {
                    "user_id": "Steve Smith",
                    "user_href": "/profile/Steve-Smith-903"
                },
                {
                    "user_id": "M Holland",
                    "user_href": "/profile/M-Holland-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dion Shaw",
                "href": "/profile/Dion-Shaw"
            },
            "answer_text": "Start small. Use fingers first, then small butt plugs with a base. The base is important so the plug doesn’t slide into your rectum and create an ER trip. Always use lube. Always. The anus does not make lubricated itself, unlike the vagina or mouth. The amount is up to you. Initially, go heavy on the lube and after experiencing anal, you can reduce the amount, if you wish. Use protection to avoid STIs and HIV. Condoms are your best friend. ",
            "date": "Answered November 5, 2019",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Colston Sinatra Lipford, Jr.",
                    "user_href": "/profile/Colston-Lipford"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norm Lane",
                "href": "/profile/Norm-Lane-1"
            },
            "answer_text": "If you use a dildo in your butt when you masturbate you can get used to relaxing the muscles. Start small perhaps just a finger or two. And use lube.Avoid any sort of deadening stuff. You want to feel everything that is happening and proceed at your own pace. ",
            "date": "Answered November 5, 2019",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Dunken",
                "href": "/profile/Tom-Dunken"
            },
            "answer_text": "A good way is , you buy but plugs from small to large sizes. Insert the first keep it in for hours.slowly move up in size..you get ready in no time. Good luck…have fun ",
            "date": "Answered February 20, 2018",
            "views": "22",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tiana Carroll",
                    "user_href": "/profile/Tiana-Carroll-6"
                },
                {
                    "user_id": "Steve Smith",
                    "user_href": "/profile/Steve-Smith-903"
                }
            ]
        }
    ]
}