{
    "title": "What is the biggest size floppy disk? - Quora",
    "tags": [
        "Floppy Disks",
        "Hard Disk Drives (HDD)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ira J Perlow",
                "href": "/profile/Ira-J-Perlow"
            },
            "answer_text": "The largest physical size of what one might call flexible, would be an 8″ size with 1.2 Megabytes for one sided and 2.4 Megabytes for a two sided disk. These were used mostly in S-100 systems and others prior to the PC. There was a 5.25″ flexible floppy size that was also very popular, both single and double sided. This was what PC’s initially came with and was popular through the 1980’s. The largest storage non-flexible (floppy media inside a rigid case) would be a 3.5″ floppy, storing 2.88 Megabyte (but it never gained any general acceptance) and the popular type of that size was 1.44 Megabytes. Then there were various flavors of IOMega floppy disks with non-flexible cases that could store 5, 10, 100 (popular ZIP drive media) and 250 Megabytes. One of the early versions was the Bernoulli box, which media was roughly about 8″x11″x1/2″ and could store 5, 10 or 20 Megabytes. Also there was a Superdisk floppy that could store 120 megabytes, but was never popular. For additional info see Floppy disk - Wikipedia ",
            "date": "Updated July 16, 2019",
            "views": "78",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Calin Ceteras",
                    "user_href": "/profile/Calin-Ceteras"
                },
                {
                    "user_id": "Kilian Hekhuis",
                    "user_href": "/profile/Kilian-Hekhuis"
                },
                {
                    "user_id": "Swapnil Rathi",
                    "user_href": "/profile/Swapnil-Rathi-15"
                },
                {
                    "user_id": "Thomas Rush",
                    "user_href": "/profile/Thomas-Rush-3"
                },
                {
                    "user_id": "Andre Leong",
                    "user_href": "/profile/Andre-Leong"
                },
                {
                    "user_id": "Thomas F. Kristensen",
                    "user_href": "/profile/Thomas-F-Kristensen"
                },
                {
                    "user_id": "Leonid S. Knyshov",
                    "user_href": "/profile/Leonid-S.-Knyshov"
                },
                {
                    "user_id": "Adlai Armundsen",
                    "user_href": "/profile/Adlai-Armundsen"
                },
                {
                    "user_id": "Barry Rountree",
                    "user_href": "/profile/Barry-Rountree"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Lim",
                "href": "/profile/Nathan-Lim-24"
            },
            "answer_text": "The largest size floppy disk is 8 inches.  In order: 8 “, 5 1/4”, 3 1/2″ floppy disks. Copied from Wikipedia, used under the act of Fair Use. 8 inch floppies could hold a whopping 110 kB if data! (Wow, astronomical, right!?) Of course, no-one really uses any of them anymore, except me :). Now all my files are safe in my floppy disk collection. ",
            "date": "Answered November 6, 2017",
            "views": "52",
            "upvotes": "0"
        }
    ]
}