{
    "title": "What are the factors that affect a country's currency? - Quora",
    "tags": [
        "Monetary System",
        "The Future",
        "Foreign Exchange Market",
        "Currencies",
        "Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simon Coulter",
                "href": "/profile/Simon-Coulter-1"
            },
            "answer_text": "The currency of a country can be affected by several different things.  First, we should discuss a pegged currency. A pegged currency will  fluctuate in value in the same way that it's associated currency or  commodity will. A smaller country may peg their currency to one of the  major currencies or even to gold. A floating currency behaves much  differently and can be affected by several external factors. Inflation, long-term projections, and interest rates are all driving  factors in the movement of currency value. Statistics like unemployment  may also play a role. Local financial institutions adjusting interest  rates can encourage participants to buy or sell in large quantities.  These are just a few specifics that most often have an affect. Currency  value on the market is driven primarily by the people participating. The  participants' reaction to these events are mostly responsible for the  driving movements. That means there is always the possibility of an  under or over-reaction that is driven solely by their actions.  It is very important to keep in mind that there are no absolutes when  gauging reaction to a catalyst. A drop in an interest rate should  encourage more spending but that does not necessarily mean it will  happen. Additionally, it can take more or less time to happen than may  be expected. News events for a forex trader present some very difficult conditions.  Certain events can cause massive surges or an erratic whipsaw action  that makes it very difficult to trade. Scalpers tend to thrive in these  kinds of conditions though. Long-term traders who hold open positions  for a day or more would do well to stay out of the market before a major  news item that is scheduled for a country's currency. For example,  Non-Farm Payrolls in the United States almost always causes major  fluctuations. We would want to avoid having an open position with the  USD for the announcement. How do we keep track of all of these news announcements? The simple  answer is- we do not. There are several forex websites that offer a  calendar of important events with projections, historical data, and an  indicator of how likely it is for the announcement to create major  turbulence. Find one and use it well! If you want to read more Forex related articles from me, head over to MahiFX Quora Blog ",
            "date": "Answered February 12, 2013",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Torsten Surhammar",
                    "user_href": "/profile/Torsten-Surhammar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Javier Lodeiros",
                "href": "/profile/Javier-Lodeiros"
            },
            "answer_text": "In short, Currency value depends on Supply and demand. Currency traders analyse both political and economic data of a country to decide if they want to sell or buy a currency, if the trader buy more currency than that being sold, the value goes up, if they sell more than that being bought, the value goes down. The reasons behind why people want to sell or buy currency can be political or economical. Political reasons: Forecasted economic weakness or strength: if a country makes an economic decision that could translate in a weakening of the economy, usually people start selling the currency, making its value go down. If the measure could strengthen the economy, people buy the currency and make its value go up. We can use the UK as an example, in 2016 when they decided to leave EU, the value of the GBP went down almost instantaneously, later when they decided to postpone the leaving date and make a softer transition, the pound recovered.external factors: Most currencies’ value float freely compared to other currencies’. this means that if a measure like the ones explained before are taken in a country and the value of that currency fluctuates, other currencies, when compared to that one, will fluctuate as well.Economic factors: countries can take plenty economic measures to manage their economy, i will just mention the two most usual in my opinion. Interest rates: Countries can change the interest rates they will pay to investors who invest in their economy, if a country raises interest rates, this means a higher profit for investors, which attracts them, making the currency value go up. if the interest rates fall, so does the currency value.Money printing: sometimes countries need to print extra bills, to inject liquidity to the economy. This measure adds more bills to the economy but doesn't change anything else, so, now you have more paper to pay for the same thing. This tends to drive inflation up, devaluating the currency.",
            "date": "Answered July 22, 2020",
            "views": "143",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quinn Godfrey",
                    "user_href": "/profile/Quinn-Godfrey-3"
                },
                {
                    "user_id": "Kari Syrja",
                    "user_href": "/profile/Kari-Syrja"
                }
            ]
        }
    ]
}