{
    "title": "What's one of your best ideas or inventions that never made it big? - Quora",
    "tags": [
        "Technological Innovation",
        "History of Inventions",
        "Inventors",
        "Startup Ideas",
        "Innovation",
        "Invention and Inventions",
        "Entrepreneurship",
        "Science",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Szlaga",
                "href": "/profile/Matt-Szlaga"
            },
            "answer_text": "Recently mentioned on the Detroit News for their work relabelling absentee ballot envelopes, Lutz Academy is a school for Adults with Special Needs. I am quite proud to say I once worked there, and in addition, came up with a little invention we thought was ‘not too shabby’ - if I said so myself! :) Actually, it wasn’t a bad idea in fact - no not at all! We had TONS OF FUN because IT WAS AWESOME!!!  Although it didn’t “make it big”, this was definitely one of those small things that counted. Famous with my crew 9 years ago… I’ll never forget: THE HOMEMADE TABLE-TOP BASKETBALL GAME!!!  Students in competition is something priceless to me, and seeing their faces light up said it all - The invention was going to be a hit. Many students have severe physical disabilities such as Cerebal Palsy, so leveling the playing field with any table game is always a bonus… This one did exactly that, allowing many access to play an additional ‘sport’. Since the ones with Asperger’s were “quiiiiite particular”, I knew when it came to detail, there couldn’t be any shortcuts. We were going to make something high-quality, so we set out on a mission and rallied our troops.  Now, we did have have a home-made hockey game already that we loved to play, but it was getting hogged all the time! So, we needed to create another game, and not just another boring table game, but one with some pizzaz! A fun game, a game that if played too intensely might poke someone’s eye out! The type of game that would chuck, that could chuck… “Wood Blocks!” And so we began to build the game like our destiny, and the idea began to come alive!: Engineers were called in to discuss design plans, and introduce their prototypes. Researchers went to task, collecting information about dinosaurs, cars, DiNozzo from NCIS, and Rob and Big. Artisans were called in to paint and design gaming materials.  Made of 3/4 inch pine board (one side finished) and about 2/3 the size of small table-hockey table, The Table Top Basketball Game was to be made “double-sided”, to play toward the middle. Different ideas were tested. Eventually, I came up with “this”.  A central hoop would decorate itself as being surrounded by basketball nets constructed out of paint stirs. Printed hoops and nets wrapped around a 3 inch cardboard tube and glued to the surface. Either side of the court (the half-court layouts) was reversed. Printing the surface of a court to run like this: [→I*I←] After spray gluing the fans and “realistic” court top image, all it needed was about 3-4 more days of my tinkering, and EIGHT COATS of clearcoat spread to make it last, look and feel like a real sealed gym floor. It was perfectly imperfect in every way.   The rules - 1:1 or 2:2. One can share turns and switch sides if 3 players are involved, or easier verse 2:1. The opportunity to take 2 and 3 point shots exists (Although most count by ones, and if not can stack to see “more\"). Each player is given a “shooter\". The shooters are made from Lowe's paintsticks and mounted on wooden chip chips, each attached to a block about 3 x 6x 1/2 inch deep. Reversing the hinges on the chip clips to face outward prevents the launch board (paint stir) from sliding sideways or clips from detaching. Two clips are necessary for the amount of torque needed to fling the blocks to make shots past the “half-way” point. Once glued together, the paintsticks were then tested and cut to size, each marked for their “sweet spots\". To avoid backfiring off into their face or at opposing players, we made stoppers by supergluing down a tootpick at the end of each launcher stick. Scoring can work a few ways, but the one we liked most was played like chess. If a player misses a shot, the other player can keep the others “ball” until one side runs out. Another way was by lining up or stacking their successful shots. Either way, the point system was one that is concrete. The game also could be played 1 player for practice, which was a huge benefit. If I had to describe it in a word, it was nothing less than “bombastic”! Clearly, chucking multiple flying colored wooden blocks was the way to go. Making good shots meant centering the launchers and blocks perfectly, so accuracy was everything. The sizing of the gamepieces, the board, and the ‘net’ were perfect, leaving just enough room to make it challenging, yet easy enough for everyone - to play!  When I came to visit a year later, they were still playing it! It was just one the coolest games! :) Notice the block flying in the air? It was a PERFECT SHOT!!!  :) And we all lived happily ever after. -The End. Thanks for the question! ",
            "date": "Updated May 6, 2019",
            "views": "17",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bill Cox",
                    "user_href": "/profile/Bill-Cox-98"
                },
                {
                    "user_id": "Enzo Armitage",
                    "user_href": "/profile/Enzo-Armitage"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neale Gray",
                "href": "/profile/Neale-Gray"
            },
            "answer_text": "It did make it big, but not big for me. I created The Virtual School, an online learning platform. I wrote all the code, it took me a couple of years, all on my own, and I did actually end up with a working project. But I was running it from home on a home built web server, I didn’t have the bandwidth or the budget or the server racks, etc that it would’ve needed. Now it’s a real thing, there’s several websites offering online learning, with courses, teacher grading, etc etc, and some lucky gits are making a fortune from them. Anyone fancy buying the code from me? ",
            "date": "Answered April 5, 2019",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vilzi Ciuli",
                    "user_href": "/profile/Vilzi-Ciuli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phil Allen",
                "href": "/profile/Phil-Allen-15"
            },
            "answer_text": "I invented a game called Titanic. A cafe latte is required, in a glass, with a layer of foam 3/4–1″ deep. Don’t stir, espespecially if the barista ‘layered’ it! Slowly add sugar so that a cone of it sits on the foam. It will absorb water from the foam, getting heavier. The idea is to get the most sugar (by weight) on the foam—and it’s wet, remember—before it breaks through the foam, crashing to the depths of the glass and creating a few seconds of explosive flourish .. ",
            "date": "Answered April 7, 2019",
            "views": "88",
            "upvotes": " Answer requested by Justin Skipper"
        },
        {
            "author_info": {
                "name": "Peter Klika",
                "href": "/profile/Peter-Klika"
            },
            "answer_text": "I designed a solar powered flashlight in 1979 but this was before LED technology. I used a xenon gas bulb but it made the flashlight too expensive and LED technology came along which was much cheaper. ",
            "date": "Answered October 29, 2020",
            "views": "188",
            "upvotes": "0"
        }
    ]
}