{
    "title": "What is haptic communication? - Quora",
    "tags": [
        "Haptics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Asesh Datta",
                "href": "/profile/Asesh-Datta"
            },
            "answer_text": "Haptic communication is a branch of nonverbal communication that refers to the ways in which people and animals communicate and interact via the sense of touch. 1. TOUCH GIVES US A SENSE OF PRESENCE 2. SENSORY EXPERIENCE HELPS US EXPLORE THE WORLD 3. HAPTIC FEEDBACK MAKES ACTION POSSIBLE 4. TOUCH IS ESSENTIAL TO EMOTIONAL CONNECTION AND WELLBEING 5. OUR SENSE OF TOUCH IS ASTONISHINGLY ACUTE 6. HAPTIC TECHNOLOGY IS THE NEXT BIG THING. Artificial Reality and Augmented Reality are coming up with haptic sensory generator. Regards ",
            "date": "Answered September 27, 2019",
            "views": "313",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kate Mae Allag",
                    "user_href": "/profile/Kate-Mae-Allag"
                },
                {
                    "user_id": "Rajul Abhani",
                    "user_href": "/profile/Rajul-Abhani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isla Fisher",
                "href": "/profile/Isla-Fisher-5"
            },
            "answer_text": "Communicating non-verbally involves visual cues (visual acuity), gestures (body language), paralanguage (intonation, pitch, speaking speed), oculesics (study of eye movement), chronemics (study of role of time in communication), haptics (communication through touch) and proxemics (study the use of space in communication). Non-verbal communication develops a social-emotional development from a childhood haptics, a non-verbal communication method that communicates through the sense of touch in humans and animals in the real world. ",
            "date": "Answered September 27, 2019",
            "views": "172",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rajul Abhani",
                    "user_href": "/profile/Rajul-Abhani"
                }
            ]
        }
    ]
}