{
    "title": "What online business analytics course do you recommend? - Quora",
    "tags": [
        "Business Analytics",
        "Analytics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vinod Sundaram",
                "href": "/profile/Vinod-Sundaram"
            },
            "answer_text": "Before taking on any business analytics course, a quick analysis on: 1) why you're planning to do a business analytics course? 2) What are your core strengths? This is very critical. You might have heard that business analytics is right in the middle of business (domain knowledge), statistics and core computing. If you feel, you have a strong base in any of two components, then a specialised course in Statistics or computer science should help. Else a you might want to take full fledged analytics course. Having said that, few of the course i think that might be useful. Analytics Edge - gives a fairly hands-on experience with statistical modelling in R, with real world examples.If you have a fair bit of statistics and computer background, you can try Harvard Data Science course, Coursera John Hopkins Data Science specializationIf you are a computer science student/programmer, then definitely Andre Ng's Machine Learning and Stanford Mining of Massive DatasetIf your requirement is a business knowledge, then there are many courses on MOOCs for marketing, finance, operations etc. ",
            "date": "Answered March 5, 2016",
            "views": "41",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mansi Soman",
                    "user_href": "/profile/Mansi-Soman-1"
                },
                {
                    "user_id": "Askhat Bolatkhan",
                    "user_href": "/profile/Askhat-Bolatkhan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phaniharam Kiran",
                "href": "/profile/Phaniharam-Kiran"
            },
            "answer_text": "Yes there are great courses availbale in coursera and edx where you can have free acess to materials and also earn a certificate if you pay and finish all the assignments and projects of it. There are many specializations related business analytics by prestigious institutions like university of pennsylvania,Wharton school of business,Duke,John Hopkins etc with various levels ranging from basic to advanced covering all aspects which are required to attain sufficient knowledge in the field . There are no pre requisites for these courses anyone who have interest can opt. ",
            "date": "Answered July 29, 2017",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rituraj Paul",
                    "user_href": "/profile/Rituraj-Paul-5"
                },
                {
                    "user_id": "Shriya Yerrabelly",
                    "user_href": "/profile/Shriya-Yerrabelly"
                },
                {
                    "user_id": "Khushi G Singh",
                    "user_href": "/profile/Khushi-G-Singh"
                },
                {
                    "user_id": "Jyoti Sharma",
                    "user_href": "/profile/Jyoti-Sharma-1021"
                },
                {
                    "user_id": "Prasanth",
                    "user_href": "/profile/Prasanth-295"
                }
            ]
        }
    ]
}