{
    "title": "What is the fastest electric car in 2020? - Quora",
    "tags": [
        "Fastest Electric",
        "Electric Cars",
        "2020 (year)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tejas Sharma",
                "href": "/profile/Tejas-Sharma-26"
            },
            "answer_text": "This is a question of some debate: If we talk about top speed: Tesla Roadster has a top speed of over 250mph, which is greater than the top speed of Rimac c_2 and Pininfarina Battista, All set out to come this year If we talk about the fastest acceleration(0–60mph): Rimac c_2 has a 0–60 time of 1.6 seconds which is the fastest acceleration on the planet However, these figures are all claimed and have not yet been proven completely( as these cars are yet to come out). If we talk about production cars, then the Rimac c_1 with a 0–60 mph time of 2.5 seconds and a top speed of 227 mph is the fastest electric car in the world. Though the Tesla Model S P100D has a quicker 0–60mph time of 2.3 seconds, its top speed is electronically limited to 150 mph. ",
            "date": "Answered February 9, 2020",
            "views": "173",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Kulogo",
                    "user_href": "/profile/Tim-Kulogo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Roane",
                "href": "/profile/Jerry-Roane"
            },
            "answer_text": "Cars in the state of Texas can drive 85 mph. Every car on the road can go that speed if you push the pedal to the floor and you are on toll road 130 near Austin. Other than that road top speed is 80 mph. There is a new electric system coming that will legally go 180 mph but so far TxDot has dragged their knuckles, I mean their heels. ",
            "date": "Answered February 10, 2020",
            "views": "155",
            "upvotes": " Answer requested by Adrian J. Zarazua"
        },
        {
            "author_info": {
                "name": "Robert Swanson",
                "href": "/profile/Robert-Swanson-65"
            },
            "answer_text": "Tesla Model S P100D Performance 0–60 mph in 2.5 seconds ",
            "date": "Answered April 17, 2020",
            "views": "22",
            "upvotes": " Answer requested by Tessa Gulley"
        }
    ]
}