{
    "title": "What is the difference between a gateway and a router? - Quora",
    "tags": [
        "Gateways",
        "Wireless Routers",
        "Routers (networking)",
        "Wi-Fi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandeep Vinjarapu",
                "href": "/profile/Sandeep-Vinjarapu"
            },
            "answer_text": "Gateway: A device which provide connectivity between two or more network segments. It is usually a computer that runs the gateway software and provides translation services. This translation is a key in allowing different systems to communicate on the network. Router: A device which can connect two or more network segments. These are intelligent network devices which can store data. With the day stored they are able to determine the best path for data transfer. Routers operate at the OSI layer. Let's see the differences between gateway and a router. Gateways connect two networks of different protocol. Routers ensure that data packets are transferred to right address. Gateways doesn't support dynamic routing while routers support it. Gateways works by differentiating what is inside network and what is outside network. Routers works by installing routing information for various networks and routes traffic based on destination address. I hope the answer will be helpful. Cheers!!!. ",
            "date": "Answered August 20, 2019",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deepika Rani",
                    "user_href": "/profile/Deepika-Rani-44"
                },
                {
                    "user_id": "Keshav Garg",
                    "user_href": "/profile/Keshav-Garg-114"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vamshi Reddy",
                "href": "/profile/Vamshi-Reddy-4"
            },
            "answer_text": "Gateway is also a router, which forwards the traffic of a subnetwork to other or to the internet. Gateway acts as a intermediary device between computers in the subnet with other computers outside the subnet. All the traffic to the outside of subnet must go through the gateway. Gateways are also useful in forwarding traffic from one ISP (AS) to the other, those are called border gateways. When you are connected to the access point, all the systems which are connected to the same access point are in same subnet and can directly communicate. When you make a request to some server out there in the internet, then your packet will go through the configured gateway which is provided by your DHCP server. ",
            "date": "Answered May 14, 2014",
            "views": "458",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Sullivan",
                    "user_href": "/profile/Michael-Sullivan-46"
                },
                {
                    "user_id": "Cambiel Mebahiah",
                    "user_href": "/profile/Cambiel-Mebahiah"
                },
                {
                    "user_id": "Piyush S. Zambad",
                    "user_href": "/profile/Piyush-S-Zambad"
                },
                {
                    "user_id": "Yash Chaudhary",
                    "user_href": "/profile/Yash-Chaudhary-29"
                },
                {
                    "user_id": "Hongbo Wang",
                    "user_href": "/profile/Hongbo-Wang-10"
                },
                {
                    "user_id": "Joel Padamadan",
                    "user_href": "/profile/Joel-Padamadan"
                },
                {
                    "user_id": "Nilanjana Lodh",
                    "user_href": "/profile/Nilanjana-Lodh"
                },
                {
                    "user_id": "Ajithkumar Sekar",
                    "user_href": "/profile/Ajithkumar-Sekar"
                },
                {
                    "user_id": "Girish DS",
                    "user_href": "/profile/Girish-DS-3"
                },
                {
                    "user_id": "Mugdhe Gugri",
                    "user_href": "/profile/Mugdhe-Gugri"
                }
            ]
        }
    ]
}