{
    "title": "What will the next great invention be? - Quora",
    "tags": [
        "Innovation",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Snehal",
                "href": "/profile/Snehal-95"
            },
            "answer_text": "Everyone know “HEALTH IS WEALTH “ right. So have you ever imagined you were really sick and just walk into a room and lie down and a HEALTH machine (i.e you can give any fancy name you want unless you really invent such thing) it will detect what is really causing you sick with minutes who know even fraction of second and recommends you the most appropriate prescription or even injects you the right medicine so within few minutes you are walking out of the room cured, like nothing happened .. Imagine even deadlier disease like cancer or deadlier virus, just walk-in get scanned, get detected and get prescribed and cured… Just like you buy a bp monitor who knows you can buy a personal health machine install it right in your room and get cured anytime (who is still thinking of going to doctor profession ;) ) Let’s take into another level, I am big fan of sci-fi movies Imagine some 60 years back a sci-fi movie a person talking someone else on a device with NO wires attached to it, some people used to laugh at that time right, will they laugh now talking on a mobile phone :) It’s the same thing I am talking right here, right at the time a baby is born (this will be 50 or 100 years from now) the first procedure is to insert a permanent personal health bot/chip into the baby body which is harmless or visible to anyone, which will record all details about the health of the body at any given point of time, even record and alert micro details of the first deadly virus the body is getting contact with and the very next action to be taken so the body doesn’t get infected more (even better the bot or chips have internal capability built into to kill such virus itself and just send a SMS to you a virus found and killed), or say the very first cancerous cell is your body so an immediate alert to you to take immediate action, how does this sound (forget common cold and cough they are history with such tech).. some may laugh at it now but its going to be reality sooner or later.. the people who are bringing this to reality are going to be god damn rich… I do have 1000s of such great ideas anyone who want’s to implement or fund me let me know :) ",
            "date": "Answered May 29, 2017",
            "views": "24",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sara Hilary",
                    "user_href": "/profile/Sara-Hilary"
                },
                {
                    "user_id": "Kumar Bintu",
                    "user_href": "/profile/Kumar-Bintu-1"
                },
                {
                    "user_id": "Frederick Mikkelsen",
                    "user_href": "/profile/Frederick-Mikkelsen"
                },
                {
                    "user_id": "Hardik Dodiya",
                    "user_href": "/profile/Hardik-Dodiya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Winklevoss",
                "href": "/profile/Colin-Winklevoss"
            },
            "answer_text": "I humbly present the Dyson Sphere…  (The Dyson Sphere) Even if we could construct a Dyson Sphere humanity would be capable of anything. The structure is a closed shell around a star and it harnesses the star’s energy. The Kardashev Scale describes the level of technological advancement as civilization has reached. If they can harness all the energy from their planet they are level one. Harnessing all the energy in the solar system is Stage 2. Harnessing all the energy in your galaxy is Stage 3. It is assumed that it is impossible to reach all the energy in the universe* which would be a stage 4. A Dyson Sphere would catapult us to Stage 2.  (Harnessing all the energy in the Milky Way is the final stage of humanity’s technological innovation) It happens that only 1 km squared of solar panels placed in the correct place in the Sahara can power the earth 11 times over. Imagine what a Dyson sphere could do.  (Freeman Dyson) The concept was supported by the reputed Freeman Dyson (hence the name) but there are severe problems with it. Interestingly there physics of the structure means that once it is in place it would be perfectly stable, but the problem is getting it as such. All in all I would say the Dyson Sphere definitely qualifies as one of the coolest inventions ever if we could pull it off. *Being able to harness all the energy in the universe would defy the Second Law of Thermodynamics as it would imply that there is no entropy. ",
            "date": "Answered October 23, 2020",
            "views": "255",
            "upvotes": "0"
        }
    ]
}