{
    "title": "What's the relation between Sanskrit and technology? - Quora",
    "tags": [
        "Sanskrit (language)",
        "Linguistics",
        "Language"
    ],
    "response": [
        {
            "author_info": {
                "name": "Subrahmanian Ramachandran",
                "href": "/profile/Subrahmanian-Ramachandran"
            },
            "answer_text": "From 1st century CE to 12th or 13th century CE is known as dark ages of science in the West. Things gained momentum only after Copernicus. During this period India was comparatively technologically advanced. The areas of of significant progress - linguistics, textiles, medicine, astronomy. During the first millennia Sanskrit served as the lingua franca for a major portion of subcontinent and language of the elites resulting in a number of compositions and books in Sanskrit. These were not merely epics and religious works. Susruta samhita is the worlds first work on surgery. Charaka was one of the earliest to write on medicine and is still widely followed in and outside India. Aryabhattiyam and Mahabhaskariyam belonged to this period. Except perhaps Arab, I think nowhere else was expertise to calculate the position of the planets for any past or future date. This was at a time when, let alone computers or calculators, even paper was not there for doing calculations. Decimal system to represent fractions was not there. The results of all these including logarithmic tables were composed in metrical Sanskrit, using bhuta sankhya and katapayadi sankhya to represent numbers. Technology for that period was high in India and Sanskrit helped in recording it for the benefit of posterity. Amarkosa a thesaurus was composed in Sanskrit in 4th century CE, and systematization of grammar rules (from already existing other works) was by say 3rd century BC, while English grammar and dictionary are hardly 200 to 300 years old. ",
            "date": "Answered September 16, 2018",
            "views": "440",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Minal Patel",
                    "user_href": "/profile/Minal-Patel-284"
                },
                {
                    "user_id": "Bala Subramanian A",
                    "user_href": "/profile/Bala-Subramanian-A"
                },
                {
                    "user_id": "Pragyandeep Mohanty",
                    "user_href": "/profile/Pragyandeep-Mohanty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Bhonsle",
                "href": "/profile/निखिल-भोंसले-Nikhil-Bhonsle"
            },
            "answer_text": "What's the relation between Sanskrit and technology? There is one Backus-Naur form[1] notation technique used to describe a computer language syntax in a “context free” way. The basic idea of this technique can be traced back to the work of Panini[2][3] . There are computer languages like ALGOL 60 that are based on Sanskrit grammar rules[4] .  समः [samh, equal/perfect/balance] + कृत् [krut, done]= संस्कृत [sanskrut, that which is perfected] Now, learn the following related words carefully. संस्कार [sanskAr, purification/conditioning], संस्कृत [sanskrut, a perfected language], संस्कृती [sanskruti, culture/civilization], सुसंस्कृत [susanskrut, well conditioned/civilized], असंस्कृत [asanskrut, uncouth/uncivilized]. Sanskrit is a conditioning technology for human mind. Each word in Sanskrit language is oozing with illuminating brilliance of Aryan values and knowledge. According to Swami Vivekananda in his book ‘A rousing call to Hindu Nation’[5] , learning Sanskrit language will only strengthen the foundation of a progressive society. Great learned people like Ramanuja[6] , Chaitanya[7] , Kabir, Buddha etc. did open the gates of spiritual knowledge with the commoners, peasants. But they didn’t teach Sanskrit to the masses. This was a mistake. Bhagwan Buddha used the language of the masses to spread the greatest values of Dharma. This was a good thing, but Sanskrit language should have reached the people as well. The knowledge did propagate, but the संस्कृती [sanskruti, culture/civilization] didn’t. Only knowledge is not enough to counter foreign invasions. That power lies in a civilization. Sanskrit is the key to that great Indian civilization Swami Vivekananda dreamed about.  Technology is the obvious path ahead for Mankind. While treading on this path with passion, should we lose our thousands of years old legacy of knowledge and wisdom? That is the question. How do we intend to condition our future generations? As humans or as machines? That is the question. Also see, Nikhil Bhonsle's answer to Why Sanskrit is considered as future language of computers? Footnotes[1] Backus–Naur form - Wikipedia[2] Pāṇini - Wikipedia[3] Panini-Backus[4] Why Sanskrit? in Computational Linguistics - Part 1[5] Rousing Call to Hindu Nation - Wikipedia[6] Ramanuja - Wikipedia[7] Chaitanya Mahaprabhu - Wikipedia",
            "date": "Answered December 1, 2018",
            "views": "660",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Madhavi Bhonsle",
                    "user_href": "/profile/Madhavi-Bhonsle-1"
                },
                {
                    "user_id": "Anubhava Jhā",
                    "user_href": "/profile/Anubhava-Jhā"
                },
                {
                    "user_id": "Goutham R",
                    "user_href": "/profile/Goutham-R-22"
                }
            ]
        }
    ]
}