{
    "title": "What are the functions of school libraries? - Quora",
    "tags": [
        "School Libraries",
        "Public Libraries",
        "Libraries and Librarianship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laura Skaggs",
                "href": "/profile/Laura-Skaggs"
            },
            "answer_text": "School libraries have really evolved over the past 25 years, and they vary depending on the needs and climate of their school environment. I work at a public, suburban middle school in Kansas. Here’s a list of some of the functions of our library: It has a large collection of fiction and non-fiction books available for check-out. The ELA teachers often give students an opportunity to peruse and choose books of their interest level for “Free Read Friday.”It has two spaces for teachers to reserve and teach their classes. These spaces are equipped with AV equipment and easy access to books and technology that are not in each individual classroom. The spaces are also larger than our classrooms and provide room for students to work in groups or for two classes to combine and collaborate.Our librarian teaches lessons that integrate technology or literacy into the general curriculum. For example. when students were studying the Holocaust, she handpicked about 2 dozen quality books about the topic, gave summaries of each, and helped students choose one that best fits them. She has taught students how to use specific apps and websites for research or content creation as well.There’s a maker space filled with materials and tools for students to make and take home their creations. Sometimes guests come in to teach a mini class on sewing or paper craft, for instance. I had one student design and 3D print his own teapot in the maker space. Kids often use the maker space for projects in their classes. One of the math teachers this year collaborated with the library so that students could design, create, and sell spirit wear using Cricut machines.Our library is open about 30 minutes before school and an hour after school. Before school is a more traditional, quiet study setting, but after school, the library is buzzing with kids doing all sorts of activities. Some students are working on projects together or studying for tests. There’s a small conference room with white boards and a meeting table for a group of kids to work together. Other kids are creating in the maker space. There are kids playing games, socializing, reading, and connecting with the library aides. The library provides a welcoming setting for all kinds of kids, including those who may not have a place to go or friends to hang out with outside of school.There’s a collection of board games as well as areas for students to play video games together. A gaming club, a board game club, and a creative writing club meet regularly. A few Fridays out of the year, the library stays open late into the evening for pizza and board game fun. There’s a book club that meets monthly during lunch as well. Students share about the books they’ve been reading from the list over pizza, and also get the privilege of helping the librarian choose books for the library.The library has carts of laptops and iPads available for teachers to check-out and use in their classrooms. Our librarian regularly provides professional development to staff on ways to use technology effectively in the classroom, and PD meetings are frequently held in the library’s spaces. The library also houses a collection of curriculum and higher learning resources for staff.Our library is not just for reading and studying. It is an integral part of our school community. ",
            "date": "Answered July 7, 2019",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Morenon",
                    "user_href": "/profile/Sarah-Morenon"
                },
                {
                    "user_id": "Pinal Patel",
                    "user_href": "/profile/Pinal-Patel-101"
                }
            ]
        },
        {
            "author_info": {
                "name": "Betty Whipp Snyder",
                "href": "/profile/Betty-Whipp-Snyder"
            },
            "answer_text": "First, know that every school is different, and administrators can add “other duties as assigned” at any time. They can also walk into your room and change your curriculum on a whim, depending on their opinion - especially as to - “ will this help students on the test?” That said, I saw my main functions - 1. To connect the reader to books that interest them. 2. To share great read alouds - read with enthusiasm to inspire kids to want to read with fluency. 3. To teach age appropriate research - how to find the information they needed for school, and what they wanted for personal use. 4. How to cite sources - and choose valid sources. 5. To maintain the library by shelving, repairing, ordering and processing appropriate reading materials. 6. To implement current technology: computers, I pads, e-books, databases and internet sources. ",
            "date": "Answered February 2, 2019",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert McAuley",
                    "user_href": "/profile/Robert-McAuley-7"
                },
                {
                    "user_id": "Ida Schaeffer",
                    "user_href": "/profile/Ida-Schaeffer"
                }
            ]
        }
    ]
}