{
    "title": "What is the better way to learn quantum computing? - Quora",
    "tags": [
        "Quantum Computers",
        "Quantum Information"
    ],
    "response": [
        {
            "author_info": {
                "name": "Venkat Panchadi",
                "href": "/profile/Venkat-Panchadi"
            },
            "answer_text": "Quantum Mechanics deals with the most basic structure of the universe. The rules of computation of properties of the fundamental particles is highly counter intuitive, they completely different from our well known classical world. The properties of spacetime in quantum regime highly fluctuating leading to abnormal experimental outcomes.  The basic idea behind the construction of quantum computers is that, they can be extensively utilized to unriddle most of the present day problems of prime factorization and tedious optimization problems, which cannot be resolved by our classical computers we use today (even though they helped us immensely) . But quantum computers are very fast than our present day classical ones and can resolve these problems by using quantum phenomena like superposition, entanglement, tunneling etc. Quantum Algorithm.  If we want to understand the quantum computing (algorithms) , we can achieve it by learning linear algebra and should understand Deutsch-Jozsa algorithm, quantum teleportation, Grover's algorithm, Shor's algorithm, and adiabatic quantum computing( NASA & D-Wave). If we want to have a better understanding of what the linear algebra is modeling, we need to study a bit more math and physics. It's tough to digest quantum mechanics, if we don't have at least a little background in classical mechanics, so we should know very clearly deep consequences of position, momentum, energy, action, Hamiltonian,Lagrangian, potential, etc.  Quantum mechanics is mostly about the Schrodinger equations ( both autonomous and non autonomous)(evolution equation)/Picture, Heisenberg picture ( System evolution in space and time), Perturbations of time dependent and time independent, a variant of the wave equation. These equations are \"differential equations\" as they involve to make use of the differentiation operators from calculus. It is better to have a fundamental idea of linear, non-linear optics and EM Theory. In addition that we need to have Basic study and analysis of algorithmsFourier & Laplace TransformsMatrices ( Advanced)Functional analysisTheory of computational complexitySolid State PhysicsExotic states of matter( Topology)Holography (Advanced)We need to study books on Introduction to Quantum Computing and Theory of Processing of Quantum Information. Thank You :) ",
            "date": "Answered October 4, 2017",
            "views": "928",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rituraj Basu",
                    "user_href": "/profile/Rituraj-Basu-3"
                },
                {
                    "user_id": "Sishitha Pilli",
                    "user_href": "/profile/Sishitha-Pilli"
                },
                {
                    "user_id": "Debiprasad Ghosh",
                    "user_href": "/profile/Debiprasad-Ghosh"
                },
                {
                    "user_id": "Abdeali Motarwala",
                    "user_href": "/profile/Abdeali-Motarwala-1"
                },
                {
                    "user_id": "Nitesh Prabhu",
                    "user_href": "/profile/Nitesh-Prabhu-3"
                },
                {
                    "user_id": "Vladislav Zorov",
                    "user_href": "/profile/Vladislav-Zorov"
                },
                {
                    "user_id": "Scott M Gardner",
                    "user_href": "/profile/Scott-M-Gardner"
                },
                {
                    "user_id": "Hanshal Nautiyal",
                    "user_href": "/profile/Hanshal-Nautiyal-1"
                },
                {
                    "user_id": "Padma Priya",
                    "user_href": "/profile/Padma-Priya-264"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aly T. Ibrahim",
                "href": "/profile/Aly-T-Ibrahim"
            },
            "answer_text": "Oh that is easy. Take Quantum Information Science I, Part 1 on edX offered by MITx. It is archived but you can view the lectures and videos and do the ungraded homework. It is followed by parts 2 and 3, and then Quantum Information Science II also composed of 3 parts. If you don’t want anything this formal, just watch these videos by the Google AI Quantum Lab to get a non-comprehensive idea of what is happening.      Enjoy! ",
            "date": "Answered April 20, 2019",
            "views": "298",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ali Sefidmouy",
                    "user_href": "/profile/Ali-Sefidmouy"
                },
                {
                    "user_id": "Manish Ranjan",
                    "user_href": "/profile/Manish-Ranjan-81"
                },
                {
                    "user_id": "Ralph Sawyer",
                    "user_href": "/profile/Ralph-Sawyer-3"
                }
            ]
        }
    ]
}