{
    "title": "What Star Trek technology would be the most useful today? - Quora",
    "tags": [
        "Star Trek (creative franchise)",
        "Science Fiction (genre)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Ghat",
                "href": "/profile/Frank-Ghat-1"
            },
            "answer_text": "Without a doubt either Replicators or their fancy matter-antimatter reactors. Replicators make scarcity obsolete, so long as you have energy to power it. The reactors provide such a massive increase in energy output that there is no telling what we could pull off. Either one of these would fundamentally change everything from that point forward. Probably Replicators more than reactors due to the fact you can now create exotic materials with ease so literally EVERYTHING could now be made out of whatever you wanted (solid gold toilets, silver bullets, transparent jade t.v. sets, etc.). ",
            "date": "Answered September 29, 2018",
            "views": "162",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "L. Dale Richesin",
                    "user_href": "/profile/L-Dale-Richesin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Spenny",
                "href": "/profile/Jason-Spenny"
            },
            "answer_text": "In order, whatever the clean energy source is that everything runs off of, replicator, transporter. I leave warp drive off because even if we had warp, how useful is it really? The energy in star trek is shown as basically limitless. Coupled with replicator, you are now post scarcity. With transporters, you have eliminated almost all sources of strife. You could get awful close to utopia with those 3. And from them, you can figure out warp drive. ",
            "date": "Answered September 29, 2018",
            "views": "121",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Rolfe",
                    "user_href": "/profile/Daniel-Rolfe-1"
                },
                {
                    "user_id": "John Hardegree",
                    "user_href": "/profile/John-Hardegree"
                }
            ]
        }
    ]
}