{
    "title": "What is a home automation system? - Quora",
    "tags": [
        "Home Security Systems",
        "Smart Home (tech category)",
        "Home Security",
        "Automation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ria Rakshit",
                "href": "/profile/Ria-Rakshit"
            },
            "answer_text": "Home autonation is converting your existing home into a complete smart home…the home automation system provides complete e security to your home and also contributes to the concept of green building Imagine controlling all the electronics at your home over a single mobile app from anywhere across the globe, setting up timers for your ac to go on, lights set as per your mood, your fav music playing while you drive into your house after a long tiring day!!! Well that is what home Automation is in a basket! The basic level of Automation is as mentioned below: Biometric lock for entry Video door phones Home Security system: Security Cameras ( which can be viewed over a mobile app across the globe), glass break detectors, security sensors, intrusion alarm systems Lighting controls and curtain controls: where you can operate your lights, dimmers, motorised curtains using a mobile app from across the globe…it also includes motion sensors or microwave sensors where the light of an area where it is installed to operate only during the presence of a person and helps in energy conservation IR control: using IR emitters you would be able to control all your IR based devices using a mobile app…whether it's ur ac, Tv, home theatre, Blu ray player, set top boxes etc Universal Interface: using UI you are able to have all connected devices feedback over a mobile app and all your devices can be controlled using only one single application instead of individual apps to control your house.. Using UI you also will be in a position to get status feedback which helps you know the kind of utilisation of energy happening at your home and control your home electronics! ",
            "date": "Answered June 16, 2017",
            "views": "401",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Malika Pathak",
                "href": "/profile/Malika-Pathak-2"
            },
            "answer_text": "A home mechanization framework is a mechanical arrangement that robotizes generally electronic, electrical and innovative assignments in a home. It utilizes a blend of equipment and programming advancements that permit the control and the executives of gadgets and apparatuses in a home. Home robotization is a system of equipment, correspondence and electronic interfaces that work to incorporate regular gadgets through the Internet. Every gadget has sensors and is associated through WiFi, so you can oversee them from your cell phone or tablet, regardless of whether you are at home or miles away. Home mechanization frameworks are utilized to control inside and outside lights, heat, ventilation, home cooling, to close or open entryways and doors, to control electrical and electronic gadgets, and so forth., utilizing different frameworks. control with suitable sensors. For some individuals, mechanization implies producing computerization. ... Instances of fixed computerization incorporate machining move lines in the car business, programmed get together machines and certain compound procedures. ",
            "date": "Answered March 3, 2020",
            "views": "24",
            "upvotes": "0"
        }
    ]
}