{
    "title": "What is the point of 5g if 4G works fine? - Quora",
    "tags": [
        "Long Term Evolution (LTE)",
        "5G (wireless communication)",
        "4G (wireless communication)",
        "Telecommunications",
        "Wireless Technology",
        "Cellular Service Providers",
        "Wi-Fi",
        "Mobile Technology",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeremy Johnson",
                "href": "/profile/Jeremy-Johnson-318"
            },
            "answer_text": "Very good point. We should also be using 2007 phones and computers running windows 98 because why bother to advance technology if what you have works ok. If the horse and buggy works fine then why even invent the automobile. 5G is needed to support the ever growing needs as more and more people switch to having phones only and no wifi connection.The significantly lower latency (signal delay) will be needed for us to have fully autonomous cars, and the other things that the future will require. You dont build next generation infrastructure for last years needs you build it for the needs you think you will need 5 years latter. ADDED : Now over my 15 year IT career I have learned from my youthful ignorance and blind enthusiasm. Dont pay extra money to be a guinie pig or waste money on the most bleeding edge. When 4K tvs first came out they were $25k, and 3 years latter once there was any 4k standards and content, those super expensive TVs couldnt even play it. If I did live in a city with 5g deployments I would not be rushing out to pay top dollar to get 5g phone and plan. I would at least wait for the Q3 Q4 2020 phones. ",
            "date": "Updated July 29, 2019",
            "views": "147",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Bueno",
                    "user_href": "/profile/John-Bueno-13"
                },
                {
                    "user_id": "Kurt Behnke",
                    "user_href": "/profile/Kurt-Behnke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Art Jones",
                "href": "/profile/Art-Jones-6"
            },
            "answer_text": "5G is a hard sale, because it is expensive, offers operational advantages to business, takes a long time to deliver, and customer benefits are not available without devices like driverless cars. The details: Expensive: Our ISP and cellular rates will grow 2 times, 3 times higher. PLUS purchase new devices for phone, TV, laptop, Desktop, Tablets, …PLUS the State-city-county costs for the new telephone poles.Operational advantages: You move into a new apartment, you may call the cable company and get hooked up in a day, not a week.Takes a long time: Imagine ATT, Verizon, and Spectrum, each wiring 600 antennas to telephone poles to replace one 4G antenna. Do this all across the country. It will take more than 10 years. Some rural areas will likely stay on 4G.Driverless cars: Will work only where it has adequate access. Access is the issue, not speed. By this I mean a car must be able to send and receive messages as it needs. It can not “wait a minute”. If a car needs signal and can not get it must drive on its own, or STOP.5G needs more than a bunch of 5G antennas slapped up and operational. 4G can last much longer if managed. … The article link below is the best description to date of the 4G/5G puzzle. The road to 5G: The inevitable growth of infrastructure cost ",
            "date": "Answered July 27, 2019",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Wilkinson",
                    "user_href": "/profile/Chris-Wilkinson-63"
                }
            ]
        }
    ]
}