{
    "title": "What is the most important advancement humanity needs to make? - Quora",
    "tags": [
        "Science of Everyday Life",
        "The Human Race and Condition",
        "Technology",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lynn Muskat",
                "href": "/profile/Lynn-Muskat"
            },
            "answer_text": "Q: What is the most important advancement humanity needs to make? There are actually two major areas: reducing greenhouse gas emissions and human population growth. Greenhouse gas emissions. We need to transition at least 30% of our energy consumption from carbon-based energy to solar or wind based. It doesn’t have to be 100%. The earth’s plant life can absorb a lot of carbon dioxide and methane. We just need to stop deforestation and reduce emissions enough to reverse the net accumulation of greenhouse gasses. A 30% reduction would be sufficient to allow enough greenhouse gases to be absorbed by the biosphere to reverse the atmospheric accumulation process that is driving global climate change. There’s already been a lot of damage. A shit-ton of heat energy has been stored in the world’s oceans, so even if we make the necessary reductions in the next 20 years, it will still take more than 100 years (possibly 200 years) for the accumulated energy in the oceans to be released and for the polar ice caps to start to regrow. Of course, we should also stop deforestation (cutting down the equatorial rain forests) and tax anything that results in carbon dioxide or methane emissions. Since methane causes 25 times as much greenhouse effect as carbon dioxide, emissions taxes should be weighted accordingly. Human population growth The second advancement would be for humans to recognize that they need to self-manage their procreation. Predators are no longer a significant threat and medical science and food handling safety (refrigeration and proper cooking) has drastically reduced the impact of microscopic threats like bacteria and viruses. Although we do have much more deadly weapons technology, the frequency of deaths by warfare has actually become much smaller. The net effect is that things that used to keep human population under control are no longer doing so. Because of this, we will either need to figure out a way to self-regulate our population or eventually face a very grim future where famine, clean water shortages, and housing shortages will make living very, very, hard for almost everyone. It’s been calculated by some really smart people that only a population of 1.5 to 2 billion people can be permanently sustained by the earth. Any more than that, and humans eventually destroy the planet. Right now, there are about 7.6 billion people. World population - right now Although the growth rate is decreasing, it’s still predicted to be net positive (about 0.2%) by the end of this century. Even with a growth rate of .2% the world’s population will be nearly 10 billion and increasing by 20,000,000 people every year. The solution is not to go to Mars, BTW. We don’t have the resources to move 20 million people to Mars every year — especially when people will be starving here. Some suggested changes would be: Get religions that refuse to recognize over-population as a problem for humanity to change their position.Encourage women to get educated and pursue quality careers instead of becoming mothers.Provide free birth control and abortions for all women.Create tax incentives for voluntary self sterilization.Set up licensing programs where would-be parents would be “qualified” by level of education, disposable income, not having genetic defects, psychological profile, and training in responsible child care.Phase out dependent-related tax deductions and phase in tax penalties for having children without a license.Make free on-demand euthanasia available for anyone who wants it (after a mandatory 2 month waiting period and counseling).Pay a substantial bonus (equivalent to the amount of money paid in social security and medicare taxes but not actually used) to the designated survivors of those who are euthanized.",
            "date": "Answered December 10, 2018",
            "views": "297",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernesto O. Hoffmann, M.D.",
                "href": "/profile/Ernesto-O-Hoffmann-M-D"
            },
            "answer_text": "The inequality and complexity of human society do not allow eliminating or at least improving social inequality, do not allow globalization, do not allow the stabilization of change and delay it, dilute it, annul it and especially complicate it. Humans for centuries have tried to turn society into a more homogeneous group, but without results. \"The reasonable man adapts to the world; the irrational (stupid) persists in trying to adapt the world to himself. Therefore, all planned progress depends on the irrational man. ʺ George Bernard Shaw, 1856-1950. ",
            "date": "Answered December 10, 2019",
            "views": "31",
            "upvotes": "0"
        }
    ]
}