{
    "title": "What is the USB 3.1 Gen 1 Type A? Is it just a normal USB 3.0? - Quora",
    "tags": [
        "USB 3.1",
        "USB 3.0"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Haynie",
                "href": "/profile/Dave-Haynie"
            },
            "answer_text": "When USB 3.0 came out, the specs called for a four-wire link interface topping out at a media speed of 5Gb/s in each direction (USB 2.0 was 480Mb/s in one direction at a time). They had some improved ideas about the way thing were named along the way, and in general, decided that USB should be a collection of specific specifications rather than one big fat one. So when USB 3.1 came out, the “USB 3.0” name was retired, and that exact same thing is now called USB 3.1 Gen 1. The faster interface covered by USB 3.1 is called USB 3.1 Gen 2, and it runs at a media rate of 10Gb/s in each direction. There are other USB specifications that came out around those times, incluing the USB Type-C connector and the USB Power Delivery specification. But these are not inherently part of USB 3.1… you can have USB 3.1 devices using normal Type-A and Type-B sockets, and without PD. You can have devices with the USB Type-C connector that only support USB 2.0. And coming soon is USB 3.2, which can run two Gen 1 or Gen 2 links on a Type-C connector. If we at some point get an even newer version of the USB data interface, maybe 20Mb/s like Thunderbolt, I’d expect it to be called USB 3.1 Gen 3. And there could be a USB 3.2 version as well. So, simply put, USB 3.1 Gen 1 is simply the new name for the thing that used to be called USB 3.0. ",
            "date": "Answered November 28, 2017",
            "views": "88",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick Ira DonEgan",
                    "user_href": "/profile/Patrick-Ira-DonEgan"
                },
                {
                    "user_id": "Daniel Rodriguez",
                    "user_href": "/profile/Daniel-Rodriguez-374"
                },
                {
                    "user_id": "Poul Bundgaard",
                    "user_href": "/profile/Poul-Bundgaard-1"
                },
                {
                    "user_id": "Matt Parsons",
                    "user_href": "/profile/Matt-Parsons-12"
                },
                {
                    "user_id": "Evert Guzman",
                    "user_href": "/profile/Evert-Guzman-1"
                },
                {
                    "user_id": "Rajan Bhavnani",
                    "user_href": "/profile/Rajan-Bhavnani"
                },
                {
                    "user_id": "James Saunders",
                    "user_href": "/profile/James-Saunders-18"
                },
                {
                    "user_id": "Bosley Plourde",
                    "user_href": "/profile/D-B-Oswald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Redwan Hasan",
                "href": "/profile/Redwan-Hasan-2"
            },
            "answer_text": "USB 3.1 Gen 1 Type A probably is the exact same thing as USB 3.0 Type A, both can go up to 5Gbps. Although internal connectors have changed(in some high end boards) but I guess in most cases it is just marketing gimmick because if you write USB 3.0 when USB 3.1 is out it might not sell that good but modern boards or devices might actually use USB 3.1 protocol. For simplicity however remember this USB 2.0 = 480Mbps USB 3.0 = 5Gbps USB 3.1 Gen 1 = 5GbpsUSB 3.1 Gen 2 = 10Gbps Connector form factor doesn’t matter whether it is Type A or Type C. An USB 2.0 Type C will still be limited to 480Mbps. ",
            "date": "Answered November 28, 2017",
            "views": "4",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patrick Ira DonEgan",
                    "user_href": "/profile/Patrick-Ira-DonEgan"
                },
                {
                    "user_id": "Roshan Akthar Gnn",
                    "user_href": "/profile/Roshan-Akthar-Gnn"
                }
            ]
        }
    ]
}