{
    "title": "What is the reason for the very high life expectancy in Japan? - Quora",
    "tags": [
        "Life Expectancy",
        "Culture of Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clint Tan",
                "href": "/profile/Clint-Tan"
            },
            "answer_text": "I think the answer to that is a combination of a few factors.  The food: Mostly eaten by the older generation in rural areas is quite healthy and balanced when compared to the diets of other people of the same age around the world. It's mostly comprised of rice, fish, vegetables, seaweed, and various forms of preserved and fermented items which they say is good for the health (natto, miso). Not a lot of meat is eaten but I think most importantly are portion sizes and the balance of a meal. Every time I eat a home cooked Japanese meal, I'm surprised by the amount of dishes used. People eat a little of everything, variety is very important. There is a Japanese saying that also reinforces this mentality - being 80% full is the ideal and it also makes everything more delicious because you still want a little more.  The environment:It's extremely safe for an industrialized 1st world country especially if you compare it to a peer like say the US. Below is a statistic I found for 2013 which shows an extremely low murder rate (this could be skewed by numerous factors like what police or people decide is a 'deliberate' killing, but even factoring that in it's still absurdly low.)   The National Police Agency recognized 939 unlawful deliberate killings or attempts to kill in 2013, down more than eight percent on a year earlier.An AFP tally shows that equates to around 0.74 per 100,000 people in Japan’s 127 million-strong population, making it one of the lowest in the world http://newsinfo.inquirer.net/561549/japan-murders-fall-to-record-low In my own experience, coming from San Francisco, and living in Tokyo which is the most densely populated city in the world, I was shocked by how safe it was, even through all hours of the night. There was a huge peace of mind that I never felt before - walking home at 3am and not have to constantly look over my shoulder, not worrying about my wife's safety when she was out or working late, being at ease when seeing kids as young as 6 years old shopping at market for their parents.  The Artisans spirit:Japanese people in general have an extremely high work ethic which is most apparent in service industries or manufacturing where there are finite results.  This is my own opinion and observation, but I feel that when people have a reason for living, a purpose, it greatly extends life expectancy. Japan is the only place I've ever seen this level of dedication, most surprisingly, in individuals of retirement age, who are working harder then ever cleaning, cooking, serving, wrapping, farming, etc.  The most famous example of this is the sushi master at Sukiyabashi Jiro, Jiro Ono, who is going on 89 years and not looking to slow down yet. There is an artisan's spirit at the heart of what these people do that I have rarely seen elsewhere. Japanese call crafts people shokunin and it is pervasive in so many facets of the culture. Whether it's polishing spoons, making knives, cleaning airport restrooms, or trying to grow the best corn possible, this unique shokunin mentality is something that I truly admire about the Japanese culture. These people definitely live to work and it shows with how dedicated and passionate they seem for what most would consider the most menial job.  It's definitely not explainable in scientific terms but I truly believe that this way of life makes up a large part of long Japanese life expectancy. ",
            "date": "Updated September 21, 2015",
            "views": "41",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Campbell",
                    "user_href": "/profile/Mary-Campbell-122"
                },
                {
                    "user_id": "Ashwitha Shetty",
                    "user_href": "/profile/Ashwitha-Shetty-63"
                },
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                },
                {
                    "user_id": "Heather Shoup",
                    "user_href": "/profile/Heather-Shoup-1"
                },
                {
                    "user_id": "Trey Hallmark",
                    "user_href": "/profile/Trey-Hallmark"
                },
                {
                    "user_id": "Rod Jackson",
                    "user_href": "/profile/Rod-Jackson-39"
                },
                {
                    "user_id": "Yafet Kasalie",
                    "user_href": "/profile/Yafet-Kasalie-1"
                },
                {
                    "user_id": "Theodorakopoulos Nikos",
                    "user_href": "/profile/Theodorakopoulos-Nikos"
                },
                {
                    "user_id": "Emily Ward",
                    "user_href": "/profile/Emily-Ward-49"
                },
                {
                    "user_id": "Anne Agard",
                    "user_href": "/profile/Anne-Agard"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rujuta Gole",
                "href": "/profile/Rujuta-Gole"
            },
            "answer_text": "The average life expectancy in Japan is 83.10 years. It can be attributed to the following factors: 1) Japanese CuisineThe main ingredients used in Japanese cuisine are rice, miso soup (fermented soybeans and stock), fish, meat, seaweed and others.As you may have noticed, all these are high in nutrient value and low in 'fattening' or unhealthy value. Rice is fattening you say? While Japanese people eat a whole lot of rice, the kind you get there-short grain, is high in calories but also has a good nutrient value. The Japanese generally supplement their rice with small snacks called Okazu which is nothing unhealthy and can be anything from fish, tofu, vegetables or meat. Aah, meat! Though the Japanese enjoy their meat, considering that Japan is an island, they do not frequently deep fry and use very limited oil when cooking the meat. Also, fish is more of a staple and eaten much more than red meat which is the culprit behind high cholesterol and diseases such as heart disease and you know the ones that eventually might kill you. Next comes the soy, main ingredient of miso, which is a kind of soup that is an integral part of the Japanese life. Soy offers a very good protein value, so no fancy diseases for you to deal with. Also, it is used in many dishes of the cuisine so your heart will always remain happy! And how can we forget seaweed? Not only is it tasty, it wraps (couldn't resist a sushi pun) a bundle of iodine and other nutrients and psst..it supposedly also keeps the big guy cancer away. Well, if you are a Japanese, your day is surely incomplete without several cups of refreshing green tea-served without sugar and milk. The name green tea is sufficiently explanatory of its extraordinary benefits!The Japanese use a very little cooking oil in preparing their dishes, so that bad guy is also out of the window. 2) WalkingYou have to walk or cycle crazy distances when commuting to your office/school which keeps you endorphin-releasing healthy. In fact, when I was in Japan I had to walk for about 0.8 km to the nearest station and then again a kilometer from another station to school and then get back of course. So, almost 3-4 km a day excluding any other activities or spots where I may have ventured that day.Obviously, you can drive your way to your desired destination, but who wants to drive anyway when you have such an amazing public transportation in place (crazy fees to pay for driving classes and equally crazy license fees don't really help here). Walk, cycle, walk my friend-to a long long life! 3) Japanese Health Care systemThe Government doesn't want you to die.'The health care system in Japan provides healthcare services, including screening examinations, prenatal care and infectious disease control, with the patient accepting responsibility for 30% of these  costs while the government pays the remaining 70%. Payment for personal  medical services is offered through a universal health care insurance system that provides relative equality of access, with fees  set by a government committee. People without insurance through  employers can participate in a national health insurance programme administered by local governments. Patients are free to  select physicians or facilities of their choice and cannot be denied  coverage. Hospitals, by law, must be run as non-profit and be managed by  physicians. For-profit corporations are not allowed to own or operate  hospitals.' @Health care system in JapanCited from Wikipedia. Get my point? Compulsory health insurance really helps. 4) CleanlinessYou may want to ignore the importance of washing hands, but the Japanese don't. Everywhere you go you will find hand-sanitizers waiting for you to render you germ-free. The general awareness regarding cleanliness is good and overall, Japan is a pretty clean country.I am sure you have heard of the famous 5S regarding workplace organization. Ever wonder what one of the S is? No surprise, it's cleanliness!Look what Wikipedia say:Seiso清掃 (Shine) Can also be translated as \"sweep\", \"sanitize\", or \"scrub\"Clean your workplace completelyUse cleaning as inspectionPrevent machinery and equipment deteriorationKeep workplace safe and easy to workKeep work place clean and pleasing to work inWhen in place anyone not familiar to the environment must be able to detect problems in 5 seconds within 50 feet.@5S (methodology)Well, that about sums up the main factors. I am sure there are many more, and I will add them as I think of them, meanwhile you can visit @Why Do Japanese People Live So Long? (And What You Can Do To Live A Long Time Too) - Tofugu for supplementary reading. Cheers! ",
            "date": "Answered November 27, 2015",
            "views": "65",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Campbell",
                    "user_href": "/profile/Mary-Campbell-122"
                },
                {
                    "user_id": "Isha",
                    "user_href": "/profile/Isha-286"
                },
                {
                    "user_id": "Ashwitha Shetty",
                    "user_href": "/profile/Ashwitha-Shetty-63"
                },
                {
                    "user_id": "Trey Hallmark",
                    "user_href": "/profile/Trey-Hallmark"
                },
                {
                    "user_id": "Dave Pouliot",
                    "user_href": "/profile/Dave-Pouliot-4"
                },
                {
                    "user_id": "Janie Peck",
                    "user_href": "/profile/Janie-Peck-1"
                },
                {
                    "user_id": "Antoine Avans",
                    "user_href": "/profile/Antoine-Avans-1"
                },
                {
                    "user_id": "Vishnu R",
                    "user_href": "/profile/Vishnu-R-63"
                },
                {
                    "user_id": "Mohammed Abdullah",
                    "user_href": "/profile/Mohammed-Abdullah-218"
                },
                {
                    "user_id": "Prakash",
                    "user_href": "/profile/Prakash-168"
                }
            ]
        }
    ]
}