{
    "title": "What are the advantages of green technology? - Quora",
    "tags": [
        "Pros and Cons",
        "Sustainable Technology",
        "Science of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Walton",
                "href": "/profile/Daniel-Walton-42"
            },
            "answer_text": "Here the advantages of the green technology are given below and to know more visit this article. Green technology (also known as environmental technology, clean technology or green tech) is the application of environmental monitoring, green chemistry, environmental science, and various technological processes for environmental protection. This term is also used for sustainable energy production technologies such as wind turbines, bioreactors, recycling, photovoltaics, etc. Also, environmental technology may be related to electronic devices and gadgets that promote the sustainable resources management. Green technology (also known as environmental technology, clean technology or green tech) is the application of environmental monitoring, green chemistry, environmental science, and various technological processes for environmental protection.  Many people think that this technology is a fairly recent phenomenon, but its origins date back to the beginning of the last century – just remember the electric taxis and different types of windmill. Even wave and solar energy are applied more than a century. However, widespread use of green technology has begun in the early 1990s. Green technology includes different technological processes to protect the environment or to revive and repair already damaged ecosystems. In general, all green technologies can be divided into two very broad groups: technologies that deal with global warming and sustainable technologies. There are many examples of environmental technology application (in different fields), and some of them are: Recycling – includes solid waste management, waste incineration technology, different types of wastewater treatments, and other eco-friendly waste recycling technologies.Renewable (alternative) energy technology – energy production from renewable natural resources such as sun, water, wood, wind and so on.Water purification – in addition to water purification technologies, various activities and environmental campaigns have been organized to help purify water around the world.Air purification – it refers to green technologies and cultivation of plants to remove CO2 and keep air fresh.Sewage treatment – green technology similar to water purification.Environmental remediation – the removal of contaminants or pollutants for the general environment protection.Energy conservation – the utilization of electrical devices that use smaller amounts of energy; this leads to the decrease of electricity consumption which causes less consumption of fossil fuels.Advantages of green technology to the environment are enormous, but the most important benefits are: It uses renewable resources that never depletes in nature. Therefore, future generation can benefit from them too, without harming the planet.Environmental technology uses latest energy generation techniques. For example, green nanotechnology that uses green chemistry and green engineering is one of the newest in green technologies.Offers environmental solutions for disposal and recycling of waste. It effectively changes waste production in a way that it doesn’t harm our environment.Green technology has no adverse effect on our planet and it uses sustainable production of energy.This technology uses various innovative methods to create a number of environmentally friendly products.In information technologies, green technology (or “Clean Tech”) is the application of gadgets as well as other devices, which reduce energy consumption and save the environment. Some of these well-known IT applications include: the hybrid and electric cars (with great fuel efficiency);solar cells / panels; smartphones or smart phone-car tech; computers and tablets that use less battery power; energy efficient monitors; Industrial Internet and cloud computing. With each passing day, the number of these green devices and gadgets is growing! ",
            "date": "Answered April 19, 2018",
            "views": "29",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ela Nambi",
                    "user_href": "/profile/Ela-Nambi"
                },
                {
                    "user_id": "Peter Trujillo",
                    "user_href": "/profile/Peter-Trujillo-3"
                },
                {
                    "user_id": "Shirley Rivers",
                    "user_href": "/profile/Shirley-Rivers-4"
                },
                {
                    "user_id": "Erica Hoffman",
                    "user_href": "/profile/Erica-Hoffman-14"
                },
                {
                    "user_id": "Алексей Шмаков",
                    "user_href": "/profile/Алексей-Шмаков-1"
                },
                {
                    "user_id": "Valarie Key",
                    "user_href": "/profile/Valarie-Key"
                },
                {
                    "user_id": "Brad Grimes",
                    "user_href": "/profile/Brad-Grimes-8"
                },
                {
                    "user_id": "Brandon White",
                    "user_href": "/profile/Brandon-White-201"
                },
                {
                    "user_id": "Bobby Knight",
                    "user_href": "/profile/Bobby-Knight-21"
                },
                {
                    "user_id": "Иван Кузнецов",
                    "user_href": "/profile/Иван-Кузнецов-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Humphreys",
                "href": "/profile/James-Humphreys-36"
            },
            "answer_text": "The main goals of becoming a green manufacturing company are to: Use fewer natural resources;Reduce pollution and waste;Recycle and reuse materials; andModerate their emissions during production.This requires anyone wanting to go green manufacturing to research, develop, or implement smart technologies to help them determine the best practices to lower their impact on the environment. For small to medium manufacturing companies, it could be as simple as refreshing yourself on what is modern manufacturing and understanding the concept of lean manufacturing. Well, other than the sense of pride you’ll feel from saving the planet and keeping it habitable for all living things, there are also smart financial rewards to reap when you go green manufacturing, you’ll be happy to know. If you follow the green manufacturing definition properly, you can expect to see: Lower material costs;Decreased overhead expenses;Increased employee morale;Reduced downtime; andJob creation (admittedly, this last point is circumstantial to how your business adapts to a green production model).",
            "date": "Answered September 18, 2019",
            "views": "614",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hannes Kert",
                    "user_href": "/profile/Hannes-Kert-1"
                },
                {
                    "user_id": "Torsten Von Borsten",
                    "user_href": "/profile/Torsten-Von-Borsten"
                },
                {
                    "user_id": "Ben Raybould",
                    "user_href": "/profile/Ben-Raybould-3"
                },
                {
                    "user_id": "Sierra Johnson",
                    "user_href": "/profile/Sierra-Johnson-314"
                },
                {
                    "user_id": "Risto Orr",
                    "user_href": "/profile/Risto-Orr"
                },
                {
                    "user_id": "Karel Kundrats",
                    "user_href": "/profile/Karel-Kundrats"
                },
                {
                    "user_id": "Kristjan Vilosius",
                    "user_href": "/profile/Kristjan-Vilosius"
                },
                {
                    "user_id": "Krister Vals",
                    "user_href": "/profile/Krister-Vals"
                },
                {
                    "user_id": "Priit Kaasik",
                    "user_href": "/profile/Priit-Kaasik-3"
                },
                {
                    "user_id": "Priit Kaasik",
                    "user_href": "/profile/Priit-Kaasik-4"
                }
            ]
        }
    ]
}