{
    "title": "What makes German cars so unreliable? - Quora",
    "tags": [
        "German Cars",
        "Automotive Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Crain",
                "href": "/profile/Daniel-Crain-2"
            },
            "answer_text": "It’s an interesting question, and not wholly without merit. While it’s hard to generalize about an entire nation’s automotive output, certainly German engineering culture/habits create cars of a certain type. I’ve owned pretty much every German manufacturer over the past 30 years, and currently own Audi, Mercedes, Porsche (just sold a VW last week actually). I’ve owned numerous of all of them. I personally don’t care for BMW anymore, but that’s more personal taste in design, materials and cost. But I have nothing against them either. Cars, ALL cars, are a compromise between performance, cost, reliability, etc. There is no “the best car”, but almost infinite interpretations of what a car should/could be. They are after all, engineered consumer products like phones, sofabeds, and televisions. During my long history with German cars I’ve observed an ever increasing trend toward complexity, avant-garde mechanical designs, odd risk taking (BMW SMG anyone?), a lack of respect for cost of manufacture, and a total lack of respect of the cost to the consumer with most companies other than VW (and their various low end brands like VW, Skoda, Seat, etc). The obsession with mechanical brilliance, and trendy designs, leads to crazy product choices that have led to serious reliability issues over the years. Daimler Benz, while getting their asses kicked in the US by Lexus during the 90s (because of cost for comparable perceived quality), made disastrous design choices with the W140 series full size cars. The cars featured so many ridiculous features no one cared about, that it caused the entire model run to nearly destroy Mercedes reputation in many aspects, as well as suffer financial loss. BMW made odd materials decisions with their cylinder heads over the years, causing catastrophic engine failures. They were in fact a company known for their engines (at least so their marketing department tried to remind everyone). I gave up on BMW after a while. The first iDrive was so awful, that BMW actually started to allow people to return their cars for a refund. Audi sometimes tries too hard. I’ve had several of them, and they always had something that should have been basic, but was a disaster because of unnecessary complexity. A8 brakes that needed replacement every 6 months. Suspension components that failed every 12. Auto rotating AC vents that destroyed themselves and cost $7k to replace. My R8 was a piece of junk of epic proportions as well. AC failed, clutches melted, electronics died, door panels fit poorly, upholstery frayed. Pathetic for a car that cost $185K VW has had its share of problems as well, but for other reasons. They build cheap, volume cars, and therefore, they sacrifice complexity for cost reduction, but sometimes, they go too cheap, which causes lots of problems. I’ve owned numerous VWs, and they consume parts like crazy. Suspension parts, engine parts, etc, fail fairly consistently. After all that, and to the great Frank Kemper’s point, usually, if you follow the maintenance procedures, the cars may last indefinitely if you’re lucky. I did in fact have a Mercedes S class (diesel) that went for 223K miles mostly reliably, although the body did rust heavily. In my semi humble view, the German manufacturers aren’t always the best at integrating their ideas into a cohesive product. There’s always one bizarre subsystem or component that is out of kilter. And complexity is the killer of reliability, which the luxury German companies tend to be obsessed with more often than not. Of course, none of this has ever stopped me from buying their stuff……. ",
            "date": "Updated October 14, 2017",
            "views": "339",
            "upvotes": " View 167 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siddiqui",
                    "user_href": "/profile/Siddiqui-3"
                },
                {
                    "user_id": "Robert Blenkey",
                    "user_href": "/profile/Robert-Blenkey"
                },
                {
                    "user_id": "Andrei Tulvan",
                    "user_href": "/profile/Andrei-Tulvan"
                },
                {
                    "user_id": "Dinh Nhan",
                    "user_href": "/profile/Dinh-Nhan-8"
                },
                {
                    "user_id": "Steven Baddeley",
                    "user_href": "/profile/Steven-Baddeley"
                },
                {
                    "user_id": "Calin Ceteras",
                    "user_href": "/profile/Calin-Ceteras"
                },
                {
                    "user_id": "Abhishek Mitra",
                    "user_href": "/profile/Abhishek-Mitra-31"
                },
                {
                    "user_id": "Leonardo González",
                    "user_href": "/profile/Leonardo-González-4"
                },
                {
                    "user_id": "Victor Seweje",
                    "user_href": "/profile/Victor-Seweje"
                },
                {
                    "user_id": "Ervin Aundoo",
                    "user_href": "/profile/Ervin-Aundoo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Gaddini",
                "href": "/profile/Frank-Gaddini"
            },
            "answer_text": "Frank Gaddini, 40 year veteran Auto tech. Well I'm just going to put it as simple as I can. German cars are admirable in that they are well performing in general. But to put it simple they just do what anyone else could do, but chooses not to. They just decide to use a softer bushing (for example) to soften a vibration from a component that won't last, but will make the car perfect in the showroom and sell the car. Then later the buyer pays to replace that part again and again. I have seen this for forty years. My best friend repaired clocks and he put it well. He said German clocks were beautiful and machined to perfection, but one piece of dust would stop them cold. American clocks were not as precision, but could make it accross the country on a covered wagon and still keep perfect time . The Germans are not stupid, nor is anyone who builds cars they just do what they can get away with and they sell lots of cars so why change. Just brainwashing us into thinking that German engineering is superior. Personally, I laugh at that one. Did Germans build a space shuttle, or an f22, or an aircraft carrier? Wake up! Hey everybody love the responses and I also want to clarify something and add something. First I want to say that I think the Germans may be the finest engineers in the world. But I see that as their problem because I think maybe they get a little too much pride in their engineering and over engineer things that don't need it. However, even since I wrote this cars have become more alike and German cars have become less German. In forty years of auto repair I have seen many many american cars with over 300k miles, even more american trucks over 300k and some over 500k. I have never seen a german car over 300k in the shop, but I have seen many over 200k. Problem is German cars are the cheapest built where you can't see it and labor and part costs are highest where you can't see it so their retail value plummets quickly to near nothing on any upper end german car cause they are financial time bombs. Sorry they just are. Also wanted to acknowledge that the Germans were the start of our own space program, thanks! ",
            "date": "Updated February 26, 2020",
            "views": "268",
            "upvotes": " View 153 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abel Zhu",
                    "user_href": "/profile/Abel-Zhu-2"
                },
                {
                    "user_id": "Flavio Castañeda",
                    "user_href": "/profile/Flavio-Castañeda-1"
                },
                {
                    "user_id": "Dinh Nhan",
                    "user_href": "/profile/Dinh-Nhan-8"
                },
                {
                    "user_id": "Abhishek Mitra",
                    "user_href": "/profile/Abhishek-Mitra-31"
                },
                {
                    "user_id": "Jose Alfaro",
                    "user_href": "/profile/Jose-Alfaro-90"
                },
                {
                    "user_id": "John Martin",
                    "user_href": "/profile/John-Martin-826"
                },
                {
                    "user_id": "Randomcreator123 .",
                    "user_href": "/profile/Randomcreator123"
                },
                {
                    "user_id": "Ervin Aundoo",
                    "user_href": "/profile/Ervin-Aundoo"
                },
                {
                    "user_id": "David Goodman",
                    "user_href": "/profile/David-Goodman-156"
                },
                {
                    "user_id": "Joel O",
                    "user_href": "/profile/Joel-O"
                }
            ]
        }
    ]
}