{
    "title": "What is of use of firewall in computer for network security? - Quora",
    "tags": [
        "Firewalls",
        "Network Security",
        "Computer Networking"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shubhi Soral",
                "href": "/profile/Shubhi-Soral"
            },
            "answer_text": "An Internet firewall can be perceived as an electronic drawbridge and works on exactly the same philosophy. An organization’s network is setup in a manner so that there is a single point of entry and exit to the Internet.A firewall, which is essentially a set of hardware devices and software, is then placed at the entry point of the organization's private network and works to screen off all unwanted access both-ways.All communication data packets from any computer inside the private network to the outside world will be routed through the firewall. Also, all data packets from any computer in the outside world to any computer within the private network will always be routed through the firewall. The organization would implement a strict policy not to permit anyone to connect through any other means that may bypass this arrangement, such as a direct dial-up wireless modem. Thus the organization will need to focus only on fortifying the firewall, which will singly control access between the two networks.A firewall imposes restrictions on incoming and outgoing packets to and from the private network. All the traffic, whether incoming or outgoing, must pass through the firewall, and only authorized traffic is allowed to pass through it.Any computer or device connected to the Internet that is not properly protected is vulnerable to a variety of malicious intrusions and attacks. This applies to all users of cable modems, digital subscriber lines (DSL) and dial-up lines. Cable modem and DSL users are more vulnerable because both connection methods provide always on connection capability. The likelihood of a malicious person entering your computer increases significantly the longer your computer is on and connected to the Internet. Anti-virus software does protect you from viruses, spywares and malwares, they have their own limitations. If you have a single computer to protect, you can install an anti-virus software that has an in-built personal firewall, and you are fairly secure. Off course, you need to configure your personal firewall software to block unwanted access to your computer from the outside network. If you have a network of computers, be it a home network or an organization's network, you need to consider setting up a firewall for more information , you may also visit vCloud Security - vTech Solution and What is a Firewall and why is it important for network security? ",
            "date": "Answered July 13, 2018",
            "views": "955",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Deepak Reji",
                "href": "/profile/Deepak-Reji"
            },
            "answer_text": "Like walls in usual life,firewall is a security program which makes computers safe from online http://threats.It can prevent harmful communications made by programmes installed in the system also blocks unnecessary messages from Internet. The allowed and blocked lists helps the firewall to function effectively.You can make necessary changes in firewall to run a programme to communicate with Internet. Windows have its own firewall installed.Some antivirus products have firewall services. ",
            "date": "Answered May 15, 2018",
            "views": "14",
            "upvotes": "0"
        }
    ]
}