{
    "title": "What is the Internet? - Quora",
    "tags": [
        "Computer Networks",
        "Word Definitions, Terminology, and Jargon"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aniruddha Majumder",
                "href": "/profile/Aniruddha-Majumder-3"
            },
            "answer_text": "Whether we want to talk to our friends via email or instant messaging, shop, book movie tickets, or even read and research, the internet makes our lives much easier. It’s hard to imagine a world without the ease and convenience of the internet. It’s a wonderful technology that has extended to most areas of our lives. But how does this technology work? Have you ever wondered? What is the Internet? Simply put, the internet is a global collection of networks of computers connected to each other. These networks allow data to be transferred between the computers/devices connected to them. This exchange of data is possible only because all the computers on the network play by the same set of rules, called the Internet Protocol (IP). How does this Global Network called the Internet Work? Be it for a Google search for your favorite movie, or an email to a friend, what’s essentially happening when you use the internet is that you’re sending a message from your device to another device. Thus, when you use the internet, what you’re doing is sending and receiving messages (requests) to and from other computers and devices on the network. Data Transmission on the Internet The computers and devices that we use are called clients and the computers that websites such as Google or Facebook use are called servers. The websites we access are all files on the hard disks of the respective servers. Our devices do not directly access these files. When we access Google for example, our client device forwards its requests to Google servers via our internet service providers (ISPs). The results also come to us via our ISPs. Which is why we cannot access the internet if our connection to our ISPs gets terminated. Also, these messages and requests aren’t sent or received as a whole. Any time you use the internet, your message is broken down into units called “packets” that travel through the network to its destination. Upon arrival at the destination, the packets are put together in the original order. You can think of a packet as a chunk of your message / query. Or like a part of a jigsaw puzzle that needs to be solved at the destination. If for some reason the packets aren’t put together in the right order at the right time, the results are in the form of distorted content. Like when a video lags, or a web page doesn’t load properly. But there are millions of people and devices accessing the internet at any given time. Which means countless packets of data. So how do these packets of data find their way to their intended destination? Every device connected to the internet has its own unique I.P address which acts as the postal address does in the physical world. And to make the data flow smoother and avoid data traffic jams, there are routers. Routers sort the packets based on their destination and ensure that they end up on the right device and not on other devices on the network. ",
            "date": "Answered July 3, 2018",
            "views": "540",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahesh Gupta",
                    "user_href": "/profile/Mahesh-Gupta-745"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shilpa-325"
                }
            ]
        },
        {
            "author_info": {
                "name": "David F. Prenatt Jr.",
                "href": "/profile/David-F-Prenatt-Jr"
            },
            "answer_text": "What is the Internet? I have spent the last twenty to thirty years asking and answering this question, and the answer is highly contextual. To wit, the Internet is billions of different things to billions of different people, and the definition that I get from or give to any particular person when I ask or tell them what it is will always be slightly different. And even if I could get or give an answer that is all things to all people, that answer would change almost immediately. First and foremost, the Internet is a collection of technical protocols that allows different computers on different platforms to communicate with each other. The underlying technology that makes this communication possible is “packet transfer technology.” Pursuant to the Internet Protocol and the Transport Control Protocol - commonly referred to as TCP/IP - each computer that is connected to the Internet is assigned an IP address, and that IP address is used to route information to and from various other computers once that information has been packaged into “packets.” The first \"killer application\" of the Internet as most people now know it was e-mail, and e-mail remains one of the most commonly used Internet applications, typically relying on the Post Office Protocol (POP) and Standard Mail Transfer Protocol (SMTP) to move packets of information from Point A to point B. At the other end of the spectrum, the World Wide Web relies primarily upon the Hypertext Transport Protocol (HTTP) to send queries and deliver information in multi-media format. In the middle is almost every other possible form of digital communication, such as the Voice Over Internet Protocol (VOIP), which has taken over most telephone communication. During presentations that I make for lawyers seeking credit for Continuing Legal Education (CLE), I spend no less than 45 minutes asking, answering, and revisiting the question of what the Internet is. Specifically, what about people who don't use computers or the Internet directly? Are they part of the Internet? They are according to my personal working definition. To wit, the Internet is a modern institution of worldwide communication that allows people to store, access, and process vast amounts of information and communicate more or less instantaneously. See also: David F. Prenatt Jr.'s answer to, \"Who invented the internet?\" [Next Answer]",
            "date": "Updated August 4, 2018",
            "views": "185",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Donna Vickers",
                    "user_href": "/profile/Donna-Vickers-17"
                },
                {
                    "user_id": "Mark Binfield",
                    "user_href": "/profile/Mark-Binfield"
                },
                {
                    "user_id": "Pranav Kumar",
                    "user_href": "/profile/Pranav-Kumar-1612"
                },
                {
                    "user_id": "Kavita Lohan",
                    "user_href": "/profile/Kavita-Lohan-4"
                },
                {
                    "user_id": "Sharon Rybak",
                    "user_href": "/profile/Sharon-Rybak"
                },
                {
                    "user_id": "Toluwani Daniel",
                    "user_href": "/profile/Toluwani-Daniel-2"
                },
                {
                    "user_id": "Judith Engelstad",
                    "user_href": "/profile/Judith-Engelstad"
                },
                {
                    "user_id": "Himani Jain",
                    "user_href": "/profile/Himani-Jain-293"
                },
                {
                    "user_id": "Caroline Levy",
                    "user_href": "/profile/Caroline-Levy-14"
                },
                {
                    "user_id": "Luis Fuentes",
                    "user_href": "/profile/Luis-Fuentes-4"
                }
            ]
        }
    ]
}