{
    "title": "What are some good apps which can challenge Google Maps? - Quora",
    "tags": [
        "What Is Similar to X",
        "Google Maps for Mobile (app)",
        "Google Maps",
        "Maps",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "G Saunders",
                "href": "/profile/G-Saunders-2"
            },
            "answer_text": "If you asked Apple users, some fiercely brand-loyal people would say Apple Maps is better than Google’s maps. Waze is also a Google product that’s been in the Apple store for a long time and lots of people like Waze better. Google recently released Google Maps for Apple. A dedicated navigation system like TomTom or Garmin has lots of users who say their built-for-purpose navigation system is better. I got along fine with the navigation system built into a brand-new Nissan Altima I drove while my Subaru was in the shop. It’s better because it’s built into the car, although I preferred my familiar Google Maps, which is better because it’s built into my phone. Any of the navigation systems is thought to be ‘better’ than others by its users, and some are part of their social media ecosystem. This is one of the topics my students use for a ‘tech market brief’ I assign them as part of an exercise in semantic markup for web page layout and content. I’ve seen dozens and dozens of briefings and believe all of the systems are pretty good, and ‘better’ or not is pretty much subjective. You could Google around on terms like ‘apple maps, google maps, waze comparison’ and check out the lists of features with dots pointing out which apps have them and which don’t. There are lots of reviews like this: Waze vs. Apple Maps vs. Google Maps – Which Map App is Best? | The Zebra ",
            "date": "Answered March 10, 2020",
            "views": "362",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Simon John",
                    "user_href": "/profile/Simon-John-118"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Harvey",
                "href": "/profile/Robert-Harvey-41"
            },
            "answer_text": "Originally Answered: Is there any navigation system better than Google Maps? I use a TomTom satnav in preference to the built in system in my car, and greatly prefer it to using turn-by-turn instructions from Google Maps. The display is clear, sensibly sized, and the instructions easy to understandIt has only one job to do, and doesn’t shut down or time out or ping with incoming emails at annoying moments.The interface does not change every few monthsIt calculates average speed in lengths of road monitored by average speed cameras, and pings annoyingly for fixed speed camerasIt has a wide range of route calculation controlsIt has single-button selection for home and work destinationsTomTom has a very sophisticated system for indicating congestion and delays, and does a better job on route selection or re-routingThe maps are stored on the device and it works just as well in areas without internet coverage.It has tools for reporting changes of road network and speed limits that are rapidly implimented.I have also use Here maps “HERE WeGo” for street level navigation, which does not have such definite advantages over Google Maps, but is still marginally easier to use. And it has, at least in the USA, integrated taxi booking Similarly bus drivers and lorry drivers would not be advised to use Google Maps, rather they should use dedicated satnavs that understand the various route restrictions (height, weight limit, bus-only roads etc.) ",
            "date": "Updated March 11, 2020",
            "views": "560",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Simon John",
                    "user_href": "/profile/Simon-John-118"
                }
            ]
        }
    ]
}