{
    "title": "What is the best feature or technology you’ve seen on a car? - Quora",
    "tags": [
        "Car Design",
        "Features (products and services)",
        "Car Care",
        "Technology Trends",
        "Automotive Industry",
        "Personal Experiences",
        "Technology",
        "Cars and Automobiles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Cattalini",
                "href": "/profile/Paul-Cattalini"
            },
            "answer_text": "I’ll go back to our ‘57 Chevy wagon and the radio. It was simple. AM only, with two knobs, on/off/volume and tuning, and five programmable selection buttons. Tune in your five favorite stations, pull the button out, then push it back in and it would always go back to the station. So while driving along, you could reach down, turn it on or off , adjust the volume, select a preset station, or just turn the knob and select any station. All without taking your eyes off the road. It has been improved upon over the years, FM came along, then tapes, CDs, etc. but the basic design worked very well. My 2004 Envoy works the same way, and the so did the original radio in our 1990 VW camper, until the cassette deck died and my analog-to-cassette adapter no longer worked. So I bought a new Sony music box, AM/FM/CD/Sirius compatible with USB for MP3, iPad, etc. And since then, I have to look at the box every time I want to change a station, fiddle with the single joystick that does all, etc. And new cars, with touch screens, etc, I look at with fear. I know that I’m an old fogey, but I am far from a Luddite, I have worked with computer systems most of my life, but simple tactile feed back can’t be beat. BTW - I have no idea when the old radio came out. I was born in 1954, so our 57 Chevy was the one I grew up with. I remember our earlier Chevy wagon, a green one, but just riding in it. I couldn’t even tell you if it had a radio. ",
            "date": "Updated June 13, 2020",
            "views": "527",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jimmy Barr",
                    "user_href": "/profile/Jimmy-Barr-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Parr",
                "href": "/profile/Alan-Parr-8"
            },
            "answer_text": "Look at the steering column on your car. Do you see the lever, on the left hand side? That is called the ‘TURN SIGNAL’* If you press the lever ‘DOWN’ (To the left), a series of lights on the front, rear, and left side of your vehicle start blinking, indicating to other drivers your desire and intent to turn left, or change lanes to the left. If you press it ‘UP’, (To the right), the same thing happens, but on the right side of your vehicle, indicating that you wish to turn or move to the right. Sadly, despite being available for almost three quarters of a century, this feature is woefully under utilized. *In most modern vehicles, this device is referred to as the ‘Multi-Function Switch’, as it may control the headlights, wipers and high beam (passing) lights. In some early Eighties Ford vehicles, it controlled the horn. (I’d love to meet the idiot that thought THAT was a good idea!) It is possible, perhaps, that adding the other functions led to the reduction of the use of its primary function? ",
            "date": "Answered June 12, 2020",
            "views": "433",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jimmy Barr",
                    "user_href": "/profile/Jimmy-Barr-5"
                },
                {
                    "user_id": "Scott Cooper",
                    "user_href": "/profile/Scott-Cooper-246"
                }
            ]
        }
    ]
}