{
    "title": "What is the disadvantage of using a typewriter? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Musfequr Rahman",
                "href": "/profile/Musfequr-Rahman-1"
            },
            "answer_text": "In comparison to what exactly? It is quite inappropriate to compare a manual typewriter to that of a word processing application on a computer. So instead, I'll just have to pretend you didn't mean to compare it to a laptop computer. Writing with a tablet is foolhardy, and I don't care what anyone says. The disadvantages of using a typewriter (should) be obvious, the advantages are not so obvious, but I firmly believe that there are. But in the event anyone has forgotten, I'll chuck out a few: Chief among them is the weight. Even potable typewriters weigh in the 10 lb range. Having to have blank paper readily available; not much good in lugging around a typewriter if you don't have any paper to actually type on. How about I just get on with the elephant in the room that's glaring at me right now? What I would consider the biggest hurdle in using a typewriter, is learning how to properly use a typewriter. Yes, I'm serious. Because if you don't properly align and set the ribbon, it will freely spool too far and you'll get a nice jam. If you want to correct an error, you could (at probably great expense) get a “black and white” ribbon; it's a ribbon with a white-out like lining on the lower half (where red ink normally is). Or...or you could just hit the backspace key, use the “/” to cross it out, and continue writing. If you're greatly bothered by your typos, then a typewriter isn't a good match. One could use an electronic typewriter, with correction tape integrated, but then you may as well just go fully electronic. If you wanted to save yourself the trouble of have to type the same work twice, then carbon paper is called for; i. e. carbon-copy. Some typewriters even had multiple margins, and thus had a TAB on key. Otherwise, you'd have to do that manually. I'm sure there are more, but those are the ones I can think of on the top of my head. The disadvantage of using a typewriter, is learning how to use one. That, and knowing what you actually want to use it for. ",
            "date": "Answered November 18, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adlai Armundsen",
                "href": "/profile/Adlai-Armundsen"
            },
            "answer_text": "Keys get jammed, ink smears, hard to correct typos and need for carbon paper for copies. When I used a typewriter, I was told my writing was childish and that is the truth. My reading skills are better than my stream of consciousness writing. I type your/you’re, their/there and similar things automatically without thinking and only spot on re-reading. Now if I re-read what I key in, I find that I do make mistakes and can easily correct them. My writing has improved. I say IF because at times I just dash off something without reading and later find I goofed. ",
            "date": "Answered October 2, 2018",
            "views": "372",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Musfequr Rahman",
                    "user_href": "/profile/Musfequr-Rahman-1"
                },
                {
                    "user_id": "Ray Weaver",
                    "user_href": "/profile/Ray-Weaver-2"
                },
                {
                    "user_id": "Carol Baldridge",
                    "user_href": "/profile/Carol-Baldridge"
                },
                {
                    "user_id": "Dieter Thomas",
                    "user_href": "/profile/Dieter-Thomas"
                }
            ]
        }
    ]
}