{
    "title": "What are the current technologies and trends running in IT? - Quora",
    "tags": [
        "Information Technology",
        "Technology Trends",
        "Computer Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sagaya Chinnapparaj",
                "href": "/profile/சகாயா-சின்னப்பராஜ்-Sagaya-Chinnapparaj"
            },
            "answer_text": "There are plenty of niche skills and technologies running through the IT industry. Here are very few that makes unmeasurable growth every yeara nd expected to be on top of all ArchitectureArchitecta in any technologies like Java dot net cloud.. tools like splunk.. remedy.. environment architects for main frame and mid range environments. It's really booming like anything because of trending other technologies industry need golden architects to build new apps and market 2. Big Data/ Data analytics Indira is wealth .managing information is really a wealthy job . Data management is growing like anything . Data scientists are highly paid though 3. Business intelligence snd business analytics Specialist in a particular line business subject matter experts are becoming industry driven tech folks . 4. Cloud/SaaS Companies didn't wanted to have their own servers maintenance etc due to cost and quality od services. This leads path to cloud and Amazon web servers ans shared services . 5. UI/UX Designers - customer always what's cool and cache UI. That leads lots of need and money 6.Security / Cyber Security Security matters in handling lots and lots of personal and private information . Here we go cyber security experts technology warranting demand in industry . 7. CMS/ SharePoint / Salesforce /SAP/curam - leading technologies and peek at this time ",
            "date": "Answered August 22, 2016",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prakash Ranjan Patra",
                    "user_href": "/profile/Prakash-Ranjan-Patra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chaitanya Krishna",
                "href": "/profile/Chaitanya-Krishna-452"
            },
            "answer_text": "Since 2017, technological advancements has lead to unexpected and promising trends in business operations and prospects. In 2018, we expect drastic improvements in the technology industry and careers. Artificial intelligence and machine learning will lead the way in changing the whole technology industry paving way for the automation of the industry. Artificial Intelligence (AI) and machine learning are becoming relevant in almost every part of technology for the foreseeable future. With the predictable growth in the technological industry, jobs and career advancements are also expected to grow. Here is the top 10 trending IT Technologies : 1.Artificial Intelligence 2.Cloud and Edge 3. Blockchain Technology 4.Privacy and Security 5.Digital Twin 6. 5G Networking 7.Automated Natural Language(bots) 8.Heads Up Display (HUD) 9.Mobile Payments 10.Increase in Electric Cars Source : Top 10 Trending Technologies in IT Industry ",
            "date": "Answered May 3, 2019",
            "views": "174",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anand Kumar",
                    "user_href": "/profile/Anand-Kumar-8465"
                }
            ]
        }
    ]
}