{
    "title": "What are the best IT courses to pursue in 2020? - Quora",
    "tags": [
        "It Courses",
        "Information Technology",
        "2020 (year)",
        "Educational Courses",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Renuka Hingmire",
                "href": "/profile/Renuka-Hingmire"
            },
            "answer_text": "Depending upon the profile like Software Tester or Software Developer IT courses are differentiated. If you are looking for career oriented courses the visit the \"udemy\" website When testing a web application, does it matter what language the website is written? I mean, do testers change their approach if the app is written in HTML or Java or Python? It depends, since if a company produces software in different languages then if would be difficult for the tester to keep different languages for http://automation.So using a single language for the tests would ease QA life. That would also allow QA to share libraries/tools among different tests for different SUT. Learn more about Automation Software Testing and career in it on \"udemy\" website for the courses like “ISTQB Foundation and Selenium Java Automation Testing” posted by –“Narayanan Palani”. ",
            "date": "Answered January 30, 2020",
            "views": "202",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Narayanan P",
                    "user_href": "/profile/Narayanan-P-6"
                },
                {
                    "user_id": "Ramalingam Natarajan",
                    "user_href": "/profile/Ramalingam-Natarajan-4"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-10067"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diksha",
                "href": "/profile/Diksha-320"
            },
            "answer_text": "The best IT courses to pursue in 2020 are: Python with machine learningPython with data sciencePython with IoT ( Internet of things )Digital MarketingIf you want to pursue these courses, I can help you by providing these courses.Contact:8264999306 ",
            "date": "Answered January 30, 2020",
            "views": "116",
            "upvotes": "0"
        }
    ]
}