{
    "title": "What are the most important courses on water treatment? - Quora",
    "tags": [
        "Water Treatment"
    ],
    "response": [
        {
            "author_info": {
                "name": "WaterTreatment Plant Toptech",
                "href": "/profile/WaterTreatment-Plant-Toptech"
            },
            "answer_text": "LEARN WHAT THIS INDUSTRY CAN DO FOR YOU 1. Get a CAREER not a JOB! A position in the treatment or distribution of drinking water is a career, not a job. By definition a career is an occupation that a person fulfills for a significant portion of their life with opportunities for advancement. In contrast, a job is simply a position of regular employment where a person gets paid. Basically anything can be a job but the key difference is that a career has room for advancement and can be relied on for your entire working life. When looking for a job most people are doing just that, looking for a job. But why? Why set your sights so low and accept a simple job when you can improve your life and socioeconomic status by landing a career in the water treatment industry? The opportunities associated with a career can vary but the one thing is for sure, a career will last you the rest of your life whereas a job will allow you get by. 2. Room for Advancement As we just discussed, the water treatment and distribution industry is a career not a job so consider the room for advancement. This field is probably one a few other exceptions to the general rule that you need years of schooling to get into a management position. As it stands, most people that work in the supervisory or management portions of the drinking water industry do not have college backgrounds. What they do have is a strong background in the treatment and distribution of drinking water which in combination with a certificate is paramount to the industry and takes precedent over anything else. There are many people who started in the field as trainees with little to no experience that have slowly worked their way into a management position. Even if being a manager doesn’t suit you there is still room for advancement as you acquire higher certification levels. Most water facilities have a variety of certification level positions. These positions can include trainees, operators, system operators, lead operators, shift operators, chief operators, and more depending on what titles are used. The key to remember is that just because you might start out with little to no experience in the field there is no reason to assume that you will be stuck in that position forever. Remember, this is a career not a job; there is always room for advancement! 3. No college necessary! Most people think that in order to get a career you need to have a solid college education. Well, the reality is that you don’t. Although there are plenty of college graduates who work in the water industry, college is not a requirement to get into the industry. Don’t get me wrong, you can’t just walk into a plant and start operating equipment without any experience. There are a few small hurdles that you need to overcome but you can accomplish them at your own pace. The best way to get into the water industry is to get an operator certification. This can be done by doing a little research into your states public health department and learning what is required to get an operator certificate. Generally you are required to take a certification test to demonstrate your competency of the fundamentals. Don’t be scared, you aren’t expected to know everything but you will be expected to know something about the field so you will have to prepare for the test. A great way to help prepare for the test is by taking an exam preparation course or using some type of study material like flashcards or a math guide. Once you pass the certification test you will earn a certificate which proves that you are serious about the field. Failure to get a certificate before applying for an operator position will definitely hurt your chances. When managers review job applications the first thing they look for is whether or not the applicant has a certificate. If you have a certificate you can almost guarantee that you will beat out everyone else that doesn’t have a certificate so don’t limit your chances, make sure and get a certificate before you start applying for positions. The cost of applying for and obtaining a certificate is really minor in the big picture. In most states you can take a test and get the certificate for less than $150. Not too bad if you consider the opportunities that you have once you get your foot in the door. 4. Great Pay! Face it, one of the main things people look for in a career is the pay scale. We all have to live and of course we all want to live with some financial freedom to do and have the things we want. Luckily for you, a career in Water Treatment or Distribution can offer you this type of financial freedom. According to the Bureau of Labor Statistics the 2010 median pay for a Water Treatment Plant Operator was $40,770 which works out to about $19.60 per hour. If we assume an annual 3% cost of living increase that would mean that in 2013 the median pay is $44,550. Not too shabby if you compare that to what a typical college graduate with a bachelor’s degree earns. The National Association of Colleges and Employers just reported that in 2013 the median pay for a 4 year college graduate was $44,928! A difference of less than $500 a year or $42 per month. Of course there are many college graduates who work in the water industry and generally speaking their degrees do help them to move up the promotional ladder quicker than the average operator. Another fact to consider is that you can start a career in the water industry straight out of high school which means that your career would start at least 4 years earlier than a typical college graduate which means that by the time the college graduate is starting a career making roughly $45k a year, you will likely be making more because you have had time to move up the promotional ladder to a higher paying position. 5. Benefits On top of the already great pay that comes along with a career in the water industry are the varieties of benefits that are common to the field. Considering that most water treatment facilities are publicly owned and oftentimes unionized, there can be a long list of additional perks that the job offers. For example, public pensions, medical insurance, vision insurance, dental insurance, life insurance paid vacation and sick time in addition to paid holidays are just a few of the benefits that may come with an operator job. How would you like to earn to a paycheck for the rest of your life with a public pension? How would you like to know that you and your family could take vacations without the fear of reducing your monthly income? You should strongly consider asking yourself these questions then look for a job that meets your needs. I can almost guarantee that the benefits of career as a water treatment or distribution operator will exceed your expectations. 6. Recession Proof I am sure the feeling is still very fresh in your mind about concerns with the economy and wondering whether or not your position is recession proof. With millions of people getting laid off and companies downsizing, people are looking for jobs that can stand the test of time regardless of the economy and the stock market. Water is vital aspect of life for every living being on earth so we know that water will always be in demand, especially safe drinking water. If the stock market drops 500 points people will still need water, if the real estate market drops 50% people will still need water, no matter what happens, people will still need water! How much more recession proof of a job can you think of? 7. Good Job Outlook With the state of our economy and millions of people without jobs it can be difficult to nail down a good job. The unemployment line is very long and there are many highly skilled people who don’t have a job for one reason or another so the competition can be fierce but, most people think that water comes from the kitchen faucet and that’s all they care about. Very few people actually know about the water treatment industry and even fewer people know what is needed to get into the field. Good news for you right? The Bureau of Labor Statistics projects that the job outlook for water treatment operators will grow by 12% over the next 7 years. That’s insane! Not only are you a step ahead of a majority of job applicants by learning about a career in the water treatment and distribution field but the field itself is expected to continue growing. You can almost imagine your first paycheck right? 8. Benefit Society When looking for a career why not choose one that provides a vital service to society. Similar to doctors and engineers, treatment plant and distribution operators provide necessary services for the public. Since day one people and animals have been forced to stay within reach of drinkable water in order to survive. A lack of a suitable water supply leads to the deterioration of a society. Treatment plant operators and distribution operators enable society to have access to safe drinking water. Without these two vital positions society would be in constant fear of drinking water that may contain diseases which could ultimately lead to death. At the end of each day you could know what it feels like to provide a service that everyone in the entire world needs to survive. You could hold your head high and take pride in your career. 9. Relocation Options Another beneficial aspect of seeking a career in the water treatment industry is that your field skills and certifications allow you to move anywhere in the USA with some type of certification reciprocity. Reciprocity means that each state will compare its particular certification regimen against other states to determine what certification level to grant you if you choose to move. For example, the state of California has 5 certification levels; all other states only have 4 licensing levels. If you lived and California and had a grade 5 certification, you could move out of state and apply for that’s state highest certification. Pretty convenient right? You can move anywhere you want in the USA and start applying for operator jobs without having to start back at square one with your certification. 10. Paid training There are few careers that provide you with the ability to broaden your education and range of knowledge like the water treatment industry. Working in the water treatment or distribution field requires that you stay up to date with changing regulations and new technologies, not to mention the variety of skills that you can learn or enhance while working in the field. Many water companies pay for their employees to attend trainings that will benefit the company and better prepare the employee for whatever situations they may face. There are a lot of operators who have gained valuable skills through company paid trainings that they would have otherwise never learned. Due to the wide variety of beneficial skills that apply to the water industry the list of available trainings is long. Think about it, electrical, mechanical, technical, chemical, plumbing, writing, computers, programming, and supervisory skills are all desirable skills that most companies are willing to train their employees for. As a secondary benefit these skills can be applied to your daily life. Not only do you get the reassurance of having a solid career but you get the option to learn a variety of trade skills that will benefit you outside of work Thank you more information visit Water Treatment Plant Waste Water Treatment ",
            "date": "Answered August 4, 2017",
            "views": "340",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Spencer Roper",
                    "user_href": "/profile/Spencer-Roper-1"
                },
                {
                    "user_id": "MD Arshad",
                    "user_href": "/profile/MD-Arshad-77"
                }
            ]
        },
        {
            "author_info": {
                "name": "Magdi El Beheiri",
                "href": "/profile/Magdi-El-Beheiri"
            },
            "answer_text": "You’ll need to study 3 basic issues…[1] Water Contaminants. [2] Water Uses and necessary quality requirements [3] Water Treatment Technologies. These are TOPICS and each is subdivided into several category. For instance, seawater desalination is a process in which salts in raw water is removed converting part of water into suitable water for drinking, agriculture and/or industrial applications. To be specialized in Seawater Desalination you need to know the most applicable technology to desalinate the seawater …..Reverse Osmosis, Multstage Flashing, Electrodialysis Reversal and/or Vapor compression,…..etc. You will need to know the quality of Treated Water according to its applicaion (Drinking and Domestic use, Irrigation or Industrial). You may join few top notch socities specialized in water treatment technologies (NSF, AWWA, IDE,….etc.), All professional socites publish their own technocal magazines which are excellent source of information and experience. ",
            "date": "Answered July 17, 2017",
            "views": "460",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Spencer Roper",
                    "user_href": "/profile/Spencer-Roper-1"
                }
            ]
        }
    ]
}