{
    "title": "What are the limits of Battery Technology? - Quora",
    "tags": [
        "Lithium-Ion Batteries",
        "Battery Life",
        "Batteries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Summers",
                "href": "/profile/Chris-Summers-22"
            },
            "answer_text": "The limitations are what you are seeing, there is just so much space to put a certain amount of energy into a storage cell. The current technology of Li-ion batteries pack a lot of energy into such a small container but they also can become very volatile when something goes wrong. There are some technologies that are being experimented on now that offer more energy. They either have higher production costs associated with the materials used or still unfeasible and just too unpredictable and reliable. The problem you will get into is as you put more energy into a smaller compartment you will have a greater chance of failure, and when it fails it will be more volatile. That is a safety concern. Have you seen what happens to a 18650 battery when it vents? That carries more energy than what a smartphone battery can and is much more reactive. Those issues that arrived with the Note 7 are very small in comparison to what a vape mod with a 18650 battery can do. Think of the laptop explosions a few years ago that used those 18650 batteries in their battery packs. Now have the kind of energy in you pocket next to your leg, see what I mean? The goal is to put more energy in them but also to make them less volatile and currently there are limitations. We will get there eventually just as we came to modern Li-Ion battery tech came from the older NiCad batteries. ",
            "date": "Answered August 4, 2019",
            "views": "256",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Timothy Fay",
                "href": "/profile/Timothy-Fay-2"
            },
            "answer_text": "The limits of battery technology are the limitations as to what we know about battery technology today. Currently quite a few companies are trying to develop solid-state battery technology that have been unable to perfect the battery chemistry at this time. because that's not possible at this time does not mean that they will not achieve a successful outcome in the near future. So in the end the limitations are based on time. ",
            "date": "Answered January 7, 2019",
            "views": "274",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Curtis Hannah",
                    "user_href": "/profile/Curtis-Hannah-3"
                },
                {
                    "user_id": "Dustin Covey",
                    "user_href": "/profile/Dustin-Covey"
                }
            ]
        }
    ]
}