{
    "title": "What's the average lifespan of a smart phone battery? - Quora",
    "tags": [
        "Smartphone Battery Life",
        "Smartphone Batteries",
        "Battery Life",
        "Batteries",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leslie Martin",
                "href": "/profile/Leslie-Martin-24"
            },
            "answer_text": "If properly maintained 4 or 5 years the cell phone battery has two indicators Battery efficiency and Battery charge. Battery efficiency determines how long the battery holds its charge between use of the device.When you first purchased your smart phone the battery efficiency was 100%. However as time goes by the efficiency of the battery drops, this is natural phenomenon and effects all Batteries from your car Battery to the cell phone battery why this does this happen ? A battery is a mixture of chemicalcompounds overtime these compounds start to deteriorate How can you slow down the battery deterioration . .Your cell phone has a battery efficiency program that manages the out put of the energy of the battery this program monitors the way you use your cell phone you have to help the management program to determine the way you use the cell phone Here’s how: 1 Never let the remaining charge in the battery go below 20% 2 recharge your cell phone to 100% preferably overnight 3 the battery has to perform many functions eliminate unnecessary tasks 4 to this end eliminate never or hardly used applications from the cell phones storage memory 5 when at home use the A/C. Charger adapter this will cut down of the use of the battery Therefore increasing its life 6 The illuminated screen on the cell phone draws power go to the setting that controls the illumination and adjust the setting that will reduce the screen brightness How will,you know the battery has to be replaced.Two indicators A. … The battery efficiency indicator is showing 80% B….The fully charged battery at 100% drops to 75% The battery can no longer hold its charge this is when you replace the battery in your cell phone. ",
            "date": "Answered July 31, 2020",
            "views": "22",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sunita Sinha",
                    "user_href": "/profile/Sunita-Sinha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Troy Armistice",
                "href": "/profile/Troy-Armistice"
            },
            "answer_text": "Smartphone battery typically have 500 cycles! Which is 16 months! There's methods of prolonging battery life! Such as use uccubattery app, cause it notifies when a preset charge capacity is reached! (2) charge to 75%, don't discharge under 20%! Essentially ur ur using half battery, but in charge cycles, these patern uses 10%, not half a cycle as our common sense say! Getting in that alone will help u when ur battery suffers a 20% capacity loss! At 80% capacity, a battery is said end of life! Not necessary true, but, capacity decreases faster after 80%! They say, additionally a phone batt can output 2500 cycles? But at that end, one recharge a 5000 ma batt, only recharging 20 ma, and dead at startup? I've noticed on 3700 mAh battery, each 2 full battery cycles worth destroys a mAh battery juice! Unsure, my phone battery capacity ready 3550 mAh, not claimed 3700, they over rate lithium batts alot! So, one can go drain down to 75% -70% rated capacity? I have 3100 mAh left on phone battery! I average 1 cycle a day! (6–7 partial charges)! Phone is 14 months old, total battery consumed 190 amp hours! That being said, my phone consumes 3xs battery consumption daily! I have used 600 cycles! I'll expected to get 800 cycles before fast discharges! Bottom line, don't charge phone overnight! Briefly, like a shower, or a commute! U'll be happy when phone battery endures twice longer! Turning 16 months, into 32 months! Average iphone user replaces every 3 years! Noone I know, Is a serious phone user! I stay on mine 12 hours daily ",
            "date": "Answered October 8, 2020",
            "views": "608",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Summers",
                "href": "/profile/Chris-Summers-22"
            },
            "answer_text": "If used to near completion every day and fully charged every night the average battery will go for two years before showing signs it needs replacing. By the third year it should have been replaced. This is an average and there is always room for more or less time a battery would remain good. Things like shock, weather and temperature, stresses applied to the battery all play an important part in this too. I have my original iPhone , iPhone 3G, and iPhone 4 still with their original batteries. My iPhone 5s got it's battery replaced nearly two years ago as I still use that phone. Six years of use and still updated to the latest iOS , not bad. I also have all my Windows 8 and 10 phones with their original batteries too. As a battery ages it becomes unstable in its power delivery. If you don't stress it then you would never know it but when you do you will see it not last as long on a charge and abrupt shutdowns. They system is trying to pull a certain amount of power to do something and the power can't deliver, the system crashes. So about 2–3 years is expected lifespan of the average smartphone battery. ",
            "date": "Answered September 8, 2019",
            "views": "38",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vladimir Menkov",
                    "user_href": "/profile/Vladimir-Menkov"
                },
                {
                    "user_id": "Vangelis Skarmoutsos",
                    "user_href": "/profile/Vangelis-Skarmoutsos"
                },
                {
                    "user_id": "Aryan Singh",
                    "user_href": "/profile/Aryan-Singh-1835"
                },
                {
                    "user_id": "Srinivasa Rao",
                    "user_href": "/profile/Srinivasa-Rao-1675"
                },
                {
                    "user_id": "Ajinkya Maurya",
                    "user_href": "/profile/Ajinkya-Maurya"
                },
                {
                    "user_id": "Macalegin Electronics",
                    "user_href": "/profile/Macalegin-Electronics"
                },
                {
                    "user_id": "Natehc Kian",
                    "user_href": "/profile/Natehc-Kian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Shindley",
                "href": "/profile/Richard-Shindley-1"
            },
            "answer_text": "The battery has a service life of about 500 full charge and discharge cycles. If you don’t allow the battery to fully discharge between charging events, the battery can last for three or four years before you notice a major reduction in battery performance. I had an iPhone 5s some years ago. It was 3 1/2 years old and I began to think about having the battery changed “just because.” I called a local Apple store to ask about having it changed. They were able to interrogate my phone battery while I waited! I was told it had been charged/discharged 330 times and was operating like new. I learned that iPhone batteries have a chip in them to keep track of such things. That’s why you should never buy a cheap replacement battery online. Often they are old batteries made to look new. It’s the chip inside them that gives away their history. You can’t interrogate that chip but Apple can… ",
            "date": "Answered April 22, 2020",
            "views": "16",
            "upvotes": " Answer requested by Gebo Pol",
            "upvoters": [
                {
                    "user_id": "Paul McQuesten",
                    "user_href": "/profile/Paul-McQuesten-1"
                },
                {
                    "user_id": "Aryan Singh",
                    "user_href": "/profile/Aryan-Singh-1835"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eero Pennanen",
                "href": "/profile/Eero-Pennanen-1"
            },
            "answer_text": "There cannot be a average lifespan for batteries because there is no average user. What I am saying is that you battery willl last long depending on how much a person uses their phone. Different people buy phones for different reasons. There are those that use phones for the basic things like making calls and sending messages. Others add the internet to it while others go an extra mile to play games on their phones. All of these three different people have different battery lives because their power usage is different. Therefore there cannot be an average battery life. You just have to use your battery untill it wears out then get another one. ",
            "date": "Answered June 7, 2020",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Srinivasa Rao",
                    "user_href": "/profile/Srinivasa-Rao-1675"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amritajaatak Roy",
                "href": "/profile/Amritajaatak-Roy"
            },
            "answer_text": "Typical smartphone battery is rated for 400–500 cycles. 1 cycle is the charging and discharging from 0–100% and back to 0% once. So if you charge your brand new battery from 50% to 100, and then drop it back to 50%, its half a cycle. By this analogy, if you charge once everyday at the end of the day during bedtime, assuming it still has 20% when you put it to charge, it will last around 500 days. Actual usage will obviously vary as per usage and a lot of other variables ",
            "date": "Answered July 6, 2019",
            "views": "469",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul D. Beizer",
                "href": "/profile/Paul-D-Beizer"
            },
            "answer_text": "I know I'm paranoid, and this Probably has no basis in fact, BUT, it always seems that the battery starts to go about the same time that a new phone comes out!??? I'm just saying. In reality, I've had them last years ( samsung S4 ) and I've had them last months ( samsung S6 that the battery plumped on after 3 months. Couldn't even send it back through the mail because of fire danger ). After 26 years of using mobile devices I have never been able to find any action or practice that made a battery last longer and only one that definitely killed it quicker. ( repeated full drain and charge) ",
            "date": "Answered July 30, 2020",
            "views": "608",
            "upvotes": " Answer requested by Gebo Pol and Susan Obijiski"
        },
        {
            "author_info": {
                "name": "Ted Hall",
                "href": "/profile/Ted-Hall-1"
            },
            "answer_text": "If the battery is recharged at about 20-30% remaining charge, kept at room temperature (not too hot or cold) while charging, and charged on a charger matching the OEM manufacturer’s specs… 500–1000 charging cycles are pretty routing.Leaving a phone on the dashboard of your car while charging, or at sub-zero temperatures considerably shortens the life expectancy. As with all things though; your mileage may vary ",
            "date": "Answered June 13, 2019",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Mccullough",
                "href": "/profile/John-Mccullough-26"
            },
            "answer_text": "Li-ion batteries do age with time and state of charge, it is the nature of the battery chemistry, and is also a trade off in terms of cell phone design requirements. A Li-ion battery ages much faster at above 80% charge, yet cell phone batteries are charged to the max every day. This is because people demand smaller, lighter phones and are willing to buy another phone every 3 years. Battery degradation helps sell new phones too- you can’t stand a phone with only 70% max capacity after 3 years, so rather than stick with a phone that needs a specialist to replace the battery anyway, you purchase the new phone with better “features”. ",
            "date": "Answered July 30, 2020",
            "views": "394",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dean Riddell",
                "href": "/profile/Dean-Riddell"
            },
            "answer_text": "Depends on the brand of phone After 500 charge cycles you will start to get reduced performance - performance will continue to reduce from there It is gradual so you may not even notice it initially - until you get a new battery or new phone and realise what you have been missing Your phone should have a diagnostics - on iPhone it is Settings -> Battery ",
            "date": "Answered June 13, 2019",
            "views": "854",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Rick van Rossum",
                "href": "/profile/Rick-van-Rossum"
            },
            "answer_text": "Some phone manufacturers claim that a battery will be down to 80% of its capacity after 500 full recharge cycles. In real life you could expect 4 to 5 years as a useful life when you can’t get through a normal day of use. ",
            "date": "Answered July 7, 2019",
            "views": "149",
            "upvotes": " Answer requested by Marcia Walsh"
        }
    ]
}