{
    "title": "What are the best computer mice for big hands? - Quora",
    "tags": [
        "Computer Mice",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Sivan",
                "href": "/profile/Justin-Sivan"
            },
            "answer_text": "Hello, Dear I’ll recommend some cool and unique computer mice to you. Razer Naga Trinity The Razer Naga Trinity is not only the most comfortable gaming mouse I’ve used to date, it’s also the most functional for both gaming and productivity.  Designed to provide you that edge you need in MOBA/MMO game-play, the Razer Naga Trinity lets you configure your mouse for everything from weapons to build customizations so you’ll always be ahead of the competition. You will have the power of total control in your hand, no matter what game you play.  Equipped with the world’s most advanced 5G optical sensor with true 16,000 DPI, the Razer Naga Trinity is optimized for precision and speed, ensuring movements are swift, your spells are on target, and that you get out of the fire when battles turn intense. Each button is designed to stand out so you’ll never misclick, providing tactile and audible feedback so you’ll be assured of every actuation. With interchangeable side plates for 2, 7 and 12-button configurations, transmute your mouse to suit your gameplay. The more buttons you have instant access to, the greater your advantage becomes. With up to 19 programmable buttons, be spoilt for choice whether you’re assigning just the essentials or going full-out to bind item hotkeys, spells or any other in-game commands you need. SteelSeries Rival 700  SteelSeries Rival 700 is, in my mind, one of the best gaming mice that has ever been manufactured and one of the top choices of the most furious hardcore gamers. And it's meant for people who want all the performance and all the extra bells and whistles they can get out of a gaming mouse.  It is outstanding in many ways but I will talk about the OLED side screen, which is the signature feature. That’s right, it actually has an OLED screen which displays many things, be it team logos or animations, your current in-game health or kill count, your own personal made logo and many more. It definitely is a great feature for the ones who want more eye-candy on their gaming mice. But there are also people who find it useless. What’s worth mentioning is, the in-game information that you can display is limited to some of its supported games, such as CS: GO, DOTA 2, Minecraft and etc. You can actually create your own by getting your hands dirty with some coding, but it’s a little bit complicated process for people who aren’t into computer programming. Sanwa Supply Wireless Ring Mouse The Japanese Sanwa Supply Wireless Ring Mouse is definitely not a bad choice for someone who wants a wireless ring mouse. I've used it for several presentations and it allowed me to take command of the room and guide everyone in a smooth manner. It seemed that everyone \"oohed\" when they finally discovered how I was changing the slides. The clicker had no hiccups in terms of response and it function exactly as I expected it to. The device also has a storage area for the USB insert in addition to the fancy leather pouch for easy transport.  I like this little mouse: it needs some practice to get used to it but it is all related to how much practice, very sensitive to movements. It sits on your finger and is operated with your thumb. The middle button is right-click, the right button locks the mouse into scrolling mode, the top button locks the area under the pointer for dragging, the left button is left-click, and the bottom button is a back button. That sounds a bit complicated, but five minutes of use will have you clicking the correct button to perform the action you need without even thinking about it.  I've used it on a Linux system, a Windows system, and on an android tablet, it functioned quite well on each. Pointer control is slightly less precise than with a conventional mouse, but practice overcomes this. I frequently use a laptop on my lap without a place to use a conventional mouse. Of course it has a trackpad but no matter what settings I make to the trackpad, I am constantly brushing it with my palm while typing and sending the cursor flying away from its proper position. With this ring mouse, I can turn off the trackpad and work without that annoyance. This is one little tech-toy that will be going with me everywhere. VivoMouse Metallic Edition WT720 VivoMouse is an innovative device that integrates all the functionalities of a touchpad, wireless remote and optical mouse. The large circular touchpad provides full Windows 8 multi-touch gesture support, which allows you to use cursor control with just one finger, even when you’re using a non-touch enabled device. Also, it recognizes touchpad gestures such as page up/down swipe, pinch-zoom in and out, and other multi-finger inputs to improve on your computing experience, you can switch between mouse or touchpad modes on-the-fly.  VivoMouse works as a standard optical mouse, with the touchpad working as both the left and right click buttons. With 1200 DPI and a 2.4GHz RF link to your PC, VivoMouse provides accurate input each and every time. It comes with a premium platinum white design and gives you the versatility with a cool, metallic feel.  To sum up, it is optimized to give you one-handed control over the cursor with just your fingers. It is the perfect peripheral for a home theater PC, allowing you to easily navigate your music or video library while away from the computer. Click here to see more product reviews. ",
            "date": "Answered October 30, 2018",
            "views": "894",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ava Farrugia",
                "href": "/profile/Ava-Farrugia-2"
            },
            "answer_text": "Mice in 2019/2020 are greatly different from the ones in 2018. New companies and startups have emerged that have developed lightweight technologies, and made their mice easier to wield. The Zowie EC-1 is an ergonomic mouse and is a favourite for FPS gamers. The shape is in a natural position, making it comfortable to hold during long hours of playtime. It suits claw grip players , but fingertip grip works best for this mouse. The Intellimouse Pro is an old classic, but still holds up today. This is another ergonomic mouse and has two side buttons like the Zowie EC-1. The weight might turn you off though, because it weighs over 100 grams. ",
            "date": "Answered December 19, 2019",
            "views": "250",
            "upvotes": " Answer requested by Nelson Vidinha"
        }
    ]
}