{
    "title": "What has been one of your greatest teaching experiences? - Quora",
    "tags": [
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Yang",
                "href": "/profile/Jason-Yang-162"
            },
            "answer_text": "By being me in class. Students who have attended my class all know that my class, with me sputtering nonstop on the podium for what seems to be forever, could bore them to death. But they couldn't know that my teaching style in the past was dramatically different. When I first became a teacher, my inherent introversion had determined that I would be a shy, boring, soft-spoken and mild-mannered teacher. In fact, I didn't know what else to say except the rigid contents of the textbooks. Students dismissed me as another tedious guy among their sleep-inducing and mind-numbing teachers, until one thing happened--- One day as I was humming and droning English sentences from the textbook, I suddenly remembered one Chinese punchline. Since it was quite handy, I hurled it out to my students. Before I proceeded with my rigid style, to my great surprise, the entire classroom exploded with laughter. It was as if the class had sprung into life from death. Girls, with rosy colors on their cheeks, lifted their eyes towards me in shy admiration; boys, with gleams of excitement in their eyes, bolted up and clapped their hands. I could tell they had certainly found a gem among their collection of bookish teachers. Confidence and self-gratification immediately boosted up my ego. It was colossal. The air was scented with my pride. From that class onwards, I tried so hard to gather from the Internet bits of one liners, punch lines and laugh-inducing stories. Sometimes, applying these jokes with me as the one who experienced them was epic flop. But most of the times, my comedian style of teaching with dead pan delivery of killer lines was very much accepted among my students because compared to other nerdish teachers, I was such a rarity. Savoring their laughter, their excitement, and most importantly, their attention on me was sweet and satisfying. But what I didn't know then was that something unpleasant was looming large on the background. Something that would catch me off guard and send me into pangs of self-reflections. It all happened on that fateful day. After I called it a day and was preparing to pack and leave, I felt a forceful pat on my left shoulder. Turning around, I saw a girl, with a smile that spread cross her entire face, standing beside me and stared at me as if I had been her fellow student. I don't remember what exactly she said, but her manners and her wording made me very disconcerted. My innate introversion, my dignity as a teacher flooded in my heart and then violent indignation kicked in: I should not have been treated like this, a clown, an object of ridicule and a joke cracker. And I will not be treated like this, forever. That incident catalyzed a series of violent adjustments in me. I stopped wasting my time collecting those lame and tacky jokes and stories; instead I focused more attention on my self-improvement as a teacher. Indeed, there is an air of rigidity and even clumsiness about my class, but I reward my students with sincerity, seriousness and scholarliness. Besides, this style is perfectly compatible with my introverted personality and I love it. Metamorphosis or back to Mediocrity? Well, I don't care. Not anymore. ",
            "date": "Answered October 13, 2016",
            "views": "351",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cindy Yang",
                    "user_href": "/profile/Cindy-Yang-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pragya Choudhary",
                "href": "/profile/Pragya-Choudhary-4"
            },
            "answer_text": "I am not a teacher by profession, but I've taught my juniors since I was in the tenth grade (14 y/o). My first student was Joisy John. She was two years younger to me and was stuggling with mathematics. She began loathing it, digits were her biggest nightmare. When I went to meet her on 1st October, 2014, I was certainly not happy with her condition and the way she had performed miserably in her previous exams. I started teaching her Quadrilaterals. Two weeks later, I gave her a test. She scored a zero in that. I was infuriated as I had worked hard in teaching her. I reprimanded her for not being able to understand and retain. As we progressed, Joisy began picking up. The pace was slow and I had to put in additional efforts to help her sail through maths. This would imply teaching topics twice, giving worksheets, assessing periodically. I went on to teach her for 2.5 years. I passed my grade 12 while teaching her for grade 10. I must admit, I haven't seen a student working as hard as Joisy. She would stick papers on walls and write her targets with chalks. She would cry, cry alot when I'd scold her. But you know what, for those 2.5 years, she never ever failed in maths. Of course, she never scored a full on full, but her graph had significantly risen. Not once she failed in the subject. I'm so proud of you, Joisy. She has still kept the first question paper I gave her, the way I've written a big zero on the sheet, the diary in which I would make random figures to explain geometry. Joisy is a sweetheart. It's been more than 1.5 years since I moved out of school, but I'm still attached to her. I will always be. I have told all my later students about her. Whenever I get time, I go to see her and she always tells me how much she loves me. We sometimes walk hand in hand, eat together, exchange clothes and sandals, discuss the school. The bond has grown over time. John Ma'am and Joy Sir always tell that I'm a daughter to them. I've come to realize that I've not just taught, I've groomed relations in the process of teaching. I later taught my Professor's daughter who still spams my inbox with messages related to academics, my eyebrows, Kamla Nagar and how much she misses me. At present, I'm mentoring a young boy called Garv who lives away from his mother in the city for a good education. He needs help in English and it's been 4 months since I've taken care of that. The other day, I talked to his mother and she told me that Garv said the following words, “Where will I find Pragya Didi when we shift to another city?” I was glowing with happiness. It is true that I earn because I teach. But it is equally true that I've never asked for it from anyone- no matter how capable the person was of paying me. Whatever they give is out of their own happiness, as a payment of my hard work. When I am teaching, my phone is never in my vicinity and my heart is into teaching, as if I were helping my own child with studies. I don't know- it gives me sheer bliss, peace, relaxation and a sense that I've been able to contribute something to the society. I hope all those kids do great in their lives. :) Pragya Choudhary. ",
            "date": "Answered August 27, 2018",
            "views": "516",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Skj-24"
                },
                {
                    "user_id": "Harshini Gulipalli",
                    "user_href": "/profile/Harshini-Gulipalli"
                },
                {
                    "user_id": "Simran Verma",
                    "user_href": "/profile/Simran-Verma-59"
                },
                {
                    "user_id": "Shobhit Sharma",
                    "user_href": "/profile/Shobhit-Sharma-221"
                },
                {
                    "user_id": "Bhavya Tayal",
                    "user_href": "/profile/Bhavya-Tayal-4"
                },
                {
                    "user_id": "Abhishek Oza",
                    "user_href": "/profile/Abhishek-Oza-3"
                },
                {
                    "user_id": "Arth Doshi",
                    "user_href": "/profile/Arth-Doshi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Barr",
                "href": "/profile/Steve-Barr"
            },
            "answer_text": "I was visiting an after-school program in a rural community for a week, teaching the elementary students how to draw cartoons.  On the first day, as the kids filed in, one little boy ran to the back of the room crying.  His teacher immediately began yelling at him, telling him that he was \"bad\".  He was sobbing, so I asked the teacher to let me handle it. I walked back to where he was crying and asked him what was wrong.  He said, \"I'm not an artist!  I'm a WRITER!\"  I smiled and told him that if he grew up to write children's books, that would be wonderful.  But if he also learned how to illustrate his own books, he would get to keep all of the money instead of having to share it with his illustrator. He looked up at me and said, \"Really?\"  I said yes, and promised him that I could teach him how to draw.  That's when the truth came out.  He told me that his teacher made him sit in the back of the room because he was \"bad\", but he misbehaved because he had very poor vision and couldn't see the front of the room.  That's when I noticed how thick the lenses were on his glasses.  I promised him that I would let him sit right next to the easel I was teaching lessons on, and that he could be my helper all week. As I guided him back to the front of the room, his teacher repeated that he was bad and that he needed to sit in the back.  I asked her to step out into the hallway so that we could talk privately.  That's when I told her that Jamal was my student while he was in my classes. The school Superintendent and the Principal had seen fit to bring me in for a week-long visit, and had entrusted those kids to me.  She got quite angry and began yelling at me, so I suggested that we go pay a visit to the Principal and explain to him what was going on.  She stormed off, and I put Jamal right next to me at the easel. He absolutely flourished.  Not once did he cause a problem, and his behavior was exemplary.  And, during the week, he brought some of his writing to school to show to me.  It was amazingly advanced for a fifth grader, and I was impressed.  One of his papers had even won an award from the Principal. At the end of the week, he ran up and gave me a big hug as I was leaving.  He smiled and said, \"You know what?  When I grow up, I'm going to write and illustrate all of my own books.  Know why?  'Cause I CAN!!!  And, because I'll get to keep ALL of the money! Look for them in a bookstore in a few years!\" That little guy made my week and touched my heart.  And I keep looking for his books on the shelves at the local bookstore.  Know why?  Because I KNOW one day I'm going to see them there! ",
            "date": "Answered January 2, 2014",
            "views": "605",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arphakorn Wellchan",
                    "user_href": "/profile/Arphakorn-Wellchan"
                },
                {
                    "user_id": "Masuma Mirza",
                    "user_href": "/profile/Masuma-Mirza"
                },
                {
                    "user_id": "Erik Philips",
                    "user_href": "/profile/Erik-Philips"
                },
                {
                    "user_id": "Taylor Su",
                    "user_href": "/profile/Taylor-Su-1"
                },
                {
                    "user_id": "Dan Birchall",
                    "user_href": "/profile/Daniel-J-Birchall-1"
                },
                {
                    "user_id": "Rohan Sharma",
                    "user_href": "/profile/Rohan-Sharma-31"
                },
                {
                    "user_id": "Cynthia Ward Hemminger",
                    "user_href": "/profile/Cynthia-Ward-Hemminger"
                },
                {
                    "user_id": "Joel V Benjamin",
                    "user_href": "/profile/Joel-V-Benjamin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nivedita Tiwary",
                "href": "/profile/Nivedita-Tiwary-5"
            },
            "answer_text": "Before anything, let’s just be clear that I am no professional teacher and hold no experience whatsoever, it’s just that in life at somepoint we’re all teachers maybe academically or otherwise, and most certainly we are students till our last breath. So this is an incident that requires a little backgroud build up. I was an ICSE board, boarding student who managed to score well. I was particularly very good at economics, since it used to be a tough part of our curriculum so people would ask me to help them with the same. I would teach them all the topics in different small-small groups (batches) so that they felt more attended to and comfortable. This was equally beneficial for me as I never had to revise the subject, not even before the final exams. There would be numbering system for me and proper time slot distributions for teaching each group. This continued for 3 years, upto class 10 after which I had to leave economics with a heavy heart to pursue medicine. In this time there was a student (I’d like to maintain the anonimity) who was detained in class 8 so she was practically my senior. Since, she was not of our batch originally she was not comfortable in studying with any particular group and asked me to help her personally. I agreed. For 3 continuous years I taught her at late nights, and gradually she asked me to cover up english and other subjects as well. Nevertheless, when we were promoted to class 9 she opted for commerce with economis, even though I was a science student she asked me to help her in commerce as well, I did much as I could. So according to her I became her lifeline and I was good with the situation too. Class 10 ended and we parted in the year 2012. It was last month that I received a call from her (we were not in regular contact as medical preparations take away your social life). She started saying that she is very thankful that I happened to her, I helped her develop interest in studies by making things simpler and digestable and that I could bring out her hidden potential. Saying all this she thanked me multiple times and even ended up saying that had I not been there she would not have become what she is today. Currently she works for Indigo and leads a happy settled life. She did exist in the back of my mind but never did it occur to me to contact her, only through facebook I came to know about her whereabouts. It was when she called that it stirred up a whole lot of emotions in me, it was the first time anybody had said those things to me and I cannot describe in words how I felt then. Somebody attributing their success and everything to you, it’s very different a feeling to be framed in words. Well, I hope the best for her and she did made my day with that call. ",
            "date": "Answered August 19, 2019",
            "views": "249",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaya Gorai",
                    "user_href": "/profile/Jaya-Gorai"
                },
                {
                    "user_id": "Aishwarya Singh",
                    "user_href": "/profile/Aishwarya-Singh-594"
                },
                {
                    "user_id": "Akanksha Kumari",
                    "user_href": "/profile/Akanksha-Kumari-71"
                },
                {
                    "user_id": "Aslin Subha",
                    "user_href": "/profile/Aslin-Subha"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Just-Human-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luis Von Ahn",
                "href": "/profile/Luis-Von-Ahn"
            },
            "answer_text": "I really enjoyed teaching 15-251, “Great Theoretical ideas in Computer Science.” It was usually taken by 200 students every semester, and was usually the hard class they’d ever taken in their lives. As such, I enjoyed being machiavelically evil. Here’s an actual student evaluation that captures what the class was like: When you dedicate so much time, and so much of your grade, to a single class, working on a single assignment, all to appease some diabolically cruel professor, you stop thinking clearly. You become paranoid. Von Ahn has become something like Big Brother among us students. We are wary of doing anything which might even slightly contradict the rules. We are --sometimes literally -- constantly looking over our shoulders with paranoid delusions that Von Ahn could be lurking behind every proverbial corner. This may be the image that Von Ahn wants to convey, and it may be necessary to *control* the behavior of his students and ensure that they do not cheat; but I was always taught that it is often ethically superior to be *respected* rather than *feared*; though it is probably pragmatically superior on Von Ahn's part to be *both* respected and feared. I do respect him. But Jesus do I fear him. ",
            "date": "Answered January 12, 2016",
            "views": "142",
            "upvotes": " View 234 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maruf Hassan",
                    "user_href": "/profile/Maruf-Hassan-8"
                },
                {
                    "user_id": "Shreya Vora",
                    "user_href": "/profile/Shreya-Vora"
                },
                {
                    "user_id": "Trung Trinh",
                    "user_href": "/profile/Trung-Trinh-8"
                },
                {
                    "user_id": "Kohyar Shaikh",
                    "user_href": "/profile/Kohyar-Shaikh"
                },
                {
                    "user_id": "Anand Kumar",
                    "user_href": "/profile/Anand-Kumar-116"
                },
                {
                    "user_id": "David Huang",
                    "user_href": "/profile/David-Huang-142"
                },
                {
                    "user_id": "Alperen Doğukan",
                    "user_href": "/profile/Alperen-Doğukan"
                },
                {
                    "user_id": "Tanomi Ujjwal",
                    "user_href": "/profile/Tanomi-Ujjwal"
                },
                {
                    "user_id": "Jayesh Mitra",
                    "user_href": "/profile/Jayesh-Mitra"
                },
                {
                    "user_id": "Ayush Sharma",
                    "user_href": "/profile/Ayush-Sharma-1764"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aley Crooker Martin",
                "href": "/profile/Aley-Crooker-Martin"
            },
            "answer_text": "I had my freshmen composition class go outside and write what they saw, thought felt and experienced one day and were to take about ten minutes to do so. One student came back satisfied with his work and each shared their experience with the class. This student had seen an old man walking around a pond at the college and had wondered about him, who he was, why was he alone, where was he going, and wrote of his measured steps as he made his way about. About 3 months later, after the ice on the pond cleared in the winter, a morgue vehicle was parked next to the pond and a diver underneath the pond. The students filed in quite disturbed as one might expect. The diver found the old man who had been in the pond for what might have been probably about 3 months. Whether he fell in after my student saw him that day or not, one never will know, but the impact on my student nonetheless was palpable. He was so upset feeling as though he was so close to that man, yet so far away. I spoke quietly to the student telling him of the impact of his \"Seeing\" that mans humanity by recording it in his journal that day. So many times we walk by others, especially drunk or homeless people without a glance. This time, this young man \"saw\" this man and wondered about him, worried about him and clearly was interested in him. That, to me was a lesson in humility and love.  I shall never, ever forget that young boy, his journal exercise or what happened that term. Ever. ",
            "date": "Answered January 5, 2014",
            "views": "274",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Om-Alia Bastet",
                    "user_href": "/profile/Om-Alia-Bastet"
                },
                {
                    "user_id": "Joel V Benjamin",
                    "user_href": "/profile/Joel-V-Benjamin"
                }
            ]
        }
    ]
}