{
    "title": "What is integrated power supply? - Quora",
    "tags": [
        "Power Supplies",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Eggleston",
                "href": "/profile/John-Eggleston-6"
            },
            "answer_text": "Very simply it is \"just what it says on the tin\" it is a power supply which is integrated into the equipment. If the equipment plugs directly into the mains then it has either an integrated power supply or works directly from mains voltage. If you have a charger or power module that you plug into the mains, this is a separate or external power supply. Most low power equipment will have a separate power supply, mobile phone, tablet, laptop and even some printers and TV's. This is because they work from voltages which are much lower than the mains power supply delivers. Some equipment will have an integrated power supply which transforms the mains voltage down to a lower DC voltage. Both integrated and separate or external power supplies serve the same function. That is to transform the incoming AC mains voltage down to the lower DC voltage that the equipment actually needs. The choice of designing equipment with or without integrated power supplies is normally based on size constraints. For instance it would be nonsensical to carry around a mobile phone with an integrated power supply (also potentially dangerous). Manufacturers strive to outdo their competitors by making things smaller and lighter. Because power supplies take up space it makes sense to supply them as a separate module. There are also batteries which you could perhaps consider as integrated power supplies although this isn't really the same or correct terminology. You still need an integrated or external power supply to charge those batteries. Higher power devices such as heaters, fans, fridges, cookers vacuum cleaners etc, run directly from the mains and work from the 110–220v so they don't require either an integrated or external power supply module. ",
            "date": "Answered July 26, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jagamohan Mirdha",
                    "user_href": "/profile/Jagamohan-Mirdha"
                }
            ]
        }
    ]
}