{
    "title": "What is Tesla's competitive advantage? - Quora",
    "tags": [
        "Competitive Advantage (business)",
        "Battery Electric Vehicles (BEV)",
        "Business Competition",
        "Electric Vehicles",
        "Electric Cars",
        "Tesla (company)",
        "Automotive Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Donohue",
                "href": "/profile/Patrick-Donohue-2"
            },
            "answer_text": "What is Tesla's competitive advantage? Let me count the ways. The following are just a sampling of the advantages.  \t•\tThe stated goal of the company is to make and sell the very best automobile in the world that happens to be electric. They are doing that with the \"creme de La creme\" of talent.  Given the rave reviews from the Automotive Press and the recent outstanding safety rating from National Highway Traffic Safety Administration (safest car).  Tesla is well on the way to achieving that goal and selling a surprising number of cars in the process. \t•\tTesla is the Alpha of cult companies. \t•\tElon Musk and his team, an incredible breadth and depth of talented people who comprise the company.  \t•\tChris Porritt, VP Vehicle Engineering, whose previous job was Aston Martin's Chief Engineer of Vehicle Engineering.  Chris is a world-class leader and automotive engineer who established Aston Martin's Vehicle Engineering team from the ground up and used his innovative approach as Chief Engineer for Aston Martin's One-77 supercar. The One-77 was best known for its advanced structural design combined with cutting edge active suspension and aerodynamics. These combined to make it one of the fastest cars in the world.  \t•\tPeter Carlsson, VP Supply Chain, previously from NXP Semiconductors where he took the purchase organization from a tactical decentralized structure to a strategic global commodity organization. \t•\tGreg Reichow, VP of Powertrain Operations, hails from SunPower, where he led manufacturing growth from small prototype scale to high-volume manufacturing across several factories.  \t•\tRavi Simhambhatla, VP IT and Business Applications, who was a founding team member and Chief Information Officer at Virgin America, Ravi led the development of the award-winning airline’s pioneering customer friendly technology platforms and the company’s website. \t•\tJohn Hillegass, VP Design and Retail Development, with 25 years in construction management and retail development experience including at Apple where he oversaw the development of hundreds of new stores.  \t•\tGeorge Blankenship, VP, Sales & Ownership Experience, who was the mastermind behind the Apple stores. At Tesla, George's goal is to re-imagine the way people buy cars, forgoing the traditional dealership model in favor of stylish, consumer-focused showrooms. \t•\tGilbert Passin, VP, Manufacturing, has 23 years of international automotive experience. He has led some of the most high-profile divisions at Toyota, Volvo, Mack and Renault across North America and Europe. Prior joining Tesla, Gilbert served as general manager of production engineering West Coast for Toyota North America and Chief Production Engineer for the future Corolla in North America. Prior to Toyota West Coast, Gilbert was vice president of manufacturing at the award-winning TMMC Toyota plant of Cambridge, Ontario which produces over 350,000 vehicles per year. Gilbert launched the best-selling Lexus RX 350 luxury SUV at the award-winning plant which is the only Toyota site to produce a Lexus vehicle outside of Japan. He also launched the award-winning tenth generation Corolla, one of the most popular automotive models worldwide which is widely acknowledged as the global leader in its class for quality and durability.  \t•\tDiarmuid O'Connell, VP, Business Development, in which capacity he manages commercial relationships and all aspects of government affairs. Before joining Tesla, Diarmuid served as Chief of Staff for Political Military Affairs at the US State Department, where he was involved in policy and operational support to the U.S military in various theaters of operation. \t\tBefore his tenure in Washington, Diarmuid worked in corporate strategy as a management consultant for Accenture, as a founder of educational software developer, Real Time Learning, and as a senior executive with both McCann Erickson Worldwide and Young and Rubicam. Over the course of his career, he has managed international operations, projects and marketing for such brands as Coca Cola, Gillette, and AT&T, among others. \t•\tFranz von Holzhausen, Chief Designer at Tesla who designed the Model S and X.  Franz is responsible for driving the overall design direction of Tesla, and is charged with establishing a world class design competency for all future Tesla design concepts and production vehicles. \t•\tJB Straubel, CTO, and his Stanford Engineering Team. As a co-founder of Tesla, JB has overseen the technical and engineering design of the vehicles, focusing on the battery, motor, power electronics, and high-level software sub-systems. Additionally, he evaluates new technology, manages vehicle systems testing, and handles technical interface with key vendors. \t•\tDeepak Ahuja, Tesla's Chief Financial Officer, formerly from Ford, where his career included assignments in all aspects of the business, including Manufacturing, Marketing and Sales, Treasury, Acquisition and Divestitures.  \t•\tJay Vijayan, Chief Information Officer, brings more than 17 years of IT, Applications Development and Management experience. Before joining Tesla Jay was the Sr. Director, IT Business Applications for VMware. Jay was leading the Applications Development of all business applications for VMware during the extreme accelerated growth of the company from being 700 Million to close to 4 Billion annual revenue during the period 2007-2012. Jay’s team developed and delivered/implemented almost all of the business applications including the web portal for VMware during this accelerated growth period. Prior to that Jay was in different Applications Management positions at Oracle. Jay is proven and specialized in efficiently operating and delivering sustainable IT solutions in an extremely faced paced, high growth organizations and in turning around large IT programs and organizations successfully. \t•\t Arnnon Geshuri, VP of HR, is responsible for driving HR operations and the global recruitment efforts. Previously, Arnnon was director of staffing operations for Google, where he designed the company’s legendary recruitment organization and talent acquisition strategy. \t•\tJerome Guillen, Director of Model S Programs, Jerome oversees all programs related to the development of the Model S, working with all functional groups across Tesla to bring the Model S to market. Prior to joining Tesla, Jerome created and led the Business Innovation department at Daimler, reporting directly to the chairman of the board of management. As Director, Jerome generated growth for the group and fostered entrepreneurship through a variety of initiatives. Before creating the Business Innovation department, Jerome worked with Freightliner LLC as General Manager of the Cascadia program, responsible for the development and introduction of a new generation of Class 8 trucks. Jerome managed all aspects of the development of the product line, including engineering, marketing, finance, purchasing, manufacturing, and quality control. \t•\t\"The general understanding is that if you're at Tesla, you're choosing to be at the equivalent of Special Forces. ... That has pluses and minuses. It's cool to be Special Forces, but it also means you're working your ass off. It's not for everyone.\"-Musk \t•\tTesla contracted with High Street Partners to handle HR paperwork for their international expansion. “Engaging HSP allowed us to focus on getting the best people hired and productive in the shortest possible time.”-Tesla \t•\tThe ability to take an idea from concept to execution light years faster than any of their competition. Regarding innovation, Jerome Guillen, former Director, Business Innovation at Daimler AG, made this observation about the difference between how innovation takes place in a major auto company, compared to how it does at Tesla. He told the Automotive News, “we are doing things in a couple weeks that, at my previous employer, would have taken two years.”  \t•\tThe location of Elon Musk's desk, on the factory floor. \t•\tTesla spends no money for advertising.  \t•\tThe Tesla battery \"cell chemistry is improving and a 4-500 mile pack is not that far away… The charging speed will be increasing … the chemistry and several of the components are designed by Tesla and nobody else has anything as advanced. \" According to JB Straubel Chief Technology Officer. \t•\tThe deep relationship Tesla has with Stanford University and their various research labs. \t•\t People who buy the car let friends and family drive it. \t•\t Twenty-five percent (25%) of test drives turn into sales. \t•\t The car improves while you sleep with firmware upgrades. \t•\t Cost of ownership and operation are substantially less than competition in the Luxury Category. \t•\tThe Model S has the most cargo space of any car in its class – 31.6 cubic feet.  The Model S rides like a Rolls Royce and drives like a Ferrari.",
            "date": "Updated October 21, 2013",
            "views": "232",
            "upvotes": " View 120 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hallie Dunn",
                    "user_href": "/profile/Hallie-Dunn-3"
                },
                {
                    "user_id": "Gavin Brazg",
                    "user_href": "/profile/Gavin-Brazg-1"
                },
                {
                    "user_id": "Neel Javia",
                    "user_href": "/profile/Neel-Javia-2"
                },
                {
                    "user_id": "Sami Stilicho",
                    "user_href": "/profile/Sami-Stilicho"
                },
                {
                    "user_id": "Vipul Gupta",
                    "user_href": "/profile/Vipul-Gupta-95"
                },
                {
                    "user_id": "Lyle Paskowitz",
                    "user_href": "/profile/Lyle-Paskowitz"
                },
                {
                    "user_id": "Keshav Reddy",
                    "user_href": "/profile/Keshav-Reddy-6"
                },
                {
                    "user_id": "John A. MacKay",
                    "user_href": "/profile/John-A-MacKay"
                },
                {
                    "user_id": "Zhipeng Wang",
                    "user_href": "/profile/Zhipeng-Wang-13"
                },
                {
                    "user_id": "Howard Brazee",
                    "user_href": "/profile/Howard-Brazee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Kent",
                "href": "/profile/Brian-Kent-5"
            },
            "answer_text": "Tesla's \"competitive\" advantage is that they essentially do not have any serious competition. They show all the signs of a company fully ready to take over the market, and not just any market, but the global market for personal transportation.  Tesla is the one company that recognizes fully and completely the ramifications of the imminent storm which is heralded by the end of the \"oil age.\"  To extend the analogy, Tesla is the only company that is investing all of its energy and brainpower on producing umbrellas for that storm as fast as it possibly can. The facts are very simple, and ought to be obvious for anyone who looks at things with a semblance of care: 1. Oil is running out.It's been worried about before--possibly sooner than was necessary--but now the problem of it is much closer to hitting home. Oil has already passed $100/barrel before, and even if it goes back to $60/barrel, as some analysts think it might, the \"writing is already on the wall\" for the oil industry. Resisting the change of things will simply be more costly than embracing it. Gas will never again cost consistently less than $3 in the US, to say nothing of the average price worldwide. Considering that the US average fuel economy for vehicles is still less than a paltry 27 mpg, this STILL leads to a fuel cost of 11.1 cents per mile! Compare that to the fuel cost of electricity to move a vehicle--even using Hawaii's staggering 32 cents per kWhr--and you very quickly learn that an electric car--which easily gets 3 miles per kWhr and generally averages 4 or more is much more economical to operate.Worst case 10.7 cents per mile, average 8 cents per mile where electricity costs the most. Annual Electricity Price Comparison by State In Iowa (6.44 cents per kWhr) this leads to a paltry 2.15 cents per mile at worst and 1.61 cents per mile more typically--either of which is many times better than even the most fuel efficient of gas cars. 2. Even if oil weren't running out, it appears to be causing problems UNRELATED to it running out, and people are \"noticing.\"We might well be frying our planet. Sensible people view it as a risk; self-interested nonsensible people are waiting for the data to be \"universally conclusive\"--which is to say they're waiting for it to be too late before they decide its worth changing the path. This is essentially no different than seeing a gun pointed at your head and waiting until the trigger gets pulled before you decide to move. 1 & 2 are stimuli for change. They provide a unique, never-seen-before opportunity. It's been said many times and in many ways, but to quote Warren Buffett (who just lost $1 billion on IBM \"before lunch\"--sorry, \"Oracle\"...): Where others see opportunity, see risk, where others see risk, see opportunity. Elon Musk, as \"maverick\" as he may seem, simply sees the confluence of several factors that others still appear \"dull\" to. His is a \"chutzpah\" that is related largely to the fact that he's just plain added things up correctly and used the results of the equation with ruthless indifference to the status quo. Everyone knows these things: We need to travel different placesIt requires energy to do thisWe can't afford to continue utilizing oil for thisEven if we could, we simply will not be able to pretty soon (the \"well\" is running dryElectricity is a viable means of powering vehicles. It is proven.Electricity can be created in countless different ways.The basic infrastructure for electricity is already in place.Internal combustion (ICE) vehicles have undergone over a hundred years of optimization, while batteries, solar power generation, etc. are essentially in the infancy of their development. Tesla as a company simply adds them all together and bets wholeheartedly on a roulette wheel that it knows for a fact is going to land on green. \"It\" (Tesla) has completely specialized in the field.It doesn't worry about hydrogen fuel cells or \"water as a fuel\" or any other kind of path--because it knows that if it fashions a big enough steamroller to pave the path for electric vehicles, the rest of those paths will wither up and become dead ends. It has obvious results to show for its specialization.It produces critical components (most notably its batteries) at the lowest cost of any \"competitor\" and it does this by taking advantage of efficiencies of scale, in particular. The planned Gigafactory is a textbook definition of that strategy. Its vehicles are designed to be as good as or better than any other vehicle made. It doesn't set its bar low; it is a competitor that realizes its only real competition is itself. It doesn't bother to worry about the \"competition\" because in doing the best it can it renders that competition irrelevant. The cost curve for oil is going up--very rapidly if you consider the carbon cost as relevant (a factor people are beginning to count.) The cost curve for batteries is going down--very rapidly for a company that focuses on that factor like a laser beam. This ultimately means that Tesla is within 10 years of producing vehicles that are not simply superior in performance capacity but superior in sticker price AND superior in operational cost.  When this happens, whether it's in 3 years, 5 years, or 10, prejudice toward \"my tried and true gas car\" will give way to economics: no one in their right mind is going to drive a car which:a) costs more to buyb) costs more to operatec) costs more to repaird) is operationally inferiore) damages the atmosphere to a greater degreeANDf) takes longer to fuel.Battery Swap | Tesla Motors If you're searching for a reason why Morgan Stanley's \"hugely bullish\" report is wrong, you're searching in the wrong direction. The only way they might be wrong is if they haven't been hugely bullish enough. [Note: I currently drive a 2013 Nissan Leaf, and although it is a truly excellent vehicle--the best I've ever owned--the main reason I have it is because I couldn't afford a Tesla. At the time of purchase (Dec. 20, 2013) they told me that the 24kWhr battery of my car made up $17,000 of the total cost to produce. Current figures indicate that Tesla could produce such a battery for approximately $5000-$6000. This would have dropped the purchase price--with incentives--down to about $12,000, making it by far the cheapest production car of its quality in the world--with the added benefit of at least (a) through (e) above, and (f) being essentially its only disadvantage. If the Gigafactory results in the conservatively estimated improvement in efficiency Tesla will then be able to produce a battery equivalent to my Leaf's for an astounding $2400--meaning the price of my vehicle would have been about $9000 after incentives, or about $17000 without them. Let's face it, when Tesla can market its cars for a population other than the top 5%ers, it's all over for any vehicle manufacturer that hasn't latched onto its coattails. None of the other manufacturers are keeping pace with it because their investments are \"diversified\" on the dead end street of gas as a fuel.] *It doesn't count to diversify when you're putting money toward an investment that doesn't have a future.*  Samarth Dua has noted Toyota and Daimler as two major manufacturers with at least the foresight to 'buy in' early. Panasonic is also allied with Tesla. These are good investments.  The following are my predictions for the US market: In 5 years, 10% of new vehicle sales will be electric.The first year half or more of new vehicle sales will be electric will be between 2024 and 2026.By 2030, 90% of all new vehicle sales will be electric.By 2035, virtually ALL new vehicle sales will be electric. As an investor, what this means to you is that:....approximately 1.5 million new electric vehicles will be sold from Q3 2019 to Q3 2020--roughly three times as many as are currently on the road. Half of these will be Teslas:Tesla Production Projected to be 100,000 Units in 2016; Possibly 800,000 by 2020? ...approximately 7.5 million new electric vehicles will be sold in 2025, and (as a best guess) half of those will also be Teslas, with the runner ups being Toyota/Daimler vehicles based on Tesla's technology. Overall, it is not very difficult to imagine all new vehicles having some of Tesla's technology in them--including the half sold that are ICE. If this occurred, it would clearly be very good for a Tesla stock owner. Further...The efficiency of electric vehicles will likely be so high (and the production cost comparatively low) that incentives will very likely be offered to retire used vehicles, increasing overall new car sales versus used car sales as the infrastructure for electric charging and battery swapping becomes ubiquitous. Given:What's the life expectancy of my car? and this:Passenger vehicles in the United States One would think it would be relatively easy to predict how fast gas cars will become a scarcity on the roads. However, it is actually very difficult. The new car purchase numbers (roughly 16 million this year) cannot be directly used with the average longevity number (8ish years) to result in the total figure of 254.4 million cars. What happens in reality is that cars last quite a bit longer than just 8 years, on average, with 90% or so of them (as a ballpark estimate) \"sticking around\" for a total a bit over twice that long. However, if we view the efflux to be roughly equal to the efflux, with the available data we can conclude that it will look something similar to this (if my sales projections were on the mark):   Note here the increase in the total vehicles on the road happening as time moves on. This will be due in part to the fact that EVs have fewer moving parts (some estimates have it at 35% simpler) and as such have more limited methods of breaking down. It will also be due to the fact that as battery technology improves, the cost of a new vehicle is likely to go down--increasing the rate at which older ICE vehicles are retired and making personal transportation more available to people.  So the fast answer is \"Tesla has no competition.\"  It's almost the same as asking \"Who is going to fight me for a seat?\" when you're entering the auditorium two hours before the play is scheduled to begin. No one will.  The only serious limitations Tesla has are unrelated to competition: Musk is nailing the supply chain in a way reminiscent of John D. Rockefeller, and absent a major calamity is the odds on favorite to become the world's first trillionaire. If he can manage to avoid pissing the public off--which shouldn't be hard considering that many are already looking at him as a gift from God--Tesla's ceiling is going to be determined by Tesla. In summary,Good investments:1. Tesla (doh)2. Panasonic3. Toyota4. Daimler5. Solar City6. Anything related to charging infrastructure I haven't been following GE but I know their WattStations are among the better ones out there. It will be interesting to see whether the US can avoid the charging compatibility issues with EV's that it faced with cell phones. One can only hope. ",
            "date": "Answered October 20, 2014",
            "views": "43",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neel Javia",
                    "user_href": "/profile/Neel-Javia-2"
                },
                {
                    "user_id": "Justin Abraham",
                    "user_href": "/profile/Justin-Abraham-20"
                },
                {
                    "user_id": "Peter Dixon",
                    "user_href": "/profile/Peter-Dixon-10"
                },
                {
                    "user_id": "Aditya Ankur",
                    "user_href": "/profile/Aditya-Ankur-3"
                },
                {
                    "user_id": "Aron Levin",
                    "user_href": "/profile/Aron-Levin"
                },
                {
                    "user_id": "Doug Sebastian",
                    "user_href": "/profile/Doug-Sebastian"
                },
                {
                    "user_id": "Michael Barnard",
                    "user_href": "/profile/Michael-Barnard-14"
                },
                {
                    "user_id": "Dennis Levy",
                    "user_href": "/profile/Dennis-Levy"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                }
            ]
        }
    ]
}