{
    "title": "What are the specifications of Realme 1? - Quora",
    "tags": [
        "Realm (iOS and Android database)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramandeep Singh",
                "href": "/profile/Ramandeep-Singh-662"
            },
            "answer_text": "ABOUT THE PHONE • Oppo Realme 1 is announced to be launched in May 2018 & will run on Android 7.0 OS. The Smartphone will be available in two color options i.e. Diamond Black, Solar Red & will have a host of connectivity options in terms of 3G, 4G, Wifi Bluetooth capabilities. • The phone will come with 32 GB of internal storage. • The Smartphone will be powered by Octa core Mediatek Helio P60 Processor. • A 3 GB of RAM & Mali-G72 MP3 graphics processor will ensure phone runs smoothly even the most memory intensive applications with no signs of lag. 32 GB of internal storage will be open for expansion upto 256 GB via a microSD card. • The Phone will come with a large 3410 mAh battery to support it's 6 inch screen with IPS LCD display having a resolution of 1080 x 2160 at 402 ppi. The screen is to be protected by a durable Scratch Resistant glass. • Oppo Realme 1 will come with a 13 megapixel rear Camera and 8 megapixel front Camera. It will support Face Detection and high dynamic range(HDR) imaging as well. ABOUT THE PROCESSOR: NEUROPILOT: MediaTek NeuroPilot AI platform plus SDK automatically manages AI processing and is compliant with Google Android Neural Network API (Android NNAPI). Supports common AI frameworks including TensorFlow, TensorFlow Lite, Caffe, Caffe2, custom third-party frameworks and more on the way including ONNX support. SMART IMAGIQ: The MediaTek Helio P60’s tri-core ISP increases power efficiency by using 18% less power for dual camera setups, Single or Dual Camera bokeh and depth of field features with a hardware depth engine enabling real-time bokeh preview, Upgraded multi-frame noise reduction (MFNR) and gets Real-time HDR recording and viewing. FABRICATION: The chipset that powers the flagship smartphone Oppo F7 is a MediaTek Helio P60, an octa-core chipset fabricated on a 12nm process. This chipset is specifically designed to support AI processing, which this handset does. Good phone. ",
            "date": "Answered May 22, 2018",
            "views": "238",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gurkiran Singh",
                "href": "/profile/Gurkiran-Singh-10"
            },
            "answer_text": "With a 13MP essential camera and a 8MP forward looking shooter highlighting AI innovation, catch staggering points of interest of your most loved recollections with the Realme 1 smartphone. Its Bokeh mode helps in making smooth out of center obscure for a satisfying impact to your representation shots. View these pictures on the extensive and striking 6-inch FHD+ full screen highlighting a 18:9 proportion and 2160x1080 goals. Shop for the incredible Realme 1 smartphone on Online Shopping site in India: Shop Online for Mobiles, Books, Watches, Shoes and More and appreciate these energizing highlights. Highlighting the world's first processor based on 12nm process with AI innovation, the 8-center CPU and double center APU of the Realme 1 can deal with each errand easily. Exceedingly control proficient, play your most loved diversions or run concentrated applications effortlessly on this energizing new smartphone from OPPO. With 6GB of RAM and 128GB of inside capacity, switch between numerous assignments and bear the greater part of your media wherever you run with this component stuffed smartphone. Driving the telephone is a vast 3,410 battery that can last finished a whole day even with overwhelming utilization. The savvy AI framework takes in your use design and close down foundation applications to expand battery life even further. The MediaTek Helio P60 is our most advanced chip yet. Expertly designed to bring intelligence to your phone. Its Edge AI processing helps your phone learn and act instinctively. With deep-learning face detection and real-time photo enhancement this chip has a beautiful mind. It is a great buy. ",
            "date": "Answered September 5, 2018",
            "views": "92",
            "upvotes": "0"
        }
    ]
}