{
    "title": "What are the best resources to learn about information technology? - Quora",
    "tags": [
        "Learning About Information Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Smith",
                "href": "/profile/Jim-Smith-44"
            },
            "answer_text": "You don't say why you want to know the basics of information technology but I assume it's not to start a career. If you are wanting to understand information technology, where its been, where it is and where its going, you need to start with a little history of how we got to todays environment. There are three major areas of information technology and one is no more important then the others: - Hardware - The basic platform for computing (cpu, i/o, memory, etc) - Software - Provides the direction for what the hardware should do to be useful . It can be divided into three main areas: 1) Systems software - the basic instructions for the hardware (low level code that \"talks\" to disks, printers, etc and provides communications with applications software and networking) .2) Applications software - the instructions developed to do a specific tasks or tasks and communicates with the end user (payroll, word processing, database, etc.) 3) Database software is a special class that provides access to data in files. - NetworkingNetworking is a special case and a hybrid of hardware and software. It provides the mechanism for applications (and users) to communicate with each other. The information above just touches the surface of a very complicated technology. You have to determine how much time you want  spend getting to understanding it. To gain additional understanding, still at a high level, look into the \"Dummies\" book series. It's is a good place to start. Searching Google is a good source of information but it will be fragmented and harder to understand. ",
            "date": "Answered November 8, 2015",
            "views": "88",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Schmidli",
                    "user_href": "/profile/James-Schmidli"
                },
                {
                    "user_id": "Donald Thompson",
                    "user_href": "/profile/Donald-Thompson-37"
                },
                {
                    "user_id": "Rkalaivani Rajendran",
                    "user_href": "/profile/Rkalaivani-Rajendran"
                },
                {
                    "user_id": "Xang Candelario",
                    "user_href": "/profile/Xang-Candelario"
                },
                {
                    "user_id": "Godfrey Ngwachi",
                    "user_href": "/profile/Godfrey-Ngwachi"
                },
                {
                    "user_id": "Tonia Tsakiri",
                    "user_href": "/profile/Tonia-Tsakiri"
                },
                {
                    "user_id": "Vidhi Sharma",
                    "user_href": "/profile/Vidhi-Sharma-34"
                },
                {
                    "user_id": "Vasheka Jones",
                    "user_href": "/profile/Vasheka-Jones"
                },
                {
                    "user_id": "Aariz Rizz",
                    "user_href": "/profile/Aariz-Rizz"
                },
                {
                    "user_id": "Anil Sharma",
                    "user_href": "/profile/Anil-Sharma-959"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vic Hammer",
                "href": "/profile/Vic-Hammer-1"
            },
            "answer_text": "Not to be flippant, but the answer is Yes. Ok, that was flippant. The information is everywhere and the sources are virtually everything. You social media accounts, your email accounts, all the News outlets, blogs, stream services, and everything else. Anything that touches a network (whether on the internet or on a companies network) and is able to share data is the source of the information in IT. In more corporate terms (not necessarily Internet related) it is whatever data the company has. At the meat of it, IT is about sharing information, and the IT Field, is about making that possible. IT Security - Who has permission to use it? Allowing those that have permission, and denying those who don’t. IT Networking - How do we get that information shared? Is it by LAN, WAN, fiber, ethernet, wifi, etc. IT Server Administration - Where is it stored? Do we have a server on site, or offsite. Do we manage it ourselves, or do we contract with a 3rd part. What kind of information (and what kind of server) is needed. File storage, email, domain control, authentication, software deployment, etc. It is a vast over simplification, but that is the crux of it. ",
            "date": "Answered June 14, 2020",
            "views": "288",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        }
    ]
}