{
    "title": "What is the best smartwatch for 2020? - Quora",
    "tags": [
        "Smart Watches",
        "Wearable Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah Sharp",
                "href": "/profile/Sarah-Sharp-153"
            },
            "answer_text": "Apple, Samsung, and Fitbit are the big players of the smartwatch market. All three offer amazing options in different price ranges. But I think the best smartwatch for 2020 would be the Apple Watch Series 5 for iPhone users, and Samsung Galaxy Watch for Android users. Apple Watch Even though this smartwatch is exclusively for iPhone users, it’s the most popular smartwatch in the world right now. Apple currently offers two different versions: Series 3 and Series 5. Series 3 is the cheaper model, with a smaller screen and less features. Series 5, on the other hand, is the flagship smartwatch. It has an always-on display, a bigger screen with rounded corners, a faster processor, etc. The Series 5 also supports more watch faces than the Series 3. If you get the cellular model, you can also use it to make and receive calls without having your phone with you all the time. The main downside is that it only works with iPhones and watch faces are limited to the default set that is offered by Apple. Series 5 is also the most expensive out of these three. Fitbit Versa Fitbit dominates the fitness tracker market with its Inspire and Charge 3 models. Very recently, they started offering smartwatches too, and its Versa 2 is a very good option for people who like neither the iOS nor the Android ecosystems. It has all the features you would want and expect in a smartwatch: health, fitness, and sleep tracking functionality, notification sync, music control, etc. The downside is a limited OS that doesn’t give you freedom, i.e. you can only listen on Spotify. Samsung Galaxy Watch The Galaxy Watch series has some good smartwatches. It is certainly the best smartwatch for Androids. Although you can use this one with iPhones too, it won’t work as good with iOS as it will with Android. Galaxy Watch offers a variety of customization options and software options. This one too offers the usual features, like health and fitness tracking, notification control, and hands-free experience. ",
            "date": "Answered March 19, 2020",
            "views": "22",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pranag Un",
                    "user_href": "/profile/Pranag-Un"
                },
                {
                    "user_id": "Tech Budder",
                    "user_href": "/profile/Tech-Budder"
                },
                {
                    "user_id": "Deandre Davis",
                    "user_href": "/profile/Deandre-Davis-39"
                },
                {
                    "user_id": "Stella Mcqeen",
                    "user_href": "/profile/Stella-Mcqeen"
                },
                {
                    "user_id": "Brian Wright",
                    "user_href": "/profile/Brian-Wright-445"
                },
                {
                    "user_id": "Gena Kotov",
                    "user_href": "/profile/Gena-Kotov"
                },
                {
                    "user_id": "Yeva Yesayan",
                    "user_href": "/profile/Yeva-Yesayan"
                },
                {
                    "user_id": "Ostap Yaroshevych",
                    "user_href": "/profile/Ostap-Yaroshevych-1"
                },
                {
                    "user_id": "Paulina Golab",
                    "user_href": "/profile/Paulina-Golab"
                },
                {
                    "user_id": "Eugene Romanov",
                    "user_href": "/profile/Eugene-Romanov-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Whitcombe",
                "href": "/profile/Bob-Whitcombe"
            },
            "answer_text": "By asking “which” smart watch you should get you have answered the question of why. The one for you depends on two questions - Are you looking for a watch with basic fitness, or do you want/need apps as well. If the latter - those apps are tied to your phone and you then are looking at either IOS or Android. Both early model Samsung and Apple Watch 3 are premium products for well under $200. if you are primarily looking for a fitness watch - nobody is doing it better than Fitbit and the Versa is great for men while the Charge 3 is perfect for a woman’s more slender wrist. New, these units will cost $130 or $80 - which are pretty reasonable. There is another class of Chinese made units that are fitness trackers that range in price from $8 to $15 which are cheap and I would recommend against. Poor quality, bad battery life and difficult wrist bands. That said, there is an intermediate group of $40 watches that combine fitness tracking with a few apps, email, streaming from your phone via Bluetooth and they will connect to either an iOS or Android platform. Personally - I started this quest looking at the super cheap to see how they performed and was not well satisfied. I wanted at least a very good fitness tracker with a comfortable watch band. I looked closely at the Fitbit Versa and tracked reviews and comparisons to Apple Watch 3, seeing the Apple Watch bested it in most every category. As an iPhone owner - when the cost between the Versa 2 and AW3 narrowed to $40 that was enough to do the deal. Since then I realize how much I undervalued the app side of the integration. I get my regular update whenever anyone passes by the front door from my ring, I get regular email pings, schedule alerts and the Apple fitness management program for being active, standing, Walking and running. My wife has the Fitbit Charge 3 and it is a great watch and fitness tracker - but considerably less of a personal manager. Enjoy. ",
            "date": "Answered December 25, 2019",
            "views": "39",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tech Budder",
                    "user_href": "/profile/Tech-Budder"
                },
                {
                    "user_id": "Samuel Lawson",
                    "user_href": "/profile/Samuel-Lawson-11"
                },
                {
                    "user_id": "John Morphy",
                    "user_href": "/profile/John-Morphy-3"
                }
            ]
        }
    ]
}