{
    "title": "What is a floppy disk, and where is it used? - Quora",
    "tags": [
        "Floppy Disks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Daniel",
                "href": "/profile/Michael-Daniel-21"
            },
            "answer_text": "Thanks for A2A. What is a floppy disk, and where is it used? The word floppy refers to the disk medium inside the casing.  The black one is 8″ diameter with a slightly larger envelope. The drive-hub engages the central ring, and the read/write head accesses the medium through the slot. While the electronic process of reading and writing is almost identical to tape, the actual technique of encoding relies on spikes rather than tones on tape. The little hole that you can see is a sector marker, so that the drive knows where “zero” starts. Some disks only had one such hole in the actual disc and were called soft sector. Hard sector discs had evenly spaced holes arranged in a circle which imposed a stronger format layout for the data. The orange one is 5.25″ in diameter and the sector hole has moved. Both sleaves contained fine fabric linings as a means of dust control. These disks usually came in paper envelopes to protect the read/write slot.  The 3.5″ floppy disk introduced the hard case and sliding cover for the read/write slot. Each generation of disk introduced higher data density (capacity) in a smaller space. Once the 3.5″ version became the de facto standard, there were several proprietary attempts to introduced extremely high-density versions. Orbit, ZIP, Jazz, and LS spring to mind. The LS was unique in comparison to the other brands. The LS drive was fully compatible with the 3.5″ floppy, but the LS disc could not mistakenly be inserted into a standard 3.5″ drive. As USB-sticks became more popular with higher capacities than mechanical devices, floppy disks have faded from use. As the disk medium is getting harder to find, and working drives are a matter of sheer luck, enthusiasts of much older computers that were floppy disk dependent, various novelty devices are turning up that make the computer hardware think it’s still talking to a physical drive, but the data is going onto an SD card. Even early Macintosh machines are being fooled into believing they are connected to genuine SCSI HDDs, instead of the reality of an SD card. ",
            "date": "Answered June 10, 2019",
            "views": "532",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fredrick Miller",
                "href": "/profile/Fredrick-Miller"
            },
            "answer_text": "Floppy Drives are one of the progression of storage means for computer systems. Early on in computing paper was the medium for storage of data. Although punch cards were used these were bulky for the amount of data held. Then paper tape was used as a teletype machine could store and load data from a paper strip. Magnetic tape was also used but was not economical for hobbyists. Cassette tapes were used but could only store or load data at around 30 characters a second. The cassette tapes had to be loaded from the beginning of the data to the end although there were methods to skip to different sections on the tape it was slow. Floppies were invented to allow Track and sector access to read or write the data. A small disk of Mylar with a coating of magnetic material. The controller was simple as it received the magnetic pulses off the disk and then converted it to digital pulses that the computer could use. If you find an old computer you can watch the disk in action by taking off the cover it is quite amazing. ",
            "date": "Answered May 11, 2019",
            "views": "173",
            "upvotes": "0"
        }
    ]
}