{
    "title": "What are some examples of acceptance? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Joe Goebel",
                "href": "/profile/Joe-Goebel-1"
            },
            "answer_text": "You want chinese food but your friend just got back from 6 weeks in San Francisco and is crazy for a good taco. You happily accept the prospect of a taco. You wanted to go snow skiing and a warm front blew in from Hawaii and it rained for 3 straight days and the ski resorts in Tahoe delayed opening. You have no choice - there is no snow yet, so rather than fret about it, you decide to spend the weekend hanging out at the beach and body surfing. Accepted. You can’t find your Rolex. Its a $15,000 watch. You thought for sure it was on the nightstand, but its not. After looking everywhere for 2 hours, you realize that its lost. Will you fret and beat yourself up for weeks, months, years? Will you blame others, most likely all of whom will be innocent? You decide that no material thing is worth these torments. You release that tiny chunk of metal back to the universe and accept it is gone. You are at peace. Acceptance is letting go of any emotional attachment we have to a person, place or thing. Its releasing judgement, expectation and all the guessing about what coulda, shoulda, woulda if only……… And for all the ways it is a very healthy thing to do, particularly in this complex and material-centric life, you can accept the wrong things, too. If your boss treats you poorly, but you fear losing your job if you don’t comply, so you decide to just accept it, DON’T! Life is too short to live every day under the oppression of a mean boss, or coworker, or spouse, or anyone else who has power over you, or you allow (accept) them to have power over you. Ultimately, if you can have acceptance reflect your PRINCIPLES, you will be fine. Often times referred to as boundaries, the way in which we protect and uphold our principles is what the idea of acceptance is all about. If friendship is more important than eating your favorite food, you gladly accept eating something different. If always being right, or having your way is more important, you’ll demand eating what you want. Your friend may comply, and may even be accepting of it, but eventually, they will likely grow tired of never being valued enough to have their way once in a while. So acceptance and principles will hopefully evolve over time to reflect your highest and most important life lessons. Sometimes called growing up. And sometimes you find that Rolex years later in an old gym bag you were about to throw into the recycle pile and give away! Acceptance can be very liberating, and usually is. ",
            "date": "Updated January 8, 2020",
            "views": "52",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jen Ho",
                    "user_href": "/profile/Jen-Ho-14"
                },
                {
                    "user_id": "Khalid Hn",
                    "user_href": "/profile/Khalid-Hn"
                },
                {
                    "user_id": "Bhumi Verma",
                    "user_href": "/profile/Bhumi-Verma-1"
                },
                {
                    "user_id": "Amber V Grier",
                    "user_href": "/profile/Amber-V-Grier"
                },
                {
                    "user_id": "Fernando Guzmán",
                    "user_href": "/profile/Fernando-Guzmán-2"
                },
                {
                    "user_id": "Stephen Whitehead",
                    "user_href": "/profile/Stephen-Whitehead-16"
                },
                {
                    "user_id": "Lynne Miller",
                    "user_href": "/profile/Lynne-Miller"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dana Decker",
                "href": "/profile/Dana-Decker-3"
            },
            "answer_text": "Acceptance happens when a person realizes that they are no longer in control and finds peace with the current reality. For example, when my Dad was dying I didn't want to face that fact but I had no choice. There was absolutely nothing I could do to change that. After a lot of prayer, God helped me to come to terms about what was happening and I felt a great deal of peace about it. It was not in my hands, even though he was suffering, he would soon be in a better place and his suffering would be over. Life never stops moving, every thing and everyone will still move on and the only thing I could control was my thoughts concerning the situation. ",
            "date": "Answered June 10, 2017",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Byron Mc Leod",
                    "user_href": "/profile/Byron-Mc-Leod"
                }
            ]
        }
    ]
}