{
    "title": "What video game consoles will become outdated? - Quora",
    "tags": [
        "Console Games",
        "Video Game Industry",
        "Video Game Consoles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Walker",
                "href": "/profile/Jon-Walker-139"
            },
            "answer_text": "All of them eventually, same with PCs and PC parts. Consoles tend to stay relevant longer than PC parts, and are a lot cheaper. A PC can be far more powerful, but will cost a lot more and be outclassed by other PCs in a month. At least with consoles, you know the software was designed and tested on that specific hardware, so they tend to stick around longer. PC games don’t often go too far beyond what consoles can do, as they want to be able to sell the game to console owners as well. I have all the consoles and a nice gaming PC, but they’ll all be outdated. Just because someone can replace their video card for $500 to give their PC a little more power doesn’t necessarily make it better than a console that can be entirely replaced for the same price. Everything has its perks, and everything will be outdated. ",
            "date": "Answered May 4, 2020",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Garbuz",
                    "user_href": "/profile/Jack-Garbuz"
                },
                {
                    "user_id": "Quentin Johnson",
                    "user_href": "/profile/Quentin-Johnson-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Garbuz",
                "href": "/profile/Jack-Garbuz"
            },
            "answer_text": "WEll, for me because from 2005 till last year when my PS4 optical drive finally crapped out, I rented games from Gamefly - which are mailed CDs - because it is much, much cheaper than buying new games. For example, it cost me $17 a month but I could play say RDR2 in less than a month and mail it back. I would also send back games I didn’t like and wait for the next on my queue. So for me a CD optical drive is imperative. Once in a while there are bargains in the PS4 Store, but almost never as cheap as renting the games from Gamefly. Right now I stream games from PS4 NOW which for $60 a year is great, however most of the 800 or so games are old. So I am replaying a lot a games from years back. But NOW also a few relatively new games as well. But I am happy the PS5 will come with an optical disc drive. If I had to pay $20-$60 a game I could not afford to have played as many as I have over the last `15 years.. For $17 a month Gamefly is unbeatable in value unless you really want to keep the game for a very long time. But even if it takes you two months to play and finish say RDR2 it’s still only would cost $34 which is still less than buying a copy even today. ",
            "date": "Answered May 6, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Less Spearman",
                "href": "/profile/Less-Spearman"
            },
            "answer_text": "Consoles period.There’s no “What console will become the most outdated?”, all consoles are technically considered outdated technology, especially when compared to things like PCs. Eventually with the way consoles are going, iterations are going to be the thing that make even old PlayStation 4’s the quality of PlayStation 3s. It’ll also cut the desire for people to want them, therefore at that point being considered outdated. ",
            "date": "Answered May 2, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Mullich",
                "href": "/profile/David-Mullich"
            },
            "answer_text": "Every video game console currently in existence and every one that will be made in the future will eventually become outdated. That is the nature of technology. ",
            "date": "Answered May 1, 2020",
            "views": "64",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jose Ornelas Ramos",
                    "user_href": "/profile/Jose-Ornelas-Ramos-1"
                },
                {
                    "user_id": "Javier Madrid",
                    "user_href": "/profile/Javier-Madrid"
                },
                {
                    "user_id": "Lionel Junior",
                    "user_href": "/profile/Lionel-Junior-2"
                }
            ]
        }
    ]
}