{
    "title": "What is VoIP? - Quora",
    "tags": [
        "VoIP Software and Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Kidd",
                "href": "/profile/Steven-Kidd-4"
            },
            "answer_text": "VoIP stands for Voice over Internet Protocol. It is also referred to as IP Telephony, Internet Telephony, and Internet Calling. It is an alternative way of making phone calls that can be very cheap or completely free. The ‘phone’ part is not always present anymore, as you can communicate without a telephone set. VoIP has been named the most successful technology of the last decade. The main reason for which people are so massively turning to VoIP technology is the cost. In businesses, VoIP is a way to cut down communication cost, add more features to communication and interaction between employees and with customers so that to render the system more efficient and of better quality. For individuals, VoIP is not only the things that have revolutionized voice calling worldwide, but it is also a means to have fun communicating through computers and mobile devices for free. One of the pioneering services that made VoIP so popular is Skype. It has allowed people to share instant messages and make voice and video calls for free worldwide. VoIP is said to be cheap, but most people use it for free. Yes, if you have a computer with a microphone and speakers, and a good Internet connection, you can communicate using VoIP for free. This can also be possible with your mobile and home phone. There are many ways of using VoIP technology. It all depends on where and how you will be making the calls. It could be at home, at work, in your corporate network, during a travel and even on the beach. The way you make calls varies with the VoIP service you use. ",
            "date": "Answered March 8, 2018",
            "views": "171",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Rice",
                "href": "/profile/Mike-Rice-40"
            },
            "answer_text": "Voice Over Internet Protocol. VOIP is essentially digitized phone messaging, used with the internet, on cellphones, and also home phones marketed all the cable companies now. Traditional phone still uses a version Alexander Graham Bell and another guy from France discovered in the late 1800s. If you understand that voip is a series of digital packets exchanged between callers, that are voice originally converted to zeroes and ones, i.e. data, then transmitted to phones that, like computers, have programs that convert them back to the original voice., If you understand that, you understant that everything on a computer is expressed in zeroes and ones, which can be converted by programs, into speech, data, movies, tv, or email and text messages. That’s all computers are is translators and exchangers of data expressed in zeroes and ones, via programs that handle that. On a computer, all the separate kinds of data, will automatically summon the correct programs to translate them. Cell phones and voip phones all simply trade data, often as conversation on cell phones and voip phones. Cell phones are not VOIP but operate similarly. Most major cable companies are now offering cellphone service as well as voip. You can .operate a voip phone- I have a free one, google voice, over a phone company internet, even using the three wire setup all traditional telephone companies still use. Those companies are very much like cable companies now, and would drop the three wires instantly if it weren’t so expensive to do it, and also because three wire telephone receives a government subsidy for their service, without which tradish telephone would be unprofitable. Few people understand how similar cable and telephone ALWAYS WERE. The phone company owners knew and originally got into cable tv. Eventually the US government forced them to sell those holdings. That’s how I got into cable. With partners I bought a cable company. Later the federal government allowed telephone to get back into the cable business. Except for AT&T, the practice isn’t widespread. AT&T bought TCI Cable from John Malone in roughly 2000, but probably couldn’t find a way to pay its dividend using cable economics. They quickly sold the former TCI to Comcast, which is now one of the biggest cable companies operating in the US. Malone’s family meanwhile, controls Spectrum, which, for awhile was owned by Bill Gates’ Microsoft partner Paul Allen, who owned most of Charter at first. ",
            "date": "Answered September 8, 2020",
            "views": "45",
            "upvotes": "0"
        }
    ]
}