{
    "title": "What if Mars had always been inhabitable today? How much would that have affected our life and science in the past and present? - Quora",
    "tags": [
        "Hypothetical Planetary Science Scenarios",
        "The Past",
        "Mars (planet)",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Space Exploration",
        "Planetary Science",
        "Astronomy",
        "Science",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Miller",
                "href": "/profile/Mike-Miller-117"
            },
            "answer_text": "What if Mars had always been inhabitable today? Making Mars habitable would change its appearance. Rather than being a red moving dot in the night sky, it would be blue-white. That might sound trivial, but…  How much would that have affected our life and science in the past and present? …how many cultures decided Mars had something to do with fire, war, or blood because it was red? How many religions made decisions based on that red star? How many armies marched and how many decisions were made by astrologers based on the red dot? Now change it. Make it blue or blue-white. Before you can figure out what we - the modern world of the last 150 years - might do about a habitable Mars, you need to figure out how the first 250,000 years of human history would react. I can’t guess exactly what that would do, but I can estimate one thing: the modern world as we know it wouldn’t exist. History would be utterly different. This other timeline with a habitable Mars might never have left the paleolithic era. It might’ve industrialized 100,000 years ago. If the other timeline did develop spaceflight then I’m sure it’d be quite interested in Mars. ",
            "date": "Updated June 26, 2020",
            "views": "246",
            "upvotes": " View 537 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bhavya Kundu",
                    "user_href": "/profile/Bhavya-Kundu-4"
                },
                {
                    "user_id": "Wilson Theodule",
                    "user_href": "/profile/Wilson-Theodule"
                },
                {
                    "user_id": "Bogdan Mihai",
                    "user_href": "/profile/Bogdan-Mihai-55"
                },
                {
                    "user_id": "Rafi Sadowsky",
                    "user_href": "/profile/Rafi-Sadowsky"
                },
                {
                    "user_id": "Allen Gallaway",
                    "user_href": "/profile/Allen-Gallaway-1"
                },
                {
                    "user_id": "Jack Pearce",
                    "user_href": "/profile/Jack-Pearce-117"
                },
                {
                    "user_id": "Brandon Loy",
                    "user_href": "/profile/Brandon-Loy-10"
                },
                {
                    "user_id": "Lucas Bertone",
                    "user_href": "/profile/Lucas-Bertone"
                },
                {
                    "user_id": "Christopher John Baldelomar",
                    "user_href": "/profile/Christopher-John-Baldelomar"
                },
                {
                    "user_id": "Itius Hayn",
                    "user_href": "/profile/Itius-Hayn"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Hilbert",
                "href": "/profile/George-Hilbert-1"
            },
            "answer_text": "Being inhabitable is one thing. Having enough resources to support a large number of colonists is another story altogether. The ISS is “inhabitable”, but we must constantly replenish consumables at the price of about $10,000 per pound. Imagine how much more it would cost to resupply a Mars colony. We would quickly use up our GDP, and require huge tax increases just for that small project. And even if, by some miracle, there were bountiful resources, it would take a long time to get ahead of the power curve to the point where anything mo9re than a small colony could support itself. It would not be a matter of resources at that point, but a lack of labor. Each new person you sent up there would be a huge burden until such time as he/she produced enough to justify their existence. The time may come when we can colonize other worlds. BUT, I fear we have to figure out how to economically defeat gravity to make it plausible. ",
            "date": "Answered June 19, 2020",
            "views": "292",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Austin Kesler",
                    "user_href": "/profile/Austin-Kesler-2"
                },
                {
                    "user_id": "Juan Felipe Otero",
                    "user_href": "/profile/Juan-Felipe-Otero"
                }
            ]
        }
    ]
}