{
    "title": "What is the most innovative tech company in the past decade? - Quora",
    "tags": [
        "Business Technology",
        "Technological Innovation",
        "Technology Startups",
        "Technology Companies",
        "Innovation",
        "Technology Trends",
        "Companies",
        "Technology",
        "Business"
    ],
    "response": [
        {
            "author_info": {
                "name": "Atul Salgaonkar",
                "href": "/profile/Atul-Salgaonkar"
            },
            "answer_text": "What is the most innovative tech company in the past decade? It depends a lot on what you mean by innovation and possibly also what you consider to be tech, since everything now has a strong dependence on technologies (plural). Here are my nominations, as of April 2018 : Microsoft - Considering, for example, HoloLens as an engineering marvel Google - for their Google Home smart speaker system If you focus the definition a bit more narrowly on select sectors, then there are some more: Impossible Foods - Making vegetarian meat-like food Medtronic - For being the leader in the artificial pancreas arena Boston Dynamics - Versatile robots that are ambulatory across domains and conditions. Thanks for the a2a ",
            "date": "Answered April 23, 2018",
            "views": "393",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Novoneel Das",
                    "user_href": "/profile/Novoneel-Das-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ho Nam",
                "href": "/profile/Ho-Nam"
            },
            "answer_text": "This is a great quote by Jeff Bezos to think about before answering this question: \"It's not enough to only listen to your customers. You also need to invent on their behalf.\"By this standard, Apple is at the top of my list. They created products I didn't think I needed but later learned that I could not live without. By the standard of shareholder value, if you add up the numbers, I think AAPL has created more value than Google, Facebook, Twitter and Microsoft COMBINED during the 2000-2010 decade.  ",
            "date": "Answered October 1, 2010",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SP-565"
                },
                {
                    "user_id": "Matt Greeley",
                    "user_href": "/profile/Matt-Greeley"
                }
            ]
        }
    ]
}