{
    "title": "What do you do when you’re rejected for a mobile phone contract? - Quora",
    "tags": [
        "Cell Phone Contracts",
        "Mobile Contracts",
        "Contract Law",
        "Rejection",
        "Contracts",
        "Cellular Service Providers",
        "Mobile Technology",
        "Technology",
        "Mobile Applications",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Denchy",
                "href": "/profile/Robert-Denchy"
            },
            "answer_text": "If you are refused, they should provide the reason in writing. Usually within a week. However, they are often generic and list multiple things that MAY have influenced the decision. In general, the two most common reasons would be broken contracts with them or another company or credit issues. If you are trying to get a new phone with one of the current specials (for new customers or existing customers adding a line) with good credit, something on your credit report probably flagged. In the US you can request a free credit report from each of the three main credit bureaus once a year plus anytime from a specific bureau if you were denied due to their report. There are also numerous apps and websites that track your credit reports, often pulling them every week and listing any changes. Things you can do includ appealing the decision. Usually, call during business hours and there are people specifically trained to assist. Regular sales or customer support agents often dont have the background and may not even have access to specifics. The computer just stayed denied. If it is your credit, work on fixing it. Apps like Credit Karma actually provide suggestions and have a calculator to show what paying off a specific amount of credit card debt can do for your credit. FYI: paying it all off can be less efficient than paying off certain amounts. If you already have a phone that works that you plan to use, don't go with a contract. Go with one of the many other options. I personally like Ting and have been considering it. It has three SIM cards available for 3 of the 4 most common carriers here. Rayescare very reasonable. I recommended to someone who asked for my advice, I read terms and pricing on at least a dozen before making the suggestion. The person is very happy with the decision. (Note, not an endorsement, just my personal opinion after doing research. Please do your own, options will vary depending on where you live and other options may now be available.) If you need a phone, buy one, then put it on a plan that doesn't need a contract. If you don't currently have a phone and plan to fix your credit to get a top tier phone with contract, don't spend much on the phone. Sometimes, buying renewed on Amazon can save a lot of money and you can get a warranty until you know the phone is good. I recently got a Samsung Galaxy Note10 Lite International new for less than $450 after tax. Only comes with a 30 day warranty. But, works with no problem on T-mobile's network. US version wasn't avaiable yet and when it was released, was $600+tax. Comes with 1 year warranty. International was a better way to go and, for the price, a good deal. As an added bonus, the person I bought it for doesn't like the curved infinity glass on all the other Notes for the last several iterations. The Note10 is a flat screen. And transfering from existing Samsung phone by placing them side by side was super slick. Anyway, point is, can get good phones cheaper and not get a contract. If money is really tight, get something as cheap as possible just to hold you over while you work on fixing your credit or whatever the problem is. If really cheap is necessary, try FrredomPop. I used them for a Kindle Fire phone. Neat phone, but, they needed to stay a little closer to standard Android. I got a year of Prime with it so essentially got the phone for free and saved $20 on my renewal. Sorry, wandering. Point is, I didn't need the phone and just planned to usd it with wifi. But then I learned about FreedomPop. It wasn't an approved phone but I side loaded play store, installed their app, and it worked. Really was free service. Had to use their dialer and text message apps that had ads but they were not intrusive. Note: if you use FreedomPop, you usually get a 30 day trial to their los tolier paid service. Go Into the website and switch to the free plan immediately so you don't forget. Note2: Freedompop does sale phones, many are used or refurbished. I tried to get a Galaxy S4 or S5 refurbished back when they weren't that old. The screen had the homescreen burned in. They send me a second with a return label so I could swap and return the defective one. But, the 2nd one had the same problem. I don't know if they have fixed this quality issue. It boggles my mind that anyone would have their phone on so much sitting at the homescreen that it burned in the screen. Newer displays are even less prone to this issue. So you may do fine buying from them. Their customer service was great. Only drawback is that it was (may still be) by email only. Final Note: be very careful buying phones from sites like TopHatter, Joom, Wish, etc. I have ordered over 10 different ones and the are never up to standard. They have usually been hacked to show fake RAM and storage. The OS is usually Android 4.2.1 and not whatever new version they claim. These companies ate very good about providing refunds. But you don't want to be without a phone while dealing with it. If you do buy a phone from one of these sources, use AID64 to verify the actual RAM, storage, Android version, processor, and cores. I have used multiple different apps before finding this one. It does an excellent job. Good luck with resolving your issue or going another route. ",
            "date": "Answered October 21, 2020",
            "views": "48",
            "upvotes": " Answer requested by Dan Postavikov",
            "upvoters": [
                {
                    "user_id": "Walter Grant",
                    "user_href": "/profile/Walter-Grant-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Buchman",
                "href": "/profile/Tim-Buchman-2"
            },
            "answer_text": "I have no clue why people still get into contacted cell phone plans. Phones are cheap enough to buy outright now,and there are tons of no contract plans out there. They are overpriced and the no contract companies offer the same service. ",
            "date": "Answered October 21, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter"
        }
    ]
}