{
    "title": "What is a product that anyone can realistically sell? - Quora",
    "tags": [
        "Sales"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Schiemer",
                "href": "/profile/Mike-Schiemer"
            },
            "answer_text": "Collectibles, media, and general items can be found in your attic, basement, garage sales (for next to nothing), or even free and can be sold on Amazon or eBay. You could even charge to clean out somebody’s home and if they just want to get rid of the items (with their permission obviously) then you can utilize the ones with any value. I made tens of thousands of dollars selling items I got for pennies on the dollar or free. Collectibles and media items (books, DVD’s, CD’s, video games, video game systems, computer parts) are all usually cheap and easy to ship which is key when trying to make a profit off these lower margin items. ",
            "date": "Answered March 7, 2017",
            "views": "132",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Glen Burns",
                    "user_href": "/profile/Glen-Burns-2"
                },
                {
                    "user_id": "Craig McDowell",
                    "user_href": "/profile/Craig-McDowell-2"
                },
                {
                    "user_id": "Damián Gil",
                    "user_href": "/profile/Damián-Gil"
                },
                {
                    "user_id": "Michael Gorman",
                    "user_href": "/profile/Michael-Gorman-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kay Nejim",
                "href": "/profile/Kay-Nejim"
            },
            "answer_text": "In the context of Amazon you honestly can sell anything. What matters is not so much the product. What matters is the niche and what the consumers are searching for. If you find that there is a undeserving niche when you search certain keywords or phrases, that would be an example of something that you can sell and probably sell well. ",
            "date": "Answered March 6, 2017",
            "views": "116",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Damián Gil",
                    "user_href": "/profile/Damián-Gil"
                }
            ]
        }
    ]
}