{
    "title": "What technologies are used when building a live streaming app and website? - Quora",
    "tags": [
        "Live Video Streaming",
        "Streaming Content",
        "Streaming Video Content"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nicholas Theodosius",
                "href": "/profile/Nicholas-Theodosius"
            },
            "answer_text": "Most used technologies for live streaming sites and apps are: RTMP, RTSP, WebRTC streaming protocolsHLS, MPEG DASH HTML5 deliveryH264, AAC codecsYou can take a look at this Broadcast Live Video Script that implements most technologies: Live Broadcasting webcam using advanced client with chat, user list in PC browserwebcam using WebRTC in mobile/computer HTML5 browserPC desktop encoders like OBS, XSplit, WirecastiOS/Android RTMP encoder apps like Wowza GoCoder appIP camera 24/7 RTSP streamsscheduled video playlist (integrates Video Share VOD)custom mobile apps with full functionality (extra)Live Playback advanced client with chat, user list in PC browserHLS / MPEG Dash in HTML5 browserWebRTC in some HTML5 browsersAJAX Chat + HTML5 streamother RTMP, RTSP players with session control  ",
            "date": "Answered January 14, 2019",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dineshkumar Saravanan",
                    "user_href": "/profile/Dineshkumar-Saravanan-2"
                },
                {
                    "user_id": "Topus Resellerus",
                    "user_href": "/profile/Topus-Resellerus"
                },
                {
                    "user_id": "Oafos Hohotos",
                    "user_href": "/profile/Oafos-Hohotos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashley John",
                "href": "/profile/Ashley-John-29"
            },
            "answer_text": " Before getting into the details of the best live streaming apps, here are a few stats Technologies Used in the Development of the Live Video Streaming Apps: Programming languages/frameworks: C++ (GO), HTML5/CSS3, Java, JavaScript (Node.js, React, RxJS, Restify, EmberJS, AngularJS, BackboneJS), Python, Ruby (Ruby on Rails) Data storage/management: Atlas-DB, Cassandra, MySQL, Oracle, PostgreSQL Analytics: Google Analytics, Hadoop, Hive, MixPanel, Mode, Parquet, Pig, Presto, Spark Cloud platforms: Amazon EC2/S3 CDN: Amazon CloudFront, Cloudflare, Fastly, Open Connect Streaming protocols: Adobe HTTP Dynamic Streaming, Apple HTTP Live Streaming, M2TS, MPEG-DASH, Microsoft Smooth Streaming, RTMP Media formats: H.264 Media containers: FLV, MP4 Media processing platform: Brightcove, Contus Vplay, DaCast, Flash Media Server, JW Live, Livestream, Muvi, Ustream, Vimeo PRO, Wowza Media Systems Geolocation: Google Maps, MapKit/Core Location (iOS) Messaging: Firebase, PubNub, Twilio Streaming Video Platforms - a Base for Live Streaming Apps To determine which of the streaming platforms is suitable for a particular application development project, it is worth exploring the existing services in more detail: Brightcove;Livestream;Contus VPlay;DaCast;StreamHash;UStream;Wowza;",
            "date": "Answered March 1, 2018",
            "views": "35",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hung Nghiem",
                    "user_href": "/profile/Hung-Nghiem-7"
                },
                {
                    "user_id": "Raj Vignesh K",
                    "user_href": "/profile/Raj-Vignesh-K"
                },
                {
                    "user_id": "Binesh Charles",
                    "user_href": "/profile/Binesh-Charles"
                }
            ]
        },
        {
            "author_info": {
                "name": "Live Plus",
                "href": "/profile/Live-Plus-1"
            },
            "answer_text": "Several live streaming video applications have been created and developed for our smartphone that transforms into a handy recording app. An app like LIVE PLUS – periscope clone script - that make your own live platform for Web and mobile to watch live streaming videos. Not just watch, you can comment and communicate live with these streaming videos. Visit LivePlus -Best Live Streaming App for more information. For Web Application: Periscope Clone Script  For Mobile Application: Live video streaming app for AndroidLive video streaming app for IOS ",
            "date": "Answered March 21, 2018",
            "views": "928",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "PazerPlus",
                    "user_href": "/profile/PazerPlus"
                },
                {
                    "user_id": "AssetPlus",
                    "user_href": "/profile/AssetPlus"
                },
                {
                    "user_id": "JobPlus",
                    "user_href": "/profile/JobPlus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nancy Drew",
                "href": "/profile/Nancy-Drew-229"
            },
            "answer_text": " There are various technologies used for building live streaming applications and websites. However, I would recommend you to go with WebRTC technology. WebRTC is an open-source project that provides real-time communication between various mobile and desktop applications. The best WebRTC solution I know is “rtcweb(.)in” they are expert in developing a reliable video conferencing, web conferencing, peer to peer conferencing, etc for your business. So if you are looking for such service do contact them! ",
            "date": "Answered March 26, 2020",
            "views": "280",
            "upvotes": "0"
        }
    ]
}