{
    "title": "What if we could breathe underwater? - Quora",
    "tags": [
        "Underwater",
        "Breathing"
    ],
    "response": [
        {
            "author_info": {
                "name": "C. S. Sharma",
                "href": "/profile/C-S-Sharma-14"
            },
            "answer_text": "Breathing means taking in the surrounding air into your pulmonary system then expelling it. Breathing is involuntary function but it can also be partially voluntary for a brief period. The man is terrestrial, could survive in the presence of air only. It neither have mechanism to breath in the water or otherwise or in any fluid like fishes or aquatic animals. This is the reason, firstly you can not breath under the water. In case somehow you try to breath underwater, the surrounding water will immeduately gush in the nose, trachea and pulmonary system. Entire pulmonary system including lungs, will be filled up with water immeduately and damage the lungs, Once filled up with water, the water can not be expelled through exhalation process like the air but remain filled up within the pulmonary system due to gravity. The pulmonary system and lungs damage will make it harder to exchange CO2 for oxygen. The damage will also initiate body's counter reactions such as cough and vomit to get the entered water out fir few moments. In absence of oxygen, the body will be paralysed leading to suffocation that make it worse leading to death within few minutes due to drowning and suffocation. Don't even think to try or undertake such ventures, out of just curiosity, otherwise you will certainly leave this world for heavenly abode. ",
            "date": "Answered March 23, 2019",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Navneet Kaur",
                    "user_href": "/profile/Navneet-Kaur-2679"
                },
                {
                    "user_id": "A. I. Marshel",
                    "user_href": "/profile/A-I-Marshel-2"
                },
                {
                    "user_id": "Veveonah Mosibin",
                    "user_href": "/profile/Veveonah-Mosibin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashmede Asgarali",
                "href": "/profile/Ashmede-Asgarali"
            },
            "answer_text": "We can, can't we? We can't derive oxygen by inhaling water, but we “breathe underwater” with aplomb in those scuba outfits. If perchance, absorbing oxygen by inhaling water was a capability we were either born with, evolved to, developed, we would as Apex predators go on to dominate the oceans. But wait, don't we already do that? We would do touristy things underwater. We would be able to not only go farther, faster, further; we can also go where no man has gone before in “Water Trek - Enterprise”. Hmmm, I am getting the seeds of an idea, albeit I can't develop it just yet…too busy. And knowing man's greed, we probably would have decimated and boiled of the ocean to harvest the riches that are still denied us because we can't derive oxygen from inhaling water. And we would also have had to have been adapted to the extreme pressures on our bodies. ",
            "date": "Answered April 15, 2018",
            "views": "365",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabriel De Paz",
                    "user_href": "/profile/Gabriel-De-Paz"
                },
                {
                    "user_id": "Maryam Mout",
                    "user_href": "/profile/Maryam-Mout"
                }
            ]
        }
    ]
}