{
    "title": "What kind of technology does Argentina have? - Quora",
    "tags": [
        "Argentina",
        "Military Technology",
        "Information Technology",
        "Computer Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Juan Falcón",
                "href": "/profile/Juan-Falcón"
            },
            "answer_text": "Argentina is a country with particularly advanced nuclear technology. The National Commission of Atomic Energy (CNEA) was created in 1950, only 5 years after the bombing of Hiroshima and Nagasaki. In 1955, Jose Balseiro created the National Physics Institute (Currently named Balseiro Institute), which teaches Physics, Nuclear Engineering, Mechanical Engineering and Telecomunications Engineering. It's one of the most exclusive educational facilities in the country. To give you an idea, only 24 people graduated last year as engineers. The quality of the education is high, even by international standards. Since 1956, the whole nuclear industry has remained owned and controlled mostly by the state, and many developments have been achieved without need of foreign involvement. By 1957, the first atomic reactor in Latin America was operating in the Constituyentes Atomic Centre. This reactor is still in use today. INVAP, a state-owned company that focuses on nuclear and space projects, has built many reactors both for Argentina and the world. The RA-10, currently being built, will be one of the most advanced reactors in the world, at will be able to supply most of the demand for radioisotopes in Latin America. Once this project is finished, Argentina will have consolidated itself as one of the most important developers of nuclear technology. Another project under construction, and close to being finished, is the CAREM reactor. It's one of the first 4th generations reactors to be made, inaugurating a new era of safer, cleaner and more efficient reactors, which are being developed all around the world. It's intended to provide electricity to smaller communities, as well as provide enough energy for desalination plants. There are 3 nuclear power plants operating in the country. Argentina was the first country in the region to have a nuclear power plant, and it still has one more than Brazil. That could change soon, since a 4th plant is being planned, although there are discussions on which reactors should be used. Argentina has traditionally used CANDU reactors from Canada, but China has offered to construct a plant themselves in the country in exchange for also using their own reactor. There are uranium enrichment plants, as well as heavy water plants. Argentina has also developed a strong aerospace industry, including the development of rockets, satellites, missiles, and others, as well as planes, unmanned aircraft and radars. ",
            "date": "Answered August 21, 2020",
            "views": "168",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                },
                {
                    "user_id": "Leopoldo Fernandez Suarez",
                    "user_href": "/profile/Leopoldo-Fernandez-Suarez"
                }
            ]
        }
    ]
}