{
    "title": "What are some useful technical skills related to business management? - Quora",
    "tags": [
        "Technical Skills",
        "Business Management",
        "Self-Teaching",
        "Management",
        "Skills",
        "E-learning",
        "Learning New Things",
        "Learning",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kate Hoyt",
                "href": "/profile/Kate-Hoyt-1"
            },
            "answer_text": "Organization is the most underrate skill in the world. As far as programs go, depending on the field you're going into, learn at least the basics of everything to do with it. Most managers don't know the programs accounting uses, or timekeeping, insurance employee benefits and regulations, taxes are huge. Take some marketing classes and a sociology is helpful. Anything tedious, difficult or boring is beneficial because less people will know it.  Finally NEVER have the attitude that you don't need to do anything cuz it's not your job. If it needs to be done, and you can do it within reason then do it. Nothing is more valuable than persistence and humbleness in management ",
            "date": "Answered June 16, 2015",
            "views": "336",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Wickert",
                    "user_href": "/profile/Tim-Wickert"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christine Hsieh",
                "href": "/profile/Christine-Hsieh-4"
            },
            "answer_text": "Business management is really a broad topic because each industry has different practice in order to manage its supplier, vendor, internal employee and customer.  You probably want to select the industry that you are interested, and then search for related courses or materials. The most popular industries are: Financial institution, health care, retail, real estate, transportation, petroleum, construction, renewable energy, avionics and aerospace etc. ",
            "date": "Answered June 15, 2015",
            "views": "167",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Wickert",
                    "user_href": "/profile/Tim-Wickert"
                }
            ]
        }
    ]
}