{
    "title": "What laptop brand, besides Apple, would “survive” rough handling the best? - Quora",
    "tags": [
        "Laptop Brands",
        "Laptop Shopping",
        "Laptop Recommendations",
        "Brands and Branding",
        "Laptops",
        "Computer Science",
        "Computer Hardware",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Coffin",
                "href": "/profile/Jerry-Coffin-2"
            },
            "answer_text": "Panasonic. Toughbooks are comparatively big and heavy, but they include semi-ruggedized, and fully ruggedized models. Panasonic claims some of the fully ruggedized models meet military specification including: MIL-STD-810G, MIL-STD-461F, IP65 and optional class 1 div 2 groups ABCD hazardous locations. I do feel obliged to point out that MIL-STD-810G (for one example) allows a vendor to specify what goals they’re trying to meet, and set up tests accordingly. That said, for years (like a decade or so) Panasonic has generally been recognized as having the toughest notebooks around. For example: “Panasonic is the gold standard” in rugged computers, said Roger Kay, president of Endpoint Technologies Associates, in an interview with DID. “They build their own stuff; they battle test it in their labs in Osaka; they do a solid job…If you want to get really serious – the notebook’s got to operate inside a tank in Saudi Arabia in the summer – then you have to go the full Panasonic route.” That said, Panasonic’s fully rugged computers do have pretty steep price tags. If a dead computer is likely to lead to people dying as well, they seem to be generally accepted as the best choice. On the other hand, if you just want one that takes everyday abuse a little better than most of the others, a Toughbook is probably going to cost quite a bit more than it’s worth to you. References Computers US Military on the Move: Rugged Notebooks Lead the Way. Disclaimer I have no affiliation with, or vested interest in Panasonic (well, I suppose it’s possible some of my 401K money could be in a fund that includes some stock in Panasonic’s US subsidiary—I don’t know one way or the other on that). ",
            "date": "Answered October 26, 2020",
            "views": "121",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joe Zbiciak",
                    "user_href": "/profile/Joe-Zbiciak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Jobling",
                "href": "/profile/Norman-Jobling"
            },
            "answer_text": "Yeah, Miguel hits the nail on the head - ThinkPads are tough. Apple laptops aren't though, they're too tightly packed and pared to a weight and thinness to be in any good at surviving rough handling. ",
            "date": "Answered October 23, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Reza Naqdi",
                    "user_href": "/profile/Reza-Naqdi-1"
                }
            ]
        }
    ]
}