{
    "title": "What are the next billion dollar investment ideas of the next decade available today? - Quora",
    "tags": [
        "Startup Ideas",
        "Entrepreneurship",
        "Startup Strategy",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Starkfield",
                "href": "/profile/George-Starkfield"
            },
            "answer_text": "Graphics Cards. (GPUs - Graphics Processing Unit) Answers like Francisco Fonseca’s, answer here (Francisco Fonseca's answer to What are the next billion dollar investment ideas of the next decade available today?) have stated things like Artificial Intelligence are the next billion dollar investment ideas of the next decade. Cryptocurrencies are also famous for making people millions in a few years. This is true. However, there is one highly important investment that is about to explode over the next decade. This one investment will empower Artificial Intelligence, Cryptocurrencies, and other amazing technology. In fact, many huge investors and investing firms have already clued into this and started investing in this amazing investment. In fact, Bill Gates said this could be potentially a trillion-dollar industry! What is this amazing investment? Graphics Cards. In cryptocurrency mining, artificial intelligence, gaming, and other heavy tasks, the graphics card is incredibly important. Currently, Nvidia leads the graphics card market. Nvidia’s Graphics Cards have been on extremely high demand in 2017 and 2018 because of the crypto-mining craze. In the past few years, many companies have been created to mine cryptocurrencies like Bitcoin & Ethereum. In fact, look at the picture below.  That is one crypto-mining room. All those small things on the shelves are Graphics Cards. By the way, this is also a relatively small crypto-mining room, usually the shelves are much taller. …and there are tons of shelves. …in tons of extremely long rows And that is ONLY part of one room actually, you don’t even see the full room in the picture!  Guess what? There are multiple rooms like this too! Guess what? This is only 1 building, most crypto-mining companies have way more than 1 building at a crypto-mining centre.  Guess what? This is only 1 centre, there are multiple centres like this worldwide for each of the tons of different crypto-mining companies! Still remember those Graphics Cards I was talking about? Nvidia’s newest model is the “Nvidia GeForce GTX 1080 Ti”. It costs $699 USD. You can’t even imagine how much money Nvidia is making. In fact, let’s look at how much Nvidia’s growth.  It went up over 108% in the past year! That’s more than doubling it’s worth! You can clearly see how Nvidia has much potential. Conclusion: Graphics Cards (GPUs) will be big in the next decade, and Nvidia is leading the innovation.  If you enjoyed this, consider following my tech blog, BIG, where amazing authors post tons of tech-related content. Cheers, George. ~ Think Different, Be Different ~ ",
            "date": "Updated January 12, 2018",
            "views": "107",
            "upvotes": " View 45 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bora Dönmez",
                    "user_href": "/profile/Bora-Dönmez"
                },
                {
                    "user_id": "SHIVA",
                    "user_href": "/profile/SHIVA-225"
                },
                {
                    "user_id": "Jishaan Sirsangi",
                    "user_href": "/profile/Jishaan-Sirsangi"
                },
                {
                    "user_id": "Norm Liang",
                    "user_href": "/profile/Norm-Liang"
                },
                {
                    "user_id": "Abhishek Jain",
                    "user_href": "/profile/Abhishek-Jain-150"
                },
                {
                    "user_id": "FAISAL ALFOUZAN",
                    "user_href": "/profile/FAISAL-ALFOUZAN"
                },
                {
                    "user_id": "Rohit Singh",
                    "user_href": "/profile/Rohit-Singh-2087"
                },
                {
                    "user_id": "Batın Evirgen",
                    "user_href": "/profile/Batın-Evirgen-1"
                },
                {
                    "user_id": "Tolu Adebanjo",
                    "user_href": "/profile/Tolu-Adebanjo"
                },
                {
                    "user_id": "Duarte Ramada Curto",
                    "user_href": "/profile/Duarte-Ramada-Curto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aakash",
                "href": "/profile/Aakash-126"
            },
            "answer_text": "Edible Packaging! The Amazing Future of Waste-Free Food Packaging Edible packaging is one of the most accepted packaging approach for fresh food, dairy food and other products. Edible packaging provides barrier to oxygen and carbon dioxide between food and atmosphere, leading to enhanced shelf life of the product. Edible packaging is a common technique of extending the shelf life of food related products without adversely impacting their quality. Download PDF Brochure For More Insights@ Edible Packaging Market Food and beverage manufacturing and pharmaceuticals are the two main end users of edible packaging across the world. Among these, the food and beverage manufacturing segment has occupied the leading position in this market.  New and innovative developments which includes production of edible packages that holds light-weight packaging are accumulating value to the edible packaging market. ",
            "date": "Answered February 2, 2018",
            "views": "911",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Shaw",
                    "user_href": "/profile/Jack-Shaw-145"
                },
                {
                    "user_id": "Ram Desai",
                    "user_href": "/profile/Ram-Desai-36"
                },
                {
                    "user_id": "Aakash Chaudhary",
                    "user_href": "/profile/Aakash-Chaudhary-227"
                },
                {
                    "user_id": "Kavita Naik",
                    "user_href": "/profile/Kavita-Naik-48"
                },
                {
                    "user_id": "Andrew Balbarine",
                    "user_href": "/profile/Andrew-Balbarine"
                },
                {
                    "user_id": "Kshitij Jain",
                    "user_href": "/profile/Kshitij-Jain-179"
                },
                {
                    "user_id": "Gary Wilson",
                    "user_href": "/profile/Gary-Wilson-381"
                },
                {
                    "user_id": "Abhishek Jain",
                    "user_href": "/profile/Abhishek-Jain-150"
                },
                {
                    "user_id": "Kavish Mehta",
                    "user_href": "/profile/Kavish-Mehta-15"
                },
                {
                    "user_id": "Aditya Kumar",
                    "user_href": "/profile/Aditya-Kumar-2016"
                }
            ]
        }
    ]
}