{
    "title": "What is impostor syndrome? Why does it happen and how do I overcome it? - Quora",
    "tags": [
        "Impostor Syndrome",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramakant Singh Chandel",
                "href": "/profile/Ramakant-Singh-Chandel"
            },
            "answer_text": "Introverts tend to be highly, perhaps overly, analytical and self-aware. It could be that the root of Imposter Syndrome is really just self-absorption: spending too much time worrying about yourself and how others see you. Don't worry…there are many people like you… I am an introvert myself… :)  There are plenty of outwardly confident people who also are struck by this fraudulent feeling. Celebrities such as Natalie Portman have openly admitted to feeling insecure about their abilities. She reported, “I felt like there had been some mistake, that I wasn’t smart enough to be in this company, and that every time I opened my mouth I would have to prove that I wasn’t just a dumb actress” when arriving at Harvard as a freshman. Basically, no one is safe from feeling like a fraud, regardless of achievement or fame. So what can be done to shake imposter syndrome? Here are five pieces of advice I share with my clients: 1. Give yourself an appraisal This is particularly useful if you’re self-employed. When there isn’t anyone to give you positive feedback, you need to be the one to supply it. List any achievements you’re proud of. What are your skills? What could you talk about for hours? Chances are, you’re better than the vast majority of people at these things. 2. Remember that awareness is a good thing The sheer fact that you’re critical about your abilities is a sign that you care. A key ingredient to mastering anything is to care enough about it that you want to improve. If the greats felt imposter syndrome (and they did) you can put yourself on the same tumultuous path to mastery. 3. Make a “feel good” file This is a file — physical or digital — where you save all the positive testimonials, kind words, praise and thanks that you receive. Every time you need a bit of a confidence boost, remind yourself of your greatness by flicking through this file. 4. Spend time with those who lift you up While it’s easy to get absorbed into our own bubble when dealing with a dip in confidence, one of the best things we can do is surround ourselves with others who will pull us out of our slump. Conversely, take a step back from those who make you feel inadequate. Although it may not be intentional, some people will only remind us of our flaws and ultimately contribute to our lack of confidence. 5. Keep a journal Every day make a note of one thing you achieved or felt good about that day. Some use daily affirmations to train their brain to feel more confident, but I recommend starting with achievements; they are more concrete and measurable. The practice of writing down these accomplishments ultimately will increase self-confidence and belief in your abilities. Whatever you do, don’t let imposter syndrome or lack of confidence hold you back. :) :) ",
            "date": "Answered June 18, 2017",
            "views": "794",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mama Jo",
                    "user_href": "/profile/Mama-Jo-2"
                },
                {
                    "user_id": "Ruchi Agrawal",
                    "user_href": "/profile/Ruchi-Agrawal-31"
                },
                {
                    "user_id": "Dimpy Jeswani",
                    "user_href": "/profile/Dimpy-Jeswani"
                },
                {
                    "user_id": "Leong Weikheong",
                    "user_href": "/profile/Leong-Weikheong"
                },
                {
                    "user_id": "Sonal Patil",
                    "user_href": "/profile/Sonal-Patil-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Federico Pettinicchio",
                "href": "/profile/Federico-Pettinicchio"
            },
            "answer_text": "It's the feeling, let's call it, you have when you feel that you don't deserve something that defines you by comparison. Basically your idea of a given role, or the idea society has of that role clashes with your sense of self making you experience a dissonance between who you feel you are and who you feel you should be in order to be what defines you. For example, my IQ as last tested when I was a kid is 164, sometimes I feel it is way overblown and if tested now it would be much much lower putting me somewhere smart but not that smart because growing up the idea the world passes on about smart people clashes with me being able to clearly see my own limitations(though maybe the main problem is actually my idea of what is average which is probably overblown but that is beside the point) while when I was a kid I was the best in my class with the least effort in my class so I had a constant legitimization from the outside, so to speak, that is currently missing from my life. To rephrase once more imposter syndrome happens when a person isn't able to legitimize to himself a quality or a role he holds because his idea of self or his experiences clash with his idea of the quality or of the role. As far as treatments go it's just work on self esteem and getting to know other people who hold the role or quality outside their comfort zone, showing their humanity and building that relatability that has been missing and causing the problem in the first place. ",
            "date": "Answered September 17, 2020",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve DeBerry",
                    "user_href": "/profile/Steve-DeBerry"
                }
            ]
        }
    ]
}