{
    "title": "What are fiber optics and how were they invented? - Quora",
    "tags": [
        "Textile Fibers (material)",
        "Optical Fiber",
        "Inventors",
        "Optics"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Moran",
                "href": "/profile/William-Moran-11"
            },
            "answer_text": " “An optical fiber (or optical fibre) is a flexible, transparent fiber made by drawing glass (silica) or plastic to a diameter slightly thicker than that of a human hair. Optical fibers are used most often as a means to transmit light between the two ends of the fiber and find wide usage in fiber-optic communications, where they permit transmission over longer distances and at higherbandwidths (data rates) than wire cables. Fibers are used instead of metal wires because signals travel along them with lesser amounts of loss; in addition, fibers are also immune to electromagnetic interference, a problem from which metal wires suffer excessively. Fibers are also used for illumination, and are wrapped in bundles so that they may be used to carry images, thus allowing viewing in confined spaces, as in the case of a fiberscope. Specially designed fibers are also used for a variety of other applications, some of them being fiber optic sensors and fiber lasers. Optical fibers typically include a transparent core surrounded by a transparent cladding material with a lower index of refraction. Light is kept in the core by the phenomenon of total internal reflection which causes the fiber to act as a waveguide. Fibers that support many propagation paths or transverse modes are called multi-mode fibers (MMF), while those that support a single mode are called single-mode fibers (SMF). Multi-mode fibers generally have a wider core diameter and are used for short-distance communication links and for applications where high power must be transmitted. Single-mode fibers are used for most communication links longer than 1,000 meters (3,300 ft). An important aspect of a fiber optic communication is that of extension of the fiber optic cables such that the losses brought about by joining two different cables is kept to a minimum. Joining lengths of optical fiber often proves to be more complex than joining electrical wire or cable and involves careful cleaving of the fibers, perfect alignment of the fiber cores, and the splicing of these aligned fiber cores. For applications that demand a permanent connection a mechanical splice which holds the ends of the fibers together mechanically could be used or a fusion splice that uses heat to fuse the ends of the fibers together could be used. Temporary or semi-permanent connections are made by means of specialized optical fiber connectors. The field of applied science and engineering concerned with the design and application of optical fibers is known as fiber optics.” Optical fiber For history see History of Fiber Optics and A Fiber-Optic Chronology ",
            "date": "Answered August 7, 2016",
            "views": "658",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dave Reynolds",
                    "user_href": "/profile/Dave-Reynolds-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Saxena",
                "href": "/profile/Shubham-Saxena-194"
            },
            "answer_text": "1950s: In London, England, Indian physicist Narinder Kapany (1927–) and British physicist Harold Hopkins (1918–1994) managed to send a simple picture down a light pipe made from thousands of glass fibers. After publishing many scientific papers, Kapany earned a reputation as the \"father of fiber optics.\" An optical fiber (or optical fibre) is a flexible, transparent fiber made by drawing glass (silica) or plastic to a diameter slightly thicker than that of a human hair. [1] Optical fibers are used most often as a means to transmit light between the two ends of the fiber and find wide usage in fiber-optic communications, where they permit transmission over longer distances and at higher bandwidths (data rates) than wire cables. Fibers are used instead of metal wires because signals travel along them with lesser amounts of loss; in addition, fibers are also immune to electromagnetic interference, a problem from which metal wires suffer excessively. [2] [3] Fibers are also used forillumination, and are wrapped in bundles so that they may be used to carry images, thus allowing viewing in confined spaces, as in the case of a fiberscope. [4] Specially designed fibers are also used for a variety of other applications, some of them being fiber optic sensorsand fiber lasers. [5] ",
            "date": "Answered July 31, 2016",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Monty Collins",
                    "user_href": "/profile/Monty-Collins"
                }
            ]
        }
    ]
}