{
    "title": "What are the most beautiful objects in the night sky? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Rohan Soni",
                "href": "/profile/Rohan-Soni-2"
            },
            "answer_text": "Moon, once you are aware of the geography of the moon.Pleiades, once you are aware of the geography of the sky.The Great Nebula of Orion, once you are aware of supernovae.Jupiter, once you are aware of the moons around Jupiter.Saturn, once you are aware of the separate rings on the planet.Pole Star(Polaris), once you are aware of the star being actually a binary star.Andromeda Galaxy, once you are aware that you actually see three galaxies at once instead of just one.Ursa Major, once you are aware that it is always gonna be there no matter what time of the year.(assuming you live in northern hemisphere).Leo constellation, once you become aware of the number of galaxies it harbours(metaphor off course)Capella(star), once you become aware about the geometrical relations it has to both Auriga constellation and the Taurus.ISS(International Space Station), well, unconditional love for that.",
            "date": "Answered June 11, 2015",
            "views": "470",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abishek Ks",
                    "user_href": "/profile/Abishek-Ks-1"
                },
                {
                    "user_id": "Ishita Chourasia",
                    "user_href": "/profile/Ishita-Chourasia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cherry Blackmore",
                "href": "/profile/Cherry-Blackmore"
            },
            "answer_text": "Visible in an 8″ telescope? Why, the Local Group’s other two major galaxies, Andromeda (M31) and Triangulum (M33), of course. Here’s Andromeda:  And here’s Triangulum.  And there’s more. How about M51a, the Whirlpool?  Or, in the constellation Virgo, M104, the Sombrero galaxy?  None of these should be a problem with an 8″ telescope, especially Andromeda and the Whirlpool (in the constellation Canes Venatici, the Hunting Dogs) which can, with good visual acuity, be viewed in binoculars! NB: yes, these are space telescope images. Well, except the first one, which was taken with an Earthbound telescope. They are for illustrative purposes only… and let’s face it, they’re all very nice to look at. ",
            "date": "Answered July 3, 2017",
            "views": "568",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Allister Graham",
                    "user_href": "/profile/Allister-Graham"
                },
                {
                    "user_id": "Mark Akers",
                    "user_href": "/profile/Mark-Akers-3"
                },
                {
                    "user_id": "Andy Davies",
                    "user_href": "/profile/Andy-Davies-48"
                },
                {
                    "user_id": "Riddhesh Sadariwala",
                    "user_href": "/profile/Riddhesh-Sadariwala"
                },
                {
                    "user_id": "Dan Rosenberg",
                    "user_href": "/profile/Dan-Rosenberg-8"
                }
            ]
        }
    ]
}