{
    "title": "What might be the future of the speech recognition technology? - Quora",
    "tags": [
        "Pattern Recognition",
        "Speech Recognition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dharmendra Patil",
                "href": "/profile/Dharmendra-Patil-6"
            },
            "answer_text": "Automatic Speech Recognition Market is expected to observe a high growth on account of increase in advanced electronic devices usage in the future. One of the major drivers observed in the market is the increasing voice passwords use by consumers. Text passwords are difficult to remember and easy to crack. Moreover, text passwords offer security threats. Therefore, organizations are focusing on adopting biometric passwords in the form of voice which are easy to remember as well as operate by population. Over the past decades, the field of automatic speech recognition was mostly a research topic. With increase in the amount of fraud, organizations realized a need for a robust system which could serve the purpose for fraud management. In this system, a person’s voice is treated as a password for identification and authentication. The main objective of using automatic speech recognition application is to fasten the security system with high accuracy. The need for entering correct passwords with keyboard for access results in time delays and long queues. Therefore, automatic voice based security systems are expected to find major applications where crowd control is required. Lack of supporting I.T infrastructure is hampering overall system growth as establishment of automatic speech recognition systems requires highly efficient I.T systems and maintenance. Mindset change is another factor which is expected to restrain global industry growth in the future. Some organizations are expected to hesitate in implementing new technologies and stick with their old systems. Voice recognition consists of front end and back end techniques. Front end techniques do face a challenge of accuracy and time delay. Therefore, back end recognition technique is vastly used owing to its high precision and speed benefits. These applications require a high amount of accuracy and should be able to handle disturbances or errors generated by noise. These systems also require high voice sensitivity detecting low pitch sounds as well. Banks are developing systems which allow transactions enabled through voice based security authentication. Substantial research is being done to implement in the field of military to implement voice recognition systems in high field aircrafts and helicopters. Speech recognition is also used for education purpose by people with disabilities. Other implementation includes home appliances, video games, interactive voice response and robotics. North America followed by Europe accounted for high demand for speech enabled applications. Such facilities require use of voice recognition technology. More Details: https://tinyurl.com/y8tjjrhk ",
            "date": "Updated August 13, 2018",
            "views": "761",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Jaworski",
                "href": "/profile/Ron-Jaworski"
            },
            "answer_text": "It’s 2019 and I see one thing (or one that I’m qualified to talk about) as the future of speech recognition technology: omnipresent voice user interface (VUI). If you take a look at what the market is striving to, you’ll see it has a lot of ties to the voice-first movement. In fact, voice-activated devices are essentially browsers 2.0 as people (on a global level) are increasingly gaining access to smart speakers, and voice activation is becoming mainstream in smartphones, TVs, cars, and whatnot. With VUI, there’s always talk of replacing graphical user interfaces. Although I believe that the entire debate is wrong right from the start as one should supplement the other, that’s a good example of what VUI can become. Voice user interfaces have created brand new standards and principles that go against the traditional sense of a user interface, mainly because VUI thrives under specific use cases. Think about it: it’s far easier and convenient to ask Alexa to play a specific song (even hum the tune by saying “play me the song that goes..” - try it, it’s fun), get a quick news update, or even check basic car diagnostics. But that’s just a small part as the true potential of speech recognition technology is yet to be realized. The current crop of digital assistants does a pretty good job of interpreting speech, but we’re far from the conversational interface that users want them to be. As technology advances, especially at this rate of progress, soon we should get more complex two-way relationships and a different, yet familiar way of interacting with our surroundings. Paired with GUI and tech like AR and VR, there’ll be a wide range of new opportunities for engagement. I’ve said this a few times before but it won’t hurt to say it again: we are moving toward a future where it will be increasingly difficult, perhaps even impossible to imagine life without voice and speech recognition technology will play a major part in that. ",
            "date": "Answered April 15, 2019",
            "views": "633",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noa Eshed",
                    "user_href": "/profile/Noa-Eshed"
                },
                {
                    "user_id": "Bharath Ballamudi (భరత్ బళ్ళమూడి)",
                    "user_href": "/profile/Bharath-Ballamudi-భరత్-బళ్ళమూడి"
                }
            ]
        }
    ]
}