{
    "title": "What is the difference between a smart TV and an Android TV? - Quora",
    "tags": [
        "Android TV",
        "Smart TVs",
        "Television Sets",
        "Android Application Development",
        "Android Devices",
        "Android Applications",
        "Television",
        "Android (operating system)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sanketh Sonawane",
                "href": "/profile/Sanketh-Sonawane-2"
            },
            "answer_text": "The simplest of differences are: Smart TV:Smart TVs have built-in apps along with the ability to connect to the internet. Depending on the unit most will have apps such as Netflix or Hulu which a users can stream straight to their TV. Advantages: Everything is in one packageOnly one remote control is needed. Disadvantages: Cost moreLimited amount of apps. Android TV Box:An Android TV box is a small computer that plugs into any TV and gives the user the ability to stream content, locally and online. Android is a well known operating system that many phones and tablets run on. This gives a android box a very large app library for most anything that can be thought of. Apps can be downloaded from the Google Play Store, installed and do most anything a standard computer can do from streaming videos to writing a email. Advantages:Turns any TV into a smart TVLow costLarge app library Disadvantages:Adds another box to a TVNeed to learn Android Interface. Smart TV vs Android TV Box While a smart TV is nice, a android TV box combined with a large standard TV is the best option, at least in my opinion. The price for a smart TV does not match its computing power compared to the hardware a android box can offer. Updates are also a problem for many smart TVs while androids are updated much more easily. Android has been around for longer and has many top selling phones and tablets which has created a very large community for help when needed. It also has created millions of apps which can be used with other android devices across hardware. The list of apps is endless with an android. Keyboards can be used like a desktop or small TV remotes used to stream videos and music. ",
            "date": "Updated October 15, 2019",
            "views": "4346",
            "upvotes": " View 224 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sajid Chowdhury",
                    "user_href": "/profile/Sajid-Chowdhury-5"
                },
                {
                    "user_id": "Ashu Sharma",
                    "user_href": "/profile/Ashu-Sharma-82"
                },
                {
                    "user_id": "Amina Shaikh",
                    "user_href": "/profile/Amina-Shaikh-1"
                },
                {
                    "user_id": "Vineet Anand Bedarman",
                    "user_href": "/profile/Vineet-Anand-Bedarman-1"
                },
                {
                    "user_id": "Claudio Bugatti",
                    "user_href": "/profile/Claudio-Bugatti"
                },
                {
                    "user_id": "Balu",
                    "user_href": "/profile/Balu-88"
                },
                {
                    "user_id": "Marco Di Cerbo",
                    "user_href": "/profile/Marco-Di-Cerbo"
                },
                {
                    "user_id": "Muhammad Umar",
                    "user_href": "/profile/Muhammad-Umar-307"
                },
                {
                    "user_id": "Vandana AGRAWAL",
                    "user_href": "/profile/Vandana-AGRAWAL-152"
                },
                {
                    "user_id": "Kate Russel",
                    "user_href": "/profile/Kate-Russel-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinayak Gupta",
                "href": "/profile/Vinayak-Gupta-326"
            },
            "answer_text": "A very good and intellectual question. There is not much difference between smart and android tv but there are some points that make android TV better. Smart TV Smart TV is a television that comes with built-in applications such as Netflix, Amazon Prime, Hotstar, and many more for watching movies. This TV supports other applications also for performing other tasks like playing games. Android TV But on the other hand, an Android TV supports the android operating system. Android is owned by Google so you can use the play store for downloading apps and games. Android TV also supports Google Assistant that you can use to give the command to TV for performing any task. You can also connect the Android TV with other smart devices at home. Rest other features like Live cast, home cloud, Chromecast technology, live streaming are the same in both smart and Android TV. Point to be noted-: In the television industry, Samsung and LG TVs are there which do not support the Android operating system. In Samsung's TVs, you will only find the Tizen operating system and on LG’s TV, you will find webOS. Rest 90 percent of the television companies like Sanyo, Mi, Kodak, Panasonic, TCL, Sony, etc supports Android OS. Conclusion-: Maximum people support Android TV but that does not mean that Samsung and LG TVs are not good. The Tizen and WebOS also support voice assistants like Alexa and sometimes Google Assistant. But Android TV has an advantage in that these TVs support google play store. Please upvote if you like the answer. ",
            "date": "Answered October 8, 2020",
            "views": "107",
            "upvotes": " View 37 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reena Begum",
                    "user_href": "/profile/Reena-Begum-9"
                },
                {
                    "user_id": "The Marshian",
                    "user_href": "/profile/The-Marshian"
                },
                {
                    "user_id": "Elleayv81 Elleayv81",
                    "user_href": "/profile/Elleayv81-Elleayv81"
                },
                {
                    "user_id": "S Samad",
                    "user_href": "/profile/S-Samad-1"
                },
                {
                    "user_id": "Rakshitha Ponnam",
                    "user_href": "/profile/Rakshitha-Ponnam"
                },
                {
                    "user_id": "Julio D Caeser",
                    "user_href": "/profile/Julio-D-Caeser"
                },
                {
                    "user_id": "Richell Pesa",
                    "user_href": "/profile/Richell-Pesa"
                },
                {
                    "user_id": "Health Wealth",
                    "user_href": "/profile/Health-Wealth-23"
                },
                {
                    "user_id": "Ansza",
                    "user_href": "/profile/Ansza"
                },
                {
                    "user_id": "Vikas Trivedi",
                    "user_href": "/profile/Vikas-Trivedi-33"
                }
            ]
        }
    ]
}