{
    "title": "What are the disadvantages of shopping online? - Quora",
    "tags": [
        "Online Shopping",
        "Shopping"
    ],
    "response": [
        {
            "author_info": {
                "name": "David King",
                "href": "/profile/David-King-1279"
            },
            "answer_text": "As great as shopping online is, it certainly does not come without its disadvantages. Disadvantages of Shopping Online Test products: The most common case is that of clothing that one can try on a physical store just to see if the size is right. Online it is difficult to estimate the size of the products properly so you can end up making a bad purchase. The detail here is that it only applies to a few things because even in physical stores not everything can be tested, as in the case of electrical appliances.Returns: If the order placed arrives in poor condition, incomplete or sent something different you can choose to make a return but just as it is difficult to make a face to face, it is also something complex to return things when they are purchased online. You have to take into account the conditions of each page before buying something to avoid disappointment with what is received because it can also cost money to make the return.Shipping costs: It has shipping options in most cases where they are free within the country, but if you buy something abroad costs can rise too much, to the point that it is cheaper to leave home and go to the branch nearest.Shipping time: when buying online we have to take into account that depending on the receiving address, we will have to wait some time to receive our purchase. Not always met the estimated deadlines, and that can bring us problems, especially when we travel. We must take into account, with time, if we want to buy online, to make sure that our orders reach us when we want.Unknown sellers: In the network, there are many options to buy, from well-known and trusted brands or chains to small businesses or the people themselves selling what they have and in this context, there are times that you can not fully trust all the sellers. If you choose to make the deal with third parties, there is a risk that the product will not arrive, something completely different will be sent, the money will be left and only time will be lost and distrust will be generated in this business model.Touch and try: It is not possible to test the item before buying it. The theory says that if a seller gets the buyer to have the product in his hand, more than half of the sale is made. On the Internet, we can not have the product in our hands. The imagination is the one who must work to convince us, and the risk of making mistakes will always be there.Mistrust: there is distrust of whether our purchase will arrive well, it will arrive in good condition, and most importantly, if it will arrive on time.Payment by credit card: to make purchases a credit card is necessary, and users may fear that by providing their banking information on the internet, they may be victims of theft or fraud. Once proven that online payment systems are currently very safe, this disadvantage disappears.Access denied to our favorite brand: It often happens that certain brands do not allow access to their US web pages, and redirect us to another website that is not the one we want. Although there are \"tricks\" to prevent this from happening, they are somewhat complex and this may be a barrier to buying our brand or favorite product.",
            "date": "Answered March 4, 2019",
            "views": "419",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gwyn Aton",
                    "user_href": "/profile/Gwyn-Aton"
                },
                {
                    "user_id": "See Jia Tong",
                    "user_href": "/profile/See-Jia-Tong"
                },
                {
                    "user_id": "Robbersway ;",
                    "user_href": "/profile/Robbersway"
                },
                {
                    "user_id": "Danica Joy Diomano",
                    "user_href": "/profile/Danica-Joy-Diomano"
                },
                {
                    "user_id": "Fariza Temirkhanova",
                    "user_href": "/profile/Fariza-Temirkhanova"
                },
                {
                    "user_id": "Soniya Pal",
                    "user_href": "/profile/Soniya-Pal-27"
                },
                {
                    "user_id": "Lukas Kat",
                    "user_href": "/profile/Lukas-Kat"
                },
                {
                    "user_id": "Domnik Melanie",
                    "user_href": "/profile/Domnik-Melanie"
                },
                {
                    "user_id": "Ruchika Kapadekar",
                    "user_href": "/profile/Ruchika-Kapadekar"
                },
                {
                    "user_id": "Nematov Samad",
                    "user_href": "/profile/Nematov-Samad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Storm",
                "href": "/profile/Matthew-Storm-1"
            },
            "answer_text": "Although online shopping is often touted as a 21st century way of shopping, it is really just a form of mail order. And as such, it suffers from all the disadvantages of mail order shopping. These disadvantages include the following: INABILITY TO RECEIVE PRODUCTS IMMEDIATELY Simply put, you have to wait for delivery. This generally takes a few days to several weeks. And the inconvenience can be major. For instance, Rock Auto may advertise that they are more convenient than brick and mortar auto parts stores because they deliver to your door. But they conveniently omit the fact that your car could be needlessly sitting undrivable for several days while you wait for your parts to arrive. The same goes for many other items which are needed inmediately. But besides the inability to get needed items quicly, there is also the lack of the instant gratification that you can get when you bring home items the same day from the mall. EXCESSIVE SHIPPING COSTS Some unscrupulous e-tailers like to use shipping and handling charges as a way to make a few extra bucks. When shipping charges start to approach the cost of the item (and I am NOT referring to ususual shipping situations, like overnight or international shipping), then the seller is price gouging, plain and simple. Other sellers may charge more reasonable rates, but end up shipping by very cheap (ie SLOW) means (like Media Mail). But even when shipping is reasonable, it can be excessive expensive to order certain items online vs buying at a brick and mortar store. This is particularly true for large items that must be shipped by freight. INABILITY TO EXAMINE ITEMS People make mistakes. And computer systems can indicate the wrong item for a specific application. You can catch auch mistakes at an actual store. But with online shopping, you cannot make sure you are getting the correct item. If you get the wrong item, you are stuck with having to send it back and wait for the correct one. MISREPRESENTATION OF ITEMS For the most part, you have to rely on a photograph of the item you are buying. Unscrupulous sellers can deliberately misrepresent items. And other times, pictures may be of an older or newer version of an item. This can be a concern if changes in an item affect its usability for a certain purpose. Used items can be another issue. Oftentimes, the photos used to sell used items are simply stock photographs of the item you are purchasing, and may not reflect the actual condition of the item. DIFFICULTY WITH RETURNS/EXCHANGES Since your order is coming to you through the mail (or other delivery service), then returns must be shipped back to the seller. This means that the buyer must often bear the expense of return shipping (and possibly the expense of shipping out the correct item). Some better sellers will send prepaid shipping labels. But regardless, you must take the time to go to the post office, UPS Store, etc. to ship the item. And even if you DON’T have to pay for shipping, you WILL have to wait for return shipping. ",
            "date": "Answered April 8, 2017",
            "views": "48",
            "upvotes": "0"
        }
    ]
}