{
    "title": "What are the different types of guitar? How do they play differently? - Quora",
    "tags": [
        "Guitarists",
        "Learning to Play Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Hower",
                "href": "/profile/Ken-Hower"
            },
            "answer_text": "Without diving into specific models, neck widths, etc., the main three are acoustic with nylon strings, acoustic with steel strings and electric guitars.  Nylon string guitars are very easy to play.  They are often the choice of new players, as they are easy on the fingers and don't require callouses on the finger tips.  So beyond playing Mariachi or Flamenco, nylon is the choice of casual players to avoid pain.   Steel string Acoustic are harder to play.  If you play regularly, building up callouses is preferred. It takes more finger strength to press the strings down, since they are at much higher tension.  But it is rewarding when fine acoustic guitar with steel strings rings out a tune.  And no, you can't exchange nylon with steel, the guitar is made for your string choice.  Electric has a little of both.  Due to the design, string \"action\" or height of strings over the neck, they are easier to play than steel acoustic to play.  However due to being metal strings, they still require calloused fingers, if you don't want to be in pain.  Plug a Les Paul into a Marshall stack, and none of that matters! ",
            "date": "Answered November 21, 2015",
            "views": "675",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Biel",
                    "user_href": "/profile/Robert-Biel-2"
                },
                {
                    "user_id": "Ahmet Güneş",
                    "user_href": "/profile/Ahmet-Güneş"
                },
                {
                    "user_id": "Blake Lopez",
                    "user_href": "/profile/Blake-Lopez-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lenin Stanley",
                "href": "/profile/Lenin-Stanley-1"
            },
            "answer_text": "Basically guitars are divided by two types!!! They are, Acoustic guitarsElectric guitarsThe sub division of these guitars are purely based on the sounds they make. Let me give you the types. Acoustic guitars : Hollow / rhythm guitar - which you see almost 90% of the places. And it has steel strings covered with brass. Nylon guitar - The strings are not steel but nylon material. Sounds different and also known as classical guitar. There are some more available but these two are most common one. Electric guitars : There's lots and lots of types available. But most common is, Lead guitars and bass guitars. ",
            "date": "Answered June 15, 2019",
            "views": "102",
            "upvotes": "0"
        }
    ]
}