{
    "title": "What is the most useless firearm ever made? - Quora",
    "tags": [
        "Useless Things",
        "Invention and Inventions",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lim Kagen",
                "href": "/profile/Lim-Kagen"
            },
            "answer_text": "It has to be the Mars Automatic pistol.  Mars Automatic pistol First off, the Mars Automatic pistol was a pioneer in the field of handguns like the C93.  C93 But, my god, is this gun awful! First off, let’s talk about its size. While the C93 has that weird rear end, the Mars Automatic pistol takes it to a whole new level.  Mars Automatic pistol held That is massive! For comparison, let’s look at the M1911, a weapon that was made only four years after the Mars Automatic pistol ceased production in 1907.  M1911 held That’s a huge size difference! Then there’s the mechanism, which, surprise surprise, is also huge.  Mars Automatic pistol mechanism It is as if Hugh Gabbet-Fairfax, the designer of this pistol, was designing a carbine when his boss at Webley-Scott told him to turn it into a pistol.  Hugh Gabbet-Fairfax  Webley Scott And I haven’t mentioned the fact that the Mars was an extremely heavy pistol, weighing a whopping 1.36 Kg[1]! For comparison, the C93 weights only 1.16 Kg[2], which is a difference of 200 grams! And the C93 came four years before the Mars Automatic pistol, which was introduced in 1897. It’s as if Webley and Scott threw out everything they learned about semi-auto pistol while creating the Mars Automatic pistol! And let’s not forget that Webley Scott decided that you had to put the trigger by flipping the bird. I’m not making this up. Look closely at the Mars Automatic pistol trigger guard.  Mars Automatic pistol trigger guard Notice the hole above the trigger guard? That’s where you put your pointer finger. And that leaves you with no choice but to pull the trigger with your middle finger. Is all this silly? Yes. But there is a justification for all this silliness. And that is the fact it was once the most powerful handgun in the world.  Most powerful handgun in the world The Mars Automatic pistol could be chambered in .45 Mars Long, which was rather large for its time.  .45 Mars Long Hence, there was a need to have a heft to the gun in order to make recoil a little less nastier. And the complicated mechanism was due to the fact that it was a very early semi-auto pistol and was thus, quite experimental. The middle-finger trigger also further helped to stabilise the gun, making it slightly more usable. But if there is something the current day shooting scene could tell us, it’s that bigger isn’t always better. When it was tested by the military, the military rejected it because of its large recoil, considerable muzzle flash and complexity[3]. In fact, the captain in charge of tests of the Mars at the Naval Gunnery School in 1902 had this to say about the Mars Automatic Pistol. No one who fired once with the pistol wished to shoot it again. Just like how it doesn’t make sense for a regular soldier to use a Desert Eagle, it doesn’t make much sense for a regular soldier to use the Mars Automatic pistol.  Desert Eagle  Desert Eagle held Hence, from a tactical point of view, the Mars Automatic pistol is useless. But like the Desert Eagle, it remains as an interesting side note on how far we have come technology-wise in the past 100 years or so. And not to mention that it looks downright badass. That’s all folks! Footnotes[1] Mars Automatic Pistol - Wikipedia[2] Borchardt C-93 - Wikipedia[3] Mars Automatic Pistol - Wikipedia",
            "date": "Updated February 3, 2019",
            "views": "583",
            "upvotes": " View 345 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mike Irwin",
                    "user_href": "/profile/Mike-Irwin-32"
                },
                {
                    "user_id": "Laird Sutherland",
                    "user_href": "/profile/Laird-Sutherland"
                },
                {
                    "user_id": "Sam Maupin",
                    "user_href": "/profile/Sam-Maupin"
                },
                {
                    "user_id": "D. Gaara Kurosaki",
                    "user_href": "/profile/D-Gaara-Kurosaki"
                },
                {
                    "user_id": "John Bray",
                    "user_href": "/profile/John-Bray-29"
                },
                {
                    "user_id": "William Loving",
                    "user_href": "/profile/William-Loving"
                },
                {
                    "user_id": "Steven McReynolds",
                    "user_href": "/profile/Steven-McReynolds-1"
                },
                {
                    "user_id": "Celina Mcdonalid",
                    "user_href": "/profile/Celina-Mcdonalid"
                },
                {
                    "user_id": "Mohammad Noor",
                    "user_href": "/profile/Mohammad-Noor-92"
                },
                {
                    "user_id": "Jason Taylor",
                    "user_href": "/profile/Jason-Taylor-434"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vernon Bender",
                "href": "/profile/Vernon-Bender"
            },
            "answer_text": "What is the most useless firearm ever made? There's a bunch of good answers here, and they've got it pretty much covered. But I'd like to add a firearm that while not compleatly useless, had only a single function. May I introduce to you the Punt Gun!  This absurd weapon was essentially a 2″ naval swivel gun, mounted in a stock. In use at the end of the 19th century, these monsters weighed more then 80 pounds, and could launch over a pound of shot in a single blast. Typically flintlock in operation, some later versions were made in percussion. Holland & Holland built an 8 gauge fowling piece, and marketed it as a punt gun, but it's a pale shadow of these giant shotguns. Too big and heavy to carry, they were typically mounted in small boats called Punts, hence the name.  The recoil of such a weapon was so heavy, it would push the entire boat back nearly a foot when discharged. It would be unwise to drop the hammer on this thing offhand. Punt guns were designed for the wholesale slaughter of waterfowl. A single discharge across a lake or pond could bag 50 or more birds, making it extraordinarily effective in commercial hunting. Also favored by poachers, it eventually became illegal to hunt with these things, due to the devastation they wrought on waterfowl populations. So, not technicaly useless, but so specialized in deployment (and outlawed in it's principle function) as to be effectively so. On the other hand, as a blackpowder weapon, you can likely own one with no licensing whatsoever across the entire US. A replica punt gun was built for the film Tremors 4, but it was only a mockup that fired 12 gauge blanks. However, it was over 8 feet long, and weighed in at just under 100 pounds. ",
            "date": "Answered July 19, 2019",
            "views": "514",
            "upvotes": " View 541 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jorlan Miranda",
                    "user_href": "/profile/Jorlan-Miranda"
                },
                {
                    "user_id": "Robert Henning",
                    "user_href": "/profile/Robert-Henning-1"
                },
                {
                    "user_id": "Rayne Hebert",
                    "user_href": "/profile/Rayne-Hebert"
                },
                {
                    "user_id": "Kalkidan Hagen",
                    "user_href": "/profile/Kalkidan-Hagen"
                },
                {
                    "user_id": "Dimitrij Maslov",
                    "user_href": "/profile/Dimitrij-Maslov"
                },
                {
                    "user_id": "David Sternberg",
                    "user_href": "/profile/David-Sternberg-12"
                },
                {
                    "user_id": "Shaun Lawson",
                    "user_href": "/profile/Shaun-Lawson-2"
                },
                {
                    "user_id": "Michael Jansen van Rensburg",
                    "user_href": "/profile/Michael-Jansen-van-Rensburg-1"
                },
                {
                    "user_id": "Stuart Kenny",
                    "user_href": "/profile/Stuart-Kenny-3"
                },
                {
                    "user_id": "Christian Shushok",
                    "user_href": "/profile/Christian-Shushok-1"
                }
            ]
        }
    ]
}