{
    "title": "What are the best sites to download chemical engineering books? - Quora",
    "tags": [
        "Torrent Website Recommendations",
        "E-book Downloads",
        "Chemical Engineering",
        "Website Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shruti Singh",
                "href": "/profile/Shruti-Singh-2465"
            },
            "answer_text": "Engineering books are expensive that's why people try to find them online for free but you don’t need to worry about them anymore . Downloading books online and studying from the pdf is not an easy task. So, its better to go for hardcopies. Best site where you can get your engineering books that too hardcopies is MyPustak. Their website provide books at free of cost and deliver them to your doorsteps. You can simply visit to their website and checkout all the engineering books and order them,the quality of books they provide is also great. So don’t worry about prices anymore and buy your books online and prepare well. #Mypustak #Freebooks #Engineering  ",
            "date": "Updated October 14, 2020",
            "views": "295",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vibha Gurnani",
                    "user_href": "/profile/Vibha-Gurnani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anamitra Ghosh",
                "href": "/profile/Anamitra-Ghosh-12"
            },
            "answer_text": "I don’t know much about downloading, having always preferred physical copies. Engineering books are difficult to get by in pdf format. I have always seen my friends who study engineering get second-hand copies of books from their seniors. But, when some books are actually unavailable, or when we are not at our hostels, like in this pandemic situation, we can rely on technology to save us yet again. I recently came across this website called MyPustak. They offer second-hand books for free and just take the delivery charges in return. I can recommend A textbook of Engineering Chemistry by M M Uppal for your perusal. Happy Reading!  ",
            "date": "Updated October 12, 2020",
            "views": "288",
            "upvotes": "0"
        }
    ]
}