{
    "title": "What are the limitations of modern astronomy? - Quora",
    "tags": [
        "History of Astronomy",
        "Astronomy (college major)",
        "Learning About Astronomy",
        "Limitations",
        "Amateur Astronomy",
        "Cosmology",
        "Astrophysics",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raj Solanki",
                "href": "/profile/Raj-Solanki-244"
            },
            "answer_text": "An electric potential (also called the electric field potential, potential drop, or the electrostatic potential) is the amount of work needed to move a unit of electric charge from a reference point to a specific point in an electric field without producing an acceleration. Typically, the reference point is the Earth or a point at infinity, although any point can be used. In classical electrostatics, the electrostatic field is a vector quantity which is expressed as the gradient of the electrostatic potential, which is a scalar quantity denoted by V or occasionally φ, [1] equal to the electric potential energy of any charged particle at any location (measured in joules) divided by the charge of that particle (measured in coulombs). By dividing out the charge on the particle a quotient is obtained that is a property of the electric field itself. In short, electric potential is the electric potential energy per unit charge. This value can be calculated in either a static (time-invariant) or a dynamic (varying with time) electric field at a specific time in units of joules per coulomb (J⋅C−1), or volts (V). The electric potential at infinity is assumed to be zero. And Electric potential energy, or Electrostatic potential energy, is a potential energy (measured in joules) that results from conservative Coulomb forces and is associated with the configuration of a particular set of point charges within a defined system. An object may have electric potential energy by virtue of two key elements: its own electric charge and its relative position to other electrically charged objects. The term \"electric potential energy\" is used to describe the potential energy in systems with time-variant electric fields, while the term \"electrostatic potential energy\" is used to describe the potential energy in systems with time-invariant electric fields ",
            "date": "Answered October 22, 2020",
            "views": "255",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "My Favourite Samayal",
                    "user_href": "/profile/My-Favourite-Samayal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "KG Dharani",
                "href": "/profile/KG-Dharani-2"
            },
            "answer_text": "At each point of time in the history of science, people thought they have reached the limits of observation and that was the end; but science progressed regardless of our intuitions and this progression is chiefly because of revising and discarding the older ideas and inviting a fresh thinking. Improvement in ideas in science improves technology which, in turn, increases our scope of observation. Hence, the crux of the problem is revision of older ideas. It seems we have reached a cul-de-sac in fundamental science by proclaiming “scientifically” that the fundamental nature of matter/energy can NEVER be known by our intuition and it is only a mathematical construct - but, even so, our full understanding of nature in explaining all the observed phenomena is far from complete! I believe that we are in need of another model by going back a little bit and reconstructing our facts in a different setting. I think, our dogma itself has become a limiting factor in science including astronomy. ",
            "date": "Answered October 17, 2020",
            "views": "277",
            "upvotes": " Answer requested by Chirag Khatri"
        }
    ]
}