{
    "title": "What are information technology operations? - Quora",
    "tags": [
        "IT Operations",
        "Learning About Information Technology",
        "Operations",
        "Operations Research",
        "Operations Management",
        "Information Technology",
        "Computer Science",
        "Technology",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nitish Bhardwaj",
                "href": "/profile/Nitish-Bhardwaj-584"
            },
            "answer_text": "IT Operations is the broad term for the processes and services managed by the information technology (IT) department of an organization. As such, IT operations include administrative processes and hardware and software support, for internal and external customers. The important functions of the IT operations team include technical management and quality assurance, as well as infrastructure management and confirmation that finished products meet all customer needs and expectations. Every organization that uses computers has at least some roughly defined IT operations, based on how it tends to meet customer and internal needs. The elements of IT operations are chosen to provide efficient services with the required quality and cost; they are generally considered distinct from computer applications. In a software development company, for example, IT operations includes all IT functions other than software development and management. However, there is still some overlap between departments. IT operations managers are the owners of the IT operations control process process, whose purpose is to exercise and maintain control over IT services and the underlying connected infrastructure. This includes monitoring associated daily and routine tasks such as workload scheduling, data backup, restoring systems from outages, and other regular maintenance activities. ",
            "date": "Answered September 24, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}