{
    "title": "What are the best futuristic movies? - Quora",
    "tags": [
        "Futuristic Movie Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sagar Singh",
                "href": "/profile/Sagar-Singh-103"
            },
            "answer_text": "Some of the best futuristic movies I have seen are Edge of tomorrow (2014)  With the help of warrior Rita Vrataski, Major William Cage has to save Planet Earth from an alien species, after being caught in a time loop. Does he have the skills to exterminate the aliens? Oblivion (2013)  In a post-apocalyptic future, a repairman encounters various strange experiences and discovers much later that the future of mankind lies in his hands. Pacific Rim (2013)  The government terms the Jaegers, robotic war machines battling the Kaijus, ineffective. But Stacker Pentecost and his team believe that only the Jaegers can save the world from destruction. I am Legend (2007)  Robert Neville, a scientist, is the last human survivor of a plague in the whole of New York. He attempts to find a way to reverse the effects of the man-made virus by using his own immune blood. Mad Max: Fury Road (2015)  In an apocalyptic world, a tyrant rules over a stark desert, controlling every drop of water. Two rebels, one escaping grief and the other reaching out to her childhood, are the last hope for a few. 12 monkeys (1995)  In a post-apocalyptic future, a man travels back in time to the '90s in an attempt to discover the deadly virus that will eventually wipe out the human race. Wall E (2008)  A robot who is responsible for cleaning a waste-covered Earth meets another robot and falls in love with her. Together, they set out on a journey that will alter the fate of mankind. Interstellar (2014)  In the future, Earth is slowly becoming uninhabitable. Ex-NASA pilot Cooper, along with a team of researchers, is sent on a planet exploration mission to report which planet can sustain life. ",
            "date": "Answered October 14, 2017",
            "views": "233",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandhya Bharti",
                    "user_href": "/profile/Sandhya-Bharti-10"
                },
                {
                    "user_id": "Ana Raja",
                    "user_href": "/profile/Ana-Raja-1"
                },
                {
                    "user_id": "Bart Scantlin",
                    "user_href": "/profile/Bart-Scantlin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amit Pallath",
                "href": "/profile/Amit-Pallath"
            },
            "answer_text": "Ex-machina (2014)  What happens when artificial intelligence matures to a level where it goes one up on you. It's a tightly woven story which builds up the tension over the course of the length of the movie. The viewer gets fooled like the main human protagonist Caleb. It proves to the audience that it's quite clearly possible to deceive humans with artificial intelligence. Humans are a bunch of hormones and emotions which can be manipulated if you know the trigger points. The AI soon finds his (main protagonist's) weak points and plays with it for it's own escape. The surreal atmosphere and music combined by a convincing screenplay effectively scripts a story which makes you think about the eventualities of a world infused with AI elements. Her (2013)  There are elements of this future around us now. A reclusive writer tries to find company in an operating system. The system studies his online records and customizes itself to cater to his needs. We, nowadays, have willing put all our data on the clouds. All the social media sites, photos, videos, emails and other entries across the net give enough fodder to build your profile. The OS studies all these freely available data and crunches the analytics to provide you the best partner. The same concept is explored in certain episodes of the series 'Black mirror' and 'Dark Net'. You are data. We have reached a level of proficiency in processing data to gain insights in the present day world. Apply it to humans and voila. Moon (2009)  What if a clone of you can be created to carry out your work ad infinitum? The clone doesn't need to know about the reality. Memory is fed into it's cache and an imagined past can be created for it to live on. When the work is completed it can be expended and a new clone can takes it's place. Clones with human intelligence and memory manipulated and used only to get the work done. It raises deep existential questions. All these movies have deep philosophical implications apart from the futuristic angle explored. ",
            "date": "Answered August 17, 2018",
            "views": "200",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kabeer Ali",
                    "user_href": "/profile/Kabeer-Ali-48"
                },
                {
                    "user_id": "Avani",
                    "user_href": "/profile/Avani-27"
                },
                {
                    "user_id": "Navin Kumar",
                    "user_href": "/profile/Navin-Kumar-850"
                },
                {
                    "user_id": "Shyam Venkatesh",
                    "user_href": "/profile/Shyam-Venkatesh"
                }
            ]
        }
    ]
}