{
    "title": "What are the subtopics in industry 4.0? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Pierre Kirisci",
                "href": "/profile/Pierre-Kirisci"
            },
            "answer_text": "It really depends who you ask, i.e. an engineer's answer might be different from the answer of a computer scientist or the view of a strategy consultant. As for me, being an engineer with a focus on Human-Computer-Interaction in manufacturing environments, I see the following sub-topics as highly relevant in Industrie 4.0 (it is by the way Industrie 4.0 and not Industry 4.0 since the initiative originated in Germany). Sensors, embedded systems, IoT componentsRobotics, particularily Human-Robot-InteractionUser Interfaces including Software and Hardware Devices for interacting with systemsCybersecurity regarding IST systems and Safety sich as functional Safety of IoT componentsPositioning and Identification systemsWireless Network TechnologyNew Methods of WorkCloud and Fog ComputingArtificial IntelligenceIndustrie 4.0 Business modelsCyberphysical Systems including new methods for systematically designing Cyberphysical SystemsDistributed ComputingConsider this as only as a list of the topics that (according to my own experience and research background) I currently consider as most relevant. I might have missed further important sub-topics, but as I said…it depends in who you ask. Give me an upvote if my answer helped. ",
            "date": "Answered September 24, 2017",
            "views": "14",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kathleen Bergin Green",
                    "user_href": "/profile/Kathleen-Bergin-Green"
                },
                {
                    "user_id": "Rodolfo Burgos",
                    "user_href": "/profile/Rodolfo-Burgos-2"
                },
                {
                    "user_id": "Sidiq Mohamad",
                    "user_href": "/profile/Sidiq-Mohamad"
                },
                {
                    "user_id": "Vigneshpalanisamy",
                    "user_href": "/profile/Vigneshpalanisamy"
                },
                {
                    "user_id": "Mark Bergman",
                    "user_href": "/profile/Mark-Bergman-7"
                },
                {
                    "user_id": "Marepalli Narsimulu",
                    "user_href": "/profile/Marepalli-Narsimulu"
                },
                {
                    "user_id": "Pablo José García Samartino",
                    "user_href": "/profile/Pablo-José-García-Samartino"
                },
                {
                    "user_id": "Saad Anwar",
                    "user_href": "/profile/Saad-Anwar-4"
                },
                {
                    "user_id": "innius",
                    "user_href": "/profile/innius"
                },
                {
                    "user_id": "John Heaver",
                    "user_href": "/profile/John-Heaver"
                }
            ]
        }
    ]
}