{
    "title": "What are some examples of art inspired by technology? - Quora",
    "tags": [
        "Artwork",
        "The Arts",
        "Fine Art"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rachel Siegfried",
                "href": "/profile/Rachel-Siegfried-2"
            },
            "answer_text": "Over the past few decades, art and tech have become more intertwined than ever before, whether it’s through providing new ways to mix different types of media, allowing more human interaction or simply making the process of creating it easier. Case in point is a show titled “Digital Revolution” that opened earlier this summer in London’s Barbican Centre. The exhibit, which runs through mid-September, includes a “Digital Archaeology” section which pays homage to gadgets and games that not that long ago dazzled us with their innovation. (Yes, an original version of Pong is there, presented as lovable antiquity.) But the show also features a wide variety of digital artists who are using technology to push art in different directions, often to allow gallery visitors to engage with it in a multi-dimensional way. ",
            "date": "Answered February 21, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheldon Mojelski",
                "href": "/profile/Sheldon-Mojelski"
            },
            "answer_text": "Oil paint invented in the Renaissance changed painting for the better. No other paint could quite give off that soft shiny glow that oils produce.  When the camera started to become popular in the late 1800s it left artists free to explore modes of painting other than realism. Impressionism, Expressionism and eventually Modernism were born.  ",
            "date": "Answered February 20, 2018",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brent Porter",
                    "user_href": "/profile/Brent-Porter-7"
                },
                {
                    "user_id": "Siddhant Mody",
                    "user_href": "/profile/Siddhant-Mody-1"
                },
                {
                    "user_id": "Fred Edward",
                    "user_href": "/profile/Fred-Edward"
                },
                {
                    "user_id": "Paul Dwyer",
                    "user_href": "/profile/Paul-Dwyer-11"
                }
            ]
        }
    ]
}