{
    "title": "What are some startup ideas every country should have? - Quora",
    "tags": [
        "Startup Ideas",
        "Entrepreneurship",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "J. Janiero",
                "href": "/profile/J-Janiero"
            },
            "answer_text": "Any business that can solve the problems for the greater community is a great startup idea. Third world countries may be looking for solutions to access basic needs like clean water or electricity. These countries can also look into providing vaccines and medical solutions. Whether it is the disease rates, crime rates or poverty, health. All these areas are surely needing inexpensive and wide reaching solutions. Find ways for more people to access these medical support. In my opinion, these would be the fundamental needs that these third world countries will be looking at. Developing nations would be looking at how to improve in technology and sciences, advancement in medical technologies and health solutions. How to upgrade and bring the nation to the next level. Great examples would be how Uber has changed the way we commute, AirBnb changes the way of travelling, budget airlines where flying becomes more affordable. High speed internet. Creating a high productivity nation with a higher per capita income, with access to more jobs and opportunities. These are some of the ideas that you can further spin off and work on. Cheers. ",
            "date": "Answered May 19, 2018",
            "views": "268",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Wiam AmaMou",
                    "user_href": "/profile/Wiam-AmaMou"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Martin",
                "href": "/profile/Doug-Martin-27"
            },
            "answer_text": "Any service business meshed into the local culture and customs would viable ideas in my opinion. Quality customer service is a main key in success of startup idea. The idea of know your customer is universal. What need of the buying public are you suppling? Local buying trends. Areas lacking your idea. There so many questions to answered concerning a soild startup idea. Ideas become reality one step at a time. ",
            "date": "Answered May 16, 2018",
            "views": "43",
            "upvotes": " Answer requested by Wiam AmaMou"
        }
    ]
}