{
    "title": "What's the difference between a gaming PC and a powerful work PC? - Quora",
    "tags": [
        "Personal Computing Hardware",
        "Personal Computers",
        "PC Gaming ",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Kra",
                "href": "/profile/David-Kra"
            },
            "answer_text": "Graphics: Gaming PC’s have fast, powerful video adapters with lots of memory and fast refresh rates at high resolutions.Most work PC’s are not used in ways that exploit these capabilities. Exceptions include video and image manipulation.Display: Gaming PC’s have displays that can provide high resolution at high refresh rates.Sound Gaming PC’s often have advanced sound cards and attached powered speakers with power amplifiers and subwoofers. Thay may have headsets with multiple speakers per ear.Work PC’s are more likely to have no or small, low powered speakers. They are more likely to be equipped with an inexpensive headset for occasional use, or a good headset for Internet conference calls and web meetings.Webcam A gaming PC might have a high resolution webcam.A work PC might have a lower resolution webcam for web meetings.Keyboard and mouse: Gaming PC’s often have fancy keyboards with extra keys whose behavior can be customized and high resolution mice with extra buttons whose behavior can be customized.Case: Gaming PC’s often have fancy cases with decorative elements inside and outside that serve no functional purpose.LAN Connection: Work PC’s often have a wired Ethernet connection. In many work environments, the connection bit rate is 1 Gbps.ECC memory: Sadly, except for those with a “workstation” class work PC, nobody has a quality trustworthy computer with ECC memory.",
            "date": "Updated May 15, 2019",
            "views": "2",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Simon Sy Farisane",
                    "user_href": "/profile/Simon-Sy-Farisane"
                },
                {
                    "user_id": "Henry Godbolt IV",
                    "user_href": "/profile/Henry-Godbolt-IV"
                },
                {
                    "user_id": "Harsh Kumar",
                    "user_href": "/profile/Harsh-Kumar-3484"
                },
                {
                    "user_id": "William Du",
                    "user_href": "/profile/William-Du-38"
                },
                {
                    "user_id": "Nicholas Aderhold",
                    "user_href": "/profile/Nicholas-Aderhold"
                },
                {
                    "user_id": "Don Shiner",
                    "user_href": "/profile/Don-Shiner"
                },
                {
                    "user_id": "Andrew Marcell",
                    "user_href": "/profile/Andrew-Marcell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Lonero",
                "href": "/profile/Andrew-Lonero-1"
            },
            "answer_text": "That really depends on what your “work\" is because there are a lot of people who use high power PCs with expensive graphics cards for work when their work deals with graphics, games, video editing, and massive parallel processing applications. But then again, if you just need programs like Word and Excel, then you just need a basic ~$300 machine. However, you can generally think of a “gaming computer” as a PC that is pretty much built around supporting a high end graphics card and the other components are generally supportive to that end. It should play games well and that's all you care about. Also high performance computing PCs that are often used in scientific research often use a medium powered GPU, if using a discrete card at all, and use way more RAM than ever would be practical in a gaming PC. Most geophysicists I know have PCs with 64 to 128 GB of very fast ram. Also if you're doing any kind of video, photo, or audio editing, you want a better CPU that you usually need for just gaming. Those are a few basic differences, but everyone gets a PC to suit the various needs that they have for whatever they need to do with it. ",
            "date": "Answered March 9, 2019",
            "views": "13",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "John B. Anderson III",
                    "user_href": "/profile/John-B-Anderson-III"
                },
                {
                    "user_id": "Sahil Hakani",
                    "user_href": "/profile/Sahil-Hakani"
                },
                {
                    "user_id": "Oscar Cook",
                    "user_href": "/profile/Oscar-Cook-9"
                },
                {
                    "user_id": "Harley Faggetter",
                    "user_href": "/profile/Harley-Faggetter"
                },
                {
                    "user_id": "Andreas Reiner Szallis",
                    "user_href": "/profile/Andreas-Reiner-Szallis"
                },
                {
                    "user_id": "Krishnaraj Subhashithan",
                    "user_href": "/profile/Krishnaraj-Subhashithan"
                },
                {
                    "user_id": "Oleg Kolesnikov",
                    "user_href": "/profile/Oleg-Kolesnikov-1"
                },
                {
                    "user_id": "Vladislav Zorov",
                    "user_href": "/profile/Vladislav-Zorov"
                },
                {
                    "user_id": "Hunter Logan",
                    "user_href": "/profile/Hunter-Logan-11"
                },
                {
                    "user_id": "Mattheus Hetzenauer",
                    "user_href": "/profile/Mattheus-Hetzenauer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Chen",
                "href": "/profile/Lawrence-Chen-66"
            },
            "answer_text": "The difference usually come from three aspects. Extreme performance or best compromise. Gamer machines usually have better performance than the best workstation, though the margin would not be big. Why, ECC type memory plus lower frequency on workstation would reduce it's general performance as gaming machine usually tuned to best possible super high frequency plus non ECC type ram… also, Nvidia GeForce or and raedon consumer edition have more extreme frequency versus conservatively tuned Quadro or FirePro cards.Displays, gaming machine usually opted to glossy finish for better transparency rate and used higher refresh rate panel(start from 120Hz) to harvest better fluency, as for Workstations, they would usually go for just 60Hz or up to 120Hz display but come with much more accurate color coverage and matte finish for more enviroent friendness.Different design, all Workstations looks very old as gaming machines can be very sexy.Lastly, if you would spend $5000 on a laptop, both sides would give you gorgeous experience Above ",
            "date": "Answered May 11, 2019",
            "views": "447",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Andrew Lonero",
                    "user_href": "/profile/Andrew-Lonero-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Le Clezio",
                "href": "/profile/Jason-Le-Clezio"
            },
            "answer_text": "A gaming PC is both .A powerful work PC probably doesn’t have the sound,graphical or speed capabilities of a gaming PC and companies don’t like buying top range when mid or low does the job adequately getting a company to spend money it doesn’t need to spend is like getting blood out of a stone unless you are the owner ",
            "date": "Answered May 18, 2020",
            "views": "28",
            "upvotes": " Answer requested by Oleg Kolesnikov",
            "upvoters": [
                {
                    "user_id": "Oleg Kolesnikov",
                    "user_href": "/profile/Oleg-Kolesnikov-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefan Gebhardt",
                "href": "/profile/Stefan-Gebhardt-2"
            },
            "answer_text": "Gaming: CPU Intel Core I9, GPU Nvidia RTX 2080 Work: CPU Intel Xeon E5, GPU Nvidia Quadro P6000 The gaming pc needs the power to render high quality graphic frames as fast as possible in a changing game environment. It's for very good image quality. The work pc needs the different power to calculate 3D images correctly for things like 3D printing and so on, or to calculate process simulations etc. It's for simulating desired outcomes that don't need good graphics. ",
            "date": "Answered March 9, 2019",
            "views": "130",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Adlai Armundsen",
                "href": "/profile/Adlai-Armundsen"
            },
            "answer_text": "I would say GPU is the main difference. I have two MSI laptops, a gaming one and a work one. Both have much the same specs, but the gaming one has a 1060 GPU and the other not. ",
            "date": "Answered March 12, 2019",
            "views": "17",
            "upvotes": " Answer requested by Oleg Kolesnikov"
        },
        {
            "author_info": {
                "name": "Todd Bailey",
                "href": "/profile/Todd-Bailey-40"
            },
            "answer_text": "workstation pc usually have a generic video card adapters, game machines usually have 1 or more higher end video adapters ",
            "date": "Answered May 18, 2020",
            "views": "11",
            "upvotes": " Answer requested by Oleg Kolesnikov"
        }
    ]
}