{
    "title": "What is the AVID program about? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Madhuri Shree",
                "href": "/profile/Madhuri-Shree"
            },
            "answer_text": "AVID supports students by developing skills such as time management, note-taking, study habits, problem-solving, and peer collaboration. Students participate in collaborative study groups supported by facilitators, who are trained to use questioning strategies to help students problem solve and gain confidence in their learning. Elements of Avid Program: Equity - AVID is closing the opportunity gap in college graduation rates among diverse and underrepresented demographic groups. Teacher Effectiveness - The AVID Effect is realized through the delivery of inquiry-based and student-centric instruction, which increases levels of effectiveness. Leadership - AVID leaders shift the campus culture to drive change and spread best practices. Student Learning - With AVID, teachers inspire students to take control over their own learning. ",
            "date": "Answered November 28, 2019",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Doug Welsch",
                "href": "/profile/Doug-Welsch"
            },
            "answer_text": "AVID stands for Advancement Via Individual Determination. It is a college readiness program designed to help students develop the skills they need to be successful in college. There is an AVID website at https://www.avid.org, where you can explore the program. Be aware that the program is based on rigorous standards developed by middle and senior high school teachers collaborating with college professors. AVID is driven by the WICOR method, an acronym for writing, inquiry, collaboration, organization, and reading. ",
            "date": "Answered April 18, 2018",
            "views": "96",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/John-5192"
                },
                {
                    "user_id": "Jill Ashley-Grochowski",
                    "user_href": "/profile/Jill-Ashley-Grochowski"
                }
            ]
        }
    ]
}