{
    "title": "What is the difference between the Xbox One and Xbox One S? - Quora",
    "tags": [
        "Xbox One (video game console)",
        "Xbox (console series)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darren Forster",
                "href": "/profile/Darren-Forster-5"
            },
            "answer_text": "The Xbox One is the first generation Xbox One console. The console itself has a port for the Kinect sensor, but doesn’t support 4K gaming. It’s max resolution is 1080p. The Xbox One also has a massive power brick for it’s power (similar to the old Commodore 64 power bricks!) The Xbox One S is the second incarnation of the Xbox One console - both the S and X were released at the same time. The S does have 4K gaming similar to the PS4 Pro, and also includes a UHD optical drive too (really handy for watching UHD films on - one thing that was missed on the PS4 Pro!). A lot of the 4K graphics are upscaled rather than re-rendered as it has a slightly lower spec than the Xbox One X. Also it no longer has a power brick and uses a standard figure of 8 lead for power. The Xbox One S also a lot more slimmer than the original Xbox One. There are also more USB ports on the Xbox One S than the original and they’ve been moved to both the front and rear of the console, on the original Xbox One the front USB port was actually on the side - bit awkward really as if you put it in a cabinet with sides then you had to pull it forward to gain access, I guess Microsoft realised this problem and moved it to the front. The Xbox One S had the Kinect port removed from the system and replaced it with an extra USB port on the back - Kinect can still be used with the Xbox One S however a specialist adapter is required - as Microsoft have discontinued both the Kinect and the special adapter these can be quite tricky to come by - and regularly go for quite a lot on eBay - you can sometimes find them on AliExpress as well. the Xbox One X is the premium console - this has full 4K support, the spec of it is far higher than even the PS4 Pro and is considered to be the premium console of the current generation. Very similar design to the S although usually the X is in black where as the S is in white although there is a few limited edition white versions as well as a few other case designs too. ",
            "date": "Answered February 2, 2020",
            "views": "631",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tracy-Mark Gorgas",
                    "user_href": "/profile/Tracy-Mark-Gorgas"
                },
                {
                    "user_id": "Jeff Fuhrman",
                    "user_href": "/profile/Jeff-Fuhrman"
                },
                {
                    "user_id": "Stephen M. Herbert",
                    "user_href": "/profile/Stephen-M-Herbert"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Vargas",
                "href": "/profile/Andrew-Vargas-18"
            },
            "answer_text": "Firstly and most noticeable, the color and size. The One S is white, as well as being 40% smaller than the larger black Xbox One. Secondly, the power brick is internal, instead of having a large power brick, the One S simply has a power cable. Another design aspect that makes the One S much better than the Xbox One is the fact that the system has one large fan rather than the Xone ones three smaller fans. Lastly comes the 4K support, the One S allows streaming and Blue-Ray playing of 4K quality, it also allows for 4K up scaling of games but does not play them natively. ",
            "date": "Answered December 22, 2018",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Pollard",
                    "user_href": "/profile/Andrew-Pollard-21"
                }
            ]
        }
    ]
}