{
    "title": "What happened to all of Tesla’s free electricity promises? - Quora",
    "tags": [
        "Nikola Tesla",
        "Tesla (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Sickinger",
                "href": "/profile/Mike-Sickinger-1"
            },
            "answer_text": "UPDATE: Either I missed it or the person who asked the question added “Nikola” meaning the person, not the car company. Sooo, I read the question wrong but will leave my answer for anyone who might have made the same mistake I made. And by the way, GREAT question, Nikola Tesla DID have some sort of idea for free electricity for the masses. I’m not qualified to answer! Not sure how to answer this one. Perhaps the person asking is shorting Tesla stock (meaning they stand to make money when the stock goes down, ie they want to see the company fail) and is hoping that by asking a leading question will cause others to think less of Tesla. So the answer is NOTHING “happened” to Tesla’s free electricity for the “masses.” Now here is where I will make assumptions. I assume the the question is leading me to ask myself: hmmm, something happened? I read further and I again ask, electricity was free for the masses? Then I think hmm, I do recall something about Tesla charging is free for life. Next I think ah, Tesla took it away :-( Now since I’m the average person I now have the idea in my head that Tesla took away free charging. If I were considering Tesla as a choice for a vehicle, this may be enough for me to give other brands more consideration. (score one for a person shorting the stock!) If I’m just a little suspect of the company or even just big companies I might think, I knew, it they are no good (score two point for the shorter) Next time Tesla comes up in conversation I can add my negative position as I believe it to be true. If anyone I discuss this with shifts their opinion of Tesla in a negative way, score a bunch more points for shorters. If there are people who own Tesla stock in the conversation perhaps we as a pair, or even worse, a group - we all might come to the conclusion that maybe it’s time to sell our Tesla stock. Shorters score again! THIS IS EXACTLY WHAT SOMEONE SHORTING TESLA IS AIMING TO ACHIEVE. Maybe you get the impression I don’t like Shorting stocks. That would be correct. We are taking about a real company that has real people at it working hard to produce something. That’s worth something to me. The fact that companies have to contend with large groups of people whose sole purpose is betting that the company will fail AND taking active steps to make it happen is an unfair pressure on a company. (I know, life is unfair. But I don’t have to encourage it) So asking a leading question like this one, on a public forum that tends to be well read can be in fact damaging to Tesla. Now for the truth, and I sincerely apologize if the person asking the question is maybe an 8th grader with a serious question. If you are, good on you for your curiosity and so sorry about being an “adult” and talking about stuff that was not really your question. Here is the answer you were looking for. **NOTHING “happened” to Tesla’s free electricity for the “masses.”** If what you mean is that the Model 3 is the car for the masses - free charging was never promised for this car. To be clear the FREE for LIFE charging has NEVER been offered to Model 3 buyers. If anyone can show me this in writing, from Tesla, I PLEASE let me know as this would be very uncool of Tesla. The Model S and X DID offer free charging. For the LIFE of THAT car. Why might Tesla offer it on the S and X free? Well, long pause, compare the price of the S and X to the Model 3. I think that explains it. More bluntly, as Tesla says, Free Supercharging was “bundled” into the sales price. In fact, the Nissan Leaf offers FREE charging for ONE year. (bundled) This is a bonus a person gets when buying these cars. So yes, the Model S and X had the bonus for FREE for a number of years thus providing “free” (bundled) electricity. However, the S and X are not cars for “the masses” - even if it seems like it where I live! I see them all the time! Love it! But sadly, I am not one of them. There is good news though, the new “bundle” is: “As of 1/1/2017 buyers get 400 kWh of free Supercharging credits per year.” Even better: IF you can get a referral code from an existing Tesla owner you would receive FREE for LIFE Supercharger access (as long as you own the car) on the new Model S or Model X purchased. So if you want an S or an X with free Supercharging, flag down an owner. I’m sure they will be happy to help you out. Heck, I’ll help you find one if it will convince you to buy a Tesla. End notes that are not really relevant to the question: I do own a Nissan Leaf. I think the overall experience is far superior to any gas car I’ve ever owned. 50K and I still have all my “bars” - a measure of battery capacity. I do not miss stopping for gas.I do not have any range anxiety.I love how quiet it is.I appreciate the snappy acceleration.Low maintenance - tires and wipers has been about it with 50K I was a bit surprised, I really don’t drive more than 80 mile in one day. I’ve owned mid range cars. Honda, Toyota, VW and Ford. I’ve driven well over 100k in various brands of rentals including the big USA three, the South Koreans and Audi and Mercedes but never BMW - just never had the opportunity. Lots of love for driving. Electric really is the best experience, in my opinion. I like to take 400–800 mile trips about 2 or 3 times a year. I keep an old Honda Civic for this purpose. If or when it every dies I will just rent cars for these trips. I’d love to have a Model S because with Supercharging it would cover 100% of my driving needs but reality says the extra cost of the S is better spent elsewhere. However, I think it is pretty remarkable that the Leaf covers ALL of my daily needs. I even have a little trailer that I can haul stuff in. And I’ve hauled a TON of stuff in it. I mean literally, 2,000 pounds! The gravel place weighed it. Advice: drive slow, plan for stops, use back roads, 25–30mph and all is well. Hope this helps! ",
            "date": "Updated May 14, 2018",
            "views": "961",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Duncan Cairncross",
                    "user_href": "/profile/Duncan-Cairncross"
                },
                {
                    "user_id": "Terry Proveau",
                    "user_href": "/profile/Terry-Proveau-1"
                },
                {
                    "user_id": "Arvin Chang",
                    "user_href": "/profile/Arvin-Chang"
                },
                {
                    "user_id": "Nymul Khan",
                    "user_href": "/profile/Nymul-Khan"
                },
                {
                    "user_id": "William Rogers",
                    "user_href": "/profile/William-Rogers-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loring Chien",
                "href": "/profile/Loring-Chien"
            },
            "answer_text": "This is an ambiguous question. It has for subjects both Tesla Motors (company) and Nikola Tesla. Nikola Tesla the eccentric inventor and electrical pioneer for whom Tesla Motors is named after in his later life was pursuing and promising free wireless electricity for everyone. But the other topic, Tesla Motors, has promised supercharging stations around the country that will charge their EV cars, and that for certain customers, the charging will be free of charge. Two entirely different scenarios. I think not that many are familiar with Nikola Tesla, a legendary figure. So going against the grain, Tesla was a genius shall we say. He invented the polyphase induction motor which is the workhorse electrical motor; Tesla Motors uses them in the cars. He is probably responsible along with Westinghouse for the AC power distribution and grid we have that works so well today. In his later life Tesla was making some outrageous claims however, that he was onto something big - wireless electricity for everyone that was going to be totally free. Tesla in his workshop:  By http://wellcomeimages.org/indexplus/obf_images/4c/6e/da5709a57832dbbb048ba4a17fe6.jpgGallery: http://wellcomeimages.org/indexplus/image/M0014782.htmlPhotographer: Dickenson V. Alley, CC BY 4.0, File:Nikola Tesla, with his equipment Wellcome M0014782.jpg After 1890 inventor Nikola Tesla experimented with transmitting power by inductive and capacitive coupling using spark-excited radio frequency resonant transformers, now called Tesla coils, which generated high AC voltages.] Early on he attempted to develop a wireless lighting system based on near-field inductive and capacitive coupling and conducted a series of public demonstrations where he lit Geissler tubes and even incandescent light bulbs from across a stage. He found he could increase the distance at which he could light a lamp by using a receiving LC circuit tuned to resonance with the transmitter's LC circuit. using resonant inductive coupling. Tesla failed to make a commercial product out of his findings but the resonant inductive coupling used is now a familiar technology used throughout electronics and is currently being widely applied to short-range wireless power systems. (left) Experiment in resonant inductive transfer by Tesla at Colorado Springs 1899. The coil is in resonance with Tesla's magnifying transmitter nearby, powering the light bulb at bottom. (right) Tesla's unsuccessful Wardenclyffe power station. Tesla went on to develop a wireless power distribution system that he hoped would be capable of transmit power long distance directly into homes and factories. Early on he seemed to borrow from the ideas of Mahlon Loomis, proposing a system composed of balloons to suspend transmitting and receiving electrodes in the air above 30,000 feet (9,100 m) in altitude, where he thought the pressure would allow him to send high voltages (millions of volts) long distances. To further study the conductive nature of low pressure air he set up a test facility at high altitude in Colorado Springs during 1899. Experiments he conducted there with a large coil operating in the megavolts range, as well as observations he made of the electronic noise of lightning strikes, led him to incorrectly conclude that he could use the entire globe of the Earth to conduct electrical energy. The theory included driving alternating current pulses into the Earth at its resonant frequency from a grounded Tesla coil working against an elevated capacitance to make the potential of the Earth oscillate. Tesla thought this would allowing alternating current to be received with a similar capacitive antenna tuned to resonance it at any point on Earth with very little power loss. His observations also led him to believe a high voltage used in a coil at an elevation of a few hundred feet would \"break the air stratum down\", eliminating the need for miles of cable hanging on balloons to create his atmospheric return circuit. Tesla would go on the next year to propose a \"World Wireless System\" that was to broadcast both information and power worldwide and attempted in 1901 to construct a large high-voltage wireless power station, now called the Wardenclyffe Tower, at Shoreham, New York. By 1904 investment dried up and the facility was never completed. http://www.teslasociety.com/tesla_tower.htm So what happened to these promises? He was not able to deliver a working system and whatever secret plans he had he took to the grave when he died a penniless man. ",
            "date": "Answered April 5, 2017",
            "views": "32",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roberto Chacon",
                    "user_href": "/profile/Roberto-Chacon"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/Aditya-1207"
                },
                {
                    "user_id": "Jeffrey Hudson",
                    "user_href": "/profile/Jeffrey-Hudson"
                },
                {
                    "user_id": "Charles Williamson",
                    "user_href": "/profile/Charles-Williamson-16"
                },
                {
                    "user_id": "Giovanni Sartori",
                    "user_href": "/profile/Giovanni-Sartori"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Silverman M.D.",
                "href": "/profile/Eric-Silverman-M-D"
            },
            "answer_text": "Simply put, the company made a decision that terminated the free use of charging the vehicle at their Superchargers, which was offered to Roadsters, Model S and Model X vehicles purchased in the past. This is mostly in anticipation of the Model 3 and the massive expected volume of cars to be produced. The prior models were premium vehicles at a premium price, and while they are still just that, Tesla decided to end that program. However owners are still alloted some amount of “free” supercharging, just not unlimited. However, the Superchargers are not intended for everyday charging, but mostly for long-distance driving along highways between cities. Save $1000 on the purchase of a new Tesla http://ts.la/eric2154 ",
            "date": "Answered February 24, 2017",
            "views": "866",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Edgar Elenes",
                    "user_href": "/profile/Edgar-Elenes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hagrinas Mivali",
                "href": "/profile/Hagrinas-Mivali"
            },
            "answer_text": "Tesla promised free supercharging for life to those customers who bought a Model S or Model X prior to some point in January, 2017. The promise never went away. Anybody who bought a car with that expectation still gets free supercharging. The only thing that has changed is that there is now a charge for parking in a supercharger space when not charging. Tesla never promised free parking. For new owners, Tesla is providing an annual allowance that’s equal to what the average owner uses, so even new customers will typically get free supercharging. It won’t be unlimited but Tesla never promised that it would be. ",
            "date": "Answered February 24, 2017",
            "views": "939",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bengt Björck",
                    "user_href": "/profile/Bengt-Björck"
                },
                {
                    "user_id": "Tod Daniels",
                    "user_href": "/profile/Tod-Daniels-1"
                },
                {
                    "user_id": "Darrell Holmquist",
                    "user_href": "/profile/Darrell-Holmquist"
                },
                {
                    "user_id": "Kairav Shah",
                    "user_href": "/profile/Kairav-Shah-4"
                },
                {
                    "user_id": "Omar Saleem",
                    "user_href": "/profile/Omar-Saleem-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Huber",
                "href": "/profile/Joe-Huber"
            },
            "answer_text": "Original question: What happened to Tesla's free electricity for the masses? This is an ambiguous (or even intentionally misleading) question, because most people today would think it refers to Tesla, the modern car company, when in fact it was Nikola Tesla in 1863 who wanted to provide free electricity to the world. NIKOLA TESLA’S PLAN TO PROVIDE FREE ENERGY TO THE WORLD WAS SCRAPPED BY BANKERS. Did Nikola Tesla invent free electricity? ",
            "date": "Answered May 12, 2018",
            "views": "540",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "CJ Lu Sing",
                    "user_href": "/profile/CJ-Lu-Sing"
                },
                {
                    "user_id": "Mike Sickinger",
                    "user_href": "/profile/Mike-Sickinger-1"
                },
                {
                    "user_id": "Chris Pankhurst",
                    "user_href": "/profile/Chris-Pankhurst-2"
                },
                {
                    "user_id": "Terry Proveau",
                    "user_href": "/profile/Terry-Proveau-1"
                },
                {
                    "user_id": "Paul Feist",
                    "user_href": "/profile/Paul-Feist-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Smurdly",
                "href": "/profile/Bob-Smurdly"
            },
            "answer_text": "Nikola Tesla made a lot of promises near the end of his life, that he was not able to develop. Some may have been wrong/impossible, others were possibly just undeveloped. He was also somewhat mentally unstable at the end, and also had a tendency to overpromise results to his financial backers to keep the money flowing. So it is pretty hard to unravel allthe reasons, but there is no free energy. Oddly, he overlooked the one source of free energy we do have: the sun. ",
            "date": "Answered April 5, 2017",
            "views": "959",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Lindsey",
                    "user_href": "/profile/Andrew-Lindsey-3"
                },
                {
                    "user_id": "Jeffrey Hudson",
                    "user_href": "/profile/Jeffrey-Hudson"
                },
                {
                    "user_id": "Jonathan Huston",
                    "user_href": "/profile/Jonathan-Huston-5"
                },
                {
                    "user_id": "Harshit Aneja",
                    "user_href": "/profile/Harshit-Aneja"
                },
                {
                    "user_id": "Kipling Edgecombe-Walker",
                    "user_href": "/profile/Kipling-Edgecombe-Walker"
                },
                {
                    "user_id": "Brandon Hit",
                    "user_href": "/profile/Brandon-Hit"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donald Knieriemen",
                "href": "/profile/Donald-Knieriemen"
            },
            "answer_text": "Early Teslas came with free lifetime supercharging. Later, there was a referral program that continued that offer. Even today, the referral program can give a new car owner 1,000 miles of free supercharging. Now that you can buy a model 3 for $35,000, the lifetime supercharging is not financially viable. ",
            "date": "Answered March 22, 2019",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Guertler",
                "href": "/profile/Joshua-Guertler"
            },
            "answer_text": "He never promised free energy, EVER. He did, however, promise means of creating more energy effectively (like nuclear as opposed to coal or gasoline). He actually denounced free energy and perpetual motion when he said that his alternating current generator “…was not a perpetual motion scheme.” ",
            "date": "Answered February 24, 2017",
            "views": "181",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jason Schlachter",
                "href": "/profile/Jason-Schlachter"
            },
            "answer_text": "They promised free supercharging. They are honoring those promises. Never have they ever implied otherwise. ",
            "date": "Answered February 24, 2017",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Darrell Holmquist",
                    "user_href": "/profile/Darrell-Holmquist"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Stone",
                "href": "/profile/Steven-Stone-32"
            },
            "answer_text": "nikoli tesla promised it ,a long time ago.if he had a million dollars ,he would have made a device ,that could have given everybody free energy…but he dident have the money and greedy people dident want him to build it..there was to much mony to be made off the masses. ",
            "date": "Answered February 24, 2017",
            "views": "38",
            "upvotes": "0"
        }
    ]
}