{
    "title": "What inspires you? - Quora",
    "tags": [
        "Inspiration"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sherlyn Dela Cruz",
                "href": "/profile/Sherlyn-Dela-Cruz"
            },
            "answer_text": "My Parents - who are always here to support me in all the things I choose to do with my life. they give me freedom, that inspires me the most, they are the most reason why I still chose to stay.Smile from Stranger - Talking to someone I don’t even know, helping less fortunate human beings in the street and sharing my point of view to someone who asks question, doing these things gives me happiness and contentment in life, its just a priceless feeling, I feel present in this world by contributing good things to my fellow human beings.Nature - Nature gives me life. I feel fresh, calm and relax. when I see a tree, a flower or a plant with a healthy body I breath and breath, I feel like I’m connecting to it, it gives me power, energy and strength to go on with life.Death - When I think about death I feel afraid, afraid that I may not be experiencing the things I enjoy the most in this world so I feel the need to enjoy my stay here and makes every moment count.Goals - One of my goals in life is to travel the world. so far I have already traveled to 5 countries alone, yes alone and I enjoyed it. looking forward visiting many more countries. nothing is impossible.Lifetime partner - In my 23 years of existence in this world I have had enough bad experiences that made me stop trusting men but I still believe that one day I would bump with my lifetime partner. I wake up every day with that idea pinned in my mind and smile, Life is beautiful.",
            "date": "Answered March 9, 2017",
            "views": "196",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aazam Idrisi",
                    "user_href": "/profile/Aazam-Idrisi"
                },
                {
                    "user_id": "Conner Kim",
                    "user_href": "/profile/Conner-Kim-5"
                },
                {
                    "user_id": "Hoshi Love",
                    "user_href": "/profile/Hoshi-Love-1"
                },
                {
                    "user_id": "FORUM LITERARIA",
                    "user_href": "/profile/FORUM-LITERARIA"
                },
                {
                    "user_id": "Pawar",
                    "user_href": "/profile/Pawar-7"
                },
                {
                    "user_id": "Sackey Richard",
                    "user_href": "/profile/Sackey-Richard-1"
                },
                {
                    "user_id": "Rendani Mbuvha",
                    "user_href": "/profile/Rendani-Mbuvha"
                },
                {
                    "user_id": "Himanshu Kushwaha",
                    "user_href": "/profile/Himanshu-Kushwaha-62"
                },
                {
                    "user_id": "Prasanna Hosangadi",
                    "user_href": "/profile/Prasanna-Hosangadi"
                },
                {
                    "user_id": "Shreya Khushi",
                    "user_href": "/profile/Shreya-Khushi-श्रेया-खुशी"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caroline Felix",
                "href": "/profile/Caroline-Felix-2"
            },
            "answer_text": "Today I was watching America's got talent and suddenly I came upon this video which really touched me. A deaf girl sings a song!! Can you imagine, you are singing a song and neither you can hear your own voice nor the musical instruments!! So it was about a girl named Mandy Harvey who lost her hearing when she was 18 years old. Its been 10 years since then. She has bought an interpreter on the show.  She has a connective tissue disorder, she got sick and her nerves deteriorated. She started singing since she was 4 , so she left music after she lost her hearing and then she found ways how to get back to singing with her muscle memory using visual tuners and trusting her pitch. She has removed the shoes off on the stage to feel the tempo and beat through the floor!! I was thunderstruck, singing by feeling vibrations!!  Simon asked her, what was she going to sing, she said “ I am gonna sing a song that i wrote called Try. After i lost my hearing i gave up, but i want to do more with my life,than just give up” The song literally made me cry. After the song , Simon: “Mandy, I don't think you're gonna need a translator for this” Golden buzzer!!! She's straight through to the live show!!  Basically, those who are deaf, even stop talking, coz how can you talk when you can't hear your own voice?? But this girl, who is deaf, she didn't give up on her dream. Those 10 years maybe of great pain to her, but at last all those sacrifices worth it. Yea, it will be painful, its gonna be hard. You will fail, you will make mistakes, so what?? Just get up and move on. If she doesn't give up on her dream, what's stopping you??  ~Cheers ",
            "date": "Updated September 5, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manthrathmika Thiyagharajhan",
                    "user_href": "/profile/Manthrathmika-Thiyagharajhan"
                }
            ]
        }
    ]
}