{
    "title": "What is it like to work for a consulting firm? - Quora",
    "tags": [
        "Working at Companies",
        "Jobs and Careers in Management Consulting ",
        "Jobs and Careers in Consulting",
        "What Is It Like to Work at X?",
        "Management Consulting",
        "Consulting",
        "Work",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Crisp",
                "href": "/profile/Dave-Crisp-2"
            },
            "answer_text": "It depends on the firm, but if you need to ask you probably aren't one of the very experienced experts who learned on a series of regular jobs and then went into consulting either for themselves or a mid or small sized firm. For new grads or beginners the work is mostly for large firms who need lots of extra 'hands' to do the grunt work on projects. Since consulting is always a 'feast or famine,' fear-inspiring business, firms grab every project they can and are usually over-worked (and need more hands to just do what they're told, the basic collection of information or processing of it). Even then they are all over-worked most of the time so juniors working many, many hours of overtime are typical, for relatively low pay, in hopes of getting a foothold in the business and getting promoted, eventually to become a 'partner' where they share in the profits... and that can take 10 to 20 years. I haven't worked for big firms but this is consistent with what I've heard from those I've coached who have. It can be exciting, but projects come and go, often quickly, and there is very little sense of accomplishment or seeing the results of your work. In my personal consulting it was typical for companies to hire me and then do almost nothing of what I suggested. They'd want a report that I'd spend a couple of months on and do next to nothing with it. That can be frustrating, but it can be a good job for people who don't want to get stuck in 'office politics' or who get bored easily and want to move on or who are not happy with long term relations with people. ",
            "date": "Answered November 11, 2015",
            "views": "88",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jan Chen",
                    "user_href": "/profile/Jan-Chen-9"
                },
                {
                    "user_id": "Jay Ng",
                    "user_href": "/profile/Jay-Ng-30"
                },
                {
                    "user_id": "Johan Daniel Alvarez Sanchez",
                    "user_href": "/profile/Johan-Daniel-Alvarez-Sanchez"
                },
                {
                    "user_id": "Lucian-Robert Macabinski",
                    "user_href": "/profile/Lucian-Robert-Macabinski"
                },
                {
                    "user_id": "Mohamed Ezzat",
                    "user_href": "/profile/Mohamed-Ezzat-61"
                },
                {
                    "user_id": "Thanh Tùng Hoàng",
                    "user_href": "/profile/Thanh-Tùng-Hoàng"
                },
                {
                    "user_id": "King Crawford",
                    "user_href": "/profile/King-Crawford"
                },
                {
                    "user_id": "Derreck Mansheim",
                    "user_href": "/profile/Derreck-Mansheim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael E. Cohen",
                "href": "/profile/Michael-E-Cohen"
            },
            "answer_text": "This is a pretty broad question. I will answer it by addressing the following points: (1) typical management consulting work; (2) things in consulting I liked; and (3) things in consulting I did not like. 1. Typical Management Consulting Work Management consulting is quite diverse with respect to the types of functional areas and domains (industries) in which consulting is provided. My own consulting practice areas were: Functional areas- Management reviews, process improvement, management systems development, MIS design, performance measurement, project and contract management, and facilitation services.Special service area- Performance-based contracting.Domains- Although I worked in all client sectors, my specialty was the U.S. Federal Government, especially in health care and environmental organizations.2. Things in Consulting I Liked Provided important advice and help to major organizations to improve their performance, efficiency and effectiveness.Provided a lot of freedom to design and carry out my work.Camaraderie with peers.Excitement and satisfaction from winning major new engagements.Pride and satisfaction from very good- excellent feedback from clients, including feedback on my staff members.Pride and satisfaction from producing important products and results for major client organizations.Prestige of the position, firm and profession.Opportunity to work for various size consulting firms, including my own business.Compensation- it enables you to meet your goals.3. Things in Consulting I Did Not Like Corporate politics and bureaucracy.Competition between partners, including compartmentalization of practice areas.Stress from constant pressure to sell and inherent risk of the business.Substantial time requirements, including competition with family and other personal matters.Travel was not really a concern in my tenure at Booz Allen and most other consulting firms because most of my clients were headquartered in the Washington. DC area and most travel was for fact finding. Travel averaged about 4-5 days per month, which was manageable. During my tenure with various consulting firms, I averaged about 60 hours/week. When I ran my own consulting firm, my time dropped to 50 hours/week or less. Since I had a real passion for consulting, the time commitment was not a major issue. ",
            "date": "Answered April 10, 2019",
            "views": "33",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saloni Bhansali",
                    "user_href": "/profile/Saloni-Bhansali-2"
                },
                {
                    "user_id": "Paritosh Dwivedi",
                    "user_href": "/profile/Paritosh-Dwivedi-4"
                },
                {
                    "user_id": "Lucian-Robert Macabinski",
                    "user_href": "/profile/Lucian-Robert-Macabinski"
                }
            ]
        }
    ]
}