{
    "title": "What are examples of the uses of a library? - Quora",
    "tags": [
        "Online Library",
        "Public Libraries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Sennoga",
                "href": "/profile/Richard-Sennoga"
            },
            "answer_text": "The answers so far provided are good. An addition here is that libraries also provide room for self-study in a quiet, silent environment that allows the reader to concentrate and focus on just study. The traditional roles of the library include collection development— which involves sourcing, identifying, purchasing or acquiring and processing different kinds of information materials. The materials can be books (monograms), periodicals, photographs, reference tools (dictionaries, almanacs, thesauruses, fact books, etc) — and in different forms such as paper, video, sound, and much more. Processing of these information materials involves receiving, securing them (affixing the library stamp or seal somewhere on a secret page), accessioning by entering them in the accessions register, classifying them based on some form of standard classification system (such as the Dewey Decimal Classification system or DDC) cataloging them (using such standards as the Anglo-American Cataloguing Rules or AACR), and creating the appropriate bibliographic record about that information material. And then shelving the books based on their Call Numbers (a combination of the book’s Class Number and the first three letters of the author’s surname, or as appropriate). A lot of processing goes on — with the primary objective of easing the process of information search, access and retrieval for both the library staff and the users. The Internet age has transformed library operations over the last 10–15 years. Many libraries no longer hold physical paper catalogue cards as a means of searching for information materials. They're increasingly using Online Public Access Catalogues or OPAC to address this issue. Another important role of libraries is protect, preserve and conserve knowledge. While many library users understand the obvious best practices in use of information resources, there are a whole lot of difficult library patrons who sometimes seem only to care about themselves. Such are the kind of users who tear out pages from books, steak books -given the opportunity and deface materials (especially if no rules exist against eating or drinking from the library). For this reason, the library implements such routines as safe custody of users’ bags as they enter the library, and monitoring users for compliance with library rules and regulations. Lastly, but not the least, libraries manage member information, upon which information they circulate materials to their patrons and monitor their return, based on thebstilulated due dates. Generally speaking, even with the Internet as a really important alternative source of handy information, libraries remain very important and integral parts of our lives. This is because they support research, reference, current awareness, reading for leisure, provide expert support with access to information. It's from libraries that we have the privilege to get access to rare, out-of-print book collections that we wouldn't find on the Internet. And above all—-they provide the reasing space and reading environment that we wouldn't get at home, at the park or in the office. ",
            "date": "Answered July 23, 2016",
            "views": "58",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ignacio Cabano",
                    "user_href": "/profile/Ignacio-Cabano"
                },
                {
                    "user_id": "Dindi Robinson",
                    "user_href": "/profile/Dindi-Robinson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manmeet Singh Arora",
                "href": "/profile/Manmeet-Singh-Arora"
            },
            "answer_text": "The first use of library is to gather information on a specfic subject selected for research, the subject can have different classification and so requires a trained librarian to make an expert search by either going online to search database or library catalogue to gain insight into the resources available in the library or he can consult librarians of different libraries for intra-loan of resources available with them. The library can be used by users of all ages and performs functions like cataloguing,classification,circulation system,reference system,serials control and email,e-resources and etc. ",
            "date": "Answered July 21, 2016",
            "views": "103",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shri Ram Gupta",
                    "user_href": "/profile/Shri-Ram-Gupta-3"
                },
                {
                    "user_id": "Tawanda Halumbwe",
                    "user_href": "/profile/Tawanda-Halumbwe"
                },
                {
                    "user_id": "Rabson Banda",
                    "user_href": "/profile/Rabson-Banda-3"
                },
                {
                    "user_id": "Ignacio Cabano",
                    "user_href": "/profile/Ignacio-Cabano"
                },
                {
                    "user_id": "Dindi Robinson",
                    "user_href": "/profile/Dindi-Robinson"
                }
            ]
        }
    ]
}