{
    "title": "What should someone try if they can no longer wake up to their alarm even if they've tried multiple sounds? - Quora",
    "tags": [
        "Alarm Clocks",
        "Alarm Systems",
        "Mornings",
        "Waking Up",
        "Sleep Habits",
        "Sleep"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christie J. Fox",
                "href": "/profile/Christie-J-Fox"
            },
            "answer_text": "When we were kids we had our own wind-up clock that sounded as loud as a fire alarm and to quiet it somewhat we used to put it in a closed drawer. so maybe you need one of the old style wind-up clocks. On Saturdays my mom screaming at the top of her lungs for us to get up to do our chores was another really loud shock to our systems. Maybe you need someone to do that for you. So are you having a hearing problem (get your hearing checked), or do you stay out too late or embibe too late. You should get 7–8 hours of good sleep. If it’s depression then try some vitamins/minerals. While I could mention the old pagers used to shake in your pocket, but maybe that won’t work. ",
            "date": "Answered November 28, 2019",
            "views": "95",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ujjval Kapoor",
                    "user_href": "/profile/Ujjval-Kapoor"
                },
                {
                    "user_id": "Kathy Baran",
                    "user_href": "/profile/Kathy-Baran-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Marcy",
                "href": "/profile/Mary-Marcy"
            },
            "answer_text": "This is a hard one for me to answer as I’m one of those people who seldom use an alarm! I am blessed to have a mental clock! I generally can wake on time by looking at the clock prior to going to sleep, mentally telling myself when I need to get up. I would suggest if you need to work on your sleep healthy habits. What I mean by that is setting up healthy habits, going to bed at the same time, getting up at the same time everyday. Sorry no days off! Do this everyday. Don’t drink caffeine or alcohol several hours before bed. Cut screen time before bed, don’t eat too much .. you know, all the things to help you rest! I am a strong believer in rituals. I guess loud alarms if all else fails! ",
            "date": "Answered December 4, 2019",
            "views": "99",
            "upvotes": " Answer requested by Audrey Simons",
            "upvoters": [
                {
                    "user_id": "Teresa Lynn Faria",
                    "user_href": "/profile/Teresa-Lynn-Faria"
                },
                {
                    "user_id": "Christian Rockström",
                    "user_href": "/profile/Christian-Rockström"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Boggust",
                "href": "/profile/Colin-Boggust"
            },
            "answer_text": "Just set the inside of your head. Basic shit really leave at least some natural light coming through the curtains. Or if you’re stuck inside right above a night club pounding out massive bass beats just get used to the Sounds around you. The D jay laying down some loving music with a top note of bottles being smashed come on cunt get some might mean 1 hour 32 minutes before you have to get up. Bird song is really irregular the flocks just turn up at random times and savage the local insects leave the curtains open and set your head that you have to be standing with your trousers, skirt or kilt on at a certain time. Probably your big problem is the snooze button. Never use it ! Promise you should have set it all up before you went to bed. Four hours sleep or at least lying down is doable just get up and feet on the floor no second thoughts just do it ",
            "date": "Answered November 29, 2019",
            "views": "133",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "M. A. Malik",
                "href": "/profile/M-A-Malik"
            },
            "answer_text": "peace be on you.we can wake easily every 90 minutes cycle i.e. 90 minutes after sleep, or 180 minutes or 270 minutes or so, make alarm in such multiples after 540 minutes (6 hours or sleep) one can wake up.ask a long-distance relative to call you over the phone.pay someone to knock on door. (careful)buy various small alarm clocks with various alarm time settings 10 minutes apart.sleep early to have needed sleep.do not have a heavy oily spicy meal in the night.no eating 3 hours before sleep.no coffee after 6 p.m.hydrate well all day.tell your self: ‘O (ur name) wake me up at (time)’",
            "date": "Answered December 1, 2019",
            "views": "305",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Larkin",
                    "user_href": "/profile/John-Larkin-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaelynn Ullery",
                "href": "/profile/Kaelynn-Ullery"
            },
            "answer_text": "I’ve had the same problem before and one thing that worked for me was going to bed early when I had to wake up at a certain time. If you have a dog this method might work for you, just put your dog on the bed to sleep with you and keep the door closed, dogs usually have to go to the bathroom depending on their age. Lets say that your dog is five years old (in human years) then he/she will be able to wait to go potty for five hours. This stays the same as they grow up. So if you have your door closed your dog will wake you up to go to the bathroom and you let him/her outside and start your day. ",
            "date": "Answered December 9, 2019",
            "views": "100",
            "upvotes": " Answer requested by Audrey Simons",
            "upvoters": [
                {
                    "user_id": "Mark H. Spud Friedman",
                    "user_href": "/profile/Mark-H-Spud-Friedman"
                },
                {
                    "user_id": "Audrey Simons",
                    "user_href": "/profile/Audrey-Simons-5"
                },
                {
                    "user_id": "Kathy Baran",
                    "user_href": "/profile/Kathy-Baran-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Twort",
                "href": "/profile/Keith-Twort"
            },
            "answer_text": "First thing is put it out of reach so you have to actually get out of bed to shut it up. Then get an alarm that doesn’t stop, so you don’t snuggle down knowing it will stop in just a minute. Make sure it is LOUD!! and ANNOYING!!!. A lot of alarms can be made apparently louder by putting them in a cavity like a pint glass. I used to use a time switch that switches a slightly modified radio on tuned to an obnoxious channel! ",
            "date": "Answered December 1, 2019",
            "views": "105",
            "upvotes": " Answer requested by Audrey Simons",
            "upvoters": [
                {
                    "user_id": "Saksham Khandelwal",
                    "user_href": "/profile/Saksham-Khandelwal-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Larkin",
                "href": "/profile/John-Larkin-59"
            },
            "answer_text": "I used to have 3 bunk mates in one room in the army. Everyone worked different shifts and had different alarms. So getting up was difficult. The solution was biological. Before sleep drink about a quart of water (not alcohol) your nody will process it and while you are in the bathroom you can wake up. Or if you live alone set your alarm in different rooms close enough to hear and far enough to walk to. Or change jobs because eventually you will be fired anyway. ",
            "date": "Answered December 15, 2019",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Avkrishna Rao",
                "href": "/profile/Avkrishna-Rao"
            },
            "answer_text": "Sometimes I had to go to railway station at about two in the early morning. Normally conscience keeps me awake and I am confident that I can get up y the time. But if I have doubt that I may miss the train I keep myself awake without going o sleep spending time with TV or internet. In your case if it’s a daily routine you need someone who comes and wakes you up in time. Try o go to bed early or o to bed observing fast; you may get up with a call from belly asking for food. BEST thing is to develop will power and make it take over! DON’T AK ME HOW TO DEVELOP WILL POWER! ",
            "date": "Answered December 15, 2019",
            "views": "46",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Audrey Simons",
                    "user_href": "/profile/Audrey-Simons-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Andrews",
                "href": "/profile/Mike-Andrews-58"
            },
            "answer_text": "I assume you mean the ‘sounds’ from a smartphone. Perhaps they are too gentle and twinkly? Get hold of a real clockwork, wind-up alarm clock - from a second-hand (thrift) shop if you have to. A real old Westclox will wake up the whole house. Try it out first! ",
            "date": "Answered November 28, 2019",
            "views": "39",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Eric Krausz",
                "href": "/profile/Eric-Krausz-2"
            },
            "answer_text": "That person who needs multiple alarms is clearly sleep deprived. The obvious solution is to get to bed earlier and to have a regular sleep schedule. There is no logical away to get around this solution. ",
            "date": "Answered December 1, 2019",
            "views": "58",
            "upvotes": " Answer requested by Audrey Simons"
        },
        {
            "author_info": {
                "name": "Kawaii Kiwi",
                "href": "/profile/Kawaii-Kiwi-15"
            },
            "answer_text": "Go for something bigger. Wake them up by popping a balloon, pour water on them, firecrackers etc. Set up multiple alarms that look like these ⏰ Hide them and set it so it ring an hour before they get up. You snooze you lose ",
            "date": "Answered January 16, 2020",
            "views": "14",
            "upvotes": " Answer requested by Audrey Simons"
        },
        {
            "author_info": {
                "name": "Ofri Kor",
                "href": "/profile/Ofri-Kor"
            },
            "answer_text": "Put the alarm far away from your bed, so in the morning you will have to get up in order to stop it. ",
            "date": "Answered December 1, 2019",
            "views": "34",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Shane Stoddard",
                "href": "/profile/Shane-Stoddard-4"
            },
            "answer_text": "Try lights that come on bright!!! ",
            "date": "Answered November 28, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Doug Stevenson",
                "href": "/profile/Doug-Stevenson-14"
            },
            "answer_text": "The ultimate pain is a dripping tap into a stainless steel sink. Repeat for two minutes and then flush a toilet as the final sound bite. Repeat and your bladder shall give you all of the energy possible to wake up and GO. he went thatta way <> ",
            "date": "Answered December 16, 2019",
            "views": "11",
            "upvotes": " Answer requested by Audrey Simons"
        },
        {
            "author_info": {
                "name": "Achin Ty",
                "href": "/profile/Achin-Ty"
            },
            "answer_text": "Before sleeping while you are in the process of falling asleep, keep a strong focus on the fact that you have to get up at the desired time the next day and keep repeating it to yourself till you unconsciously fall asleep. Most of the cases you will wake up from your sleep right around the desired time. ",
            "date": "Answered December 4, 2019",
            "views": "44",
            "upvotes": " Answer requested by Audrey Simons"
        },
        {
            "author_info": {
                "name": "Dean Strand",
                "href": "/profile/Dean-Strand-1"
            },
            "answer_text": "They have bed shakers for deaf / hard of hearing.. I used to live next door to someone who had one. It would wake ME from a sound sleep, from next door! If one of those wouldn’t wake you up, I don’t do know what would. ",
            "date": "Answered December 4, 2019",
            "views": "4",
            "upvotes": " Answer requested by Audrey Simons"
        }
    ]
}