{
    "title": "What is the best site to learn how to code? - Quora",
    "tags": [
        "Learning to Program Website Recommendations",
        "Computer Programming Website Recommendations",
        "Best of X",
        "Website Recommendations",
        "Learning to Program",
        "Programming Languages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Enbar",
                "href": "/profile/Adam-Enbar"
            },
            "answer_text": "Before asking that question, you should first answer this question: “What do I want to get out of learning to code?” Some people want to familiarize themselves with coding, which is definitely worthwhile, while others want to start new careers in tech. If by “best” you mean “best at helping you get acquainted with coding,” then you have countless options that vary greatly in quality. If you’re looking for a “quick” certification, I’d suggest Udemy. If you’re looking for a free course that’ll teach you the basics, then I’d of course suggest Flatiron School’s Coding Bootcamp Prep. It provides the main learning philosophies of our immersive courses and is designed to help you understand if coding comes natural or is interesting to you. I might be biased, but in my opinion it’s the single best tool for beginners. But if by “best” you mean “best at helping you launch a coding career,” then the answer to your question isn’t as simple. If you’re looking for a bootcamp that will take you from novice all the way to professional software developer, then you owe it to yourself to dig deeper into what different courses offer. Below I map out the three main questions you should ask yourself, and why they’re so important: Will the skills I learn help me launch a new career?Will this bootcamp help me in my job search?Is this bootcamp worth the money?Does this bootcamp offer the skills needed by developers today? There are a lot of bootcamps that teach one language really, really, really well. There are others that specialize in two languages and teach them pretty well. There are also some that cover various languages, but focus more on development processes and how products are built, managed, and scaled. The best bootcamps, though, teach you all of these skills — both “hard” skills and “soft” skills. They teach you the nitty-gritty of coding languages as well as the teamwork-oriented skills like product management and communication. Graduates from today’s best bootcamps are well-rounded developers and are well equipped to continue to evolve as their career progresses. There are a few bootcamps that do this, but I can’t speak for every one, so take, for example, our philosophy at Flatiron School. We pride ourselves in graduates that, first, land a tech job upon graduation, and are also well equipped to evolve as their career progresses. This requires those aforementioned soft and hard skills. Throughout the course, we focus on teaching students all the technical skills they need: JavaScript, Ruby, HTML5, Rails, and more. We also focus on teaching students how products are built from beginning to end and how multiple teams collaborate throughout the process. Perhaps most importantly, we zoom in on giving students the tools they need to teach themselves. Understanding the ins-and-outs of a product means having the ability to find new, creative ways to solve problems. In our experience, we’ve found all of these skills are critical for graduates to land jobs and start successful careers. You can see the entire curriculum and instruction modules here. Will this bootcamp help me in my job search? If your goal is to start a coding career, then that should be the goal of the bootcamp you choose. Job searches are intimidating, especially when it’s in a new field where you have no prior network or contacts. In fact, when I talk to prospective students, the top reason they shy away from a career switch is their fear of the job search. That’s why it’s imperative bootcamps help their graduates navigate that process. Similar to above, there are many bootcamps that teach JavaScript really well, or Ruby really well — well enough to make anyone an expert — but don’t prepare their students with skills necessary to prove just how good they are. At Flatiron School (and some other bootcamps, to be fair), every individual graduate is paired with a Career Coach to refine their résumé, perform structured employer outreach, and practice to perfect their interview skills. They also assist with employer outreach. This is all so students are well prepared to nail their interview process when the time comes to sit down with a potential employer. You can get a good grasp of a bootcamp’s Career Services by the Jobs Outcomes numbers. This can be called anything from Jobs Reports, Outcomes Reports, Jobs Outcomes Reports, or something similar. They’re all purportedly trying to convey the same thing: how many graduates get jobs, what their starting salaries are, and how long it takes them to get offers. Do your research diligently here, because different reports represent different things. Some might represent a sample of ten students, some might represent 1,000. Be sure that the reports you’re viewing are transparent. They should clearly show how big their sample sizes are, what timeframes they represent, and what types of jobs graduates land. They should also be verified by a third party. For example, you can view Flatiron School’s Jobs Reports here. You’ll see what cohorts our reports represent clearly and honestly. You should feel confident when joining a bootcamp, so do yourself the favor of seeking out these reports and understanding exactly what their numbers mean. Is this bootcamp worth the money? The answer here is simple: if the bootcamp teaches you to code and helps you launch a tech career, then I’d say it was definitely worth it. After all, then you’d have achieved your only goal. Lots of bootcamps talk about how great they are, but you should expect them to put their money where their mouth is. Bootcamp tuitions certainly aren’t cheap, after all. The best coding bootcamp offer money-back guarantees. Or, in Flatiron School’s case, a Tuition-Back Guarantee (see those details here.) If a bootcamp says it’ll help you learn to code and land a job, then it should return your tuition if it doesn’t live up to that promise, assuming you give your education a good-hearted effort. This should help you focus more on coding and less on your finances. I’d even go as far as to say that if a bootcamp doesn’t offer a guarantee, then they aren’t worth your time. So, if you’re looking to start a new career, you have a few options — and Flatiron School is certainly one of them. Great job reaching out here on Quora to do your research, and I hope you the best of luck in your (potentially) future career as a coder. ",
            "date": "Answered May 10, 2019",
            "views": "35",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Avi Flombaum",
                    "user_href": "/profile/Avi-Flombaum"
                },
                {
                    "user_id": "Shirley Kim",
                    "user_href": "/profile/Shirley-Kim-20"
                },
                {
                    "user_id": "Amiratul Aifa",
                    "user_href": "/profile/Amiratul-Aifa"
                },
                {
                    "user_id": "Sudarshan Srinivasan",
                    "user_href": "/profile/Sudarshan-Srinivasan-11"
                },
                {
                    "user_id": "Nicholas Gallinelli",
                    "user_href": "/profile/Nicholas-Gallinelli-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arjun Narayanan",
                "href": "/profile/Arjun-Narayanan-13"
            },
            "answer_text": "There’s no “one-size-fits-all” answer for this. Firstly, different websites will cover different topics at varying levels. Also, “learning to code” is very broad - it’s like saying “I want to be an athlete”. But being a basketball player requires different skills from being a gymnast. So when you say you want to “learn to code”, try focusing a little bit. Data Science is much different from software development, which is very different to web development. You can be a graphic design wizard and be a master of HTML/CSS, but still be terrible at programming in C/C++. And that’s okay! In fact, there are people who make good money solely from their expertise in CSS. In any case, I do think everybody should have some initial exposure to basic programming - deciding what direction you want to go in can come later. The first place I recommend everyone start with is Codecademy. If you don’t have any prior experience with programming, start with either Python, JavaScript, or Ruby. Once you have finished those courses and have a basic understanding of syntax (which is all you will get from Codecademy), you can progress to other courses, and there are plenty online. Some good ones include: FreeCodeCamp - this is an excellent place to learn full-stack JavaScript web development at your pace, from the comfort of your own home. The curriculum is pretty thorough and there is a thriving community of fellow learners to support you along the way. Plus, it is completely free and open-source!EdX has a lot of good courses now, including the famous CS50 Course Info | edX from Harvard, and MIT’s 6.00.1x Course Info | edX. Microsoft has a Data Science curriculum, which I am working through now, and although it tends to be more biased towards the use of Microsoft technologies, it is nonetheless a decent introduction to Data Science.Dataquest and DataCamp feature well-thought out, hands-on courses for teaching skills in Data Science and Analytics.Coursera has a number of good courses, and I would recommend three specializations in particular: Python for Everybody | Coursera, Fundamentals of Computing | Coursera, and Data Science | Coursera. Be wary of the last one; it is not that well taught, and R is a tricky language and not recommended for beginners. If you want to do Data Science and don’t have much of a programming background, I would recommend sticking with Python.",
            "date": "Answered September 1, 2016",
            "views": "85",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elsen Roño",
                    "user_href": "/profile/Elsen-Roño"
                },
                {
                    "user_id": "Tiffany Keys",
                    "user_href": "/profile/Tiffany-Keys-3"
                },
                {
                    "user_id": "Spyro Giannitsanos",
                    "user_href": "/profile/Spyro-Giannitsanos"
                },
                {
                    "user_id": "Che Tonix",
                    "user_href": "/profile/Che-Tonix"
                },
                {
                    "user_id": "Will Chen",
                    "user_href": "/profile/Will-Chen-41"
                },
                {
                    "user_id": "John",
                    "user_href": "/profile/John-1052"
                },
                {
                    "user_id": "Madhav",
                    "user_href": "/profile/Madhav-48"
                }
            ]
        }
    ]
}