{
    "title": "What are the collaborative tools used in knowledge sharing? - Quora",
    "tags": [
        "Knowledge Sharing",
        "Collaboration Tools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sabannah Saba",
                "href": "/profile/Sabannah-Saba"
            },
            "answer_text": "With Brief is a collaboration tool, collaboration across teams, departments, and locations occurs seamlessly and in real time. Customize anything within Brief to make it your own, from branding and imagery to code and integrations.  There's no excuse for communication gaps, lost files, and poorly managed projects when working securely in the cloud, as the lines of communication are always open. Use our software to tackle multiple challenges, like poor productivity or slow customer service response times, while encouraging each member of your team to take an active role as a vested stakeholder in your business. Discover how Brief's project management software prepares your business for the future. Benefits Distribute announcements, updates, and accolades instantlyPublish virtual information hubs accessible by everyone or a select groupPromote healthy discussion in moderated forums while resolving concernsEmpower employees to help and support others through file, image, and video sharingStreamline and customize the flow of communication in a single platformExpedite product and service delivery via improved work flow managementFeatures Overview Use employee profiles to highlight skills, provide contact information, or instantly message others in your organization. A social feature that encourages unity among teams, profiles are both practical and conversation-sparking. Make friends, compare notes, and collaborate with one click.Give your employees knowledge sharing tools that adjust to personal preferences. Though some may prefer reviewing a Wiki page, others are more engaged with new information when presented in visual form. Brief provides a way to organize knowledge to appeal to different viewers.Prevent time-wasting tasks, like writing emails, searching for files, and making trips to the printer when using Brief's dynamic file manager. Control who views, changes, or uploads files, or choose to make certain files publicly available depending on your business needs. Track revision cycles, view comments, and preview forms in seconds.Develop a community of brand or cause ambassadors using Brief's knowledge sharing tools. Whether public or private, communities are place for like-minded users to gather, collaborate, and effect change. Featuring moderation tools to keep conversations goal-focused, our platform simplifies communication in various virtual environments.Publish original videos, curated videos, or webinars to quickly share information with employees or customers. A fun medium through which to welcome new employees, help existing employees refine their skills, or offer in-depth training programs, video grabs attention faster and holds it longer than text. Categorize uploaded content, review comments, and gain ratings as you go.Find anything within Brief, from documents and images to conversations and people, using Smart Search. Because all published content is indexed, locating a related conversation, wall post, or file is a lightning fast process. Don't waste another minute searching for important information when Brief does the hard work for you.Good luck. ",
            "date": "Answered October 19, 2019",
            "views": "114",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stéphane Brodu",
                "href": "/profile/Stéphane-Brodu"
            },
            "answer_text": "First, I would like to share a personal point of view about collaboration that I have been able to verify many times: Tools or processes do not make a team collaborative. Attitude does. With or without collaborative tools.However, beyond this easy and provocative response, knowledge sharing tools depends on what sort of information you want to share, what you mean by “sharing” and how is your team geographically scattered. What do you want to share ? Text document, video or images, mind map, spreadsheet, URL, Power Point or Prezi style presention, map, etc ? Beyond knowledge content, there is knowledge content manager, communication tools and collaborative project / tasks management tools.What do you mean by sharing ? From simply allowing one person to be able to read files of another person to being able to simultaneously edit a common shared file, whatever content type it is, and even while chatting and video-conferencing ?Are you able to put people in the same room IRL ? Are you spreaded all around the world ? Does everyone has a good Internet connection ?After years of working with several tools and teams, my unique response is still… Google tools. I use them mainly when I need my team to co-create or think of a specific solution, and when they are scattered around the world : Everyone has access to it.It’s free (at a certain point)You can do everything you need with Google doc tools using canevas, apps, etc..Everyone can understand how it works in a few minutes.It’s reliable.Works on Apple OS, PC, Chrome notebook even on Android smartphones !File sharing is very easy to understand and to set up.Backup on local hard drives is automaticSome task management tools are really good at initiating collaboration as well as following tasks. My prefered one is still JIRA Software (Issue & Project Tracking for Software Teams) To me, when the team can be assembled, the best collaborative sharing tools are still big sheets on a wall and pencils or whiteboard / cork board. Hope this helps SB ",
            "date": "Answered December 5, 2016",
            "views": "11",
            "upvotes": "0"
        }
    ]
}