{
    "title": "What are the features of the Fitbit Ionic smartwatch? - Quora",
    "tags": [
        "Fitbit"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Dinglas",
                "href": "/profile/Kevin-Dinglas"
            },
            "answer_text": "Fitbit's first smartwatch is a fitness watch at its heart. If you are looking for some wristwatches to use during a Fitbit Ionic exercise, just don't expect it to be a similar experience to other smartwatches. The bezels are relatively thick compared to the Fitbit Ionic. This is one of the major criticisms of our design and we think there is a lot of wasting space underneath and above the screen. Instead Fitbit may include a much larger and more useful display. Fitbit Ionic Fitbit is one of the best smartwatches. It has many features such as it incorporates various modes such as weight, running and swimming which are helpful for the user to track all these activities and many useful features are included. ",
            "date": "Answered October 2, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hannah Gerstaecker",
                "href": "/profile/Hannah-Gerstaecker"
            },
            "answer_text": "The fitbit ionic smartwatch has all the activity tracking features along with the smartwatch features like builtin music player, NFC payments and attractive digital screen. Fitbit Ionic is packed with infrared and optical sensors along with an accelerometer, gyroscope, ambient light sensor altimeter, and heart rate monitor. It is equipped with NFC wireless tech with a support from American Express, MasterCard, and Visa card.  The Ionic smartwatch is now actually a thing and we are really very excited about its launch to see how it works. Ionic mobile app development technology is invading in all the major platforms and soon going to be the top framework for hybrid mobile app development. ",
            "date": "Answered August 30, 2017",
            "views": "317",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jimmie Williams",
                    "user_href": "/profile/Jimmie-Williams-10"
                },
                {
                    "user_id": "Anchal Malik",
                    "user_href": "/profile/Anchal-Malik-8"
                },
                {
                    "user_id": "Paresh Sagar",
                    "user_href": "/profile/Paresh-Sagar-5"
                }
            ]
        }
    ]
}