{
    "title": "What is the history behind definitive technology speakers? - Quora",
    "tags": [
        "Speakers (public speaking)",
        "History of Technology",
        "Loudspeakers",
        "Audio",
        "Invention and Inventions",
        "Sound",
        "Audio Equipment",
        "World History",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Piyush Piparotar",
                "href": "/profile/Piyush-Piparotar-1"
            },
            "answer_text": "The company was founded in Owings Mills, Maryland in 1990 by former Polk Audio founder Sandy Gross, along with Don Givogue and Ed Blaise. Gross served as the company's first CEO and President. The company's first products were monolithic bipolar speaker towers. In 2004, the company was acquired by Directed Electronics. Directed Electronics was founded by Congressman Darrel Issa and specialized n car alarms and radar detectors. Sandy Gross became President of the company's newly formed audio division. Directed Electronics also bought Polk Audio, which Sandy Gross co-founded also. In 2010, after Sandy Gross had left the company, he introduced a third company called Golden Ear Technology, which is completely separate from Sound United and DEI. In 2008, Directed Electronics restructured itself as DEI Holdings. In April 2013, the company combined Polk, Definitive Technology and the Boom Movement brands into a new division called Sound United. In April 2015, the company released its W7 speaker with support for the Play-Fi wireless protocol for multi-room audio, produced by audio company DTS, Inc., now owned by holding company Xperi. In May, Sound United parent announced a deal with Austrian electronics company Aqipa to distribute Definitive Technology and other Sound United brands in Germany, Austria, and Switzerland ",
            "date": "Answered September 24, 2019",
            "views": "59",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}