{
    "title": "What's wrong with the US healthcare system? - Quora",
    "tags": [
        "Inefficiencies of Healthcare in the United State of America",
        "Healthcare and Medicine in the United States of America",
        "Politics of the United States of America",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Painter",
                "href": "/profile/Jon-Painter"
            },
            "answer_text": "Roughly 50% of the US electorate thinks that healthcare can operate as a some sort of free market exercise. There are a variety of medical problems for which the medical options are binary - treatment or death. These treatments can range from what is today considered to be routine to the cutting edge. No matter how routine the procedure, if the patient doesn’t receive the procedure, the patient dies. How does the market price a routine procedure that a patient needs to continue living? You can look at actuarial tables and insurance rational and say a teenager who receives a laparoscopy has $2 million dollars of life ahead of him. So that’s a starting value. Most people can’t pay that much, so the answer to what the market can bear is, “everything your family has up to 2 million dollars, or your kid dies.” “Your money or your life” sounds more like a highway robbery than a free market exercise to me. So you need a large organization that is 3rd party, that can represent both patients and doctors in a fair fashion without a profit motive. It’s imperfect, but the best creation to do that is a government. But half of Americans are invested in the idea that government can’t do that (despite examples to the contrary) and the representatives they chose are invested in proving the ideology that government can’t do that. So in America, government can’t do that. And we have organizations with profit as a primary motive in charge of things. So routine procedures can bankrupt the uninsured, and more exotic procedures... well, the VP and GM of the Washington Nationals has a gofundme account set up to help defray the costs of of a CAR-T cell procedure that has been recommended, but isn’t covered. Guess those of us that haven’t risen above VP of a sports organization are just screwed. Click here to support Doug Harris CAR-T Treatment organized by Team Doug Harris “Your money or your life!” ",
            "date": "Answered August 6, 2018",
            "views": "13",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Todd Singleton",
                    "user_href": "/profile/Todd-Singleton-1"
                },
                {
                    "user_id": "Álvaro Serrano Arias",
                    "user_href": "/profile/Álvaro-Serrano-Arias"
                },
                {
                    "user_id": "Jay Granville",
                    "user_href": "/profile/Jay-Granville"
                },
                {
                    "user_id": "Jennifer",
                    "user_href": "/profile/Jennifer-3163"
                },
                {
                    "user_id": "Sheryl Jagneaux",
                    "user_href": "/profile/Sheryl-Jagneaux"
                },
                {
                    "user_id": "Amanda Faith",
                    "user_href": "/profile/Amanda-Faith-19"
                },
                {
                    "user_id": "Steve Woodbridge",
                    "user_href": "/profile/Steve-Woodbridge-1"
                },
                {
                    "user_id": "Stefan Knapik",
                    "user_href": "/profile/Stefan-Knapik-2"
                },
                {
                    "user_id": "Dave Gorst",
                    "user_href": "/profile/Dave-Gorst"
                },
                {
                    "user_id": "Karl Gill",
                    "user_href": "/profile/Karl-Gill-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew M. Baer",
                "href": "/profile/Andrew-M-Baer"
            },
            "answer_text": "I am hungry. Let’s go shopping. Let’s buy chicken. (I am sort of vegetarian, but let’s keep it simple.) At local store X, chicken is $1.50 per lb. Next door, at local store Y, it is 1.58 per lb. About a mile away, local store Z is selling it for $1.48 per lb. All things being equal, that is to say, chicken is chicken, I suspect most of us would go to store Z. Why don’t we try something different. Not everyone eats chicken…at least not daily or even once a week. I have a lot of money and I am going to do something interesting. Why not sell food insurance. Tell you what, for a family of 4, I will charge $1,500 per month. (For arguments sake, let’s say a family of 4 spends $1,000 per month on food.) Additionally, you will use your insurance at the store, unless you buy particular items or more of a particular item than your insurance plan allows, then you have to pay a deductible. As my insurance business grows along with the monopoly on food it has created, the price of chicken is now $24.00 per lb. As you enter the store to buy less food than you could prior to my food insurance industry, you can see me in front of the store making extra money at a three card Monte table…or maybe a shell game…kind of a metaphor for what this is all about. Are you beginning to get the idea? Yes, the analogy is off the wall, but so is the medical insurance business. I am not going to go into the entire history of health insurance but I will touch on some points along the time line. At the beginning of the 20th century, with the industrial revolution in full swing, what we now know as workman’s compensation insurance began in 1910 when states began enacting laws to protect workers. Initially, an injured worker would see his own physician and the bill would be covered by the workers compensation fund. Subsequently, some companies hired their own physicians to provide care. Both of these models would evolve over time into models that we see today. Interestingly, even prior to this, since around the time of the civil war, some employers took a portion of their employees pay to put into a sickness fund that would be used to pay employees something during times they did not work due to illness. However, for the most part, absent workman’s compensation paid visits, the majority of physician and hospital visits were paid out of pocket by the patient. One must also take into consideration the fact that medicine as we know it today had quite a revolution since the first colonists came to America. At that time, all American physicians were trained in Europe. There were no CT scans, MRIs, blood work, or antibiotics. Jenner’s work on smallpox would not come until the end of the 19th century. During the 1700s a sophisticated diagnosis might be based upon the patient’s predominant humor. Blood letting was a popular treatment of the time. The “physician” doing the procedure might likely be your barber. The medicines of the day were predominantly botanical. Surgery as we no it today was non-existent. Interestingly, while the age of enlightenment would bring science or what we today call evidence based medicine into being. American physicians kept many of the traditional non-evidence based procedures in their armamentarium. Today, a patient going into cardiac arrest brings to mind the image of a crash cart, defibrillator, and CPR. Back in the 1700s a shortage of such equipment necessitated the use of other means. So, what did they do. The answer lies in a common expression uttered by an individual who believes he is being duped or lied to. Have you ever said, so in so is “blowing smoke.” For those that do not know the full expression, it is, “he is blowing smoke up my ass, or more properly put in doctor speak, rectum. Ever wonder where the expression came from? You guessed it. A method of revival was to give a rectal smoke enema. It started in 1774 in London by two doctors, William Hawes and Thom­as Cogan who administered the procedure at a cost of 4 guineas, about $756 in today’s dollars. (To be sure, the unconscious patient’s wallet would be examined to see if it contained a Blue Cross/Blue Shield card, or American Express.)  In America both before and after the revolution, doctors could be paid in cash and if they could not afford the bill, they would likely pay in goods. At this juncture, an important point needs to be made. In the 1700s and 1800s, most notably in Europe, physicians in particular, and surgeons were highly respected members of society despite the fact that in reality, there was very little they could do for many of the common afflictions of mankind. While they may have been highly respected, what they were not was what we would call wealthy by today’s standards. One did not enter into medicine to become wealthy. We should look at this further by noting changes in language. The traditional definition of a profession is that it is a “calling.” It is something one does not for monetary gain or social status, but rather for the benefit of mankind. Historically, there were only three professions, the clergy, law, and medicine…nothing else. Physicians in the 1700s and 1800s were financially in what today we would call the middle class. One did not undertake medical training in the hope of attaining great wealth. Unfortunately, the concept of medicine as a calling has been lost. Approaching medicine as a personal calling is not a requirement for entrance into medical school although, perhaps it should be because in my opinion the practice of medicine requires a certain selflessness that I think is necessary to be a good physician. Of importance with respect to healthcare finance this plays an important role in understanding the economics of physician salaries today and differences in how the different specialties are compensated. If all physicians have answered a calling, then they would be paid equally. however, they are not as will be discussed subsequently. Getting back to the history of insurance, the depression hit hospitals very hard. Justin Kimble, an administrator at Baylor Hospital devised a plan that would pay hospitals and can be considered a forerunner of Blue Cross. He enrolled 1250 Dallas, TX teachers in to the plan. For 50 cents a month they would be provided 21 days of hospital care. The AMA was opposed to this so only the hospital and not the physicians were covered. In 1932 in Sacramento a plan was created not for one hospital but for all of those in a particular community. These plans were all non-profit. This geographic specification remains today in the Blues. It should be noted, especially because it is the crux of my position, the states did not view these plans as insurance. The looked at them as pre-paid plans. However, in 1933, the NY state insurance commissioner deemed these plans as insurance. His reasoning was that these plans were collecting money for services to be rendered in the future. In a sense, he likened them to life or casualty insurance both of which are paid out at a future time. As will be subsequently discussed I beleive this was a mistake that has had serious consequences in terms of its impact causing the healthcare problems we have tody. In 1939, the California Physicians Service developed what would become Blue Shield. It was an indemnity plan which paid the patient for each event. The patient would be responsible for paying the physician bill. Commercial insurance was another matter. The companies that provided Life, Casualty, and other insurance could not see how health could be insured. Once a patient obtained the insurance, there was no disincentive to be sick. This was resolved by only offering hospital coverage. An admission to a hospital could only be done after a physician determined the patient was ill. However, they did offer coverage for the surgeon because surgery was considered a discrete event. As will be discussed, I think this reasoning was also unsound. Around this time, prepaid plans for physician services would also develop. Physicians were against this because at the time they used a sliding scale with wealthy patients paying more. It was thought that the plans by ending the sliding scale would reduce physician profits because the wealthy were defraying the cost of the poor. However, the plans continued. We must keep in mind that up until the 60s and 79s, the majority of people had no insurance coverage for visits to their primacy care doctor. With the sliding scale, people were able to pay for a simple visit. You paid for your laundry, your food, a hair cut, a manicure. A doctor’s visit was just another expense. Let’s look at this more closely. In 1954 how much do you think a physician office visit cost. Before I tell you, a brake job was about 25 dollars. As for the office visit, around $3.50. A house call, many of you won’t remember them but yes, the doctor used to come to your home. How much….a dollar more…about $4.50. The point being this was an expense that could easily be paid out of pocket for most people. The fact that this was possible has an impact upon a potential remedy to one facet of healthcare costs, primary care and some other specialist office visits. Private Health Insurance grew rapidly in the 40s and 5os. for a number of reasons. World War II brought with it wage and price controls decreasing discretionary spending. The second reason was expansion of organized labor. The Taft Hartley Act of 1947 made health insurance a condition of employment. The US government stuck its nose where it did not belong. Taft Hartley then was an important milestone in the creation of the healthcare mess. The third reason is that the US tax code did not specify whether employee sponsored health insurance was taxable. In 1943 the IRS issued a ruling stating that employee sponsored health care was not taxable. There were also not as many insurance companies to drive a wedge between the provider of a service and the customer that interferes with supply and demand which drives prices in a free market. Physicians, (read surgeons) worried that hospital insurance would get into the physician business, created one for themselves that eventually became what we know as Blue Shield. Ever look at a physician bill? Your primary care physician might bill $100 for what amounts to a 30 minute visit. However, any medical specialty or surgical bill for a procedure will be much more. The reason is that since surgeons created insurance for themselves they were smart. Since people were not going to pay out of pocket, why not jack up the fees. The rest is history. This is why cognitive physicians, the ones who are supposed to help you stay well get paid less for their time than those who do procedures. One time I sustained a laceration to my finger. It was not a big deal. However, when I went to the ED, they wanted me to see a plastic surgeon. I thought it was a bit of over kill. Though trained in Internal Medicine, I had done enough Family Medicine and was very comfortable sewing up lacerations. However, I could not sew up my own finger. (I could teach you to do it.. it really is not hard!) I go to the plastic surgeon and he injects me with lidocaine and sews it up in a couple of minutes. Sometime later when I saw the explanation of benefits I hit the roof. The physician used a couple of different computerized procedural codes (CPT codes) to bill for the injection of lidocaine as well for sewing up the laceration. I used to charge $50 to $75 for doing the same procedure. He charge over $2,000. That is right…over $2,000. I called him up. At first I was polite. He became very defensive. His justification was simply that insurance was paying for it anyway. I wrote to BC & BS who at that time was my insurance company. I accused him of price gouging. What happened? Absolutely nothing! Was I surprised…no. The reason is that by that time in my career I understood what was going on. The company had no incentive to do something for the simple reason that the more physicians charge, the more they can charge for their premiums. Get rid of insurance. Make medical service competitive like any other service. We should stop hospitals from cost shifting, charging $25 for a band aid to pay for other services. Ever wonder what the real cost is for performing an MRI? I don’t know. Just look under the third shell. Maybe the answer is there. Note: Since writing this I have seen comments suggesting a one payer system. There was a time I thought that might be the way to go. However, there are several problems with that. Insurance companies are supposed to spread risk. If you move 5 blocks from where you live, your car insurance may go up. Why? They analyze many factors including how many accidents take place in a particular zip code. So, just moving a few blocks could make a difference. Hopefully, everyone will not have an accident! However, don’t worry, it does not much matter because if more people have accidents the company will increase premiums. It is said that the average profit is 4 to 5 percent. Whatever it is, they are in business and not running a charity! With respect to auto or any other insurance, actuarial analysis allows them to constantly monitor their exposure. This allows them to make what adjustments are necessary to insure they make a profit. So, how can one use this same model with respect to medicine. Think of all the people you know. Are there any of them who have never been ill, have a chronic illness or never required medical care? Pose the same question to yourself but stratify by age. As we get older, eventually, the likelihood that you are going to get something is sadly all too great. That this is true is a subject of another conversation. It has been said that 25% of Medicare outlays are for people during the last years of their lives. How far we go to preserve life and when to quit is also a topic for another conversation. However, no matter. Do you see where I am going with this. How can risk be spread when the risk that you will eventually be sick and have to use the healthcare industry is 100%. Its kind of like my concept of food insurance. There is no way around the requirement for food and unfortunately, as things are, medical care is a necessity. So, we are really not talking about the spread of risk. (Sure, not everyone will have their appendix taken out. That my happen to your buddy John. However, he will recover in time to visit you when you have your hernia repair. Some people may require less than others by virtue of good genetics, avoiding life style choices that lead to illness, and being educated about their health. However, just about everyone has something. Medical care is a service that all of us require at one time or another. The question than becomes how to pay for that service. Or is it? Why does it cost more to go to a doctor than to get a haircut? (I am playing the devils advocate here…a sore spot.) I remember working for a physician when I finished my residency in the early 90s. At that time he had signed up for a number of HMO panels. I suspect most of you don’t know how that works. Well, here is the deal. I will make up an example. Insurance company X gives you 1000 patients broken up into 400 men, 500 women, and 100 children. For each man, you get $6 per month, for each woman, $7 per month, and for each child, $8 per month. (I am making up the numbers…but they are different for men, women and children.) So, if my arithmetic is still good, that is $6,700 per month. For that amount, he has to take care of all those patients both at the office and in the hospital. Certain tests done at the office were also covered. If he referred too many patients to specialists, lab work, imaging, or modalities such at PT, he could be penalized and lose money. So, the incentive when Mrs. Smith calls about her 5 year old’s sore throat, to let the nurse handle it over the phone. The physician also has a disincentive to refer patients. This as opposed to fee for service medicine where the physician gets paid when the patient comes in. When Mrs. Smith calls about her son in this situation, the nurse tells her to bring him in. The doctor will order a strep test for which he can charge the patient. Now, the guy I worked for was a real doctor. To his determent, he did not care or think about money so he referred patients to specialists or for whatever tests he thought they needed. I remember one day after a phone call from one of his insurance companies, his face turned red, he screamed the name of the company with an epithet, and smacked his hand on the table. They called him to tell him that he had referred so much that essentially he would get less money that month. I was 100 K in student loan debt and making $40 bucks an hour in a DC suburb. I remember the early and mid-90s as we heard about these “kids” making a fortune on these things called PCs and something called the Internet. That doctor would shake his head thinking how hard he had worked and is still working busting his chops while these “kids” were making a fortune doing what? I am sure you get the idea. I have to be honest and say that whatever thoughts I had that my financial life would be easier after finishing my residency were quickly dashed by the reality of what medicine had already become and where it was going. Additionally, I wanted to work on my own. I remember wanting to start my own practice. The banks (well, the people in the banks) laughed at me. Physician practices were already having financial problems. To make matters worse, I, as did a number of colleagues who were similarly afflicted had a particular problem. We really loved medicine. We loved talking to our patients. We were terrible or perhaps we did not care about the fact that medicine is a business. One of my friends, a cardiologist, he had the same extrovert nature as I do and would spend a considerable amount of time with patients just talking to them. His wife, the office manager, a good choice because she had a vested interest in things running correctly, was constantly on him to move on. The things is, I think we were doing what we should be doing. You really have to get to know your patients, what they do for a living, their hobbies, their relationships…the whole nine yards. People are not automobiles. There is a psychological component which must be addressed. I do believe that our emotions and thoughts have a very significant impact on our health. Besides, how else to you get to learn about all the different things people do especially in and around a vibrant area such as the Nation’s Capital. This brings me to this. At one time, prior to what I call the egalitarian, inflationary pressure that everyone should be paid as much as the other guy, the Oxford Dictionary listed only three professions: the clergy, law, and medicine. That was it. You could not be a professional disk jokey or a professional sanitation worker (garbage man.) The definition of a profession is that it is a “calling,” something that people do because, perish the thought, they really like and want to help people. One might say you have to be a little bit nuts…perhaps in a good way. Prior to our moderns era, physicians were well respected but they were no rich or wealthy. This brings me full circle to my question. Should physicians be paid as much as they are. Should they be paid more? Should they be paid less? Sometimes I thought I would have been happier had I been independently wealthy and could practice medicine as a full time hobby! It may sound crazy but it isn’t. Certainly if we could remove the financial burden of medical education that would be a start. A guy I knew investigated Medicare fraud at one time. There was and probably still is lots of it. That is only one of the problems getting the government further involved in this mess. I sometimes wonder if there was a way to simply provide free care for everyone. Perhaps physicians should be paid while their patients are well and not paid when they get sick and shift the entire paradigm to prevention. I apologize if you feel I have led you on to think I have an answer because I don’t. I do know the present system is broken and The Affordable Care Act is not even a band aid. I do suggest that with the ability to access information that we have, that people take as much responsibility for their health as they can. Medical information is growing exponentially. The more people know the better they can make informed decisions about their health. ",
            "date": "Updated February 25, 2018",
            "views": "629",
            "upvotes": " View 5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grayson Young",
                    "user_href": "/profile/Grayson-Young-1"
                },
                {
                    "user_id": "Alexey Danilov",
                    "user_href": "/profile/Alexey-Danilov-4"
                },
                {
                    "user_id": "Eleanor Murray",
                    "user_href": "/profile/Eleanor-Murray-1"
                },
                {
                    "user_id": "Elona Maliqi",
                    "user_href": "/profile/Elona-Maliqi-1"
                },
                {
                    "user_id": "Keith Arns",
                    "user_href": "/profile/Keith-Arns-1"
                },
                {
                    "user_id": "Jay Granville",
                    "user_href": "/profile/Jay-Granville"
                },
                {
                    "user_id": "Kshitij Kamat",
                    "user_href": "/profile/Kshitij-Kamat-4"
                },
                {
                    "user_id": "Ted Gunderson",
                    "user_href": "/profile/Ted-Gunderson-4"
                },
                {
                    "user_id": "Mason Hollon",
                    "user_href": "/profile/Mason-Hollon-2"
                },
                {
                    "user_id": "Joshua Morrison",
                    "user_href": "/profile/Joshua-Morrison-22"
                }
            ]
        }
    ]
}