{
    "title": "What kind of phones does BTS use now? - Quora",
    "tags": [
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Dal",
                "href": "/profile/Chris-Dal-5"
            },
            "answer_text": "i assume this question is because of their partnership with lg? these are my guesses based on their twitter, but i don’t 100% know anything so i could be wrong. i think they all have an iphone x except for jin namjoon: iphone x/xr/xs etc  this is a screenshot he posted on twitter. the little bar at the bottom is the way you slide to your home screen on an iphone x. plus the whole format with this clock in the left corner and wifi/battery in the right fits the whole iphone x format. seokjin: (maybe) iphone 6s apparently he had expressed a dislike for the iphone 7 not having a headphone jack, so he never upgraded from a 6. by now he may have an iphone x, or an android, but the last known phone he had was an iphone 6s. yoongi: iphone x/xr/xs etc  same bar as namjoon’s phone hoseok: iphone x     the camera cut out on his phone case is for an iphone x  plus if he had an LG i don’t think there’d be an issue where he had to cover the camera because bts and lg have a partnership. jimin: iphone x   jimin's tweet with the home screen bar. i was thinking this could be the same screenshot from yoongi’s tweet but the time is different in the pic’s corner.  a few months earlier he tweeted a screenshot from a facetime with jk (in september) and since the iphone xr/xs we’re JUST released i assume he just had an iphone x taehyung: iphone x/xr/xs etc  same formatting thing as the others jungkook: iphone x  i know this is an iphone case, but the camera cut-out isn’t clear enough for me to tell which model. but you can tell that the iphone is post-iphone 7 because there’s no headphone jack.  jungkook tweeted this which is obviously a facetime screenshot and once again the white bar at the bottom of his picture indicated an iphone x. the iphone xr/xs are also a possibility, but they had just been released when this was tweeted so it’s not as likely. ",
            "date": "Answered May 18, 2019",
            "views": "806",
            "upvotes": " View 159 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nasteho Houssein",
                    "user_href": "/profile/Nasteho-Houssein-2"
                },
                {
                    "user_id": "Vanessa Jaramillo",
                    "user_href": "/profile/Vanessa-Jaramillo-39"
                },
                {
                    "user_id": "Jackail Mikhail Mathias",
                    "user_href": "/profile/Jackail-Mikhail-Mathias"
                },
                {
                    "user_id": "Rosetta Moore",
                    "user_href": "/profile/Rosetta-Moore-4"
                },
                {
                    "user_id": "Fox Nuts",
                    "user_href": "/profile/Fox-Nuts"
                },
                {
                    "user_id": "Lemon Boy",
                    "user_href": "/profile/Lemon-Boy-43"
                },
                {
                    "user_id": "Naina Khanna",
                    "user_href": "/profile/Naina-Khanna-15"
                },
                {
                    "user_id": "Danielle Hill",
                    "user_href": "/profile/Danielle-Hill-157"
                },
                {
                    "user_id": "Xiomara",
                    "user_href": "/profile/Xiomara-32"
                },
                {
                    "user_id": "Maisy Hills",
                    "user_href": "/profile/Maisy-Hills"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaishah Khawaja",
                "href": "/profile/Aaishah-Khawaja-1"
            },
            "answer_text": "Ok so First, Jin uses the iPhone 6s which has a color of rose gold, i was able to determine this through a screen shot he posted on Twitter. 2. Second, Rapmon uses iPhone x which has space gray color, i got this through a picture he posted on Twitter while holding the iPhone x, he was seen standing facing a mirror. 3. Third, Suga uses the iPhone 7 which has matte black color, i was able to determine this through a picture posted on Instagram where he was seen standing at a bitch with the iPhone 7 in his hand. 4. Fourth, J-hope uses the iPhone x which has space gray color, i was able to determine this through a screen shot he dropped on Twitter showcasing something to us. 5. Fifth, Jimin uses iPhone 7 which has matte black color, this was determined through a picture he took at his garden, in the garden he was seen snapping some plants with the iPhone 7. 6. Sixth, V uses iPhone 7 which has a color of matte black, he was seen on social media holding the phone while doing a live broadcast. 7. Seventh, Jungkook uses iPhone 7+ which has jet black color, i was able to determine this by seeing a picture he dropped on Instagram, the iPhone 7+ was seen laying flat on his table Hope u guys enjoyed and don't forget to upvote and follow me HV a nice day Aaishah khawaja ",
            "date": "Answered April 29, 2020",
            "views": "118",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nasteho Houssein",
                    "user_href": "/profile/Nasteho-Houssein-2"
                },
                {
                    "user_id": "Kriti Bhandari",
                    "user_href": "/profile/Kriti-Bhandari-26"
                },
                {
                    "user_id": "K Im",
                    "user_href": "/profile/K-Im-13"
                },
                {
                    "user_id": "Yasha Shukla",
                    "user_href": "/profile/Yasha-Shukla-5"
                },
                {
                    "user_id": "Bushra Qureshi",
                    "user_href": "/profile/Bushra-Qureshi-7"
                },
                {
                    "user_id": "Ramesh Kumar",
                    "user_href": "/profile/Ramesh-Kumar-8684"
                },
                {
                    "user_id": "Shraddha Kulkerni",
                    "user_href": "/profile/Shraddha-Kulkerni"
                },
                {
                    "user_id": "Anna Kernohan",
                    "user_href": "/profile/Anna-Kernohan-1"
                }
            ]
        }
    ]
}