{
    "title": "What is the most important step for a business to become data driven? - Quora",
    "tags": [
        "Data Driven Development",
        "Data Analysis",
        "Big Data",
        "Data Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prashanth Rajendran",
                "href": "/profile/Prashanth-Rajendran-1"
            },
            "answer_text": "CULTURE I know its a word lot of people throw around in business and may not mean anything in most cases. Then why did I chose such a strange word to answer an important question like this one?. Culture contains two components - Inculcate certain characteristics and there there is DNA which every organization has since its inception. What characteristics I should Instill in my team? Listening to Data - Are they willing to get new insights about their business ?. Teams should not dismiss data because it “doesn’t suit their agenda”. Do they genuinely want to improve their decision making by using data.Humility - Lets say a business has been doing things in a certain way for a long time now (like 5 years). Consultant / Analyst comes on board and recommends new processes, Can they work with them or will there be ego clash and they play petty politics?Curiosity - We do not want a culture in which data science teams are dictating everything either, we want all teams to work together. Just because you are in Customer Support , doesn’t mean you have to listen to data teams blindly. You should ideally question them on why we are measuring this metric , why not alternative ones and be aware about fallacies or metrics that can be gamified.so lot of above factors I mentioned are things you possibly need to instill when hiring someone new for any role. How do you change DNA? Data Teams have got their work cut out to get existing members on board. No one is going to listen to Data Teams on day one, so would recommend them to build credibility first by going after small projects (non-conflicting) and getting huge wins. Demonstrating value of your insights and then tackling large scale projects. Its a 2 way street, so Data Teams have as much responsibility to include other stakeholders in conception phase (what to measure, goals, why we use this metric?). So in short - Data teams should build credibility first , Instill above values in your team and you can also see how important it is for the Data Scientist to listen and communicate properly(so hire correctly!). This is how we can build a data driven culture in a business. Follow me on ‘LinkedIn’ for data science tips and insights. ",
            "date": "Answered June 4, 2019",
            "views": "317",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bharath Chandrababu",
                    "user_href": "/profile/Bharath-Chandrababu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason T Widjaja",
                "href": "/profile/Jason-T-Widjaja"
            },
            "answer_text": "The most important step for a business to be data driven is not about analytics tools, languages or any sort of data processes at scale. It may not even be about the data scientist. This is because unless you are in the business of packaging and selling data, the value of data is not in the data itself. It is in the decisions that a made on the basis of data well used. The most important aspect of this is thus the decision maker. They need to be comfortable to make decisions on the basis of data, changing their minds and challenging their held assumptions along the way. So the first and most important step has nothing to do with machine learning, Hadoop or Python. It is about creating an environment where decision makers are educated and incentivised to embed data in their daily decision making. Otherwise the fanciest expensive data investments is just a waste of time and money. ",
            "date": "Answered May 31, 2019",
            "views": "19",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrew DeSouza",
                    "user_href": "/profile/Andrew-DeSouza-8"
                },
                {
                    "user_id": "Kurisu Makise",
                    "user_href": "/profile/Kurisu-Makise-10"
                },
                {
                    "user_id": "Lu Tian",
                    "user_href": "/profile/Lu-Tian-42"
                },
                {
                    "user_id": "David Bofill",
                    "user_href": "/profile/David-Bofill"
                },
                {
                    "user_id": "Apm",
                    "user_href": "/profile/Apm-12"
                },
                {
                    "user_id": "Dominic Ligot",
                    "user_href": "/profile/Dominic-Ligot"
                },
                {
                    "user_id": "Debrup Majumdar",
                    "user_href": "/profile/Debrup-Majumdar"
                },
                {
                    "user_id": "Jukka Toivanen",
                    "user_href": "/profile/Jukka-Toivanen"
                },
                {
                    "user_id": "Nikhil Shaw",
                    "user_href": "/profile/Nikhil-Shaw-2"
                },
                {
                    "user_id": "David Skarbrevik",
                    "user_href": "/profile/David-Skarbrevik"
                }
            ]
        }
    ]
}