{
    "title": "What are the best books set on the Northwest Coast? - Quora",
    "tags": [
        "Pacific Northwest",
        "West Coast (U.S.)",
        "Washington (state)",
        "Seattle, WA",
        "Literature",
        "Reading",
        "Book Recommendations",
        "Visiting and Travel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Painter",
                "href": "/profile/Erik-Painter"
            },
            "answer_text": "Sometimes a Great Notion by Ken Kesey is the great Northwest Coast novel. About a fiction coastal Oregon town in the middle of a bitter logging strike in a small lumber town and a family of loggers that goes against the entire town.  Other good ones are: Trask— Don Berry. Set in 1848 on along the northern Oregon coast range in the late 1840s Mink River by Brian Doyle. Set in the fictional small town of Neawanaka on the Oregon coast ( \"very probably in Tillamook county,\" according to the author) The River Why by David James Duncan. Set in the Oregon Coast Range. Of Walking in Rain by Matt Love. Memoir. The Sea Runners—Ivan Doig. Four indentured servants escape a Russian Alaska work camp in a stolen canoe and go down the Pacific Northwest coast from New Archangel, Alaska, to Astoria, Oregon. Sky Time in Gray's River: Living for Keeps in a Forgotten Place —Robert Michael Pyle. Non fiction. Our Lady of the Forest—David Guterson. Set in a depressed lumber town on the Olympic Peninsula in Washington State. The Egg and I - a memoir by Betty MacDonald about her adventures and travels as a young wife on a chicken farm on the Olympic Peninsula in Washington state. The Good Rain: Across Time & Terrain in the Pacific Northwest by Timothy Egan. Non fiction. West of Here by Jonathan Evison. Set on the the Elwha River on the Olympic Peninsula. Soul Catcher is Dune-author Frank Herbert’s only non-sci ﬁ novel. A crazy/activist Native American and the 13-yearold white boy he kidnaps on a trek into the rugged interior of the Olympic Mountains. Making Certain It Goes On: The Collected Poems of Richard Hugo— Richard Hugo. What W. B. Yeats is to Ireland, he is to the NW. A Passage to Juneau- Jonathan Raban. An account of Raban's trip by boat from Seattle to Juneau, mixed with the voyage of Captain George Vancouver in 1792-94. Here are some set on the wet side of the NW but not on the coast: October Ferry to Gabriola is a novel by Malcolm Lowry set in the the Gulf Islands and Vancouver. Desolation Angels by Jack Kerouac. Might be his best. Set in the wet Northwest. Dune by Frank Herbert space opera partly set on a desert planetinspired by the sand dunes of Florence, Oregon. Herbert was a resident of Port Townsend. Hard Rain Falling by Don Carpenter and The Lathe of Heaven by Ursula K. Le Guin are set in Portland. Not exactly the NW coast but on the wet side. Tobias Wolff's memoir, This Boy's Life. Set in the town of Concrete in the Skagit Valley. Andrew Henry’s Meadow and The Summerfolk, by Doris Burn. Two children’s books set where the author lived and worked in the 1950s and ’60s on Waldron Island. Snow Falling on Cedars, David Guterson is set on a fiction version of Bainbridge Island in Puget Sound in WWII (moved in fiction to the San Juans). Not the coast, but on the water and on the wet side. The Living, a novel about Whatcom County pioneers by Annie Dillard. Ricochet River by Robin Cody. Set in ficitonal Oregon mill town of Calamus. Modeled on the town of Estacada, Oregon on the Clackamas River. Not on the coast, on the west side though. The Singing Creek Where the Willows Grow. By Opal Whiteley. A diary from 1902. She grew up in logging settlements near the town of Cottage Grove, at the southern end of Oregon’s Willamette Valley. Who in Hell Is Wanda Fuca? by G. M. Ford. Set in Seattle’s Pioneer Square and in the woods near Everett. Trout Fishing in America by Richard Brautigan is set in the NW. Sort of. “ Stacked over against the wall were the waterfalls. There were about a dozen of them, ranging from a drop of a few feet to a drop of ten or fifteen feet. There was one waterfall that was over sixty feet long. There were tags on the pieces of the big falls describing the correct order for putting the falls back together again. The waterfalls all had price tags on them. They were more expensive than the stream. The waterfalls were selling for $19.00 a foot. I went into another room where there were piles of sweet-smelling lumber, glowing a soft yellow from a different color skylight above the lumber. In the shadows of the edge of the room under the sloping roof of the building were many sinks and urinals covered with dust, and there was also another waterfall about seventeen feet long, lying there in two lengths and already beginning to gather dust. I had seen all I wanted of the waterfalls, and now I was very curious about the trout stream, so I followed the salesman’s directions and ended up outside the building. O I had never in my life seen anything like that trout stream. It was stacked in piles of various lengths: ten, fifteen, twenty feet, etc. There was one pile of hundred-foot lengths. There was also a box of scraps. The scraps were in odd sizes, ranging from six inches to a couple of feet. There was a loudspeaker on the side of the building and soft music was coming out. It was a cloudy day and seagulls were circling high overhead. Behind the stream were big bundles of trees and bushes. They were covered with sheets of patched canvas. You could see the tops and roots sticking out the ends of the bundles. I went up close and looked at the lengths of stream. I could see some trout in them. I saw one good fish. I saw some crawdads crawling around the rocks at the bottom. It looked like a fine stream. I put my hand in the water; it was cold and felt good.” ",
            "date": "Answered June 5, 2019",
            "views": "561",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elaina Oommen",
                    "user_href": "/profile/Elaina-Oommen"
                },
                {
                    "user_id": "Aspen Sandoval",
                    "user_href": "/profile/Aspen-Sandoval-1"
                },
                {
                    "user_id": "Wendi Brown",
                    "user_href": "/profile/Wendi-Brown-4"
                },
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                },
                {
                    "user_id": "Patrick Foley",
                    "user_href": "/profile/Patrick-Foley-23"
                },
                {
                    "user_id": "Danita Lee Ewing",
                    "user_href": "/profile/Danita-Lee-Ewing"
                },
                {
                    "user_id": "Kate Hall",
                    "user_href": "/profile/Kate-Hall"
                },
                {
                    "user_id": "Mills Baker",
                    "user_href": "/profile/Mills-Baker"
                },
                {
                    "user_id": "Gerald Pierson",
                    "user_href": "/profile/Gerald-Pierson"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerald Pierson",
                "href": "/profile/Gerald-Pierson"
            },
            "answer_text": "“What are the best books set on the Northwest Coast?” Assuming Northwest Coast means the U.S. Pacific Northwest, I’m partial to Betty MacDonald’s memoirs: The Egg and I (1945) The Plague and I (1948) Anybody Can Do Anything (1950) Onions in the Stew (1955) I understand her sister Mary Bard put her in touch with publisher J.B. Lippincott, who were looking specifically for authors in the region. While The Egg and I is her most famous work and spawned a movie and a spin-off film franchise (the Ma and Pa Kettle movies), my favorite is The Plague and I, about her year in a TB sanatorium. ",
            "date": "Answered June 5, 2019",
            "views": "136",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                },
                {
                    "user_id": "Reba Schneider",
                    "user_href": "/profile/Reba-Schneider-1"
                },
                {
                    "user_id": "Philip Peterson",
                    "user_href": "/profile/Philip-Peterson-8"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                }
            ]
        }
    ]
}