{
    "title": "What lessons should the United Nations take from the successes or failures of the Millenium Development Goals (MDGs) in the design and implementation of the Sustainable Development Goals (SDGs)? - Quora",
    "tags": [
        "Millennium Development Goals",
        "International Development",
        "Sustainable Development"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hiba Shimla",
                "href": "/profile/Hiba-Shimla"
            },
            "answer_text": "BACKGROUND The Millennium Development Goals (MDGs) agenda was first crafted in 2001, targeting prominent challenges the world was facing at the time. These were eight international development goals to be achieved by 2015 addressing poverty, hunger, maternal and child mortality, communicable disease, education, gender inequality, environmental damage and the global partnership. This framework has laid ground by setting targets despite there being variability among countries capabilities. Though irregular, the MDGs announcement did raise governments' commitment and public awareness that helped mobilize action in support of poverty eradication efforts across the world. However, since the ongoing interventions were considerably variable and slow, many of the targets remained unreachable. The efforts worldwide focused on child and maternal health and diseases with limited attention to other targets. As a result, as the deadline for the MDGs came closer, some countries were on the path to achievement for some of the targets, but, some of the world's low income countries were as result left behind in an effort to meet the targets. There were several factors which contributed to such irregularities. The MDGs were developed in a closed-door environment with very little consultation among the developing countries (basically avoiding and not keeping their most basic needs in mind), civil society and other stakeholders which resulted in ownership standards being severely poor by society and governments. Furthermore, there was a lack of ambition, accountability for meeting the goals and and made them unfeasible which derailed the pathway for sustained institutionalized change. SUSTAINABLE DEVELOPMENTAL GOALS (SDGs)  Basically of the above mentioned factors, the UN decided on the need of setting a more ambitious development agenda to accede to the MDGs. The goals and targets (Sustainable Developmental goals) now consider lessons from the current set of MDGs; so I wouldn’t necessarily say the MDGs were completely useless. It was a lesson learnt which was very much needed and led to the path towards an even more ambitious plan which are the Sustainable Developmental goals.  Distribution of the Millennium Development Goals (MDGs) and Sustainable Development Goals (SDGs) across the sustainable dimensions. As you can see the SDGs have more of an impact as compared to the MDGs. (Source: Evaluation of Neighborhood Development and Framework for implementation in Poor Countries, Sarachaga, Jata & Castro- Fresno, 2018) WAY FORWARD: The first step would be to have consultations which are not vague in regards to the future goals by creating ways for local, national, and regional debate, making sure key stakeholders, including governments, civil societies, private sector and development agencies are prominently involved. The new targets, should make sure that today's political situation, health and environmental challenges, and, inter-sectoral and accountable approach should be adopted while nations now agree on a new set of goals and adapt at the national level and making sure that each country's specific capacities, constraints and challenges are reflected. In addition to customizing the targets, countries should be assessed on their progress and the efforts they are making to expand opportunities to live in freedom and dignity for all, without discrimination. Going forward, implementation of the 2030 Agenda for Sustainable Development are critical depending on the capacity of countries to collect statistics to set a benchmark and be able to monitor progress towards the SDGs. The challenges will further be heightened by the growing demand for better, faster, more accessible, data for bringing poverty and inequalities down and achieving sustainable development. A worrisome example of data gaps is the fact that a large number of developing countries still lack complete civil registration systems. These systems can be the basis for reporting births and deaths. It is estimated that nearly 230 million children worldwide under age five have never been registered (absolutely worrying)— approximately one of every three children in that age group ( Source: United Nations, 2014a, p. 7). Children unregistered at birth or lacking identifying documents are often excluded from access to education, health care and social security, which represents a serious lack towards development and poses more challenges while trying to find a solution; no data- no solution!). For example, some countries still have certain limitations when it comes to in assessing trends in malaria occurrence over time mainly because their national health information systems generate incomplete or inconsistent data. Malaria cases also remains undetected where the disease burden is highest because of a lack of surveillance systems. (Source: United Nations, 2014a, p.9) ",
            "date": "Updated August 1, 2018",
            "views": "726",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saniya Tiwari",
                    "user_href": "/profile/Saniya-Tiwari-1"
                },
                {
                    "user_id": "Hitarth Mittal",
                    "user_href": "/profile/Hitarth-Mittal"
                },
                {
                    "user_id": "Anandu Suresh Govind",
                    "user_href": "/profile/Anandu-Suresh-Govind"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Kakooza",
                "href": "/profile/Allen-Kakooza"
            },
            "answer_text": "There is need for the designers of the goals to fully understand the needs of the people and the priority given to these needs. I have seen well meaning outsiders draw plans that make no sense to the people for whom they are drawing them. Resource allocation needs to be based on locally tailored, culturally relative formulas and concepts. For example, while safe drinking water is a basic need for all humans, drilling a bore hole is not the solution in certain areas. I have seen funds wasted to drill for water in areas that have water springs, and the locals continued to draw water from the dirty water spring because of lack of sensitization in part and lack of understanding by the donor about cultural norms. The water that comes out of a borehole tends to have a metallic taste and in some areas the community believes that taste will create erectile dysfunction and bareness. A better solution for this community would have been to build a concrete water way around the spring so that the water collects in a cleaner environment. One size fits all application has proved to waste a tonne of resources. To top it all a lot of developing countries’ governments have failed distribute funds in a transparent manner, often times the aid is falling into the pockets of a few officials year after year. United Nations knows that governments are squandering the money, for example Mosquito nets in Uganda that were clearly labelled not for sale were sold on a daily basis in local markets. HIV drugs sit in the National medical stores until they expire while health centers shelves are empty. Monitoring and evaluation is lacking, a lot of the experts sent into developing countries quickly pick up the lax habits and turn a blind eye as work goes undone. It will take full engagement of the locals themselves in the issues that concern their lives to achieve any real change. ",
            "date": "Answered December 29, 2016",
            "views": "489",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saniya Tiwari",
                    "user_href": "/profile/Saniya-Tiwari-1"
                },
                {
                    "user_id": "Mirza Annisa Izati",
                    "user_href": "/profile/Mirza-Annisa-Izati-1"
                }
            ]
        }
    ]
}