{
    "title": "What is the scope of big data and cloud computing? - Quora",
    "tags": [
        "Cloud Computing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sumit Rana",
                "href": "/profile/Sumit-Rana-495"
            },
            "answer_text": "Big data and cloud computing both are trending and long term technologies in IT industry. Big data is becoming most popular term in the industry. Because of the growing number of data from different sources the big corporation require the the system known as big data. Big data and cloud computing are not same both are different from each other. Let us start by looking at the features of big data. Big data and cloud computing both are trending and long term technologies in IT industry. Big data is becoming most popular term in the industry. Because of the growing number of data from different sources the big corporation require the the system known as big data. Big data and cloud computing are not same both are different from each other. Let us start by looking at the features of big data. Big Data Big data is one of the most popular term these days. The name itself says that it contains the massive amount of data. Apart from containing the data it also provide the way to gathering, storing, organising and analysing data collected from various sources. Big data contains huge amount of data the data can be structured, semi structured and unstructured. It provides the ways to process all these data into valuable information for the organisation to take further decisions. Big data is combination of the following features. Big data holds the volume, variety and velocity of data. The data in big data is in massive amount. Usually big data holds the data ranges in Exabyte, petabytes etc. Keep in mind that the data sources of big data is no single. The data is comes from various sources i.e sales record, R&D department report, competitor report and internet information. Remember that the data not always be in structure form because it is collected from various sources. Big data analyzes the data at lightning fast speed. Because of the velocity of Big data it is applied in artificial intelligence and machine learning. Cloud Computing Cloud computing the name itself explaining what is it. It is the technology use for storing and access data and application through the internet. It is not similar to big data because you can’t have your own personal resources for cloud computing. Cloud Computing Category SaaS(Software As A Service) Sass is one of the most famous cloud computing lots of companies are using SaaS to provide their service to the customers. In this a software installed on the company’s major server and the users use it through their computer or any other internet based devices. Moz is the best example of SaaS. It is an internet based cloud computing. IaaS (Infrastructure as a Service) In this type of cloud computing the companies provide the storage space on their computer to the users. The user get the specific amount of space as per company terms. The user can arrange the file as per their choice. It is same as local storage but the only difference is that this storage space is provided through the internet. Google Drive, Dropbox are the best example of IaaS. (Pass) Platform as a Service PaaS is one of the most popular cloud computing. It provide the platform to the users to develop the softwares through the tools provided by the Paas company. The users can easily manage the software. One of the most popular example of PaaS is Amazon Web Services(AWS) Let’s Sum Up Now we have taken a deep look on the characteristics of both cloud computing and big data. Big data is large set of data on the other hand cloud computing is all about giving the storage or accessing the large set of data over the internet. At the we can say that big data is use to take a decision based on data. On the other hand cloud computing is about using the data from other’s computer over the internet. Original Source[1] Footnotes[1] Difference Between Big Data And Cloud Computing [Infographics]",
            "date": "Answered January 5, 2020",
            "views": "94",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jeffrey Daniels",
                    "user_href": "/profile/Jeffrey-Daniels-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Satish Garg",
                "href": "/profile/Satish-Garg-1"
            },
            "answer_text": "Big Data is a buzzword given by marketers basically to data sets that are so huge that one machine is not enough to do all the computations/processing, with or without premature optimizations. The amount of data that is being generated currently by the Internet every second is humongous. Big data computation platforms comes into picture when it needs to be mined/analyzed to create business insights real-time or otherwise. It has lot of applications in Machine Learning, Deep Learning, Artificial Intelligence, Natural Language Processing, Analytics and many more. There are many big data computation platforms available, open source and otherwise,  if you want to look into it such as Apache Spark.  Cloud computing gives the flexibility to host an application/logic without having to own the hardware and it is very convenient and highly performing also especially when it comes to serving customers residing in different parts of the world. It has major role to play in life cycle of startups as it would have not been easy to host a lot of hardware beforehand just to test an idea. But, with its pay-as-you-use model along with reliable and scalable deployment of applications, it has been a piece of cake, at least to some extent. Also the learning curve is great as you get to work not only with developing solutions but also making them scalable and efficient. And there are so many approaches that can be tried out to a particular problem by using Big Data Computation Platforms alongside Cloud Computing. Both of them are solving lot of problems in the domains of Healthcare, Finance, Defense, etc. and so the scope is enormous for now and for few more years to come, atleast. ",
            "date": "Updated April 29, 2016",
            "views": "73",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tushar R",
                    "user_href": "/profile/Tushar-R-25"
                },
                {
                    "user_id": "Surendra Km",
                    "user_href": "/profile/Surendra-Km"
                },
                {
                    "user_id": "Sai Ram",
                    "user_href": "/profile/Sai-Ram-19"
                },
                {
                    "user_id": "Gopalakrishna Tadakamalla",
                    "user_href": "/profile/Gopalakrishna-Tadakamalla"
                },
                {
                    "user_id": "Chunduru sai Pavan Kumar",
                    "user_href": "/profile/Chunduru-sai-Pavan-Kumar"
                },
                {
                    "user_id": "Dhananjay Kirpekar",
                    "user_href": "/profile/Dhananjay-Kirpekar"
                }
            ]
        }
    ]
}