{
    "title": "What things do I need to change in my low-end PC to make it capable of 4k editing? - Quora",
    "tags": [
        "Ultra HD Television",
        "4K (format)",
        "Video Editing Software",
        "Video Editing",
        "Computer Monitors and Screens",
        "Personal Computers",
        "PC Gaming ",
        "Computer Hardware",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Graham Stevenson",
                "href": "/profile/Graham-Stevenson-11"
            },
            "answer_text": "A genuinely *low end* PC is not ever going to be capable of 4k video editing, no matter what you do to it. For 4k video editing you may need workstation levels of performance. Since that’s likely to be outside of your budget, I’d consider buying a ‘second-user’ workstation type PC from eBay. Dell and Hewlett Packard make some nice ones often using Intel’s XEON Server orientated processors. I’m actually in the process of buying one myself. For not much money you can even outrun any i7 CPU and maybe even an i9 especially using twin CPUs ! You won’t need a gaming GPU either. Look at Nvidia’s inexpensive Quadro cards for starters. They have the kind of acceleration that you’ll need and are almost ‘two a penny’ when carefully shopping around, second user again. ",
            "date": "Answered October 22, 2020",
            "views": "490",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nagy Zoli",
                "href": "/profile/Nagy-Zoli"
            },
            "answer_text": "To be honest.. the entire PC if it is “that” low end. My PC is: Asrock X370 killer SLI, amd 1800X ryzen 7, 16 GB DDR4, whatever ssd, 650 W corsair power supply and RTX 2080 graphics card. Everything except the RAM and graphics card. It was the strongest possible thing in 2017, cutting edge. Now, in 2020 everything except the graphics card is 3 or even 4 generations obsolete. 4K means a lot of power, so basically you need cutting edge. ",
            "date": "Answered October 22, 2020",
            "views": "779",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charles Morgan",
                    "user_href": "/profile/Charles-Morgan-26"
                }
            ]
        }
    ]
}