{
    "title": "What's an affordable ham radio for beginners? - Quora",
    "tags": [
        "Amateur Radio "
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenneth Jennings",
                "href": "/profile/Kenneth-Jennings-3"
            },
            "answer_text": "Alex gave a great answer. Getting on 2m repeaters to talk with other hams is a great intro to the hobby — with one important caveat. It depends on where you live. Some of the repeaters in major cities are full of unlicensed interlopers using fake call signs, or licensed amateurs that think the 2m band is for internet-esque flame wars. In my community, the 2m repeaters are clean, professional, and welcoming to new hams. Still, if I were getting into the hobby on a budget and had about $100 - $150 to spend, I would get the 8 watt Baofeng (BF-F8HP) in a kit that includes the large battery and some accessories. I would also get a push to talk microphone, an SMA to UHF adapter, a mag-mount car-top antenna, and an outdoor antenna with enough coax to connect it. You can buy a decent “roll-up” J-pole antenna for about $20 or make one from a discarded piece of 300 ohm TV twin-lead. I would do all this so that you don’t get bored by just messing about with a $30 handheld unit. With the accessories described (all available on Amazon) You can run mobile from your car with a real push-to-talk mic, or from home with enough antenna to try some direct communications. By analogy, I am also an amateur astronomer. People that have kids who are “over-the-moon” interested in astronomy often buy them what is called a “department store telescope.” You really can’t see anything with those and the child loses interest quickly. Amateur radio has so much to offer that you don’t want to lose interest because your only experience is in using the radio equivalent of a department store telescope. If you are really interested in what makes this stuff work, study up and get your general (or extra) class license. The suggestion to get an Icom 718 or equivalent entry-level but reasonable quality 160m to 6m transceiver is a good one. I would also recommend looking at used equipment. If you can find a good Icom 706MkIIG it is a good choice for a couple or reasons. First, it covers all of the most-used amateur bands, from 160m all the way to 70cm, so you still get to work your 2m and 70cm repeaters while trying your hand on the HF frequencies where you can talk around the world. Second, I worked over 100 countries on this little gem with a multiband vertical antenna that cost less than $400. OK, $400 is starting to be real money, but if you want to work the world, you do have to spend some, but that’s cheap. The third good reason to get the Icom (or similar) is that when you graduate to a more sophisticated base station, the IC 706 is a good mobile unit where the main body of the radio can go under the seat and you can mount the control unit on the dash. Finally, Alex is right about finding a club. Amateur radio operators love their hobby and most of them love to help out newcomers. In radio a mentor is called an “Elmer.” A few older hams like to pat themselves on the back by mocking the ignorance of the newcomer to the hobby. Fortunately, they are rare and most hams will welcome those that are so new to the hobby that they are just learning the vocabulary. Stick with it long enough and you will not regret the effort. The thrill of those first international contacts or landing a rare one is something to look forward to and something you will never forget. Welcome to the what I think is the friendliest hobby in the world. KJ2U ",
            "date": "Answered February 22, 2017",
            "views": "42",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ron Garrett",
                    "user_href": "/profile/Ron-Garrett-2"
                },
                {
                    "user_id": "Jonathan K. Skean",
                    "user_href": "/profile/Jonathan-K-Skean"
                },
                {
                    "user_id": "Tamara Wilhite",
                    "user_href": "/profile/Tamara-Wilhite"
                },
                {
                    "user_id": "Gregory Randazzo",
                    "user_href": "/profile/Gregory-Randazzo-1"
                },
                {
                    "user_id": "Zach Fine",
                    "user_href": "/profile/Zach-Fine-1"
                },
                {
                    "user_id": "Martin Knopp",
                    "user_href": "/profile/Martin-Knopp-3"
                },
                {
                    "user_id": "Gail Starr",
                    "user_href": "/profile/Gail-Starr-4"
                },
                {
                    "user_id": "Gerry Jurrens",
                    "user_href": "/profile/Gerry-Jurrens-1"
                },
                {
                    "user_id": "Howard Shubs",
                    "user_href": "/profile/Howard-Shubs"
                },
                {
                    "user_id": "Dave Place",
                    "user_href": "/profile/Dave-Place-2"
                },
                {
                    "user_id": "J Mohon",
                    "user_href": "/profile/J-Mohon-1"
                },
                {
                    "user_id": "Michael Peacock",
                    "user_href": "/profile/Michael-Peacock-4"
                },
                {
                    "user_id": "Thomas Thornton",
                    "user_href": "/profile/Thomas-Thornton-5"
                },
                {
                    "user_id": "Billy Dalton",
                    "user_href": "/profile/Billy-Dalton-10"
                },
                {
                    "user_id": "Stephen Padley",
                    "user_href": "/profile/Stephen-Padley"
                },
                {
                    "user_id": "Noah Singer",
                    "user_href": "/profile/Noah-Singer-1"
                },
                {
                    "user_id": "Amy Bowersox",
                    "user_href": "/profile/Amy-Bowersox"
                },
                {
                    "user_id": "George Lentulo",
                    "user_href": "/profile/George-Lentulo"
                },
                {
                    "user_id": "Andrew Magill",
                    "user_href": "/profile/Andrew-Magill-1"
                },
                {
                    "user_id": "Justin Jayne",
                    "user_href": "/profile/Justin-Jayne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Netherton",
                "href": "/profile/Alex-Netherton"
            },
            "answer_text": "Depends on what you call affordable. And what you want to do. You can get a Baofeng (The Official Baofeng US Distributor) from eBay for around $28.00 US. With that, you can get on repeaters and talk locally, or if you have an Echolink repeater in your area, all over the world (through an Internet connection - you have to be licensed, as there is radio involved somewhere). Also, if you want Digital mobile radio, you can find a Tytera on eBay for around $100.00 US.All of this can be done with a Technician license: Getting Your Technician License Now, if you want to get into the thing where you are talking directly to other stations via Skywave or “skip”, then you will need a General license, and can likely get a QRP (low power) radio for around $300.00 US (Xiegu X1M Platinum QRP SSB/CW 00-80m Transceiver good HAM Radio 5 Band frequence). You can later spend a little and get a linear amp to go to 100 watts. You can also for about the same price get an older “hybrid” radio like the Kenwood TS-520 or TS-820. (I would stay away from the Yaesu FT-101, as it uses unobtainable tubes), or just go whole hog and get a Yaesu FT-857 for around $800.00. (WORTH IT!) UPDATE! You can get a VERY affordable radio from µBITX - HF SIGNALS, for like $129 US. Yes, it is a kit, but the modules are assembled, and it makes a nice starter radio, plus, you can get 100 watt amps on Ebay for not too much, and be on the air with a good moderate power signal. My suggestion, find a club in your area, get licensed, check with Hams in your area for equipment. You may be surprised. ",
            "date": "Updated December 8, 2019",
            "views": "23",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gerry Jurrens",
                    "user_href": "/profile/Gerry-Jurrens-1"
                },
                {
                    "user_id": "Howard Shubs",
                    "user_href": "/profile/Howard-Shubs"
                },
                {
                    "user_id": "Ron Wright",
                    "user_href": "/profile/Ron-Wright-41"
                },
                {
                    "user_id": "Tim Faulkner",
                    "user_href": "/profile/Tim-Faulkner-5"
                },
                {
                    "user_id": "Amy Bowersox",
                    "user_href": "/profile/Amy-Bowersox"
                },
                {
                    "user_id": "Konrad Roeder",
                    "user_href": "/profile/Konrad-Roeder"
                },
                {
                    "user_id": "Andrew Magill",
                    "user_href": "/profile/Andrew-Magill-1"
                },
                {
                    "user_id": "Cătălin Ghercoiaș",
                    "user_href": "/profile/Cătălin-Ghercoiaș"
                },
                {
                    "user_id": "Alex Perez",
                    "user_href": "/profile/Alex-Perez-2"
                },
                {
                    "user_id": "Mark Scrano",
                    "user_href": "/profile/Mark-Scrano-1"
                },
                {
                    "user_id": "Ben Bramlett",
                    "user_href": "/profile/Ben-Bramlett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Foster",
                "href": "/profile/Mark-Foster-318"
            },
            "answer_text": "Everything the other operators have written in his column are good to follow I agree with the baofeng radios as they're being cheap almost to the point of being disposable but they work well they do the job my biggest point with this whole hobby what I really love this building antennas. You can get pieces of wire I soldered together maybe a hundred pieces of wire to make an 80 meter loop, all scrap from wiring a house it was roughly 260 feet long I had a cheap mfj antenna tuner and my trusty old yaesu ft 101 that I bought for $100 and the first station I talked to from the big island of Hawaii was Israel. I love the fact that he had several thousand dollars invested in antenna tower and whatnot then I had a bunch of scrap wire throwing up in the trees.it's a great hobby you can get to know a lot of people from all over the world and you can even get involved in the community and such I'm pretty involved with civil defense and some other things as long as you know as a as a volunteer. You can spend as little or as much as you want it's still come up with a working station ",
            "date": "Answered October 7, 2019",
            "views": "375",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Shelton",
                "href": "/profile/Joshua-Shelton-48"
            },
            "answer_text": "Before you buy anything, get to know the hams in your area. They can help you know what are the more popular bands and modes in your area. Ask to look at and try out different setups that members have. You may find things you like and don’t like. If you are nice, they may even be able to hook you up with some of their used equipment for free. Heck, my club will give away a Baofung band HT once in a while. There are plenty of very low cost hand held units (HT for short) on the market. only thing I would ad is plan to get a computer programing cable. Many are difficult to setup on their own, but easy with a computer. Whatever you do get, a good rule of thumb is plan on spending as much money on the antenna as you do the radio. The antenna can make or break any radio. A cheap radio with a good antenna can outperform an expensive radio with a poor antenna. You don’t have to get super elaborate to start. A mag mount antenna on top of your car or refrigerator will help a basic hand held radio perform much better. I suggest checking out Nagoya antennas on Amazon. They have a good variety of low cost, well made antenna that perform very well. ",
            "date": "Answered January 21, 2020",
            "views": "391",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gail Starr",
                    "user_href": "/profile/Gail-Starr-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Konrad Roeder",
                "href": "/profile/Konrad-Roeder"
            },
            "answer_text": "It really depends on how you define “affordable”. Ham radio can be FREE if you know where to look and where to ask… What if you had NO money? Can you still enjoy ham radio as a beginner? YES!1) You can get your ham radio license for FREE. They have NEVER charged for a ham radio exam since 1984. Laurel VEC 2) Study for your technician, general and extra exams at QRZ.com3) You don’t have to buy a ham radio. Join a ham radio club that has a club station and no membership dues. There are many such clubs around. At the club station, you can begin by using their VHF and UHF gear. When you upgrade to a General license, you can use their HF gear as well.4) Find an “elmer” to help you into the hobby. Many will give novices some equipment to get on the air. I personally have given away ham radio equipment to at least a dozen new hams. Don’t be afraid to ask. Go to the library and ask any question you need on this Facebook group: Ham Radio Elmers5) Shop the online junk or used sales online. Don’t be afraid to post an ad on this Facebook group, explain your situation and simply ASK: JunkSale Amateur Radio Check Craigslist for estate sales. Often you can pick up all sorts of fun gear for FREE. What if you only had $50 for your radio and you live in town near a repeaterAlthough a Baofeng handheld is initially very appealing at $35.00 on Amazon, you will find that they often don’t have the power to get into the repeaters too well. Baofengs and other cheap Chinese rigs are really kid’s walkie-talkies opened up for the ham radio band. They are cheaply made and have issues like low receive sensitivity, excessive harmonics, poor audio, etc Look for a used Icom, Yaesu or Kenwood handheld 2Meter radio with at least the following features: 144–148MHz VHF, synthesized, CTCSS/PL tones What if you only had $150 to invest for your radio?Get yourself a used 2Meter rig for around $100 that has at least the following features: 144–148MHz VHF, synthesized, CTCSS/PL tones$25 Will buy you a 12V, 30A switching power supply$25 Will buy you a magnet mount antenna and a cookie sheet —See you on the air soon, Konrad, WA4OSH ",
            "date": "Answered April 30, 2017",
            "views": "62",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Van Dee Allen II",
                    "user_href": "/profile/Van-Dee-Allen-II"
                },
                {
                    "user_id": "José Araújo",
                    "user_href": "/profile/José-Araújo-19"
                },
                {
                    "user_id": "Russell Stringfield",
                    "user_href": "/profile/Russell-Stringfield"
                },
                {
                    "user_id": "Mark Smith",
                    "user_href": "/profile/Mark-Smith-3980"
                },
                {
                    "user_id": "David Merrick",
                    "user_href": "/profile/David-Merrick-3"
                },
                {
                    "user_id": "Martin Knopp",
                    "user_href": "/profile/Martin-Knopp-3"
                },
                {
                    "user_id": "Gail Starr",
                    "user_href": "/profile/Gail-Starr-4"
                },
                {
                    "user_id": "Danielle Evansic",
                    "user_href": "/profile/Danielle-Evansic"
                },
                {
                    "user_id": "Gerry Jurrens",
                    "user_href": "/profile/Gerry-Jurrens-1"
                },
                {
                    "user_id": "Howard Shubs",
                    "user_href": "/profile/Howard-Shubs"
                },
                {
                    "user_id": "Ron Wright",
                    "user_href": "/profile/Ron-Wright-41"
                },
                {
                    "user_id": "Aleksandar Ovnarski",
                    "user_href": "/profile/Aleksandar-Ovnarski"
                },
                {
                    "user_id": "Billy Dalton",
                    "user_href": "/profile/Billy-Dalton-10"
                },
                {
                    "user_id": "Michael Keyes",
                    "user_href": "/profile/Michael-Keyes-14"
                },
                {
                    "user_id": "Ryan Paradis",
                    "user_href": "/profile/Ryan-Paradis-5"
                },
                {
                    "user_id": "Amy Bowersox",
                    "user_href": "/profile/Amy-Bowersox"
                },
                {
                    "user_id": "Joseph Augustine",
                    "user_href": "/profile/Joseph-Augustine-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prakash",
                "href": "/profile/Prakash-301"
            },
            "answer_text": "Its possible using what you have and without spending nothing you can get on air if you have valid HAM license. If you have a old Windows 98(or ME) or higher desktop which can connect to internet lying useless, with microphone headset. You can install echolink(its been there since 2006 or earlier) to get on air by VoIP. The other VoIP options I also use(i have technician license) is CQ100 just to listen and CW (it has 30day trial) and Allstar(i have not been successful in communicating with allstar node). There is also hamsphere i have not tried hamspehere yet. If you can spend around 30$–50$ you can buy Baofeng Transceiver. But you need to be close to repeater within couple of blocks as i understand (unless if you are not in higher mountain regions). Apologies if my answer overlaps with someone who may have answered earlier. ",
            "date": "Answered August 29, 2018",
            "views": "905",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Billy Dalton",
                    "user_href": "/profile/Billy-Dalton-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "John S. Thomas",
                "href": "/profile/John-S-Thomas"
            },
            "answer_text": "Alex Netherton’s answer is quite good. I would add that Icom’s IC-781 covers all HF bands and modes, and is quite affordable, starting at around $600 new, or maybe $200 on eBay. ",
            "date": "Answered August 22, 2016",
            "views": "934",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rod Young",
                "href": "/profile/Rod-Young"
            },
            "answer_text": "Want all mode on 2 meter , 1.5 meter , and 0.70 meter? HamShield for Arduino (VHF/UHF transceiver) Radio Shield 2 for Arduino It can be done for the cost of an arduino and an expansion board. ",
            "date": "Answered July 25, 2016",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Waqar Hussain",
                    "user_href": "/profile/Waqar-Hussain-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tertius Baardwijk",
                "href": "/profile/Tertius-Baardwijk"
            },
            "answer_text": "RTL-SDR dongle would be the cheapest option for the radio. If you need transceiver then just go with Baofeng for VHF/UHF and µBITX - HF SIGNALS for HF (some building skills will be needed). ",
            "date": "Answered April 18, 2019",
            "views": "390",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Walters Esq",
                "href": "/profile/Stephen-Walters-Esq"
            },
            "answer_text": "Assuming HF. Bitx-40 The home of BITX transceivers ",
            "date": "Answered July 11, 2017",
            "views": "516",
            "upvotes": " Answer requested by Akram Hawere"
        }
    ]
}