{
    "title": "What is OpenTok and how does it work? - Quora",
    "tags": [
        "Streaming Video Content"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian Small",
                "href": "/profile/Ian-Small"
            },
            "answer_text": "OpenTok is a platform that allows developers to weave live, group video chat directly into their web experience - in whatever manner makes most sense to their web application. The platform comprises an easy-to-use self-service API (available in JavaScript or Flash AS3) and a cloud infrastructure that provides routing, messaging and signal processing support. OpenTok blows up the traditional video conferencing model by giving the developer complete control over chat topology and user experience.  The publish/subscribe model lets developers implement 1-1, group, 1:many, random pairings, many:1, and even more types of chat.  Having individual control over the layout, sizing and animation of each individual video stream allows the video chat to be a native, fully-integrated part of the web experience. The developer uses the API to write an app.  TokBox runs the cloud infrastructure that makes it all happen. By taking the complexity of operating and running a real-time video chat infrastructure off the developers' plate, OpenTok lowers the barrier to integrating video chat.  By placing the vast majority of the video chat application logic at the client layer, OpenTok allows any moderately savvy web developer to create pretty slick experiences.  More info available here:  http://www.tokbox.com/opentok/tools/gettingstarted ",
            "date": "Answered April 2, 2011",
            "views": "111",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "B Sai Ashish",
                    "user_href": "/profile/B-Sai-Ashish"
                },
                {
                    "user_id": "Sonia Caetano",
                    "user_href": "/profile/Sonia-Caetano-1"
                },
                {
                    "user_id": "Ron Park",
                    "user_href": "/profile/Ron-Park-2"
                },
                {
                    "user_id": "Conner Tolley",
                    "user_href": "/profile/Conner-Tolley"
                },
                {
                    "user_id": "Arnon Ilani",
                    "user_href": "/profile/Arnon-Ilani"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Joseph Quattrocchi",
                    "user_href": "/profile/Joseph-Quattrocchi"
                },
                {
                    "user_id": "Charlie Cheever",
                    "user_href": "/profile/Charlie-Cheever"
                },
                {
                    "user_id": "Seb Paquet",
                    "user_href": "/profile/Seb-Paquet"
                },
                {
                    "user_id": "Edmond Lau",
                    "user_href": "/profile/Edmond-Lau"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Frisk",
                "href": "/profile/Daniel-Frisk-1"
            },
            "answer_text": "OpenTok is great because users can do a video call practically without knowing how to use a computer. A video call or video meeting is directly accessed through the web browser without having to download or install anything, and there is no software to update. People can join a meeting just by going to the right web address without signing up for anything. The Opentok API is free, so anyone can integrate live group video for a customized online experience (however you do have to pay TokBox to do 3+ people video calls). You can see some of the neat ways people are using OpenTok in theOpenTok gallery.    The Story Behind OpenTok Opentok was born when TokBox decided to change business strategies. Instead of marketing its struggling consumer video conference product, TokBox created an SDK (i.e. OpenTok) that allowed companies to embed a video conference component into their website. (This is the similar strategy used byMeebo*, another Sequoia Capital funded startup.) So what happened to TokBox? Founded in 2008, TokBox was red hot to the investors. TokBox believed that by using Flash (the same technology behind YouTube) it could become the YouTube of real-time video conferencing. The sell worked and TokBox raised $33M from some of the biggest names, including Jawed Karim, co-founder of YouTube, Roelof Botha of Sequoia Capital, and the late Rajeev Motwani, who played a key role in getting Google going. They also received additional investment from Bain Capital Ventures, founded by presidential candidate Mitt Romney. The problem with Flash is that while it's great for broadcast video such as YouTube, where delays up to a few seconds are acceptable, it's simply terrible for video conferencing. We have always thought that Flash would be the death of TokBox. In full disclosure, VSee CEO Dr. Milton Chen had also approached TokBox investors Sequoia Capital and Bain Capital for investment, and they turned him down saying that Flash was the final story on video conferencing and anything not Flash-based would fail. Even with a move to WebRTC, OpenTok's long term company health is still in question. After all, there are numerous WebRTC-based video conferencing providers, TenHands and OnTheAir, to name a few. Besides, Google will also provide WebRTC native integration and SDK, so it is unclear why anyone would pay OpenTok anything when it can get it free from Google. [In fact, since this article was first written TokBox has been acquired by telecomm giant Telefónica Digital (@tefdigital) for an undisclosed price.] Dr. Chen says, \"despite our differences, I have always liked TokBox and its people. I actually got to know former TokBox CEO, Nick Triantos, who is one of the most talented entrepreneurs I know and a super nice person to boot.\" And related info: Mobile chat app development  Creating an iPhone video chat app using Parse and Opentok (tokbox) | Objective-C  Skype vs. OpenTok: Which Video Platform Should You Use?  ",
            "date": "Answered December 22, 2015",
            "views": "32",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shashank",
                    "user_href": "/profile/Shashank-4"
                },
                {
                    "user_id": "Alvin Villegas",
                    "user_href": "/profile/Alvin-Villegas-1"
                }
            ]
        }
    ]
}