{
    "title": "What is cloud computing? Why is it used and for what purposes? - Quora",
    "tags": [
        "Cloud Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keshav",
                "href": "/profile/Keshav-281"
            },
            "answer_text": "Cloud computing means storing and accessing data and programs over the internet instead of your computer's hard drive. In the past, people would run applications or programs from software downloaded on a physical computer or server in their building. Cloud computing allows people access to the same kinds of applications through the internet. Cloud computing is based on the premise that the main computing takes place on a machine, often remote, that is not the one currently being used. Data collected during this process is stored and processed by remote servers (also called cloud servers). This means the device accessing the cloud doesn't need to work as hard. By hosting software, platforms, and databases remotely, the cloud servers free up the memory and computing power of individual computers. Users can securely access cloud services using credentials received from the cloud computing provider. Cloud Services-  Software-as-a-Service (SaaS): Instead of users installing an application on their device, SaaS applications are hosted on cloud servers, and users access them over the Internet. SaaS is like renting a house: the landlord maintains the house, but the tenant mostly gets to use it as if they owned it. Examples of SaaS applications include Salesforce, MailChimp, and Slack. Platform-as-a-Service (PaaS): In this model, companies don't pay for hosted applications; instead they pay for the things they need to build their own applications. PaaS vendors offer everything necessary for building an application, including development tools, infrastructure, and operating systems, over the Internet. PaaS can be compared to renting all the tools and equipment necessary for building a house, instead of renting the house itself. PaaS examples include Heroku and Microsoft Azure. Infrastructure-as-a-Service (IaaS): In this model, a company rents the servers and storage they need from a cloud provider. They then use that cloud infrastructure to build their applications. IaaS is like a company leasing a plot of land on which they can build whatever they want – but they need to provide their own building equipment and materials. IaaS providers include DigitalOcean, Google Compute Engine, and OpenStack. Function-as-a-Service (FaaS): FaaS, also known as serverless computing, breaks cloud applications down into even smaller components that only run when they're needed. Imagine if it were possible to rent a house one little bit at a time: for instance, the tenant only pays for the dining room at dinner time, the bedroom while they're sleeping, the living room while they're watching TV, and when they aren't using those rooms, they don't have to pay rent on them. Uses & Purpose- One of the cloud's most basic functions is file storage. Using a cloud storage solution, you can store and access any of your important files, all from the cloud. This allows you to access your files from any computer that has an Internet connection. This should offer flexibility, especially for employees while they are traveling. Most cloud providers utilize robust security policies to ensure that your data remains safe in the cloud.Disaster recovery can be extremely difficult for small businesses. In fact, many businesses would have to go out of business if they lost all of their important data in a disaster. By hosting your data in the cloud, you’re protected from any type of disaster – big or small.Another use of cloud computing similar to disaster recovery is backup. Most small business owners do not have proper backups in place should something happen to one of their computer systems. By utilizing a cloud solution, all of your data is backed up and protected in the cloud, should a problem arise at any time.One of the major concerns of every business, regardless of size and industry, is the security of its data. Data breaches and other cybercrimes can devastate a company's revenue, customer loyalty, and brand positioning. Cloud offers many advanced security features that guarantee that data is securely stored and handled. Cloud storage providers implement baseline protections for their platforms and the data they process, such as authentication, access control, and encryption. From there, most enterprises supplement these protections with added security measures of their own to bolster cloud data protection and tighten access to sensitive information in the cloud.Cloud services are available on-demand and often bought on a \"pay-as-you-go\" or subscription basis. So you typically buy cloud computing the same way you'd buy electricity, telephone services, or Internet access from a utility company. Sometimes cloud computing is free or paid-for in other ways. Just like electricity, you can buy as much or as little of a cloud computing service as you need from one day to the next.So, Coming to the conclusion, Enterprises recognize cloud computing benefits and see how they impact their production, collaboration, security, and revenue. By using a cloud-based solution, an enterprise can prevent a lot of problems that plague organizations that rely on on-premises infrastructure. ",
            "date": "Updated August 22, 2020",
            "views": "676",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "M Anjani",
                    "user_href": "/profile/M-Anjani-1"
                },
                {
                    "user_id": "Shiva Ranjani",
                    "user_href": "/profile/Shiva-Ranjani-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sujit Senapati",
                "href": "/profile/Sujit-Senapati-6"
            },
            "answer_text": "Hi Ashish, Cloud Computing is the use of hardware and software to deliver a service over a network (typically the Internet). With cloud computing, users can access files and use applications from any device that can access the Internet. Haven’t you used storage devices on internet like google storage, your mobile service provider offers to store all of your details like, contacts, msgs etc. All these are stored and saved in cloud storage and can be rendered when if in any case you lose your data physically. Cloud computing is becoming the default option for many apps: software vendors are increasingly offering their applications as services over the internet rather than standalone products as they try to switch to a subscription model. However, there is a potential downside to cloud computing, in that it can also introduce new costs and new risks for companies using it. The very basic usage as I mentioned above is your Gmail. Google stores your data in their cloud storage and retrieves it for you when needed. Apart from that cloud computing is highly in demand considering major businesses have tons and tons of data and they need to keep it stored safely and securely where cloud storage comes in play. Cloud computing is not all about storage alone as you have many other things to do like, Network administration Storage Cloud architecture building etc Hope you got your answer. Cheers. ",
            "date": "Answered April 5, 2019",
            "views": "216",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ashish Magar",
                    "user_href": "/profile/Ashish-Magar-19"
                }
            ]
        }
    ]
}