{
    "title": "What are the capabilities of a computer? - Quora",
    "tags": [
        "Computer Science Education",
        "Computer Science",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Satya Venkata Ramana",
                "href": "/profile/Satya-Venkata-Ramana"
            },
            "answer_text": "The first computer was ENIAC (Electronic Numerical Integrator and Computer). It occupied about 1,800 square feet. Though it was very helpful during those times, it wasn’t very efficient. It weighed almost 50 tons. Computers have evolved a lot since then but just as every coin has two sides i.e, Capabilities and Limitations of Computer Systems. Let us understand them more clearly. Capabilities of Computer System Capabilities of a computer system are the qualities of the computer that put it in a positive light and make the user experience more efficient.  Speed Speed means the duration computer system requires in fulfilling a task or completing an activity. It is well-known that computers need very little time than humans in completing a task. Generally, humans take into account a second or minute as a unit of time. Nevertheless, computer systems have such fast operation capacity that the unit of time is in fractions of a second. Today, computers are capable of doing 100 million calculations per second and that is why the industry has developed Million Instructions per Second (MIPS) as the criterion to classify different computers according to speed. Accuracy Accuracy means the level of precision with which calculations are made and tasks are performed. One may invest years of his life in detecting errors in computer calculations or updating a wrong record. A large part of mistakes in Computer Based Information System(CBIS) occurs due to bad programming, erroneous data, and deviation from rules. Humans cause these mistakes. Errors attributable to hardware are generally distinguished and corrected by the computer system itself. The computers rarely commit errors and do all types of tasks precisely. Reliability Reliability is the quality due to which the user can stay dependable on the computer. Computers systems are well-adjusted to do repetitive tasks. They never get tired, bored or fatigued. Hence, they are a lot reliable than humans. Still, there can be failures of a computer system due to internal and external reasons. Any failure of the computer in a highly automated industry is disastrous. Hence, the industry in such situations has a backup facility to take over tasks without losing much of the time. Adaptability Adaptability of computer system means the quality of it to complete a different type of tasks: simple as well as complex. Computers are normally versatile unless designed for a specific operation. Overall, a daily purpose computer is used in any area of application: business, industry, scientific, statistical, technological and so on A general purpose computer, when introduced in a company, can replace the jobs of multiple specialists due to its flexibility. A computer system can replace the functions of all these specialists because of being very versatile. Storage Storage is the ability of the computer to store data in itself for accessing it again in future. Nowadays, apart from having instantaneous access to data, computers have a huge ability to store data in a little physical space. A general computer system has a capacity of storing and providing online millions of characters and thousands of pictures. It is obvious from the above discussion that computer capabilities outperform the human capabilities. Therefore, a computer, when used rightfully, will tenfold the effectiveness of an organization. Limitations of Computer Systems Limitations are the drawbacks of the computer system in which humans outperform them. Lack of common-sense This is one of the major limitations of computer systems. No matter how efficient, fast and reliable computer systems might be but yet do not have any common sense because no full-proof algorithm has been designed to programme logic into them. As computers function based on the stored programme(s), they simply lack common sense. Zero IQ Another of the limitations of computer systems is that they have zero Intelligence Quotient (IQ). They are unable to see and think the actions to perform in a particular situation unless that situation is already programmed into them. Computers are programmable to complete each and every task, however small it may be. Lack of Decision-making Decision-making is a complicated process involving information, knowledge, intelligence, wisdom, and ability to judge. The computer system does not have the ability to make decisions on their own because they do not possess all the essentials of decision-making. They can be programmed to take such decisions, which are purely procedure-oriented. If a computer has not been programmed for a particular decision situation, it will not take a decision due to lack of wisdom and evaluation faculties. Human beings, on the other hand, possess this great power of decision-making. Thanks for scrolling down… ",
            "date": "Answered December 23, 2018",
            "views": "67",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muhammed Huzaifa",
                    "user_href": "/profile/Muhammed-Huzaifa-3"
                },
                {
                    "user_id": "Gheorghe Matei",
                    "user_href": "/profile/Gheorghe-Matei-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dani Richard",
                "href": "/profile/Dani-Richard"
            },
            "answer_text": "The capabilities of a computer is computation. A computer is capable to both numerical and symbolic computation. When electronic digital computers became available, many of the human computers become programmers. They converted the manual methods into computer programs. The practical limits of computation are question of time and money. For many problems time of computation may be made shorter by using more computers or specialized hardware. Such solutions involve more design effort (money) and hardware (more money). As to theoretical limits of computation that is found study of “computability.” References: “When Computers Were Human” by Grier “Computation: Finite and Infinite Machines” by Marvin Minsky ",
            "date": "Answered November 21, 2019",
            "views": "43",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bill Morrisson",
                    "user_href": "/profile/Bill-Morrisson"
                },
                {
                    "user_id": "Parth Thakore",
                    "user_href": "/profile/Parth-Thakore-8"
                },
                {
                    "user_id": "Michiel Kamphuis",
                    "user_href": "/profile/Michiel-Kamphuis-1"
                },
                {
                    "user_id": "Mourya Venkat",
                    "user_href": "/profile/Mourya-Venkat-1"
                }
            ]
        }
    ]
}