{
    "title": "What are the extra benefits of a smart TV? - Quora",
    "tags": [
        "Benefits",
        "Smart TVs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Juhi Nebhnani",
                "href": "/profile/Juhi-Nebhnani-2"
            },
            "answer_text": "Smart TVs are internet connected devices that offer a wide range of on-demand content. That’s right, you can watch all that Netflix, Hotstar, Hulu,etc on one platform. Just be smart about choosing that smart TV. Smart TVs have been in the market for a while now. And there are many speculations on whether it is a smart move to buy a smart TV. Let’s take a look at why buying Smart LED TV is a great idea: Smart TVs are not getting smarter by the day. They have started coming with voice assistants that eliminate the major problem of actually typing in your request letter by letter. Most high end televisions were given the internet connectivity and thus it implies you have some very good features in terms of sound and picture quality. Today Smart TVs are getting smart home features as they are internally connected with many other home devices like bulbs, door locks, and more such sensor devices. Many Smart TVs even have a dashboard for the same. Smart TVs offer many inbuilt apps and some smart TVs also come with their own operating system. This means they have their own dedicated store from where you can download other apps. Most Smart TVs have in built games and social media apps which is just meant for a better User experience. Moreover, many manufacturers are coming up with software updates for these smart TVs and this usually means good news and a lot of bug fixes. ",
            "date": "Answered May 3, 2019",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohd Imran",
                "href": "/profile/Mohd-Imran-30"
            },
            "answer_text": "Whether you want to access TV on demand, surf the web or stream films, these are all things you can do with a smart TV. Offering you extra features to those provided by a standard television, there are so many reasons why you should upgrade your TV to smart.Here are the benefits of a smart TV. 1-Get Access to Your Choice of Apps(Netflix and Amazon,etc.) 2-Never Miss Your Favourite Shows( 3-Keep In Touch With Your Friends(Facebook or Twitter) 4-Browse The Web From Your Living Room 5-Watch Home Videos And View Photo Slideshows 6-Customise Your Homescreen 7-Get Personalised Recommendations 8-Play Games To Your Heart’s Content 9-You Can Use It For Skype 10-It Connects To Other Devices In Your Home ",
            "date": "Answered June 15, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pankaj Kumar Sah",
                    "user_href": "/profile/Pankaj-Kumar-Sah-42"
                }
            ]
        }
    ]
}