{
    "title": "What's so bad about genetically modified humans? - Quora",
    "tags": [
        "Physics and Biology",
        "Genetically Modified Foods",
        "Genetically Modified Organisms (GMO)",
        "Genetic Engineering",
        "Biology",
        "Finance"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Steele",
                "href": "/profile/Sean-Steele-3"
            },
            "answer_text": "So I don't have time to give a full answer some I'm sitting at the dmv... wait actually I might have time then... Jokes aside if I get time later I will give a more complete answer unless someone else beats me to it. But here is my take... So to be forthright I am actually for some genetic modification, I think as a whole it is definetly a good thing. Eliminating genetic diseases that ruin lives. Or being able to ensure a person has a longer and healthier life than they would have, or just making sure someone doesn't go bald at age 18 if they don't want to. The problem is one simple question: where do you draw the line and how? Especially at first this will be a plaything for geneticists then the rich then much later on everyone else. Once it's easy for all then honestly I believe there is little wrong with it except personal morals and conflicts with it. But it will be a very long time after the rich have it before anyone can have it. So the real problem is who do you allow to have modifications and what kind of modifcations. Can a parent choose eye color or only stop life threatening diseases? Can a person choose to make sure their child won't need glasses or must it be limited to life threatening diseases? Where is the line? Cosmetic enhancement? Quality of life? Life or death disease? It's hard to say if all some or any will be allowed. This debate will make it look like everyone was getting along during the abortion debates. But that's just the first hurtle. And in my mind insignificant. The real problem is when it is legal you know people will push the law, and some out there will get full designer babies. But those will be the affluent only to start (maybe forever). So let's put law aside and just look at what might happen if people get full reign over their children's genetics. It doesn't matter who is getting enhancement, what matters is that some will and some will not and that's the problem. We already know people are NOT born equal at all, but there is little we can do with it, which makes it pretty much excusable and easy to treat others equally. But with genetic enhancement the inherent inequality will be ridiculous. A whole class of people could be borne more resistant to disease, smarter, stronger, and plenty more. Look at what people already did to slaves, or Jews in WWII. People said they were inferior and people believed. But now people will truly be inferior to others, which will make it that much easier to oppress the poor and anyone else without enhancement. Slavery could return. Even if it doesn't, those with enhancement could have such an advantage that those without become virtually useless driving them more into despair. Especially if robots take off and eliminate unpleasant jobs. That would leave the unaltered potentially 100% purposeless and uncared for. (Revolution anyone?) But who would win the revolution? The enhanced would most likely. It would be similar to the terminator movies I would imagine, except instead of robots vs people it's enhanced vs nonenhanced. It's an all new kind of class warfare with unimaginable consequences. This same scenario could happen between rich nations and poor as well.(True super solders baby!!! But is that good? Definately depends...) Let's step back now. What if it's legal but heavily regulated. Even if a few super humans slip through the cracks and illegally modify themselves, it's unlikely there would be enough to truly dominate the rest. But what if only certain procedures allowed? Such as only removing trisomy diseases, or very life threatening ones? What will the parents of children who have some genetic disease that leaves them blind by age 10 but since it wasn't life threatening they couldn't fix their child? Law suits. Lots of law suits. This group of people would likely be very vocal. And in reality it probably won't be a big deal. But if they gain a loud enough voice they will end up legalizing more and more modifications until we get the unrestricted version above with ultimate class warfare.(unless this buys enough time to make the procedures cheaper for most to afford) I think this gradual situation is most likely to occur. It will also be the most irritating as every night the news will either be \"this poor mom was denied modification of her child leaving the child in horrid pain for his whole life\" or \"this child was allowed modification he shouldn't have had, damn the rich thinking they can make them selves superior!\" OR any other conflict like this, I'm sure you can imagine the controversy. So ultimately I think if handled right modifications could be the saving grace for humanity and could truly result in vast improvements. But the certain political conflict alone greatly interferes with this, and if lefts totally unchecked it will result in a new kind of class warfare or international warefare that could litterally lead to true warfare. So the problem truly is people won't handle modifications properly (because no one truly knows what the proper way to handle them is) and there is a lot of uncertainty for what they could mean for humanity as a whole. That's my opinion on the matter anyway, this is definately a topic worthy of much intense debate. Especially since it's reality comes nearer everyday. Again I'll give a more complete answer if anyone wants it later, unless someone beats me to it. And excuse any bad grammer, writing on a phone in the DMV is suboptimal conditions. (If there is any unintelligible sentences though let me know and my appologies) ",
            "date": "Answered July 26, 2016",
            "views": "11",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angela Boyd",
                    "user_href": "/profile/Angela-Boyd-4"
                },
                {
                    "user_id": "Sarahí Aguilar",
                    "user_href": "/profile/Sarahí-Aguilar"
                },
                {
                    "user_id": "Jeff Persons",
                    "user_href": "/profile/パーソンズ-ジェフ-Jeff-Persons"
                },
                {
                    "user_id": "Bob Dee",
                    "user_href": "/profile/Bob-Dee-3"
                },
                {
                    "user_id": "Travis S. Allen",
                    "user_href": "/profile/Travis-S-Allen"
                },
                {
                    "user_id": "Qaqambile Linganiso",
                    "user_href": "/profile/Qaqambile-Linganiso"
                },
                {
                    "user_id": "Stephen Morgan",
                    "user_href": "/profile/Stephen-Morgan-41"
                },
                {
                    "user_id": "Glenn Rager",
                    "user_href": "/profile/Glenn-Rager"
                },
                {
                    "user_id": "Philip Bowles",
                    "user_href": "/profile/Philip-Bowles-1"
                },
                {
                    "user_id": "Alex Randomkat",
                    "user_href": "/profile/Alex-Randomkat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sriram Selvakumar",
                "href": "/profile/Sriram-Selvakumar-3"
            },
            "answer_text": "The issue of the incorporation of genetic manipulation of the human genome is a widespread issue that poses controversial questions that are ethical in form. There aren’t any cons when it comes to genetically modified babies. However, there are quite a few advantages such as the elimination of several genetically inherited diseases such as Tay-Sach’s disease, hemophilia, and so on. If we use the power to genetically modify babies in a proper way that is intended towards the elimination of genetic diseases and disorder then I believe that there would be no disadvantages. However, I believe that the notion of genetically modifying babies is not going to settle into the eyes of the public any time soon. I, myself, have a neutral opinion on this issue and consider both sides to be fair in the arguments that they bring up. If this technology were able to be used by parents then they may make unrealistic claims and demands which can be hard to address.Moreover, the number of regulations that need to be made and communicated are large because of the ethical consequences that underlay these actions. ",
            "date": "Answered February 20, 2017",
            "views": "615",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hannah MacAndrews",
                "href": "/profile/Hannah-MacAndrews"
            },
            "answer_text": "It depends on whether or not you’re a Christian Scientist, Put it this way. If you wanted children, would you marry someone who’s a perfect match for you in every way— except they’re a dominant carrier for diabetes, hemophilia, cancer, Down Syndrome, and every other congenital disease in history? Or would youchoose someone you like just as much, but had no such family history?Because it’s the same choice with gene-therapy. Every single congenital illness can be cured; but only real ignoramorons would say it’s God’s Will they should suffer from it to “be like daddy or mommy.” Yeah, I guess it must be God’s Will; if He created dumbasses who turn down a goddam miracle. ",
            "date": "Answered November 30, 2018",
            "views": "519",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mithoon Padmanabhn",
                    "user_href": "/profile/Mithoon-Padmanabhn"
                },
                {
                    "user_id": "Thomas Heo",
                    "user_href": "/profile/Thomas-Heo-2"
                },
                {
                    "user_id": "Kai Jie Soo",
                    "user_href": "/profile/Kai-Jie-Soo-1"
                },
                {
                    "user_id": "Jared Gillespie",
                    "user_href": "/profile/Jared-Gillespie-4"
                },
                {
                    "user_id": "Greg Mummah",
                    "user_href": "/profile/Greg-Mummah"
                },
                {
                    "user_id": "James Johnson",
                    "user_href": "/profile/James-Johnson-682"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avrajit Chakraborty",
                "href": "/profile/Avrajit-Chakraborty"
            },
            "answer_text": "Almost nothing! but what modification and why? who will decide? govt? military? economy? Can I “grow” genetically modified humans for extracting organs, bloods, bones or some experiment. It will be a good business! Do I use any female to use as a surrogate? as I don’t have total technological cocoons to develop a human baby. These are few preliminary question need to be resolved before we can start for a genetically modified humans. ",
            "date": "Answered November 10, 2018",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Travis S. Allen",
                "href": "/profile/Travis-S-Allen"
            },
            "answer_text": "Genetically modified humans may taste better but are probably less healthy than non GMH. Okay I'm done, carry on. ",
            "date": "Answered July 26, 2016",
            "views": "230",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Persons",
                    "user_href": "/profile/パーソンズ-ジェフ-Jeff-Persons"
                },
                {
                    "user_id": "Marcus Bruijstens",
                    "user_href": "/profile/Marcus-Bruijstens"
                },
                {
                    "user_id": "Michelle Shao",
                    "user_href": "/profile/Michelle-Shao-6"
                },
                {
                    "user_id": "Philip Bowles",
                    "user_href": "/profile/Philip-Bowles-1"
                },
                {
                    "user_id": "Guthrie Devine",
                    "user_href": "/profile/Guthrie-Devine"
                },
                {
                    "user_id": "Alex Randomkat",
                    "user_href": "/profile/Alex-Randomkat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard Peek",
                "href": "/profile/Bernard-Peek"
            },
            "answer_text": "Genetic modification of humans is still experimental. Medical experimentation on humans is only permitted if they give their informed consent. Embryos can’t give informed consent. ",
            "date": "Answered January 16, 2019",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Harvey",
                    "user_href": "/profile/Robert-Harvey-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arthur Doucette",
                "href": "/profile/Arthur-Doucette"
            },
            "answer_text": "GMO babies don’t cry, sleep through the night and change their own diapers. ",
            "date": "Answered November 23, 2016",
            "views": "87",
            "upvotes": "0"
        }
    ]
}