{
    "title": "What is your UPSC Mains ethics strategy? - Quora",
    "tags": [
        "Exam Strategy",
        "UPSC Mains",
        "Ethics",
        "Union Public Service Commission of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kunal Dev",
                "href": "/profile/Kunal-Dev-29"
            },
            "answer_text": "The close examination of GS paper 4 2018 question paper will amply clear the fact that for Ethics paper UPSC had started wading candidates in deep waters of theoretical underpinnings of topics mentioned in syllabus. Technical questions are being asked in jargon free simple language..see below question paper analysis and references from book as proof of the statement. Also the approach of cramming case studies like a weak students of maths who crams solutions and theorems instead of conceptual clarity will not work. This worked till previous year, and now may not yield impressive and rank improving marks. A interesting takeaway from Mains 2018 is reference book for GS paper 4 (Ethics, Integrity, and Aptitude in Governance) published by SAGE publicationsthatcovered directly 240 Marks from UPSC mains in 2018.  All questions and one case study in paper 4 and six questions from paper 2 Seeing is believing GS Paper 4 2018.Section A 1. (a) State the three basic values, universal in nature, in the context of civil services and bring out their importance. (150 words) Reference: The questions seems to be directly picked from the book by SAGE publications. Three foundational values of public service Page-58-59 also see Page-70 where similar question appears in Review question section. (b) Distinguish between “Code of ethics” and “Code of conduct” with suitable examples.(150 words) Reference: See Page-233 also see Page-254 where a similar question appears in Review questions section. 2. (a) What is mean by public interest? What are the principles and procedures to be followed by the civil servants in public interest? (150 words) Reference: See Page-122 for classic interpretation of public interest by Paul Appleby also see Page-137-139 on principles and procedure to be followed in public interest enumerated by Gerald Caiden. (b) “The Right to Information Act is not all about citizens’ empowerment alone, it essentially redefines the concept of accountability. Discuss. (150 words) Reference: The only book that discuss how RTI is Constituency accountabilty See Page-109 also see Pagese-113 for its redefining role and challenges as “excess of democratic control ” 3. (a) What is mean by conflict of interest? Illustrate with examples, the difference between the actual and potential conflicts of interest. (150 words) Reference: See Page-154, 156 also see Page-16 4(b) “In looking for people to hire, you look for three qualities: integrity, intelligence and energy. And if they do not have the first, the other two will kill you.” – Warren BuffettWhat do you understand by this statement in the present-day scenario? Explain. (150 words) Reference: See Page-76, 81 also see Page-1624. (a) “In doing a good thing, everything is permitted which is not prohibited expressly or by clear implication”. Examine the statement with suitable examples in the context of a public servant discharging his/her duties. (150 words) Reference: See Page-96-97 also see Page-126 how a structured and substantial answer can be written for this question rather than shallow one. (b) With regard to the morality of actions, one view is that means is of paramount importance and the other view is that the ends justify the means. Which view do you think is more appropriate? Justify your answer. (150 words) Reference: See Page-32 for debate between Act and Rule utilitarianism also see Page-40 for the limitations of this dichotomy and reemergence of virtue ethics in 21 st century. 5. (a) Suppose the Government of India is thinking of constructing a dam in a mountain valley bond by forests and inhabited by ethnic communities. What rational policy should it resort to in dealing with unforeseen contingencies (150 words) Reference: See Page-33 Environmental ethics (b) Explain the process of resolving ethical dilemmas in Public Administration. (150 words) Reference: See Page-74-77 for four pronged strategy of resolving ethical dilemmas also see Page-84 for similar question in Review questions section. 6. What do each of the following quotations mean to you in the present context? (a) “The true rule, in determining to embrace, or reject anything, is not whether it has any evil in it; but whether it has more evil than good. There are few things wholly evil or wholly good. Almost everything, especially of governmental policy, is an inseparable compound of the two; so that our best judgement of the preponderance between them is continually demanded. ”Abraham Lincoln ( 150 words) Reference: See Page-62 for concept of Administrative Evil paraphrased in the quotation of Lincon. b) “Anger and intolerance are the enemies of correct understanding. “ _ Mahatma Gandhi (150 words) Reference: See Page-18-19 also see Page-515 how anger acts as moral emotion resulting in paradigm changes in individual and society. (c) “Falsehood takes the place of truth when it results in unblemished common good.” _ Tirukkural (150 words) Reference: See Page-129 Common Good and its evolution and similar question on page 132. Wonderfully one case study is similar pick from book discussing Clive Ponting case and the case study is one of parallax and not dilemma. CASE STUDY.Edward Snowden, a computer expert and former CIA administrator, released confidential Government documents to the press about the existence of Government surveillance programmes. According to many legal experts and the US Government, his action violated the Espionage act of 1971, which identified the leak of State secret as an act of treason. Yet, despite the fact that he broke the law, Snowden argued that he had a moral obligation to act. He gave a justification for his “whistle blowing” by stating that he had a duty “to inform the public as to that which is done in there name and that which is done against them.”According to Snowden, the Government’s violation of privacy had to be exposed regardless of legality since more substantive issues of social action and public morality were involved here. Many agreed with Snowden. Few argued that he broke the law and compromised national security, for which he should be held accountable.Doyou agree that Snowden’s actions were ethically justified even if legally prohibited? Why or why not? Make an argument by weighing the competing values in this case (250 words ) Reference: Case of parallax See Page-72-73 also Page 95 Epikeia The other case studies can be answered also in framework of concepts discussed inbook .Interestingly the book also covered six questions from paper 2 in 2018 GS PAPER 2 UPSC 2018 Why do you think the committees are considered to be useful for parliamentary work? Discuss, in this context, the role of the Estimates Committee. (10) Reference : Page 338 for first part under accountability to Parliament and page 339 for second part of question. 5.The Comptroller and Auditor General (CAG) has a very vital role to play.” Explain how this is reflected in the method and terms of his appointment as well as the range of powers he can exercise (10) Reference : Page 335 and 336 adequately covers CAG institution. 6. \"Policy contradictions among various competing sectors and stakeholders have resulted in inadequate ‘protection and prevention of degradation to environment.” Comment with relevant illustrations. Reference : Page 36 illustrates significance of environmental ethics and ecological conscience in protection of environment and policy effectiveness. 8.E-governance in not only about utilization of the power of new technology, but also much about critical importance of the ‘use value’ of information. Explain. (10) Reference : Page 303 twin complementary goals of E-governance and Page 309 on issues in adoption. 13. Indian and USA are two large democracies. Examine the basic tenets on which the two political systems are based .Reference: Page 431–435. See under Liberalism three foundational tenets and three core pillars of liberal democracies. 18. The Citizen’s Charter is an ideal instrument of organisational transparency and accountability, but it has its own limitations. Identify the limitations and suggest measures for greater effectiveness of the Citizen’s Charters. (15) Reference : Page 282-283 in Conclusion section the limitations and measures have been discussed under hard and soft model of citizens charter. Similar question appears in Review questions section of the book. ",
            "date": "Answered November 17, 2018",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Purushottam Abhishek",
                    "user_href": "/profile/Purushottam-Abhishek"
                },
                {
                    "user_id": "Sriram Kausik",
                    "user_href": "/profile/Sriram-Kausik"
                }
            ]
        }
    ]
}