{
    "title": "What have been the advantages you got from buying your iPhone directly from Apple? - Quora",
    "tags": [
        "Apple (company)",
        "iPhones (product)",
        "Apple Products and Services",
        "Shopping",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter Grant",
                "href": "/profile/Walter-Grant-6"
            },
            "answer_text": "I purchased a completely unlocked iPhone for cash with Apple’s return privileges if I didn’t like it. Additionally, the unlocked version had a better modem chipset (Qualcomm, not Intel) that was better performing on GSM/LTE networks and worked on all networks. I didn’t need to commit to a contract that also locked me to the carrier for 18–24 months with early termination fees. If I travel (even in the US) I want to be able to switch the SIM, if necessary, to a carrier that works in the area I’ll be visiting (without exorbitant charges.) My carrier—AT&T in the US—refused to sell me an unlocked Phone even if i paid cash upfront. Plus the AT&T version of the iPhone used the inferior Intel chipset. Not selling unlocked phones continues to be an AT&T issue. My daughter went to the AT&T store during the CoVID lockdown in April-May 2020 and the iPhone she got was not only locked to AT&T but they would not allow her to pay cash for it. Had to lock herself into a 2 year payment contract. ",
            "date": "Answered October 23, 2020",
            "views": "83",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nevi Løvfelt",
                    "user_href": "/profile/Nevi-Løvfelt"
                },
                {
                    "user_id": "Nothanael Leon",
                    "user_href": "/profile/Nothanael-Leon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Hartdegen Lee",
                "href": "/profile/Alexander-Hartdegen-Lee"
            },
            "answer_text": "In the context of Singapore, buying an iPhone directly from Apple will free me from the telcos’ contracts. Most of the telcos in Singapore will tie you down with a contract when you buy an iPhone from them. Another advantage is that I can start to do my pre-order at the time which Apple launches their pre-order. Some telcos can be slow in the pre-order process. ",
            "date": "Answered October 26, 2020",
            "views": "278",
            "upvotes": "0"
        }
    ]
}