{
    "title": "What are the main features of the OnePlus 8? - Quora",
    "tags": [
        "OnePlus X",
        "OnePlus Smartphones",
        "OnePlus (company)",
        "Features (products and services)",
        "OnePlus One (product)",
        "Android (operating system)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rishi Prathap",
                "href": "/profile/Rishi-Prathap-1"
            },
            "answer_text": "SPECIFICATIONS OF ONEPLUS 8 ; OnePlus 8 smartphone was launched on 14th April 2020.The phone comes with a 6.55-inch touchscreen display with a resolution of 1080x2400 pixels at a pixel density of 402 pixels per inch (ppi) and an aspect ratio of 20:9.OnePlus 8 is powered by an octa-core Qualcomm Snapdragon 865 processor.It comes with 8GB of RAM. The OnePlus 8 runs Android 10 and is powered by a 4300mAh non-removable battery.The OnePlus 8 supports proprietary fast charging.As far as the cameras are concerned, the OnePlus 8 on the rear packs a 48-megapixel primary camera with an f/1.75 aperture and a pixel size of 0.8-micron; a second 16-megapixel camera with an f/2.2 aperture and a third 2-megapixel camera with an f/2.4 aperture and a pixel size of 1.75-micron.The rear camera setup has autofocus.It sports a 16-megapixel camera on the front for selfies, with an f/2.45 aperture and a pixel size of 1.0-micron.The OnePlus 8 runs on OxygenOS based on Android 10 and packs 128GB of inbuilt storage.The OnePlus 8 is a dual-SIM (GSM and GSM) smartphone that accepts Nano-SIM and Nano-SIM cards.The OnePlus 8 measures 160.20 x 72.90 x 8.00mm (height x width x thickness) and weighs 180.00 grams.It was launched in Glacial Green, lnterstellar Glow, and Onyx Black colours. It bears a glass body.Connectivity options on the OnePlus 8 include Wi-Fi 6 GPS, Bluetooth v5.10, NFC, USB Type-C, 3G, 4G and 5 G.The phone has a support for ufs 3.0 which is sort of and outdated and has the support for LPDDR4X ram which is old ( LPDDR5 was recommended for ONEPLUS to use but you may get UFS 3.1 AND LPDDR5 RAM support inthe upcoming T series ).Sensors on the phone include accelerometer, ambient light sensor, compass/ magnetometer, gyroscope, proximity sensor, and in-display fingerprint sensor.The OnePlus 8 supports face unlock.",
            "date": "Answered April 15, 2020",
            "views": "578",
            "upvotes": " Answer requested by Kanhaiya Soni",
            "upvoters": [
                {
                    "user_id": "Belal Hossain",
                    "user_href": "/profile/Belal-Hossain-192"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santosh Chaudhary",
                "href": "/profile/Santosh-Chaudhary-60"
            },
            "answer_text": "The phone comes with a 6.55-inch touchscreen display with a resolution of 1080x2400 pixels at a pixel density of 402 PPI and an aspect ratio of 20:9. OnePlus 8 is powered by an octa-core Qualcomm Snapdragon 865 processor. It comes with 8GB of RAM. The OnePlus 8 runs Android 10 and is powered by a 4300mAh non-removable battery. The OnePlus 8 supports proprietary fast charging. OnePlus 8 on the rear packs a 48-megapixel primary camera with an f/1.75 aperture and a pixel size of 0.8-micron; a second 16-megapixel camera with an f/2.2 aperture and a third 2-megapixel camera with an f/2.4 aperture and a pixel size of 1.75-micron. The rear camera setup has autofocus. It sports a 16-megapixel camera on the front for selfies, with an f/2.45 aperture and a pixel size of 1.0-micron. The OnePlus 8 runs OxygenOS based on Android 10 and packs 128GB of inbuilt storage. The OnePlus 8 is a dual-SIM (GSM and GSM) smartphone that accepts Nano-SIM and Nano-SIM cards. The OnePlus 8 measures 160.20 x 72.90 x 8.00mm and weighs 180.00 grams. It was launched in Glacial Green, lnterstellar Glow, and Onyx Black colors. It bears a glass body. OnePlus 8 includes Wi-Fi 802.11 a/b/g/n/ac/Yes, GPS, Bluetooth v5.10, NFC, USB Type-C, 3G, and 4G (with support for Band 40 used by some LTE networks in India). Sensors on the phone include accelerometer, ambient light sensor, compass/ magnetometer, gyroscope, proximity sensor, and in-display fingerprint sensor. The OnePlus 8 supports face unlock. ",
            "date": "Answered April 15, 2020",
            "views": "124",
            "upvotes": " View 1 Upvoter "
        }
    ]
}