{
    "title": "What invention had the most impact on changing the world? - Quora",
    "tags": [
        "Invention and Inventions",
        "World History",
        "Science",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ray Loewe",
                "href": "/profile/Ray-Loewe-1"
            },
            "answer_text": "What invention changed the modern world most? It’s not what you may think it is, it’s really this little thing…  What is it? It’s a transistor. This enabled us to go from this…  to this…  The transistor was invented in 1947 by Bell Labs scientists John Bardeen, William Shockley and Walter Brattain and effectively allowed the creation of the electronics industry we know today. In fact, Risto Puhakka, the president of VLSI Research Inc., said \"The invention of the transistor was probably the most important invention in the 20th century. It has changed society. Look at transportation, computers, government, finance, manufacturing ... it's affected them all. Look at the change in the productivity of the whole economy. It's probably doubled from what it would have been without transistors.” Why are they so important? There are 5 main reasons why transistors are so critical to today’s world: Switching - They are great switches and can turn electrical currents on and off billions of times in a second. Modern digital computers use them to store and transfer data.Amplification - If properly set up, transistors can serve as amplifiers, and almost all audio equipment is now transistorized.Miniaturization - As you saw in the photos above, the use of transistors has enabled us to go from computers that were literally the size of houses with limited capabilities to a point that today’s cell phones have many times more computing power and abilities than those early computers and at a much smaller size. In fact, today’s transistors are so small, the smallest are billionths of a meter small, that entire computers can fit on a single silicon chip. This has allowed us to enter the age of portability.Efficiency - Aside from being incredibly small, they are also extremely efficient and use little power. Think of an LCD watch. Millions of transistors could run for years on a single watch battery.Rugged - There are no moving parts in transistors, and they are designed to resist shock and vibration. This makes them idea in military, industrial and space applications. Old vacuum tube electronics were fragile and prone to breakage.Before transistors vacuum tubes represented ones and zeroes and were used to turn electrical switches on and off. You needed a lot of them and a lot of space in the equipment in which they were placed because they were so large. Vacuum tube electronics were also very slow to operate by today’s standards. Plus, the generated a lot of heat, which presented issues of its own including fire threats. Here are a few interesting facts about transistors: The first one was fist-sized, about the thickness of two matchbooks.The first commercial product was the Sonotone 1010 hearing aid, created in 1953The first transistor radio was introduced in 1953 and cost $49.99, which was quite pricey for the era. That would be the equivalent of $472 in today’s money.Gordon Moore, a researcher at Intel, developed a principle in 1965 that said the number of transistors on a chip would double every 2 years. This became known as Moore’s Law and is still true today.Motorola introduced the first commercial cell phone, the DynaTAC 800X, in 1983 at a cost of $3,995.Intel estimates that 10 quintillion (or a 1 followed by 19 zeros) transistors ship each year. How many is that? About 10,000 times the number of all the ants on the planet.Finally, if it wasn’t for transistors, you’d be reading this article in a room that looked a lot like the one in the second photo in my answer. Enjoy!Sources: Why Are Transistors So Important? The transistor: The most important invention of the 20th century? History of the transistor - Wikipedia ",
            "date": "Answered September 18, 2018",
            "views": "121",
            "upvotes": " View 37 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Hudson",
                    "user_href": "/profile/Robert-Hudson-8"
                },
                {
                    "user_id": "Randall Collins",
                    "user_href": "/profile/Randall-Collins-7"
                },
                {
                    "user_id": "Frank Shearin",
                    "user_href": "/profile/Frank-Shearin"
                },
                {
                    "user_id": "Ken Leith",
                    "user_href": "/profile/Ken-Leith"
                },
                {
                    "user_id": "Alon Poleg-Polsky",
                    "user_href": "/profile/Alon-Poleg-Polsky-1"
                },
                {
                    "user_id": "Troy Scalise",
                    "user_href": "/profile/Troy-Scalise"
                },
                {
                    "user_id": "Ariel Jagonos",
                    "user_href": "/profile/Ariel-Jagonos"
                },
                {
                    "user_id": "Drew Eckhardt",
                    "user_href": "/profile/Drew-Eckhardt"
                },
                {
                    "user_id": "Edilberto Francisco",
                    "user_href": "/profile/Edilberto-Francisco"
                },
                {
                    "user_id": "Karl Christensen",
                    "user_href": "/profile/Karl-Christensen-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Moorhead",
                "href": "/profile/Emily-Moorhead"
            },
            "answer_text": "It's hard to deny the impact penicillin had on the world. Penicillin was actually discovered a bit by accident. It is credited to scientist Alexander Fleming in 1928. He noticed that certain mold could kill bacteria, which proved that there was an antibacterial agent in the mold. Fleming did not actually invent penicillin though – he merely made popular the knowledge that there was an anti-bacterial agent in the mold Penicillium notatum. It was originally noticed by French medical student Ernest Duchesne in 1896. Fleming, however, saw the potential importance of what he named penicillin.  In a 1929 paper, he noted that the results he observed could have medical implications if the anti-bacterial agent could be isolated and produced in quantity.Dr. Howard Florey and Andrey J. Moyer later perfected mass producing penicillin at around the time of World War II. Moyer obtained a patent for the process of it’s mass production. As you can see, not all inventions are by design. Fleming merely noticed something that was interesting – he didn’t set out to find what many would consider a “miracle drug.” But once he made an observation, he made theorized what the implications of this discovery would be. Gutenberg's printing press, however, opened the world to a new realm of possibilities and information. In the 1440s, Johann Gutenberg came out with an invention called the printing press. Previously, books were copied down mainly by monks in monastaries, which made them quite rare. Gutenberg’s invention in effect brought the written word to the masses. In many ways, this brought on a complete revolution. A lasting effect was on the scientific community. Suddenly, scientists working in different locations could popularize their findings with their peers, opening the doors to the scientific revolution. No longer would each scientist have to reinvent the wheel, but instead could build on the research of his peers and predecessors. It also gave a greater degree of accountability to authors. Since previously each individual page was copied by hand, a text written by one author could vary from book to book. You could never be sure that you were reading the same version as someone else. It also led to greater education for the masses, since now books were more widely available.Gutenberg may not have set out to revolutionize the way that language was used, but ended up doing just that. ",
            "date": "Updated February 18, 2011",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dr-E-Stan-Miller"
                },
                {
                    "user_id": "Murtaza Aliakbar",
                    "user_href": "/profile/Murtaza-Aliakbar"
                },
                {
                    "user_id": "Ben Rosenberg",
                    "user_href": "/profile/Ben-Rosenberg"
                },
                {
                    "user_id": "Obada Barry",
                    "user_href": "/profile/Obada-Barry"
                }
            ]
        }
    ]
}