{
    "title": "What is the purpose of earth wire? - Quora",
    "tags": [
        "Wires",
        "Purpose",
        "Electricity",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Nations",
                "href": "/profile/Steve-Nations"
            },
            "answer_text": "The purpose of the ground wire (in U.S. terminology) is to provide a path back to the source of the electrical current — the main electrical panel — in the event of a fault. Hopefully this current is enough to trip the breaker or blow the fuse. A fault might be something like having the hot live wire of an appliance touch its metal case. The purpose of the ground wire is NOT to provide a path to the ground, or to some rod buried in the ground. I can’t stress that enough. In the U.S. and the U.K., and I think in the rest of the world, our electrical system is grounded at the utility transformer. This means that at the transformer there’s a cable from the neutral terminal that goes into the ground. One big benefit of this type of grounded system is protection from lightning strikes. Remember that electricity will always try to complete a circuit. It always wants to go back to where it came from. In our case that’s the utility transformer. So here’s what the system looks like at the transformer:  Things are a little different in other countries, but you get the idea. There are high voltage cables coming into the utility transformer, there are low voltage cables coming out and going into the house, and the neutral side at the transformer is connected directly into the ground. So what happens if there’s a ground fault? Here’s what things looked like before there was any grounding.  There’s no ground wire, but also no problems so we’re OK. Now here’s what happens with no ground wire, but a ground fault is present.  If you touch the appliance case when it’s electrified then you might complete a path to the ground, and all the current is going through you. But there’s not nearly enough electrical current flowing through the circuit breaker, so it won’t trip off. There’s a good chance that you’ll be electrocuted. (Note though that if you’re not grounded then nothing might happen. You have to be completing a circuit for current to flow through you.) And remember that electricity always wants to complete a circuit, so the fault current here is going to try to get back to the grounded side of the transformer. Now here’s what happens when we ground the appliance, and that ground wire goes back to the neutral bus bar in the electrical panel.  We have a green ground wire going back to the neutral bus bar in the main panel. This wire has very low resistance and so the electrical current will easily flow through it. This also creates a short circuit condition, which will draw a lot of current and so trip off the breaker. That’s what we really want — for the circuit breaker to trip off. Note here that you’re still part of the circuit. But you’re in a parallel circuit to the ground wire, so most of the current will flow through the low resistance ground wire. And here’s what happens if we try to ground to the earth instead of back to the neutral bus bar.  Again you’re part of a parallel electrical path. But the other path is trying to go through the ground — and of course back to the transformer. But the earth has too much resistance and so that path won’t be able to draw enough current to trip the breaker. So current will continue to flow through you and there’s a good chance that you’ll be electrocuted. To summarize, the ground fault path has to have very low resistance so that it will quickly carry a lot of current in order to trip off the breaker. The only way to do this is with a wire going back to the neutral bus bar. If you try to ground into the earth then the fault current path will have too much resistance and it won’t trip off the breaker. ",
            "date": "Answered July 19, 2016",
            "views": "671",
            "upvotes": " View 67 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mohammad Ayat",
                    "user_href": "/profile/Mohammad-Ayat-4"
                },
                {
                    "user_id": "Joe Zanchi",
                    "user_href": "/profile/Joe-Zanchi-2"
                },
                {
                    "user_id": "Abhishek Sachan",
                    "user_href": "/profile/Abhishek-Sachan-24"
                },
                {
                    "user_id": "SIVA SAI KRISHNA",
                    "user_href": "/profile/SIVA-SAI-KRISHNA-13"
                },
                {
                    "user_id": "Luscious",
                    "user_href": "/profile/Luscious-5"
                },
                {
                    "user_id": "Philipp Konerding",
                    "user_href": "/profile/Philipp-Konerding"
                },
                {
                    "user_id": "Savin De Alwis",
                    "user_href": "/profile/Savin-De-Alwis"
                },
                {
                    "user_id": "Fuckyouquora Youfuckingdumbcunts",
                    "user_href": "/profile/Fuckyouquora-Youfuckingdumbcunts"
                },
                {
                    "user_id": "Lyndon Sniper",
                    "user_href": "/profile/Lyndon-Sniper"
                },
                {
                    "user_id": "Fardeen Ashraf",
                    "user_href": "/profile/Fardeen-Ashraf-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Gilman",
                "href": "/profile/Jeff-Gilman-2"
            },
            "answer_text": "A ground wire has two main purposes. For safety, because in an electrical circuit the distribution system is configured so that the grid uses a wire attached to ground periodically, at ‘every’ power pole, and at every distribution panel, at the power plant, and at transformers and at the 3rd prong on 120/240 volt circuits the circuit has a path to ground. This is also true on three phase systems for the same reason. In many cases, people are standing on the ground, literally, or on a wet floor, or on a surface which is electrically conductive to the earth ground using a defective power too. There is an electrically hot wire which is not attached to the ground in the equipment which is normal. Sometimes, the hot wire in the equipment shorts out to the metal case of the equipment. If a person inadvertently touches the live metal case, sometimes the circuit to ground is completed through the person, thus potentially electrocuting the person. So, the 3rd prong male prong on a plug is connected to the ground. If a piece of electrical equipment has a hot wire touching a metal part of the equipment the current will rush to ground thus blowing fuses, or opening the circuit breaker, and disconnecting the circuit. This protects people and helps stop fires if the hot wire has too much current flowing through it to ground.In modern homes in the distributional panel, or at the plug there is a device (a ground fault interrupter) which detects whether the SAME amount of current traveling out through the hot wire is returning on the neutral/ground wire. If it doesn’t match, the circuit ‘assumes’ the unbalanced current flow is leaking off to ground, potentially through a person, or a fault in the wiring. The GFI, or ground fault interrupter then trips shutting off the power. Many new building codes require an arc fault interrupter be installed at the panel. Sometimes there will be a poor connection producing an electric spark, or arc which is not enough current to shut off a GFI or circuit breaker. Its as if there is a welding spark inside a wall. This can start a fire. The arc fault interrupter will detect an arc which is not normal and shut off the circuit. A normal arc would be operating a switch with a small, arc. The electronics in the AFI can tell if the arc is too big, abnormal and shuts the circuit off.Lightning. If a lightning strike hits a power line, or your house the lighting has a path to ground thus potentially neutralizing the strike as it has a path to ground, rather than through you or your wiring. This is not perfect, as some lighting strikes can carry so much current that the wiring is burned out.",
            "date": "Answered January 3, 2019",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammad Ayat",
                    "user_href": "/profile/Mohammad-Ayat-4"
                }
            ]
        }
    ]
}