{
    "title": "What are the most promising new battery technologies for electric cars? - Quora",
    "tags": [
        "Battery Electric Vehicles (BEV)",
        "Electric Vehicles",
        "Electric Cars",
        "Technology Trends",
        "Batteries",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ralf Thompson",
                "href": "/profile/Ralf-Thompson"
            },
            "answer_text": "Q: What are the most promising new battery technologies for electric cars? Silicon Dominant Lithium Ion (or Lithium Silicon). Lithium–silicon battery - Wikipedia This is a technology that promises higher energy densities and quick charge rates. What this means is, you could have a smaller battery for the same range, or more range for the same battery size. This is the big advantage. There is at least one company, Enevate, that claims to have solved the technical hurdles for this kind of battery. If so, they should start showing up in consumer electronics to start. But they'll be expensive at first and thus I'm assuming they'll take a while before showing up in EVs except, perhaps, in really high-end vehicles where the price isn't a concern. Faster charging, however, won't accomplish much. The problem is, the faster you charge something, the more current that has to be delivered to the battery. The more current, the larger the cable delivering it has to be. Charge times could be cut in half, maybe to a third, but beyond that, the cables become too large and unwieldy (not to mention, dangerous) to manhandle. It wouldn't matter how quickly the battery can accept a charge when the bottleneck is the cables needed to deliver the charge. Keep in mind larger capacity batteries will be needed for heavier vehicles (SUVs, pickup trucks, etc), assuming the extended range is maintained. These will push the charge time back up. ",
            "date": "Answered July 1, 2019",
            "views": "328",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Boyland",
                    "user_href": "/profile/John-Boyland"
                },
                {
                    "user_id": "Dwane Anderson",
                    "user_href": "/profile/Dwane-Anderson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Forrest",
                "href": "/profile/Andrew-Forrest-40"
            },
            "answer_text": "What are the most promising new battery technologies for electric cars? As far as I can see, the most promising new battery technology for EVs is the new dry cell tech that was developed by Maxwell Technologies. This still utilises a Lithium chemistry, but has the major advantage in that it does away with a volatile liquid electrolyte. This means that the cell is no longer flammable in the way current Lion cells are, and also means that an energy intensive and expensive manufacturing process can be done away with, making them cheaper and faster to produce. The icing on the cake is the fact that current designs show an energy density of 300 Whrs/kg, which is substantially better than the industry standard of 250 Whrs/kg. Maxwell claim that they also have a “clear pathway” to a cell design that will provide 500 Whrs/kg. This is the reason why Tesla has purchased the company , I’m guessing that they want to break free from Panasonic, and get as much vertical integration as possible. ",
            "date": "Answered July 1, 2019",
            "views": "123",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dwane Anderson",
                    "user_href": "/profile/Dwane-Anderson"
                }
            ]
        }
    ]
}