{
    "title": "What is quantum computing? How does it work? - Quora",
    "tags": [
        "Quantum Computers",
        "Quantum Information",
        "Quantum Computing",
        "Computer Engineering",
        "Engineers",
        "Quantum Mechanics",
        "Computer Science",
        "Computers",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "FactO- Facts",
                "href": "/profile/FactO-Facts-4"
            },
            "answer_text": "Talks about Quantum Computing is getting quite popular nowadays, and with that, the curiosity and misconceptions about this technology are also increasing. A computer basically works on millions or billions of transistors installed on its processor, the main work of the transistor is to act as a switch to let pass or restrict the current or what we state as 1 and 0 as per the need of an operation. Since the inception of Computers, the transistors are getting smaller and smaller with the time or in every two years as per a study, the smaller the transistors the better the efficiency and power saving. With the size getting smaller we can install more and more transistors on a same sized processor, hence increasing the power of computers and their ability of calculation. From the Intel’s 4004 to Pentium to the latest Intel i7 are the very evident example of the technological advancement. Currently, the size of transistors that is being used in the latest computer processors or in our cell phones is 14nm (Nanometer). Soon enough with the rapidly improving technology and transistors getting further smaller, we are going to end up with a transistor equal to the size of one single atom. The problem with the transistor of that small size is that it will fail to restrict the electrons, the electrons will pass through the transistors by using the Quantum tunneling phenomenon, hence the core phenomena on which computers work will fail. Now, with Quantum computing, we are aiming towards using the Quantum tunneling phenomenon in our favor. This technology works on various levels and has many aspects… Read the full blog to get an in-depth understanding of Quantum Computing. How Quantum Computing is Going to Change The World? Explained! ",
            "date": "Answered December 7, 2018",
            "views": "307",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Himanshu Krothwal",
                    "user_href": "/profile/Himanshu-Krothwal"
                }
            ]
        }
    ]
}