{
    "title": "What should I learn, SAP, ABAP, or Python? - Quora",
    "tags": [
        "SAP ABAP Certification",
        "SAP ABAP (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arya",
                "href": "/profile/Arya-372"
            },
            "answer_text": "Its depend on you what you want to study on your interest. ABAP is the programming language, it runs in SAP ABAP run time environment. Its created and used by SAP. SAP is the highly integrated software that perform common business functions based on multi-national leading practices. There are more than one million users over the world. SAP has the good scope in business management or industry or organization. At CREATIVE EXPERTS ,its providing SAP courses. Trainers for SAP is well trained and experienced who are all well skilled in their technical side. In CREATIVE EXPERTS you sure about to get the training in real time projects and you get the support for technical douts even after your course completed. you will get a practical knowledge about SAP and get the placement assistance. Contact us on :8122241286. ",
            "date": "Answered March 30, 2019",
            "views": "5",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sujitha Manivannan",
                    "user_href": "/profile/Sujitha-Manivannan-4"
                },
                {
                    "user_id": "Rajendran Prasad",
                    "user_href": "/profile/Rajendran-Prasad-2"
                },
                {
                    "user_id": "Rakesh Kharvi",
                    "user_href": "/profile/Rakesh-Kharvi"
                },
                {
                    "user_id": "Pranav Swaroop",
                    "user_href": "/profile/Pranav-Swaroop-6"
                },
                {
                    "user_id": "Naveen Puppala",
                    "user_href": "/profile/Naveen-Puppala-13"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/john-5614"
                },
                {
                    "user_id": "Sanjaynath Code",
                    "user_href": "/profile/Sanjaynath-Code"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/tyrionlann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lavanya Sri",
                "href": "/profile/Lavanya-Sri-27"
            },
            "answer_text": "With enterprises of all sizes utilizing SAP software, SAP ABAP programmers are in great demand for the personalization of modules as per customer needs. But, what makes an ABAP programmer expensive in the vibrant job market are the skills to deliver services that promote best value, value addition and viable solutions. Knowledge regarding different domains are also valued most. Gain these skills with ABAP training at Peopleclick Techno Solutions and stand out the crowd. For Details: https://mailchi.mp/dab15b3106ab/sapabap ",
            "date": "Answered August 21, 2018",
            "views": "38",
            "upvotes": "0"
        }
    ]
}