{
    "title": "What is the use of Ethernet port? - Quora",
    "tags": [
        "Ethernet",
        "Wi-Fi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brad Follett",
                "href": "/profile/Brad-Follett"
            },
            "answer_text": "Ethernet ports are used on switches. Actually your router is a switch that allows it to communicate with the other devices connected. The ports play a important role as they allow only the designated device to see that data instead of everyone that is connected to the switch. A switches port saves the devices MAC address so that when it receives data only meant for a certain address, it can send it down the port matching the correct MAC address. This way no other device sees the data unlike what happens with a hub, which broadcasts any data it receives to every device connected. ",
            "date": "Answered September 21, 2018",
            "views": "26",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virginia Beck",
                    "user_href": "/profile/Virginia-Beck-1"
                },
                {
                    "user_id": "Fatimo Oladipupo",
                    "user_href": "/profile/Fatimo-Oladipupo"
                },
                {
                    "user_id": "Syed Najam Uddin Ahmed",
                    "user_href": "/profile/Syed-Najam-Uddin-Ahmed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon-Paul Ward",
                "href": "/profile/Jon-Paul-Ward"
            },
            "answer_text": "Ethernet Protocol is a networking protocol many are familiar with at the layer 2 or hardware layer as an interface between a network and the computer you are wanting to interface with. Its common physical interface is a RJ-45 (Registered Jack from Ma Bell days) datajack and dataplug as a 8 wire interface. It has many uses as the dataplug locks into its dataport with a clip on one side of the plug. In Professional Audio/video world, it is used on Range Extenders as a technology to extended the range of a video signal such as HDMI beyond the typical 50 feet. It is also the most ubiquitous networking protocol and has it used as a Networking protocol interface. ",
            "date": "Answered October 21, 2018",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Utkarsa Pilla",
                    "user_href": "/profile/Utkarsa-Pilla"
                }
            ]
        }
    ]
}