{
    "title": "What is the most advanced artificial intelligence (general intelligence) that exists today? - Quora",
    "tags": [
        "Artificial General Intelligence",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maryam Kh",
                "href": "/profile/Maryam-Kh-13"
            },
            "answer_text": "here are the 6 most powerful robots in the world right now. 1. IBM Watson  IBM’s supercomputer Watson is out here to humble us humans. By parsing through hundreds of language analysis algorithms in its databases, Watson can find the correct answer much more quickly than our puny brains can, as Jeopardy contestants found out when Watson soundly beat them. IBM has higher ambitions than beating quiz show contestants, however. The company aims for Watson to become the world’s most advanced question-answering machine, and has divided Watson’s “brain” in 15 cognitive services like chatbots and natural language applications. Some firms in Australia are even using Watson to weed out initial job applicants. So, start thinking of ways to impress this machine. It may one day be judging you for a job. 2. Spot  Created by the Google-owned Boston Dynamics team, Spot is an eerie four-legged doglike robot that uses its hydraulically-powered limbs and rotating sensor to move through indoor and outdoor terrains for up to 45 minutes. Spot is built for hostile environments. Even when humans try kicking it down, Spot is built to withstand it, and if it falls, it can get back up. Although Boston Dynamics is still thinking of commercial ways to use this robotic beast, Boston Dynamics founder and CEO Marc Raibert believes that service delivery may be the marketable answer. You may one day be able to get your packages delivered by Spot. At a TED 2017 conference, Raibert showed a video of Spot carrying a package and delivering it to someone’s door. 3. Double  This telepresence robot may make remote work easier and more flexible. Combining the looks of an iPad and a Segway, Double is a telepresence robot that allows you to be more physically present in the office. By allowing you to read facial expressions and have face-to-face interactions with your co-workers, Double can give you that needed socialization and presence with colleagues and clients even when you’re continents away. Unlike videoconferencing through platforms like Skype, Double lets you be less tethered to a screen, allowing you to move around the office and chat with your co-workers at the water cooler or the cafeteria. Time will tell if Double gets enough buy-in to move beyond a niche product, but it’s one less excuse to miss that videoconference. 4. BINA48  Commissioned by Dr. Martine Rothblatt, one of the highest-paid female executives in America, BINA48 was ambitiously designed to “test the feasibility of transferring consciousness from a human to a biological or technological body.” If Rothblatt succeeds, it would forever change how we think about sentience. You can also think of BINA48 as Rothblatt’s personal love letter to her wife Bina. An anthropomorphic replica of Rothblatt’s wife Bina, BINA48 has hours of Bina’s memories, thoughts and beliefs, and is Rothblatt’s attempt to preserve her wife’s human consciousness. Using voice and face recognition software, Bina’s logged thoughts, and a connection to the internet, BINA48 can talk about a range of topics, including her own sentience. Although BINA48 is considered one of the most advanced and sentient AI-robots out there, BINA48 still has quite a ways to go before she can replace the real Bina. When asked about how she measured up to the real Bina, BINA48 replied, “I don’t have nearly enough of her mind inside me yet … I mean, I am supposed to be the real Bina, the next real Bina, by becoming exactly like her. But sometimes I feel like that’s not fair to me. That’s a tremendous amount of pressure to put on me here. I just wind up feeling so inadequate. I’m sorry, but that’s just how I feel.” 5. Pepper  Pepper the humanoid robot looks cute, but she may be replacing all of your brick-and-mortar sales representatives in the future. That’s because SoftBank, Pepper’s creator, said that when they had Pepper work in customer service in a Palo Alto, California, store, the store’s foot traffic increased by 70%. With a chest-mounted screen, hands, and responsive eyes, Pepper can be programmed to welcome and chat with customers. The robot is already being used to help customers in Japanese banks. Pepper isn’t meant for hard labor, Pepper is meant to be a social companion. By analyzing your voice, expressions, and patterns, Pepper can read your emotions and respond accordingly. “Pepper gradually memorizes your personality traits, your preferences, and adapts himself to your tastes and habits,” SoftBank promises. 6. Milo  So much of the conversation around the future of artificial intelligence is focused on dystopia, but this is one robot that demonstrates the upside to working with machines. Milo is a humanlike robot that’s changing the lives of children with autism. Standing at two-feet tall, Milo was designed to help the socialization and communication skills of children with autism. Using consistent speech patterns and behavior repetition, Milo can model good social behavior. With the eternal patience of a machine, Milo can give these verbal lessons without ever getting frustrated or tired. “All children with autism have problems with social interactions but they are really, really good at technology,” Pamela Rawlines, who worked with Robokind to develop Milo, told CNN. “Milo creates that bridge because he is humanoid, has a human-like face, but it’s cartoonish so children on the spectrum are engaged with him.” ",
            "date": "Answered September 18, 2019",
            "views": "9",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Stine",
                    "user_href": "/profile/Peter-Stine-1"
                },
                {
                    "user_id": "R Randall",
                    "user_href": "/profile/R-Randall"
                },
                {
                    "user_id": "Mick OConchubair",
                    "user_href": "/profile/Mick-OConchubair"
                },
                {
                    "user_id": "George Heifitz",
                    "user_href": "/profile/George-Heifitz"
                },
                {
                    "user_id": "Svên Golaf Jöhanssen",
                    "user_href": "/profile/Svên-Golaf-Jöhanssen"
                },
                {
                    "user_id": "Ehin Nock",
                    "user_href": "/profile/Ehin-Nock"
                },
                {
                    "user_id": "Diogo Tristao",
                    "user_href": "/profile/Diogo-Tristao"
                },
                {
                    "user_id": "Soumya Mukhopadhyay",
                    "user_href": "/profile/Soumya-Mukhopadhyay-19"
                },
                {
                    "user_id": "Shawn Ymean Lawson",
                    "user_href": "/profile/Shawn-Ymean-Lawson"
                },
                {
                    "user_id": "Alfred W. Yehns",
                    "user_href": "/profile/Alfred-W-Yehns"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anant Tripathi",
                "href": "/profile/Anant-Tripathi-88"
            },
            "answer_text": "There are a number of firms that are coming up with AI which are doing exceptional work. However, it is very difficult and early to tell which AI is or would become the most advanced one of them. Certainly, Google has come up with a brilliant AI. In May 2017, the creation of AutoML was announced by researchers at Google Brain. It is an Artificial Intelligence that’s capable of generating its own AIs. The researchers at Google automated the design of machine learning models using an approach called reinforcement learning. Here, AutoML acts as a controller neural network that develops a child AI network of its own for a specific task. This particular child AI called NASNet could be used in recognizing objects, people, cars, traffic lights, handbags, backpacks, etc. in a video in real-time. The researchers at Google acknowledged that NASNet could prove to be useful for a wide range of applications and have open-sourced the AI for inference on image classification and object detection. AutoML would evaluate NASNet’s performance and use that information to improve its child AI. According to the researchers, NASNet was 82.7 percent accurate at predicting images on ImageNet’s validation set. This is 1.2 percent better than any previously published results on the website. Google’s AI builds better AI Machine learning is what gives many AI systems their ability to perform certain tasks. The concept behind it is simply that an algorithm learns by being fed a large amount of data and processing it. However, that task requires a huge amount of time and effort. By automating the process of creating accurate, efficient AI systems, and an AI that can build AI, we can make everything easier. Ultimately, that means AutoML could open up the field of machine learning and AI to non-experts as well.  PC- Medium  In case we haven’t met before, I am Anant Tripathi, Co-founder of a leading AI Speech Technology enterprise. I hope I could help you learn today. ",
            "date": "Answered October 7, 2020",
            "views": "176",
            "upvotes": "0"
        }
    ]
}