{
    "title": "What are the basic parts of a computer mouse? - Quora",
    "tags": [
        "Computer Peripherals",
        "Computer Mice",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alberto Samuel Camus",
                "href": "/profile/Alberto-Samuel-Camus"
            },
            "answer_text": "The Optical Style Computer mouse: An LED at the back generates red light and shines it horizontally, from the back of the mouse toward the front (from the left to the right of this photo).A plastic light guide channels the light from the LED at an angle, down onto the desk.A light-detector chip measures light reflected back up from the desk, converting the analog movements of your hand into digital signals that can be sent to your computer.The scroll wheel at the front of the mouse is mounted on a switch mechanism that detects both how much it's rotated and whether you've pressed it (it functions like the central button of a conventional mouse). Rotations of the scroll wheel can be detected in a variety of different ways. Some mice use potentiometers (broadly, variable resistors (http://www.explainthatstuff.com/resistors.html)), similar to the volume control on a radio but able to turn around multiple times. Others use various kinds of rotary switches or optical (rotary) encoders (https://en.wikipedia.org/wiki/Rotary_encoder) to convert analog (http://www.explainthatstuff.com/analog-and-digital.html) wheel movements to digital signals.A microswitch detects when you press the right mouse button. There's an identical switch on the other side to detect the left mouse button.The USB cable connection carries digital information from the mouse to your computer.The older Ball-style Computer mouse: Switch detects clicks of left mouse button.Switch for middle button.Switch for right button.Old-style connection to PS/2 socket on computer.5. Chip turns back-and-forth (analog (http://www.explainthatstuff.com/analog-and-digital.html)) mouse movements into numeric (digital) signals computer can understand.X-axis wheel turns when you move mouse left and right.Y-axis wheel turns when you move mouse up and down.Heavy rubber (http://www.explainthatstuff.com/rubber.html) wheel.Spring presses rubber ball firmly against X- and Y-axis wheels so they register movements properly.Electrolytic capacitor (http://www.explainthatstuff.com/capacitors.html)Resistors (http://www.explainthatstuff.com/resistors.html).External Link: How does a computer mouse work? ",
            "date": "Answered April 9, 2018",
            "views": "91",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jacob Lux",
                "href": "/profile/Jacob-Lux-2"
            },
            "answer_text": "Different computer mice have different layouts and components, and some peripherals act like a mouse but aren’t a mouse at all. I’ll list the major components and then some silly stuff on the side. Every peripheral that is a mouse or performs mouse-like functions has at least one button. Even graphics tablets have a button (the nib is compressible, and there’s usually a button or two on the side of the pen.) The standard layout is a left click, right click, and middle click.Most pointer devices also have a scroll wheel, which doubles as that middle click button on most mice.Ball, Laser, LED, image sensor; each of these is used to track the movement by various methods.Advanced mice use imaging and there is a microprocessor in the mouse that compares the differences between each “image” to determine movement. (Bonus: The ‘polling rate’ is how many times per second a new image is captured and processed.)Cable or wireless receiverUSBBluetoothInfrared (god forbid)PS/2Serial (what century is your mouse from?)Radio (2.4GHz thingy)In the case of touchpads on laptops, some custom connectorInternal, small things nobody sees:Circuit boardMicroprocessorBattery(ies) if it’s wirelessMaybe some additional memory for macros or settingsOptional Stuff:LEDsExtra buttons like thumb buttons or tilt-feature for the scroll wheel to scroll horizontallyGrips and weights, sometimes removable/replaceable/adjustable.Here’s a cross-section (is that the right word?) of the internals of an old trackball mouse:  [1]  Now I mentioned there’s some silly stuff out there:    Some mice don’t require you to move them around and instead you navigate with the thumbwheel. Some mice have a bazillion extra buttons so you can hotkey games and macros to them. Some aren’t mice at all:  Although not necessarily a “mouse”, it is absolutely a pointing device and can, surprisingly easily, be converted to operate as a traditional pointer on the desktop.   Some get surprisingly elaborate. Footnotes[1] What is a Computer Mouse?",
            "date": "Updated May 9, 2017",
            "views": "391",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chinmoy Misra",
                    "user_href": "/profile/Chinmoy-Misra-3"
                },
                {
                    "user_id": "Wendy Szeto",
                    "user_href": "/profile/Wendy-Szeto-2"
                },
                {
                    "user_id": "Vedansh Dharwal",
                    "user_href": "/profile/Vedansh-Dharwal"
                },
                {
                    "user_id": "Amne Alkali",
                    "user_href": "/profile/Amne-Alkali"
                },
                {
                    "user_id": "Vijay Kumar",
                    "user_href": "/profile/Vijay-Kumar-1116"
                },
                {
                    "user_id": "Brian Fey",
                    "user_href": "/profile/Brian-Fey"
                },
                {
                    "user_id": "Psalm Palomares",
                    "user_href": "/profile/Psalm-Palomares"
                },
                {
                    "user_id": "Russell Routhier",
                    "user_href": "/profile/Russell-Routhier"
                },
                {
                    "user_id": "James Ryan Wei Soo",
                    "user_href": "/profile/James-Ryan-Wei-Soo"
                },
                {
                    "user_id": "Omari Rose",
                    "user_href": "/profile/Omari-Rose"
                }
            ]
        }
    ]
}