{
    "title": "What is the so-called 'technological Sublime'? - Quora",
    "tags": [
        "Critical Theory",
        "Design",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Weinberg",
                "href": "/profile/Craig-Weinberg"
            },
            "answer_text": "A quick Google brings up this thoughtful link: The Technological Sublime \" NextNature.net In it, the author discusses the evolution of what has been called the sublime, first as an apprehension of something like the overwhelming grandeur of nature. In classical writing, the sublime was described by Longinus as \"an unconquerable passion for all that is great and for all that is more divine than ourselves” By the late 18th century, the notion of the sublime had progressed to a more ambiguous sense of Dionysian power. \"Kant, following Burke, makes an explicit distinction between the beautiful (das Schöne) and the sublime (das Erhabene).  Beautiful are those things that give us a pleasant feeling. They fill  us with desire because they seem to confirm our hope that we are living  in a harmonious and purposeful world. A beautiful sunrise, for instance,  gives us the impression that life is not that bad, really. The sublime,  on the other hand, is connected with experiences that upset our hopes  for harmony. It is evoked by things that surpass our understanding and  our imagination due to their unbounded, excessive, or chaotic character...\" The technological sublime, the author argues, comes out of the displacement of nature and God in the 19th and 20th centuries, leaving an industrial sublime in its wake. Mass production and global war introduced humanity to an amplification of human might which dwarfs the slow and meandering ways of nature or humanistic contemplation. In the 21st century, the author argues, the sublime has crossed the threshold into an information-theoretic idea of the sublime. Computer science, genetics, and quantum mechanics are among the post-industrial sciences which conceive of the cosmos as dauntingly vast quantitative ensembles of permutation and probability. The sense of natural awe and supernatural promise seem to become intertwined with the self-determination of the industrial sublime to produce a sense of racing to dig into the guts of the universe and discover the keys to some degree of mastery over the constraints of humanity, biology, and physics. ",
            "date": "Answered November 30, 2012",
            "views": "19",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kayleigh Groves",
                    "user_href": "/profile/Kayleigh-Groves-1"
                },
                {
                    "user_id": "Stella Cheng",
                    "user_href": "/profile/Stella-Cheng"
                },
                {
                    "user_id": "Thomas Hemsley",
                    "user_href": "/profile/Thomas-Hemsley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hans Henderson",
                "href": "/profile/Hans-Henderson"
            },
            "answer_text": "Sublime is just a strong word for things you like. The consumerist and technological spheres have in recent decades become more dominant in popular culture than the traditional arts, so more people now get their aesthetic \"rush\" from product design instead. ",
            "date": "Answered November 30, 2012",
            "views": "833",
            "upvotes": "0"
        }
    ]
}