{
    "title": "What are the best uses for smartphones in our day-to-day lives? - Quora",
    "tags": [
        "Days of Our Lives",
        "Daily Life",
        "Smartphones",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krishna Sharma",
                "href": "/profile/Krishna-Sharma-31"
            },
            "answer_text": "Smartphones are more advanced than ever. They’re packed with tons of features, like front- and rear-facing cameras, heart rate monitors, fingerprint screen lock, and access to apps galore. There’s no denying it, from the moment we get up to the moment we go to bed, we’re all glued to our smartphones. A new work email. A new Facebook notification. The weather app tells us a storm is on the way. There’s always another reason to pick up our phones because they do so much. Here I'm telling you few advance uses of smartphone in daily life Measure your heart health AliveCor’s Kardia mobile heart monitor is smaller than a credit card and takes just 30 seconds to capture your EKG and tell you if your heart rhythm is normal. Prevent drunk driving The compact keychain device measures the alcohol present on your breath in just five seconds, then wirelessly sends your BAC reading to smartphone. The included app predicts how long it will take for your levels to return to 0 percent. It can even call an Uber for you! Remind you to drink enough waterYes, I'm talking about hidrate spark. It’s a smart water bottle that tracks exactly how much you’ve had to drink today. Pair it with an app for devices to give you an in-depth look at your water drinking habits. Met your drinking goal for the day? The bottle lights up to let you know! Do some math ( without a calculator)Your phone already has a calculator built in, but it requires that you type out the equations. Photomath lets you take a picture of any math problem and get an immediate answer. It walks you through the steps to get to that answer, as well, making it a good learning tool. Photomath supports arithmetics, integers, fractions, decimal numbers, roots, algebraic expressions, linear equations and inequalities, quadratic equations and inequalities, absolute equations and inequalities, systems of equations, logarithms, trigonometry, exponential and logarithmic functions, derivatives and integrals. ",
            "date": "Answered May 13, 2017",
            "views": "2",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaya Bharathi",
                    "user_href": "/profile/Jaya-Bharathi-28"
                },
                {
                    "user_id": "Yatharth Singh",
                    "user_href": "/profile/Yatharth-Singh-7"
                },
                {
                    "user_id": "Gianetan Sekhon (ज्ञानेतन सेखों )",
                    "user_href": "/profile/Gianetan-Sekhon-ज्ञानेतन-सेखों"
                },
                {
                    "user_id": "Ansh Singh",
                    "user_href": "/profile/Ansh-Singh-62"
                },
                {
                    "user_id": "Sakshi Goel",
                    "user_href": "/profile/Sakshi-Goel-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kintu",
                "href": "/profile/Kintu"
            },
            "answer_text": "Here’s the list of applications through which you can mould your personality and intellect. Are you in an avid reader’s club ? or want to generate a habit of reading, but don’t know from where to start. So here are some applications Quora (obviously)MediumRedditWordpress (for blog reading)Want to improve your vocabulary ? Magoosh (works offline also)An offline dictionaryAre you enthusiast enough for learning new courses and to stretch your limits then there are numerous sites and applications which offers online courses in various fields. CourseraedxNPTELKhan academy (the best site for educational learning)Are you hungry enough for some motivation, inspiration and knowledge ? TED (application for IOS and android)Ted talks and tutorials on Youtube.If you want to update your list for languages known ? then here are some applications for you DuolingoMemrisebut there are some apps which you have to delete, then and then only you can download above mentioned apps InstagramFacebookSnapchatWhatsapp(after all phone memory space matters :p) Do you know whatsapp can be used for also learning new words, as a planner and a lot more ! besides chatting and spreading rumors. Make a group of your friends, tell all the members that this group has only one rule. Every member has to send a message with 5 new words with a meaning every night/morning. Name that group as Vocab builder or which ever you likeMake a group of 2–3 members, as soon as group is created remove all the members from that group. What you will see that the only member is you now. Voila ! now you can use that group asa personal diary in which you can write your day to day experiencesA to-do-listas a plannerBut remember that there is no such thing as Whatsapp is a necessity now a days. A big NO! I deleted my whatsapp account a week ago still I am here, writing answers ALIVE. I am not saying to remove whatsapp, after all priorities differ from person to person. Regards, Kintu Happy reading :) ",
            "date": "Answered May 25, 2017",
            "views": "16",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishva Sureliya",
                    "user_href": "/profile/Vishva-Sureliya"
                },
                {
                    "user_id": "Bhadauriya Rahul",
                    "user_href": "/profile/Bhadauriya-Rahul"
                },
                {
                    "user_id": "Subrat Das",
                    "user_href": "/profile/Subrat-Das"
                },
                {
                    "user_id": "Shruti Solanki",
                    "user_href": "/profile/Shruti-Solanki-5"
                },
                {
                    "user_id": "Pawan Sharma",
                    "user_href": "/profile/Pawan-Sharma-437"
                },
                {
                    "user_id": "Jay Javia",
                    "user_href": "/profile/Jay-Javia"
                },
                {
                    "user_id": "Jaimin Khamar",
                    "user_href": "/profile/Jaimin-Khamar-1"
                }
            ]
        }
    ]
}