{
    "title": "What comes after quantum computing which is more powerful than quantum computing? - Quora",
    "tags": [
        "Quantum Computers",
        "Quantum Information",
        "Quantum Computing",
        "Quantum Mechanics",
        "Computer Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Brickner",
                "href": "/profile/Scott-Brickner"
            },
            "answer_text": "“More powerful” isn’t really very well defined in this context. There’s nothing that a quantum computer can compute that a classical computer cannot also compute. It just appears that there some classes of problems that a quantum computer can solve faster. But quantum computers aren’t likely to be practical for a very long time. You’re not going to be running a quantum version of Chrome, for example. I doubt they’ll ever be more than highly specialized coprocessors like GPUs. If that’s the case, then it’s hard to argue that a GPU is “more powerful” than a regular processor—it does some things very well, but others not. The general-purpose processor is more useful across the whole range of tasks we want computers to perform. So, if you want a purely theoretical measure of “power”, then a quantum computer is no more powerful than a Turing machine. We don’t really even have any theoretical model of computing that’s more powerful than a Turing machine. If you want a practical, utilitarian measure of “power”, then quantum computers are less powerful than classical computers outside of a pretty small problem domain. ",
            "date": "Answered October 24, 2020",
            "views": "369",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nelson Vidinha",
                    "user_href": "/profile/Nelson-Vidinha"
                },
                {
                    "user_id": "Karen McKearn",
                    "user_href": "/profile/Karen-McKearn"
                }
            ]
        }
    ]
}