{
    "title": "What is the workplace hierarchy in Cognizant Technology Solutions? - Quora",
    "tags": [
        "Jobs and Careers at Cognizant",
        "Jobs and Careers at Specific Companies",
        "Cognizant (company)",
        "Office and Workplace Culture",
        "The Workplace",
        "Companies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sagnik Banerjee",
                "href": "/profile/Sagnik-Banerjee-5"
            },
            "answer_text": "Here is the hierarchy as far as I know. I have been outside the company for almost 5 years now. 1. Programmer 2. Programmer Analyst 3. Associate 4. Senior Associate 5. Manager 6. Senior Manager 7. Associate Director 8.Director 9.Senior Director 10.Associate Vice President 11.Senior Vice President 12.Executive Vice President 13.President 14.Chief Operating Officer/Chief Financial Officer (not sure about rankings between them) 15.Chief Executive Officer. There used to be a Assistant Program Manager post, which was abolished  I believe in 2011. There are different horizontal based names available as I remember, which ultimately map to one of those ranks mentioned above. e.g. Technical analyst - <Horizontal>, Consultant - <Horizontal>, Senior Consultant - <Horizontal> etc.  Then there are carrier path based titles, which come into effect probably starting from the Manager ranks i.e. for Project Management track e.g. Project Manager, Account Manager etc. or Technical track e.g. Technical Architect, Principal Architect etc. I apologize to everyone in advance, if this is inaccurate at some level, as I may have forgotten things, or most probably things have changed since I left the company around 5 years ago. ",
            "date": "Answered December 18, 2015",
            "views": "1058",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shirshendu Deb Roy",
                    "user_href": "/profile/Shirshendu-Deb-Roy"
                },
                {
                    "user_id": "Sandeep Acharya",
                    "user_href": "/profile/Sandeep-Acharya-49"
                },
                {
                    "user_id": "Prateekraman Pandey",
                    "user_href": "/profile/Prateekraman-Pandey"
                },
                {
                    "user_id": "Manikandan Sivaramakrishnan",
                    "user_href": "/profile/Manikandan-Sivaramakrishnan-1"
                },
                {
                    "user_id": "Ashish Ankit",
                    "user_href": "/profile/Ashish-Ankit"
                },
                {
                    "user_id": "Swapnil Tambi",
                    "user_href": "/profile/Swapnil-Tambi"
                },
                {
                    "user_id": "Renuga Saravanan",
                    "user_href": "/profile/Renuga-Saravanan-3"
                },
                {
                    "user_id": "Ashutosh Singh Tomar",
                    "user_href": "/profile/Ashutosh-Singh-Tomar-5"
                },
                {
                    "user_id": "Saravanan Manoharan",
                    "user_href": "/profile/Saravanan-Manoharan-22"
                },
                {
                    "user_id": "Esha Pramanik",
                    "user_href": "/profile/Esha-Pramanik-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajat Pandey",
                "href": "/profile/Rajat-Pandey-50"
            },
            "answer_text": "COGNIZANT CAREER HIERARCHY Cognizant is an American multinational company which provides consulting services, custom information technology and business process outsourcing services. This is an IT services company which has its legs in many countries all over the world but with headquarters in New Jersey, USA. Like other IT consulting and service companies, Cognizant too works with the support of various employees placed at many different job positions. There is a proper hierarchical system or structure followed in the company on the basis of which an employee is promoted. To understand this structure, you can go through the following given information. Programmer Analyst Trainee At the bottom of the hierarchical structure at Cognizant is the position of a programmer analyst trainee. This is the entry level position at which one can work after graduating in the field of IT from a college or university. This is a position where one can learn, acquire skills and offer his/her services for a prescribed training duration. These individuals are also known as IT assistants. Programmer Analyst The position of a programmer analyst or an IT analyst is a step higher than the IT trainee. Programmer analysts report to project managers and their job is to ensure the smooth running and maintenance of a computer network. They must configure, deploy and monitor the data networks and infrastructure to reach technical excellent. IT Engineer/Associate An IT engineer’s job position is a position which requires a candidate to have exceptional IT knowledge, skills and clarity of mathematical concepts, technical concepts and other related skills. An IT engineer or associate plays an important role in the hierarchical structure of this company IT Project Manager The position of an IT project manager is senior level position at which one can reach after spending atleast 5-7 years in the company or in the industry. The entire technical staff works under the supervision of the project manager and report to him. The main responsibility of an IT project manager is to complete the projects on time and within the budget. Director After a person has spent enough number of years as an IT project manager and then the senior manager (this position is valid at some branches of Cognizant), he/she can then aim for the position of the director. This is the senior most position in the company and is occupied by someone who has the right experience, track record, technical skills, managerial skills as well as knowledge. Some of the other job positions which Cognizant may have in some of its branches include Senior Director, President, and Associate President Etc. ",
            "date": "Answered November 23, 2016",
            "views": "654",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Priti Kurdekar",
                    "user_href": "/profile/Priti-Kurdekar"
                },
                {
                    "user_id": "Abhijit Telang",
                    "user_href": "/profile/Abhijit-Telang-4"
                },
                {
                    "user_id": "Atul Aggarwal",
                    "user_href": "/profile/Atul-Aggarwal-69"
                },
                {
                    "user_id": "Sakthivel Palanisamy",
                    "user_href": "/profile/Sakthivel-Palanisamy-4"
                },
                {
                    "user_id": "Vani Yadagiri",
                    "user_href": "/profile/Vani-Yadagiri"
                },
                {
                    "user_id": "Ashok",
                    "user_href": "/profile/Ashok-585"
                },
                {
                    "user_id": "Rajashekar Mudaliar",
                    "user_href": "/profile/Rajashekar-Mudaliar-1"
                },
                {
                    "user_id": "Shenandoah Duraideivamani",
                    "user_href": "/profile/Shenandoah-Duraideivamani"
                },
                {
                    "user_id": "Ashutosh Singh",
                    "user_href": "/profile/Ashutosh-Singh-1839"
                },
                {
                    "user_id": "Reeturaj Banerjee",
                    "user_href": "/profile/Reeturaj-Banerjee-1"
                }
            ]
        }
    ]
}