{
    "title": "What happens if some one is on parole and cuts their ankle monitor off? Do they catch another charge? Also could that person press charges on someone before or after being arrested for parole violation? - Quora",
    "tags": [
        "Ankle Monitor",
        "Parole Officers",
        "Parole and Probation",
        "Prisons and Prison Life",
        "Police Procedures",
        "Police and Law Enforcement",
        "Legal Issues and Law in Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Edgar D. McDonald II",
                "href": "/profile/Edgar-D-McDonald-II"
            },
            "answer_text": "No, its a technical violation and a very serious one at that. I would compare it to police catching a Child Molester with a victim, in his house, with no one else present, before something happened. Not strictly a law violation, but a violation of parole likely to get your parole revoked. That right there is a serious violation and one likely to get you back into prison. If you wear an ankle monitor in California it’s because of your commitment offense. OR, you are judged to be a high risk parolee, like a Child Molester, a predatory rapist, or a stalker. This is one of those “technical violations” you hear about. “I committed a technical violation and I was sent back to prison because I didn’t pay my supervision fee.” No, try a number of charges with at least one as serious as this. If the person was stalking a victim, in violation of a restraining order, well yes the victim could notify the Parole Officer, who would discover the ankle monitor was cut off. The violation report to the Parole Board would cite the following conditions were violated. Stalking someone, removing the monitor, violating curfew, plus, if they went places they were not allowed to, a violation for being somewhere prohibited, for each instance. That said there was a scandal involving a parolee who didn’t remove the monitor. He instead tried testing the limits. He visited a State Prison, violated curfew, and was in the immediate area where murder victims graves were discovered. State Parole caught all kinds of grief for failing to supervise this individual. ",
            "date": "Answered April 13, 2020",
            "views": "245",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Fuhrman",
                    "user_href": "/profile/Jeff-Fuhrman"
                },
                {
                    "user_id": "Morgan Holland",
                    "user_href": "/profile/Morgan-Holland-25"
                },
                {
                    "user_id": "Bill Reynolds",
                    "user_href": "/profile/Bill-Reynolds-31"
                },
                {
                    "user_id": "Tudor Rus",
                    "user_href": "/profile/Tudor-Rus-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Dubavs",
                "href": "/profile/Robert-Dubavs"
            },
            "answer_text": "In the state I live in in Australia if you remove your ankle monitor your parole is revoked. You also get charged with damaging government property and illegally removing the monitor. For people on bail and the condition being they have to wear a ankle monitor as part of getting bail. They also get charged with removing and damaging the monitor as well as failing to appear in court if they are still on the run after that court date has elapsed. ",
            "date": "Answered April 13, 2020",
            "views": "169",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stéphane Mandelert",
                    "user_href": "/profile/Stéphane-Mandelert"
                },
                {
                    "user_id": "Mihaela Rozorea",
                    "user_href": "/profile/Mihaela-Rozorea"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Strand",
                "href": "/profile/Peter-Strand-13"
            },
            "answer_text": "Shit in Kentucky you get an escape charge and tampering with/destruction of government property. I don’t see why you couldn’t press charges on someone regardless of when you get arrested, best to do it before you get hit. ",
            "date": "Answered April 13, 2020",
            "views": "129",
            "upvotes": "0"
        }
    ]
}