{
    "title": "What are some mind blowing inventions technology? - Quora",
    "tags": [
        "MindBlowing",
        "Invention and Inventions",
        "Knowledge"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Kirby",
                "href": "/profile/Craig-Kirby-5"
            },
            "answer_text": "Things that work like levers. Hydraulics (pretty good) - pump a small hand piston a lot and make a big piston move a tiny amount but with a stack more force than a human could apply. Think car jack.Levers (awesome) - get a lever and balance it on a fulcrum so that one end is a lot longer than the other, the pull down a lot on the long end. The result is a small amount of shift on the short end, but with a stack of power.Wire - (Freakin awesome! -And my favorite as an Australian) Get a 1km length of fencing wire that you could never pull tight by hand and double it back on itself for a few feet then twist with a lever (eg. a screwdriver). You can shift a house if you have enough wire and a screwdriver to twist it with.The standard bee hive is pretty cool as well. That thing works really well, and has pretty much made modern agriculture possible. The trick (as I understand it) was setting the gaps between the frame things the bees made combs in. But my all time favorite invention is one that is the only idea I’ve ever been genuinely, massively envious of, and that's this beehive that has fake honeycombs that with the twisting of a lever, sp[l]its the comb so the honey flows out. It’s just so obvious in hindsight as a way to make a beehive. I want to own one, I want to invest in it, I want to have invented it so bad. Why didnt I think of it? AAAgggghhhhh!!! Few things in my life have ever made me have a cross between an “ahahh!” moment as mental comprehension, and pure envy :) (for the record (sadly) I have nothing to do with the thing, other than intending to buy one when I can) ",
            "date": "Answered April 26, 2018",
            "views": "593",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shahed Mohammad",
                    "user_href": "/profile/Shahed-Mohammad-5"
                },
                {
                    "user_id": "Dermot McCloskey",
                    "user_href": "/profile/Dermot-McCloskey-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santhosh Kumar",
                "href": "/profile/Santhosh-Kumar-1360"
            },
            "answer_text": "“SignAloud” : Gloves that translate sign language.  It’s a pair of gloves that can recognise hand gestures that correspond to words and phrases in American Sign Language. Each glove contains sensors that record hand position and movement and send data wirelessly via Bluetooth to a central computer. The computer looks at the gesture data through various sequential statistical regressions, similar to a neural network. If the data match a gesture, then the associated word or phrase is spoken through a speaker.  This is developed by UW sophomores Navid Azodi and Thomas Pryor translate American Sign Language into speech and text. ",
            "date": "Answered February 15, 2017",
            "views": "544",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Samuel McGowan",
                    "user_href": "/profile/Samuel-McGowan-1"
                }
            ]
        }
    ]
}