{
    "title": "What are the key issues that will determine the presidential election? - Quora",
    "tags": [
        "Presidential Elections",
        "Elections",
        "Political Campaigns in the United States of America",
        "Presidents",
        "2016 US Presidential Campaign and Election",
        "Political Campaigns",
        "US Presidential Elections",
        "Problem Solving",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Gogins",
                "href": "/profile/Michael-Gogins"
            },
            "answer_text": "This is an excellent and important question! However, let us consider the meaning of the term “key issues.” On the face of it, this refers purely to political issues such as the objectives of the political parties’ platforms. And yet, events that were not purely political had a tremendous impact on the 2016 election, including efforts by both parties to smear the candidate of the other party (the Democrats’ smears were considerably more truthful, the Republican smears were blatant lies, but smearing was still the objective). Foreign interference from Russia certainly also played a part, and unfortunately, it’s hard to say whether that role was decisive, or not. Then too accidents and mis-judgments may have played a decisive role, as when the head of the FBI, James Comey, released information about Hillary Clinton’s emails a few weeks ahead of the election. All of this lying, smearing, propaganda and whatnot will quite possibly still play a role, even a decisive role, in the 2020 election. However, I will actually answer the question purely about key political issues. There are many important issues in the upcoming election. I would rank them from most to least important as: Anthropogenic global warming is real and must be fixed. It can be fixed. This is issue number one because the time to start dealing with this — and we will deal with it one way or another — is now. Dealing with this now would actually grow the economy, especially for workers, and might end up saving many species extinctions and the lives of millions of climate refugees.The existence of white privilege, a vestige of Jim Crow and the pre-Civil Rights system. The Republican Party panders to supporters who wish to uphold this with code words and dog whistles, the Democrats either try to ignore it, or try to do something about it, not much, but something is a lot better than nothing.The practice of dishonest propaganda on a very large scale through social media. This is a terribly serious problem that is not getting enough attention. It happens mostly on the right wing, but the far left also is quite guilty. This will end democracy in the United States if it is not fixed, because most voters are not well enough educated to do more than read or view some sort of news before they vote. The amount of lying in the “news” has skyrocketed. In my view, the pattern was set by Richard Nixon and Ronald Reagan. Nixon was literally a crook, and Reagan was much more interested in a folksy image than in facts. However, President Reagan was a far better President than President Trump.The changing class structure of the United States. When I was growing up in Salt Lake City, Utah, in the late 1960s, a working class bricklayer or construction worker could buy a house and send his children to college. This is now much more fraught what with the weakening of labor unions, changes in laws, efforts to reduce social welfare programs, and, above all, the decades-long increase in the total share of wealth and income taken by the upper class and the upper middle class. (Disclosure: I suppose I am upper middle class.)Globalization is a real thing. Unlike what a lot of people here seem to think, it is mostly a good thing. It reduces the cost of living and it reduces the risk of war. It also increases the amount of foreign travel and education. These are all good things. However, right-wingers are correct in that globalization is harming middle and working class Americans by forcing them into an unfair and exploitative labor market. Globalization is also harming the situation in our country for start-up corporations by creating huge monopsonies in the tech business, both in the United States and in China, such as Google or Huawei. What the right wing misses is that other countries who are also globalized do not suffer from our sort of upper class, which uses globalization against both workers and business competitors.The maintenance of Enlightenment values in the United States political system, educational system, and public life. The United States Constitution was created by men educated in the Enlightenment and holding Enlightenment values. The Constitution is in no way a Christian document. The vital university system across the world is also based on Enlightenment values. These values include freedom of religion, freedom of sexual expression, and above all freedom of inquiry and speech. There very definitely is a vocal minority who tries to defend human rights, which are Enlightenment values, by shaming and canceling people, which are very definitely not Enlightenment things, but the acts of a would-be one-party system, in this case of the Left.It is possible, as well, that the Trump Administration is a threat to the present and future rule of law in the United States. That Trump ignores the law when he can he has made very clear, e.g. in commuting the sentence of convicted felon Roger Stone, and in successfully resisting the Constitutional subpoena power of Congress. Unfortunately, I have no way to evaluate the scale of this threat. ",
            "date": "Updated August 6, 2020",
            "views": "661",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matt Chanoff",
                    "user_href": "/profile/Matt-Chanoff"
                },
                {
                    "user_id": "Daniel Thibodeaux",
                    "user_href": "/profile/Daniel-Thibodeaux-2"
                },
                {
                    "user_id": "Paul Berman",
                    "user_href": "/profile/Paul-Berman-15"
                },
                {
                    "user_id": "Nicolette Brown",
                    "user_href": "/profile/Nicolette-Brown-10"
                },
                {
                    "user_id": "Charlie Reid",
                    "user_href": "/profile/Charlie-Reid-13"
                },
                {
                    "user_id": "Mika Timonen",
                    "user_href": "/profile/Mika-Timonen-1"
                },
                {
                    "user_id": "Adam Derringer",
                    "user_href": "/profile/Adam-Derringer"
                },
                {
                    "user_id": "Patricia Panora",
                    "user_href": "/profile/Patricia-Panora"
                },
                {
                    "user_id": "Naomi Lauren",
                    "user_href": "/profile/Naomi-Lauren"
                },
                {
                    "user_id": "Jeff Redman",
                    "user_href": "/profile/Jeff-Redman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Jackson",
                "href": "/profile/Paul-Jackson-8"
            },
            "answer_text": "The key issue is the voter’s ability to remain logical and conscious when voting. Voting for Joe Biden goes against all logic. Yes, Trump is disgusting. He’s revolting. He’s crass. He offends our base animal brains. That’s not rational. That’s not something we should think about when making logical decisions about the future. Sadly, Trump is the logical choice for the American voter. I resent that. I hate that. I wish it weren’t true. I wish the DNC had given us a more logical choice, but they didn’t do that. I am very angry about that. I blame the DNC for giving us 4 more years of Trump. Let me elaborate. On the surface, Joe Biden seems like a “good guy.” He’s jolly. He makes jokes. He’s a simp. But he’s also a fraud. His son took billions in bribes from our enemies around the world, even illegally. When he was investigated by a foreign nation, Joe Biden extorted the government of Ukraine to fire the prosecutor investigating him, saying he’d withhold nation building amounts of guaranteed loans from the USA federal government. The magnitude of that is unconscionable. He used the power of the federal government of the United States of America while he was 2nd in command to prevent his son from being held accountable for illegal behavior. He is so entirely morally corrupt, he thought his actions were something to brag about.  When asked about the conflict of interest, he gets very angry and deflects to what Trump has done. This is a form of psychological manipulation to hide the truth. Biden knows full well what he did was morally bankrupt. He consciously knows he is a horrible human being.  It doesn’t stop there. Joe Biden ruined the life of a man, who tried to save his wife’s life after a car accident. He said his wife was killed by a drunk driver. The driver wasn’t drunk. Joe’s wife ran a stop sign and was broadsided by a truck driver. “It was a tragic accident. No alcohol was involved.” Joe Biden’s wife caused the accident. It was an accident. It was tragic, but Joe Biden ruined the driver’s life to promote his own political agenda. Horrible, dishonorable behavior.  After the accident, he used his son as a political prop. Did he experience a horrible experience. Yes, I think so. Unimaginably horrible. To parade the media through the hospital like that, though, I don’t know. Seems kinda sketchy to me. Like political power was more important to him than his own family.  Let’s talk about sexual impropriety. Men, or women, but in this case, men in power who sexually manipulate women are predators. It’s disgusting. Trump is a sexual predator. I think that is true. There are also many allegations that Joe Biden is a sexual predator. You’ve seen the videos of him groping females of all ages already, but it’s not just Joe Biden. It might be genetic. His son Hunter might be a sexual predator as well after blood tests proved he abandoned a child in Arkansas. He didn’t pay child support. He just walked away and abandoned his responsibilities as a man and father to a child he created.  Biden won’t answer any questions about the incident and instead attacks anyone who asks them. If you are a Joe Biden supporter, you might dismiss this video, just because it came from Fox News, but I’ll include it anyway for those with an open mind. If you can get past the Fox News, which Biden himself cannot, he ad hominem attacks the reporter and insults him with a sarcastic remark that he is “classy.” This is a form of emotional manipulation and also a projection of Hunter Biden’s own lack of class in refusing to help care for his own child. Remember, Hunter Biden has taken at least a billion dollars from politically connected people around the world and even still, is entirely too greedy to care for his own child. Let’s see Biden’s psychological immaturity on display as he dismisses, attacks, and projects his family’s immorality onto the reporter. Watch Joe Biden’s face as he calls the journalist a good man and classy, right at the end before the two reporters come on. That’s the look of an evil person. Good ol’ Joe is not good.  Sure, it’s a private matter. That’s right. But Trump’s private matters are fair game. What kind of man raises a son who becomes that person? Hunter doesn’t just have lady problems either, he has drug problems too. He was ousted from the navy for drug use  The problem here, is that Joe Biden got his son an Honorable Discharge, something that doesn’t generally happen for drug use. More unethical string pulling from daddy Joe to protect his son. Not only that, but the double standard is incredible. He has put more drug users in jail than anyone in history. His crime bill, and his VP’s 2,000 prosecutions for pot use in California, have ruined the lives of so many minority families that I believe it is a crime against humanity. Someone smoking pot going to jail and the entire family suffering their loss is egregious. He does that, while he reduces the penalties for his own son. It’s ethically unimaginably abusive. If you think it stops there, it doesn’t. Biden has run for President several times before and lost. At least twice he lost for blatant plagiarism of other politician’s speeches. Plagiarism is a form of fraud. Joe Biden is willing to commit fraud, because Joe Biden is a fraud.  He lied countless times about his credentials, his actions, and his beliefs  So, if this race is about how nice or gross or disgusting either of the candidates are, we have no choice but to vote for a morally bankrupt individual and even on this scale, I thing Biden is a morally worse human being than even Donald Trump. So, weigh the options logically. Don’t fall for the personal attacks on either Joe or Trump. They are both horribly corrupt people. Evil, narcissistic individuals who have sacrificed the lives of many, many people to get their power. They have taken power from people, freewill from people, who have very little of it already to give themselves the power to fire foreign officials to protect their son. I’ve gone past the man’s moral and ethical corruption and looked at his policies too. He’s done nothing in 40 years that I can identify as having had a positive impact on the state of society in America. Lots of wars, prisons, debt, healthcare blunders, modern day slavery, trade deals that have decimated the middle class and urban centers of America. The largest output of petroleum in our nation’s history, releasing tremendous amounts carbon into the environment that is already past the tipping point. We may have lost an entire planet because of Joe Biden. America and the world may not be able to recover from the policies of Joe Biden. Make no mistake: The existence of life on this planet may be in jeopardy because of Joe Biden and his greed and he has committed to continue fracking. He has committed to continue supporting his Wall Street cronies. He has all but completely rejected the Green New Deal. He has not agreed to legalize the marijuana that has wrongfully imprisoned millions of fathers and ruined the nuclear family. He has voted for war every chance he got. He has voted for private prisons every chance he got. He has voted to give more money to banks and retroactively legalize their crimes that would go on to destroy the entire world economy. He wrote the Patriot Act that invaded all Americans’ privacy with impunity and again, retroactively legalized crimes against our fellow citizens. He criminalized acts of free speech. The Black Lives Matter movement began under his vice presidency and he has done nothing. What reason is there to vote for Joe Biden? I can’t find one. I can’t find one single reason to vote for Joe Biden. There’s no logical reason to vote for him and any personal reason that tries to elevate Joe Biden above Donald Trump falls flat. At best, the competition of personal character is a wash. Why is that all the DNC wants you to consider? Ask why. I think it’s because Biden has been on the wrong side of history with every single vote. It’s wrong. I am embarrassed by our nation that these two deplorable examples of humanity are our top two contenders for the most powerful office in the world. ",
            "date": "Answered September 28, 2020",
            "views": "299",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dale Grillot",
                    "user_href": "/profile/Dale-Grillot"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "José Antonio Santiago",
                    "user_href": "/profile/José-Antonio-Santiago-1"
                }
            ]
        }
    ]
}