{
    "title": "What is a purpose-driven business? - Quora",
    "tags": [
        "Business Advice",
        "Purpose",
        "Entrepreneurship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leyla Mathews",
                "href": "/profile/Leyla-Mathews"
            },
            "answer_text": "These days, purpose is becoming increasingly mainstream. You’ll find it sprinkled throughout your social media feed and making headlines at the Cannes Lions International Festival of Creativity. Leaders at companies, global brands, nonprofits, and everyone in between are asking that important question: what does purpose look like in practice?  It helps to start with a clear, shared definition of purpose. My take is that purpose is an organization’s aspirational reason for being, beyond profits alone. It’s why an organization matters to people. “Companies can do more than just make money, they can serve others,” says Salesforce co-CEO Marc Benioff. “The business of business is improving the state of the world.”  A purpose-driven company stands for and takes action on something bigger than its products and services. Purpose can be an organizational strategy and a roadmap to remain competitive in a fast-changing economy. According to PwC, 79 percent of business leaders believe that purpose is central to success. Despite this, less than half of employees know what their organization stands for and what makes it different. So, how do organizations pursue purpose successfully? It starts with articulating a clear, authentic, and long-term purpose – something that is true today, and that guides the organization into the future. What’s next? Here are a few examples of what purpose-driven companies do that set them apart. 1. They integrate purpose into core business strategy Purpose can be a way to set organizational strategy and guide decision-making. This is increasingly important now, at a time when companies are being challenged to make tough choices. Take CVS Health. In 2014, what was then called CVS Pharmacy became the first U.S. drugstore chain to stop selling tobacco products. Public ideas about health are changing rapidly as a result of technology, medical research, and preventive and wellness services. CVS realized that tobacco didn’t align with its purpose: “helping people on their path to better health.” CVS didn’t just remove of tobacco from its stores; it launched several programs to help smokers quit. The move resulted in 95 million fewer cigarette packs sold and a four percent increase in nicotine patch purchases. While CVS lost $2 billion in annual cigarette sales in the first year of its new policy, its pharmacy sales jumped – and are up more than four percent in the last quarter. Eliminating tobacco from its shelves was an important step toward credibly rebranding the company from CVS Pharmacy to CVS Health. These changes resulted in a 10 percent increase in revenue, notably via growth in pharmacy benefits management – a business play that might not have been possible without its renewed focus on purpose. Living its purpose also led CVS to a $69 billion merger with Aetna and significant stock gains. It’s true that CVS isn’t perfect. The company still sells products with potentially questionable chemicals, sugary foods, and alcohol. Yet, purpose is a journey. CVS is using purpose as a “north star” to guide its business strategy — which it brings to life through a cross-functional approach. For example, when it was time to make decisions about how to remove tobacco from stores, CVS assembled a team from finance, merchandising, marketing, corporate social responsibility, retail store operations, and inventory. Any area of the company that would be directly impacted had a seat at the table, connecting purpose strategy to the people working in the stores. “We need all our colleagues to connect with our purpose,” Boone explained on our Purpose 360 podcast. “Employees in our stores, in our mail rooms, and in finance – they should all be able to see how their work is helping people on their path to better health.” 2. They link employees’ day-to-day work to a larger, shared purpose Timberland also strives to link purpose with the daily work of employees across its business. As one of America’s go-to outdoor apparel brands, the company encourages each employee to be an earthkeeper, a term that encapsulates Timberland’s three core values: creating responsible products, protecting the outdoors, and serving communities around the world. “Being an earthkeeper is a whole philosophy and approach to how we do business,” said Atlanta McllWraith, Senior Manager in Corporate Social Responsibility. “Employees don’t have to check their values at the door when they come to work. Their values and beliefs are a part of the work we do.” Earthkeeping starts with the people who design, make and market Timberland products. In 2007, the company accelerated efforts to reduce waste and use fewer chemicals through its first fully sustainable product line, the earthkeeper’s boot, setting sustainable standards that have expanded to Timberland’s entire footwear line. Today, 100 percent of its footwear includes at least one eco-conscious material, such as recycled polyester or rubber. All leather is sourced from gold or silver rated tanneries, and more than 345 million plastic bottles have been recycled as shoelaces or other footwear features. Timberland doesn’t only connect its purpose with day-to-day roles, but to broader issues impacting the people who make its products. When the company found that factory workers lacked access to clean drinking water, it partnered with Planet Water Foundation to install purified water towers in several worker communities. Not only did these efforts result in higher productivity and lower absenteeism rates, but it supported the vitality of the community as a whole. 3. They use a purpose mindset to advance measurable goals Stand-out companies set measurable goals to put their purpose statement into action. For example, at the heart of Alaska Airlines is a sense of stewardship for the people and places it serves. To bring that ethos to life, the airline sets measurable targets around three key pillars: “make flying matter,” “invest for stronger communities,” and “fly greener.” The global aviation industry produces around 2% of all human-induced carbon dioxide emissions. To fly greener, the company is tackling the air pollution caused by commercial aircraft. In 2013, it became one of the first airlines to outfit a portion of its fleet with split scimitar winglets. This improved the efficiency of each plane by about 34,000 gallons of fuel annually, saving a total $20 million in annual fuel costs. A pioneer in biojet fuels, Alaska Airlines partnered with Neste to lay the groundwork for industry-wide adoption of renewable fuel options, such as forest residuals, made from the stumps and branches leftover after a timber harvest, and a cleaner alternative to traditional jet fuel. So far, Alaska has reduced its emissions by more than 35 percent per passenger mile since 2004. Plus, the company is joining other airlines on an ambitious goal to reduce net aviation CO2 emissions by 50 percent in 2050 relative to 2005 levels. The airline also stopped serving non-recyclable plastic straws and citrus picks, advancing its goal to reduce inflight waste by 70 percent by 2020. In 2018, flight attendants recycled an estimated 1,963 tons of cans, cups, paper and other materials. For two years running, Alaska Airlines has been ranked the most sustainable airline in North America by the Dow Jones Sustainability Index. The company has creatively pushed the boundaries of how airlines take care of the ecosystems in which they operate. “We care about running a great airline and making a positive impact on the places and people we serve,” said Director of Sustainability, Kirk Myers. “When we are at our best, we do so in ways that strengthen our business and accelerate our growth.” And, the company has the metrics to prove it. 4. They harness the power of purpose to innovate Organizational purpose can drive innovation. IBM’s business purpose is to “make a connected world smarter.” It harnesses that purpose to drive profitable innovation through programs like Smarter Planet, which in its first year grew to be the focus of a quarter of the company’s research. IBM connects purpose-driven innovation to the market through its Smarter Cities challenge, which invites governments to submit thorny environmental, social or infrastructural challenges. The company harnesses its expertise and technology to create solutions. It’s reached more than 100 cities so far. Stockholm saw a 22% reduction in traffic congestion and a $92M annual gain in revenue; Bolzano realized a 30% savings in services for its aging population; Malta reduced water consumption 15% and energy use 25%. This isn’t disinterested philanthropy. Revenue associated with Smarter Cities solutions increased 50%, and the Smarter Planet program as a whole has driven more than $7 billion in revenue. Those who are aware of the program are two – three times more likely to consider partnering with IBM. This aligns with current research, which shows that 68 percent of executives believe purpose gives companies the agility to innovate in times of disruption and 59 percent believe purpose can drive transformational change. That’s particularly true of big picture organizational purpose. Yet even evolving traditional philanthropy programs to a broader focus on social purpose can deliver meaningful results. For example, we conceptualized My Special Aflac Duck, a social robot that helps kids cope with cancer. It’s a good example of social innovation. With four patents pending, lifelike movement and emotions, and a Bluetooth-enabled app, the duck uses interactive technology and play to help children on their cancer journey. It also demonstrates the company’s interest in Designed through 18 months of child-centered research with partner Sproutel, My Special Aflac Duck is now in the arms of more than 4,400 children in the U.S., is the recipient of more than 20 awards and is soon set to debut in Japan. In less than one year, the program resulted in 15 percent U.S. awareness of My Special Aflac Duck. Among those who know of the purpose program, 100 percent are more likely to buy an Aflac product. In June 2019, the Cannes Lions Festival of Creativity awarded My Special Aflac Duck a Silver Lion for Corporate Image, Communications and Reputation Management and a second Silver Lion for Use of Technology that “pushes the boundaries of digital innovation.”  A student works on a coding challenge at Computer Science Education Week with Salesforce employees in Dublin, Ireland. 5. They engage their partners around purpose Purpose goes far beyond traditional philanthropy. It is a business strategy, and so will eventually reach suppliers, customers, distributors, and the whole of a company’s operations. Companies that articulate their core business purpose often seek to evolve the way they engage with society, as well. Surprisingly, that can be good news for a company’s nonprofit partners. Take the United Way Worldwide, the world’s largest privately funded not-for-profit. With nearly 1,800 local offices in more than 40 countries, the United Way specializes in bringing people together to identify and solve local issues. At the same time, United Way aims to be a strategic partner for the corporations and businesses supporting its work. “The first question we ask is: what do our customers want?” said William Browning, Chief Strategy and Transformation Officer for United Way. “Our customers are the communities we serve, our corporate partners, and our individual donors. It’s essential to listen and know your customers in order to provide value.” To provide greater value to corporate donors, United Way partnered with Salesforce.org to create Philanthropy Cloud. The online global platform connects employees with one another and the causes they care about most, since the platform enables them to give and to find, organize, and track volunteering opportunities that align with their interests. Corporate partners can connect with their employees, collaborate with other purpose-driven companies, and gain a greater view into the ways their philanthropy is impacting local communities. By connecting companies and employees with causes around the world, United Way is embodying its purpose to advance the common good by mobilizing the caring power of communities. To evolve your approach to giving, learn more about Salesforce.org Philanthropy Cloud in this data sheet. Purpose Driven Companies Take a Stand Purpose-driven companies come in all shapes and sizes and can be found in industries all over the world. The one thing they have in common is a clear understanding of what they stand for, and a willingness to take a stand in ways that create long-term value for their company and all the people they serve. It’s no longer a question of if an organization should lead with purpose, it’s about how. Watch this webinar for more on how to build a culture of employee volunteering, which is one component of much broader strategies used by purpose leaders. ",
            "date": "Answered November 5, 2019",
            "views": "157",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andre Ewert",
                "href": "/profile/Andre-Ewert"
            },
            "answer_text": "Something you feel called to..something that makes you come alive…iy ignites your Inner flame like those Arvchitects or architectural Students that get a Natural High Creating New Spaces, or that lecturer that Inpires People from On-Stage, or that teacher that care about the outcome of their students. It goes behind the Objective of just making a Buck. It involves a Mission, like that Film-maker that brings Good stories to the World. Get clarity on what is Yours. You need to step into a Mindset of Abundance, of Fullness to truly tap into your transcendant role on this Planet…like those Ukulule players that are dreaming of riding into the Sunshine , as lone Cowboys, on their quest of musical splendor.   Ennio Morricone - The Mission Main Theme (Morricone Conducts Morricone) Love Life Loud and Clear ",
            "date": "Answered November 2, 2019",
            "views": "46",
            "upvotes": "0"
        }
    ]
}