{
    "title": "What is Raspberry Pi and what is it used for? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Francis Chen",
                "href": "/profile/Francis-Chen-2"
            },
            "answer_text": " Raspberry Pi is a micro-controller (a mini-computer, essentially) used for open source hardware projects and rapid prototyping for future hardware start-up ideas.  For young children, it is a great way to get them interested into electrical engineering and computer science concepts. Much of the programming takes place in Python, which is done to the computer, and then imported into the Raspberry Pi. It is also used in robotics competitions as well:   I just saw an article on Techcrunch where people used Raspberry Pi to make even a Gameboy like device!   I'm interested in urban agriculture, for example. This guy uses Raspberry Pi to monitor and track the status (i.e. soil, water, temperature, light) of his tomato plants:   My background is in urban planning, and urban planners are also interested in dealing with transportation and traffic. You can also use Raspberry Pi to create a Bluetooth traffic monitoring device to collect traffic data:   Source of image: Integreen Brings Open Source Traffic Monitoring To Italy   We all love eating and food. MAKE Magazine (highly recommended!) featured the article, Cooking a Raspberry Pie with a Raspberry Pi, where maker Nathan Broadbent used Raspberri Pi to make a more user-friendly microwave that \"reads and executes instructions for cooking food\".   Source of video: Raspberry Pi Microwave Health and wellness is becoming a more bigger topic in the 21st Century. Imagine creating open-source health sensor products sing Raspberry Pi:    e-Health Sensor Platform V2.0 for Arduino and Imagine that you can track your muscle, blood pressure, oxygen and heart pulse, or even temperature using Raspberry Pi.    For photography geeks, you can also use Raspberry Pi to produce time lapse photography:   Source: Time-lapse Photography with the Raspberry Pi Camera The camera itself costs only $30, Raspberry Pi Camera & Infrared Camera According to this site, \"The Raspberry Pi Camera can shoot 1080p30 true high definition video, as well as 5 megapixel static images.\" I'm pretty bad at learning music. Shane Stripe created a Easy as Pi Piano that makes it easier for people to learn how to learn musical chords!   According to YouTube, Shane says:  My dad and I made the Easy as Pi Piano system to make learning chords faster and easier. This project took about 50 hours to complete due to the fact that we were new to the Python programming language. The Easy as Pi Piano system functions as a piano teacher. Learn to play the chords to your favorite song! The servo motor lasers show you which keys to play. Slow it down or speed it up with the scale. On the monitor, you will see the finger placements, the current chord, and the lyrics to the whole song. We hope that our hard work makes learning how to play piano easy as pie. Source: Easy as Pi Piano    Behind the piano The list of applications go on and on, and on...  What's pretty freaking awesome about Raspberry Pi is that it has made it significantly easier and cost-effective to make a product. In the past, we depend on large companies and research institutions to make these sort of things.  Now, anybody with a computer, an understanding of programming, can purchase the Raspberry Pi for about $35 to create amazing hardware projects in a matter of weeks. Raspberri Pi has helped people through Kickstarter prototype and create hardware-like startups, and has lowered the barrier of entry into the hardware field. It's also made it easier for people from a non-technical background to get excited about electronics too. However, the current drawback is that it is still in it's early stages. Raspberry Pi is a big part of what's driving the Maker Movement, however you have to sort of create your own job (read: be an entrepreneur) to be a part of the maker movement.   I argue the bigger question really is: how do you use Raspberri Pi to transform a weekend backyard project into a useful, easy-to-use product that people want to use in their everyday lives?  For example, if you search up sous vide cooking (according to Wikipedia: \"a method of cooking food sealed in airtight plastic bags in a water bath or in a temperature-controlled steam environment for longer than normal cooking times\"), and \"sous vide cooking raspberri pi\", you'll see something like this:   But in reality, people are likely to use or buy something like this:   Nomiku: Immersion Circulator and Sous Vide Machine The founders of this project actually took some night courses on Arduino (another open-source hardware project), but learned how to prototype Arduino to create something similar to the first image.  However, they decided they wanted to turn this into an actual business, and worked with Haxlr8r (a hardware start-up accelerator: Home - HAXLR8R) and designers to transform this to an everyday (consumer) product.  The challenge really is that if you Google images of Ardunio or Raspberry Pi, you'll see pictures that look like the first image: weekend backyard projects. ** People like real life applications, which is why when I explain Raspberry Pi or Arduino to people, I have to use real-life examples because people like results.  Marketing its day-to-day applications and possibilities will help drive Raspberry Pi or Ardunio into everyday, mainstream culture.    ** I want to add that I have nothing wrong with images of weekend backyard projects, only to show that they only market to a niche of people who are already makers.  The problem with STEAM education from elementary to high school that many children aren't trained or have the adequate resources (i.e. robotics summer camps) to think about the process or details of making things. Learning the process is sometimes very painful, hard, and at times \"boring\".   People like to see the results of the product (i.e. Nomiku) rather than the slow process of programming or designing Nomiku.  While I argue that not everybody should be an engineer or scientist, I think having some familiarity with the process of building things will empower us to navigate what is increasingly a technology-driven world. ",
            "date": "Answered June 16, 2014",
            "views": "122",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eeyy Wakee",
                    "user_href": "/profile/Eeyy-Wakee-1"
                },
                {
                    "user_id": "M Juhdi",
                    "user_href": "/profile/M-Juhdi"
                },
                {
                    "user_id": "Albert Lee",
                    "user_href": "/profile/Albert-Lee-57"
                },
                {
                    "user_id": "Ryan Kony",
                    "user_href": "/profile/Ryan-Kony"
                },
                {
                    "user_id": "Sharanya Ryalla",
                    "user_href": "/profile/Sharanya-Ryalla"
                },
                {
                    "user_id": "Utkarsh Bajpai",
                    "user_href": "/profile/Utkarsh-Bajpai-19"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Dhruv Dave",
                    "user_href": "/profile/Dhruv-Dave-1"
                },
                {
                    "user_id": "Chintan Panchal",
                    "user_href": "/profile/Chintan-Panchal-7"
                },
                {
                    "user_id": "Shripad Rao",
                    "user_href": "/profile/Shripad-Rao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manikandan V.R.S",
                "href": "/profile/Manikandan-V-R-S"
            },
            "answer_text": "The Raspberry Pi is a series of small single-board computers developed in the United Kingdom by the Raspberry Pi Foundation to promote the teaching of basic computer science in schools and in developing countries.The original model became far more popular than anticipated,selling outside of its target market for uses such as robotics. Peripherals (including keyboards, mice and cases) are not included with the Raspberry Pi. Some accessories however have been included in several official and unofficial bundles.According to the Raspberry Pi Foundation, over 5 million Raspberry Pis have been sold before February 2015, making it the best-selling British computer. By November 2016 they had sold 11 million units, reaching 12.5m in March 2017, making it the third best-selling \"general purpose computer\" ever. In July 2017 it was announced that the total sales have now reached nearly 15 million units They are made in a Sony factory in Pencoed, Wales The Raspberry Pi may be operated with any generic USB computer keyboard and mouse.It may also be used with USB storage, USB to MIDI converters, and virtually any other device/component with USB capabilities.Other peripherals can be attached through the various pins and connectors on the surface of the Raspberry Pi.The video controller can emit standard modern TV resolutions, such as HD and Full HD, and higher or lower monitor resolutions and older standard CRT TV resolutions. As shipped (i.e., without custom overclocking) it can emit these: 640×350 EGA; 640×480 VGA; 800×600 SVGA; 1024×768 XGA; 1280×720 720p HDTV; 1280×768 WXGA variant; 1280×800 WXGA variant; 1280×1024 SXGA; 1366×768 WXGAvariant; 1400×1050 SXGA+; 1600×1200 UXGA; 1680×1050 WXGA+; 1920×1080 1080p HDTV; 1920×1200 WUXGA.Higher resolutions, such as, up to 2048×1152, may work or even 3840×2160 at 15 Hz (too low a frame rate for convincing video).Note also that allowing the highest resolutions does not imply that the GPU can decode video formats at those; in fact, the Pis are known to not work reliably for H.265 (at those high resolutions), commonly used for very high resolutions (most formats, commonly used, up to Full HD, do work).Although the Raspberry Pi 3 does not have H.265 decoding hardware, the CPU is more powerful than its predecessors, potentially fast enough to allow the decoding of H.265-encoded videos in software. The GPU in the Raspberry Pi 3 runs at a higher clock frequencies of 300 MHz or 400 MHz, compared to previous versions which ran at 250 MHz.The Raspberry Pis can also generate 576i and 480i composite video signals, as used on old-style (CRT) TV screens and less-expensive monitors through standard connectors – either RCA or 3.5 mm phono connector depending on models. The television signal standards supported are PAL-BGHID, PAL-M, PAL-N, NTSC and NTSC-J [ ",
            "date": "Answered December 6, 2017",
            "views": "299",
            "upvotes": "0"
        }
    ]
}