{
    "title": "What are the disadvantages of technology in agriculture? - Quora",
    "tags": [
        "Farming",
        "Agriculture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johan Vorster",
                "href": "/profile/Johan-Vorster"
            },
            "answer_text": "Farming is and can be a very rough undertaking. Dusty, dry, wet, muddy, cold and extremely hot. Technology is a great help for farming, as it gives a lot of certainty in a “world” full of uncertainty. The problem is that technology can be quite fragile. GPS systems are very reliant on metereological conditions. Sometimes conditions reminds us of just how fragile modern technology can be. When technology delays farming activities, because of what ever reason, this can be extremely frustrating and stressful. Of course its getting better, and interruptions are also becomnig less frequent. The value of technology is that it supports decision making on the farm. The problem is that any technology in unexperienced hands can easily support bad decisions also. Technology should be used together with experienced hands, in order to ensure good decision making. It should never be trusted on its own, but it should not be ignored either. Everyday new technology becomes available to the farmer. Its important for industry specialists to review these technologies regularly in order to advise farmers correctly, while explaining in each case how much reliance can be placed on such decision support technologies. We live in exciting times, where technologies scope can only be limited by our imaginations. As we learn the infinite detail of our craft as farmers everyday, every season, and every lifetime, we will forever find technologies ready to help and support us in our daily toil. The razor to apply to farming technology is simple, if its usefull, economical as far as resources, finances or time is concerned, then its propably worth it. If it helps, then its always welcome. I hope I could illustrate in my answer what you were hoping to find with your question? ",
            "date": "Answered April 1, 2018",
            "views": "71",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bhavani D",
                    "user_href": "/profile/Bhavani-D-56"
                },
                {
                    "user_id": "Mwiya Mwangala",
                    "user_href": "/profile/Mwiya-Mwangala-1"
                },
                {
                    "user_id": "Ankita Fonan",
                    "user_href": "/profile/Ankita-Fonan"
                },
                {
                    "user_id": "Curt Yung",
                    "user_href": "/profile/Curt-Yung"
                },
                {
                    "user_id": "Mike Davelaar",
                    "user_href": "/profile/Mike-Davelaar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tuyền Đinh",
                "href": "/profile/Tuyền-Đinh-1"
            },
            "answer_text": "Despite the benefits of technology in agriculture, it also has a wide range of disadvantages. Technology has resulted into introduction of farm imputs such as fertilizerrs whose excessive use destroys the crops' lives.When you get to ask some farmers why they do not want to adopt the new farming methods then they will tell you that fertilizers bring more harm than good. The genetically engineered food treated with chemicals also have adverse effects to the lives of human beings. Some of the machines used in farming also destroy some of the crops when not well handled bringing about loses to the farmers. ",
            "date": "Answered January 27, 2020",
            "views": "483",
            "upvotes": "0"
        }
    ]
}