{
    "title": "What's the next big thing on youtube? - Quora",
    "tags": [
        "Viral Videos",
        "YouTube Personalities",
        "YouTube Channels",
        "Online Video",
        "Videos",
        "YouTube Videos",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Noah Weidner",
                "href": "/profile/Noah-Weidner"
            },
            "answer_text": "The next big thing on YouTube is opportunism. A lot of people would say that this thing already is extremely predominant on the site, as demonstrated by the clickbait, but I perceive this transition to opportunism as a work in progress and I wouldn’t immediately place opportunism and clickbait next to each other. Instead, I would place drama and opportunism right next to each other. There are other people answering this question who are attributing witchhunting and ‘cyberbullying’ to be trends. However, I feel like this merely allude into the large scheme of YouTube nonsense. The site’s integrity has declined over the years, and major YouTubers have been quick to attribute Google / YouTube management to the decline. However, in all sincerity, the cause of YouTube’s decline is not inherently related to the bad copyright system or its priority metrics, but the fact that the quality of content isn’t even good or indicative of talent. This could turn into a heated debate, but I want one person to tell me that the perpetual strain of drama, heated arguments, witchhunting, clickbait, and other varied themes isn’t the epitome of opportunism. These otherwise obsolete kids seek attention, and they get it through these mediums. For that reason, I feel like my previous line about the ‘quality of content’ will only continue to be validated as YouTube’s community continues to fall of its rocker. I wrote a little bit more about this here, where I explain why YouTube has transitioned from ‘video community’ to ‘the front page of Internet drama.’ So, all that said: there’s nothing YouTube can do to control the quality of content on their platform. But you know what they could do instead? Ban all the morons. ",
            "date": "Answered August 28, 2016",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Slim Weston",
                "href": "/profile/Dan-Slim-Weston"
            },
            "answer_text": "if i could guess what the next big thing would be on youtube i would be doing it and not sharing that knowledge, as it is its very hard to predict future fads or popularity. vlogging is not it, prank videos have done well in recent years although suffering from negative perceptions of late after prankers became more desperate to have a high ranking video and going too far. (see: sam pepper). fail videos and accidents ie vehicle or tripping etc have done well but take a lot of work to find and compile, you are also stealing others work in most cases, which can make monitisation difficult (assuming you ask the question to build a popular channel that has a high revenue) womens make up channels have been popular and maybe a similar idea for men could work, although plenty of car channels exist there are many hobbys people enjoy around the world. i think, although not the next big thing, we are seeing more and more parents allowing children on to youtube channels and thats the way i would consider going as that audience must be growing in a big way (see: stampy longnose) subjects for kids being nerf, toys, disney, and games like minecraft. either way you need trial and error, patience, likability, and luck. ",
            "date": "Answered September 7, 2016",
            "views": "795",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ezekiel Amoah",
                    "user_href": "/profile/Ezekiel-Amoah"
                },
                {
                    "user_id": "Michelle Johnson",
                    "user_href": "/profile/Michelle-Johnson-253"
                }
            ]
        }
    ]
}