{
    "title": "What are 5 essential skills every web developer should have? - Quora",
    "tags": [
        "Web Developers",
        "Skills"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Wazeter",
                "href": "/profile/Frank-Wazeter-1"
            },
            "answer_text": "In essence, web development is creation. Creating and transforming ideas into reality. When you drill down into it, design is communication. How is the user experience communicating to the user? Is it in alignment with the intent of the program or site? How is information organized, displayed and accessed. How does functionality expand on the experience? Because fundamentally a well rounded developer will be working in many different facets of a project, the most important essential skills are all “soft skills.” Can you communicate with others on the project (eg team members, managers, end users, anyone keenly interested in the project). Can you translate the technical tasks you’re doing in layman’s terms so that those around you understand project timelines, reasons for delays or explain to someone why a task might be more difficult than they think when they say “it should be simple.”Be multifaceted in your learning. Don’t just learn about programming. Learn art, read literature and human psychology. Diversify your interests and your skill set so you can bring them back to development and make a higher quality experience. At the end of the day, humans are using the program, appeal to human nature.Think multi dimensionally. Know there are no “true” full stack developers - you don’t need to know (and you won’t know) everything about every part of the process, but you should embrace learning and keeping up with everything from UIUX to back end development, to front end development and even databasing. Rounding out your technical skill set so that you can better anticipate how your specialty fits into the greater project and potential issues that may occur during development can be anticipated much better allowing you to smooth out the process.Never stop refining your craft. Always be learning, always be asking questions, always be making your skill set better and better. Tech moves at the speed of light and you’ve gotta keep yourself relevant.Be a problem solver first, programmer second. Solving problems is the modus operandi of the career. Learn how to debug and build around problems and get creative in making a new solution. Coding is cheap - solving problems is gold. Be a problem solver not a coder.",
            "date": "Answered January 18, 2020",
            "views": "17",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tarun Moradiya",
                    "user_href": "/profile/Tarun-Moradiya-1"
                },
                {
                    "user_id": "Shreeya Shinde",
                    "user_href": "/profile/Shreeya-Shinde-5"
                },
                {
                    "user_id": "Winner Winner",
                    "user_href": "/profile/Winner-Winner-8"
                },
                {
                    "user_id": "Fernando Páez",
                    "user_href": "/profile/Fernando-Páez-2"
                },
                {
                    "user_id": "Technical Dadaji",
                    "user_href": "/profile/Technical-Dadaji"
                },
                {
                    "user_id": "Parth",
                    "user_href": "/profile/Parth-157"
                },
                {
                    "user_id": "Wahid Murad",
                    "user_href": "/profile/Wahid-Murad-17"
                },
                {
                    "user_id": "Vishnu Suresh",
                    "user_href": "/profile/Vishnu-Suresh-196"
                },
                {
                    "user_id": "Ricasso Emerson",
                    "user_href": "/profile/Ricasso-Emerson"
                },
                {
                    "user_id": "Sam Smolen",
                    "user_href": "/profile/Sam-Smolen-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Condrey",
                "href": "/profile/David-Condrey"
            },
            "answer_text": "If I were to respond with technical answers or subjects then the list would be endless.  And ultimately the team you work with and the company you work for are going to tell you what you need to know.  If you work as a freelancer you may have some say in the resources you use but if you work for a established company they are going to have things in place and expect you to know those things. Rather, these are not the subjects a web developer should know but more the philosophies and mindset a web developer should have or at least be conscious of. 1) Don't assume that you are correct because you were correct last year.  A web developer should know as much as they can, constantly strive to improve that knowledge, know that their will always be someone else who knows more, and know that everything they know now will be useless tomorrow .. so they don't really know anything at all. 2) If you ever find yourself second Guessing the complexity of a websites flow, err inthe side of confusion.  A web developer should know to never ever trust the user to do anything correctly and the goal is to keep the user semi-comatose for as long as possible. 3) A web developer should know that no code, no matter how minimal, should EVER go anywhere near production until it has been tested because untested code is cursed to always break something.  And a web developer should know that there is aDifference between coding by themselves and coding as a team. 4) A web developer should know JavaScript (knowing jQuery is not a suitable answer), should have convenient access at all times to at least 2 operating systems, half a dozen browsers and email clients because standards are never standard, no device is going to look the same as another. 5) a web developer should know what operating system and browser their boss is going to see their work with and what browser the client is going to review the project with and make sure that's the first thing that they test for because your boss might use some totally obscure browser that no one ever heard of.. If it doesn't look good, 'that's not supported' is not an excuse. 6) A web developer should know etiquette on sites such as StackExchange and Github and know how to properly ask and answer educated questions because at some point everyone has a question which may seem stupid to someone else.  At some point in time whether you want to or not you will find these resources invaluable. 7) A web developer should know the newest versions of JavaScript, HTML, and CSS; but they should also know at least the previous two major releases of both, the differences between each, and why new is, more often than not, not better. 8) A web developer should know that it doesn't get easier, and they better love what they do because it's a life not a job and if at any point they think of it as a job, they should start looking for a new career.  If you don't love what you do you are very likely going to eventually become very miserable. 9) and a web developer should enjoy, better yet.. Create, some form of art which has nothing to do with computers or your probably going to bore me to death and never do anything interesting. ",
            "date": "Updated September 12, 2015",
            "views": "92",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Inim",
                    "user_href": "/profile/Andrew-Inim"
                },
                {
                    "user_id": "Ricasso Emerson",
                    "user_href": "/profile/Ricasso-Emerson"
                },
                {
                    "user_id": "Ahmed Gaafar",
                    "user_href": "/profile/Ahmed-Gaafar-9"
                },
                {
                    "user_id": "Kumar Ayush",
                    "user_href": "/profile/Kumar-Ayush-41"
                },
                {
                    "user_id": "Tarun Teja",
                    "user_href": "/profile/Tarun-Teja-164"
                },
                {
                    "user_id": "Jackson Richardson",
                    "user_href": "/profile/Jackson-Richardson-16"
                },
                {
                    "user_id": "Muhammad Ibrahim",
                    "user_href": "/profile/Muhammad-Ibrahim-69"
                },
                {
                    "user_id": "Abhishek Kaple",
                    "user_href": "/profile/Abhishek-Kaple"
                },
                {
                    "user_id": "Hani Al-Amin",
                    "user_href": "/profile/Hani-Al-Amin"
                },
                {
                    "user_id": "Fidon Amos",
                    "user_href": "/profile/Fidon-Amos"
                }
            ]
        }
    ]
}