{
    "title": "What are the components of multimedia? - Quora",
    "tags": [
        "Multimedia",
        "Components",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Navya Sri",
                "href": "/profile/Navya-Sri-52"
            },
            "answer_text": "Multimedia is the field related to computer controlled integration of texts, (still or moving images) graphics, drawings, audio and animations. The information/content in the multimedia can be represented through digitally (audio, video and animation) in contrast to traditional media. Multimedia technology applies interactive computer elements such as text, pictures, video, graphics, animation and sound into a single form to deliver the message. Multimedia presentations may be viewed by person on stage, projected, transmitted, or played locally with a media player. A broadcast may be a live or recorded multimedia presentation. The various formats of technological or digital multimedia aims at enhancing the users' experience by conveying information easier and faster The multimedia programme enables students to learn how to use computer programmes and create interactive presentations materials. Students are trained in website development software like Cascading Style Sheet or the Adobe Creative Suite, which includes Photoshop, Flash, Illustrator and Dreamweaver. Besides this, they will also learn design techniques using multimedia technology. Besides this, they will also learn design techniques using multimedia technology. Eligibility Criteria: Minimum education qualification for a degree and diploma course in animation is plus two or its equivalent from any recognised institution Graduates from any stream are also eligible to join the post graduation course Who can Pursue the Course? Students who are interested in learning about various types of media entertainment and technology such as television, film studies, journalism, video production, interactive media and computer animation can pursue the programme. The interdisciplinary programme focuses both on emerging trends, technologies and standard methods of managing media. Courses Offered: Multimedia course is offered at various levels such as Diploma course, Certificate course, Undergraduate course and Post Graduate course. Community colleges offer associate's degrees in multimedia technology, providing introductory education in the field. Multimedia technology include some of the following programmes: Interactive media; Website design fundamentals; Electronic imaging; Introductory photography; Animation; Multimedia programming; Graphic design; Digital editing Programmes offered in graduation: Animation;Communication & Emerging Media; Communication & Technology Career Prospects: Degree in multimedia will offer you ocean of job opportunities in web designing, computer games designing, advertising graphics, animation and new media. Multimedia professionals are also recruited in schools, publishing houses, films and video conferencing Multimedia developers can also work as flash developers, network engineers, publishers, graphic artists, sound experts, animators, authors/content providers, project managers and picture researchers. One can work as freelancer What do Multimedia Specialists Work On? Creating digital images for the purpose of animation Transferring audio/video files to be edited and manipulated digitally Creating artwork to be used in video games Creating animated sequences using computer software Designing and developing digital animations, imaging, presentations, games, audio and video clips, and Internet applications using multimedia software, tools and utilities, interactive graphics and programming languages Common Job Areas (Designations): Web Designer/DeveloperMultimedia DesignerSoftware Developer/ProgrammerIT Support/HelpdeskOn-line publishing (editorial/design)Multimedia Marketing Advertising managerCreative directorMedia directorMarketing or promotions managerProduct development managerMarket research managerPublic relations managerMedia analyst or strategistMultimedia Careers in the Entertainment IndustryDigital Camera Operator Sound engineering technicianMultimedia artistFilm and video editorDubbing editorSound effects editorAudio recording engineerGame designerAnimatorGame ProgrammerGame TesterMultimedia Fine Arts CareersPhotographerGraphic designerMultimedia designerInstallation artistAll the Best  my Own Design ",
            "date": "Answered March 20, 2017",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sindhu Naveen",
                    "user_href": "/profile/Sindhu-Naveen-8"
                },
                {
                    "user_id": "Subramanyam Sreshty.D",
                    "user_href": "/profile/Subramanyam-Sreshty-D"
                },
                {
                    "user_id": "Saumya Singh",
                    "user_href": "/profile/Saumya-Singh-513"
                },
                {
                    "user_id": "Saidul Alam",
                    "user_href": "/profile/Saidul-Alam-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivam Kushwaha",
                "href": "/profile/Shivam-Kushwaha-363"
            },
            "answer_text": "Components of Multimedia The various components of multimedia are Text, Audio, Graphics, Video and Animation. All these components work together to represent information in an effective and easy manner. 1)Text: Text is the most common medium of representing the information. In multimedia, text is mostly use for titles, headlines,menu etc. The most commonly used software for viewing text files are Microsoft Word, Notepad, Word pad etc. Mostly the text files are formatted with ,DOC, TXT etc extension. 2)Audio: In multimedia audio means related with recording, playing etc. Audio is an important components of multimedia because this component increase the understandability and improves the clarity of the concept. audio includes speech, music etc. The commonly used software for playing audio files are:i) Quick Timeii) Real playeriii) Windows Media Player 3)Graphics: Every multimedia presentation is based on graphics. The used of graphics in multimedia makes the concept more effective and presentable.the commonly used software for viewing graphics are windows Picture, Internet Explorer etc. The commonly used graphics editing software is Adobe Photoshop through which graphics can be edited easily and can be make effective and attractive. 4)Video: Video means moving pictures with sound. It is the best way to communicate with each other. In multimedia it is used to makes the information more presentable and it saves a large amount of time. The commonly used software for viewing videos are:i) Quick Timeii) Window Media Playeriii) Real Player 5)Animation: In computer animation is used to make changes to the images so that the sequence of the images appears to be moving pictures. An animated sequence shows a number of frames per second to produce an effect of motion in the user's eye. Some of the commonly used software for viewing animation are:i) Internet Explorerii) Windows Picturesiii) Fax Viewer These are the components of Multimedia. ",
            "date": "Answered August 29, 2020",
            "views": "429",
            "upvotes": "0"
        }
    ]
}