{
    "title": "What are the best handheld video game consoles for kids under 10? - Quora",
    "tags": [
        "Handheld Video Game Consoles",
        "Video Game Recommendations",
        "Video Game Consoles",
        "Best of X",
        "Video Game Development",
        "Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harrison McCartney",
                "href": "/profile/Harrison-McCartney-1"
            },
            "answer_text": "It depends on what kinds of games they want to play and what kind of temperment they have. You might want to get something from the last generation (Xbox 360 or PS3) because they're relatively cheap systems (anywhere from $60-$160) and can easily be replaced if anything were to be broken (like if your kid got mad and damaged the console, or if you have a pet that you're worried might tip over the console), and they also have a sizable library of relatively cheap used games. If they would like to play online multiplayer, the PS3 is the best option because it's online multiplayer is free so long as you have a WiFi connection, whereas Xbox Live is about $60 for a 12 month subscription and is the only way to play online multiplayer games on Xbox. On the other hand, if your child wants to play games like Fortnite (which seems to be pretty popular with young kids these days) that game is only available for the current generation of consoles, although they are a bit more pricey ($300 for both Xbox One S and PS4 Slim, although you may be able to find them for slightly cheaper used.) If your child can control their temper playing games and won't damage the console, this might be a worthwhile investment, although in order to play online both consoles require a subscription service. There is an exception on PS4 for Fortnite and other free-to-play games within the PlayStation Store where you can play them without having to sign up for PlayStation Plus, but Xbox One requires an Xbox Live subscription for all of it's online multiplayer features. Both PlayStation Plus and Xbox Live cost about $60 for a 12 month subscription. Another option to consider is the Nintendo Switch, which has some more family friendly titles that might be more appropriate for an 8 year old, and they retail for about $300, with a multiplayer subscription of about $20 for 12 months, however once again your child will have to be fairly careful handling the system as they can be broken if abused, so make sure your child can control their temper. The benefit of the Nintendo Switch is that in addition to functioning on a TV monitor, they can also be played as a portable system, although the battery life when played portable is anywhere from 3-6 hours, with some people reporting they only get 3-4 hours max, but it's still a good system overall. Ultimately it comes down to the gaming preferences of your child and your financial situation. If your 8 year old doesn't care much about which games they can play and which system they get, I would strongly recommend the PS3, as it is cheap, has a fairly large library of games (a decent portion of which are probably age appropriate for your child), and it's online multiplayer function is free, so as long as they have a WiFi connection they can play online. On the other hand, if your child wants to play a specific title that is only available for the current generation of consoles (and you have the money to afford one), make sure that you research which console will play that title, as some games are exclusive to certain systems (like Halo is an Xbox exclusive, and Super Smash Bros Ultimate is a Nintendo Switch exclusive). However, keep in mind that these newer gaming consoles (PS4, Xbox One, and Nintendo Switch) are more expensive than the last gen consoles (PS3/Xbox 360), as are their games (new games are almost universally $60, although used games can come as low as $17-$40), so it may be worth waiting a few months for games to drop in value before buying them if you get a newer console. On the other hand, almost all games for the last gen console can be bought at discount used prices ($10-$30), so if your 8 year old would like to have a lot of games for cheap, a last gen console would be the way to go. ",
            "date": "Answered January 6, 2019",
            "views": "381",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nora Hengelage",
                    "user_href": "/profile/Nora-Hengelage-1"
                },
                {
                    "user_id": "Hina Sheikh",
                    "user_href": "/profile/Hina-Sheikh-12"
                },
                {
                    "user_id": "Jarod Brown",
                    "user_href": "/profile/Jarod-Brown-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Omar De La Torre",
                "href": "/profile/Omar-De-La-Torre-7"
            },
            "answer_text": "A Super Nintendo Entertainment System or a Nintendo 64, possibly an original PlayStation. There's a big “if you can source any of these consoles” attached to my recommendation. The reason I mention these “classic” consoles is because I like to introduce kids to the classics before I allow them to peruse the current generation's offerings. It's my understanding that they'll have a better appreciation of today's gaming in general if they have a taste of what gaming was like before. Not to mention that there are tons of fun games available for the consoles I listed… some more expensive than others due to “rarity”, but not impossible to get. I do recommend you keep them away from the Call of Duty games and any and all “M” rated games mainly for the sake of the older crowd that plays those games. We already deal with enough whiny, underage kids playing those games online without you having to add to our misery. They're not even in the recommended age group to even be playing those games (17 and up) but parents just want to keep their kids distracted while they do other grown up stuff, I guess. Don't be one of those parents. If you're set on introducing them directly to the current generation of gaming consoles, and you're more open to the idea of them playing online with their friends, an Xbox brand console would probably be best since those have the most “community oriented” gaming titles out of all available consoles. The PlayStation does have many multiplayer titles available, but the online community is a bit more established on the Xbox. On either console be prepared to dish out an extra $60 U.S. per year to be able to play games online (the only gaming platform where online gaming is 99% free is on PC, with the exception of games like World of Warcraft that require a monthly subscription). I leave out the Nintendo Switch mainly because it lacks an extensive gaming library compared to the other consoles. The main titles on the Switch (Super Mario, Mario Party, Metroid, The Legend of Zelda, Pokemon, etc.) all come from Nintendo owned development houses. As your kid grows up they may be interested in playing other titles from different developers, and PlayStation or Xbox offer more variety compared to the Switch. Whatever you choose to get your kid, be involved in selecting the games your kid plays. Don't just buy them whatever they want. Research the games online, there's tons of YouTube content for basically every popular game out there, and if it's something you'd let your kid play then by all means, otherwise lay down the law. EDIT: A good option that recently became known and the list of games is mostly kid-friendly, with a couple of exceptions, is the PlayStation Classic. It's a miniature model of the original PlayStation pre-loaded with 20 classic games in it's memory, a few of which can provide upwards of 40 hours of playtime in the campaign (Wild Arms and Final Fantasy VII are good examples). This could be an option to introduce your kid to what gaming was like before they dive into the more complex titles of today's gaming consoles. ",
            "date": "Updated November 5, 2018",
            "views": "837",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ram Thoti",
                    "user_href": "/profile/Ram-Thoti"
                },
                {
                    "user_id": "Joe Szalko",
                    "user_href": "/profile/Joe-Szalko"
                },
                {
                    "user_id": "Adrian Dragodan",
                    "user_href": "/profile/Adrian-Dragodan"
                },
                {
                    "user_id": "Shane Murray",
                    "user_href": "/profile/Shane-Murray-30"
                }
            ]
        }
    ]
}