{
    "title": "What are the advantages of blockchain technology? - Quora",
    "tags": [
        "Blockchain (database)"
    ],
    "response": [
        {
            "author_info": {
                "name": "C.Megan Risk",
                "href": "/profile/C-Megan-Risk"
            },
            "answer_text": "Now that we know the benefits of blockchain technology, let us see how it can help businesses. The blockchain technology is mainly used to store the records and transactions. The ledger may contain static or trade-able information. 1. Static registry: Here the ledger consists of records that are stored as a reference purpose. Take, for instance, the land title. There are many cases of ambiguity in title ownership. With blockchain technology, the records once stored cannot be altered. Any changes are time stamped. In case of dispute, the title can be tracked through the path of the origin. The other places where it can be used are in patents, research articles, and food safety & origin ledgers. 2. Identity: This is similar to the static registry. But this forms a separate case due to the identity-related information stored. The segments where it can be used are for identity frauds, voting, civil registry, police records, and court cases. 3. Smart contracts: Here, a set of pre-defined conditions has to be met if the transaction has to get validated. Upon meeting the conditions, the actions are automatically triggered. Say, for example, in the insurance-claim payout. The insurance provider can set the conditions to be met for insurance claims. The amount is transferred only if the consumer’s claims satisfy the conditions set in the contract. Other areas where it can be implemented are music releases, cash-equity trading and so on. 4. Dynamic registry: The ledger, in this case, keeps updating as goods/services are exchanged on the digital platform. The best use case is in a drug-supply chain. The supply of drugs right from the manufacturer to the distributor and finally to the drug store can be mapped. The updates provide information on the movement of drugs and this can be used to stop the supply of counterfeit drugs in the market. 5. Payment registry: This is a dynamic registry that updates as the cash or cryptocurrency payments are made on the network. This is advantageous for international payments in business. ",
            "date": "Answered February 14, 2020",
            "views": "155",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jordan Dill",
                    "user_href": "/profile/Jordan-Dill-2"
                },
                {
                    "user_id": "Sona Jain",
                    "user_href": "/profile/Sona-Jain-103"
                },
                {
                    "user_id": "A.M. Forkan",
                    "user_href": "/profile/A-M-Forkan"
                },
                {
                    "user_id": "Sharon Tawney",
                    "user_href": "/profile/Sharon-Tawney-3"
                },
                {
                    "user_id": "D.Brian Brown",
                    "user_href": "/profile/D-Brian-Brown"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noor Muhammad Khan",
                "href": "/profile/Noor-Muhammad-Khan-12"
            },
            "answer_text": "Recently I wrote a detailed article on DailyHodl. The article discussed the 8 beneftis of blockchain technology. I hope this article will help you out in getting to know the blockchain benefits. 8 Benefits of Blockchain Technology You Should Know in 2018 The market of blockchain technology is evolving very rapidly. Internet giants like Facebook, Alibaba and Google are working on their own blockchains and blockchain-related technologies. However, it is not about the competition it inspires, but the benefits that come with this technology. Blockchain has the ability to provide security to different industries, especially those associated with the internet.  Blockchain technology has the capacity to change the way we interact with the internet. It can provide security, transparency, high transaction speeds, interoperability, easy access to data, and many more privileges. Many projects like Zilliqa, Pundix, Holo, IOTA, and Dash are already utilizing blockchain technology to grow their business. There are several decentralized applications available on the internet to provide solutions to real-world problems. Bitcoin started the journey back in 2009. And right now, there are about 2,000+ decentralized applications available. These innovative projects have proven that “blockchain is beyond altcoins and Bitcoin.” Here is a list of blockchain benefits that can help businesses grow. 1. Peer-to-Peer Global Payments The first practical implementation of blockchain technology is Bitcoin. It is a peer-to-peer global payments system based on utilizing distributed ledger technology. You can send and receive bitcoins all over the world without any restrictions. Currently, centralized payment systems are being used to send and receive money across the globe. However, these systems have certain limitations. For example, PayPal is the most recognized payment system, but it is not offering services in most of the developing countries. Some other limitations are minimum payment transfer and high transaction fees. Distributed ledger technology (DLT) provides the solution to all such problems. Though DLT is still growing, it has to cover a long distance. It needs regulations as there are no frameworks in most part of the world. We have to wait for the proper cryptocurrency legislation for more secure transactions. 2. Security and Privacy The sole purpose of blockchain is to provide security to global businesses. The centralized system has failed to provide users with security and privacy. There are many loopholes in the current centralized system. For example, it lacks data security. The central authority can take full charge of users’ data at any time. On the contrary, blockchain is based on distributed ledger technology. The data is stored on different systems, available on the network. Thus, it offers complete security. Another recent example is the case of Google and Huawei. Google has announced that it will stop its services for Huawei mobiles. There is also a bigger threat of data and privacy violation. This is the major issue with a centralized system. The central authority has full control over data. The third party can compromise the user data at any time. Furthermore, there is always a bigger threat of hacking. Hackers can access the central server to steal personal information of the users. If we look at blockchain, it is a totally different technology. There is no third-party involvement. The data is to be stored on a distributed network in encrypted form. Hence, blockchain offers security and privacy of users’ data. 3. Transparency Transparency of the data is yet another benefit of blockchain technology. As we know, the data is stored on a distributed network. The users on a blockchain network share the same documentation as opposed to individual copies. The shared version of data can’t be updated without consensus. It means all the users sharing the network must agree on a change in data. If someone tries to change the single transaction record, he has to alter all the subsequent records and the collusion of the entire network. Hence, we can say that the data available on the distributed ledger is more transparent. Data is only available for the users available on the network. It is nearly impossible to change the data until all the participants of the network agree upon it.  4. Efficiency and Speed Blockchain technology offers efficiency and transparency for data storage and transactions. All the data processing and transactions are performed on the decentralized system. User can send or receive the payments anytime. Also, there is no need to involve any third party. All you need is a computer and a cryptocurrency wallet to perform the transaction. The elimination of a third party can help in cost reduction and transaction speed. You don’t need to visit any bank or ATM machine to send or receive your payments. That’s why the new generation of blockchains are struggling to resolve the issue of scalability. If resolved, it can provide user efficiency and speed. 5. Cost Reduction The higher transaction speed will help in cost reduction. As mentioned above, there is no third party involvement required in distributed ledger technology. In a centralized system, the companies have to install heavy servers. They also hire experts to manage the servers and data. On the other hand, no central server is required to store the data on the blockchain. A decentralized system doesn’t require any central server. The data can be securely saved on a distributed network. Thus, it can help companies in reducing their cost. Moreover, the decentralized system can help governments in optimizing digital services. The new generation of blockchains is focusing on reducing costs. This will be a great help for the following industries: Record ManagementSmart Cities Air PollutionAgriculture6. Blockchain for Government Blockchain can help governments to secure data transfer and storage. There is always a high risk of hacking in a centralized system. The governments have to spend a lot of money to secure the data. Distributed ledger technology can offer governments secure data transmission and storage. Blockchain can help governments in the following ways: TransactionsGovernment ServicesEliminate BureaucracyTax Fraud PreventionElectronic VotingReduce WasteSecure Data StorageHealth CareIdentity7. Supply Chain Management Traceability is the main issue with supply chain management. The centralized system has failed to provide the ownership details for a specific product. Everyone can change the details of ownership. On a blockchain, once the ownership for a specific person will be approved, no one will be able to tamper with it. This is because the data stored on the blockchain is immutable. The governments will be able to trace the origin, movements, and quantity of different products. Any irregularity in the supply chain will be easily detected. For example, the food authority will be able to detect the origin of food materials. It will make it easier for the concerned authorities to execute the necessary actions. 8. Energy Supply Users can take advantage of blockchain-based transactive grids for sustainable energy. These can track energy usage. Some companies are combining digital ledger technology with their own innovative methods for capitalizing on energy and data. They are doing so by generating a blockchain-based data platform to develop localized marketplaces. This will be a place for transacting energy across existing grid infrastructure.  Noor Muhammad Khan is a content writer at MeetNoor. He is a blockchain enthusiast. Noor loves to write about blockchain technology and cryptocurrency. Original article: 8 Benefits of Blockchain Technology You Should Know in 2019 ",
            "date": "Answered June 30, 2019",
            "views": "17",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Coomb",
                    "user_href": "/profile/Alex-Coomb-2"
                },
                {
                    "user_id": "Jordan Dill",
                    "user_href": "/profile/Jordan-Dill-2"
                },
                {
                    "user_id": "Ali Jutt",
                    "user_href": "/profile/Ali-Jutt-54"
                },
                {
                    "user_id": "Toby Hicks",
                    "user_href": "/profile/Toby-Hicks-9"
                },
                {
                    "user_id": "Jason Turner",
                    "user_href": "/profile/Jason-Turner-364"
                },
                {
                    "user_id": "Edward Tay",
                    "user_href": "/profile/Edward-Tay"
                },
                {
                    "user_id": "Sophia Walters",
                    "user_href": "/profile/Sophia-Walters-8"
                },
                {
                    "user_id": "Tony Brunch",
                    "user_href": "/profile/Tony-Brunch"
                },
                {
                    "user_id": "Robert Adkins",
                    "user_href": "/profile/Robert-Adkins-71"
                },
                {
                    "user_id": "Megha Saloni",
                    "user_href": "/profile/Megha-Saloni"
                }
            ]
        }
    ]
}