{
    "title": "What is a 5G smartphone to purchase? - Quora",
    "tags": [
        "iPhone (original)",
        "5G Networks",
        "Smartphone Shopping",
        "5G (wireless communication)",
        "Smartphones Recommendations",
        "Huawei (company)",
        "Mobile Phone Recommendations",
        "Xiaomi (company)",
        "Wireless Technology",
        "Mobile Technology",
        "iPhones (product)",
        "Shopping",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Haynie",
                "href": "/profile/Dave-Haynie"
            },
            "answer_text": " Every time there’s a new technology around, there are early adopters anxious to just into it. Some people just get a kick, being first. I do understand. I bought one of the first HDTVs. And second, then third generation HDTVs, because they hadn’t worked out all the kinks. The same is already known to be true about 5G radio. Now, I suppose for the average phone user, you might do a little test and see if you even care about 5G technology. The first question to ask is really “what can’t I do mobile on my phone today that I can do at home on WiFi on my phone, but not when connected via LTE?” If you have an answer, you may want to look into 5G radio technology. But only if you live in the right locales. And only knowing that, in 2–3 years, it’ll be a different thing than it will be in the next year or two. Right now, at my house, I’ve got a gigabit optical connection to the Internet. That’s not quite an actual gigabit, but it can hit 950Mb/s on downloads… usually not, just because the Internet itself isn’t that fast. The best way to describe it is that it’s fast enough that I don’t generally care about speed anymore. I’m also getting low latency, 8–12ms pings to various sites. This connection is plenty fast for 4K-UltraHD streaming from Netflix and Amazon, about the highest regular bandwidth thing I run into. My online backup totals a bit under 14TB, though that did take over a month to initially sync, again, based on the Internet itself and, certainly, the backup server people load balancing me with other customers. Just What Is 5G? Just as WiMax (for a little while) and LTE are a set of new radio technologies that were classified by the International Communications Union (ITU) as “4G” technologies, “5G”, aka 5G New Radio or 5G-NR, is a new set of radio technologies. A few less-than-honest companies are telling you that you can get 5G today, maybe via a software upgrade. They are misleading you, just as some of the less honest companies did in the early days of 4G, claiming the 3G HPSA+ protocols as “4G”. So you will need a new device to use full fledged 5G technologies. Your carrier may offer a hybrid in the early days. 5G software running “non-stand-alone” on 4G hardware has already been rolled out in some locales.  So, there are actually three application classes for “5G New Radio”. The one you’re least likely to encounter in your travels is probably Ultra Reliable Low Latency Communications (URLCC). This is designed for ‘mission criticial” applications with <1ms radio latency. You may find future self-driving cars talking to one another over a URLCC connection, coordinating themselves so that no one needs to stop for a traffic light. Things like that. The next, which will probably live in your house at some point, is Massive Machine Type Communications, or mMTC. Think “Internet of Things” with direct cellular connections. Right now, if you’re like me, you may have Zigbee, Z-Wave, or other IoT wireless mesh networks running in your house, via a central server that bridges to Ethernet or Wifi and thus makes its way to the Internet. That could still exist in the future, but some devices will use 5G mMTC radios. The mMTC mode supports device densities of [math]\\frac{10^6}{km^2}. [/math] And finally, there’s Enhanced Mobile Broadband (eMBB), the protocols that will replace your 4G LTE data-only connection at some point in the future. The standard for 5G at higher frequencies is support of at least 20Gb/s data down, 10Gb/s data up. But don’t get too excited… the standard also mandates that in a crowded city, you should get at least 100Mb/s down, 50Mb/s up, at least 95% of the time. So it’s basically a guaranteed match for today’s cheapo wired home internet. And in fact, many of the telcos plan to market 5G for “last mile” internet service. That the connection to your house. That’ll be offered as an alternative to cable, optical, perhaps satellite… but don’t count on the statellite replacement any time soon.  In order to deliver these higher speeds, 5G radios will run in the “millimeter bands”, the “FR2” group from 24.25 GHz to 52.6 GHz . These frequencies offer a ton of bandwidth, but radio propagation in these bands it very short range. One proposed solution is to include 5G access points on pretty much any tall structure, such as lamp posts. At these higher frequencies, in a city, you’ll need at least 10x as many cell sites as we had with 4G. As with LTE, the first 5G systems will have compatibility with the initially selected bands, and they’ll expand future systems to handle additional bands as they go into use. In rural areas… you’re probably only getting FR1. FR1 is basically “reusing existing cellular spectrum,” meaning the same 400MHz-6GHz that’s currently occupied by cellular radio, here and there. The first move is likely to be 5G replacing 3G frequencies like 850MHz and 1900MHz. Some US companies are getting ready to sunset 3G, possibly by the end of 2019. So those bands open up for 5G use. However, other than the need for a new phone, you’re not getting much out of that deal. 5G radios may be a bit faster than what you get today with LTE. Or a bit slower, depending on your specific version of LTE. eMBB is also scheduled to eventually offer very low latency, though not necessarily guaranteed as with URLCC. Expect 1–4ms radio latency (eg, you also have to deal with other factors in a real-world internet connection). The systems that are just starting to go into use this year peak at about 8ms, while some test at the not-at-all-interesting latencies as long as 30ms. Who’s Doing It, and Where? Due to the somewhat experimental nature of 5G on a city-wide basis, assuming you have some need for 5G, you probably want to wait until your area actually had a 5G rollout. The early version of 5G, dubbed Release-15, was released in 2017 and is being rolled out this year, and should finish by year’s end. Release-16 is in development, and will start to show up in 2020. Sprint has rolled out their 5G service on FR1, their 2500MHz band (the higher FR1 frequencies are also dubbed mid-band) formerly used for WiMax, in about nine cities so far. They have plans for millimeter band FR1, but I didn’t find the details. T-Mobile, who may be merging with Sprint Real Soon Now, has already rolled out millmeter wave in parts of five cities. Again, these higher frequencies — T-Mobile is using — have much shorter ranges than traditional cellular bands. T-Mobile is using 28MHz and 37MHz currently for hi-band, and they have some rural 5G on their 600MHz, though of course, not at significantly higher speeds than LTE. Verizon has 5G NR on 28GHz in quite a few areas. They have yet to announce a lower band strategy. They may be sunsetting their 3G/CDMA2000 network at the end of the year (2019). They expect to have coverage in 30 US cities by 2020. AT&T will claim to be connected to “5G E” on some phones… that’s a lie. They are still using LTE for that connection. AT&T is also the one in the USA that claimed 4G when connected to faster 3G networks. Their 5G “Evolution” probably indicated you’re talking to an upgraded cell that’s “5G ready” but still using LTE. Many of the cellular systems in the 4G era were using software or partial-software radio, one of the reasons they were able to upgrade to faster versions of LTE without as much pain as the original LTE rollout. But so far, “5G E” isn’t 5G yet. AT&T apparently does have real 5G in as many as 20 cities on millimeter band at this point. They plan to offer fixed (home) wireless on 5G by the year’s end in some cities. Is It Ready? You probably will run into growing pains with 5G in between now and maybe 2021 or so. Coverage aside, you have to wonder if the devices are ready. For example, while the LTE radio protocols actually save a bunch of power versus 3G, the early LTE devices were inefficient against 3G, simply because the radio chips were new, the protocols complex, and they needed a bit of evolution to deliver the needed power savings. Same will go with 5G. Ideally, you’ll see power per bit transferred drop under 5G, but it may take some maturing of the hardware. At least some of the 5G devices on the market can have pretty significant heat issues. They’ll shut off the 5G radios and drop back to LTE if they do overheat, but it’s useful to know just what to expect. Would I worry about 5G right now? Nope. But if you have the application and the right address, go for it! Read More What is URLLC? Another Set of 5G Standards Was Just Released, but No One Really Cares | Light Reading  Testing T-Mobile’s 5G speeds in New York City With The Galaxy S10 5G | Digital Trends  Putting Verizon's nascent 5G network to the test  5G has arrived - here's what you can expect from Sprint  Sprint calls out AT&T's 5G E in full-page New York Times ad AT&T 5G: When and Where You Can Get It 5G has arrived – here’s what you can expect from AT&T ",
            "date": "Answered August 30, 2019",
            "views": "74",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Forest Interactive (Company)",
                    "user_href": "/profile/Forest-Interactive-Company"
                },
                {
                    "user_id": "Dale E Weir",
                    "user_href": "/profile/Dale-E-Weir"
                },
                {
                    "user_id": "Marilou Fuentes",
                    "user_href": "/profile/Marilou-Fuentes-3"
                },
                {
                    "user_id": "Sandra Warwick",
                    "user_href": "/profile/Sandra-Warwick-6"
                },
                {
                    "user_id": "Lindsay Carter",
                    "user_href": "/profile/Lindsay-Carter-89"
                },
                {
                    "user_id": "Gina Dunn",
                    "user_href": "/profile/Gina-Dunn-37"
                },
                {
                    "user_id": "Angie Johnson",
                    "user_href": "/profile/Angie-Johnson-458"
                },
                {
                    "user_id": "Jessica Rider",
                    "user_href": "/profile/Jessica-Rider-23"
                },
                {
                    "user_id": "John Smiths",
                    "user_href": "/profile/John-Smiths-66"
                },
                {
                    "user_id": "Gary Warren",
                    "user_href": "/profile/Gary-Warren-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Obunga",
                "href": "/profile/Jeff-Obunga"
            },
            "answer_text": " I think that the only people that should invest into 5G capable devices are those that are software / games developers and early adopters (consumers).  Based on MKBHD’s video on YouTube, 5G does offer a tremendous download speed increase over 4G (speeds tested in Providence Rhode Island, USA, reached a whopping 2.1 Gbps!), enabling Netflix episodes and graphic intensive games to be downloaded in mere seconds! What was interesting, however, was as soon as Marques went a few blocks around a corner, or was even obstructed by trees in sight of the 5G nodes attached to a telegraph pole, speeds dropped drastically (50% at one point). This is due to the nature of 5G waves, as they are a higher frequency so inversely the wavelengths are shorter. To work effectively, several 5G nodes would need to be placed every few blocks away from one another, allowing for greater coverage and enabling a consistent connection to 5G instead of constant drops to 4G+ / LTE. Then there's the issues of heating, battery and upload speeds mentioned by MK. Even during normal browsing, a 5G capable device would heat up far more noticeably than a 4G limited device. Battery life would also be consumed far quicker on the former, based on the same usage patterns. Upload speeds also did not vary significantly from 4G, so we're not quite there where 4K / 8K videos can be uploaded straight from 5G devices at considerably faster speeds. What we're seeing now with current 5G technology is a glimpse into the future of 5G, although in my opinion it is still at least a few years away from general adoption, and perhaps even a decade away from the same adoption we currently have of 4G / 3G capabilities. 5G isn't a must, a smartphone user can just download all the TV series and games that they need on WiFi for example. With continuous investment and research, wireless communications technology will continue to improve, its just a matter of time and money. Sure we can get faster and faster; but at what cost? Hope this helps. ",
            "date": "Updated September 10, 2019",
            "views": "143",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marilou Fuentes",
                    "user_href": "/profile/Marilou-Fuentes-3"
                },
                {
                    "user_id": "Lindsay Carter",
                    "user_href": "/profile/Lindsay-Carter-89"
                },
                {
                    "user_id": "Gina Dunn",
                    "user_href": "/profile/Gina-Dunn-37"
                },
                {
                    "user_id": "Angie Johnson",
                    "user_href": "/profile/Angie-Johnson-458"
                },
                {
                    "user_id": "Jessica Rider",
                    "user_href": "/profile/Jessica-Rider-23"
                },
                {
                    "user_id": "John Smiths",
                    "user_href": "/profile/John-Smiths-66"
                }
            ]
        }
    ]
}