{
    "title": "What is your favourite smart tech today, and what would you like to see in the future of technology? - Quora",
    "tags": [
        "Smart Technologies",
        "Future of Technology",
        "Technology Companies",
        "Future Scenarios",
        "Innovation",
        "Smart People",
        "Technology Trends",
        "Intelligence",
        "Technology",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Morry Secrest",
                "href": "/profile/Morry-Secrest"
            },
            "answer_text": "Two questions, each of them quite interesting. My favorite is a nascent technology; and that is, connecting a computer or and AI or a robot directly into the human brain. This technology is just now in the beginning stage. Eventually it will be improved to the point of information from the machine passing to the human. This will be an exciting technology, once it is developed. As to the future of technology, I am eagerly awaiting some form of time travel. Not for the body, of course; but for some sort of visual presence. The ability to go back into the past and observe important events would be tremendously important to historians, to anthropologists, and in the long reach, to geologists and astronomers. ",
            "date": "Answered May 29, 2020",
            "views": "94",
            "upvotes": " Answer requested by Maxine Berry"
        },
        {
            "author_info": {
                "name": "Anwar Mahmood",
                "href": "/profile/Anwar-Mahmood-1"
            },
            "answer_text": "society living together in cooperation at scale is a human development - a technology it's not perfect; indeed it is always evolving striving for a better society is an eternal - but worthwhile struggle the EU intends to be carbon neutral by 2050 (Press corner). Wouldn't that be great? 513 million people striving to live sustainability. ",
            "date": "Answered May 30, 2020",
            "views": "76",
            "upvotes": " Answer requested by Maxine Berry"
        }
    ]
}