{
    "title": "What is the most important invention in the last 2000 year? - Quora",
    "tags": [
        "History of Inventions",
        "Innovation",
        "Invention and Inventions",
        "Science of Everyday Life",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Howden",
                "href": "/profile/Patrick-Howden"
            },
            "answer_text": "WORLD PEACE: TREATISE ON FUTILITY & ALTERNATIVES TO WAR. Well I'm a pensioner as of 1999, 5 June - World Environment Day - with the best presents ever being able to recover a little of what governments plus councils et al have ripped me off for decades. I ingeniously avoided 1950's \"Nashos\" 4 times! My Pa's heroic war exploits were occasionally of rout (with honor), escape, retreat & non-lethal tactics, albeit plenty of \"co-lateral\" damage laid over budget sabotage. Somehow this country treasures total failures, sinkings & cost-ineffective exploits (Gallipoli, HMAS Sydney & Perth demise...). As witness substantial files on such at war museums, as opposed to few if any files relative to total effective successes like that of his 1930s China Station river gunboat, or his Coral Sea Battle command HMAS Hobart. In 1962 the Japanese bought this cruiser as scrap; whilst our more recent namesake was sunk just outside Adelaide for the enjoyment, not as a museum for Japanese tourists, but for skin divers! Why have wars if everybody from both sides are boozing buddies afterwards. Another prevailing national characteristic I've observed over the decades is how victims become villains & vice versa. Thus the victim of a robbery is made to feel lousy when he sues over how he is upsetting the villain's family feelings. How would we have treated legions of highly skilled & very effective mid-teen GIRL front line fighter pilots if we'd depended on them, as did Russians or Israelis? These still relatively young ladies reunion regularly as role models of what teenagers are capable! Lately, powers that be are intensely investigating non-lethal weapons. No pilots ever really had to fly front line fighters because since WW1 remote controlled planes were available & 1920's TV technology would have simplified the problem. I've worked on precision robotics since 1969 & earlier systems could have fought all our wars - like computer games & equally safe. During WW2, scads of missiles were developed, including long range German V2, V1 (tested by a remarkable lady Hanna Reich) & Baka (Japanese). Also spark-radio-controlled planes, torpedo boats & vehicles appeared during & just after WW1! Since then, not a little damage was done by remote inertially guided Exocet, cruise missiles & torpedoes, also Blowpipe & Sidewinder missiles at Falklands without the need for massed troops as in Arabia during Gulf wars. Yet still Defence departments are setting up ideal Pearl Harbor-style concentrated sitting duck targets - like San Diego or our own Navy on an island off Perth. From WW2 governments even in Australia & huge missile Corporations have been bragging about their weapons capability for changing any enemy attitude. Have they been fooling us for decades whilst siphoning off a nation's financial lifeblood without being able to deliver a single non-nuclear Cruise, Polaris, Hercules, Poseidon or Trident to land on a pin when fired from unmanned bunkers 100s or 1000s of Km range? At least until recent Gulf war. My overwhelming converse impression I had on visiting these enormous Aerospace plants years ago was ineptitude. Gulf war anti-Scud missiles were futile despite former President Bush's lies. So simply to justify & test war materiel stockpiles, governments are often willing to take on an opponent for an inappropriate outdated war. Missiles were much safer, not prone to gas, germ or chemical attack & substantially cheaper than sending half a million potential farmers to untimely graves. If the conqueror wants to stay where they conquered, follow Israel's example: use all that logistical materiel to help grow crops as kibbutzim-peacefully. Knock out the equipment - not the people! War has been defined as \"politics by other means\". Which reminds me of the crazed faces on America's millions at political conventions - I call it The Santa Syndrome in which simply by voting for some twit, everyone imagines they will get all the presents they desire. No wonder, disillusioned weeks later, they usually turn on their chosen one. Not only do even short wars virtually never end - America still feels bad blood from their 1860's civil war - but the aggressed never surrender unless annihilated, wiped out, nuked or totally overtaken (Budapest Oct 1956 by USSR). This often necessitates later massive reconstruction worth $billions from the conqueror's public purse; like Kosovo more recently, Japan, Germany & Italy (sans war crimes trials as Germany!) earlier. Guess which entire Central American country that needs no military - like that movie \"The Mouse that Roared\"? Moreover, near all takeovers & colonies return to the people. Yet at what price of a repressed ignorant people trying to run their unmanageable nation until hopelessly falling into tribal conflict or coups - see Rhodesia, Fiji... A Korean diplomat (their war still unsettled) said: \"Poor of the rich countries subsidize the rich of the poor countries\"! This applies to foreign aid too. Curious how war (such as Falklands when I lived for years in gorgeous Cornwall) brings UK neighbors & allies together supportively often for the first time ever! But insidious is the gall attitude possessed by aggressors: A war may appear won but seldom if ever the peace. Can anyone possible imagine the Poms bowing & scraping indefinitely to supposed permanent German invaders, or Aussies \"ahso(ing)\" following a Japanese take over? Russia with its massive induced fear, promises, surveillance, orchestrated terror & KGB resources couldn't hold satellite states forever with their loony Communist philosophy. No aggressor has the vision to see that. Hitler couldn't. Soldiers glibly going off to glorious wars can't. Many Authorities believe (without assurity) that war to Australia etc is an insurance policy in that we should help Poms & Yanks in case we need their help later! Our possessing valuable resources accessible to the helping country are naively believed to make assistance more likely. Our Bible insists that a warmonger first count both forces before negotiating. See also Causes of war in James 4:1-5. Why can't aggressive twits agree to attack each other - & hence dilute the dominant violence gene pool - in some impossibly remote territory, if not in gymnasiums, on football fields etc? Teach young folk the futility of joining up (unless suicidal), the advantages of not - like billboards painlessly advise on traffic statistics. Incredibly we the West, or whoever, continue propping up & feeding hungry repressive regimes as they plead poverty, whilst they continue aggressively to generate missiles, warplanes, spacecraft & heavy weapons, particularly Nuclear!!! Curiously in the Gulf war, TV media budget-interviewed \"Military Analysts\" ad nauseam. They spring out of such as Maroochidor woodwork; having confidently claimed war would last a mere few-days. And still they are interviewed, despite their wildly inaccurate predictions. After WW2 in Germany, virtually the entire population was FEMALE - so beloved by allies!! ",
            "date": "Answered January 17, 2019",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pascual Ariel Arrechea",
                "href": "/profile/Pascual-Ariel-Arrechea"
            },
            "answer_text": "If there isn’t only one “Most” important invention, certainly the Lathe is among them. Also described as: “The machine that makes all machines” The lathe was essential for the industrial revolution to take us here today, in the era of technological progress and prosperity. Although the Lathe is an ancient tool, only after being coupled with horse and other sources od mechanical power it became part of the very beginning of a revolution led by science, and that for the last 200 years has shown an exponential technological growth, also called “singularity”.  The Lathe is a machine that rotates a workpiece about an axis of rotation to perform various operations such as cutting, sanding, knurling, drilling, deformation, facing, and turning, with tools that are applied to the workpiece to create an object with symmetry about that axis.  Therefore, every machine that makes all the machinery and stuff around us, starts with specialized tools and those tools begin with the Lathe work. ",
            "date": "Answered January 16, 2019",
            "views": "307",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Harshit Pandey",
                    "user_href": "/profile/Harshit-Pandey-97"
                },
                {
                    "user_id": "Darius Hernandez",
                    "user_href": "/profile/Darius-Hernandez-3"
                },
                {
                    "user_id": "Curtis McCully",
                    "user_href": "/profile/Curtis-McCully"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        }
    ]
}