{
    "title": "What were the navigational tools used by Christopher Columbus? - Quora",
    "tags": [
        "Tools (non-specified)",
        "Explorers",
        "Navigation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simon Brown",
                "href": "/profile/Simon-Brown-8"
            },
            "answer_text": "At the time of Christopher Columbus, celestial navigation was just being developed by the Portuguese. Before the development of celestial navigation, sailors navigated by dead reckoning. This was the method used by Columbus and most other sailors of his era. In dead reckoning, the navigator finds his position by measuring the course and distance he has sailed from some known point. Starting from a known point, such as a port, the navigator measures out his course and distance from that point on a chart, pricking the chart with a pin to mark the new position. Each day's ending position would be the starting point for the next day's course-and-distance measurement.Course was measured by a magnetic compass. Distance was determined by a time and speed calculation: the navigator multiplied the speed of the vessel by the time traveled to get the distanceIn Columbus' time, the ship's speed was measured by throwing a piece of flotsam over the side of the ship. The pilot had a chant to time the movement of the flotsam past two marks on the ships side. The time taken to pass the marks was used to give a rough guide to the speed of the ship. Speed and course were measured every hour. .Not wildly accurate, but sufficient for most navigators of the day.Columbus was the first sailor who kept a detailed log of his voyages. We therefore know how Columbus navigated, and that he was a dead reckoning navigator. On the first voyage westbound, Columbus sticks to his (magnetic) westward course for weeks at a time. Only three times does Columbus depart from this course: once because of contrary winds, and twice to chase false signs of land southwest.Columbus and Celestial Navigation.Although Columbus was primarily a dead reckoning navigator, he did experiment with celestial navigation from time to time. In celestial navigation, the navigator observes celestial bodies (Sun, Moon and stars) to measure his latitude. Each star has a celestial latitude. If you know the latitude of a star that is directly overhead, that's the same as your latitude on earth. Even if a star isn't directly overhead, if you can measure the angle between the star and the overhead point, you can still determine your latitude that way - provided you measure the star at the time of night that it is highest in the sky.So on his first voyage he made at least five separate attempts to measure his latitude using celestial methods. Not one of these attempts was successful, sometimes because of bad luck, and sometimes because of Columbus's own ignorance of celestial tools.The most important tool used by Columbus in his celestial attempts was the quadrant. Columbus also carried an astrolabe on the first voyage, which is similar to the quadrant. The quadrant was accurate to about a degree or so, and the astrolabe was a little less accurate. Time aboard ship was measured by a sandglass. It was the responsibility of the ship's boy to turn the glass every half-hour. The sandglass was checked daily against the times of sunrise, sunset, or midnight. Midnight could be determined by using a nocturnal, a tool which tells the time of the night by the rotation of stars around the celestial pole.Columbus tried to find his latitude using the quadrant on October 30, 1492. At the time, he was about 20 degrees North latitude. But the result he obtained from the quadrant was 42 degrees. He made another reading from the same place on November 2, and got the same flawed result.Continuing along the coast of Cuba, Columbus again tried a quadrant latitude reading on November 21, and again came up with 42 degrees. December 13, while anchored in a harbor in northern Haiti, he used the quadrant again to determine the altitude of the North Star, and this time got a reading of 34 degrees, not his correct latitude of 19 degrees. Finally, on February 3, 1493, while on the return voyage, Columbus tried to determine the altitude of Polaris using both the quadrant and astrolabe; but the waves were so high he could not get a reading. http://www.christopher-columbus.eu/navigation.htm ",
            "date": "Answered October 11, 2015",
            "views": "64",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonio Muñoz-Torralbo",
                    "user_href": "/profile/Antonio-Muñoz-Torralbo"
                },
                {
                    "user_id": "Yossi Gorelik",
                    "user_href": "/profile/Yossi-Gorelik"
                },
                {
                    "user_id": "Shalom Crown",
                    "user_href": "/profile/Shalom-Crown"
                },
                {
                    "user_id": "Bianca N. Diesel",
                    "user_href": "/profile/Bianca-N-Diesel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michel Verheughe",
                "href": "/profile/Michel-Verheughe"
            },
            "answer_text": "By simply measuring the elevation of the north star over the horizon, you know your latitude!  If it is say, 35 degrees, you are at latitude 35 north. You could also do it with the sun at noon, when it is highest in the sky and bearing exactly south but then, you have to reduce or add the declination and the half sun diameter. Then it was a matter of sailing west or east until reaching land. Mind you, because of the tension between Spain and Portugal, the Pope divided the Atlantic into the Spanish and the Portuguese sector that was more south. Today we know that Columbus lied about his position because he reported seeing flying fish that are only visible when far south in the Portuguese waters. Coming home, he knew the latitude of Palos, where he started from. But the sea being capricious, he made first landfall in Bayonna la Real, north of Portugal. ",
            "date": "Answered October 24, 2018",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sihem Soibinet-Fekih",
                    "user_href": "/profile/Sihem-Soibinet-Fekih"
                },
                {
                    "user_id": "Bosley Plourde",
                    "user_href": "/profile/D-B-Oswald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "Compass and hourglass. He also used an astrolabe but his readings were inaccurate. Columbus use of Dead Reckoning (DR) navigation and Celestial navigation Astrolabe - Wikipedia ",
            "date": "Answered July 30, 2020",
            "views": "106",
            "upvotes": " Answer requested by Roksana Parvin Yasmin"
        },
        {
            "author_info": {
                "name": "Ethan Gryip",
                "href": "/profile/Ethan-Gryip"
            },
            "answer_text": "Y ",
            "date": "Answered September 7, 2016",
            "views": "166",
            "upvotes": "0"
        }
    ]
}