{
    "title": "What is the best place to buy Apple products? - Quora",
    "tags": [
        "Apple (company)",
        "Online Shopping",
        "Apple Products and Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yu-Jin Chia",
                "href": "/profile/Yu-Jin-Chia"
            },
            "answer_text": "If you have an Amazon Prime Visa card, Amazon is the best from a cost standpoint. You’ll get 5% back, the same warranty, and 30-day return window. Further, you can deliver to a locker which is probably the safest way to pick up something these days. Costco is arguably as good depending on how you look at it. Costco’s Visa doesn’t give as much cash back, but their concierge service extends to Apple products too- so you basically get free extended warranty. That’s nothing to sneeze at. Best Buy is probably the next best choice if you have a Best Buy visa and a location near you. Apple direct I’d say is the worst choice right now unless you are getting a refurb. Right now a lot of their stores are closed, and they usually ship via UPS or FedEx. These days, they usually will just drop it on your doorstep and leave because of the epidemic- even if signature is required. I would personally not risk it on something as expensive as most Apple machines are. ",
            "date": "Answered August 7, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "George Babash",
                    "user_href": "/profile/George-Babash"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nguyen Tran",
                "href": "/profile/Nguyen-Tran-310"
            },
            "answer_text": "You should buy at Apple retail stores or Apple authorized resellers. BestBuy and Amazon are reliable too, but they’re still second compared to stores directly from Apple (in my opinion). You should note that BestBuy has the best discount (occasionally), though. If you’re planning to buy a refurbished Apple product, always buy it directly from Apple. No third-party can refurbish Apple products reliable enough. ",
            "date": "Answered August 7, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roberto Santocho",
                    "user_href": "/profile/Roberto-Santocho"
                }
            ]
        }
    ]
}