{
    "title": "What is MIS reporting? - Quora",
    "tags": [
        "Master's Programs at Management Information Systems",
        "Management Information Systems"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mranal Trivedi",
                "href": "/profile/Mranal-Trivedi-1"
            },
            "answer_text": "Let me start answering this question by explaining what is MIS. You might already know the answer to this but I'll still go ahead and explain it for making things easier. An MIS or Management Information System includes the wide variety of systems that are responsible for collecting, organizing, processing and broadcasting information related to a business. These MIS systems interact with the various departments/sectors of a business/organization, collect data from these different places and process that data as per the needs of the people who handle his data. In this case, the people handling or requesting this data are usually managers/analysts responsible for processing this data and turning it into useful and insightful information. So, MIS reporting is nothing but reporting, which is performed on the aforementioned data. Managers/analysts sieve through this data, process it and turn it into meaningful insights. This is usually done through tools that are user-friendly and make data presentation and visualization such that the resultant reports and dashboards are easy to understand and can be absorbed by audiences that may or may not have a technical background. For e.g., an MIS report for a library management system might include information about, number of books current ly issued, popular topics, inventory detail, reader demands for new books, damaged books, membership information, overdue books, late fees etc. ",
            "date": "Answered April 4, 2018",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ramya Japa",
                    "user_href": "/profile/Ramya-Japa"
                },
                {
                    "user_id": "Tech Gern",
                    "user_href": "/profile/Tech-Gern"
                },
                {
                    "user_id": "Gayathri Balaji",
                    "user_href": "/profile/Gayathri-Balaji-43"
                },
                {
                    "user_id": "Vidhya Selvaraj",
                    "user_href": "/profile/Vidhya-Selvaraj-1"
                },
                {
                    "user_id": "ARNIK JAIN",
                    "user_href": "/profile/ARNIK-JAIN-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Madhura Honrao",
                "href": "/profile/Madhura-Honrao-1"
            },
            "answer_text": "MIS is “What team want to achieve + what team did + what is still pending to achieve + individual's contribution” In terms of data It's MIS guy's responsibility to prepare understandable data, with accuracy, by processing raw data…So that managerial level could analyze it and make decisions… Decisions of any company is made only on MIS reports, prepared by MIS guys…. ",
            "date": "Answered March 31, 2018",
            "views": "75",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thrimurthy S",
                    "user_href": "/profile/Thrimurthy-S"
                },
                {
                    "user_id": "Pallavi Mahadik",
                    "user_href": "/profile/Pallavi-Mahadik"
                },
                {
                    "user_id": "Nikhil Sarwade",
                    "user_href": "/profile/Nikhil-Sarwade-1"
                },
                {
                    "user_id": "Mangal Sain",
                    "user_href": "/profile/Mangal-Sain-3"
                }
            ]
        }
    ]
}