{
    "title": "What is Silicon Valley? - Quora",
    "tags": [
        "Silicon Valley"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eugene Miya",
                "href": "/profile/Eugene-Miya"
            },
            "answer_text": "I heard it’s a TV show. Geographically (where are you?): What used to be called Silicon Valley was an area in the Northern part of Santa Clara County and the southern part of San Mateo County, California. It’s a flat valley area between the Santa Cruz Mountains and Mt. Hamilton where Lick Observatory is located. I didn’t grow up here; I grew up in Southern California; so I’ve seen the contrast, but I have friends who grew up here. For various reasons, the Valley is a popular topic because a past US President won on the one-liner; “It’s the economy, stupid.” It’s the assertion of technology into the human race (wait until you see the robots to come). It’s somewhat current events (which the current CinC isn’t interested). (Economic and cultural significance) So it gets its name from the element in the Periodic Table, have you had chemistry?, and the people who work with it, directly (I once drew what are called masks in photolithography (do you know what this is? the spell checker doesn’t)) or indirectly, in software. It’s not about Silicone (although I know some somewhat clueless artists and humanists who cite women about this (that’s a different problem)). (Linguistic derivation) Many US Counties, States, and other countries are attempting to copy (clone) what’s called Silicon Valley for local economic reasons (I’ve grown up in a couple before it happened). The realistic people (my friends my fellow cynics) know that so far this has not yet happened (e.g., Facebook). Optimists for those sites cross their fingers (yeah I know cultural) and hope they are doing the right things. It takes time (chronological and economic; educational). Some of the other posted answers in the 5 attempts (so far, I can’t tell which one asked me for an answer) to answer this question get some of it right, but they are all blind men trying to describe the proverbial elephant. I won’t claim sight. I can only answer as another person of limited insight who lives here and grew up here in a chronological and historic fashion (fashion is a bad word; it’s not about fashion). So historically, the location was fertile for growth beyond agriculture when Stanford started his Jr. University here. And his people hired an important family named Terman. Lewis was one of the guys to invent the intelligence test (Lewis isn’t very popular these days). His son Fred (Sr.) started the Engineering school (I know his son the Jr., but the local Chambers of Commerce and the State of California (CalTrans) are a little clueless about this). Fred (Sr.) had some patient students (Hewlett (OK: I got a small scholarship from him) & Packard), and many others, who had customers (Disney and others (DoW)) around the area. At the same time, organizations like IBM and the phone company(ies; it wasn’t just AT&T/Western Electric but also BNR et al) needed factory space for their growing businesses, and their problem was land back East (Coast) was too expensive. This is an important lesson about growth and established bases. So smart people moved West. Oh, lest I forget, one of those smart people was a controversial Stanford student named Bill Shockley who took a job at Bell Labs (East, only to come back later). A number of his employees studied their materials science and came up with the transistor (a word first coined for them by an old boss of mine). But they felt it better to move back West (common). Shockley was a difficult person to work with. This is a good test case for hiring people, and not without grief. In Santa Clara, other businesses, many doing defense work like Lockheed, were using vacuum tubes (like IBM, too), and they picked up transistors slowly. And they would get integrated in “Processes” (this is a technical term shortened to “fab” which makes what are not called integrated circuits (aka solid-state)). Meanwhile, a whole changing social, political, and educational infrastructure was ignoring technology, which also BTW, tended to repress geek and nerd culture (such people were called Eggheads back then, people (jocks especially; this is a generalization) forget this, it’s not super important; this is merely history). It’s along this time line where the ideas of a local meritocracy with its own separate hazing rituals come to past (this is why the area has a Libertarian bent (these are 2 simple handle (meritocracy and Libertarian) for a more complex situation (I know))). Some of this was happening in Southern California. And if you are seriously understanding this (i.e., you aren’t clueless in NYC, WDC or elsewhere), find the first ARPAnet map (1969). 3 of the first 4 nodes (hey I was on #3 4 years (1973) later and would later take a program management 2 successors down the line) were in California (the East Coast establishment was too arrogant to be bothered). So Cal had land, colleges, industry . . . So a number of factors helped Northern California be fertile ground. NC didn’t have the kind of respect for bureaucracies elsewhere in the world. Hobbyist computer people saw what IBM (initially), Xerox, and aerospace firms failed to see. An essentially renegade group of Homebrewers saw and put together integrated circuits into a consumer item. These guys, and they are almost all guys (I know a few of the unspoken exceptions), made allowances for the traditional measures people: a certain variance of race (still tough if you are Black, Hispanic, other Asians (but not impossible)), sexual orientation (slightly more so than the rest of the world), appearance, dress, etc. And the question right now is: what’s really important to you? More sheer luck was involved that people realize. Most people never got advanced degrees (H-P was an exception, as well as H&P). While books and documentaries have problems, I do like Accidental Empires, Where Wizards Stay Up Late, Nerds 2.0.1 and the 2 documentaries that was based on: Triumph of the Nerds and Nerds 2.0.1. And maybe others. And that’s what Silicon Valley is. Other references: What was Mountain View, CA like before Google? Did Google have a huge impact on the development of the surrounding area, or was it just another piece of the growing puzzle? Maybe you heard of Quora? It’s also based here. What is it like to live in California? ",
            "date": "Updated October 13, 2018",
            "views": "17",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Ronald Nazarere",
                    "user_href": "/profile/Ronald-Nazarere-2"
                },
                {
                    "user_id": "Gordon Crespo",
                    "user_href": "/profile/Gordon-Crespo"
                },
                {
                    "user_id": "Arya Darijani",
                    "user_href": "/profile/Arya-Darijani-1"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gordon Crespo",
                "href": "/profile/Gordon-Crespo"
            },
            "answer_text": "Silicon Valley is a term first popularized by a guy named Don Hoefler. It was , no doubt , a term used inside the laboratories of the then called Santa Clara Valley , but Hoefler popularized it in a 1971 magazine article. Prior to then it was just the Santa Clara Valley. More famous for fruit orchards than anything else. Originally Silicon Valley boundaries were from Palo Alto down to San Jose but nowadays it really runs from San Francisco to San Jose. (Autodesk, the largest CAD software firm in the world is located even further north in San Rafael, Marin County.) Most of the largest technology companies in the world are located within the SF Bay Area / Silicon Valley region. Notably, HP, Apple, Facebook, Intel, Yahoo, Oracle, Salesforce, AirBnb, National Semiconductor, YouTube, Netflix, AMD, Ames Research Lab, Lockheed Space Systems, Fitbit, Fairchild Semiconductor, Adaptec, Agilent, Cisco, Barracuda, Dolby, Uber, DocuSign, Logitech, Solectron, SanDisk, THX and on and on and on. The only major notable exceptions are Microsoft, Amazon, Samsung, Sony, and of course several others located elsewhere in the US and the World. (GE, Motorola, Siemens, Spotify, Skype, etc…..but you all get my point, nowhere else on earth is there so large a concentration of tech firms) Most important is a huge percentage (40%) of all US venture capital is generated in SF/Silicon Valley Venture Capital Investment (in millions) Share of U.S. Total; San Francisco-Oakland-Hayward, CA $8,468 25.26% San Jose-Sunnyvale-Santa Clara, CA $4,865 14.51% New York-Newark-Jersey City, NY-NJ-PA $3,335 9.95% Boston-Cambridge-Newton, MA-NH $3,199 9.54% Los Angeles-Long Beach-Santa Ana, CA Met $1,695 5.06% Washington-Arlington-Alexandria, DC-VA-MD-WV $1,268 3.78% San Diego-Carlsbad, CA $944 2.82% Seattle-Tacoma-Bellevue, WA $873 2.61% Dallas-Fort Worth-Arlington, TX $734 2.19% Chicago-Naperville-Elgin, IL-IN-WI $650 1.94% Atlanta-Sandy Springs-Roswell, GA $514 1.53% Philadelphia-Camden-Wilmington, PA-NJ-DE-MD $495 1.48% Austin-Round Rock, TX $475 1.42% Denver-Aurora-Lakewood, CO $380 1.13% Miami-Fort Lauderdale-West Palm Beach, FL $329 0.98% Minneapolis-St. Paul-Bloomington, MN-WI $309 0.92% Raleigh, NC $283 0.84% Houston-The Woodlands-Sugar Land, TX $251 0.75% Santa Barbara-Santa Maria-Goleta, CA $250 0.75% Baltimore-Columbia-Towson, MD $237 SO WHY DID SILICON VALLEY HAPPEN? Ok, it's Saturday and I've got some time; Way back in the 1920s a professor named Dr. Frederick Terman of Stanford University convinced the administration of the university to make cheap land available for leases around Stanford to encourage students to start companies near the university. (Stanford owned and still owns huge amounts of land in Santa Clara Valley) Two of of Professor Termans’ more notable students were David Packard and William Hewlet who started building oscilloscopes for the government in 1938 in an small garage on Addison St in Palo Alto. They went on to form HP. William Schockley, co inventor of the transistor, eventually quit Bell Labs on the east coast and moved his firm, Schockely Labs to 391 San Antonio Rd in Los Altos. He moved there mainly to be close to his ailing mother. (so part of the SV’s history wasn't all due to Dr Ternan, it was in large part a family decision. ) Schockley hired the brightest scientists from around the US and world to help refine the transistor. Three notable folks he hired were Robert Noyce, Gordon Moore, and Eugene Kleiner. (Noyce and others help convince Schockley to use SILICON rather than Germanium as the Semiconductor material. (If Germanium wasn't so sensitive to heat perhaps we'd be talking about the ‘Germanium Valley’ today!!) Noyce and Moore eventually got fed up with Schockley, who turned into an asshole after winning a Nobel prize and , along with six other guys, (the treacherous eight) split off and formed Fairchild Semiconductor. Noyce and Moore eventually quit Fairchild and formed Intel and Kleiner formed Perkins/Kleiner still a huge venture capital firm. (Back then to start a firm you went to a bank or another company for $$, Venture Capital was a new concept. Venture capitalists understood the unique qualities of tech firms in a way traditional banks did not) It's important to note that many of these scientists and engineers decided to come west to escape the old fashioned, buttoned down constraints of east coast corporations. Robert Noyce in particular helped create the ‘Silicon Valley’ corporate culture in which people collaborated more, private offices were discouraged, and failure was considered OK. In fact, soon if one didn't fail enough it was felt they weren't stretching themselves enough. More importantly, if an employee wanted to go ‘start up’ their own firm it was ok and not considered disloyal. (As long as they didn't rip off other folks ideas) Keep in mind that back then, folks tended to stick with companies their entire careers and quitting to work elsewhere or to start your own firm was frowned upon, especially back east. So many companies spun off of Fairchild Semiconductor that they were nicknamed ‘Fairchildren’  Today, while the San Francisco Bay Area and Silicon Valley remains the undisputed world leader in technology the term ‘'Silicon Valley’ is becoming more of a state of mind rather than a particular geographic area. “Silicon Valley's” are beginning to pop up all over the world and that's a very good thing. Whether in LA (Silicon Beach), New York (Silicon Alley) and Austin, Boston, Seattle, Bangladore, ShenZhen, Tel Aviv and so many other places, the biggest and most important ‘export’ of Silicon Valley is the unique culture now referred to as the Silicon Valley State of Mind. It's doubtful the SF Bay Area / Silicon Valley's reign as the tech capital of the world will be toppled anytime soon but even if it is, so what. There's plenty of the technology pie to share throughout the world! Note; It should also be noted that the US governments decision to build Moffet Field in Santa Clara County resulted in a huge amount of research into microwave and radar research needed to defeat Germany in WW 2. That fact and the ‘race to the moon’ kickstarted many Silicon Valley firms as well. ",
            "date": "Answered July 15, 2017",
            "views": "6",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sagar Rai",
                    "user_href": "/profile/Sagar-Rai-3"
                },
                {
                    "user_id": "Khoi Nguyen",
                    "user_href": "/profile/Khoi-Nguyen-95"
                },
                {
                    "user_id": "Karan Gade",
                    "user_href": "/profile/Karan-Gade-12"
                },
                {
                    "user_id": "Jitendra Kumar Vishwakarma",
                    "user_href": "/profile/Jitendra-Kumar-Vishwakarma-1"
                },
                {
                    "user_id": "Alyasa Gan",
                    "user_href": "/profile/Alyasa-Gan-1"
                },
                {
                    "user_id": "Hema Daryani",
                    "user_href": "/profile/Hema-Daryani"
                },
                {
                    "user_id": "Tarun Pal",
                    "user_href": "/profile/Tarun-Pal-48"
                },
                {
                    "user_id": "Vitthal Parvatikar",
                    "user_href": "/profile/Vitthal-Parvatikar"
                },
                {
                    "user_id": "Ramiro Vargas",
                    "user_href": "/profile/Ramiro-Vargas-1"
                },
                {
                    "user_id": "Auriel Wright",
                    "user_href": "/profile/Auriel-Wright"
                }
            ]
        }
    ]
}