{
    "title": "What is the front part of a semi-truck called? - Quora",
    "tags": [
        "Semi-trucks (Big rigs)",
        "Truck Drivers",
        "Trucking"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Forbes",
                "href": "/profile/David-Forbes-107"
            },
            "answer_text": "The front part of a semi-truck (technically, “semi-trailer”) is called the tractor. The combination is often referred to as a tractor-trailer. Tractors come in a variety of shapes and sizes, from conventional, with a hood covering the engine, to cab-over, which lacks a front hood and positions the windshield almost directly above the front wheels. Tractors range in both length, horsepower, and gross weight, depending on the service they’re intended for. The tractor is connected to the trailer by means of a kingpin on the underside of the front of the trailer. This kingpin engages a clamp in a coupling plate mounted near the rear of the tractor, and serves as the pivot point for the semi-trailer combination. The tractor contains the cab, which is where the driver sits, and often includes a sleeper compartment behind the cab. City trucks don’t usually have a large cab, since the drivers go home every day, but over-the-road trucks have larger cabs with sleepers and room for the driver to store extra clothes, food, and personal items. Drivers are sometimes on the road for weeks or even months at a time (I did this myself for almost two years), and need to have a reasonable amount of comfort so they can sleep when they’re not on duty. ",
            "date": "Answered November 15, 2019",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Wolff",
                    "user_href": "/profile/Robert-Wolff-16"
                },
                {
                    "user_id": "Douglas Harry",
                    "user_href": "/profile/Douglas-Harry-1"
                },
                {
                    "user_id": "Jason Bailey",
                    "user_href": "/profile/Jason-Bailey-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Ferreira",
                "href": "/profile/Steven-Ferreira-14"
            },
            "answer_text": "Are you talking about the tractor, which is what the trailer is connected to? Or do you mean the grill, which sits over the steer axle? Perhaps you’re referring to the zombie driving the truck at 0330 (3:30 in the morning for you civilians)? It’s all the same thing. Tractor - vehicle used to pull a trailer. Driver sits inside, sleeps inside it, wishes they had paid attention in school in it. Trailer - receptacle of items driver is tasked with hauling. So many different kinds of trailers exist. I’ve been a driver 10 years, still see trailers I don’t recognize daily. ",
            "date": "Answered November 15, 2019",
            "views": "464",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert Wolff",
                    "user_href": "/profile/Robert-Wolff-16"
                },
                {
                    "user_id": "Mark Wrhel",
                    "user_href": "/profile/Mark-Wrhel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Boardman",
                "href": "/profile/Rob-Boardman-4"
            },
            "answer_text": "The front part is called the bumper bar or radiator grill :-) ",
            "date": "Answered August 1, 2020",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Buchman",
                    "user_href": "/profile/Tim-Buchman-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Boyd",
                "href": "/profile/Bill-Boyd-65"
            },
            "answer_text": "only in USA are they called tractors every else they are called prime movers ",
            "date": "Answered March 26, 2020",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Wilmshurst",
                    "user_href": "/profile/David-Wilmshurst"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Erlenbush",
                "href": "/profile/Jon-Erlenbush-1"
            },
            "answer_text": "The tractor or power unit. ",
            "date": "Answered November 15, 2019",
            "views": "50",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Robert Wolff",
                    "user_href": "/profile/Robert-Wolff-16"
                }
            ]
        }
    ]
}