{
    "title": "What is time for Martin Heidegger? - Quora",
    "tags": [
        "Martin Heidegger (philosopher, author)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Richards",
                "href": "/profile/Justin-Richards-10"
            },
            "answer_text": "Time is, for Martin Heidegger, the same thing time is for anyone else. And, time can be described using any theory of what time is, without effecting what Heidegger says about time. The question for Heidegger is not what is time, time is the horizon of Being, it is where and how anything that is Is. Whatever is, is in time. Human beings experience time. Of course, the way that human beings are in time is different from the way a chair or a rock persist, if only for the fact that the human being knows that time passes, and that the passage of time ultimately leads one to ones own death. In Being and Time it is this aspect of being towards death that Heidegger emphasizes, as well as an orientation to the future that developed from Nietzsche’s philosophy of will. Willing is the faculty that not only guides us into the future but creates the future as an authentic tense: It will be. And then, Heidegger turns around and stops asking the question of Being from the perspective of human beings, even of Dasein, and starts asking, I don’t know maybe, the question of human being from the perspective of Being. Post-turn Heidegger is no longer concerned with the future at all, instead he asks us to will not to will, and to turn towards Thinking, which is not merely to ratiocinate, calculate, analyze or any ordinary faculty of mind. Thinking is something we have forgotten, it lies buried in the past. Only the past is not behind us, the past presences itself in history, in language, and quite importantly, in things. It is only through the ability of history to preserve the past and carry it into the present that something as stable as a world is able to come into Being at all. Sometimes, the thing persists beyond its world, the Greek Temple no longer houses the god Zeus, and yet its columns still rise joining earth and sky. Does it still join mortals and gods, does it gather the fourfold into the unity of Being? The will’s orientation towards the future is one of creative productivity, thinking’s orientation towards the past, on the other hand, is essentially impotent (when viewed through the lens of the will), it can do nothing. Except, it can remember, it can gather, and it can preserve. Thinking is gratitude, thankfulness, and grace. Thinking creates through such orientations to the past, and to what is, such creation is called poesis, and such creation is not oriented towards a future, but instead proceeds into the future from a starting point. That point is the world, gathered into the thing, presencing the world around it. Of course, if you really want to know about things, and time, and orientations to the future and the past, I suggest skipping Heidegger, somewhat, and going to Hannah Arendt and reading The Human Condition, which is about things and world, and how actions become things, and Life of the Mind, which is composed of two volumes Thinking and Willing. In these three volumes Arendt does a much better job of explaining the human experience of timeliness, and the condition of worldliness, than Heidegger does in, jesus, how many volumes? ",
            "date": "Answered February 20, 2017",
            "views": "899",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fernando Barbosa Barros",
                    "user_href": "/profile/Fernando-Barbosa-Barros"
                },
                {
                    "user_id": "Tiago Sanguinetti",
                    "user_href": "/profile/Tiago-Sanguinetti"
                },
                {
                    "user_id": "Alec Rosekrans",
                    "user_href": "/profile/Alec-Rosekrans-1"
                },
                {
                    "user_id": "Advika Singh",
                    "user_href": "/profile/Advika-Singh"
                },
                {
                    "user_id": "Desmond James",
                    "user_href": "/profile/Desmond-James-7"
                },
                {
                    "user_id": "Marian Soare",
                    "user_href": "/profile/Marian-Soare"
                },
                {
                    "user_id": "Arjun Ravichandran",
                    "user_href": "/profile/Arjun-Ravichandran-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Week",
                "href": "/profile/David-Week-1"
            },
            "answer_text": "Tough one, since Heidegger wrote a very long and dense book called Being and Time and to answer that question. My understanding: First, let’s understand why Heidegger was interested in time. He considered time an essential aspect of being human, or Dasein. This is Heidegger’s term for the nature of being human. It’s most often translated as Being-in-the-world, or just Being. Heidegger’s thesis is that we have forgotten what it means “to be”. Through the history of Western culture, we’ve arrived at an understanding that “to be”, or to exist, means to exist as a discrete object in space. Heidegger attempted to recover an earlier, more primordial understand if Being (the capitalisation does not imply some kind of deity.) In his phenomenological analysis of the experience of being human he rejects the notion that human beings exist as objects in space. Rather, that the “in” in Being-in-the-world is not at all like the spatial “in” of “the water in the glass”, but more like the “in” of “being in love”. To exist is to be involved in the world, immersed in the world: an experience of non-separateness. Just as Being is not to exist as an object in space, time for Heidegger is not like a line stretching into the future or the past. In other words, our Cartesian notions of space and time are limited aspects of our experience, but not the whole of our experience. Our primordial experience of time is an orientation towards the future. This defintition may sound circular: how can we have a “future” unless there is a pre-existing time? But what Heidegger is saying is that this orientation of Dasein or Being comes first, and our abstracted, linear idea of time as a line is just that: an abstraction built upon this primordial orientation. For Heidegger Being and time are closely related, because this orientation towards the future is an essential part of being human. We are always concerned for the future. We are always projecting ourselves into the future. And because we are always projecting ourselves into the future, we are always aware of the limit of these projects, which is death. We live with a constant awareness of death. It’s because this awareness of death, through our basic orientation towards the future, that leads to Heidegger being classed as existentialist—among other things. To know more, I’d recommend Hubert Dreyfus’s course on Being and Time, which you can find on iTunes U or Listen Out Loud. It comes in two parts, corresponding to divisions one and two of Being and Time. ",
            "date": "Answered February 20, 2017",
            "views": "703",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Advika Singh",
                    "user_href": "/profile/Advika-Singh"
                },
                {
                    "user_id": "Lou Savage",
                    "user_href": "/profile/Lou-Savage-1"
                }
            ]
        }
    ]
}