{
    "title": "What if the world were without Internet for a day? - Quora",
    "tags": [
        "The World",
        "Web Design"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sohan Basak",
                "href": "/profile/Sohan-Basak"
            },
            "answer_text": "I wake up at 6:30 listening to my alarm. I browse through my bed searching for my phone. It shows 3 notifications from WhatsApp and 5 from facebook. (from previous night) and maybe 1 answer request from Quora. I text a few friends on WhatsApp not even noticing my messages aren't getting through. I get up and get ready for work. I leave for work. Because nobody at my home turns on news in morning to avoid morning negativity. As the day progresses, I work as a teacher so not much happens. I usually don't use the internet at work. At the break, I open Quora… 503 error! Not a very uncommon thing. It happens! I close down. I open facebook. I scroll through and browse the newsfeed. Facebook app has this clever thing that it downloads so many posts in the background and it doesn't even show all of them and it doesn't look like much. I try to play a video on Facebook and I notice that I'm not connected. I don't pay much attention and work and come home. My mom complains, “There is no internet for the entire day” I scream, “whyyyyy!!” My mom turns on the TV and the networks broadcast this news that there is no internet and their work is harmed because all they can communicate over is telephonic lines and no emails, slack is working. I feel empty! Broke! Defeated. I go and talk to mom! Wow! Mom is so interesting I never knew. So, that is how she got that scar on her face? Haha. She was so daring and strong! We talk all day, neither she nor I am stuck in social media. Friends call, they come over! We have fun! Talk, eat, drink, sleep! And the next day, internet restores and all the big corporates are affected. Economy boomed! But me? Not so much. I am an insignificant person! So, not much can affect me. Media plays doomsday song but I know my mom's scar was how she fought with men of her class and she beat the shit of that dude! Hilarious!! World can't take away your happiness if you have a happy family! :) ",
            "date": "Answered December 9, 2018",
            "views": "748",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Riki Barman",
                    "user_href": "/profile/Riki-Barman"
                },
                {
                    "user_id": "Tanmoy Dutta",
                    "user_href": "/profile/Tanmoy-Dutta-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neel Bhavsar",
                "href": "/profile/Neel-Bhavsar-5"
            },
            "answer_text": "Internet is something that has connected the entire world, and era in which Internet being a very important resource in urban life. I would try to keep this concise yet proper. The following would happen without Internet: I] Communication and social disaster 1) Social media has entered in our lives and bonded to the deepest of human feelings. Facebook, Twitter, Instagram, etc would be completely inaccessible. Majority of the human population is now connected to each other with the help of the social media. You thus wont be able to connect to the your relative or friend on the other side of the world.  2) Cell phones may have many types. Considering calling service also being a part of the Internet or an Internet resource, you won’t be able to call other people. Cell phone network providers will suffer losses of billions of dollars in a day.  3) Complete Chaos will struck humanity as you can imagine how worried you would be if you are unable to call your relative or family member and the radio news will be full of thousands of people coming on streets and causing riots as well as stealing and causing public property damage. (only the radio will be on at that time not even the television service as it is also an Internet infrastructure).  II] Industrial and Economic disaster: 1) Inability of the world to further communicate, every business giant will collapse as Google, Amazon, will lose their entire heartline. All networks will be rendered useless, all websites will be inaccessible. Economic losses will struck the entire world, for we will be back into 1960s or will be forced to play the T-rex game. :D  2) The shares will retain the values of the last known variables. This may cause millions of investors to lose millions of dollars and every other investor will redraw his money from their respective shares or investments. 3) Banks will suffer losses. Thus every government will be in an economic crisis. III] Political Crisis 1) Due to economic collapse governments will face a huge crisis. This will cause the leaders to take hasty decisions and may cause further chain of losses both to the government as well as the people. 2) Political pressure will arise as anti government forces will be finding that perfect chance to collapse the government. More riots, now political ones will find their way to the chaos. 3) Terrorist forces and organizations will be having the perfect chance to heat up the environment and hit a country or multiple countries with attacks. This may include nuclear attacks too (quite a possibility). This may even heat up to a possible world war 3 in the future. (I may be exaggerating but this may be the output)  In short every possible chaos due to lack of proper communication will hit humanity at that day. It will then depend on every individual in the world to be alert and stick together to fight chaos and bring back the order and peace to the world till the disaster has completely gone. ",
            "date": "Answered May 29, 2016",
            "views": "66",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonabelle Ballesteros",
                    "user_href": "/profile/Jonabelle-Ballesteros"
                },
                {
                    "user_id": "Oli Smyth",
                    "user_href": "/profile/Oli-Smyth"
                },
                {
                    "user_id": "Rishi Kumar",
                    "user_href": "/profile/Rishi-Kumar-1629"
                },
                {
                    "user_id": "Arjun R",
                    "user_href": "/profile/Arjun-R-22"
                },
                {
                    "user_id": "Ruthvik Reddy",
                    "user_href": "/profile/Ruthvik-Reddy-45"
                },
                {
                    "user_id": "Vidha Choudhary",
                    "user_href": "/profile/Vidha-Choudhary"
                },
                {
                    "user_id": "Nikhil Bhavar",
                    "user_href": "/profile/Nikhil-Bhavar-1"
                },
                {
                    "user_id": "John Keith",
                    "user_href": "/profile/John-Keith-25"
                },
                {
                    "user_id": "Xeerow Waan",
                    "user_href": "/profile/Xeerow-Waan"
                },
                {
                    "user_id": "Vishal Singhania",
                    "user_href": "/profile/Vishal-Singhania-1"
                }
            ]
        }
    ]
}