{
    "title": "What is the National Clean Air Program? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Sakonsa Organisation",
                "href": "/profile/Sakonsa-Organisation"
            },
            "answer_text": "What is NCAP? The Government of India launched the \"National Clean Air Programme (NCAP)\" to overcome air pollution. For pan India, NCAP is a time-bound methodology to handle the increasing air pollution issues across the country.  It is a midterm national-level strategy implemented by India's government to control air pollution, a five-year action plan with 2019 as the first year. This program is community-oriented and covers all sources responsible for pollution. It aims is to attain annual average air quality within a specific timeframe with the target of 25% to 30% reduction of PM2.5 and PM10 concentration by 2024 is imposed under NCAP, and 2017 is taken as the base year to compare concentration. Objectives of NCAP ⮚ Across the nation, various ambient air quality monitoring systems are established and expanded for ensuring a broad-ranging and reliable database. ⮚ A proper plan for the management of air pollution. ⮚ To have efficient data dissemination and public outreach mechanism for timely measures for prevention and mitigation of air pollution and inclusive public participation in planning and executing the programs and arrangement approaches of government on air pollution. To make a firm command with a solid legitimate back up for urban areas and regions to execute NCAP in a specific time for significant air pollution reduction so this program will not be notified under the Environment Protection Act or any other related activities. Around 102 non-attainment cities are included under this plan. Read the full article at NCAP ",
            "date": "Answered September 12, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shuvendu Mazumdar",
                "href": "/profile/Shuvendu-Mazumdar-1"
            },
            "answer_text": "Please don’t misunderstand me. I am not trying to malign any efforts by the Government and other Agencies, but it may be like this….  If you are really interested to know and be conscious about Air Pollution and thereby contribute towards reducing it, may I request you to follow the below link and read similar articles posted by me earlier. Shuvendu Mazumdar's answer to With pollution levels reaching new heights in many Indian cities, what can be a practical and feasible solution to the problem? Shuvendu Mazumdar's answer to Is it too late to reverse all the air pollution? And if YOU want to make a positive contribution towards the health and wellbeing of your loved ones, please read the below article. Shuvendu Mazumdar's answer to How does pollution affect the consumers of the city (Kolkata)? Thank you and my apologies if my comments have hurt anyone or any department. ",
            "date": "Answered January 15, 2019",
            "views": "43",
            "upvotes": "0"
        }
    ]
}