{
    "title": "What are recommended payment gateways that support travel booking? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Johannes Koeppel",
                "href": "/profile/Johannes-Koeppel-1"
            },
            "answer_text": "I highly recommend checking out WeTravel (wetravel.com), the payment platform for travel companies. We allow you to easily create beautiful payment pages for travel offerings and group trips which can immediately be booked by your clients:  Why do travel professionals use WeTravel? Lower fees: Most users switch to WeTravel because we allow them to save credit card fees. In addition to collecting credit card payments, we allow organizers to collect funds online directly from a client’s US bank account. WeTravel only charges a 1% processing fee and NO monthly fees (see our pricing here). This way, organizers can save the the hefty credit card fees and immediately boost their bottom line by 2-3%More professional payment collection: Many travel professionals have built an amazing travel brand, but the way they collect payments just does not reflect that great brand. Our payment platform gives them a beautiful and modern way to collect payments which is fully aligned with their brand (see examples here and here).Booking Management System: WeTravel is not just a payment platform, it’s a complete booking and CRM system. Through our dashboard for group trips, travel professionals manage all financials (refunds, payment plans, payouts to vendors) and all communication. We even provide them with powerful tools to promote their offerings. Who uses WeTravel? WeTravel is used by thousands of travel organizers. Our users include large travel companies, tour operators and DMCs, but also smaller player such as yoga retreat organizers, individual travel agents or student trip organizers. Our revolutionary payment solution is 100% PCI compliant, safe and used to transact millions of dollars every month. Full Disclosure: I’m the CEO of WeTravel. Feel free to reach out if you would like to hear more or contact us for a free 15-minutes demo call. ",
            "date": "Answered May 19, 2017",
            "views": "784",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tia Ross",
                    "user_href": "/profile/Tia-Ross-2"
                },
                {
                    "user_id": "Evelina Korvel",
                    "user_href": "/profile/Evelina-Korvel"
                },
                {
                    "user_id": "Zaky Prabowo",
                    "user_href": "/profile/Zaky-Prabowo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Fein",
                "href": "/profile/Jennifer-Fein-1"
            },
            "answer_text": "When collecting payments for travel you want to make sure the payment getaway has reasonable settlement rules (measured in days not months) and does not aggressively block credit card transactions. Some companies are using the same payment gateway account (integrated into their booking platform) which can lead to a poor reputation for your travel brand if the gateway restricts ALL businesses due to the poor behavior of a few. When choosing a travel booking platform to support your travel business make sure it’s integrated with more than one global payment gateway. For example, our company, YouLi Travel Management Platform, is integrated with Stripe and Square by default, and will integrate additional getaways for Enterprise clients. One of the benefits of using a platform that allows you to manage your gateway independently is that you can switch gateways without having to switch your trip management software. So if Square offers a better price or settlement terms, you can switch from Stripe to Square with a few clicks and your clients will not be impacted. ",
            "date": "Answered August 3, 2019",
            "views": "221",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tia Ross",
                    "user_href": "/profile/Tia-Ross-2"
                }
            ]
        }
    ]
}