{
    "title": "What is it like to work for Jeff Bezos? - Quora",
    "tags": [
        "Jeff Bezos",
        "Amazon (company)",
        "Technology",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Phillip Remaker",
                "href": "/profile/Phillip-Remaker"
            },
            "answer_text": "“People like Jeff are better regarded as hyper-intelligent aliens with a tangential interest in human affairs.” Steve Yegge inadvertently made a public post of an internal message comparing styles at Google and Amazon. (Stevey's Google Platforms Rant) where he talked a little about Jeff’s towering genius and micromanaging style. It’s a great read, but his follow up post (Last week I accidentally posted an internal rant about service platforms to my…) talked more about working for Jeff Bezos. I recommend that you read both, but I have provided the crux below for the too-lazy-to-click-a-link folks: Over the years I watched people give presentations to Jeff Bezos and come back bruised: emotionally, intellectually, often career-ily. If you came back with a nod or a signoff, you were jumping for joy. Presenting to Jeff is a gauntlet that tends to send people back to the cave to lick their wounds and stay out of the sunlight for a while. I say “presentations” and you probably think PowerPoint, but no: he outlawed PowerPoint there many years ago. It’s not allowed on the campus. If you present to Jeff, you write it as prose. One day it came time for me to present to Jeff. It felt like... I don’t know, maybe how they swarm around you when you’re going to meet the President. People giving you last-minute advice, wishing you luck, ushering you past regiments of admins and security guards. It’s like you’re in a movie. A gladiator movie. Fortunately I’d spent years watching Jeff in action before my turn came, and I had prepared in an unusual way. My presentation -- which, roughly speaking was about the core skills a generalist engineer ought to know -- was a resounding success. He loved it. Afterwards everyone was patting me on the back and congratulating me like I’d just completed a game-winning hail-mary pass or something. One VP told me privately: “Presentations with Jeff never go that well.” […] To prepare a presentation for Jeff, first make damn sure you know everything there is to know about the subject. Then write a prose narrative explaining the problem and solution(s). Write it exactly the way you would write it for a leading professor or industry expert on the subject. That is: assume he already knows everything about it. Assume he knows more than you do about it. Even if you have groundbreakingly original ideas in your material, just pretend it’s old hat for him. Write your prose in the succinct, direct, no-explanations way that you would write for a world-leading expert on the material. You’re almost done. The last step before you’re ready to present to him is this: Delete every third paragraph. Now you’re ready to present! Back in the mid-1800s there was this famous-ish composer/pianist named Franz Liszt. He is widely thought to have been the greatest sight-reader who ever lived. He could sight-read anything you gave him, including crazy stuff not even written for piano, like opera scores. He was so staggeringly good at sight-reading that his brain was only fully engaged on the first run-through. After that he’d get bored and start embellishing with his own additions. Bezos is so goddamned smart that you have to turn it into a game for him or he’ll be bored and annoyed with you. That was my first realization about him. Who knows how smart he was before he became a billionaire -- let’s just assume it was “really frigging smart”, since he did build Amazon from scratch. But for years he’s had armies of people taking care of everything for him. He doesn’t have to do anything at all except dress himself in the morning and read presentations all day long. So he’s really, REALLY good at reading presentations. He’s like the Franz Liszt of sight-reading presentations. So you have to start tearing out whole paragraphs, or even pages, to make it interesting for him. He will fill in the gaps himself without missing a beat. And his brain will have less time to get annoyed with the slow pace of your brain. I mean, imagine what it would be like to start off as an incredibly smart person, arguably a first-class genius, and then somehow wind up in a situation where you have a general’s view of the industry battlefield for ten years. Not only do you have more time than anyone else, and access to more information than anyone else, you also have this long-term eagle-eye perspective that only a handful of people in the world enjoy. In some sense you wouldn’t even be human anymore. People like Jeff are better regarded as hyper-intelligent aliens with a tangential interest in human affairs. But how do you prepare a presentation for a giant-brained alien? Well, here’s my second realization: He will outsmart you. Knowing everything about your subject is only a first-line defense for you. It’s like armor that he’ll eat through in the first few minutes. He is going to have at least one deep insight about the subject, right there on the spot, and it’s going to make you look like a complete buffoon. Trust me folks, I saw this happen time and again, for years. Jeff Bezos has all these incredibly intelligent, experienced domain experts surrounding him at huge meetings, and on a daily basis he thinks of shit that they never saw coming. It’s a guaranteed facepalm fest. So I knew he was going to think of something that I hadn’t. I didn’t know what it might be, because I’d spent weeks trying to think of everything. I had reviewed the material with dozens of people. But it didn’t matter. I knew he was going to blindside me, because that’s what happens when you present to Jeff. If you assume it’s coming, then it’s not going to catch you quite as off-guard. And of course it happened. I forgot Data Mining. Wasn’t in the list. He asked me point-blank, very nicely: “Why aren’t Data Mining and Machine Learning in this list?” And I laughed right in his face, which sent a shock wave through the stone-faced jury of VPs who had been listening in silence, waiting for a cue from Jeff as to whether he was going to be happy or I was headed for the salt mines. I laughed because I was delighted. He’d caught me with my pants down around my ankles, right in front of everyone, despite all my excruciating weeks of preparation. I had even deleted about a third of the exposition just to keep his giant brain busy, but it didn’t matter. He’d done it again, and I looked like a total ass-clown in front of everyone. It was frigging awesome. So yeah, of course I couldn’t help laughing. And I said: “Yup, you got me. I don’t know why it’s not in there. It should be. I’m a dork. I’ll add it.” And he laughed, and we moved on, and everything was great. Even the VPs started smiling. It annoyed the hell out of me that they’d had to wait for a cue, but whatever. Life was good. You have to understand: most people were scared around Bezos because they were waaaay too worried about trying to keep their jobs. People in high-level positions sometimes have a little too much personal self-esteem invested in their success. Can you imagine how annoying it must be for him to be around timid people all day long? But me -- well, I thought I was going to get fired every single day. So fuck timid. Might as well aim high and go out in a ball of flame. That’s where the “Dread Pirate Bezos” line came from. I worked hard and had fun, but every day I honestly worried they might fire me in the morning. Sure, it was a kind of paranoia. But it was sort of healthy in a way. I kept my resume up to date, and I kept my skills up to date, and I never worried about saying something stupid and ruining my career. Because hey, they were most likely going to fire me in the morning. ",
            "date": "Updated June 5, 2019",
            "views": "873",
            "upvotes": " View 2.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brad Silverberg",
                    "user_href": "/profile/Brad-Silverberg"
                },
                {
                    "user_id": "Sandeep Ravindra",
                    "user_href": "/profile/Sandeep-Ravindra"
                },
                {
                    "user_id": "Manpreet Singh",
                    "user_href": "/profile/Manpreet-Singh-223"
                },
                {
                    "user_id": "Michèle Diana Sharik",
                    "user_href": "/profile/Michèle-Diana-Sharik"
                },
                {
                    "user_id": "Sean Billings",
                    "user_href": "/profile/Sean-Billings-1"
                },
                {
                    "user_id": "George Anders",
                    "user_href": "/profile/George-Anders"
                },
                {
                    "user_id": "Paul K. Young",
                    "user_href": "/profile/Paul-K-Young-3"
                },
                {
                    "user_id": "Sumit Jha",
                    "user_href": "/profile/Sumit-Jha-3"
                },
                {
                    "user_id": "Max Manzhos",
                    "user_href": "/profile/Max-Manzhos"
                },
                {
                    "user_id": "Abhinav Saxena",
                    "user_href": "/profile/Abhinav-Saxena-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Venky Harinarayan",
                "href": "/profile/Venky-Harinarayan"
            },
            "answer_text": "Jeff is a genius. He is the smartest guy I have worked with. He is also a super nice person. I remember, once I finished a particularly good meeting with him, and was walking out of his office - he called out to me and said: \"Venky, just wanted to thank you very much for working here\". I have never said that to anyone and no one since has said that to me :) A few months after we sold Junglee to Amazon, the CEO of Junglee, Rakesh Mathur, decided to leave Amazon. Right after he told Jeff, Jeff was in my office, concerned that I may also leave. I told Jeff I was very happy but would like more of his time. This resulted in Jeff and I having a weekly meeting -- it was his last meeting of the day, so sometimes would go on for much more than an hour. We would just sit down and discuss random topics of importance to Amazon and honestly was amazing fun. Marketplaces, Financial Metrics, Valuation, Retail Strategy, Competition, you name it, we talked about it. It was a crucial time in the evolution of Amazon and Jeff had great ideas and it was so much fun to hear his thinking and question it. When I was leaving Amazon, I told Jeff, I love, love working with you, but I want to work with start-ups. So it’s a hard choice, but I think I am going to pick the start-up path. Jeff said, no you don’t have to make a choice, let's do both. So after some twists and turns, Jeff became a partner and largest investor in my fund, Cambrian Ventures. So I got to keep in touch with him for a few more years after I left Amazon. ",
            "date": "Updated May 7, 2018",
            "views": "6916",
            "upvotes": " View 16.9K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brad Silverberg",
                    "user_href": "/profile/Brad-Silverberg"
                },
                {
                    "user_id": "Suraj Singh",
                    "user_href": "/profile/Suraj-Singh-91"
                },
                {
                    "user_id": "Akshaya Salunke",
                    "user_href": "/profile/Akshaya-Salunke"
                },
                {
                    "user_id": "Sarah Smith",
                    "user_href": "/profile/Sarah-Smith"
                },
                {
                    "user_id": "Hemanth Shivasubramaniam",
                    "user_href": "/profile/Hemanth-Shivasubramaniam"
                },
                {
                    "user_id": "Rony Samuel",
                    "user_href": "/profile/Rony-Samuel-2"
                },
                {
                    "user_id": "Anandan Sundar",
                    "user_href": "/profile/Anandan-Sundar"
                },
                {
                    "user_id": "Sameer Joshi",
                    "user_href": "/profile/Sameer-Joshi-1"
                },
                {
                    "user_id": "Emily Huynh",
                    "user_href": "/profile/Emily-Huynh-20"
                },
                {
                    "user_id": "Trevor Schauer",
                    "user_href": "/profile/Trevor-Schauer-2"
                }
            ]
        }
    ]
}