{
    "title": "What was your first encounter with technology? - Quora",
    "tags": [
        "First Experience",
        "Encounter",
        "Personal Experiences",
        "Technology",
        "Experiences in Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Summers",
                "href": "/profile/Chris-Summers-22"
            },
            "answer_text": "What do you consider technology? I was around 7 when I was taking my toys apart like RC cars and radios to find out how they worked. When I was around 12–13 I got a 200 in 1 electronics creation toy. It had transistors, capacitors, LEDs, computer chips, and other electronic components that you wired together through springs and a wire to connect them. I had my first run in with a computer in high school with an Apple 2 in BASIC coding class and also took an electronics class in shop. In 1985 my dad got an Apple Macintosh of which I got to do a lot of things on when I was allowed to. In the later 80s I started working on TV repair and with the transition to digital tuners. This later brought VCR repair and I had my first side business working on TV and VCR repair. In the 90s I started computer repair and it became my second side business at that time. That lasted to 15 years of computer repair and sales. So what exactly is the “technology” you are inquiring about. Is it in general or specific? ",
            "date": "Answered July 23, 2019",
            "views": "528",
            "upvotes": " Answer requested by Laila Ismail",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Anat-Aimee-Azure"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "Written August 5, 2019. One of my first encounters was with a spinning top toy, when I was extremely young, like zero to 1-year-old. The toy was designed so that if the middle spiral rod was shoved down repeatedly, it would make a mechanical noise and begin to spin. It was fairly large, like 8-inches across (or maybe a bit smaller than I remember). Both me and my brother played with it, and it created a sense of competitiveness and a sense that the world was full of mechanical playthings. Anecdotes ",
            "date": "Updated March 24, 2020",
            "views": "89",
            "upvotes": " View 1 Upvoter"
        }
    ]
}