{
    "title": "What is the progress of science and technology in India? - Quora",
    "tags": [
        "Progress",
        "Higher Education in India",
        "Science",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shubham Satyam",
                "href": "/profile/Shubham-Satyam"
            },
            "answer_text": "Science and Technology sector has seen some spark in the recent years and has a bright prospect in future. Gross expenditure in the R&D sector has been increasing in absolute terms but the share of funds as a percentage of GDP remains a concern (0.69%) if we compare it with countries like Israel (4.3%), US (2.3%) and China (2.1%). This abysmal number for R&D is due to the disconnect between teaching and research activities in India. While India has some of the finest institutions in natural sciences, they aren't actively engaged in research activities. Indian universities have restricted themselves to the activity of teaching while the burden of research has fallen on the government institutions like CSIR, ICMR, ICAR, DRDO, ISRO etc. On account of this acute disconnect, the number of people who are interested to take up research activities is poor although their number in absolute terms is rising. Secondly, there has been a significant rise in the number of publications in non-peer reviewed paid journals and India is leading the list with 30% of all such publications. But, these publications have poor citation value and so there's very little to celebrate here. Thirdly, India has become the world’s 7th largest patent-filing office. But, it still has a huge backlog of patent applications which needs to be taken care of. Government’s engagement: Government has come up with a lot of initiatives to boost up the S&T sector- Missions like National Mission on Mathematics, Dark Matter, Genomics, Agriculture, Supercomputing, Energy Storage System etc.INSPIRE: offers a lucrative fellowship to NRIs.VAJRA: invites faculties from other countries to take up research projects in India.SWAYAM: provides open platform for learning for a number of courses.SERB-DIA: Awards to reward distinguished researchers.SHRI: Science and Heritage Research InitiativeKIRAN: to promote women scientists for research work.Startups are being promoted with Startup India scheme and Make In India vision. Put summarily, Science and Technology sector has a bright prospect in coming years as the government is trying to leverage its resources to boost the R&D ecosystem in the country. ",
            "date": "Answered May 21, 2019",
            "views": "61",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sangraam",
                    "user_href": "/profile/Sangraam"
                },
                {
                    "user_id": "Lopamudra Adak",
                    "user_href": "/profile/Lopamudra-Adak"
                },
                {
                    "user_id": "Shipra Mukherjee",
                    "user_href": "/profile/Shipra-Mukherjee"
                },
                {
                    "user_id": "Sanyam Vyaghra",
                    "user_href": "/profile/Sanyam-Vyaghra"
                },
                {
                    "user_id": "Krishna Chaitanya",
                    "user_href": "/profile/Krishna-Chaitanya-217"
                },
                {
                    "user_id": "Ankur Vasani",
                    "user_href": "/profile/Ankur-Vasani-2"
                },
                {
                    "user_id": "Rushitha",
                    "user_href": "/profile/Rushitha"
                },
                {
                    "user_id": "Garima Sharma",
                    "user_href": "/profile/Garima-Sharma-142"
                },
                {
                    "user_id": "Harshit Sharma",
                    "user_href": "/profile/Harshit-Sharma-414"
                },
                {
                    "user_id": "Surya Mishra",
                    "user_href": "/profile/Surya-Mishra-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Varun Aggarwal",
                "href": "/profile/Varun-Aggarwal-21"
            },
            "answer_text": "There are three aspects of science and technology. One is creation of new knowledge, that happens through research. The second is spreading the knowledge, which is through teaching and the third is application of knowledge, that happens through industry. India ranks 12th in research, whereas USA and China rank 1st and 2nd. When we look at high impact research, India measures 1/15th of USA and 1/7th of China. See some data here: http://www.sciencesatyagraha.org/p/data.html India is definitely not a torchbearer in cutting edge research. Again, the number of productive researchers in India are only 27000, as compared to 1/17th of US and 1/7th of China. With regard to training, some of the top institutions like the IITs, AIIMS, etc. do well in undergraduate education in engineering and some sciences. However, the quality of education is not very good in a large number of colleges. Aspiring Minds’ employability reports have noted that less than 20% college graduates are employable in functional roles such as software engineering, mechanical engineering or the biotechnology industry. The third is using science and technology in products and services. India does have a large IT industry and a growing biotechnology industry. However, India still has very few companies which have globally competitive and differentiated products and services. Consider MIT Technology Review’s list of world’s smartest companies. In 2012–2016, India has no companies in the list while US has 105 and China 14. Read more here: Leading Science and Technology: India Next? ",
            "date": "Answered June 29, 2018",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ajit Mohanty",
                    "user_href": "/profile/Ajit-Mohanty-3"
                },
                {
                    "user_id": "Ayush Gupta",
                    "user_href": "/profile/Ayush-Gupta-48"
                },
                {
                    "user_id": "Manoj Sharma",
                    "user_href": "/profile/Manoj-Sharma-118"
                }
            ]
        }
    ]
}