{
    "title": "What is a good idea for an artificial intelligence project? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Prashant Kikani",
                "href": "/profile/प्रशांत-किकानी-Prashant-Kikani"
            },
            "answer_text": "Here are some ideas.... Famous game Tic-tac-toe. Try to achieve this goal, not by brute force. Produce some efficient algorithm to remove repeated steps.Make some other games which includes AI. Let say, direction. By some manner your program should be able to guide the correct way to goal. Take that path, start and goal as input.Generate a program that produces a real time \"time table\" of some university. Let say, one professor is taking lecture at current time than at any other place he/she can't take lecture. right? And there should be a half hour break between lectures of the same faculty. And in one class there should be some specific number of lectures in a day. Let say, 4 lectures. There are two breaks in a working day, first of 15 minutes. Other of launch break of 45 minutes.... other features you can add by real time application.Produce a program that encrypts your text. Noone can understand that message. Only you can. That will increase some good logic connections in your Brain. Program will generate a random 16 latter alphanumeric key, and encrypts your message..very private...!!At last, you can develop a program that can talk with Human. As a friend. Like siri, cortana... Develop your own program that understand your signs. That is little complicated task. Because we humans speaks same statements in different moods....Pick one of the above. Start your work. Let you create your own trail. Best of LUCK... Have a nice day. ",
            "date": "Answered August 15, 2016",
            "views": "138",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ramya Chaganti",
                    "user_href": "/profile/Ramya-Chaganti-1"
                },
                {
                    "user_id": "Ujjal Das",
                    "user_href": "/profile/Ujjal-Das-14"
                },
                {
                    "user_id": "Gayathri Amirtharaj",
                    "user_href": "/profile/Gayathri-Amirtharaj"
                },
                {
                    "user_id": "Muhammad Hadi",
                    "user_href": "/profile/Muhammad-Hadi-19"
                },
                {
                    "user_id": "Jahnavi Reddy",
                    "user_href": "/profile/Jahnavi-Reddy-38"
                },
                {
                    "user_id": "Anu Srini",
                    "user_href": "/profile/Anu-Srini-2"
                },
                {
                    "user_id": "Anushka Babu Raj",
                    "user_href": "/profile/Anushka-Babu-Raj"
                },
                {
                    "user_id": "Wasif Al Mahmud",
                    "user_href": "/profile/Wasif-Al-Mahmud"
                },
                {
                    "user_id": "Ashish Poojary",
                    "user_href": "/profile/Ashish-Poojary-3"
                },
                {
                    "user_id": "Omair Zamir",
                    "user_href": "/profile/Omair-Zamir"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Bentley",
                "href": "/profile/Peter-Bentley"
            },
            "answer_text": "There are so many flavours of AI that it often comes down to personal preference. I've always liked evolutionary computation - there are lots of fun things you can do with genetic algorithms and they have a habit of surprising you with some very unexpected results. Neural networks are fun for learning - plenty of problems there, from computer vision to speech recognition to bioinformatics. Or if you're more mathematically minded, look at logic based AI or statistical machine learning, or probabilistic learning. When I started I was 8 years old. (Let's see... um... 35 years ago.) I built little robots and tried to make intelligent controllers for them. I also wrote models of different natural systems - evolution, flocking, growth of plants, chaotic motion of waves. Ultimately I've always found that the best way to learn is by doing. Have a go at something that sounds interesting to you, and have fun. ",
            "date": "Answered December 10, 2015",
            "views": "52",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-26759"
                },
                {
                    "user_id": "Anushka Babu Raj",
                    "user_href": "/profile/Anushka-Babu-Raj"
                },
                {
                    "user_id": "Bikash Singh",
                    "user_href": "/profile/Bikash-Singh-158"
                },
                {
                    "user_id": "Anthony Bible",
                    "user_href": "/profile/Anthony-Bible-1"
                }
            ]
        }
    ]
}