{
    "title": "What are current forms of unsustainable technology? - Quora",
    "tags": [
        "Sustainability",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mick Stute",
                "href": "/profile/Mick-Stute"
            },
            "answer_text": "Oh boy, where to start with this one? Do I mention factory food that produces calories instead of nutrition? Do I mention agriculture with chemical-based fertilizer instead of natural healthy soil? Do I mention the absolute waste of energy in our every day electronic devices (your remote doesn’t have a power switch to turn your TV on, but in fact both of them are powered all the time; one waiting for a button press, the other for a single to come fully awake)? No, instead I think I’ll go with the root cause of almost all of these. The answer I chose to give is oil-based energy. It is 100%, and in the most aggressive definition of the word, unsustainable.  First of all, remember that matter can neither be created or destroyed. We also know that matter and energy are essentially the same (E=M * C *C). Energy can only change form (to other energy or to matter) or transferred to another form (such as electricity to heat — such as an electric stove through resistance). Second, in the natural world only plants can produce energy (producers), others either tear larger structures apart to produce energy directly (decomposes) or through the process of digestion (consumers). All we do on the earth is use energy from the sun as collected by plants. Fortunately the sun is still producing all that energy for us by bathing us in energy in the forms of heat, light, and all forms from the invisible spectrum.  Coal and oil are the energy collected by plants from many millions of years ago that has changed form due to heat and pressure. Mining them has become so cheap that it is almost like free energy. It is a source of energy that we use every day in large quantities. It is energy from pasts eras. We use it to generate electricity, for powering transportation, to generate heat (and other forms of energy) for manufacturing. We carry devices with a huge amount of stored energy (in respect to size) mostly to keep in contact with others, our so-called, social circles (social media like Facebook, Instagram, Snapchat, and Quora [though Quora hates this label]). We have hundreds of millions devices that use power all the time to make our lives easier and this isn’t a bad thing, except at some point you have to wonder if we didn’t have the power of previous eras at our disposal could we sustain ourselves? Check out this page on Wikipedia, and sort if by the “Renewables as Total % of generation”: List of countries by electricity production from renewable sources - Wikipedia Now compare that to this page sorted by “Average Power per Capita”: List of countries by electricity consumption - Wikipedia To help you with the math, check out this report: Use of Oil - Energy Explained, Your Guide To Understanding Energy - Energy Information Administration A country with only 4.29% of the world’s population uses 20.5% of the world’s oil and only produces 14.7% of it using renewable sources. Also note that 71% of the total oil used in the US for transportation, such as personal transportation as well as getting all those consumable goods to the stores for you to buy. Some far I have talked just about using coal and oil for energy, I haven’t even spoken of its use as a component of manufacturing. In the third link above (Uee of Oil) it also shows that 24% is used for industry. This is power as well as a component. These are known as “feed stocks” which is something used to make something else. Coal is a feed stock to distill oil into fuels and oils but it is also a feed stock used to make all plastics either as heat and electricity to run manufacturing equipment (the smallest percentage) or as the main component to make the plastic itself (the largest). The largest feed stock to make agricultural fertilizer is oil. Here’s a partial list: 144 Products Made From Petroleum and some that may may shock you. Oil is so important that it backs nearly all forms of money (which are fiat-based systems. Of course, because of this nearly every major conflict since the discovery of oil has been an oil war.) In fact, most wars the US has initiated (all in the name of freedom and jusitice) has been petrodollar warfare or a form of Dollar hegemony - Wikipedia when Nixon unilateral canceled of the direct international convertibility of the United States dollar to gold. So how many lives have been lost in the interest of oil? Are blinking LED signs (certainly low energy at least) that flash ads 24-hours a day, or buildings with buildings with spectacular light displays. Is being contacted through smart phones 24-hour a day worth it? Why not, we have lots of it anyway, right? But keep in mind that plastic made form oil has changed the medical industry to make it cheaper and safer. That things made from plastic can last much longer than many things made from wood or metal. To me it is a waste of a very important non-renewable resource to use 71% of it getting to work or filling stores with hordes of nearly worthless (and completely unnecessary) goods. Are there other plastics? Yes, but none as versatile as petro-plastics. We have many uses to use renewable power generation but we choose, not to ignore them, but refuse to use them because of hegemony. We are literally burning money in our gas tanks and someday (probably fairly soon) we won’t have much left, provided the earth is still cool enough for use to live on it. For the finger pointers, yes I am American (though I no longer live there): I live in an off-grid house with 600W of solar panels. After some adjustment I have found that to be enough for all our needs. Do we conserve? Hell yes we do. We are aware of every light in the house at all times. We know the wattage requirements for everything we buy and we chose to buy very little. Do we always have enough? Yes, we do because we are aware of how we use it. Do we always have all we want? No we don’t. But we have enough and to us that matters. ",
            "date": "Answered February 14, 2019",
            "views": "646",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nate Ott",
                    "user_href": "/profile/Nate-Ott"
                },
                {
                    "user_id": "Kevin Hom",
                    "user_href": "/profile/Kevin-Hom-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clifton Middleton",
                "href": "/profile/Clifton-Middleton"
            },
            "answer_text": "Water based toilets, this is a big and totally dangerous, unsustainable technology that not only pollutes our shared water supply but wastes the very valuable natural resources contained in our humanure. Using our water system as a toilet is the worst idea humans have ever had, we are literally killing ourselves with what we need to survive. Our urine and poo should be collected and recycled into agriculture and fuel production and not injected into the water system full of unprocessed pharmaceuticals and biochemicals. The average person consumes 1000 pounds of food a year. It takes 50 pounds of Nitrogen to grow 1000 pounds of food, more or less. The average person puts off 49 pounds of organic Nitrogen a year. If we simply recycle ourselves we could support an unlimited population and the demands of survival will make the Pee technology replace and transform all of agriculture. read Hard Seed. ",
            "date": "Answered November 8, 2018",
            "views": "378",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nate Ott",
                    "user_href": "/profile/Nate-Ott"
                },
                {
                    "user_id": "Brian Fey",
                    "user_href": "/profile/Brian-Fey"
                },
                {
                    "user_id": "Ilgaz Er",
                    "user_href": "/profile/Ilgaz-Er"
                },
                {
                    "user_id": "Kevin Hom",
                    "user_href": "/profile/Kevin-Hom-6"
                }
            ]
        }
    ]
}