{
    "title": "What is a user interface? - Quora",
    "tags": [
        "User Interface Design",
        "User Interfaces"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Shoemate",
                "href": "/profile/Ben-Shoemate-1"
            },
            "answer_text": "User Interface is the interface between a user and a system. An interface is the part of system (such as a car) that facilitates the transfer of information (such as your speed) from the system to the user (driver) and from the user back to the system (using the gas pedal and brake to tell the car to speed up or slow down).  The user interface of a car consists of the steering wheel, dashboard, brakes, gear shift, etc. Normally when the phrase \"user interface\" is used, we are talking about the visual interface that the user sees. Since this is the most flexible (and thus in-flux) part of a system - it is the part we talk about the most.  While it's technically true that user interface of your computer is the keyboard and mouse - even if the interface was a matrix style jack into your brain we would be talking about what you saw inside the matrix to interact with the system.  So the \"plug\" in the above concept image is the \"brain - system interface\" and the crappy graphs and charts are the \"user interface\". (Although I can not imagine anyone jacking into a system with a user interface like that.  The user interface of a website is the text, images, links, and buttons you click on. Bottom line: The user interface is everything that sends or receives information from the user. There are other interfaces as well that allow systems to talk to other systems. In your computer for example there is a network interface (wifi modem), there is a usb interface, audio interface for headphones, etc. But user interface generally refers to the part the user sees.  I thought for sure this was a duplicate but could not find a good option to merge it. Thanks for the question. ",
            "date": "Answered January 25, 2016",
            "views": "17",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ravender Virk",
                    "user_href": "/profile/Ravender-Virk"
                },
                {
                    "user_id": "Anchal Gautam",
                    "user_href": "/profile/Anchal-Gautam-33"
                },
                {
                    "user_id": "Wiz Vidal Amimo",
                    "user_href": "/profile/Wiz-Vidal-Amimo"
                },
                {
                    "user_id": "Victoria Chiderah",
                    "user_href": "/profile/Victoria-Chiderah"
                },
                {
                    "user_id": "Ivan Braun",
                    "user_href": "/profile/Ivan-Braun-1"
                },
                {
                    "user_id": "Chris Owen",
                    "user_href": "/profile/Chris-Owen-53"
                },
                {
                    "user_id": "Rakesh Parmar",
                    "user_href": "/profile/Rakesh-Parmar-27"
                },
                {
                    "user_id": "Marina Yalanska",
                    "user_href": "/profile/Marina-Yalanska"
                },
                {
                    "user_id": "RoshanKumar Poojari",
                    "user_href": "/profile/RoshanKumar-Poojari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Herman Waltz",
                "href": "/profile/Herman-Waltz"
            },
            "answer_text": "An operating system is a collection of system programs that controls and co-ordinates the overall operations of a computer system. It provides an interface for the user to interact with the computer. A computer needs a operating system to do work. Without operating system, a computer is like a car with no fuel. User interface is used to interact with the computer to performs various tasks. User gives commands to computer and enters the data into computer. These are examples of user interfacing. The operating system plays the main role for interfacing between user and computer. The input devices like keyboard and mouse are commonly used for giving commands to computer. Types of Operating Systems Based on the user interface, there are two types of operating systems. Graphical User Interface Operating SystemCommand Line Operating SystemGraphical User Interface Operating System Graphical User Interface (GUI) operating system presents commands in graphical form. For example, application programs, commands, disk drives, files etc. are presented in the form of icons. Usually a command is given to the computer by clicking with mouse on the icon. GUI also provides menus, buttons and other graphical objects to the user to perform different tasks. GUI is very easy to interact with the computer. Command Line Operating System A command line operating system provides a command prompt on the computer screen. The commands are given to the computer by typing on the keyboard. The commands are typed according to the predefined format. The users have to memorize commands and rules of writing these commands. It is not an easy way to interface with the computer. ",
            "date": "Answered August 26, 2016",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aishwarya Wahane",
                    "user_href": "/profile/Aishwarya-Wahane"
                },
                {
                    "user_id": "Dharani Kv",
                    "user_href": "/profile/Dharani-Kv"
                }
            ]
        }
    ]
}