{
    "title": "What's a good way for me to play a VHS tape if I don't own a VCR? - Quora",
    "tags": [
        "VHS",
        "Panasonic (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Filipe M. Cross",
                "href": "/profile/Filipe-M-Cross"
            },
            "answer_text": "What's a good way for me to play a VHS tape if I don't own a VCR? You do not have one. How do you want to play a video cassette without the video cassette player? You have only two options. Either borrow one from a friend or buy one. Well… you can always try to find a VCR rental store. VCR Player rental I am sure you will have a great difficulty finding one but, who knows, maybe you are lucky and you have one just around the corner. How do VHS players work? ",
            "date": "Answered April 28, 2020",
            "views": "524",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "EDay",
                "href": "/profile/EDay-2"
            },
            "answer_text": "They make an adapter that will make VHS-C tapes playable in a regular VCR.  Or they did.... it looks like a VHS tape, and you insert the VHS-C.  If you can find one, use that to play the tape on a regular VCR.  You can buy a VCR at Goodwill for next to nothing.  Another thought is to put an ad on Craigslist and offer someone 5 bucks to use their player.  I realize this answer probably doesn't meet your urgent need, based on the date of your post. ",
            "date": "Answered February 7, 2011",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Soji Ogunnaike",
                "href": "/profile/Soji-Ogunnaike"
            },
            "answer_text": "Buy a DVD-VHS combo unit. Can be found for cheap on ebay. https://www.ebay.com/itm/Magnavox-MWD2205-DVD-VCR-Combo-Player-VHS-Video-Cassette-Recorder/254129286404?epid=1101520931&hash=item3b2b492d04:g:6jMAAOSw0q1cak-8:rk:1:pf:0 ",
            "date": "Answered February 18, 2019",
            "views": "335",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ethan Parmet",
                "href": "/profile/Ethan-Parmet"
            },
            "answer_text": "Without a source to input the analog data, you can’t play it. ",
            "date": "Answered July 5, 2020",
            "views": "89",
            "upvotes": "0"
        }
    ]
}