{
    "title": "What is virtualization? - Quora",
    "tags": [
        "For Dummies",
        "Desktop Virtualization",
        "Virtualization"
    ],
    "response": [
        {
            "author_info": {
                "name": "Noor Muhammad Khan",
                "href": "/profile/Noor-Muhammad-Khan-12"
            },
            "answer_text": "Virtualization is a concept in computing wherein we hide the real resources and the complexities of their implementation from end users, for various benefits such as security, optimization, consolidation etc. In computing, there are primarily 2 kinds of Virtualization.  Hardware Virtualization : Here the resource is your typical Processor Cores, Memory and may be storage.Cores can be divided by a process called hardware partitioning, which essentially mean that a single processor comprising of 4 cores can be divided to act as 2 processors or machine with 2 cores each. Different manufacturers (IBM, HP, Dell) provide different partitioning options.Main memory can either be divided basis the address allocation or having an entirely different module of each partitionStorage is partitioned by using concepts such as Block Storage, which again appear as individual hard drives to the user or applicationSoftware Virtualization : This refers to Virtualizing the software layers and achieved through the use of softwares such as VMware, VirtualBox and others. In this even though the hardware cores are not partitioned, it appears that they are grouped together into bunch of resources. Some concepts related to it are Hypervisor and Host and Guest Operating systems. To achieve this type of Virtualization, software such as VMware is installed on top of OS (called Host OS), which then in turn allows user to install OS (Guest OS) of choice and other applications. As you can see, there is complexity added due to 2 layers, and there is an overhead and cost on performance.Other Implementation of Virtualization, which we do not realize are IP addresses (DNS), Accessing resource through Web Servers, API Gateways, Masking the endpoints, Mediation etc etc.And yes, Virtualization is behind the scene technology running present day Cloud applicationsIf you are looking for the answer in urdu or hindi language, you can watch the video beolw:Thanks :)  ",
            "date": "Answered February 10, 2018",
            "views": "28",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ibrahim Suleiman Jr.",
                    "user_href": "/profile/Ibrahim-Suleiman-Jr"
                },
                {
                    "user_id": "Enrico Maestri",
                    "user_href": "/profile/Enrico-Maestri"
                },
                {
                    "user_id": "Chirag Vij",
                    "user_href": "/profile/Chirag-Vij-1"
                },
                {
                    "user_id": "Fahima Farook",
                    "user_href": "/profile/Fahima-Farook-1"
                },
                {
                    "user_id": "Day Maivan",
                    "user_href": "/profile/Day-Maivan"
                },
                {
                    "user_id": "Tony Brunch",
                    "user_href": "/profile/Tony-Brunch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saurabh Negi",
                "href": "/profile/Saurabh-Negi-23"
            },
            "answer_text": "Virtualization is a concept in computing wherein we hide the real resources and  the complexities of their implementation from end users, for various benefits such as security, optimization, consolidation etc. In computing, there are primarily 2 kinds of Virtualization Hardware Virtualization : Here the resource is your typical Processor Cores, Memory and may be storage. Cores can be divided by a process called hardware partitioning, which essentially mean that a single processor comprising of 4 cores can be divided to act as 2 processors or machine with 2 cores each. Different manufacturers (IBM, HP, Dell) provide different partitioning options.Main memory can either be divided basis the address allocation or having an entirely different module of each partitionStorage is partitioned by using concepts such as Block Storage, which again appear as individual hard drives to the user or applicationSoftware Virtualization : This refers to Virtualizing the software layers and achieved through the use of softwares such as VMware, VirtualBox and others. In this even though the hardware cores are not partitioned, it appears that they are grouped together into bunch of resources. Some concepts related to it are Hypervisor and Host and Guest Operating systems. To achieve this type of Virtualization, software such as VMware is installed on top of OS (called Host OS), which then in turn allows user to install OS (Guest OS) of choice and other applications. As you can see, there is complexity added due to 2 layers, and there is an overhead and cost on performance.Other Implementation of Virtualization, which we do not realize are IP addresses (DNS), Accessing resource through Web Servers, API Gateways, Masking the endpoints, Mediation etc etc.And yes, Virtualization is behind the scene technology running present day Cloud applicationsHope it helps...  ",
            "date": "Answered April 22, 2016",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alpana Chaphalkar",
                    "user_href": "/profile/Alpana-Chaphalkar"
                }
            ]
        }
    ]
}