{
    "title": "What is Sustainable Technology? - Quora",
    "tags": [
        "Sustainability",
        "Sustainable Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaron Dahlen",
                "href": "/profile/Aaron-Dahlen"
            },
            "answer_text": "Cradle to grave Hikmat, Cradle to grave… Sustainable technology encompasses the life cycle of all material and processes that keep us alive. It is the technology that provides the food you eat, the cloths on your back, the roof over your head, as well as the transportation and material at your place of work. The primary objective is to minimize the required materials and energy input so that we may have the minimal impact on this earth. With improving technology, we do not squander resources and we endeavor to minimize pollution. From here, the answer is clouded by our values and beliefs about what is best for the future. Some people hold a nostalgic longing to return to nature. That’s a good thing as it helps us understand the wisdom of our ancestors as well as the sometimes wretched conditions they faced. At the other extreme, folks talk about our transition to the city; how we have become metro sapiens. That’s a good thing too, as there is an efficiency associated with the city. Citizens in our best cities have a smaller footprint than their country or suburb dwelling counterparts. Please keep an open mind when talking about sustainable technology. The ideas get tangled up with our hopes and dreams. The technology gets tangled up with economics and politics. The cynic would say sustainable technology is big business. Then again, the optimist would say sustainable technology is big business… Regards, APDahlen ",
            "date": "Answered January 7, 2019",
            "views": "272",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward Hutchinson",
                    "user_href": "/profile/Edward-Hutchinson-12"
                },
                {
                    "user_id": "John Robson",
                    "user_href": "/profile/John-Robson-110"
                },
                {
                    "user_id": "Glenn Sampson",
                    "user_href": "/profile/Glenn-Sampson-2"
                },
                {
                    "user_id": "Hikmat Gumilar",
                    "user_href": "/profile/Hikmat-Gumilar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Garvin H Boyle",
                "href": "/profile/Garvin-H-Boyle"
            },
            "answer_text": "At this point in the history of the human race, I do not think that any technology can be properly characterized as “sustainable”. I apologize if the following answer seems to be “nit picking”, or “hair splitting”. But I have a problem with the use of the adjective “sustainable” when it is applied to technologies. This includes fashion products (such as clothes), soaps, detergents, tooth pastes, construction methods, and most commercial products and services. I, personally, think that cultures and civilizations can be characterized as “sustainable” only if the people who enjoy the benefits of that culture or civilization have the means and desire to “sustain” it for some foreseeable time into the future. It seems to me that we people who enjoy our global modern culture have neither the means nor the common desire to make the difficult decisions needed to sustain that global culture for much longer. Technologies, products and practices that contribute to the sustainability of a culture cannot properly be characterized as “sustainable”. They are tools that may enhance sustainability. In my view, there are no sustainable technologies, at the moment, because they are all contributing to the destruction of the environment on which our global culture is 100% totally dependent. Some technologies may be less destructive. Some may be more destructive. The real problem of the world, at the moment, is too many people. Imagine a field that is over-run with mice. This happened in the Ottawa valley (in Canada) where I grew up at some time in the 1960s. One spring there was an unusual number of mice. That summer they chewed up most of the plants, grass and seeds. Our garden produced very little food, but our cats were happy. Over the winter, mouse trails appeared everywhere in the snow, and the owls were happy. In the spring, every tree had all of the bark removed for about 12 inches (below the snow line) and there were no mice to be seen. Now imagine a mouse philosopher in the summer before the population collapse. He might ask himself “Is it more sustainable for us to eat the grass roots, the new grass leaves as they grow, or the stalks with seeds?” Well an interesting argument could be made as to which of the three options is more “sustainable”, but the real problem is that the mice population was too large. All three options are overly destructive to the environment. The problem was not in what or how they ate. The population was in overshoot. This mouse philosopher is asking the wrong question. When we label products like tooth past as environmentally friendly, it gives us a good feeling to use it because we can imagine that we are actually helping the environment as we use it. That is nonsense. The problem is too much tooth paste, due to too many people. We need to recognize the elephant in the room. But recognition that we are in a dangerous state of population overshoot opens the ethical issues of how do we handle population overshoot. It is much more pleasant to choose an “eco-friendly” tooth paste, and forget about the elephant. If anybody were to ask me what “technology” I think is the most destructive to our planet, I would have to say “the knowledge of how to run an economy”. We are using outdated (or obsolete) theories to run our global economy, and it is destroying the environment on which we are dependent. Modern economic theory is not competent to give our business and political leaders effective advice. We need to put real research dollars into the development of a better economic theory that is rooted in modern systems science, and not rooted in the equilibrium theories of the 1880s. Just an opinion. ",
            "date": "Answered September 12, 2019",
            "views": "257",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edward Hutchinson",
                    "user_href": "/profile/Edward-Hutchinson-12"
                },
                {
                    "user_id": "Eric Lee",
                    "user_href": "/profile/Eric-Lee-1261"
                },
                {
                    "user_id": "Douglas Nuttall",
                    "user_href": "/profile/Douglas-Nuttall"
                }
            ]
        }
    ]
}