{
    "title": "What would people think if they could read your mind? - Quora",
    "tags": [
        "Mind Reading",
        "The Mind",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cindy D. Calvert",
                "href": "/profile/Cindy-D-Calvert-1"
            },
            "answer_text": "“What would people think if they could read my mind?” Well, I think that whoever it would be that could get in there, would find it rather traumatic a place to be. Dark and gloomy and slippery, even slimy in some places, with tons of closed doors that I suppose would appear and vanish just as fast. These are the doors that leads to my various vaults. Locked away inside these rooms would be where I keep my most treasured memories. Once inside one of these rooms, you would find vast encompasses, just massive spaces with no ceilings at the top. Some rooms might be just a jungle. Blue skies, tropical paradise with wildlife and colourful maccaws to boot, but beware the striped tiger that looms within there, for he be the keeper with the golden key around his neck. Other spaces, another room, might be filled to the brim with drawer-upon-drawer of files. Beautifully organised and colour-coded by year, date and time. These could be where I keep my childhood memories, my stacks of research on various topics or just general information I store on people that I might have to recall again someday. Neat and easily accessible. Oh I could go on and on and on… describing each room and it's function, but who here even has the time to read through all of that? The point is, I don't think anybody else could handle the amount of things that goes on in my head at any given time. I am used to what goes on up in there, since I have created it, after all. Most times it's a truly wonderful place to be trapped within, it's the other times… Those are the times when it could drive the perfectly sane, into the perfectly insane.  ",
            "date": "Answered October 20, 2020",
            "views": "401",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shaz Siebert",
                    "user_href": "/profile/Shaz-Siebert"
                },
                {
                    "user_id": "Charles Begin",
                    "user_href": "/profile/Charles-Begin-4"
                },
                {
                    "user_id": "Mindy Jung",
                    "user_href": "/profile/Mindy-Jung"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kene Ibeneme",
                "href": "/profile/Kene-Ibeneme"
            },
            "answer_text": "At a shop: Random Stranger A: *enters and stands behind me* Random stranger: Oh shit, he just thought, ‘Great, another person!’, and now he’s uncomfortable. Oh, shit. Now he wants to get out of here as fast as possible. Wait, is that me? *sniff sniff*. Nope. On a street: Random Stranger B: *sees me approaching from the opposite direction* Random Stranger B: Why is he thinking about stars and how to fix a plot hole? He sees me now. Lemme ask him how to get to destination x. Oh shit, why’s his heart beating so fast? Oh boy, now he wants to get out of here ASAP. At the ATM: Random Persons C, D, E, F… V: *see me walking in* Random Persons C, D, E, F… V: Uh-oh, better not say a word to this one. Looks like he could hit you if you talk to him. Now he’s thinking about going to a POS to withdraw some money. Somewhere: Friend or family: *dials my number* Friend or family: Shit, he just thought, ‘CAN’T YOU TEXT!?’ – oof, better text. Ah, scratch that. Lemme call. Hehe. *3 minutes later* Friend or family: Now he’s thinking he’s so exhausted, he wants to take a looong nap. ",
            "date": "Answered October 20, 2020",
            "views": "77",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Olivia Kelley",
                "href": "/profile/Olivia-Kelley-31"
            },
            "answer_text": "they would probably freak out wondering why i want to know what happens when you swallow acid, or freeze a human in liquid nitrogen, or when i googled how much a hitman costs. Whoever is reading my mind right now, i´m sorry lol ",
            "date": "Answered October 20, 2020",
            "views": "54",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kyle Phoenix",
                    "user_href": "/profile/Kyle-Phoenix-1"
                },
                {
                    "user_id": "Mary Rojas",
                    "user_href": "/profile/Mary-Rojas-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Grace Dwyer",
                "href": "/profile/Grace-Dwyer-17"
            },
            "answer_text": "I want world peace and love. Get rid of Corona virus, terrorism, poverty, and idiots ASAP!  ",
            "date": "Answered October 20, 2020",
            "views": "356",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "File Don Sa",
                    "user_href": "/profile/File-Don-Sa"
                },
                {
                    "user_id": "David Anderson",
                    "user_href": "/profile/David-Anderson-1248"
                },
                {
                    "user_id": "Adnan Sheikh",
                    "user_href": "/profile/Adnan-Sheikh-92"
                },
                {
                    "user_id": "Srinivas",
                    "user_href": "/profile/Srinivas-648"
                },
                {
                    "user_id": "Sunil",
                    "user_href": "/profile/Sunil-1029"
                },
                {
                    "user_id": "Alex W Morris",
                    "user_href": "/profile/Alex-W-Morris"
                }
            ]
        }
    ]
}