{
    "title": "What are the differences between different types of storage devices? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Thomas Robison",
                "href": "/profile/Thomas-Robison-6"
            },
            "answer_text": "For the sake of this answer I will define storage device as one that provides persistence for the data. Meaning if you turn off the power the data remains on it. USB flash Drives or USB thumb drives are usually small but there is now a Western Digital Sandisk of 1Tb size ($199.00). Solid State Drives are larger versions of the thumb drive. They’re designed to replace the internal hard drive. The size range is usually 128 Gb to Western Digitals new line that tops out at 30.72 Tb. No price on that one yet but the 7.68 Tb is available for a mere $2,100.00. The USB drives or generally of lesser quality than their SSD counterparts. While both can provide long term storage of data the USB variety does not have the same self monitoring capabilities of an SSD. The result is they are not as reliable as SSD’s. Hard Disk Drives use a system of moving parts to transfer data from memory to a magnetic platter spinning at 5400, 7200 or 10,000 RPM. The largest I’ve found is 16 Tb. Everybody has that size, it appears for approx $500.00. DVD and CD’s are still used to store data. A single CD holds 700 Mb while a single layer DVD holds 4.7 Gb, dual layer doubles that. Re-writable discs are available. The storage life for use as an archive is still being debated but, there are DVD-M discs available that promise a lifetime of 1,000 years. Relatively expensive compared to regular DVD’s. An LG burner capable of burning M-Disc is 77.89 on Amazon. Standard 4.7 Gb discs go for $3.00. There are 25, 50 and 100 Gb sizes for 5, 10 and $20.00. Magnetic tape devices are used in business and commercial applications. They provide a go method of recording linear data and are reusable. They are not often seen in the home PC. They are expensive at $100.00+ for a drive and $5.00 for a 1 Tb tape. The draw back is no random access. Floppy disc drives, ZIp drives and probably some other types I’ve missed have basically become obsolete. Although, I have a 3.5 floppy and a ZIp drive on hand just in case. I hope I gave you the info you were looking for. The type of storage device you use depends on the data you need to store. Choose wisely. ",
            "date": "Answered April 23, 2020",
            "views": "365",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Liran Cohen",
                "href": "/profile/Liran-Cohen-26"
            },
            "answer_text": "you’re probably frequently see Storage and Memory. Storage often refers to the long data manipulation of the device. such as photos, Music, videos. Files you’ve stored. STORAGE literally means you can store stuff in the device. in 95% of the cases it’ll be the HIGHER value of the two. (for example. the 64GB in 64/4 combo) MEMORY refers to the SHORT term data manipulation. such as running apps. your games. the important images you have to edit an image using Adobe editor. etc. It’s active, and it’s constantly changing. the device will not store things in it as you open new things, other apps can need that memory. it’s also working at nearly the same speed as the processor. which is the brain and heart of your device. typically. it’s the LOWER value of the two, (the 4GB one in 64/4 combo ) ",
            "date": "Answered December 9, 2018",
            "views": "390",
            "upvotes": "0"
        }
    ]
}