{
    "title": "What's it like to work in a data center? - Quora",
    "tags": [
        "Data Center Management",
        "Data Centers",
        "What Is It Like to Work at X?",
        "System Administration",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Henry",
                "href": "/profile/George-Henry-1"
            },
            "answer_text": "The best part is the autonomy.  DC techs are like Sargents in the military.  they are given a task and left to devise solutions based on; documented process (when that fails) past experiences (when that fails)  Peer chat rooms (when that fails) -- the internet (when that fails) -- trial and error.   The request form above is to just do your magic, very few folks outside the data center have even seen your servers.  Just like how fireman take extreme care of their stations and trucks, you take care of your center and servers.  Give people a tour of your data centers and they will have the same look that kids have when they go to a fire station....  no idea how this stuff works but it sure looks neat. ps... you will never be able to give a tour of a Google, Amazon or Apple data center -- so get a job at Facebook. The facts:24/7 shift coverage (pay usually increases by 5% for each Swing/Grave)YahooAmazon, rackspace, net2ez -- most cloud providers because they have paying customers 8/hr coverageGoogle, Facebook, Entry level jobs:• most people come in as temp (try and buy) workers.these pay between 14-18/hr depending on the regiona person will work these jobs between 4-11 months before being hired full time (relative to there being an opening with the full time team in that period)• few people care about certifications but they do show interest and willingness to try.• Aptitude can be determined by a 45 minute interview pretty easily.•• what was the last computer you built•• what is your favorite OS and why** can you work in an environment where you have spoken to no one in person in 8 hours•• we would slam a blade server on the table, point to parts and ask \"what is that\" Perks:not as good as working at corp, you are lucky to get a desk.  As the team grows your work environment improves (12 or so people usually warrants free food and video game consoles).   I can expand on any of these if you have more questions. g ",
            "date": "Answered April 12, 2014",
            "views": "142",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roman Madrid",
                    "user_href": "/profile/Roman-Madrid-1"
                },
                {
                    "user_id": "AxiosMC - Official Channel",
                    "user_href": "/profile/AxiosMC-Official-Channel"
                },
                {
                    "user_id": "Ian Icaza",
                    "user_href": "/profile/Ian-Icaza"
                },
                {
                    "user_id": "Jonathan Carr",
                    "user_href": "/profile/Jonathan-Carr-7"
                },
                {
                    "user_id": "Vuthy Reach",
                    "user_href": "/profile/Vuthy-Reach-2"
                },
                {
                    "user_id": "Ben Cooper",
                    "user_href": "/profile/Ben-Cooper-55"
                },
                {
                    "user_id": "Nossy Drelich",
                    "user_href": "/profile/Nossy-Drelich"
                },
                {
                    "user_id": "Sathish",
                    "user_href": "/profile/Sathish-450"
                },
                {
                    "user_id": "Henry Nwobi",
                    "user_href": "/profile/Henry-Nwobi"
                },
                {
                    "user_id": "Chris Dewan",
                    "user_href": "/profile/Chris-Dewan"
                },
                {
                    "user_id": "Avinash Hiremath",
                    "user_href": "/profile/Avinash-Hiremath-1"
                },
                {
                    "user_id": "Alex Neville",
                    "user_href": "/profile/Alex-Neville-16"
                },
                {
                    "user_id": "Matthew Petach",
                    "user_href": "/profile/Matthew-Petach"
                },
                {
                    "user_id": "Jonathan Russell",
                    "user_href": "/profile/Jonathan-Russell-73"
                },
                {
                    "user_id": "Kevin Whittemore",
                    "user_href": "/profile/Kevin-Whittemore"
                },
                {
                    "user_id": "Ryan McQuillan",
                    "user_href": "/profile/Ryan-McQuillan"
                },
                {
                    "user_id": "Avinash Doddi",
                    "user_href": "/profile/Avinash-Doddi"
                },
                {
                    "user_id": "Duh Huh",
                    "user_href": "/profile/Duh-Huh-1"
                },
                {
                    "user_id": "Jake Davis",
                    "user_href": "/profile/Jake-Davis"
                },
                {
                    "user_id": "Jack Yong",
                    "user_href": "/profile/Jack-Yong-4"
                },
                {
                    "user_id": "Judith Stevens",
                    "user_href": "/profile/Judith-Stevens-1"
                },
                {
                    "user_id": "Michael Cordero",
                    "user_href": "/profile/Michael-Cordero-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Narsing Shah A",
                "href": "/profile/Narsing-Shah-A"
            },
            "answer_text": "It's not as exciting as others have mentioned in the answers. Ofcourse it's like you are in military as George Henry has answered to this question. There is quote that goes “BE CAREFUL WHAT YOU WISH FOR. BECAUSE YOU MIGHT GET IT”. I did projects that I'm proud of, projects that the people of my country depend on. Not everyone gets as lucky as me. Thanks to the almighty. Believe me my friend, There were moments when I was SWEATING in that cold for the extreme pressure from my top management. I was in such a team, and I was enjoying every moment of learning and exploring the world of servers except the below cons. You should always be available on call 24/7You should be ready to sacrifice holidays and weekends.You should be ready to lift calls during a family dinner and stay on for a period of 1 to 2 hours.You should also be ready to lift heavy weights upto 30 kgs (In order to replace hardware components)You should be ready to bear the cold : AC rooms having temperatures ranging 6 to 15 Celsius (in India)You should be ready to take all the pressure from the top management for the hardware failure that happened without your fault or influence.You should be accountable to 5 or more teams on call while you are working on the hardware in that chilled environment.An Unplanned Outage can strip your self respect in front of 20 people.An Unexpected mistake can kick you out of your jobI have moved to CLOUD team, and life has never been so much exciting. ",
            "date": "Answered July 27, 2019",
            "views": "16",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simarpreet Sodhi",
                    "user_href": "/profile/Simarpreet-Sodhi-1"
                },
                {
                    "user_id": "Chuck Torres",
                    "user_href": "/profile/Chuck-Torres-2"
                },
                {
                    "user_id": "Sohel Shaikh",
                    "user_href": "/profile/Sohel-Shaikh-92"
                },
                {
                    "user_id": "Nossy Drelich",
                    "user_href": "/profile/Nossy-Drelich"
                },
                {
                    "user_id": "Srikar Mogaliraju",
                    "user_href": "/profile/Srikar-Mogaliraju"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Gabriel",
                "href": "/profile/Matthew-Gabriel"
            },
            "answer_text": "Data center is a dedicated space where organizations and companies can keep IT operations in addition to equipment, for the storage, supervision, as well as distribution of data regarding their enterprise. A Data center designed for a cloud service provider as well as supplying substantially distinct services, security requirements over a completely private data center. This would be the server as well as storage equipment that run program and store data. A data center network system is imperative to the continuity of every day operations. With data center we are collecting far more data along with source and it is necessary for organizations in order to successfully store along with manage that data. It will save you your data which includes customer information, intellectual property, and other business-critical data within data center. ",
            "date": "Answered July 15, 2015",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Allen",
                "href": "/profile/James-Allen-12"
            },
            "answer_text": "They are not all cold.  The low temperature used to be the standard, but now more facilities are raising the ambient temperature and improving thermal management in the overall data center design.  This lowers the operating cost significantly and makes it much more comfortable to work in.  It can also allow for lower fan speeds which decreases the noise.  Its surprising how much of the noise comes from the CRAH units.  When utility power is interrupted there is often a lull before the generators kick in when it will get very quiet, then the CRAHs turn back on and the volume goes up again.Some people can't handle the isolation in a data center, but some people like myself enjoy it.  Not being able to see outside does bother me.   One facility I worked in I had access to the security video feeds and would keep a window up on my laptop with a view overlooking the parking lot so I could know what it was like outside.There are really two different types of data centers.  There are the hosting facilities that will be an assortment of different cages with small groups of cabinets or racks.  Then there are the large volume facilities like those operated by Rackspace, Google, Amazon, Facebook, etc... These data centers have hundreds of cabinets in each room, laid out to optimize power and cooling distribution. ",
            "date": "Answered November 12, 2013",
            "views": "87",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sabrina Cerda",
                    "user_href": "/profile/Sabrina-Cerda-4"
                },
                {
                    "user_id": "Gonzalo Casas",
                    "user_href": "/profile/Gonzalo-Casas-5"
                },
                {
                    "user_id": "Nossy Drelich",
                    "user_href": "/profile/Nossy-Drelich"
                },
                {
                    "user_id": "Alex Neville",
                    "user_href": "/profile/Alex-Neville-16"
                },
                {
                    "user_id": "Albaironi M",
                    "user_href": "/profile/Albaironi-M"
                },
                {
                    "user_id": "David Gray",
                    "user_href": "/profile/David-Gray-274"
                },
                {
                    "user_id": "Mohamed Nowier",
                    "user_href": "/profile/Mohamed-Nowier"
                },
                {
                    "user_id": "Jamie Allen",
                    "user_href": "/profile/Jamie-Allen-2"
                },
                {
                    "user_id": "Kevin Whittemore",
                    "user_href": "/profile/Kevin-Whittemore"
                },
                {
                    "user_id": "Mark Hatfield",
                    "user_href": "/profile/Mark-Hatfield-3"
                },
                {
                    "user_id": "George Henry",
                    "user_href": "/profile/George-Henry-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raúl López Nevot",
                "href": "/profile/Raúl-López-Nevot"
            },
            "answer_text": "For me it is not that bad.Working without human touch isn't that alienating. Sometimes is better. Machines don't shout, don't get angry.These noise cancelling headphones can be with some kind of relaxing music. Wearing a jacket is not that bad.I enjoy working on our datacenters, and I wish I could spend more time on them, and less dealing with users and problems.About the good shape for lifting servers, I recommend never to lift them manually, because sooner or later you'll have an accident. There are good tools for that: http://www.serverlift.com/ Good tools and good music, and enjoy the hardware. ",
            "date": "Answered June 21, 2012",
            "views": "91",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sghir Bilel",
                    "user_href": "/profile/Sghir-Bilel"
                },
                {
                    "user_id": "Alex Neville",
                    "user_href": "/profile/Alex-Neville-16"
                },
                {
                    "user_id": "Henry Wang",
                    "user_href": "/profile/Henry-Wang-311"
                },
                {
                    "user_id": "Roman Lutz",
                    "user_href": "/profile/Roman-Lutz"
                },
                {
                    "user_id": "Antonio Castellon",
                    "user_href": "/profile/Antonio-Castellon"
                },
                {
                    "user_id": "Rishabh Sanghvi",
                    "user_href": "/profile/Rishabh-Sanghvi-1"
                },
                {
                    "user_id": "Jack Yong",
                    "user_href": "/profile/Jack-Yong-4"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirill Pertsev",
                "href": "/profile/Kirill-Pertsev"
            },
            "answer_text": "Two biggest issues: NoiseTemperatureYou'll need a pair of good active noise canceling headphones and a jacket. In a busy datacenter the cold row is really cold and the hot row is really hot. Going back and forth between them might be stressful for your health and pretty annoying. It's highly recommended to be physically fit, servers are not designed to be lightweight and lifting them 6-7' from the floor turns out to be a challenge if you don't have a (pretty expensive) \"rack lift\" device.Other than that it's a fun job for anyone who wants to stay close to the metal. ",
            "date": "Answered June 4, 2012",
            "views": "152",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Goswami",
                    "user_href": "/profile/Rahul-Goswami-4"
                },
                {
                    "user_id": "Nossy Drelich",
                    "user_href": "/profile/Nossy-Drelich"
                },
                {
                    "user_id": "Madhavi Pitchika",
                    "user_href": "/profile/Madhavi-Pitchika"
                },
                {
                    "user_id": "Alex Neville",
                    "user_href": "/profile/Alex-Neville-16"
                },
                {
                    "user_id": "Roman Lutz",
                    "user_href": "/profile/Roman-Lutz"
                },
                {
                    "user_id": "TR Karnes",
                    "user_href": "/profile/TR-Karnes"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Peichen Chang",
                    "user_href": "/profile/Peichen-Chang-1"
                },
                {
                    "user_id": "Michael Sinanian",
                    "user_href": "/profile/Michael-Sinanian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dean Martin",
                "href": "/profile/Dean-Martin-35"
            },
            "answer_text": "It has been known that working in a data center offers an enjoyable working experience. Nowadays, people are found to prefer having working experience in data centers, but before working in a data center, people must have to gather enough knowledge that is highly required to work in a data center perfectly. For having any more detailed information, you must consult with the experts, who have adequate knowledge regarding all such aspects. ",
            "date": "Answered September 17, 2016",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Willis",
                "href": "/profile/Paul-Willis-27"
            },
            "answer_text": "To work in a data center, one needs to be highly trained. For the smooth functioning of a data center, the professionals working in there should be skilled, efficient, knowledgeable, and properly trained. Handling the data center operations is a complex task and so, sufficient professional training is necessary. There are many reputable organizations that offer data center training and education to the personnel working in the data centers. Also, those individuals, who want to make a career in data centers, may find these training courses very helpful for their future. For more suggestions on this, you may talk to a data center professional. ",
            "date": "Answered November 14, 2016",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Bulsak",
                "href": "/profile/Joe-Bulsak"
            },
            "answer_text": "Data centers these days are becoming \"dark.\" That means the lights are out and it is unmanned. Today's systems management tools allows you to monitor the performance and health of the hardware and software in the data center remotely. The only time someone needs to physically be in the data center is to install/remove servers/storage.network equipment. So working in a data center is becoming less frequent. ",
            "date": "Answered August 14, 2013",
            "views": "53",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Satish Veeravasarapu",
                    "user_href": "/profile/Satish-Veeravasarapu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaxon Smith",
                "href": "/profile/Jaxon-Smith-2"
            },
            "answer_text": "If you work in a data center, you must be well-aware of all the aspects of a data center perfectly. In fact, people must be cautious about the hot and cold row of a data center so that they can get a protection while working in a data center. In fact, there are some more aspects about which people must be well-informed while working in data centers. For having more about this, people must consider taking the services of the experts, who have adequate knowledge regarding all such aspects. ",
            "date": "Answered February 17, 2017",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sahil Makhija",
                "href": "/profile/Sahil-Makhija-18"
            },
            "answer_text": "Welcome to a Google Datacenter. Take a guided tour of different areas of a Google data center and witness how it feels like to be inside a secret facility. Best experience if you have a VR  Thanks for the visit! ",
            "date": "Answered March 22, 2017",
            "views": "22",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andre Usack",
                    "user_href": "/profile/Andre-Usack"
                },
                {
                    "user_id": "Shreyas Ramchandra Hore",
                    "user_href": "/profile/Shreyas-Ramchandra-Hore"
                },
                {
                    "user_id": "Ashug Arora",
                    "user_href": "/profile/Ashug-Arora"
                },
                {
                    "user_id": "Sahamo Valasia",
                    "user_href": "/profile/Sahamo-Valasia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Gabriel",
                "href": "/profile/Matthew-Gabriel-1"
            },
            "answer_text": "A data server is basically a computer without peripherals like monitors and keyboards. A server operates entirely as a saving location, and is connected to a network to make that data accessible to computers. In the case of an Internet server, the device is connected to the Web, so that any computer with a Web connection can access the files stored on the server. Servers store and process data just like a computer, and are connected to the Internet through wired or wireless connections. ",
            "date": "Answered July 21, 2015",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christian Nygaard",
                "href": "/profile/Christian-Nygaard"
            },
            "answer_text": "Noisy because of all the noise from the equipment cooling fans. Bring ear protection gear. It also rather cold after prolonged hours of work so it's advisable to bring a warm sweater to keep warm. ",
            "date": "Answered September 15, 2014",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yogesh Malik",
                "href": "/profile/Yogesh-Malik"
            },
            "answer_text": "What’s the best approach to building next-generation data center networks? ",
            "date": "Answered February 7, 2015",
            "views": "607",
            "upvotes": "0"
        }
    ]
}