{
    "title": "What was California like in the 1980s and 1990s? - Quora",
    "tags": [
        "1980s",
        "1990s"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dennis Mulgannon",
                "href": "/profile/Dennis-Mulgannon"
            },
            "answer_text": "Smog was not all that bad as we got into the 1990s. I grew up in the Inland Empire. Due to the wind pattern we got all of Los angeles’s SMOG, so our SMOG was twice as bad as their’s. Visibility would be less than a mile during daylight hours, depending upon whether you were flying toward the sun, or had the sun at your back. Generally elevations higher than 2,500 feet were clear, so the mountain communities did not suffer as much. As a flight instructor during the summer months prior to the 1990s, there were a lot of days when visual flights were grounded. When I lived in Palm Springs, there was no SMOG that I recall, but from the airport it was common to see a wall of SMOG just at the end of the Mountain pass through the Beaumont/Banning, California area. Everybody had jobs. It was common to work at one place for your entire adult life up to retirement. It was common for even piddly, menial work places to offer health insurance. A one bedroom apartment would rent for about $150.00 a month. A house payment would be in the neighborhood of $300 to $500 a month. Homes that are now selling for $1-million could be had for about $50-thousand. We did not have to worry about air travel hijacking—not that we worry much about it now, as we recovered from 2001. Airport security began to ramp up after the 1981 Iran Hostage Crisis. But, still a person could roam about on the tarmac to kick the tires of airplanes to their heart’s content. In general, we had more liberties than we do today. There was no shortage of water over all. Yes there was a drought in the mid 1970, but we also discovered El Niño around that time, so we ended up with more water than needed. During the 1980s we had another very short dry spell in some cities, but that did not last. We did not worry about electric power until the Enron Scandal which was not uncovered until 2000/2001. Now we have brownouts and even blackouts in some areas. Our roads and bridges were in good repair, but slowly and surely, road maintenance and expansion products were put off, then put off some more, and money was being borrowed from road tax funds to pay for other things (never paid back, by the way). Homelessness was not the issue it is today. Yes, there were people who were homeless, but these folks were mostly drug addicts, unlike today where we have a large segment of the population who can’t earn enough for rent or credit. Police overall got more respect from media than today. The turning point concerning respect for military and veterans—especially Vietnam Veteran—occurred during the Kuwait Crisis. That is the period of time when it became popular to Thank veterans for their service. I have to say that that was really foreign to me, and I had no clue about how I should act the first few times somebody said that to me. That’s all I can recall for now. ",
            "date": "Answered January 19, 2020",
            "views": "301",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donna Kolodziejski",
                    "user_href": "/profile/Donna-Kolodziejski"
                },
                {
                    "user_id": "Gye Nyame",
                    "user_href": "/profile/Gye-Nyame-9"
                },
                {
                    "user_id": "Nathaniel Smith",
                    "user_href": "/profile/Nathaniel-Smith-51"
                },
                {
                    "user_id": "John James",
                    "user_href": "/profile/John-James-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charley Walker",
                "href": "/profile/Charley-Walker"
            },
            "answer_text": "Which California? Eastern San Diego County, the northern Coast of San Diego County, Ventura County, the crest of the Tehachapi Mountains, Southern Sierra, High Desert,Santa Barbara County, San Luis Obispo County, The Monterey Bay Region, Central Sierra south of Tahoe, the Lake Tahoe region and Mother Lode Country, Northern Sierra, Modoc County, the Northwest Coast, Mendocino County, Sacarmento Valley, Sacramento Delta, east San Francisco Bay region, San Francisco Peninsula, Silicon Valley, Northern San Joaquin Valley, Southern San Joaquin Valley, Imperial Valley, Colorado River Valley, Marin County, Napa County or the Los Angeles Basin, Beverly Hills and Holmby Hills, Malibu/Malibu Canyon and Topanga Canyon? ",
            "date": "Answered January 19, 2020",
            "views": "135",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Philip Rabe",
                "href": "/profile/Philip-Rabe"
            },
            "answer_text": "We used pagers a lot. The smog in the southland was Terrible. I made a lot of money rebuilding after the Loma Prieta earthquake. I got to work for Robin Williams before he died [Bicentennial Man sets]. We had some massive forest fires. The GHW Bush economy produced a large tent city in front of San Francisco’s city hall [just like in the Drumpf economy]. I built scenery for the First Reality TV show, and I am very very sorry! It was something about a houseful of twenty something entitled brats- YAWN. Silicon Valley turned 40. George Lucas spent a lot of time and money on Northern California. NAFTA came along and decimated the N. Cali film business, because jobs for Canada and Mexico? ",
            "date": "Answered January 19, 2020",
            "views": "229",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Russ Dewolf",
                    "user_href": "/profile/Russ-Dewolf"
                },
                {
                    "user_id": "Johnathan Wong",
                    "user_href": "/profile/Johnathan-Wong"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Freeman",
                "href": "/profile/Patrick-Freeman-58"
            },
            "answer_text": "Gas was cheaper. I distinctly remember that the day Desert Storm began gas was selling for 99 cents! We had a lot more freedoms than we do today. There wasn’t a jackass governor like there is today, or the previous one. I was buying ammunition without question. And no one cared if you owned a gun or not, or how many. Basically people minded their own business and didn’t try to force their political opinions down your throat, or attack you for disagreeing with them. Yes, we had illegals back then. But they kept a low profile because they didn’t want to be deported. For the most part they just wanted to work and they were hard workers. They didn’t have this sense of entitlement that they seem to have today. ",
            "date": "Answered January 19, 2020",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Laura Woods",
                "href": "/profile/Laura-Woods-150"
            },
            "answer_text": "1980’s were absolutely glorious in the Bay area as a teenager. So much fun!! No racist cops and the 9 ers ruled the NFL. People did not judge or condem the spirit of adventure or playfulness. Cop callers and rats were basically unheard of and people were glad to help out when in need. There is so much commaradery lost now. ( spelled that wrong or what?) Differences were resolved on the spot, with good ole fist fights, and there was no shooting each other. Differences are not the problem lack of resolution is. Anyways The 80s are sorely missed as far as freedom goes. ",
            "date": "Answered January 20, 2020",
            "views": "135",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Leggett",
                "href": "/profile/Chris-Leggett-11"
            },
            "answer_text": "The smog was much worse in the 80’s. Not so bad in the 90’s. We had more freedom than we have today. We could open carry and ride off road vehicles in the dirt lots and roads without getting hassled to name a couple. ",
            "date": "Answered January 19, 2020",
            "views": "71",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Groce",
                    "user_href": "/profile/James-Groce-4"
                }
            ]
        }
    ]
}