{
    "title": "What is modern web development? - Quora",
    "tags": [
        "Web Developers",
        "Web Development"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Polevoi",
                "href": "/profile/Robert-Polevoi"
            },
            "answer_text": "In my opinion, “modern web development” — driven by the mobile revolution — amounts to attempting to achieve the user experience and business utility expected from native applications, but in the web browser environment. The web browser is itself an application, so you are writing an application within an application, rather than directly on top of the operating system (e.g. Android, iOS in mobile, Windows or macOS or linux in laptop). Writing an application within a browser means writing JavaScript which is the only language for which browsers provide a “runtime environment.” Thus modern web development involves using JavaScript at a level of ambition for which it was not originally intended, but for which it is very rapidly adapting itself. The use of JavaScript “frameworks” such as React and Angular has become standard because these provide so much functionality and context that most developers would be incapable of creating for themselves. Thus, for very many people, “modern web development” means writing web applications within the API’s of JavaScript frameworks, and perhaps using other advanced JavaScript tools (like TypeScript) that also sit “on top of” what is often called “vanilla JavaScript.” This is only the “front end” side of the equation — the application written to be downloaded into the users browser and executed there. But the server side of the equation (‘back end”) is also rapid evolving. It use to be that the browser side app did little more than present an interface, and the server did everything including compose the contents of the page being viewed in every respect. With the rise of what is called the “Single Page Application” (SPA), the server-side simply provides data as requested by the client-side “front-end” application, which takes care of all aspects of the display. The SPA is driven by the need for mobile user to make as minimal and as efficient use of data transactions with the server as possible, and let the “front end” application in the mobile device handle as much of the work as possible. This arose naturally in native mobile apps — that don’t run in the browser — and so the present effort is to duplicate that model as closely as possible with “web apps” running in a mobile browser. The move from native apps (downloaded from a “store” and installed locally) to web apps that require no such installation and can be easily linked to (and thus discovered in search engines) is fundamental, and in my view, irreversible and certain. It’s just a question of web app performance catching up entirely with native app performance. This will happen at warp speed because everything in this business happens at warp speed, which is why it’s so successful. ",
            "date": "Answered July 2, 2017",
            "views": "504",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vikram Dutt",
                    "user_href": "/profile/Vikram-Dutt"
                },
                {
                    "user_id": "Gao Ling",
                    "user_href": "/profile/Gao-Ling-3"
                },
                {
                    "user_id": "Eamon Bohan",
                    "user_href": "/profile/Eamon-Bohan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tommy Byrd",
                "href": "/profile/Tommy-Byrd"
            },
            "answer_text": "The answer to this question can be taken so many different ways depending on the experience and opinions of the respondent, and I’m actually curious to hear other view points, but I’ll try and give you mine. TL;DR, Web development used to be about novel ways to render text to a screen. Now it’s about creating apps and experiences. In the earliest days of web development, web browsers were really only good at doing things like displaying text and images, and providing a system of links to other websites where you could read additional text and see more images. Pretty quickly, digital companies figured out ways to use the web to make money. E-commerce businesses, advertising agencies, and media outlets all had business models based around displaying images and text and getting you to click on enough links that it turned into revenue. Bloggers saw how easy this was and decided to write things down, throw some images and links around their words, and put themselves out there to see if they could build a business doing the same thing. Once web browsers and back-end servers got a little more sophisticated, a web site could do a few more things beyond just displaying images and text. With the invention of social networks, now they could actually connect you to friends, family, and even strangers with a click of a button. While the front-end of these sites were still essentially just rendering text and images, the social graphs being built behind the scenes made the content much more personally interesting. Instead of just reading articles from people who figured out how to setup their own website, you could now find out what’s going on with just about anybody with the wherewithal to write a few words about it. But some truly interesting and ground breaking work is being done with web technology that’s changing the game entirely. Things like WebSockets, WebGL, WebAssembly, and WebVR are making it possible to build web-based applications that rival the functionality and power that previously could’ve only been possible in a native application. I’ve heard many times that Slack is basically “IRC for the web”, and while that’s true, it’s also pretty similar to the brush off from people that said the iPad is “just a big iPod”. There’s something fundamentally different about an application when it’s UI and UX is approachable, even when the functionality is mostly duplicated elsewhere. Since the websites we access in browsers have become much more “app-like” lately, modern web developers are starting to look a lot more like app developers. They need things like build tools, compilers, and unit tests, because the code they write is doing a lot more than just rendering some text and images to a screen. As a language, as Javascript itself matures and is responsible for more than just DOM manipulation (https://www.sitepoint.com/dom-manipulation-vanilla-javascript-no-jquery/), it’s taking on characteristics of languages a native developer might use. Things like asynchronous functions look almost identical in C#, for instance. There’s even a proposal for a pipe operator to support functional programming styles seen typically in languages like Elixir and F#! WebAssembly in particular is quite interesting because of the promise to not have to “throw away” all the amazing work that’s been done in native applications for years. Currently, if you want to build any kind of dynamic application for the web, you have to write the client-side (read: browser) code in Javascript. This has led to all kinds of things like video players, photo editors, and web-based games that were either written directly in Javascript, or compiled to Javascript from another language. The problem with this is that Javascript then is further interpreted by the browser into something the computer can understand. With WebAssembly, we can skip that intermediary step entirely and ship the code the machine understands directly to the browser. So to me, modern web development is about building desktop-class experiences like games, apps, and multimedia experiences that can be shipped directly to the browser over the web. But these experiences can still render text and images really well, too! ",
            "date": "Answered July 2, 2017",
            "views": "716",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erland Flaten",
                    "user_href": "/profile/Erland-Flaten"
                },
                {
                    "user_id": "Vikram Dutt",
                    "user_href": "/profile/Vikram-Dutt"
                },
                {
                    "user_id": "Eamon Bohan",
                    "user_href": "/profile/Eamon-Bohan"
                },
                {
                    "user_id": "Mose Enam",
                    "user_href": "/profile/Mose-Enam"
                }
            ]
        }
    ]
}