{
    "title": "What are the differences between the economies of China and Japan? - Quora",
    "tags": [
        "International Economics and China",
        "China and Japan",
        "International Economics",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glenn Luk",
                "href": "/profile/Glenn-Luk"
            },
            "answer_text": "Before getting into the differences, let me quickly highlight some parallels and similarities between Japan and China. Most notably, Japan and China have relied on export-oriented manufacturing approaches to industrialize (Japan in the early 20th century and China since the 1980s). Even before industrialization, both Japan and China (not to mention South Korea and Taiwan) kicked off their economic development with fairly extensive land reform programs. As I wrote in another answer (Is mainland China following the path of Japan in some ways?): Post-1978 China has followed the same basic development principles and has employed some of the same policy tools as Japan. But I am not as much referring to post-WWII Japan as I am to post-Meiji Restoration Japan during its first agrarian-to-industrialization drive. Remember that Japan had already industrialized by the early 20th century, to the point that it was able to defeat Russia in 1905 and successfully win large swathes of territory in Southeast Asia from the European colonial powers during WWII before finally being defeated by the Greatest Generation. The \"path\" I am referring to is a staged development process with a different set of policies at each stage. The stages are 1) agricultural reform 2) industrialization and 3) post-industrialization and innovation-led development. On a relative or comparative basis, China is roughly around where Japan was in the mid-to-late 1970s [1]. Here is a chart from 2012 that I posted in another related answer (Glenn Luk's answer to Could China hit an economic slump like Japan did? Could China go from being the second-largest economy in the world into a decades-long slump, where they dwindle from economic significance? Why or why not?):  But there are some clear differences as well. These differences are the sort of things that can determine very long-term economic development and help make predictions about where things will be over very long periods of time, e.g. by the middle of this century.  Difference #1: Scale and its various implications First difference is something that is quite obvious: China is big. With a population of nearly 1.4 billion, China is around 11x larger than Japan. Japan’s population is barely 20% higher than a single Chinese province (Guangdong). There are two major implications to the scale difference. 1) While Japan could “export its way to wealth”, China will not be able to solely rely on exporting to the developed world to reach that level. China’s trade surplus with the world, and especially the United States, was already causing major tension by the mid-2000s — and many economists believe that these imbalances played a major role in the 2008 Global Financlal Crisis. From my previous answer: In 1986, Japan's trade surplus peaked at $83 billion. In today's dollars ($180 billion), that averaged out to $1,500 per Japanese person. Those levels prompted severe backlash from its trading partners, especially the United States; this was the era of books/movies like Rising Sun and xenophobic-driven tragedies like the murder of autoworker Vincent Chin (a ethnically Chinese guy who mistaken to be Japanese) by disgruntled autoworkers/thugs. China's trade surplus peaked at $350 billion in 2008 ($280/person in today's dollars). Similar to the 1980s, we were already starting to see severe backlash against this in the years leading up to the 2008-09 Global Financial Crisis (GFC). The scale of China's trade imbalance was having rising and disproportionate effects on things from global interest rates to commodity prices to unemployment rates. It certainly was not the only reason behind the GFC but it was likely one culprit. In any case, the GFC and its resultant economic depression went a long way to prick this imbalance and we have likely seen the its peak. The result was that China realized it could no longer depend on growth in net exports to drive its GDP, and unlike Japan, it hadn't yet become a wealthy country when this happened. But since the GFC, China’s trade surplus has shrunk considerably as a percentage of its GDP. Its current account balance (a proxy) peaked at close to 10% of the economy, today it is a more reasonable 3% (compare this to Germany at 8.4% or Taiwan which typically runs 10%+). 2) China will have to rely primarily on its domestic economy to drive innovation in order to become a fully developed country. Having successfully industrialized following a very similar export-oriented path to Japan, the interesting thing for China now is that in order for it to get to the next level, it has to model itself to become more like the United States which relies on its tremendous consumer market to drive innovation and create wealth. From the same previous answer: Having such a large population means that you will inevitably have the largest home markets for most industries. Unlike Japan, China can utilize this massive domestic market to become the main driver for the economy and innovation going forward. Japan had a decent-sized market, but even then it was less than a third the size of America's. It was good enough to get many industries off the ground but to become truly wealthy, Japan had to figure out how to sell to the rest of the world (which they did very well). From this perspective, China's economy in the future -- if they are successful in executing this current economic transition -- will actually look a lot more like the United States than Japan or South Korea. Notably, the United States is wealthy not because it is a major goods and services exporter generating massive trade surpluses with the rest of the world (quite the opposite). In fact, the United States actually ranks near the bottom amongst large developed economies in Trade as a percentage of GDP [5]. It is wealthy because its consumer economy is the largest in the world by a wide margin, and it has the world's finest entrepreneurs that can leverage this engine to find innovative ways to not only meet this demand but create new demand by coming up with products and services the world has never seen before. This virtuous cycle of consumer demand driving innovation is a powerful flywheel that China is still trying to build in its attempt to emulate the United States. It is still early in this process. Whether it can figure this out over the next two decades will be the most important determinant of whether it can -- like Japan by the early 1980s -- become a wealthy country.  Difference #2: Women in the workplace Another difference with major long-term economic implications is the status and position of women in the economy. Japan has one of the lowest workforce participation rates in the world, with less than half of Japanese women working in the formal economy. Meanwhile, almost two-thirds of Chinese women have formal employment. This compares favorably to developed countries:  After surpassing the United States in per capita GDP in the late 1980s, today Japan’s per capita GDP has stabilized at around 70% of the United States. I think a big part of the difference can be explained by the relatively low position of Japanese women in Japanese society and the economy. It is a major factor holding Japan back from realizing its full economic potential. Say what you will about the huge mistakes made by the Chinese Communist Party in the mid-20th century, but elevating the status of women in society and the economy was surely one of its crowning achievements that will have lasting economic effects.  Difference #3: China is more well-endowed with natural resources than Japan. As a small island country, Japan was simply not blessed with a lot of natural resources. A huge part of its military-led imperialism in the first half of the 20th century was driven by its need and hunger for oil, coal and other natural resources. China is not necessarily the most resource-rich nation in the world (especially relative to its vast population) but it does have decent amounts of oil, coal and other minerals. I remember being surprised to learn that a lot of China’s hard currency in the early years of development came from exports of crude oil (this ended in around 1993). Of course, today China imports huge amounts of oil, iron ore etc. I don’t think the resource difference has huge long-term implications because we (thankfully) no longer live in an era where wealth was based on the accumulation of physical assets and resources. Instead, we increasingly live in an economy where wealth is determined by the productivity of society — made possible mostly by unleashing human potential and its entrepreneurial spirit. That Japan was able to rise and become a wealthy country without much in terms of natural resources is a major testament to this idea.  Note: [1] Saying that “China is probably around where Japan was in the mid-to-late 1970s” does not necessarily mean that absolute quality of life is the same, as there have clearly been improvements in technology that have made life easier for everyone around the world. This is a relative measure. Also, Japan may not be the best comparable because Japan had actually already fully industrialized by the 1930s, only to have to re-build again following World War II. I think re-building as opposed to development from scratch is a wholly different process. From this perspective, better comparative might to think about how China is roughly where South Korea and Taiwan stood in the late 1980s. ",
            "date": "Answered January 24, 2017",
            "views": "74",
            "upvotes": " View 54 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zane Liu",
                    "user_href": "/profile/Zane-Liu-12"
                },
                {
                    "user_id": "Kit Ho",
                    "user_href": "/profile/Kit-Ho-42"
                },
                {
                    "user_id": "Anirudh Ravichandran",
                    "user_href": "/profile/Anirudh-Ravichandran-2"
                },
                {
                    "user_id": "Obaydul Basher Mojumder",
                    "user_href": "/profile/Obaydul-Basher-Mojumder"
                },
                {
                    "user_id": "Chelsey Dunn",
                    "user_href": "/profile/Chelsey-Dunn-2"
                },
                {
                    "user_id": "Jack Lee (李韋傑）",
                    "user_href": "/profile/Jack-Lee-李韋傑"
                },
                {
                    "user_id": "Pippenfancc",
                    "user_href": "/profile/Pippenfancc"
                },
                {
                    "user_id": "Mohd Zulakmal",
                    "user_href": "/profile/Mohd-Zulakmal-1"
                },
                {
                    "user_id": "Makise Kurisu",
                    "user_href": "/profile/Makise-Kurisu-3"
                },
                {
                    "user_id": "Sathya Ramakrish",
                    "user_href": "/profile/Sathya-Ramakrish"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gwydion Madawc Williams",
                "href": "/profile/Gwydion-Madawc-Williams"
            },
            "answer_text": "Japan had a successful modernisation using traditional forms, which failed in China. (See Traditional China Resisted Modernisation and Why China’s ‘Blue Republic’ Achieved Nothing. After World War Two, the USA put enormous resources into making Japan as a success, as part of their anti-Communist strategy. Meantime China after 1949 did quite well in the face of US hostility. (See How Mao Greatly Strengthened China.) China after Mao took what suited it from the West and did not get talked into applying New Right ideas. Japan did and have been stagnating since the 1990s. (As the West has been since 2008.) ",
            "date": "Answered January 22, 2017",
            "views": "2",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Desmond Lee",
                    "user_href": "/profile/Desmond-Lee-15"
                },
                {
                    "user_id": "Paul Poh",
                    "user_href": "/profile/Paul-Poh-5"
                },
                {
                    "user_id": "Shanfa Chaiyadi",
                    "user_href": "/profile/Shanfa-Chaiyadi"
                },
                {
                    "user_id": "Zhuang Yan",
                    "user_href": "/profile/Zhuang-Yan-5"
                },
                {
                    "user_id": "Diwakar Kumar",
                    "user_href": "/profile/Diwakar-Kumar-दिवाकर-कुमार"
                },
                {
                    "user_id": "Max V Lee",
                    "user_href": "/profile/Max-V-Lee"
                },
                {
                    "user_id": "Hongjian",
                    "user_href": "/profile/Hongjian"
                },
                {
                    "user_id": "Johnny Chao",
                    "user_href": "/profile/Johnny-Chao"
                },
                {
                    "user_id": "Xinxin Sun",
                    "user_href": "/profile/Xinxin-Sun"
                },
                {
                    "user_id": "Eugenio Moutelík de Aguiar",
                    "user_href": "/profile/Eugenio-Moutelík-de-Aguiar"
                }
            ]
        }
    ]
}