{
    "title": "What is World Mental Health Day? - Quora",
    "tags": [
        "World Mental Health Day",
        "Mental Health Advocacy",
        "Mental Illness",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Travers",
                "href": "/profile/Nick-Travers-2"
            },
            "answer_text": " I am celebrating World Mental Health Day by looking after myself and by sharing this post: If you feel like you cannot cope, and one in every four of us (you too guys) will feel like this at some point in our lives, do the following: Talk to someone and tell them how you feel - yes, it will be frightening, yes, you will feel exposed/stupid/vulnerable, and yes, they might not understand, but it will help you.Talk to a Doctor, medication can take the ‘edge’ of things and help you cope. If your body stops producing insulin, you suffer from diabetes, and you get medication to replace the missing insulin. So think of your brain as a giant computer, but instead of running on electrical impulses it runs on chemicals and hormones. If, for any reason, your body produces too little or too much of a certain chemical or hormone, your brain will stop functioning properly. You will then suffer from anxiety and/or depression, or bipolar disorder, schizophrenia, or psychosis, or any number of other mental health issues. Taking medication can help restore the balance of chemicals in your brain so it works better.Find ways to cope with your mental health issues. Yes, it may seem like the end of the world, and yes, you may grieve the loss of the old you, but if you have a long term issue you need to develop proactive way to deal with it. If you developed a physical problem, you would adapt your living/lifestyle to cope with it, mental illness is no different, just no so obvious, so others may not cut you the slack you need, which means you have to be proactive:Plenty of exercise and/or fresh air and daylight helps.Actively build up a support network of friends (no they may not be the sort of people you hung out with before, but you may not be the sort of person you were before - seek out people who will be there for you, no matter what).Get plenty of sleep - regular lack of sleep can cause all sorts of physical and mental issues. Your brain may need more sleep than before. If you cannot sleep at night experiment with other sleep patterns: try two sleeps - early night and early morning (which was standard in medieval Europe), sleep late afternoons or mid morning, or a series of shorter naps during the day, or for a couple of hours at lunchtime (like some Japanese offices) - you just have to find something that works and change your life around the new schedule.If possible, reduce stress in your life if you can (if you cannot do so immediately create a longer term plan over a defined timescale).Identify the ‘triggers’ that cause episodes or that cause certain emotional swings (fear/anger/depression/hyper activity/excitement/anxiety) and try to avoid these triggers if possible or plan to mitigate the emotions after (for instance, a long drive, noisy environment, or stressful day will trigger a depression ‘hangover’ the next day, so I try to plan a quiet day afterwards if I know these things are coming along).Contingency plan: If you cannot plan ahead, then make contingency plans for when these your mental health issue ‘kicks in’, e.g.:If I feel hopless, I will phone friend XXXX (be specific who, and agree with them before-hand),If i wake up in a ‘black’ mood, I will go for a run etc,If I feel angry, I will walk away, go for a walk, remove myself from the situation,If I get really stressed/confused I will call for a break/timeout, etc.Finally, Monitor your moods: Even depression has different aspects/flavours and intensities - I might feel distracted, anxious, hopeless, angry, stressed, exhausted or just ‘a blanket blackness’. If you can identify your exact feelings, you have a better chance of managing/mitigating them. Monitor the intensity: Is it a black day, red, amber, or green day? Yes, some days will be better than others. I monitor my moods on a phone app, together with my sleep patterns and exercise. And I use the following colour code: Green = OK, Amber=bad but I can cope on my own, Red=A bad day, when I should use some of my contingency plans, Black=a really bad day - phone in sick, take a duvet day, potter round the house, sleep all day, watch TV - it will pass. Too many black days in a row - book an appointment with my doctor.Look after yourself, Nick ",
            "date": "Answered October 10, 2017",
            "views": "375",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rey Daulay",
                    "user_href": "/profile/Rey-Daulay"
                },
                {
                    "user_id": "Anshuman Das",
                    "user_href": "/profile/Anshuman-Das-55"
                },
                {
                    "user_id": "Hrishikesh Thakuria",
                    "user_href": "/profile/Hrishikesh-Thakuria-1"
                },
                {
                    "user_id": "Sidhi Volvoiker",
                    "user_href": "/profile/Sidhi-Volvoiker"
                },
                {
                    "user_id": "Shashank Gidbidi",
                    "user_href": "/profile/Shashank-Gidbidi"
                },
                {
                    "user_id": "Shruthi Jothsana",
                    "user_href": "/profile/Shruthi-Jothsana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saloni Singhal",
                "href": "/profile/Saloni-Singhal-14"
            },
            "answer_text": " World mental health day is observed on 10th October every year since 1992, with the objective of raising awareness of mental health issues and make mental health care a reality to every citizen. 10 October, comes at a time this year when our daily lives have changed humongously as a result of the COVID-19 pandemic.Thus, the goal of this year’s World Mental Health Day campaign is, ‘increased investment in mental health.‘ Anyone can succumb to Mental health issues. It can be a period or on day-to-day basis. The hardest part is letting go of the moment and the tough times. Ways to invest in your mental health. Mental health is something more than just a diagnosis, don’t stigmatise it. Introspect and overcome. The best way out is always through.Practice affirmations and gratitude journaling on daily basis.Invest in sound physical health, exercise , eat healthy and stay hydrated.Meditate. Stop multitasking and practice mindfulness and awareness.Detox and declutter all the sources of negativity around you.Take a break, break the monotony in life. Surround yourself with optimistic company. Your loved ones are your great assets who will sail you through ups and downs.Self-care is how you take your power back.Ban social media and invest in your hobbies.Listen to motivational speakers and intellectuals like Sadhguru who teach the way of living.Seek professional support and treatmentLive and let live. ",
            "date": "Answered October 10, 2020",
            "views": "212",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Haris Hammad Khan",
                    "user_href": "/profile/Haris-Hammad-Khan"
                },
                {
                    "user_id": "Sargam Singhal",
                    "user_href": "/profile/Sargam-Singhal-1"
                }
            ]
        }
    ]
}