{
    "title": "What led to the invention of the first computer? - Quora",
    "tags": [
        "History of Inventions",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerome Jackson",
                "href": "/profile/Jerome-Jackson-1"
            },
            "answer_text": "“A feeling that there was a better way and maybe a machine could be built to do it.” Just realize that math runs most of society at some level. All businesses do math while doing business as normal. The first “Computers” were people. Rows and rows of people doing the math that was behind the accounting, taxes, census reports and all of the receipts that businesses create in the daily course of doing business. *Below is highly condensed* Charles Babbage proposed the first complete computer in 1837, but it would have been mechanical and was never completed. Then WW2 came out and Germany developed a machine called “Enigma”. Enigma was a coding machine that was used to encrypt messages to their troops. The thing about enigma was that it used a rotating cypher. Most codes are predictable in that if you figure out, for example, what the letter “A” stood for, you were on your way to figuring out the cypher. With enigma however, the letter “A” in one place did not mean that it stood for the same letter in other places. Enigma was well named. If a message to the troops had 26 occurrences of the letter “A” , each occurrence could be a difference letter. How do you code break the message? A man named Alan Turing decided that the only way was to make a machine to do the code breaking. He lead the development of a machine to do the math, it helped win the war. A machine is just something built to do what people do faster. The machine saved time in the breaking of the coded messages. Turing went further, he was a math genius, and developed the science behind what a computer was and what it could do. He developed computer science. In a nut shell, “need” led to the invention of the first electronic computer. The need to do complex math faster than a room full of people could do. No-one could have predicted the changes that creating mechanical computers would add to the world. Maybe a few sci-fi writers and futurists. ",
            "date": "Answered October 6, 2017",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Salami Guadalupa",
                    "user_href": "/profile/Salami-Guadalupa"
                },
                {
                    "user_id": "Deepa Bhandari",
                    "user_href": "/profile/Deepa-Bhandari-7"
                },
                {
                    "user_id": "Noah Townsend",
                    "user_href": "/profile/Noah-Townsend"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael McGuire",
                "href": "/profile/Michael-McGuire-26"
            },
            "answer_text": "If your definition of computer can include any computing assistance device, then the motivating problem was how to count large amounts of money/goods for trade. This would include some absolutely ingenious rope and bead devices (e.g. abacuses). The ancient Chinese and Greeks had some pretty fancy devices that could be considered either computers or precursors of computers for navigation and astrological calculations. In more modern times, you have devices to help with taking national censuses and even more accounting devices (e.g. adding machines). You also have some sophisticated mechanical computers used for artillery and bomb calculations in Word War 2. Professor Richard Feynman worked on some of these prior to his involvement in the Manhattan Project. Most of the first digital computers were used for atomic physics calculations for nuclear weapons research in that same war. ",
            "date": "Answered October 6, 2017",
            "views": "581",
            "upvotes": "0"
        }
    ]
}