{
    "title": "What inspires people? - Quora",
    "tags": [
        "Motivation",
        "Understanding Romantic Relationship Dynamics",
        "Understanding and Maintaining Motivation",
        "Inspiration",
        "Understanding Human Behavior",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Schoultz",
                "href": "/profile/Mike-Schoultz"
            },
            "answer_text": " Those things that touch the heart, Let me elaborate with an inspiring story. This is a story shared by a friend. It always inspires my focus on the right priorities. An American businessman was standing at the pier of a small coastal Mexican village when a small boat with just one fisherman docked. Inside the small boat were several large yellowfin tuna. The American complimented the Mexican on the quality of his fish. Another story: Someone to Understand ... World Is Full of People Who Need This \"How long did it take you to catch them?\" the American asked. \"Only a little while\", the Mexican replied. \"Why don't you stay out longer and catch more fish?\" the American then asked. \"I have enough to support my family's immediate needs\", the Mexican said. \"But\" the American then asked, \"What do you do with the rest of your time?\" The Mexican fisherman said: \"I sleep late, fish a little, play with my children, take a siesta with my wife, Maria, stroll into the village each evening where I sip wine and play guitar with my amigos. I have a full and busy life, senor.\" The American scoffed: \"I am a Harvard MBA and could help you. You should spend more time fishing and with the proceeds, you could buy a bigger boat and, with the proceeds from the bigger boat, you could buy several boats. Eventually, you would have a fleet of fishing boats. Instead of selling your catch to a middleman, you would sell directly to the consumers, eventually opening your own can factory. You would control the product, processing, and distribution. You would need to leave this small coastal fishing village and move to Mexico City, then LA and eventually NYC where you will run your expanding enterprise.\" The Mexican fisherman asked: \"But senor, how long will this all take?\" To which the American replied: \"15-20 years.\" \"But what then, senor?\" The American laughed and said: \"That's the best part. When the time is right, you would announce an IPO - an Initial Public Offering - and sell your company stock to the public and become very rich. You would make millions.\" \"Millions, senor? Then what?\" The American said slowly: \"Then you would retire. Move to a small coastal fishing village where you would sleep late, fish a little, play with your kids, take a siesta with your wife, stroll to the village in the evenings where you could sip wine and play your guitar with your amigos...\" If this video doesn’t inspire you … The Jim Valvano Story ... Raising Funds for Cancer Research Mike Schoultz is a digital marketing and customer service expert. With 48 years of business experience, he consults on and writes about topics to help improve the performance of a small business. Find him on G+, Facebook, Twitter, and linkedIn. ",
            "date": "Answered February 17, 2020",
            "views": "524",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gaurav Singh",
                    "user_href": "/profile/Gaurav-Singh-8483"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frederic Christie",
                "href": "/profile/Frederic-Christie"
            },
            "answer_text": "If you mean what is a trait within certain individuals that leads others to be inspired, there's actually a lot of different traits and strategies. In general, those people who inspire others have some kind of aspect to themselves that others wish to emulate or wish that they had. Dr. King inspired people with moral rectitude and courage. Thomas Paine inspired people with a stirring belief in freedom. Ben Franklin inspired people with his sense of humor, as did Mark Twain and the founder of the Sikhs. Socrates inspired people by being willing to ask tough questions and having a rigorous sense of logic. Martyrs and prophets throughout history have inspired others by their willingness to sacrifice. Generally speaking, leadership theory tends to find that the most successful leaders are people with a force of personality centered on a belief system. But if you are examining what leads a person to be inspired to do work, that belief system is almost definitely the answer. Believing in something greater, being absorbed into and channeling something wonderful... That will inspire yourself and others. ",
            "date": "Answered April 22, 2015",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kris Haamer",
                    "user_href": "/profile/Kris-Haamer"
                }
            ]
        }
    ]
}