{
    "title": "What are the best smart sensors to protect your home? - Quora",
    "tags": [
        "Smart Homes",
        "Wireless Sensor Networks",
        "Smart Home (tech category)",
        "Home Security",
        "Sensors",
        "Internet of Things (IoT)",
        "Security",
        "Homes and Houses",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ifihomes V",
                "href": "/profile/Ifihomes-V"
            },
            "answer_text": "If you're looking for the best smart sensors for your home in 2019, then we've got a hand-picked list for you – demonstrating that you can keep your home safe and secure with some very inexpensive and simple-to-use sensors these days. 1. Window or Door sensor You never know when a break-in may occur, so it's better to be safe rather than sorry. A great way to add protection is with the Door and Window Sensor. It will detect whenever a door or window is opened and will send alerts immediately. 2. Motion sensor The motion sensor detects when there's movement within its range. You can have it set up so that light comes on when you enter a room. It will even turn lights off when you leave or when no motion is detected after a certain period. The light intensity can also be controlled by the time of day. For example, during the day, the light can be set to a crisp white light, and at night, it can be a warm, gentle night light. 3. Leak sensor You never know when a flood will occur in your home, so why not invest in a leak senor? This sensor will notify you when it has detected a leak so you can react immediately, keeping your home and valuables safe. It's quick and easy to set up, and you can easily add more sensors around your home. 4. Video doorbell This cool device allows you to see who is at your door from your smart phone. Whether you are inside alone and want to screen who is at the door, or if you are at work and someone is at your house. You will know. Couple this with the door open/close sensor and thieves will avoid your house and stay away from the trouble of breaking in! 5. Dusk till dawn sensor These are light bulbs with a built-in sensor. They're made to be used outdoors and they automatically turn on when it gets dark and will turn off during the day. Once installed, just set the switch to the on position and it will do its thing. If you're looking for a light that comes on at night and turns itself off in the morning, then this dusk until dawn sensor is what you are looking for. 6. Fire/CO detector Life can be unpredictable. When your home is threatened by smoke, or carbon monoxide, quick action can help limit the impact. A carbon monoxide detector measures levels of CO in the air and will warn people if levels are dangerous, so you can act fast—reducing health risks for loved ones, preserving your home, and saving money from averted damages. Some new sensors not only detect both smoke and CO, but also can monitor the overall air quality in your home and watch for pollutants like dust, soot, pollen, temperature, humidity, air staleness, pollution, and particulates. ",
            "date": "Answered October 15, 2019",
            "views": "67",
            "upvotes": " Answer requested by Farhan Khan"
        },
        {
            "author_info": {
                "name": "Aamod Wagh",
                "href": "/profile/Aamod-Wagh"
            },
            "answer_text": "Best smart sensors are Motion & Sound sensors.. Ideally combined into a single Smart video camera with 1080P HD video, 4X zoom, 110 degree wide angle lens, excellent night vision and 24X7 recording - ALL of which works on your Smartphone. The camera should send you alerts along with a video clip of the incident as soon as the sensors are triggered. This makes sure that you DETER the crime instead of viewing it the next morning (which is what CCTV’s do). Check out TigerEYE from Tigertechlabs.com ",
            "date": "Answered October 31, 2019",
            "views": "21",
            "upvotes": " Answer requested by Farhan Khan"
        }
    ]
}