{
    "title": "What is the best way to learn a language by yourself? - Quora",
    "tags": [
        "Autodidacticism",
        "Self-Teaching",
        "Learning Languages",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steph Koyfman",
                "href": "/profile/Steph-Koyfman"
            },
            "answer_text": "This question is a little misleading because while it sounds like you’re asking whether self-study is possible, language is inherently about dialogue and transmission. So whether you’re learning from a teacher in-person or you’re cracking open a learning app, you’re receiving the acquired knowledge of everyone who has tried to learn and teach the language before you (and thus distilled the grammar and vocabulary into lessons that adhere to proven teaching methods). You can certainly learn a language without formal classes (or even a conversation buddy, though you probably won’t get as far without one). But if you do go the self-study route, you’ll probably be better off thinking of this not as something you’re doing yourself, but something you’re doing with the help of the right experts who created the materials you’re working with. Experts can include textbook authors, the language teachers who developed your app, famous novelists, and movie directors. Though you’ll probably hit a plateau or glass ceiling of proficiency unless you eventually choose to practice your language in real life, here are a few tips for self-study: Don’t neglect your writing and speaking skills. Practice writing short compositions about your day, and when you read, say the words out loud.You’ll need regular review sessions to consolidate the information in your mind. A good teacher will structure their courses to include these, and a good app will test you on the stuff you’ve already learned from time to time. If you don’t have either of these, assume you’ll need to go back over stuff you’ve learned a couple of times at various intervals.A huge part of language learning involves gaining the confidence to speak spontaneously. This is hard to do if you’re not practicing the language with real people, but if that’s not something you can or want to do, rely on yourself for conversation. Talk to yourself! This can involve articulating your inner monologue in your learning language, narrating your actions, or thinking out loud. Another option that’s equally cringe-inducing is speaking to a stuffed animal, imaginary friend or pet (okay, talking to your pet is kind of cute though). Either way, you’re gonna need to find a way to grease those conversational wheels, so you might as well get creative.",
            "date": "Answered February 14, 2020",
            "views": "71",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Devdatt Bhatt",
                    "user_href": "/profile/Devdatt-Bhatt-1"
                },
                {
                    "user_id": "Fika Trouvaille",
                    "user_href": "/profile/Fika-Trouvaille"
                },
                {
                    "user_id": "Carlos Flores",
                    "user_href": "/profile/Carlos-Flores-594"
                },
                {
                    "user_id": "Inaayat Hans",
                    "user_href": "/profile/Inaayat-Hans"
                },
                {
                    "user_id": "Rajiv Sharma",
                    "user_href": "/profile/Rajiv-Sharma-498"
                },
                {
                    "user_id": "Thomas Andre Saldaña",
                    "user_href": "/profile/Thomas-Andre-Saldaña"
                },
                {
                    "user_id": "Francisco Pena",
                    "user_href": "/profile/Francisco-Pena-8"
                },
                {
                    "user_id": "Jamie Malos",
                    "user_href": "/profile/Jamie-Malos"
                },
                {
                    "user_id": "Daniel Middleton",
                    "user_href": "/profile/Daniel-Middleton-64"
                },
                {
                    "user_id": "Ma Jing",
                    "user_href": "/profile/Ma-Jing-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jess Hodges",
                "href": "/profile/Jess-Hodges-7"
            },
            "answer_text": "Teaching yourself a language at home is possible, but it is much more difficult than having a teacher or a class to keep you on track. Not only is motivation an issue, but also it’s difficult to know when you are making mistakes or what to do when you get stuck.There are many courses available online for most languages, but I would approach these with caution. Not only are they expensive, they only get you so far in terms of your language learning. My approach to learning a language on my own is to mimic how a child learns to speak their native language. 1. Start with nouns (names of objects) Get an English to (insert language here) dictionary or use online resources like google translate to learn the names of all of the objects that you use on a daily basis. Start by learning these words, and then as you go about your day to day life every time you look at the object say the word either in your head or out loud.Eventually you will be able to name all the objects without thinking. Also learn the names of objects you see on the TV or hear about on the radio. Continue to grow your vocabulary every day to keep the language alive in your brain. 2. Move onto verbs Find a list of the 100 most common verbs or something similar in your language and start to learn them. It’s also helpful to start learning how to conjugate the verbs (how to use them in the past, present and future tense). Try not to get too bogged down in the grammar, at this point you are trying to learn to speak the language, the rest will come with time. As you are learning the verbs, start to use them in sentences. This will be a slow and frustrating process at first, but stick with it. Language is made to be used, so speak it as much as is possible. 3. Immerse yourself in the language and culture Watch films either in that language and use the English subtitles or watch English movies with subtitles in your chosen language. It’s not the most accurate, but can help you hear the language in a more natural setting. As you become more advanced with your particular language, move on to radio and podcasts from native speakers. It’s so much better to learn a language from native speakers as you will learn more “day to day” language like slang and sayings that makes you sound more natural. 4. Speak, speak and speak again There are many online platforms that allow you to speak to native speakers. Some of them you have to pay for, but there are a few out there that are free. Always be careful on any online platform. Don’t give out personal information to anyone that you don’t know.Even if you just have pretend conversations with yourself. Yes, you will look slightly strange so I don’t recommend doing this in public, but sit down and talk through a normal conversation that you might have every day or pretend you are giving a speech on the culture of the language you are learning or something that you are really interested in. Not only does this allow you to practice the language, it also shows you where there are any gaps in your knowledge to lead you on to your next study goal. 4. Don’t be afraid of making mistakes The biggest cause of people giving up on learning a language or not even starting a language in the first place is fear of looking like an idiot. Think of a child learning to speak their mother tongue, their start with simple words. Then when they progress to sentences, they are very simple and often jumbled. You will follow the same path. That’s OK!!! Making mistakes is how you learn. ",
            "date": "Answered March 12, 2020",
            "views": "2",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devdatt Bhatt",
                    "user_href": "/profile/Devdatt-Bhatt-1"
                },
                {
                    "user_id": "13 CursedMe",
                    "user_href": "/profile/13-CursedMe"
                },
                {
                    "user_id": "Fika Trouvaille",
                    "user_href": "/profile/Fika-Trouvaille"
                },
                {
                    "user_id": "Janine Laura Bronson",
                    "user_href": "/profile/Janine-Laura-Bronson"
                },
                {
                    "user_id": "Selcouth",
                    "user_href": "/profile/Selcouth-13"
                },
                {
                    "user_id": "Jaiden Heath",
                    "user_href": "/profile/Jaiden-Heath-2"
                },
                {
                    "user_id": "Luna Ga",
                    "user_href": "/profile/Luna-Ga-1"
                },
                {
                    "user_id": "Roberth Rojas",
                    "user_href": "/profile/Roberth-Rojas-3"
                },
                {
                    "user_id": "Santosh Jayavel",
                    "user_href": "/profile/Santosh-Jayavel"
                },
                {
                    "user_id": "Cameron Picharny",
                    "user_href": "/profile/Cameron-Picharny"
                }
            ]
        }
    ]
}