{
    "title": "What are the functions of construction technology? - Quora",
    "tags": [
        "Construction Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Gilbertson",
                "href": "/profile/Jack-Gilbertson-3"
            },
            "answer_text": "Here the functions of construction technology is given below and to know more visit this article. When people think about construction, they envision a process that is dominated by physical labor and large machines with the goal of erecting buildings and infrastructure while using very little technology. This vision remains popular as the technology that moves construction is largely unseen. The AEC community, however, has seen amazing changes in the use of technology over the last decade and its greatest innovations are happening now. Today, we are exploring ways of building that have only previously been depicted in science fiction movies and novels. The mobile revolution has enabled our industry to begin making radical changes that parallel the changes automation and robotics brought to the industrial complex in the 70s. Similarly, introducing new tools and techniques to work forces and design teams who are used to operating independently within a highly fragmented industry that specializes in labor and material management will prove to be just as difficult as it was in the 70s.  The shift driving the AEC industry, and this new collaborative approach, started largely with mobile wireless access to information and the dramatic reduction in cost of mobile hardware. The introduction of a 3G iPad can be seen as a major advancement for the industry, as it opened the door for innovation when companies placed a device in the hands of each remote employees’ and connected them to a company server. Cutting Edge Visualization and Real-Time Progress Job sites in the past had been virtual islands unto themselves: dedicated site servers, closed phone systems, fax machines and dependence on paper and in-person meetings. Today’s jobsites are interconnected through cloud-based servers, VOIP networks, and tablets that allow stakeholders to share information and updates instantly. Real-time access to BIM (Building Information Models in 3-6D) that used to require expensive machines can now operate through cloud-based terminals. Design teams can meet through virtual plan rooms, allowing coordination and redesign to happen via mobile devices and to be instantly communicated to all members of the team. When an issue develops in the field, parties no longer have to huddle in a trailer over outdated drawings and specs. Solutions are a finger-swipe away through the cloud-based data storage, providing real-time updates and notifications of revisions to all parties. “Internet of Things (IOT) will drive the future of construction” Design technologies used by aerospace for decades are now being put to use in construction through predictive modeling of engineering designs and circulation through public spaces. Building prefabrication technologies allow rooms, floors, and exterior wall panels to be engineered in warehouses, their progress tracked through RFID and represented in precise locations in building models. This enables materials to be shipped and loaded onto a jobsite exactly when they’re needed, cutting weeks of labor and coordination from the full term of project schedules. Placing this same 3D technology in the hands of the labor force results in better coordination between trade labor and the visualization and early identification of complex or troublesome areas of work. Radio GPS and Bluetooth are now in­troducing robotic automation on job sites. Once a process of laying out areas with tape measure and manual survey equip­ment, robots can now move through a platform performing layouts with greater accuracy and speed. Excavation machines are receiving coordi­nates through GPS that identify distance and depth, guiding operators automati­cally. In the near future, these machines will be controlled through remote opera­tion and automation. Improving the Human Experience Most importantly, advances in technology are providing greater safety for our labor force, as workers are now able to wear devices that show their exact location. This information can be identified by large machines and shown on radar, preventing accidents between machines and workers. The same information is driving real-time labor information to security and project managers, allowing them to visualize who is on a site and where they are working. This RFID and proximity tracking software enables managers to quickly determine when certain areas or tasks are over-staffed and to make adjustments in manpower to accomplish more during the workday. Internet of Things (IOT) will drive the future of construction as we become more adept at building smart devices into the smallest hand tools. We will soon be able to capitalize on real-time analytics that empower construction managers to view production statistics and determine if contractors are working at expected efficiency rates. This will result in a faster completion rates as well as increased quality of work. A Traditional Industry Learns New Tricks There is an adage in construction: Con­struction hasn’t changed much since the times of the pyramids—it’s all about moving workers and materials. As new tech­nologies are implemented, however, the industry is be­ing disrupted and the con­ventional wisdom of what construction is and how it is performed is changing. The next decade will see enormous changes, as the ground break­ing technologies that are introduced to­day become the standards of tomorrow. This is an exciting time for the AEC in­dustry and it is driven through mobile and cloud based technologies. ",
            "date": "Answered April 27, 2018",
            "views": "28",
            "upvotes": " View 75 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mita Patnaik (ମିତା ପଟ୍ଟନାୟକ)",
                    "user_href": "/profile/Mita-Patnaik-ମିତା-ପଟ୍ଟନାୟକ"
                },
                {
                    "user_id": "Trina Baker",
                    "user_href": "/profile/Trina-Baker-11"
                },
                {
                    "user_id": "Andrea Tucker",
                    "user_href": "/profile/Andrea-Tucker-33"
                },
                {
                    "user_id": "Katelyn Faulkner",
                    "user_href": "/profile/Katelyn-Faulkner-1"
                },
                {
                    "user_id": "Shari George",
                    "user_href": "/profile/Shari-George-2"
                },
                {
                    "user_id": "Carla Simmons",
                    "user_href": "/profile/Carla-Simmons-9"
                },
                {
                    "user_id": "Lloyd Hopper",
                    "user_href": "/profile/Lloyd-Hopper-1"
                },
                {
                    "user_id": "Janell Madden",
                    "user_href": "/profile/Janell-Madden-2"
                },
                {
                    "user_id": "Ashok Khajuria",
                    "user_href": "/profile/Ashok-Khajuria-1"
                },
                {
                    "user_id": "Beulah Lawson",
                    "user_href": "/profile/Beulah-Lawson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Syed Murtaza Ali",
                "href": "/profile/Syed-Murtaza-Ali-8"
            },
            "answer_text": "if you like to watch awesome construction machine then you must watch this video and also subscribe this channel for support.  ",
            "date": "Answered May 11, 2020",
            "views": "29",
            "upvotes": "0"
        }
    ]
}