{
    "title": "What is the best wire for wiring? - Quora",
    "tags": [
        "Wiring",
        "Electrical Wiring",
        "Wires",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Owen",
                "href": "/profile/Chris-Owen-53"
            },
            "answer_text": "What is the best wire for wiring? This is like asking what is the best GRASS for my front yard? It depends on what you are wiring. Electrical, Data, Audio, DC lighting? Each gauge dictates the type of load the wire can carry. The larger the number the smaller the cable. You want to make sure that the cable is capable of carrying the expected load and 15% minimum. If it is a POWER circuit you also need to use a fuse or breaker to protect from over load. Do not over load the circuit of fuse. So if your calculated load is 20a then make sure you use a fuse that is rated no more then 25a. I would use a 20 or 18 awg wire in this circuit, 22 seems a bit small. Also try to avoid coils in the wire. This can create a heating loop. I did this once by accident and melted the cable with the current. Reran it with out the “slack loop” and did not have the same issue. ",
            "date": "Answered October 22, 2019",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Fi",
                "href": "/profile/Nick-Fi-2"
            },
            "answer_text": "The best wire for wiring is made out of gold. This is widely used in the electronics industry, inside of the chips. They are very thin and short though. Usually most people can’t afford using gold (or even silver) for wiring, so they settle for something less expensive, such as copper or aluminium. Now, the fact there are thousands of different wires available in the market, it means each has some advantages and disadvantages. If one wants the wire to withstand high temperatures, its insulation has to be made of a different material compared to a wire designed to operate underwater. The thickness of the wire reflects the maximum current it can accept. If it is a single strand or multi-strand will affect its capacity to withstand bending it frequently (such the multi-meter testing probes). Thickness and composition of the insulation material will determine maximum voltage it can carry. ",
            "date": "Answered October 19, 2019",
            "views": "293",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Owen",
                    "user_href": "/profile/Chris-Owen-53"
                }
            ]
        }
    ]
}