{
    "title": "What's the first step in cell phone tracking? - Quora",
    "tags": [
        "Phone Tracker",
        "Tracking (physical)",
        "Cellular Service Providers",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kit Kilgour",
                "href": "/profile/Kit-Kilgour"
            },
            "answer_text": "You haven’t indicated if it is your phone or someone else’s, and whether you plan to do this legally. If you are law enforcement and want to be legal then get the appropriate warrant and contact the appropriate person at the cellular service provider to request the information If it is your phone or you have access to it and it is a smartphone then download a suitable tracking app where you can log in to see the phone location. If it is not your phone and you aren’t concerned about breaking the law then if you know something about the type of phone you can start by getting hold of equipment that appears as a fake cell, together with some associated software and some directional antennae. Transmitting in licensed frequencies is usually an offence. This will enable you to try and get the phone to register with the ‘cell’ occasionally, so you can track it if close. You will probably need a cycle, bike or car to follow the phone. ",
            "date": "Answered January 9, 2017",
            "views": "395",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarvjeet X",
                    "user_href": "/profile/Sarvjeet-X"
                },
                {
                    "user_id": "Yusuf Ismaila Mamza",
                    "user_href": "/profile/Yusuf-Ismaila-Mamza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samantha Sofia Evans",
                "href": "/profile/Samantha-Sofia-Evans"
            },
            "answer_text": "To track cell phone such as your children and employees, you can simply use a cell phone tracking app. This is a very small yet powerful app that can be installed in just a few simple steps. The whole installation process takes only 2-3 minutes to complete. Once installed the app stays hidden on the phone but keeps track of its GPS location. Furthermore it also records call, text messages, social media activity and much more. ",
            "date": "Answered May 28, 2017",
            "views": "158",
            "upvotes": " View Sharers"
        }
    ]
}