{
    "title": "What is the best way to rapid prototype a mobile app? - Quora",
    "tags": [
        "Agile UX",
        "Rapid Application Development (RAD)",
        "Rapid Prototyping",
        "Software Development Methodologies",
        "Prototyping",
        "Software Product Design",
        "User Experience Design",
        "Mobile Application Development Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "Max Ogles",
                "href": "/profile/Max-Ogles"
            },
            "answer_text": "Most people are suggesting some of the tools to do this, which I’ve included here too, but I thought I’d take a stab at outlining the whole process you can use to prototype your app. It seems like a lot of steps, but you could accomplish all of this in 2–3 hours if you really wanted. Decide what you’re testing. Do you want to see how people react to a specific design template? Are you simply validating a need, and not an actual interface? Are you wanting to create an entirely realistic experience so people feel like they’re using the actual app? These questions matter, because they’ll inform what tool you decide to use.Sketch the screens. Do a rough, hand-drawn sketch of the screens. Make it simple. Have a purpose for each screen. Follow the paths from one to the next. You may even want to get feedback at this point from some friends before you even invest time in a design.Do simple design of the screens. One of the best ways to do this is with a tool like Moqups. It’s nothing fancy, but it will allow you to wireframe the design, and actually link together the screens so you can click through and follow paths. At this point, it may be nice to get feedback as well. If you’re testing a feature functionality, this may be all you need—no need to spend time in Sketch or Photoshop making it look pretty. Depending on your goal of the test, this could be a much quicker option than building it out with actual design.Build out the screens in Photoshop or Sketch. I’d suggest still trying to simplify, only doing what is necessary for your testing. You can start with a few screens, then add more later.Import your screens into a prototyping tool. Currently my favorites are InVision and Marvel. Upload the screens, then connect them all by assigning clickable areas, which click the screens will take you to, etc. You can even choose what type of action you’ll use for the clickable area (swipe, pinch, etc.)Recruit Testers. This may the most difficult part! If you’re tired of recruiting users from your Facebook friends, there are two common and easy methods of finding testers: Coffee shops and Craiglist. A) Hang out at coffee shop and buy a cup for anyone that will try your prototype for 10 minutes. B) Place an ad, tell people they can earn $10-$25 if they spend an hour playing with your prototype. This is more advanced and slightly more expensive because to recruit people it needs to be worth their time to reply, meet up with you etc.Decide how to test. There’s a whole science to user testing which you can read about here (User Research Methods) and here (When to Use Which User-Experience Research Methods). Choose 2–3 methods and take notes like crazy.",
            "date": "Answered March 20, 2017",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rebeca Anderson",
                    "user_href": "/profile/Rebeca-Anderson"
                },
                {
                    "user_id": "Ty Shaikh",
                    "user_href": "/profile/Ty-Shaikh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prashanth Padmanabhan",
                "href": "/profile/Prashanth-Padmanabhan"
            },
            "answer_text": "I use Axure to create all my mobile prototypes. It is a regular prototyping tool built for very efficient prototyping. UsabilityAxure made my team so efficient and creative, that we changed the way we design products.  User Interface ElementsIt has standard libraries for mobile devices such as Android, iPhone and iPad. You can find the libraries here. http://www.axure.com/widgetlibraries Standard user interface elements make you very efficient. Since multiple people use the same library, errors in those element surface fast and get addressed fast. Sharing the prototypeAxure creates html code. You can keep the code in your desktop and show it to others. You can also place it in a website and send a link to others. PriceYou can use it for 30 days for free. A single license for a year cost $500. $140 per year after that. SamplesHere are some videos explaining how to prototype iPad apps using Axure http://distributeddevelopment.blogspot.com/search/label/iPad Why do I believe in building a prototype with Axure?I wrote about it here. http://distributeddevelopment.blogspot.com/2011/08/look-and-flow-is-new-look-and-feel.html ",
            "date": "Updated November 11, 2011",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "May BaMaung",
                    "user_href": "/profile/May-BaMaung"
                },
                {
                    "user_id": "Umar Afridi",
                    "user_href": "/profile/Umar-Afridi-1"
                }
            ]
        }
    ]
}