{
    "title": "What is the most energy efficient mode of transportation? - Quora",
    "tags": [
        "Sustainable Travel",
        "Energy Efficiency",
        "Electric Cars",
        "Cycling",
        "Bicycles",
        "Transportation",
        "Sustainable Technology",
        "Public Transportation",
        "Alternative Energy",
        "Trains"
    ],
    "response": [
        {
            "author_info": {
                "name": "João Pimentel Ferreira",
                "href": "/profile/João-Pimentel-Ferreira"
            },
            "answer_text": "When it comes to this subject, there is a lot of confusion around. Let’s try to clarify: The energy efficiency is a physical property of the vehicle or the means of transport, and as such, it has nothing to do with costs nor economics, whether oil is cheap and food is expensive. You, as a walking human and thus a biological propulsion machine, consume a certain amount of calories to walk for a mile, and that amount doesn’t change if the calories from the food were cheap or expensive to obtain. For propelling a vehicle or any means of transport, one needs Energy (measured either in Joules, kilocalories, kWh, BTU, or whatever unit since it is just a matter of conversion). Whether these Joules are expensive, cheap, hard or easy to obtain, it is totally irrelevant for the question. Of course it is very important in economics (externalities for example) and hence public policies, but for the scientific question of fuel efficiency in transport, it is fully and totally irrelevant.Different energy densities for different types of fuel is indeed a fact, but again irrelevant for the scientific question of energy efficiency. No-one says, for instance, that an automobile is more efficient just because it has a bigger fuel tank. Indeed nonetheless, if you can compact more energy per unit of mass, that should improve the energy efficiency, as it is less mass to carry for the same amount of stored energy, and that’s exactly the main reason why in airline industry the tank is not always fully filled before takeoff. But the figures and the data presented by the tests, already take that into account, because they simply measure how much energy was consumed per a certain amount of travelled distance.The costs and energy necessary to build and maintain the infrastructures used for the means of transport, is also a factor to be considered by policy makers, but again it goes beyond the question of fuel efficiency of the means of transport as such. A good example of this paradox is the railway system. An electric train is much more efficient than a diesel one in terms of energy consumed per passenger-distance, or in terms of energy consumed per mass of transported cargo times distance, though diesel trains do not demand an overhead line, and hence the infrastructure is cheaper to install and operate. But if one is strict on this approach, i.e., to consider both the energy demanded by the vehicle and the infrastructure, the most efficient mode of transport is walking because it demands almost no special pathway, as Homo Sapiens has evolved dwelling and moving around on almost every type of environment and ground respectively.Therefore, Energy Consumption in Passenger Transportation, the inverse of Energy Efficiency in Passenger Transportation, is merely Energy for vehicle's locomotion divided by passenger-distance, in SI, Joule/(pax-km) independently of the fuel density, externalities, costs of production of energy, and everything else you want to considerThat said, contrary to the most upvoted answer, the most energy efficient vehicle is not the bicycle but the velomobile, since it is the one that presents the less number of Joules per passenger-distance, whether this energy comes from food, fossil fuels or electricity.  Velomobiles seem to have the highest energy efficiency of any known mode of personal transport because of their small frontal area and aerodynamic shape. At a speed of 50 km/h (31 mph), the velomobile manufacturer WAW claims that only 0.5 kW·h (1.8 MJ) of energy per 100 km is needed to transport the passenger (= 18 J/m). This is around ​1⁄5 (20%) of what is needed to power a standard upright bicycle without aerodynamic cladding at same speed, and ​1⁄50 (2%) of that which is consumed by an average fossil fuel or electric car (the velomobile efficiency corresponds to 4700 miles per US gallon, 2000 km/L, or 0.05 L/100 km). Real energy from food used by human is 4-5 times more. Unfortunately their energy use advantage over bicycles is smaller with decrease of speed and disappear at around 10 km/h where power needed for velomobile and triathlon bike is almost the same. ",
            "date": "Updated March 23, 2019",
            "views": "29",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zoran Petrovic",
                    "user_href": "/profile/Zoran-Petrovic-4"
                },
                {
                    "user_id": "Don Johnson",
                    "user_href": "/profile/Don-Johnson-10"
                },
                {
                    "user_id": "Daphne Jacop",
                    "user_href": "/profile/Daphne-Jacop"
                },
                {
                    "user_id": "Georgia Evans",
                    "user_href": "/profile/Georgia-Evans-90"
                },
                {
                    "user_id": "Cristiano Dal Vi",
                    "user_href": "/profile/Cristiano-Dal-Vi"
                },
                {
                    "user_id": "Anthony Dawkins",
                    "user_href": "/profile/Anthony-Dawkins-12"
                },
                {
                    "user_id": "Flap Drol",
                    "user_href": "/profile/Flap-Drol"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig S. Issod",
                "href": "/profile/Craig-S-Issod"
            },
            "answer_text": "Energy is energy, whether it is human internal process or a gallon of oil. As to the most efficient method of transportation, that would seem to be situational. For instance, a sailing ship could move thousands of tons between countries with no external source of energy - other than the energy to construct the vessel. However, the true measured efficiency might not be high....even though the wind we \"used\" is not taken from anything else. We have to start with the basic abundance of energy. I am not a physicist or a scientist, but it would seem that energy is virtually limitless. This being the case, efficiency in the truest sense does not really come into play. More accurate metrics might be a matter of the pollution or CO2 produced, etc. In terms of moving mass, I don't think it is easy to beat displacement hulls - that is, ships. Whether powered by wind, fuels or pulled by a tram or horse alongside the canal, this is a very efficient method of moving mass.Freight trains are virtually tied with Ocean going transport.http://www.smarterearth.org/content/transportationAirships beat all of them, but are not in common use. No doubt the human body is a very amazing machine - and very frugal in terms of energy use. But it is limited in it's output and endurance. We simply could not produce enough output to keep ourselves fed, clothed, healthy and entertained. Each of us in the western world enjoys an \"energy lifestyle\" which is the equivalent of approx. 200X what we put out on our own, the result of our use of vast quantities of fossil fuels. ",
            "date": "Answered July 21, 2011",
            "views": "29",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thanos Tourtouras",
                    "user_href": "/profile/Thanos-Tourtouras"
                },
                {
                    "user_id": "Kevin Diao",
                    "user_href": "/profile/Kevin-Diao-2"
                },
                {
                    "user_id": "Rusdy Simano",
                    "user_href": "/profile/Rusdy-Simano"
                },
                {
                    "user_id": "Faiza Hasan",
                    "user_href": "/profile/Faiza-Hasan-1"
                },
                {
                    "user_id": "Eddie Truong-Cao",
                    "user_href": "/profile/Eddie-Truong-Cao"
                }
            ]
        }
    ]
}