{
    "title": "What is the latest technological Innovation? - Quora",
    "tags": [
        "New Technologies",
        "Latest Technology",
        "Future of Technology",
        "Innovation",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sibasis Pattanayak",
                "href": "/profile/Sibasis-Pattanayak-2"
            },
            "answer_text": "Engineers Just Built an Impressively Stable Quantum Silicon Chip From Artificial atom★Latest Newly created artificial atoms on a silicon chip could become the new basis for quantum computing. ★Engineers in Australia have found a way to make these artificial atoms more stable, which in turn could produce more consistent quantum bits, or qubits - the basic units of information in a quantum system. ★In a real atom, electrons whizz in three dimensions around a nucleus. These three-dimensional orbits are called electron shells, and elements can have different numbers of electrons. ★Artificial atoms - also known as quantum dots - are nanoscale semiconducting crystals with a space that can trap electrons, and confine their movement in three dimensions, holding them in place with electric fields. ★\"In a real atom, you have a positive charge in the middle, being the nucleus. ★Then the negatively charged electrons are held around it in three-dimensional orbits,\" explained solid state physicist Andre Saraiva of UNSW. ★\"In this case, rather than the positive nucleus, the positive charge comes from the gate electrode which is separated from the silicon by an insulating barrier of silicon oxide, and then the electrons are suspended underneath it, each orbiting around the centre of the quantum dot. ★But rather than forming a sphere, they are arranged flat, in a disc.\" ★Hydrogen(H),lithium(L) and sodium(Na) are elements that can have just one electron in their electron shell. This is the model used for quantum computing. ★When the team creates artificial atoms equivalent to hydrogen, lithium and sodium, they can use that single electron as a qubit, the quantum version of a binary bit. ★However, unlike binary bits, which process information in one of two states (1 or 0), a qubit can be in the state of a 1, a 0, or both simultaneously - a state called superposition - based on their spin states. ★This means they can perform parallel computations, rather than do them consecutively, making them a much more powerful computing demonstrated previously, but the system wasn't perfect. ★\"Up until now, imperfections in silicon devices at the atomic level have disrupted the way qubits behave, leading to unreliable operation and errors,\" said UNSW quantum engineer Ross Leon. ★So, the team turned up the voltage on their gate electrode, which drew in more electrons; these electrons, in turn, mimic heavier atoms, which have multiple electron shells. In the artificial atoms, just as in real atoms, these shells are predictable and well organised. ★\"When the electrons in either a real atom or our artificial atoms form a complete shell, they align their poles in opposite directions so that the total spin of the system is zero, making them useless as a qubit. But when we add one more electron to start a new shell, this extra electron has a spin that can now use as a qubit again. ",
            "date": "Answered February 15, 2020",
            "views": "305",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gargi Dubey",
                    "user_href": "/profile/Gargi-Dubey-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kishor Kanade",
                "href": "/profile/Kishor-Kanade-4"
            },
            "answer_text": "Light Fidelity (Li-Fi) for Wireless Connectivity Li-Fi technology facilitates bidirectional, high speed communication through wireless channel by utilizing visible light spectrum in a closed controlled environment such as hospital, airplane, shopping complex, office, and vehicle among others. It is used to provide communication between electronic devices with the help of visible light communication, or VLC technology. The use of VLC systems can be particularly observed in lighting facilities such as LED bulbs. Need of high speed data transmission, data security, impending RF spectrum crunch, and several technological superiorities over Wi-Fi technology majorly drives the li-fi market. ",
            "date": "Answered June 1, 2020",
            "views": "468",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anirban Das",
                    "user_href": "/profile/Anirban-Das-343"
                },
                {
                    "user_id": "Vishnu Gs",
                    "user_href": "/profile/Vishnu-Gs-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chaitanya Khurana",
                "href": "/profile/Chaitanya-Khurana-5"
            },
            "answer_text": "Qualcomm is a leading mobile chipset maker and the source of many of the cutting edge reforms in mobile technology. It is carrying this trend forward in IoT using specialized solutions for devices. Using a range of snapdragon processors to power IoT devices, they have developed platforms like 2net and Qualcomm HealthyCircles designed especially for the health and medical sector. Other solutions focussed on connectivity include Qualcomm vibe, Qualcomm Gobi, Qualcomm powerline. IoT device manufacturers can integrate these solutions to provide cutting edge products.For more latest techs which are come up in the indusry can be found in the given link.-http://flarrio.com/bridging-the-gap-to-innovation/ ",
            "date": "Updated October 13, 2015",
            "views": "365",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chintan Patel",
                "href": "/profile/Chintan-Patel-107"
            },
            "answer_text": "Google's self driving cars, Are we on the verge of a new revolution in transport? ",
            "date": "Answered July 2, 2015",
            "views": "323",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chauhan Shailesh",
                    "user_href": "/profile/Chauhan-Shailesh"
                },
                {
                    "user_id": "Viral Bhimani",
                    "user_href": "/profile/Viral-Bhimani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ragnesh Malik",
                "href": "/profile/Ragnesh-Malik"
            },
            "answer_text": "There is numerous innovations happening everyday around the globe. Plus the concrete ones do not cross general people So, its hard to make a count of them here,.. you can follow 'Science' section at news.google.com ",
            "date": "Answered October 1, 2014",
            "views": "615",
            "upvotes": " Answer requested by Fahad Anwar"
        }
    ]
}