{
    "title": "What are some easy to learn and demanding technology in IT? - Quora",
    "tags": [
        "Beginning Computer Programming Advice",
        "Information Technology",
        "Learning New Things",
        "Learning to Program"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shreyans Jasoriya",
                "href": "/profile/Shreyans-Jasoriya"
            },
            "answer_text": "Learn Python! Python is easy to use, powerful, and versatile, making it a great choice for beginners and experts alike. Python’s readability makes it a great first programming language — it allows you to think like a programmer and not waste time understanding the mysterious syntax that other programming languages can require. For instance, look at the following code to print “hello world” in Java and Python. Java: public class Main {   public static void main(String[] args) {      System.out.println(\"hello world\");    } } Python: print(‘hello world’) Isn't it awesome? Instead of focusing on how to get your code to even run, you’ll be able to focus on learning actual programming concepts. And once you have those tools under your belt, if you move on to other languages, you’ll be able to easily understand a given piece of code. But don’t think that because Python is easy to use it’s a wimpy language. Python is incredibly powerful — there’s a reason companies like Google, Dropbox, Spotify, and Netflix use it. The Dropbox desktop client is written entirely in Python, which speaks to its cross-platform compatibility. In addition to their desktop client, Dropbox’s server-side code is in Python as well, making it the majority language used at the company. Google uses a mix of languages, with C++, Python, and now Go among them. Early on at Google, there was an engineering decision to use “Python where we can, C++ where we must.” Python was used for parts that required rapid delivery and maintenance. Then, they used C++ for the parts of the software stack where it was important to have very low latency and/or tight control of memory. Like Google, Spotify and Netflix use a mix of languages. Spotify uses Java heavily, but uses Python for things like their Web API and theirInteractive API console, which lets developers explore endpoints with an easy-to-use interface. Spotify also uses Python for data analytics and other non-customer facing processes, such as a DNS server recovery system, their payment system, and their label content management system. Netflix uses a mix of Java, Scala, and Python, and gives developers autonomy when choosing which language fits the problem best. Where do they use Python most? They heavily use Python and iPython in their real-time analytics group. If you take a look at these companies, you can see they benefit from Python for its ease of use and because it’s great for rapid prototyping and iteration. You can also see that Python can be used for a wide variety of applications, and as you learn the basics of Python, you’ll be able to create almost anything you want. Many great developers contribute daily to the Python community by creating Python libraries. These libraries can help you get started so that you don’t have to write code to reinvent the wheel. So for example, if you want to do complex image processing, the Python Imaging Library will help you get started. Want to create games? PyGameis a Python game engine. If data science is your thing, SciPy is the library for you. Source: Why Python? - Code School Blog ",
            "date": "Answered September 6, 2016",
            "views": "52",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Santha Kumar",
                    "user_href": "/profile/Santha-Kumar-287"
                },
                {
                    "user_id": "Mukkera Vamshi",
                    "user_href": "/profile/Mukkera-Vamshi"
                },
                {
                    "user_id": "Bhaskar Singh",
                    "user_href": "/profile/Bhaskar-Singh-15"
                },
                {
                    "user_id": "Ashutosh Singh",
                    "user_href": "/profile/Ashutosh-Singh-696"
                }
            ]
        },
        {
            "author_info": {
                "name": "Surbhi Raj",
                "href": "/profile/Surbhi-Raj-2"
            },
            "answer_text": "IT sector is I would say one of the emerging sectors in the whole world due to its high demand for reasons like connectivity, online business and what not. Trust me, no technology is easy to grasp given the complexity and comprehensive approach adopted in every dimension. According to me, following are the latest technologies on which you can try your hands on since there are Good sources to learn about them: 1.Digital Marketing: Social Media, content writing, website curating, SEO etc. 2.Analytics: Almost all companies are investing heavily on analytics due to increasing competitors, size of Business, etc. 3.Front-end development- HTML, CSS, JAVASCRIPT, they are easy to learn and loads of jobs available in this sector. Hope this helps. ",
            "date": "Answered September 1, 2016",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manjunath Reddy",
                    "user_href": "/profile/Manjunath-Reddy-78"
                }
            ]
        }
    ]
}