{
    "title": "What is the difference between technology and software? - Quora",
    "tags": [
        "Software Technology",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Noskowicz",
                "href": "/profile/Steve-Noskowicz"
            },
            "answer_text": "A2A: I view “technology” as the implementation of what we know from science put into physical devices to accomplish something for us: cars, computers, TVs, radios, rubbers, plastics, synthetics, physical things. There are many ingredients that go into technology. It is a general term for the collection of things that it takes to make it a part of a technology Because one ingredient of computers is the software, I consider software part of technology. Just because a dictionary describes them differently, as Nick Kapatais says, does not mean one is not included in the other. I find that too narrow a view. I cannot exclude Nikos’ IT software from technology; it is some of the most advanced technology we currently have. After all, it is called Information Technology and uses a lot of software, last time i checked… (:-o) The technical description of a amplifier is not the same as the definition of a battery, nor a cell phone and the description, piston, or carburetor is not the same as an automobile, but they all go into some particular implementation of their technology. So software is another part that goes into the technology of a computing unit along with all the gates, packages, circuit boards and displays, yet all those things have different definitions. ",
            "date": "Answered March 4, 2020",
            "views": "803",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rohan Dayanand",
                    "user_href": "/profile/Rohan-Dayanand"
                },
                {
                    "user_id": "Gary Ansorge",
                    "user_href": "/profile/Gary-Ansorge"
                }
            ]
        },
        {
            "author_info": {
                "name": "Onovae Samson",
                "href": "/profile/Onovae-Samson"
            },
            "answer_text": "First, I won’t define what these two terms are because you can find the definition of Google.com. What I will do is try to explain each of these terms so you can spot the difference. Technology. These are things created by humans to solve a particular problem. To explain further, I will say it is simply applying a particular knowledge skillfully to create anything that can make our life better. Everything around you that you can use, and you know it wasn’t naturally like that, then you are looking at a piece of technology. Examples: chair, table, fireplace, etc. Whatever you can think of that serves any purpose, that is technology. Technology is anything created to provide a solution to any physical problem.  Here is an example to create a good picture. Let’s go thousands of years back. A man walking from point A to point B on barefoot. He starts thinking, “the ground is too hot to walk on, and there are a lot of things that can harm my foot.” After much thought, he decided to make a sandal (the first piece of technology). Now, this sandal made the journey a bit more comfortable but he still thinks there is something more. “How can I get to my destination a bit earlier?” After some serious thought and sleepless nights, he finally created a “bicycle.” (the second piece of technology) Now he can get to where he’s going for half the time and still make it back early for dinner with his family. Now this second piece of technology solves the problem of time but creates another, which is energy consumption. The faster he rides, the more energy he consumes. So the question now is, “how can I get to point B faster for more than half the time and with optimum comfort?” After years of thought and work, he develops a car (the third piece of technology). I believe you get the picture. Technology is whatever is created for the purpose of solving a problem is called technology. Now, the process of making these primary technologies to be more efficient and productive is what we can call technological advancements. So, In every aspect of our lives, we need some form of technology or a combination of technology to make life easier. Today, technology has greatly advanced and it will continue in its advancement as long as there is a need. Now, all I explained are physical forms of technology. Today, we have advanced to the era of information technology. This form of technology is created with the need to solve complex problems. It no longer requires physical skills but more mental skills. Technology is how we interact with our physical environment, while information technology is for interaction with our non-physical environment. This is where Softwares comes in to play.  So, what is Software? These are simply a combination of information or data (languages and codes) needed by another physical technology (computer, mobile devices, etc) to create a non-physical tool in other to solve an information-based problem.  ",
            "date": "Answered December 25, 2019",
            "views": "880",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rohan Dayanand",
                    "user_href": "/profile/Rohan-Dayanand"
                },
                {
                    "user_id": "Smita Ninad Kelkar",
                    "user_href": "/profile/Smita-Ninad-Kelkar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Kapatais",
                "href": "/profile/Nick-Kapatais"
            },
            "answer_text": "Definition of Technology from Oxford: “the application of scientific knowledge for practical purposes, especially in industry.” Definition of Software from Oxford: “the programs and other operating information used by a computer.” Two very different things. Technology is the name we’ve given to the application of scientific knowledge which could really be anything. Software refers specifically to programs, (a set of rules expressed in code) used by a computer. A computer, of course does not necessarily refer to your personal computer. Could be your smart TV, that runs on software too, or your car radio. A2A. ",
            "date": "Updated March 4, 2020",
            "views": "15",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Smita Ninad Kelkar",
                    "user_href": "/profile/Smita-Ninad-Kelkar-1"
                },
                {
                    "user_id": "David Belina",
                    "user_href": "/profile/David-Belina-1"
                },
                {
                    "user_id": "Paul Collinsworth",
                    "user_href": "/profile/Paul-Collinsworth-1"
                },
                {
                    "user_id": "Robert Harvey",
                    "user_href": "/profile/Robert-Harvey-41"
                },
                {
                    "user_id": "Ryan Jentzsch",
                    "user_href": "/profile/Ryan-Jentzsch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Danko",
                "href": "/profile/Joseph-Danko"
            },
            "answer_text": "Another answer uses the Oxford dictionary for hard definitions. The difference is not that simple. Software is a form of technology. Philosophically, technology is the intelligent use of tools by humans. This makes technology an evolving characteristic of human development. Software would begin with the written word, an element that makes technology something that can be taught. It is absolutely true that in technology we stand on the shoulders of giants. My prime example of the nexus of technology and software is the combination of the Apple II PC with Visicalc, the first spreadsheet. The result was one of the most useful computer tools available to the general public. ",
            "date": "Answered March 4, 2020",
            "views": "419",
            "upvotes": " Answer requested by Liam Anderson",
            "upvoters": [
                {
                    "user_id": "Jon Harley",
                    "user_href": "/profile/Jon-Harley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Rombouts",
                "href": "/profile/Richard-Rombouts"
            },
            "answer_text": "Software are just programs that might be run on a computer. Technology is far broader than this. It includes electronics, mechanical machines like combustion engines and space rockets, … In the stone age, the technology was how to make state of the art spear points and bows& arrows. So, we have had technology for a long time and this is one of the main characteristics that separates us from other lifeforms here on Earth. There are some species that can use tools, but they are not perfecting them. ",
            "date": "Answered January 27, 2020",
            "views": "248",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Steve Noskowicz",
                    "user_href": "/profile/Steve-Noskowicz"
                },
                {
                    "user_id": "Doug Wilson",
                    "user_href": "/profile/Doug-Wilson-20"
                },
                {
                    "user_id": "Ryan Jentzsch",
                    "user_href": "/profile/Ryan-Jentzsch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishal Oza",
                "href": "/profile/Vishal-Oza-4"
            },
            "answer_text": "While the term are software and technology are related, they are not the same thing. Software is a subset technology. Software only goes as far back as Charles Babbage’s Analytical Engine although this was still an abstract. Any real usage of software was during the first computers during the 1940s. Technology goes as far back as the dawn of human civilization or further with the first tool usage and the domestication of plant and animals. ",
            "date": "Answered November 10, 2019",
            "views": "397",
            "upvotes": " Answer requested by Liam Anderson",
            "upvoters": [
                {
                    "user_id": "Fahad Maqsood Qazi",
                    "user_href": "/profile/Fahad-Maqsood-Qazi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rich Cohen",
                "href": "/profile/Rich-Cohen-13"
            },
            "answer_text": "This is my take on things and, although I live and work in both arenas, I’m far from an expert. To me technology is the ability to make and use useful things. Technologies often overlap and some may be a subset of another. We speak of steelmaking technology, there is automotive technology and medical technology. Blacksmithing is a technology. So is computers. The list goes on. Software is a product of some technologies. Which ones depends on the kind of software. Software is best produced by people who have mastered the underlying technology(ies). Software is also something used by many other technologies to make things. ",
            "date": "Answered August 18, 2019",
            "views": "398",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jude Bennett",
                    "user_href": "/profile/Jude-Bennett-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Figlik",
                "href": "/profile/Jim-Figlik-2"
            },
            "answer_text": "What is the difference between technology and software? Technology is a type of tool, typically electronic, we use to implement tools to communicate and live, from cook to move even to sleep. Software is a set of instructions for a silicon, or some other, processing machine. ",
            "date": "Answered March 14, 2020",
            "views": "274",
            "upvotes": " Answer requested by Liam Anderson",
            "upvoters": [
                {
                    "user_id": "P Douglas",
                    "user_href": "/profile/P-Douglas-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohamed Samir",
                "href": "/profile/Mohamed-Samir-368"
            },
            "answer_text": "Technology is the application of scientific knowledge in practical way to have products that serve us. Software is a set of algorthims in form of code that to be run on computers, machines, mobiles... Etc to serve certain need such as math calculations, image & voice processing, play game.. etc. A software is a part of technology (subset) wheras technology includes many other things. ",
            "date": "Answered January 2, 2020",
            "views": "217",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Jagjit Singh",
                "href": "/profile/Jagjit-Singh"
            },
            "answer_text": "From Google search: What is the difference between a tech company and a software company? ... Essentially a tech company creates a platform/framework that other companies can use to create their software or hardware tools. Software houses: produce software that utilizes existing and implement new technologies to produce software applications. ",
            "date": "Answered February 8, 2020",
            "views": "225",
            "upvotes": " Answer requested by Liam Anderson"
        },
        {
            "author_info": {
                "name": "Sarah Taylor",
                "href": "/profile/Sarah-Taylor-1221"
            },
            "answer_text": "Technology refers to all science, knowledge and techniques that are put into practical use to solve problems, invent tools or process actions. Software is a type of program that allows a user to carry out a specific task or process using a computer or other technological device. Simply put, software is a form of technology. ",
            "date": "Answered November 20, 2019",
            "views": "221",
            "upvotes": " Answer requested by Liam Anderson"
        },
        {
            "author_info": {
                "name": "Matthew Butler",
                "href": "/profile/Matthew-Butler-113"
            },
            "answer_text": "Technology entails and anything everything developed using science (and that doesn’t mean formal science using the scientific method). Software is solely computer based and entails everything you can’t physically touch in a computer. What you see on that monitor is all software, anything you click is software. ",
            "date": "Answered February 8, 2020",
            "views": "76",
            "upvotes": " Answer requested by Liam Anderson"
        },
        {
            "author_info": {
                "name": "Paul Collinsworth",
                "href": "/profile/Paul-Collinsworth-1"
            },
            "answer_text": "Technology encompasses a manifold of physical things and processes, of which software is one component among many. The platforms on which software runs, from the smallest single-bit micro-controller to the largest mainframe systems to the cloud are themselves only one component in technology. ",
            "date": "Answered January 9, 2020",
            "views": "142",
            "upvotes": " Answer requested by Liam Anderson"
        },
        {
            "author_info": {
                "name": "Terry Newton",
                "href": "/profile/Terry-Newton-14"
            },
            "answer_text": "Technology applies to a wide range of applied science. This includes mechanical, electrical, electronic,thermodynamics, and materials. Software is how you make these things work when there are user controlled configurations. ",
            "date": "Answered February 8, 2020",
            "views": "143",
            "upvotes": " Answer requested by Liam Anderson"
        },
        {
            "author_info": {
                "name": "William Hembree",
                "href": "/profile/William-Hembree-3"
            },
            "answer_text": "Software is simply one category of technology. One out of a very great many categories. A2A: “What is the difference between technology and software?” ",
            "date": "Answered March 25, 2020",
            "views": "122",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Randall Scott",
                "href": "/profile/Randall-Scott-17"
            },
            "answer_text": "Some similarities and some differences. The main difference is they are 2 different words, spelled differently. In concept generalities, the possibilities are almost infinite. ",
            "date": "Answered December 7, 2019",
            "views": "248",
            "upvotes": " Answer requested by Liam Anderson"
        },
        {
            "author_info": {
                "name": "Peter Bergman",
                "href": "/profile/Peter-Bergman-9"
            },
            "answer_text": "Software, the #2 pencil and a flint weapons-point are all ‘’Technology’’. Just as bass, perch and shark are all fish. The reverse however, is not true. ",
            "date": "Answered December 11, 2019",
            "views": "80",
            "upvotes": " Answer requested by Liam Anderson"
        },
        {
            "author_info": {
                "name": "Mark Clark",
                "href": "/profile/Mark-Clark-167"
            },
            "answer_text": " ",
            "date": "Answered December 11, 2019",
            "views": "206",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "David Holt",
                "href": "/profile/David-Holt-126"
            },
            "answer_text": "Technology can be anything science chemistry, physics etc. Software only refers to computers ",
            "date": "Answered January 27, 2020",
            "views": "76",
            "upvotes": " Answer requested by Liam Anderson"
        }
    ]
}