{
    "title": "What technological tools are used in space exploration? - Quora",
    "tags": [
        "Space Travel",
        "Space Exploration"
    ],
    "response": [
        {
            "author_info": {
                "name": "Srihan Anand",
                "href": "/profile/Srihan-Anand"
            },
            "answer_text": "We know that without technology, none of this space exploration would be possible. Here are some technological tools that astronomers use. Telescopes:In my opinion, telescopes were the second instruments used to explore outer space. Second to our eyes. There are many telescopes used for space exploration such as Optical telescopes which are used to view objects such as our moon and stars. Radio telescopes which collect faint radio waves coming from objects in space. Infrared telescopes create images from infrared waves. Ultraviolet telescopes which are mostly used to study stars like our sun which produce a large amount of ultraviolet waves.  [Image of the Hubble-Space telescope] 2. Pistol- Grip Tools: This tool is used to repair the Hubble- Space telescope which is one of the most powerful telescopes in the world. Many of our knowledge about space comes from pictures that this amazing telescope takes. 3. Cameras: Another invaluable instrument in space exploration is cameras. They are used to take high resolution images of the surface and surroundings of cosmic bodies. Navigation cameras and hazard cameras help control stations on Earth guide robots across the surface of the planets. Microscopic imagers are specifically designed to take pictures of soil and rocks with very high precision to advance the study of planetary geology.  [Astronaut takes a picture with a space camera] 4. Robots: One of the greatest challenges of space exploration is the unfriendly environmental conditions, which make human exploration practically impossible in most planetary environments. Scientists overcome this obstacle by developing different types of space robots. There are different types of space robots like flybys, rovers, robotic arms, humanoids and orbiters. Like the other instruments used in outer space, the use of multipurpose robots in space exploration is also gaining momentum. ",
            "date": "Answered May 27, 2017",
            "views": "26",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anthony Kerstein",
                    "user_href": "/profile/Anthony-Kerstein"
                },
                {
                    "user_id": "Kyle Hughes",
                    "user_href": "/profile/Kyle-Hughes-121"
                },
                {
                    "user_id": "Viji Anand",
                    "user_href": "/profile/Viji-Anand-9"
                },
                {
                    "user_id": "Rita Brokhman",
                    "user_href": "/profile/Rita-Brokhman"
                },
                {
                    "user_id": "Grant Maiorana",
                    "user_href": "/profile/Grant-Maiorana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darren Marchant",
                "href": "/profile/Darren-Marchant-1"
            },
            "answer_text": "thank you for that excellent question! :) if we follow every supply chain that is directly needed for current space exploration; virtually every industry and technology contributes to the endeavor to explore the space environment. the most important factor in space exploration is not technology. the most important factor in space exploration is humanities will to explore. In the late 60’s & early 70’s humanity saw a brief glimpse of what was waiting for us in the Solar environment, then we backed off of human exploration to concentrate on a token human foothold on orbit while sending probes into space & satellites into orbit. the most important tools for future space exploration & management do not exist yet. for that humanity will have to regain the will to risk life and limb to leave the Earth & develop a whole new supply chain from Lunar soil to every product needed by millions of humans leaving Earth for a permanent future in deep space management; or we can hide in our homes shivering in fear while we run out of toilet paper. DTM ",
            "date": "Answered May 16, 2020",
            "views": "119",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Costanzo",
                    "user_href": "/profile/Mark-Costanzo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriel Balensiefer",
                "href": "/profile/Gabriel-Balensiefer-1"
            },
            "answer_text": "Jesus Christ, this is a vague and broad question. Every tech is used, except for cosmetic (read: facial make-up) tech and other relatively useless tech. Electrical, medical, biological, physics, chemistry, optical, quantum, electromagnetic, nuclear, manufacturing, robotics, sewing, ceramics, metallurgy, plastics, statistics, psychology, pharmaceutical, and many more “technologies” are “used” in space exploration. Even origami is used in space exploration! You may as well as which tech is not used in space exploration. ",
            "date": "Answered May 17, 2018",
            "views": "836",
            "upvotes": "0"
        }
    ]
}