{
    "title": "What are some new technologies in power transmission? - Quora",
    "tags": [
        "Power Transmission",
        "New Technologies",
        "Automatic Transmissions",
        "Transmissions (drivetrains)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arijit",
                "href": "/profile/Arijit-18"
            },
            "answer_text": "human being is a kind, always looking for better to live & to be serviced as well.. yes, they’ve introduced a grid then smart grid system regrading modern transmission, incorporation of Automation (SCADA, PLC), HVDC to avoid the losses respect to AC transmission, Power line Carrier communication to avoid frequency hazard & to sustain economy, distributed series reactors / continuously variable series reactors, introduction of fiber optics technology, uses of IGBT drivers instead of GTO one, privileged Modular FACTS controllers & many more… even if you notice, you’ll see the modern transmission towers are steel lattice tower to ensure more reliability & stability, carry more strength even after considerable sag, atmospheric changes & calamities…  even today may be a chance to be discovered something new & get applied to the system… :) Thanks! ",
            "date": "Answered February 28, 2017",
            "views": "999",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhananjay Singh",
                    "user_href": "/profile/Dhananjay-Singh-355"
                },
                {
                    "user_id": "Alfred Doyle",
                    "user_href": "/profile/Alfred-Doyle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Hogeveen Rutter",
                "href": "/profile/Alexander-Hogeveen-Rutter"
            },
            "answer_text": "Voltage-source converters for HVDC. This will allow multi-terminal HVDC, improved harmonic performance and less dependence on synchronous machines in the AC system. Currently only used for low and mid-range voltages, but is gradually gaining acceptance at higher voltages Ultra High Voltage: In both AC and DC, voltages are now reaching the MV range-requiring brand new line designs, insulators, protection, etc. High-temperature, low sag conductors, such as ACCC (composite core). There are a number of different technologies, but typically there is a trade-off of higher capital cost for improved performance (eg. lower losses and/or higher thermal transfer capability). ",
            "date": "Answered February 26, 2017",
            "views": "679",
            "upvotes": " Answer requested by Raghu Kittu"
        }
    ]
}