{
    "title": "What is your opinion about the Poco X3? - Quora",
    "tags": [
        "Xiaomi Mobile Phones",
        "Android Devices",
        "Mobile Technology",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thanmay Thyagaraju",
                "href": "/profile/Thanmay-Thyagaraju"
            },
            "answer_text": "The Poco X3 offers a FHD+ IPS LCD 120hz display with 240hz touch sampling. No other phone in this price range offers a display with 240hz touch sampling so this device would be pretty good for gaming. The Poco X3 also has a Snapdragon 732g which is just an overclocked version of the Snapdragon 730g in the Poco X2 but is still an upgrade. There is also a massive 6000mah battery powering the phone with 33W charging support (charger included in box) so this phone can easily last a day on moderate usage. The phone also has a 6.67inch display and weighs 225g which makes it very hard to use with one hand. The phone is also 10.1 mm thick. Coming to the cameras the Poco X3 features a 64MP Sony IMX 682 along with a 13MP ultrawide and a 2MP depth and macro sensor. The phone also has an IP 53 rating which gives the phone some resistance against water. The Poco X3 starts at 16999 onwards. According to me this is one of the best phones under 20000. ",
            "date": "Answered September 28, 2020",
            "views": "500",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ravi Kumar Sharma",
                    "user_href": "/profile/Ravi-Kumar-Sharma-114"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pratyay Das Sarma",
                "href": "/profile/Pratyay-Das-Sarma"
            },
            "answer_text": "Hypothetically speaking… No! I have been using Android for a long long time but nowadays it seems that privacy’s has taken a back seat and I just wish that Google should have controlled it better. A lot of OEM’s are literally exploiting the openness of Android and just making a complete mockery of the users privacy! Especially these Chinese brands, they are simply using their phones to make the users a target for unnecessary ads to gain profit. Which is not acceptable to me! I mean in Android certain apps can view my clipboard data and with that can literally guess my passwords! So, No I’m not interested in compromising my privacy for anything Poco has to offer.. Sorry! ",
            "date": "Answered August 26, 2020",
            "views": "230",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ravi Kumar Sharma",
                    "user_href": "/profile/Ravi-Kumar-Sharma-114"
                }
            ]
        }
    ]
}