{
    "title": "What did people 50 years ago expect 2020 to be like? - Quora",
    "tags": [
        "2020s",
        "Future Scenarios",
        "2020 (year)",
        "The Human Race and Condition",
        "Technology",
        "History",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "James McDonald",
                "href": "/profile/James-McDonald-87"
            },
            "answer_text": "Many assumed we would have colonies on the moon and Mars by now. That’s maybe the biggest surprise of something not happening. The internet was just barely starting, so everything related to that (e.g. smart phones) was only very dimly perceived. We assumed there would be better communications, but no one had social media on their radar. Search engines were conceived of more as oracles to answer technical questions than as business tools. When I tried to convince my mother that everyone would have a computer in their house I struggled to convey to her what they would be used for. When I described how the internet might work for communications a friend of mine was horrified at the idea of people sitting isolated at home and not interacting in person. We assumed cars would get more efficient and far safer and less polluting. Some of us thought most would be electric by now. There was also a general hope/consensus that poverty and various other social ills would be reduced, a trend that generally bore out, if imperfectly. I never explicitly thought about gays getting married, for example, but if asked back then if it would be legal by 2020 I probably would have said of course. I assumed that racism and xenophobia would be reduced far more than they have, but would still exist. I assumed that grinding poverty, people starving to death, would be largely non-existent by now. I can’t speak for others, but I was relatively sure the USSR would have collapsed by now (actually before 2000), but assumed it would be an extremely violent process. I gave a talk in high school in the late 60’s about the ethical issues related to genetic engineering, so that was definitely in view. Beyond that I think there was just generally a hope/assumption that there would be many fundamental changes due to substantial scientific progress (most good, but some perhaps dystopic), and many social changes would happen to reduce social inequities. I rather thought that green roofs would be more of a thing. No one really expected flying cars. ",
            "date": "Answered October 21, 2020",
            "views": "1",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nick Trierweiler",
                    "user_href": "/profile/Nick-Trierweiler-1"
                },
                {
                    "user_id": "Mark Wills",
                    "user_href": "/profile/Mark-Wills-75"
                },
                {
                    "user_id": "Schmerel Goldwyn",
                    "user_href": "/profile/Schmerel-Goldwyn"
                },
                {
                    "user_id": "Chuck Fimmen",
                    "user_href": "/profile/Chuck-Fimmen-1"
                },
                {
                    "user_id": "Michael Kavanagh",
                    "user_href": "/profile/Michael-Kavanagh-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Redford",
                "href": "/profile/John-Redford"
            },
            "answer_text": "The most serious attempt at long-range forecasting in the 1970s was done by the Club of Rome in their book The Limits to Growth (1972). This took the rates of consumption of non-renewable resources along with their growth rates, and applied them to an economic model of the world defined as a set of differential equations. The whole was run forwards on computer models to see when (not if!) crises would happen. On pages 23–24 they summarized their conclusions like so: After reviewing their computer simulations, the research team came to the following conclusions: Given business as usual, i.e., no changes to historical growth trends, the limits to growth on earth would become evident by 2072, leading to \"sudden and uncontrollable decline in both population and industrial capacity\". This includes the following: Global Industrial output per capita reaches a peak around 2008, followed by a rapid decline Global Food per capita reaches a peak around 2020, followed by a rapid decline Global Services per capita reaches a peak around 2020, followed by a rapid decline Global population reaches a peak in 2030, followed by a rapid declineGrowth trends existing in 1972 could be altered so that sustainable ecological and economic stability could be achieved.The sooner the world's people start striving for the second outcome above, the better the chance of achieving it.Market-crazed economists hated this whole project, and criticized it relentlessly. Quite rightly too, since the LoG forecasts have not come true in the time frames they said. Prediction is hard, especially about the future, as both Niels Bohr and Yogi Berra said. Nevertheless, environmental degradation is a real problem that markets have never dealt with well. The biggest present case of this is climate change, which the Club of Rome couldn’t even foresee. The basic idea that we should try to see future crises long enough ahead of time to do something about them is completely sound, and hard to do. ",
            "date": "Answered October 22, 2020",
            "views": "151",
            "upvotes": "0"
        }
    ]
}