{
    "title": "What kinds of things can I sell on Etsy? - Quora",
    "tags": [
        "Selling on Etsy",
        "Handmade Products",
        "Etsy (product)",
        "E-Commerce Sales",
        "Online Selling",
        "eBay (product)",
        "Buying and Selling",
        "Sales",
        "E-Commerce"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandra Hayes",
                "href": "/profile/Sandra-Hayes-65"
            },
            "answer_text": "Etsy limits its sellers to a relatively small range of items, though that range is broad enough to appeal to millions of users. Shop owners who offer prohibited items risk removal of their listings or having their Etsy shops closed.  Here is what Etsy allows people to sell: Handmade Items. Etsy shop owners are allowed to sell handmade goods such as jewelry, fine art, clothing, leather goods, and similar products. As long as your item begins with your “imagination and creativity,” you can sell it on Etsy. Note, the handmade requirement doesn’t mean that you must personally make every part of your product. You can incorporate elements that are not handmade and can have help from others. In fact, you can even have your items manufactured by others.Craft Supplies. If you make or sell the raw materials that people need to make their creations, you can also sell those on Etsy. You cannot sell commercially produced items that are “ready for use,” but you can sell ingredients, materials, or tools that someone needs to make a finished product. For example, you can sell tools that bookbinders might use to craft handmade books, but you cannot sell mass-produced paperback books that have been made by a publisher unless the books qualify as “vintage.”Vintage Goods. Etsy allows you to sell manufactured or ready-to-use items, but only if those items are vintage. Etsy defines a vintage item as anything that is 20 or more years old. Vintage items can include almost anything, such as clothing, office supply products, and computer games. Vintage items do not have to be handmade, nor do they have to be functional, but they must be at least 20 years old at the time the seller lists them.Learn more about what can be sold on Etsy here. Hope this helps,Sandra ",
            "date": "Updated January 26, 2020",
            "views": "202",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Håkon Lilleberg",
                    "user_href": "/profile/Håkon-Lilleberg"
                },
                {
                    "user_id": "James Davis",
                    "user_href": "/profile/James-Davis-1572"
                },
                {
                    "user_id": "Lidia Kent",
                    "user_href": "/profile/Lidia-Kent"
                },
                {
                    "user_id": "Olivia Miller",
                    "user_href": "/profile/Olivia-Miller-346"
                }
            ]
        },
        {
            "author_info": {
                "name": "Conrad Raphael Maleta'",
                "href": "/profile/Conrad-Raphael-Maleta"
            },
            "answer_text": "you can sell “handmade” items created by you. Jewelry, Clothes, Home decor, Cards, art, ceramics….. long etc. you can sell vintage items made 25 years ago or more, any item older than that… you can sell digital files that buyers download and print themselves… there are many things you can sell due legal issues and copyrights. A Multicultural, Young, Hip and Modern Vintage Shop by boboCOLLECTED Feel welcome! ",
            "date": "Answered March 26, 2019",
            "views": "39",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Brock Hamilton",
                    "user_href": "/profile/Brock-Hamilton"
                }
            ]
        }
    ]
}