{
    "title": "What will change our lives the most in the next 10 years? - Quora",
    "tags": [
        "Technology Change",
        "Change and Changing",
        "Future Scenarios",
        "Trends",
        "Technology Trends",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Kyle Varley",
                "href": "/profile/John-Kyle-Varley"
            },
            "answer_text": "I’ve been banking on a shift in the way we consume media. It really depends on how VR/AR technology improves, but it’s likely the case that we will see digital environments blend with the real world. This has already happened in prototype, and the potential benefits can’t be overstated. Developers have worked for 50 years on creating complex digital systems that mimic elements of reality. Your average big-budget video game now includes systems that simulate the laws of motion, positional audio, intelligence, machinery, weather, animals, etc. These digital environments are now incredibly convincing to our senses, and because of a confluence of technologies and economics, those worlds are going to pop out of our televisions screens and into the physical world. We got a tiny taste of this type of thing with the Pokemon Go craze. Small animals appeared on our sidewalks and parks, and people were obsessed with it. We were all carrying around these rudimentary AR sets in the form of smartphones, which allowed developers to expand the digital world out into the “real” one. That same sort of phenomenon is possible with much broader implications. Of course, films and games are already popping out of our TV sets in the form of AR and VR, but that will move into places like the classroom, and the shopping mall, and the gym. As these digital environments paint our real-life environment, new forms of media and narrative experience will begin to explode. Right now the technology is ungainly and expensive, but it will hit a tipping point eventually. If that happens in the next 10 years, which is plausible, a “movie”, or a “game” will be very different things. People already spend a massive amount of time on entertainment media. It’s probably the single most common activity across the entire human race. If that pops out of the TV and wraps around us in 3D space, we’re in for a wild ride. ",
            "date": "Answered December 25, 2019",
            "views": "83",
            "upvotes": "0"
        }
    ]
}