{
    "title": "What is the difference between the Fourth Industrial Revolution and industry 4.0? - Quora",
    "tags": [
        "Fourth Industrial Revolution",
        "Industrial Revolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anil Choudhary",
                "href": "/profile/Anil-Choudhary-24"
            },
            "answer_text": "The term fourth industrial revolution and industry 4.0 look similar on the surface but have disparate origins. Fourth Industrial Revolution The phrase “Fourth Industrial Revolution” was first introduced by Klaus Schwab (Executive Chairman of World Economic Forum) in 2015 in an article in Foreign Affairs: The Fourth Industrial Revolution The term represents the fourth major industrial era since the initial Industrial Revolution of the 18th century. And it is characterized by a fusion of technologies that is blurring the lines between the physical, digital and biological spheres. There is a staggering confluence of emerging technology breakthroughs such as robotics, artificial intelligence, nanotechnology, quantum computing, biotechnology, materials science, energy storage, the Internet of Things, the Industrial Internet of Things (IIoT), decentralized consensus, fifth-generation wireless technologies (5G), additive manufacturing / 3D printing and fully autonomous vehicles. Klaus Schwab, in his book titled “The Fourth Industrial Revolution”, has described in depth about how this revolution is fundamentally different from the previous three revolutions. Since 2016, mastering the Fourth Industrial Revolution has been a consistent theme at the World Economic Forum's annual meeting held in Davos, Switzerland. The convergence of the physical, digital and biological worlds is at the heart of the fourth industrial revolution. Some of the subjects that fall under each of the domains are as below: Physical - Autonomous Vehicles, 3D Printing, Advanced Robotics, New Materials etc. Digital - IoT, Blockchain, Platforms (shared economy), AI etc. Biological - Genome, Synthetic Biology, Bioprinting etc. The impact of the fourth industrial revolution is widespread and is on all the aspects of human life - Economy, Business, Governments, Society and Individuals. Industry 4.0 Coming to Industry 4.0 - the term “INDUSTRY 4.0” (rather INDUSTRIE 4.0) comes from a project in the high-tech strategy 2020 of the German government and was first presented in 2011 at the Hannover Messe by the working group of the Federal Government. The exact name of the initiative is “Plattform Industrie 4.0”. It is a German Government-led initiative in collaboration with associations, enterprises, academia & trade unions. The overarching goal of the Industrie 4.0 platform is to secure and expand Germany’s leading international position in the manufacturing industry. Broadly the initiative refers to the intelligent networking of machines and processes in the industry with the help of Information and Communication Technology. It also coordinates the digital transformation of the industry. There are 6 working groups to develop the basic concepts and to tackle the challenges: Reference Architecture & Standards, Technology & Application Scenarios, Security of Networked Systems, Legal Framework, Work, Training & Further education and Digital Business Models in Industry 4.0 The platform has entered into a large number of partnerships with national and international alliances. Within Germany, it brings together more than 250 stakeholders from over 100 companies, associations, trade unions, academic and political institutions. The platform is steered and headed by Economic Affairs Minister. Plattform Industrie 4.0's International Co-operation is happening with multiple countries on their respective similar initiatives, some of which are: Japan - Robot Revolution & Industrial IoT initiative France - (AIF) Alliance Industry of the future (industrie-dufutur) Italy - Piano Industria 4.0 China - Made in China 2025 Australia - industry 4.0 The Plattform Industrie 4.0 has developed a reference architecture for Industrie 4.0. It is called RAMI 4.0 – Reference Architectural Model for Industrie 4.0 RAMI4.0 is three-dimensional map showing how to approach the issue of Industrie 4.0 in a structured manner. For more details on the difference between fourth industrial revolution, industry 4.0 and the industrial internet, please refer the article (authored by myself) at the below link Fourth Industrial Revolution, Industry 4.0 & the Industrial Internet ",
            "date": "Answered May 6, 2019",
            "views": "33",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek Chakraborty",
                    "user_href": "/profile/Abhishek-Chakraborty-31"
                },
                {
                    "user_id": "Carl Spies",
                    "user_href": "/profile/Carl-Spies"
                },
                {
                    "user_id": "Chetan Bansiwal",
                    "user_href": "/profile/Chetan-Bansiwal"
                },
                {
                    "user_id": "Desmond Moyo",
                    "user_href": "/profile/Desmond-Moyo"
                },
                {
                    "user_id": "Bryan Smith",
                    "user_href": "/profile/Bryan-Smith-334"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santiago Blasco",
                "href": "/profile/Santiago-Blasco-1"
            },
            "answer_text": "They are the same concept. The upcoming Industry 4.0 or Fourth Industrial Revolution is the result of several emerging technology trends combined, such as: IoT, Automation, Big Data, Data Analytics, Data Integration, Machine Learning, Deep Learning, Robotics or Quantum Computing. It is expected machines will be more autonomous in an hyper-connected, data driven near future. Feel free to read this article I wrote recently about Industry 4.0 I hope it helps! ",
            "date": "Answered July 20, 2017",
            "views": "41",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jessica Bak Fernandoy",
                    "user_href": "/profile/Jessica-Bak-Fernandoy"
                },
                {
                    "user_id": "Vinayak Bora",
                    "user_href": "/profile/Vinayak-Bora"
                }
            ]
        }
    ]
}