{
    "title": "What is the best scan tool for automotive diagnostics? - Quora",
    "tags": [
        "Diagnostic Tools",
        "Medical Diagnostics",
        "Automotive Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Philpott",
                "href": "/profile/Don-Philpott-2"
            },
            "answer_text": "Carista is a mobile application that empowers drivers from around the world to seamlessly diagnose, customize, and service their vehicles. With Carista users can quickly and easily check if there are any problems detected by their vehicle’s electronic systems, similarly to what a dealer would do.  Unlike other OBD2 apps, Carista is not limited to regular OBD2 diagnostics, but can also scan all other electrical components, such as ABS, airbag, navigation, for a wide range of supported models by Volkswagen Group, Toyota Group and BMW Group. The only prerequisite for using Carista is a small wireless OBD2 adapter. Carista makes its own high-quality OBD2 adapter that’s compatible with both iOS and Android. The app can also be used with generic standard OBD2 adapters (WiFi for iOS, Bluetooth for Android). The user just plugs in the OBD2 adapter into the car’s diagnostic port, turns on the ignition, and picks one of Carista’s three main features: diagnose, customize, or service. No prior technical knowledge about cars is required  Drivers also have the ability to change the behavior of their car, without wasting many hours and dollars at the dealer. And all of this is available through the convenience of a smartphone, which makes it easy to use whether you’re at home, at work, or on the side of the road. We take great pride in the way we have designed the user interface of the app: anyone can use it, without being a “car geek” or knowing how every system in the car works.  ",
            "date": "Answered July 25, 2018",
            "views": "622",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anindya Sur",
                    "user_href": "/profile/Anindya-Sur-5"
                },
                {
                    "user_id": "Jay Ellis",
                    "user_href": "/profile/Jay-Ellis-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emmanuel Fulton",
                "href": "/profile/Emmanuel-Fulton-1"
            },
            "answer_text": "The best scan tool is the OEM factory scan tool as nothing going to beat a dealer scan tool. Drew Technologies Mongoose Pro J2534 cables are very affordable for each make as they come with OEM factory diagnostic software with a 1 year TIS subscription. The cables run about $495. I own the Toyota Mongoose Pro with Toyota TechStream myself as it was worth every penny. TechStream is the same diagnostic software used at the Toyota and Lexus Dealerships. MongoosePro BlueDriver has been getting alot of hype as it's one of the best OBD scan tools out there as they are getting close to dealer level at an affordable price of $99. BlueDriver is well known, used by Professional Mechanics. It's very similar to the Torque Pro Android app but far better as it's has a massive library of fix it guide's. BlueDriver SnapOn and Autel are some well known names in the automotive industry used by Professionals they both make similar diagnostic scan tools ranging from OBD code readers to dealer scan tool such as the Autel MaxiSys DS808. Autel SnaponStore ",
            "date": "Answered October 20, 2017",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Justin St. Lewi",
                    "user_href": "/profile/Justin-St-Lewi"
                }
            ]
        }
    ]
}