{
    "title": "What are some tips for buying a refurbished phone? - Quora",
    "tags": [
        "Refurbished",
        "Refurbished Products",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tanmay Bhadviya",
                "href": "/profile/Tanmay-Bhadviya"
            },
            "answer_text": "Purchasing a refurbished cell phone is one way to save money when shopping for a cell phone. Refurbished phones are returned or donated from the previous owner and made ready for resale. Although there are plenty of advantages to purchasing a refurbished cell phone, there are also precautions that should be considered. There is a possibility that the phone may have been stolen, or never repaired or properly refurbished, particularly if the seller seems disreputable or the deal seems too good to be true. Evaluating the potential hazards of purchasing a refurbished phone will help you make a safe purchase. Review the following 10 tips to ensure the refurbished phone you want to purchase will pass the safety test. 1. Factory Settings When searching for a refurbished phone, it is important to check to make sure that the phone has been cleared of any evidence of prior ownership. If a phone has been restored to factory settings, the memory should be wiped clean. Factory setting restorations allow the phone to be set to the user's preferences. Should you discover any information stored in the phone prior to your use, it is an indicator that the phone may not be entirely safe and that it was not fully refurbished. If a phone was not reset to factory settings, yet sold as refurbished, this could also be an indication that it was stolen or recovered. Be wary of any information that appears on the phone that is not mentioned in a user manual, looks unfamiliar, or refers to previous usage history. 2. Recurring Charges There are games and applications that can be downloaded and incur monthly charges. Check the phone to ensure that only the factory programs are loaded on the phone. Should you find questionable applications, check your phone bill to ensure that you are not being charged for their use. Any unrecognizable applications or programs are an indicator that the phone was not fully refurbished or that spyware could be installed on the phone. If you discover extra monthly fees or unauthorized charges, contact your provider immediately. 3. Factory-Issued Accessories Are all of the necessary items and accessories, such as the battery and charger, included with your refurbished phone? Are they the correct accessories? Should the incorrect accessories be included, the phone may not operate properly, may not hold a charge, and may react negatively to the improper accessories. Most smartphones require a connection to a computer for an initial use and during regular intervals for syncing and updates. Accessories that are the wrong fit could result in a phone that is permanently damaged, won't be able to hold a charge, or is unable sync with your computer. 4. ESN On the inside of the cell phone, typically underneath the battery, is the electronic serial number (ESN), which is unique to each phone. You can easily contact the phone manufacturer to check on the history of the phone, using the ESN. Since the ESN is unique to every phone, the manufacturer will be able to provide details on previous ownership. If the phone was reported stolen or if it was ever returned to the manufacturer, this will have been recorded by the manufacturer. 5. Warranty from Manufacturer or Provider Inquire about a warranty from the manufacturer or retailer who sold you the phone. Some retailers extend the warranty to a refurbished phone and some do not. Phones endure bumps, bruises, jolts, and even drops into water. Should the refurbished phone be a victim of such abuse, you want to be able to have reassurance that the parts, either repaired or replaced, will still be covered by the manufacturer. If the refurbished phone does not include a warranty, you may want to reconsider purchase. 6. Reputable Retailer or Manufacturer Only purchase a refurbished phone from a reputable dealer, retailer, or manufacturer. Verify the credentials of the seller and the refurbisher. If there are no verifiable details, you may want to reconsider your purchase. Any reputable dealer who is selling refurbished electronics will be able to provide details on the refurbishment and, if available, prior ownership. A phone manufacturer has a vested interest in the success of its brand, and so is not likely to sell refurbished phones that will not stand up to normal wear and tear. 7. Price A refurbished phone should be less expensive than a new phone. If you are finding that the refurbished phone is priced the same as new phones of the same model, you should reconsider your purchase. Refurbished phones are previously used and have been refurbished to replace non-working parts, repair malfunctions, or clear the memory. Likewise, if a refurbished phone seems to be priced too low, the purchase may be too good to be true. A phone that is priced too low may not function properly, or may not have ever been refurbished. 8. Locked or Unlocked Check before making a purchase to ensure that the refurbished phone will work with your provider. If a phone is locked, it will only work with a specific provider. If a phone is unlocked, it will work with any provider. It is important to note that you may have to purchase a SIM to operate the phone if you no longer have a SIM or if the refurbished phone is in addition to your current cell phone. Also, there are phones that may not work with certain networks, depending on the provider. It is a good idea to check with your provider to ensure that there will be not be problems activating the phone after purchase. Your current provider will also be able to confirm which models will work with their network. 9. Model History Some cell phone models may be known to have specific mechanical problems or operating issues that persist even after refurbishing. Research the model's overall performance before you purchase. Problems with the phone may be attributed to a bad design or operating system failure. The more information that you can gather about a specific phone model, the more you will be aware of any malfunctions that you may encounter with use. Be aware that updates to the phone may not work with your refurbished model, as it may not utilize the most recent operating system with the proper bug fixes and updates. This is another aspect to consider when comparing various models for purchase. 10. Return Policy Before purchasing a refurbished phone, check on the dealer's return policy. If no returns are allowed, you need to be cautious about the purchase. Any retailer who is selling a refurbished phone should extend a return policy, the same as if the phone was purchased new. Be wary of any seller who will not accept the return of a refurbished phone. Buying Refurbished Cell Phones on eBay Finding a reputable dealer of refurbished phones is a primary consideration before making a purchase. An online marketplace that offers a variety of models and dealers is a good place to start your search. eBay includes listings for cell phones that are both manufacturer and seller refurbished. To find refurbished phones on eBay, begin in the Electronics section. Once you are in the Electronics section, select Cell Phones & Smartphones. Selecting Cell Phones & Smartphones generates all of the listings for cell phone devices sold on eBay. To only locate the refurbished phone, you can select Manufacturer Refurbished or Seller Refurbished under the Condition category in the menu extending down the left side of the listings. In both the Manufacturer and Seller Refurbished menus, you can further categorize the listings by brand. For example, you can opt to view the listings for Manufacturer Refurbished phones and select the Brand Apple. This series of selections will generate all of the listings for Manufacturer Refurbished Apple phones. To maintain the safety of your purchase, select a Top-rated seller who offers a return policy. Contact the seller directly and ask questions about the refurbishment. Inquire about the previous owner, what was completed during refurbishment, and if there is a warranty offered for the repairs that were made. Should a return policy not be offered, you should consider making the purchase from a different seller. Conclusion Refurbished phones are less expensive alternatives to purchasing brand new phones, and can be a budget friendly way to replace a phone that has been lost or damaged. You will not pay full retail price for a refurbished cell phone, but you should get all of the benefits of operating a brand new phone. Refurbished phones may come with a warranty, and should include the phone's basic factory-included accessories like a charger and a battery. However, when purchasing a refurbished phone, it's important to make sure you're buying from a reputable seller, and that the phone's previous ownership history is clear. In addition, be sure to choose a model that has a good reputation, and a phone that's been properly and professionally refurbished. Searching for refurbished phones in an online marketplace such as eBay allows for side-by-side comparisons of brands and models, as well as the ability to work with reliable sellers. ",
            "date": "Answered December 22, 2018",
            "views": "19",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Luna Swift",
                    "user_href": "/profile/Luna-Swift-6"
                },
                {
                    "user_id": "Opeyemi Oyewole",
                    "user_href": "/profile/Opeyemi-Oyewole-2"
                },
                {
                    "user_id": "Pankaj Navlekar",
                    "user_href": "/profile/Pankaj-Navlekar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhawana Das",
                "href": "/profile/Bhawana-Das-2"
            },
            "answer_text": "Refurbished phones are often risky business. The reason being that there are very few reliable sites to buy refurbished gadgets. Most of the time, refurbished phones are sold on the black market, which does not provide you any protection. Combined with the stigma of having a used' phone, it becomes hard for people to understand how to buy a refurbished phone. But these are a few tips to keep in mind when purchasing a refurbished phone. 1.Reliable Websites: When buying a refurbished phone, you have to be very careful. It is easy to get scammed by unreliable websites. They showcase great offers and products but can never deliver on the same. Certified sites like Amazon refurbished, and Quikr are some reliable sites to buy a refurbished phone on. These sites also have reliable customer service that can help you with any issues you come across. Another advantage to certified sites is the knowledge that the quality of repairs and phone can be assured. The phone is guaranteed to either come to you in the conditions specified or else you will get your money back. 2. Check for warranty Buying a refurbished phone without a warranty is a risky thing to do. Most sites offer a warranty, whether a third party or from the manufacturer. Sites like Togofo offer up to 12 months of warranty on your refurbished smartphone. Without a warranty, you're likely to be scammed out of your money. If the phone runs into any problems a few months in and you do not have any warranty, you have wasted your money. 3. Standardized grading Mobiru is the only site that offers you a standardized grading system, which allows you to understand the phone you're buying. Most sites have their method of standardization, which is not comparable to another site. This makes it close to impossible to understand the comparison of quality from phone to phone. Mobiru India allows you to compare phones on a standardized quality metric, but also price. The best part if that Mobiru enables you to compare sites that are certified and verified. 4. Check the battery and other features: The most crucial part of buying a refurbished phone is able to check the phone and other accessories (if available) for quality. Most refurbished phones have been used before, so a little battery damage and a few scratches are normal. However, this being said, it is still essential to check the phone. A few things to check are the battery, GPS, Bluetooth, Wi-Fi, and speakers. When you receive your refurbished phone, charge and open up the phone and immediately load up many apps to see how the battery deals with the strain. On iPhones, you can check the battery performance via the settings. Also, try connecting to other devices using the Bluetooth feature. Do the same for the Wi-Fi feature as well. If these do not work, chances are you have received a faulty refurbished phone. To check the speakers, make a phone call. Putting it on speakerphone mode will allow you to understand the volume of your refurbished phone. 5. Check if your SIM card is supported: Some phones require a specific type of SIM card. Make sure to understand the model of the refurbished phone you are buying. Understand the dimensions, the technicalities, size, etc., of the phone before buying it. This way, you can spot a fake, or at the very least, understand where there are issues regarding the phone. Check for dead pixels on the screen or low responsiveness of the screen. If you have any problems, you can easily submit it for repair via warranty. In the past you'd have to browse between several different sites to check and research to buy a refurbished phone properly, now you can go to one website to get all the information you need. Mobiru India has been very informative for me regarding how to buy a refurbished phone. It also was beneficial with its innovative gesture that allows you to compare the model of phone that you want from several different sites. You can understand the specifics of the refurbished phone as well as the price differences on different certified websites. It also has a feature that shows a standardized grading system, which means you can understand the exact quality of the phone offered by different vendors. ",
            "date": "Answered June 13, 2020",
            "views": "190",
            "upvotes": "0"
        }
    ]
}