{
    "title": "What are some ways to protect identities on the Internet? - Quora",
    "tags": [
        "Online Identity",
        "Identities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Huskerson",
                "href": "/profile/Tom-Huskerson"
            },
            "answer_text": "First and foremost is to be totally aware of  what information you are broadcasting. Provide as little information as possible on social media. That includes where you live, where you work and who your friends and family are. That is not always easy since some people may identify you on their wall or pages. You can ask them to remove any information you want to keep secure. Don't use your picture or the picture of your children or spouse. Use a pet or something like a nice sunset. Be extremely careful about talking about your life and activities. I understand that is what social media is all about but you should still exercise caution. Don't \"friend\" the friend of a friend. This allows that person access to your social media page. Be careful of sites like LinkedIn where a lot of your information and resume material is stored. Be careful with online forms. Make sure you know who is receiving the information. A lot identity theft occurs as result of phony job offerings requesting resumes and online applications. Never, ever use your social security number online unless you beyond certain who is seeing it. Also make sure your computer is clean of any malware and spyware by using a good software tool. A lot of information is stolen through spyware that is implanted on computers without you knowing. Secure your home network. Make sure you have a strong password on your wireless router. A lot of routers come with the factory default password that does not get changed. Its easy to find that password online. Once someone has it they can monitor your Internet activity and eventually get your information including banking passwords. Use powerful passwords to protect your social media sites and email. When using email delete any suspicious emails with attachments or links. Again, this is how a lot of malware gets on your computer. Do an Internet search of your name ans see what information is available. You might be surprised what you find. A lot of public information is out there as well as comments and opinions you posted. Use an alias whenever possible. If your name is Robert Green you don't want to use rgreen or robgreen@soso.com. Instead use something less revealing like R55g@soso.com. Use multiple email accounts. One for friends and family. One for business and one you throw around to anybody who may request it.  Hope this helps. ",
            "date": "Answered July 22, 2014",
            "views": "259",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Monica Rix Paxson",
                    "user_href": "/profile/Monica-Rix-Paxson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shamim Ahammed",
                "href": "/profile/Shamim-Ahammed-23"
            },
            "answer_text": "Identity theft is any reasonable deception, scam, or crime that leads to the loss of non-public information, together with the loss of usernames, passwords, banking data, MasterCard numbers, Social Security Numbers, and health ID’s, that's then used while not your permission to commit fraud and alternative crimes.  Up to nine million Americans have their identities taken every year in line with the FTC1, and a minimum of 534 million personal records are compromised since 2005 through attacks on the databases of companies, government bodies, establishments, and organizations. If those breaches were unfolded equally across the U.S. population of 310 million, everybody would have had their identities taken one and common fraction times. How are identities stolen? Consumers become victims of fraud through many varieties of exploits. These will happen the old school ways in which once crooks (including family members!) steal mail from your mailbox, rummage through your trash for bills and bank statements, steal wallets and purses, or create an additional copy of your MasterCard - maybe once your waiter or clerk walks off to method your payment. How can I protect my identity online? Below area unit a number of key steps you'll desire forestall fraud online: Protect your pc and smartphone using Privacy Risk Software with a sturdy, up-to-date security software system. If your pc or phone is infected with a malicious software system, different safeguards square measure of very little facilitate as a result of you’ve given the criminals the key to all or any of your on-line actions. even be certain that any OS updates square measure put in.Learn to identify spam and scams. Though some phishing scams square measure simple to spot, alternative phishing makes an attempt in an email, IM, on social networking sites, or websites will look terribly legitimate. The sole thanks to ne'er fall for a phishing scam is to ne'er click on a link that has been sent to you. as an example, if the e-mail says it’s from your bank and has all the proper logos and is aware of your name, it's going to be from your bank - or it's going to not be. rather than victimization the link provided, realize the web site yourself employing a program. In this manner, you'll apprehend you landed on the legitimate web and not some simulation faux site.Use robust passwords. Weak positive identifications square measure associate identity thief’s dream - particularly if you utilize identical passwords all over. Once the stealer is aware of your positive identification, they will log you’re your money accounts and create mayhem. You would like passwords that square measure long (over ten characters), robust (use higher and small letter letters, numbers, and symbols), which has nothing to try to together with your personal info (like name, age, birthdate, pet). Positive identification managers and two-factor authentication (2FA) also are each best practices for positive identification management.Review your credit score. Look to envision if there ar new credit cards, loans, or alternative transactions on your account that you simply don't seem to be responsive to. If they are, take immediate steps to possess these terminated and investigated.Only use prestigious websites once creating purchases. If you don’t recognize the name of a corporation that you simply wish to buy from, do your school assignment. however ar they reviewed by alternative users? Do they need a powerful rating with the higher Business Bureau? Do they use a secure, encrypted affiliation for private and money information? machine-readable text transfer protocol Secure (https), as its name suggests, maybe a safer variant of the older machine-readable text transfer protocol (https). The new protocol was developed to validate the security and privacy of a website, thus it is vital you see \"https\" in an exceedingly website’s universal resource locator whenever it asks for private or money info.Consistently applying these eight steps to each defend and monitor your credit score can cut back the risks of getting your identity taken, and warn you instantly if such a tangle arises. net security solutions with fraud protection will guard against specialized malware designed to steal personal data by work your keystrokes or snooping on your browsing sessions. shield usernames, account numbers, and different personal data against spyware and different on-line threats targeting valuable personal information. ",
            "date": "Updated October 10, 2020",
            "views": "173",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mominul Islam",
                    "user_href": "/profile/Mominul-Islam-212"
                }
            ]
        }
    ]
}