{
    "title": "What is green energy? - Quora",
    "tags": [
        "Green",
        "Sustainable Technology",
        "Word Definitions, Terminology, and Jargon",
        "Alternative Energy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Boschmann",
                "href": "/profile/Patrick-Boschmann"
            },
            "answer_text": "Green Energy can be considered as a form of energy that doesn't involve the direct generation of gases, particulates or radiation at the point of generation using non-renewable resources. Basically combustion of fossil fuels and nuclear. Green energy is a bit deceiving in that there are always environmental issues with any power generation. With green energy, the effects are masked or differed and are not immediately obvious. Solar energy, for instance, requires the construction of solar panels to generate electricity. Components of these panels involve non-renewable petroleum products. Solar water heating involves plastics, another petroleum product. The large issue with solar panels is yet to be seen as recycling old panels is proving to be difficult. Solar panels require massive amounts of land to generate power as they are inefficient compared to nonrenewables. Hydropower which uses gravity to generate energy creates environmental issues by altering the land around dams and affecting fish and other life forms that live in and around the water. Wind power requires petroleum products for the construction of the windmills. The windmills are responsible for the deaths of many birds, the vibrations from the windmills affects humans' insects and animals. The sound and the sight of windmills can be viewed as noise and site pollution. Biofuels utilize combustion and are grown on land that could be used for food production. It is indirectly responsible for the deforestation of forests and jungles as more land is needed to support this fuel. Geothermal uses the heat or relative coolness of the earth to heat and cool at the surface. It requires a pump to move the fluids which in turn require a different form of energy to power. It is location-specific and cannot be used everywhere. It may be one of the better energy environmentally but is limited in what it can do. Batteries appear to be a leading component of green alternatives. The issue with lithium is two-fold. The mines where lithium is acquired are nasty open pits that damage large areas of the earth. Recycling batteries is difficult and costly. The number of batteries in an electric car is quite large. We have yet to see these start to pile up. Electricity requires copper which requires the destruction of large land areas in able to mine it and leaves large open pits. Electricity can very very wasteful as a lot of energy is lost during its transmission. A lot of electricity goes to the ground and is wasted in off-peak hours. ",
            "date": "Answered February 24, 2020",
            "views": "138",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jordan Karim",
                "href": "/profile/Jordan-Karim"
            },
            "answer_text": "What are green sources of energy? Green energy sources are sources that produce limited levels of pollution & often come from natural/renewable sources. This includes solar (CSP & PV), hydroelectric, wind, geothermal, hydro, and nuclear power. Each of these technologies are different, and have advantages/disadvantages. For example, hydro is great but it requires specific geography & is already near capacity in the US. Geothermal requires a thin spot in the crust. Wind & solar are intermittent, but the fuel is free (can’t beat free!). Nuclear is extremely reliable & the operating costs/MWh are low, but it has a steep upfront capital cost. The important thing they all have in common is low GHG emissions compared to fossil fuels.  The above answered the question, but I can already feel the wave of people talking about the mountains of waste associated with nuclear energy, and how dangerous it is, etc. This wasn’t the point of this answer, but I’ll just say a couple of things on that. First, the “waste” being referred to are spent fuel rods. These actually have a good deal of usable energy left and could be reprocessed back into fuel, reducing the overall amount of waste that must be dealt with. This has been done successfully in France for decades. Eventually, though, you’ll have to store the waste. The amount of waste produced by a nuclear plant is relatively small, and storing it is a solved problem. We lack only political will, not engineering know-how. To see it done right, check out Finland: On Nuclear Waste, Finland Shows U.S. How It Can Be Done Second, on safety, nuclear power kills fewer people per MWh than any other energy source, including wind or solar. This is primarily because of the mining requirements to build solar panels and wind turbines, compared to the relatively small mining requirements for uranium fuel. (Mortality rate globally by energy source 2012 | Statista) It is true, though, that when a nuclear plant fails it grabs headlines and can be spectacular. In this way, it’s kind of like air travel. Flying in an airplane is statistically much safer than driving; but when a plane crashes it’s a spectacle. In reality, of the three major nuclear disasters we’ve had so far, TMI lead to zero loss of life. It isn’t clear exactly how many deaths were a result of Fukushima, but the number is almost certainly in the double digits at most. I don’t want to downplay it: Both were still tragedies, all the more so because they were avoidable, and incurred large financial losses. The nuclear industry takes those seriously and has learned from both incidents. All I’m saying is that they are not the apocalypse scenarios that they are imagined to be. Chernobyl is…well…Chernobyl. But that plant was run in a manner so reckless it would be comical if it wasn’t so serious. Their containment structure was a tin shed, for crying out loud! Fortunately, no modern plant is constructed in such a blatantly unstable configuration, and no modern plant is run with such a disregard for safety. ",
            "date": "Answered April 2, 2020",
            "views": "55",
            "upvotes": "0"
        }
    ]
}