{
    "title": "What is the need for a smartwatch if we have a smartphone? - Quora",
    "tags": [
        "Smart Watches",
        "Wearable Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Srikanth Kumar",
                "href": "/profile/Srikanth-Kumar-43"
            },
            "answer_text": "1. Hands-free user experience--> the smart-watch can allow you to receive messages, communicate and the like, while your hands remain free for use. The idea here is that it'll be \"less distracting\" to the user since instead of receiving constant messages and drawing his/her smart phone, the user can briefly see if different notifications are relevant or not.2. Personalized information--> most smart-watches now have the ability to retrieve different physiological parameters about the user. This gives way to drawing personalized health and fitness information. This could be revolutionary in the health industry but also allows individuals to be better aware of themselves.3. Personal assistant on your wrist --> smart-watches attempt to simplify our daily functions. The notion is that analyzed data and critical information will be at your immediate disposal, simplifying daily functions dramatically and making you more productive and efficient. 4. The gateway to the IoT world--> This is more my personal belief but I think that wearables in general and smart-watches specifically will be one of the more integral devices in the IoT vision. The idea of connected devices will be ever more realistic and necessary once individuals will have a personal assistant on their wrist that will be able to speak with the surrounding environment. This personal assistant will be able to assist the user in remotely controlling other devices and therefore will become that much more essential. source: Answer By Mor Rahimi for a different question. Thanks. Hope this helps. ",
            "date": "Answered April 14, 2017",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leo Ueno",
                    "user_href": "/profile/Leo-Ueno"
                },
                {
                    "user_id": "Ankita Chatterjee",
                    "user_href": "/profile/Ankita-Chatterjee-54"
                },
                {
                    "user_id": "Umang Maheshwari",
                    "user_href": "/profile/Umang-Maheshwari-19"
                },
                {
                    "user_id": "Yash Gorani",
                    "user_href": "/profile/Yash-Gorani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Umang Maheshwari",
                "href": "/profile/Umang-Maheshwari-19"
            },
            "answer_text": "Smartphones nowadays are quite big and are mostly kept in pockets, or in case of women in their clutches or handbags. So everytime you get a call or a text you have to take out your smartphone. And after this we do not find that call or notification important we tend to get annoyed. So to solve this problem, smartwatches were made. By using them we can reject the call or notification if not important and save ourselves from taking out our humungous phones out of our pocket. But after this we also added features like pedometer, heart rate monitor, sedentary reminder etc. This was done to make our lives easier (or miserable). These things are generally not found in even mid range smartphones. So, I think people buy smartwatches primarily for the secondary purpose of it and use it's primary function secondarily. ",
            "date": "Answered April 14, 2017",
            "views": "554",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karan Patel",
                    "user_href": "/profile/Karan-Patel-407"
                }
            ]
        }
    ]
}