{
    "title": "What is a cast screen in Android? - Quora",
    "tags": [
        "Android L",
        "Jelly Bean (Android 4.1)",
        "Kit Kat",
        "Lollipop (Android 5.0)",
        "Android Devices",
        "Android (operating system)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arun Narayanan",
                "href": "/profile/Arun-Narayanan-70"
            },
            "answer_text": "Casting refers to a protocol for wirelessly using another display device such as a TV or a wireless speaker while initiating and controlling it from a smartphone. In the case of online content such as YouTube, the mobile device acts like a remote control. For example, if you cast a YouTube video from your mobile phone to an Android TV, the video gets streamed directly to the TV from YouTube servers and does not go through your phone. However, you can pause or stop playback from your phone or using the TVs remote control. The same applies to streaming audio to a Google Home or Alexa device. When casting the mobile screen itself to the TV it involves realtime transfer of data between the smartphone and the TV. An ideal setup will consist of the following: A newer phone such as an Android M+ phone with cast capability. Windows 10 PCs also have cast capabilities.A cast receiver such as Chromecast Stick or Fire TV Stick. Android TVs, Alexa and Google Home have casting receivers built-in.A display (TV) or audio device (speakers)A wireless router (with Internet if streaming online content) with all devices connected to it.You can use casting to view the photos or videos in your phone on a bigger screen such as a TV or projector without having to connect MHL type of cables. ",
            "date": "Answered December 19, 2017",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josh Koptala",
                    "user_href": "/profile/Josh-Koptala"
                },
                {
                    "user_id": "Mohammad Altamash",
                    "user_href": "/profile/Mohammad-Altamash"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isha Desai",
                "href": "/profile/Isha-Desai-1"
            },
            "answer_text": "Cast screen let's you display your smartphone's screen live on any device that supports casting. Such as Smart TV's , Laptops and even certain Samsung cameras. You can also use chrome cast by google if your smartphone lacks the inbuilt screen casting option. It's basically a USB dongle with screen casting capabilities that you connect to the device through which you want to cast your phone's screen. :) Screen casting is mostly used for streaming gameplays live or recording certain tutorials live. ",
            "date": "Answered December 3, 2015",
            "views": "680",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fariz Edayakat",
                    "user_href": "/profile/Fariz-Edayakat"
                }
            ]
        }
    ]
}