{
    "title": "What is the future of market research? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Alessander Conossel",
                "href": "/profile/Alessander-Conossel"
            },
            "answer_text": "Market research is very important for business and can benefit various businesses in many different ways. For market research to be meaningful you need to gather lots of data and that would be difficult if it would be done manually. This is why many market researchers use web scraping to achieve their goals. Here are some other reasons why a business needs web scraping: An online presence can be tracked. That’s also an important aspect of web scraping where business profiles and reviews on websites can be scrapped. This can be used to see the performance of the product, the user behavior, and reaction.Custom Analysis and curation. This one is basically for the new websites/ channels wherein the scraped data can be helpful for the channels in knowing the viewer's behavior. This is done with the goal of providing targeted news to the audience. Thus what you watch online gives the behavioral pattern to the website so the business knows their audience and can offer what the audience actually likes.Online Reputation. When a business plans its ORM strategy the scraped data helps to understand which audiences business most hope to impact and what areas of liability can most open the brand up to reputation damage. By understanding these areas of vulnerability, the business can use them to its greatest advantage.To provide better-targeted ads to customers. The scrapping not only gives numbers but also the sentiments and behavioral analytic thus the business can know the audience types and the choice of ads they would want to see.To gather public opinion. Monitor specific company pages from social networks to gather updates for what people are saying about certain companies and their products. Data collection is always useful for the product’s growth.Search engine results for SEO tracking. By scraping organic search results you can quickly find out your SEO competitors for a particular search term. You can determine the title tags and the keywords they are targeting. Thus you get an idea of which keywords are driving traffic to a website, which content categories are attracting links and user engagement, what kind of resources will it take to rank your site.Scrape leads: This is another important use for the sales-driven organization wherein lead generation is done. Sales teams are always hungry for data and with the help of the web scraping technique, you can scrape leads from many directories and then contact them to make a sales introduction. The data can be taken out in the desired format and can be used for lead generation, brand building or other purposes.To build vertical-specific search engines. Even if this is a new thing that is popular in the market but it also requires a lot of data hence web scraping is done for as much public data as possible because this volume of data is practically impossible to gather.These are just several examples that can be achieved with web scraping while doing market research. Market research can highly improve business, help with researching markets, launching new products, improving communication with target audience, etc. I have to say that with the time market research will grow to be more and more important, probably we will find out new ways on how to execute market research tasks and how to use the information we gathered. This process will be important for everyone who’s in the business world. ",
            "date": "Answered November 11, 2019",
            "views": "247",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Cook",
                "href": "/profile/Jonathan-Cook-18"
            },
            "answer_text": "Over the last couple of years, it's become trendy to talk about \"disruptive\" technologies that are supposed to change market research forever.  There's a great deal of hyperbole out there right now, including much talk that certain types of market research are going to disappear.  Others will say that one sort of tech-based market research is the \"future\". A couple of things to keep in mind: 1. Nobody knows the future.  When people talk about what the future will be, they're actually talking about their perceptions of the present, its relationship to the past, and their hopes or fears about the future. 2. Technologies are usually additive.  They don't typically replace older technologies, and despite the enthusiasm for new technologies, they aren't truly universally applied. Remember the paperless office?  It never happened.  We still use paper, though we also use electronic screens for some things we once could only do with paper. Are eBooks replacing physical books?  No, though there are some sorts of books that aren't being published in physical format anymore.  eBooks are great for some things, but they're lousy for others.   When interstate highways were invented, were old-fashioned roads abandoned?  No, though some poorly planned cities suffered from decreased traffic when the new highways were put in. My point is this: We can't be certain about the future of market research, but keeping past cycles of technological development in mind, what's likely is that older, non-digital, non-social, non-mobile methodologies will keep going strong, where they are appropriate for use.  The future won't belong to any method or technology.  We're more likely to have a mosaic future, and the ones that are currently hot will settle down to become just another choice among many. ",
            "date": "Answered October 16, 2013",
            "views": "25",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Saxena",
                    "user_href": "/profile/Rahul-Saxena-221"
                },
                {
                    "user_id": "Sanja Copic",
                    "user_href": "/profile/Sanja-Copic-1"
                },
                {
                    "user_id": "Rinkesh Gokulchandani",
                    "user_href": "/profile/Rinkesh-Gokulchandani"
                },
                {
                    "user_id": "HR",
                    "user_href": "/profile/HR-238"
                },
                {
                    "user_id": "Surya Angarai",
                    "user_href": "/profile/Surya-Angarai"
                },
                {
                    "user_id": "Richard Wanjohi",
                    "user_href": "/profile/Richard-Wanjohi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guadi Klass",
                "href": "/profile/Guadi-Klass"
            },
            "answer_text": "It's mobile + video. Mobile is empowering consumers and making it more convenient for them to interact with brands - whether they are purchasing a product, researching a brand, asking friends for advice and reviews on social media sites. People don't have the time to drive to a focus group, nor are they interested in brands interrupting their lives in any way. Think of what's happening in marketing right now: the new trend is a purely permission-based model.  Why video? The ability that video gives you to read non-verbal communication, to see things through the consumers’ eyes, and to capture “in-the-moment” insights is unmatched. Mobile (and all market research, for that matter) methodologies that ignore video are harvesting only a small fraction of what companies need to make informed decisions. Mobile research allows us to move away from having consumers describe hypothetical situations and closer to respondents sharing the facts and actual happenings around them – but these insights can be skewed if you can’t compare what they narrate against the visual reality around them. That’s one reason video responses are superior to written responses. On-the-go text qualitative research demands great effort on the participants’ part, which could affect the quality of the insights. Video takes less effort to produce on the go because participants don’t have to reproduce what they are experiencing but capture it as they live it. If you'd like to see this methodology in action and learn how Hewlett-Packard was able to follow the natural shopping journey of high school graduates looking to purchase a PC and a printer for college by leveraging mobile video, check out this webinar: http://www.qualvu.com/events/webinar-mobile-research-gets-real-hewlett-packard-lets-the-consumer-decide/. ",
            "date": "Answered July 21, 2011",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "HR",
                    "user_href": "/profile/HR-238"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Stewart",
                "href": "/profile/Kevin-Stewart-245"
            },
            "answer_text": "Here are our 10 predictions about the future of the market research industry: The traditional market research agencies that refuse to change will go out of businessDIY market research will catch on even more and will democratic our sectorSocial listening analytics will be a must-have for every marketing and market research managerAgile research will become mainstream and will be facilitated by online communitiesMicro surveys and intercepts will eventually replace long monthly customer tracking studiesProcessing behavioral data in motion and delivering real-time micro insights will be a core competence of any insights expert agencyAdjacent marketing services such as customer engagement, enterprise feedback management, customer advocacy, will become solutions offered by the market research companies of the futureData scientists will be the new insight experts, utilizing a lot more predictive analytics than rear-view mirror analyticsThe code of conduct of market research associations such as ESOMAR and MRS will be revised as it does not apply to the digital economy. If not, the new breed of MR agencies will refuse to be members of such archaic organisations, and the latter will die outNielsen will no longer be the largest market research company in the world",
            "date": "Answered February 16, 2019",
            "views": "696",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "S B",
                    "user_href": "/profile/S-B-2483"
                },
                {
                    "user_id": "Axl Blumberg",
                    "user_href": "/profile/Axl-Blumberg"
                },
                {
                    "user_id": "Sanja Copic",
                    "user_href": "/profile/Sanja-Copic-1"
                },
                {
                    "user_id": "Srushti Warungse",
                    "user_href": "/profile/Srushti-Warungse-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Damian Priday",
                "href": "/profile/Damian-Priday"
            },
            "answer_text": "From a consumer understanding perspective:RealEyes and similar companies that use facial recognition to test real emotions are going to be huge. Emotional understanding will help break down the barriers to connections between brand and consumer. Industry wide:Look out for companies like ZappiStore  who leverage automation to deliver insights in hours instead of days or weeks. Not only is it fast, but cost effective as well and can mirror the iterative process of design and concept generation. Surveys and panels:Getting consumers to answer questions is always a challenge, tablet and mobile will play a huge part in getting access to consumers and their opinions. Other digital media will play a huge role in getting customer feedback and input when they least expect it. ",
            "date": "Answered June 16, 2015",
            "views": "25",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishwanatham Naveen",
                    "user_href": "/profile/Vishwanatham-Naveen-1"
                },
                {
                    "user_id": "A. W. Rose",
                    "user_href": "/profile/A-W-Rose"
                },
                {
                    "user_id": "Rinkesh Gokulchandani",
                    "user_href": "/profile/Rinkesh-Gokulchandani"
                },
                {
                    "user_id": "HR",
                    "user_href": "/profile/HR-238"
                },
                {
                    "user_id": "Anne Wu",
                    "user_href": "/profile/Anne-Wu-2"
                },
                {
                    "user_id": "Thom Oman",
                    "user_href": "/profile/Thom-Oman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaishak Nair",
                "href": "/profile/Vaishak-Nair-15"
            },
            "answer_text": "Future of market research is on adoption of automation tools like Market Research App that business leaders will require better intelligence about their customers. This will help in making smarter and more confident decisions, it can be acquired by using an app that lets the business leaders capture details of customers and the possibility of using the data for further studies. An app like Brew Survey lets users capture leads using its offline data collection feature, with this feature its not necessary that the device needs internet connection 24/7. Users can conduct market research at any location & sync the data when the device gets automatically connected to the internet. With this method, users can capture quality leads by acquiring email, phone number or other details by asking one question at a time on the iPad/Tablets(by using \"card\" layout) Know more by visiting the site and sign up for free! Download Link: Market Research App ",
            "date": "Updated June 18, 2018",
            "views": "645",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Naushad Madakiya",
                    "user_href": "/profile/Naushad-Madakiya"
                },
                {
                    "user_id": "Mike Larry",
                    "user_href": "/profile/Mike-Larry-90"
                },
                {
                    "user_id": "Mohit Barad",
                    "user_href": "/profile/Mohit-Barad"
                },
                {
                    "user_id": "Gokarna Avachat",
                    "user_href": "/profile/Gokarna-Avachat"
                },
                {
                    "user_id": "Nitin Soni",
                    "user_href": "/profile/Nitin-Soni-76"
                },
                {
                    "user_id": "Shiv Chauhan",
                    "user_href": "/profile/Shiv-Chauhan-71"
                },
                {
                    "user_id": "Nitin Soni",
                    "user_href": "/profile/Nitin-Soni-84"
                },
                {
                    "user_id": "Neel Patel",
                    "user_href": "/profile/Neel-Patel-264"
                },
                {
                    "user_id": "David Marshel",
                    "user_href": "/profile/David-Marshel"
                },
                {
                    "user_id": "David Cameron",
                    "user_href": "/profile/David-Cameron-112"
                },
                {
                    "user_id": "Anupam Mishra",
                    "user_href": "/profile/Anupam-Mishra-204"
                }
            ]
        },
        {
            "author_info": {
                "name": "S B",
                "href": "/profile/S-B-2483"
            },
            "answer_text": " Accurate and thorough information is the foundation of all successful business ventures because it provides a wealth of information about prospective and existing customers, the competition, and the industry in general. Thus the process of gathering, analyzing and interpreting information about a market, about a product or service to be offered for sale in that market, and about the past, present and potential customers for the product or service serves as the foundation of Market Research. Market research provides relevant data to help solve marketing challenges that a business will most likely face as an integral part of the business planning process. The primary purpose of conducting market research is to understand or examine the market associated with a particular product or service, to decide how the audience will react to a product or service. The information obtained from conducting market research can be used to tailor marketing/ advertising activities or to determine what are the feature service requirements of consumers. Continue Reading… ",
            "date": "Answered April 16, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chandrashekhar Shetty",
                "href": "/profile/Chandrashekhar-Shetty-2"
            },
            "answer_text": "Hi, Market research reports are constantly upgrading day by day. Nevertheless, there has been a considerable amount of data to choose from. The present scenario in the market research domain states that these data accumulated by Global Market Research reports may not be influencing future marketing decisions on a whole. A recent survey reflects the growing surge in the mobile internet over the general desktop web. As market research domains are all desktop oriented, grasping into small tab is not looking for a better length. Furthermore, the data collected by individual companies will not be impactful in the overall marketing decisions in the future. It is merely, just one of the many factors influencing the industry of data providers. Aarkstore market research focuses on several analysis and data accumulated over the span of years providing an adequate hold on various domains. Thanks. ",
            "date": "Answered September 27, 2018",
            "views": "296",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashley Williams",
                "href": "/profile/Ashley-Williams-476"
            },
            "answer_text": "The market research has become essential part of all type of companies,whether it is small scale company or any multinational company. Having knowledge of your market is must nowadays. Keeping track of your competitors has become must to hold your position in this growing world of market for very reason market research is emerging so speedily and has long way to go. Every company depends on its market research unit or any market research firm it is associated with. ",
            "date": "Answered March 2, 2017",
            "views": "633",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darren Clark",
                    "user_href": "/profile/Darren-Clark-37"
                },
                {
                    "user_id": "Maitreya Dewal",
                    "user_href": "/profile/Maitreya-Dewal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlos Leiva Burotto",
                "href": "/profile/Carlos-Leiva-Burotto"
            },
            "answer_text": "The company I'm actually building it is the future :) Update: this is actually kind of fun. I always review answers and request improvements.. but hey, if I tell you more of what I'm building.. then isn't going to be the future.. right.. so forgive me If I can't give you more details ;) ",
            "date": "Answered June 30, 2011",
            "views": "594",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubham Bagde",
                "href": "/profile/Shubham-Bagde-22"
            },
            "answer_text": "The future of market research is full of challenges & opportunities. New technologies such as artificial intelligence & machine learning will enable faster analytics, report creation as well as automating data collection, analysis, free time for higher level problem solving.  ",
            "date": "Answered December 17, 2018",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve S",
                "href": "/profile/Steve-S-277"
            },
            "answer_text": "The future of market research would be very design-centric. There would be a lot of focus on setting the right questionnaires, the right survey instruments and ensuring that the design setup is in place. Read more to know our perspective on future of market research ",
            "date": "Answered March 28, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prasenjit Dasgupta",
                "href": "/profile/Prasenjit-Dasgupta-4"
            },
            "answer_text": "Well, style of research would vary, but research will continue. Say 2 decades back, 90 % plus of research was carried on face to face, whereas now, the Net & Mobile has changed the style a lot. This has eased the Time & Cost taken for both data collection and compilation. ",
            "date": "Answered December 9, 2019",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mick Jones",
                "href": "/profile/Mick-Jones-26"
            },
            "answer_text": "Marketing research is very important to the success of any business tokeep track of your customers and competitors. They help our clients to determine who their clients or audiences really are. ",
            "date": "Answered February 27, 2016",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roxel Gestiada",
                "href": "/profile/Roxel-Gestiada"
            },
            "answer_text": "Market research can now be outsourced these days. The thing is, you just need to make sure that you pick a partner that will be able to deliver quality work. ",
            "date": "Answered May 19, 2015",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Poonam Deshmukh",
                "href": "/profile/Poonam-Deshmukh-29"
            },
            "answer_text": "Sorry for wasting your time. Can someone please answer my question? Please check my profile ",
            "date": "Answered April 1, 2019",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elsie Steeves",
                    "user_href": "/profile/Elsie-Steeves"
                },
                {
                    "user_id": "Rinkesh Gokulchandani",
                    "user_href": "/profile/Rinkesh-Gokulchandani"
                }
            ]
        }
    ]
}