{
    "title": "What would you improve for cyclists? - Quora",
    "tags": [
        "Bike Commuting",
        "Cyclists",
        "Professional Cycling",
        "Urban Cycling",
        "Road Cycling",
        "Cycling",
        "Bicycles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Gurney",
                "href": "/profile/Jonathan-Gurney-1"
            },
            "answer_text": "Better law enforcementafter bad weather, the second worst enemy of the cyclist is the bike thief.and the third worst is the incompetent or malicious driver.Better design standards for cycle facilities, with existing inadequate ones either improved or abolished.Pedestrians and cyclists to grasp that the presence of cars is not the defining criterion for a road, and that the same rules apply to so-called cycle-pedestrian shared paths as do to shared roads (roads without footways). On shared general-purpose roads, such as country lanes without footways, motor traffic, cyclists and pedestrians generally manage to get along without constantly obstructing each other. However all too often removing motor traffic results in pedestrians and cyclists appearing to forget all the rules of the road and mill about getting in each other’s way.It being easier to carry cycles by rail:sufficient space on trainscycles carried without baggage having to be stripped off or being hung in vertical racks.",
            "date": "Answered April 29, 2019",
            "views": "228",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Baker",
                    "user_href": "/profile/Mark-Baker-2"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                },
                {
                    "user_id": "E. Clayton Rowe",
                    "user_href": "/profile/E-Clayton-Rowe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Ramsey",
                "href": "/profile/Greg-Ramsey-16"
            },
            "answer_text": "This kind of question inspires thoughts that come from a different perspective. People that are riding a bicycle everyday are already receiving the benefits. Improvements for them may make their experience more enjoyable and safer, but it will not increase the amount of benefits they get from riding, unless they ride more because of the improvements. These people will save society in health care cost, if they continue riding a bicycle everyday. So the purpose of improvements should be to get more people to ride a bicycle more frequently. These improvements would pay for themselves in coming years, if they succeeded in getting more people to ride. And it would benefit the cyclist. They would have less cars to deal with and slightly better air quality to breath. Here are some numbers to consider. If every gallon of gasoline was taxed one penny, there would be an estimated 470 million dollars for bicycle infrastructure. That's so far in 2019 only. If this infrastructure increased the amount of people commuting by bicycle to 25%, which is just half of the trips in cars that are 5 miles or less (US Household Travel Survey), it would prevent the release of 108 million tons of car exhaust in the same period. Then there is the savings in health care cost. And studies by various organizations suggest that, based on the Netherlands, societies that bicycle more are happier. When one considers that in just 4 months the dollars spent on 11 billion gallons of gasoline would still be in Americans pockets with this 25% scenario, one knows that would have a significant economic impact. Politician could not be counted to support any project that could have such a result. Any campaign would be blasted by a public relations anti-campaign funded by Big Oil. That’s what using customers dollars to keep them customers looks like. It seems the only way to get improvements so more people can enjoy the benefits of riding a bicycle everyday, is to change the value of a bicycle in the minds of enough people that a significant number will support bicycle friendly infrastructure. According to U.S. Census data, 70% of American said they would like to ride their bicycles more. But how would we get people to act on those desires? My hope is in the youth that are not yet gasoline customers. This is what I would improve for cyclists. The education of the next generation, on the benefits of riding a bicycle eveyday, and the real cost of driving a car powered by an internal combustion engine. There is not any reason I can think of, why a society wouldn't want it's children to learn why the bicycle is one of the most beneficial, yet overlooked inventions in human history. ",
            "date": "Answered April 30, 2019",
            "views": "384",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Bo Hendricks",
                    "user_href": "/profile/Mark-Bo-Hendricks"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathaniel Cleland (נתנאל כלילנד)",
                "href": "/profile/Nathaniel-Cleland-נתנאל-כלילנד"
            },
            "answer_text": "Well, I cycle a lot. In an ideal world, I wouldn't particularly want segregation. I'd be happy to just use the existing road infrastructure. If everyone could get along. If drivers of 1+ ton of metal never made mistakes. If they gave me 1.5 m (5 ft) when overtaking, and didn't overtake towards junctions, blind bends, that sort of thing. But the world isn't ideal. Good infrastructure in cities would be nice, but traffic in cities is slow. It's much easier to mix with city traffic travelling at 20 mph than busy intercity routes with 60 mph limits. At the same time, city drivers can be maniacs… Education. It's not compulsory to use the cycle routes. They're often OK if you're travelling at 10 mph, but, if you cycle at 20 mph like me, they can be downright awful. It's safer to stay on the road at such speeds. It would be good if drivers understood this. Overtaking safely, too. Good cycle routes (i.e not yielding at every side road) would be amazing, but that doesn't seem to be the done thing in the UK. Quiet 20 mph roads (or 30 mph, but 20 is better), with patient drivers, are a good substitute. Regarding intercity journeys, I love doing these. However, navigation of back roads isn't easy, and main roads are busy. Sometimes, there are nice quiet A roads, but it's at the mercy of the Strava hive mind. Sustrans do some long distance routes, but they're not always suitable for road bikes. I'd like nice wide dedicated bicycle highways with a tarmac surface (Holland has something like this). Maintenance wouldn't be huge, and they could use the general routes of the existing motorway network. However, rail travel is more practical for intercity commuters, so this would be the preserve of lycra-clad roadies. I wouldn't mind paying a toll to use such routes!  The dream  Good, by UK standards. This is adjacent to a motorway, crossing the River Severn. ",
            "date": "Answered August 2, 2019",
            "views": "356",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Mccullough",
                    "user_href": "/profile/John-Mccullough-26"
                },
                {
                    "user_id": "Shivaraj",
                    "user_href": "/profile/Shivaraj-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Virgil Garcia",
                "href": "/profile/Virgil-Garcia-2"
            },
            "answer_text": "I would like bycycle specific infrastructure. Not after thought bike lanes on normal roads, but actual 6 or 8 foot wide paths away from normal roads. The idea being that if I decide to go 2 towns over on my bicycle I could ride a mile or 2 to the bike highway, hop on, pedal for a while, and hop off in the town I was aiming for Alternatly I would like to see normal roads built with seperated bike lanes, complete with physical barriers that would keep cars out of that space, as can be seen in the neatherlands Another thing I would like to see is more space alocated to secure bicycle parking. Not necessarily dedicated buildings, but more good bike racks in well traveled spaces, and perhaps a secure room in most workplaces to park a bike. If its feasable to ride a bike to and from work, but there is no way to secure your bike safely, its no longer feasable to commute by bike. Truely secure bike parking is probably not feasable in the short term, not enough people ride to make it a priority in most places. However, if there were infrastructure improvments that encouraged more people to ride, it becomes very possible that in time, many buisnesses would bend over backwards to offer such a perk to their employyees and customers Another rhing I would like to see is some legeslative changes acknowledging the differences between a bicycle and a car. Such as rules specificly allowing for cyclist to treat red lights as stop signs and stop aigns as yeilds. Such laws, where they have been implemented have proven to increase rider saftey, and reduce congestion. Last but not least, I would like to see driver education improve, and even a rider safety course implemented, to make drivers more aware of the hazzards faced by cyclist, and to ensure new cyclist are aware of the hazzards they will face. An emphasis on measures a cyclist should and should not take to protect themselves0 from traffic. Last (for real this time) I would love to find a decent taillight that functions as a turn signal. Something very robust, with amazing battery life and very bright lights that clearly shows any body behind tlme that I am definatly planning to turn or take the lane, or change lanes. Such signals exist, but I have yet to find one that seems to be worth the cost( if any one knows of a legit worth while bike turnsignal, please feel free to offer up a suggestion) ",
            "date": "Updated August 16, 2019",
            "views": "178",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Vaisey",
                "href": "/profile/Frank-Vaisey"
            },
            "answer_text": "If I could pick anything, no matter how unlikely, to improve for cyclists it would be the attitude of people on the road who feel that cyclists have no right to share the road with motor vehicles. The laws seem fair enough. Some municipalities are actually spending money on make space for cyclists. Still there is a vocal minority of people who will crowd cyclists, yell or insult riders or actually throw garbage at them. Assuming that the people who actually go so far as to say something are the tip of the iceberg of people who resent cyclists, I would like to see cycling embraced as good for health and the environment by everyone. ",
            "date": "Answered May 6, 2019",
            "views": "104",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Sinclair",
                    "user_href": "/profile/Michael-Sinclair-95"
                },
                {
                    "user_id": "Jesse Curry",
                    "user_href": "/profile/Jesse-Curry"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Joosse",
                "href": "/profile/Chris-Joosse"
            },
            "answer_text": "Better infra. Bike paths that go where you need to go are a difference-maker. I’d let my kids ride their bikes to school if I thought they wouldn’t be killed en route, but I think what passes for a bike right-of-way (a paint stripe with wear marks from encroaching vehicle use) isn’t nearly adequate. Having lived in places with excellent bike infrastructure (like separated pathways) I think it’s a shame so many places think about bike infra like it’s a zero-sum undertaking (meaning: if they get any of this, the rest of us get less of something else)- and this in turn means we’re all stuck sharing roads that aren’t well-enough engineered to make that sharing safe or easy. That’s a recipe for angry, frustrated people that think cyclists should just go away. If you build it, they will come. If you don’t, they will be on the road. ",
            "date": "Answered April 29, 2019",
            "views": "368",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jesse Curry",
                    "user_href": "/profile/Jesse-Curry"
                },
                {
                    "user_id": "Ken Eng",
                    "user_href": "/profile/Ken-Eng-1"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Joe Guerrero",
                    "user_href": "/profile/Joe-Guerrero-17"
                },
                {
                    "user_id": "Sean Quinn",
                    "user_href": "/profile/Sean-Quinn-41"
                },
                {
                    "user_id": "Laurn Bedingfield",
                    "user_href": "/profile/Laurn-Bedingfield-1"
                },
                {
                    "user_id": "Patricia Cooper",
                    "user_href": "/profile/Patricia-Cooper-18"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                },
                {
                    "user_id": "Holly Robertson",
                    "user_href": "/profile/Holly-Robertson-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregg Senne",
                "href": "/profile/Gregg-Senne"
            },
            "answer_text": "I would expand BART (Bay Area Rapid Transit) to it’s original plan. This would give cyclists access to roads from Gilroy to Santa Rosa on both sides of the bay. It would also reduce vehicle traffic, which is a good thing for everyone. And it would encourage people to combine BART with cycling for their commute. The situation for cyclists will improve when more people are cyclists. And the death penalty for bike thieves. Just kidding. Maybe. ",
            "date": "Answered April 29, 2019",
            "views": "97",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "E. Clayton Rowe",
                    "user_href": "/profile/E-Clayton-Rowe"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Hart",
                "href": "/profile/Jon-Hart-11"
            },
            "answer_text": "I’d like to see the driving test revised, so that everybody has to progress from a bicycle, to a motorcycle, then a car, van, lorry and finally bus. You could stop at any level, but not skip any. And you’d have to spend a minimum period on each, of at least 12 months. There are some places in the world where this might be less practical, but given time, they could adapt. I think I became a far better driver after learning to ride a motorcycle. Not just because of my understanding of the affects of other road users, but my ability to anticipate their reactions has become a little bit spooky. ",
            "date": "Answered May 16, 2019",
            "views": "83",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Batson",
                "href": "/profile/Scott-Batson-2"
            },
            "answer_text": "Better informed operators of motor vehicles. Many mistakenly believe that public rights of ways are first and foremost for people driving cars. In reality they are for the movement of people and goods, regardless of the method of transportation. Many people that drive also mistakenly believe that they, and their gas taxes, are the sole source of funding for the construction and maintenance of roadways, using this mistaken belief to belittle anyone using the public rights of way who is not driving a car. The truth is very different: How Are Your State’s Roads Funded? | Tax Foundation ",
            "date": "Answered May 7, 2019",
            "views": "86",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Hart",
                "href": "/profile/Paul-Hart-100"
            },
            "answer_text": "I would make roads more bicycle friendly, and get rid of potholes and broken glass. Road conditions would be my priority. The next thing I would do is increase driver awareness of road safety through public service messages on media. Finally I’d have mandatory jail time for dui’s. A guy that I used to work with killed 2 kids on bikes while drinking a 6 pack in his car with a suspended license. ",
            "date": "Answered May 2, 2019",
            "views": "70",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Bo Hendricks",
                "href": "/profile/Mark-Bo-Hendricks"
            },
            "answer_text": "I would like to see sane urban speed limits.Timed lights, fewer rights on reds, change lanes to pass laws and better traffic law enforcement would save many lives (not just cyclists). Making streets safer for cycling makes them safer for everyone. ",
            "date": "Answered May 5, 2019",
            "views": "73",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jesse Curry",
                    "user_href": "/profile/Jesse-Curry"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Heuston",
                "href": "/profile/George-Heuston-1"
            },
            "answer_text": "Their attention to following traffic laws. ",
            "date": "Answered April 29, 2019",
            "views": "20",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virginia Hanlon",
                    "user_href": "/profile/Virginia-Hanlon"
                },
                {
                    "user_id": "Mark Howe",
                    "user_href": "/profile/Mark-Howe-19"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Mandy Wessen",
                    "user_href": "/profile/Mandy-Wessen"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Robin Harville",
                    "user_href": "/profile/Robin-Harville"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Tracy",
                "href": "/profile/John-Tracy"
            },
            "answer_text": "Personally, I think that bicycle design is lousy. Recumbents are a step in the right direction. If every year the Tour de France would have one leg in which cyclists were allowed to use the latest and greatest designs, including the use of fairings. this would go a long way towards radically improving bicycle design. ",
            "date": "Answered June 16, 2019",
            "views": "82",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brian Slocum",
                    "user_href": "/profile/Brian-Slocum-3"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Daigle",
                "href": "/profile/Chris-Daigle"
            },
            "answer_text": "In a perfect world, everyone would have been taught a comprehensive cycling course before their 10th birthday and would be required to take an equally comprehensive auto driving course before getting a drivers license. That would be the single greatest thing that could be done for bicyclists. ",
            "date": "Answered May 9, 2019",
            "views": "63",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Butler",
                    "user_href": "/profile/James-Butler-386"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Butler",
                "href": "/profile/James-Butler-386"
            },
            "answer_text": "Harsher penalties for dangerous driving towards cyclists. Changing peoples behaviour is incredibly difficult but more legally enforced penalties for bad drivers unfortunately seems to be the only option at present. It would help people already cycling and hopefully encourage more people to take up riding. ",
            "date": "Answered December 28, 2019",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Holt",
                "href": "/profile/David-Holt-126"
            },
            "answer_text": "Cycling lanes, they rarely offer much protection from motorists who think it is part of the road, in the UK anyway. ",
            "date": "Answered April 29, 2019",
            "views": "52",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "E. Clayton Rowe",
                    "user_href": "/profile/E-Clayton-Rowe"
                },
                {
                    "user_id": "Max Sklar",
                    "user_href": "/profile/Max-Sklar"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Barba",
                "href": "/profile/Alexander-Barba-2"
            },
            "answer_text": "I am an avid cyclist. I would add more designated bike trails for commuters such as myself. Bike trails away from roads and traffic, and the bike trails would have lights for riding at night. ",
            "date": "Answered September 30, 2019",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Phelan",
                "href": "/profile/Larry-Phelan-3"
            },
            "answer_text": "Their understanding of the rules of the road,which they seem to think dont apply to them. Maybe even BIGGER RED LIGHTS at stop signs. ",
            "date": "Answered April 29, 2019",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajay Patel",
                "href": "/profile/Ajay-Patel-805"
            },
            "answer_text": "A Saftey cone system for high traffic areas with bright reflective material ",
            "date": "Answered April 29, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        }
    ]
}