{
    "title": "What are the Future Technology trends in automobile & Automotive industry? - Quora",
    "tags": [
        "Automobile Industries",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robin Joseph",
                "href": "/profile/Robin-Joseph-126"
            },
            "answer_text": "We may not yet have flying cars but we are on the verge of a technological revolution where manufacturers can rectify all the mistakes at the production stages and provide you with a safe ride. Internet of Things solutions in the automotive manufacturing offers user with the car, integrated with the sensors which detect any fault in the car. Manufacturers have already started to use virtual and augmented reality to optimize the flaws of the manufacturing process. But the most important trend would be Automotive Software Solutions. Onboard Detection Enterprise Fleet Management Solutions OEM Connected Solutions These are not just some fancy titles but solid trends that will be most anticipated in 2019. If you wish to learn more about these Automotive Industry Solutions then I suggest you read the blog Why Automotive Software Development is a Need of the Hour for the Manufacturing Industry?. ",
            "date": "Answered December 21, 2018",
            "views": "647",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anchal Malik",
                    "user_href": "/profile/Anchal-Malik-8"
                },
                {
                    "user_id": "Vijay Rajput",
                    "user_href": "/profile/Vijay-Rajput-260"
                },
                {
                    "user_id": "Abinash Mallik",
                    "user_href": "/profile/Abinash-Mallik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Kumar",
                "href": "/profile/Ashish-Kumar-1674"
            },
            "answer_text": "Here i am giving you the list that automotive technology wants to adapt in next 10 years of time.I have gone through various automobile company just to look what they do? and what are the trends? They are as follows: India wants to adapt technology of BS4 to BS6 till 2020.on an introduction of bs6 the pollution rate will be as minimum as possible.We all are aware of the fact that some day there will be a wave of electronic cars in India.Till the introduction of electronic veichle in India we will have veichles heavier in mass.Size of radiator infact all the cooling system will be increased.Different way of Exhaust gas recirculation will be introduced after 2020.More effective and much efficient way of combustion will be introduced.Leaving these technicalities . you would have a better network of gps,wifi,bluetooth etc… Automotive world has changed alot and changing very differently. ",
            "date": "Answered November 2, 2017",
            "views": "17",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Samrat Dutta",
                    "user_href": "/profile/Samrat-Dutta-107"
                },
                {
                    "user_id": "Santhosh Kv",
                    "user_href": "/profile/Santhosh-Kv-24"
                }
            ]
        }
    ]
}