{
    "title": "What are the best tech gadgets under $100? - Quora",
    "tags": [
        "Tech and Gadgets",
        "Gadgets (technology)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Arnold",
                "href": "/profile/Mike-Arnold-71"
            },
            "answer_text": "UPDATE: This is a long answer, and it’s been collapsed once for lack of attribution. There is no way to attribute the findings contained herein, as they are all my own. What you see here is my personal list of interesting inventions and technologies. Some of them I found through my work, others I found in the technology and new-gadget press over the years. Some, in fact, my wife bought for me. All of these are items I have either personally tried, had experience with or read about on the same pages I link to for each item, and I receive no compensation, perks or attention for having compiled them. As Malcolm Gladwell described in his book ‘The Tipping Point,’ there is a type of person, whom Gladwell calls a ‘maven,’ who collects information and from whom others get said information. I have been informed that I fit this description. This is not an inappropriate attempt at viral advertising, nor is it unattributed research. This is just a Gladwellian maven, industrial engineer and safety manager doing what we do, and my only hope in posting it was that other people, who are or may later face problems these technologies have helped me solve over the years, may also be helped by them. I earn nothing but perhaps an upvote for this, that and the satisfaction that my amusing little gadget-list may help, or at least amuse, my fellow humans. After all, I’m an engineer. Collecting gadgets is one of our favorite activities. The Toolbox  The best multimeter ever – Mooshimeter Most multimeters are the size of wallet or a book, and can only display information in a string of digits. You must be within a foot or two of what you want to measure, have three hands, and the meter can’t save the information it displays any better than binoculars can. The Mooshimeter changes all that. It’s a bit smaller than a normal meter, runs for six months on two AA batteries and connects wirelessly to your cell phone. This means you can tuck it under the hood of your car and monitor that finicky electrical hiccup while driving down the highway at eighty miles per hour. It also records up to six months of data, so you could record voltage and current (yes, both at once) on a given circuit breaker to compare spring vs summer AC usage at home. The auto ranging display also makes diagnostics much simpler by showing complicated information in a simple graphical format. Take a look at the link above to see all the details.  GammaPix is a free ap for Apple and Android phones that uses the CCD camera in the pone as a crude geiger counter to detect nuclear radiation. It takes about 60 seconds to get a reading, but if you have a phone, you now also have a radiation meter. Seriously, who doesn’t want this?  Steel wire banding tool strong enough to clamp a hydraulic hose on – Clamp tight Clamp tight is like having hundreds of high quality stainless steel hose clamps, zip ties, and fasteners of every time, yet still it still fits in your toolbox. This thing was developed for use on ocean sailing boats as there tend to be very few hardware stores floating out at sea, and boats break down like everything else. To use it, you wrap the wire around the piece to be secured, then around the tool. Turning the bolt pulls the slack out of the wire then rotating the tool locks the wire down like a giant copy of the wire tie that holds a bread bag closed. It does have one obvious weaknesses – you have to have enough clearance to rotate the tool, so some automotive repairs are out of the question because there just isn’t enough room. Overall though, it would be tough to find a more compact and lighter way to repair so many different breakdowns.  Nice self-contained butane soldering iron the size of a highlighter – Weller$50 I can’t vouch for this one personally, but a small reliable iron that heats up in seconds and can be used on no notice anywhere it’s needed is a huge help. How often have you needed an iron, but not had a ready plug and stand for it where you were working under the dashboard of the car?   1800 Lumen rechargeable flashlight by Nitecore $55 Growing up, ‘flashlight’ was a word that meant ‘that big heavy plastic thing we keep in the kitchen drawer that glows a dim yellow and always has dead batteries when we need it’. No more. Nitecore makes a variety of good lights, but this is the one I keep clipped to the lip of my pocket. Because I work with my hands, I like to be able to see what I’m working on, and very few things break down in the middle of a well lit work bench in the garage. When something needs attention, it always seems to be at night, up underneath a dashboard, deep in a computer cabinet, or some similar difficult to see location. Since I got this light I’ve never had trouble seeing what I’m doing. It has the usual high/medium/low settings with some flashing options for emergency use, and when I need everything it can do, 1800 lumens is as bright as four car headlights. The battery usually goes a month or two between charges, and any 18650 charger can recharge it in a few hours.  Paper thin microscope lens that sticks to your cell phone - Blips The link says it all – this thin slip of plastic the size of a post-it note will turn your cell phone camera into a microscope. Useful for outdoor adventurers, detectives, teachers and anyone else interested in the world around them.  $6.50 tiny pocket telescope you can carry everywhere - DX This inexpensive tool weighs next to nothing and is tiny enough to fit in anywhere. Good for tracing wiring in a high ceiling, aircraft or bird watching, hiking, playing spy with the kids, etc.  Pipe style building materials that use electrical conduit at $3.50 per 10ft section – Maker Pipe There are many build systems that can be used to build anything, but most of them like 80/20 cost a fortune (think $15 per ft!). Maker pipe uses simple, inexpensive clamps plus cheap 3/4inch electrical conduit to build nearly anything you could imagine. If you need to build anything from carts to furniture to equipment, give this one a look.  Must have Chemical identification – WISER web site and WISER appdownload WISER is a chemical identification book long carried by firefighters who need to quickly find out: “what’s in that burning tanker truck, and what will it do to us?” The book used to cost less than $20, but today the entire program is available for free download as the WISER app. If you ever find yourself facing a mystery chemical spill, do you want to be one of the clueless people wondering what to do, or do you want to be the person who looks up the chemical in the first thirty seconds and tells everyone what it is and what you have to do next? The app is free and will happily wait on your cell phone until you need it; don’t be clueless, be WISER.  Interesting ring knife for people who open a lot of packages – Handy Safety Knife This product is intended for people who use hand knives to open a lot of packages. It is inexpensive, disposable, and always to hand. There are plenty of places these would be unsuitable (any workplace with powered conveyors or equipment comes to mind), but the idea is so unique it deserves to be included for the one person who has the problem this tool answers.  Two way radios for $15 instead of $300 – It turns out that two way radios have gotten a lot cheaper over the years, but just as a teenager can charge grandma money to fix her computer, so the contractors that most companies get their radios from are not in a hurry to tell everyone how easy the job has become. BaoFeng radios cost between $15 and $30, and do everything you expect from a walkie-talkie, but unlike what you’re probably using now, BaoFeng uses better equipment and lithium ion batteries standard. This translates into much longer run times and better performance. The simple $15 radio and more complicated $30radio can be found here, along with the cable used to program them. This link herediscusses how to do it. Travel  A handy power strip for world travel – Power donut A power strip that is tiny, travels easily, and adapts to different electrical systems around the world. Medical tools - Link to more medical tools  Emergency blood stopping powder, a must have for first aid kits - Celoxand how to use This product is used to keep someone alive long enough for the ambulance to arrive in the event of severe bleeding. It forms a jell to stop blood flow at the injury and comes as powder packages, bandages, or a syringe full of the powder for gunshot wounds. Pioneered in the US military, this is one of several good haemostatic products that are must haves for any serious first aid kit. If you own a gun or a knife, does it really make sense to be totally unprepared for the results of gun and knife wounds?  Emergency blood stopping pack – a second choice after Celox - QuikClotand how to use QuickClot stops severe bleeding by absorbing the water out of blood, thus causing the clotting agents to become super concentrated at the injury site and stop the bleeding faster. As with Celox above, this will help keep someone alive long enough for the paramedics to arrive and save them.  Liquid band aid – a cheap, generic must have for first aid kits – example link This is a generic product for minor to moderate injuries that sterilizes a cut and protects the injury site like a band aid. Good for use on tight locations that flex where band aids wouldn’t work. Because of its utility and tiny size it’s a good addition to any first aid kit.  Betadine – inexpensive sanitizing solution for cuts used by EMT’s - Link In the old days parents used to use iodine or alcohol to clean and sterilize small cuts and scrapes (hydrogen peroxide will bubble dirt out of a wound, but it does not sterilize). Today we all have access to the same inexpensive product nurses and surgeons use; Betadine. It cleans and sterilizes wounds with much less burning than the old options, and most of us are familiar with it already as the brown skin staining wipe that doctors use before drawing blood.  3D4Medical – awesome free to $50 anatomy app Amazing anatomy software good enough to train doctors but simple enough for consumers to use. Incredibly complex 3D anatomical models that can be sliced, searched and moved to understand how our bodies should work and how they can fail. When you talk to an auto mechanic, the smart consumer brings the manual along to show what’s wrong. Is your body less important than your car? Tech off the grid  Clean burning hyper efficient cook stove – see video The Aprovecho Research center and Envirofit designs and sells extremely efficient cook stoves for camping and long term use in the third world. These stoves have a core made from lightweight clay that reflects heat back into the fire box, allowing a few sticks and twigs to burn hot and clean with no smoke. The top of the stove is built to channel the hot gasses onto the cooking pot for maximum heat transfer with minimal fuel. To first world campers this translates into a neat (if heavy) stove that can burn almost any handy material to boil water and cook. For church groups and other organizations working in the third world these stoves are a way to drastically reduce expenditures of time and money on fuel for cooking – see video. For large orders, the stoves can be shipped in by cargo canister at prices as low as $5 a stove for the bare clay core that actually makes the unit work. Anyone that has to think about where their cooking fuel comes from could benefit from this technology.  A light that runs on gravity like a grandfather clock – Gravity light Gravity light is a small generator that uses a sack full or rocks to produce electricity for simple indoor lighting. Just like a grandfather clock, as the weights descend their energy turns the mechanism, in this case turning a generator to drive the lights. While campers can use this product, it is intended for the third world where indoor lighting after dark means kids can learn to read and go to school. Anyone living without electricity could benefit from this product.  One way to internet everywhere – Outernet Outernet is the best of the internet, broadcast one way only to earth from a satellite. The ‘Lighthouse’ model mounts to a standard direct TV dish and downloads many MB of data per day, while the ‘Lantern’ is a portable solar powered device that can travel anywhere and downloads at a slower rate. Both access the same information such as educational materials for students, warnings about local emergencies, weather forecasts, censorship free news, etc. Outernet devices slowly download this information and then allow users to log in and browse what is stored locally. The downside is that the data flow is one way only, but the upside is the system works as an end run around missing power and data infrastructure as well as censorship rules.  Clean drinking water from any source - Lifestraw Access to safe drinking water is essential to health, and many of the worst diseases spread via contaminated water. The lifestraw family of products is invaluable to hikers and those working in the third world because it allows anyone to turn dirty water into clean safe water. The absence of safe water doesn’t just kill and sicken people, it drags down their finances, ensuring that those in crushing poverty stay there caring for the sick rather than using that time and money to send children to school.  Freshwater from saltwater – the water cone. A simple plastic cone that makes 1.5Lts of freshwater from saltwater.  Water transportation from river to home – Water wheel In some areas of the world, even getting water to the home for cooking and bathing is a major job that pulls time away from education and other productive tasks. The water wheel cuts that time in half and improves quality of life.  Fold-a-scope The one dollar paper microscope that fits in your pocket and is good enough for lab tests.  The Paperfuge A centrifuge that works anywhere without power and achieves 125,000 RPMs. Under development for malaria testing. Development documents on how to build one. Also, here’ s a video interview with the inventor explaining them: Kitchen Tools  Portable drink carbonator – Bubble Cap A hand held drink carbonator that accepts standard CO2 bottles and standard soda bottles unlike the SodaStream. Parents corner  $100 Life saving product to prevent SIDS in infants - Snuza Hero - If you or someone you know has a child under a year old, this is the most important thing on this page. The Snuza Hero clips onto an infant’s diaper to monitor motion and breathing. If no movement or breathing is detected for 15 seconds the device vibrates to wake the baby, but if nothing is detected by 20 seconds it sets of a loud alarm. When SIDS kills a baby, all too often it happens in the middle of the night when both parents are asleep and it’s completely silent. Without some kind of alarm it’s almost impossible to intervene in time, so this can be the most important $100 spent on your baby. It saved our daughter’s life, and a quick read through the product reviews shows many more parents with similar saves.   Kingii flotation wrist band $90 After losing a relative to drowning, this engineer designed a wrist band that uses common CO2 cylinders to inflate an air bag for emergency flotation. Unlike a bulky life vest, this thing can be worn easily in or around water, and if used in an emergency it can be easily repacked and reloaded after saving a life. It’s suitable for kids and adults, and easy insurance when working around treacherous bodies of water. Roughly 372,000 people drown every year, and $90 seems a small price to protect those you care about.  Wetsuits for kids $35 Most kids love the water, but little little kids inevitably end up shivering and cold even at indoor pools that are comfortable for adults. The problem is that children have lots of surface area to lose heat through, but very little volume, meaning they get cold very quickly and can’t swim as long as they’d like. A wetsuit like this one fixes that problem and drastically reduces the area needing sunscreen as well. If you’d like to guarantee your child sleeps soundly through the night, consider one of these to turn a one hour trip into a real afternoon outing.  Free math and school tutoring - Khan academy - promo video Khan Academy helps anyone at any level learn about math, science, and a variety of other school subjects using recorded lectures by skilled professors combined with interactive tests and automated tutoring. It’s hard to oversell this site; everything is free to use, nearly all subjects are covered, you can log in as a student, parent or teacher to monitor progress, and the site even has test prep for all the major tests like SAT and MCAT. The math section that started the site is particularly clever – when a student first logs in they take a ten question test that helps the program figure out their skill level, and then it suggests new math topics and tracks progress while periodically refreshing old topics as well. If you know anyone in school as a student, parent or teacher, tell them about this program. Odds are good they’ll thank you for it.  Modern States . org is a way to earn your first year college for free. Also, the ‘big three’ as mentioned by Lee Knott derserve a mention here: “The “Big Three” are regionally-accredited colleges that award massive amounts of credits via testing. They are THE most flexible way to get your degree, both in terms of time and credit. You could start from 0 credits and get your entire degree in less than a year. Most state colleges will limit you to 30 hours, but you used to be able to test out of your entire BA/BS degree via testing. You would do 60 hours via CLEP and then the last 60 hours via a GRE subject test. Charter Oak is a state university in CT, Thomas Edison is a state university in NJ, and Excelsior is a former state university in NY. Same regional accreditation as Yale, Princeton, and Columbia This means there’s no residency requirement. It’s more limited now, and I believe all three require you to take a capstone class online with them before graduating. But think about being able to aggregate credit from a number of different sources. You can transfer in any regionally-accredited classes, DANTES, CLEP, ALEC, StraighterLine, Saylor, ACE-accredited, even free FEMA credits. That means if you take continuing education courses for work you will probably get college credit as well. You can also do a “portfolio” and get credit. This means demonstrating mastery that you learned outside of formal education. Perhaps you play guitar or piano. You write up a portfolio proposal, record yourself, get credit. Some of the colleges also offer credit banking services. Say you haven’t graduated from anywhere, but you have significant credits. Transfer them all to one college and have them all transcripted on one official transcript. They are perfect schools for people who move a lot, military, older adults, and homeschoolers. Many homeschoolers earn their BS through Thomas Edison State while they are still in high school. Lots of them use free Saylor classes to fulfill both high school and college credit. To get ACE credit, you pay $25 and take a proctored exam online.”  The drug talk – “Licit and Illicit Drugs by consumer reports” The do’s and don’ts of drugs are usually right up there with the ‘sex talk’ when it comes to uncomfortable conversations parents really need to get right, but often put off or miss altogether. Fortunately, consumer reports wrote an excellent book on the topic which is available for free online. The organization has a well earned reputation for impartiality, and it shows as the book talks about what each drug does, how it was discovered, and how it got to be legal or illegal. Having the facts makes smart choices possible, and this free resource is a must read for anyone over ten.  $1.25 calculator wrist watch loved by grade school kids – Link Kids 5th grade and younger find these to be the height of fashion and prestige. If you want to reward a child with an inexpensive gift that will help them academically, search Google for ‘calculator watch’ and order a few.  How to get started in life and live well on less - Poorcraft. Unless you’re lucky enough to start life as a millionaire, most of us have to start out on very small incomes working long hours at unpleasant jobs. There are scams and businesses beyond count built to take advantage of the young and un-educated. If you or someone you know earns less than $50,000 a year, spend $5 and get this book. It’s an easy-to-read graphic novel packed to the brim with useful tricks and tips, plus plenty of humor to keep things interesting.   (Cartoon thanks to xkcd) Kerbal Space Program - Link This game is a great way to build STEM interest in children and adults as you run a space agency for the ‘Kerbals’ and try to land on the moon or go to mars. All technology in the game also exists in the real world, rockets can be built from parts like Lego bricks and all the physics are as close to real as they can make them. Google Sky, Moon and Mars + Stuff in space, Impact earth, LightYear FM, Chronozoom, the 100,000 stars project and the scale of our solar system and the scale of the nearest stars. Bit of an astronomy dump here, but if you want to learn about our universe or teach your children, these are excellent resources. Google Sky, Moon and Mars let you explore these places in the same way Google earth explores the globe. LightYear FM shows how far into space various radio shows have gone, Chronozoom shows the entire history of the universe and the 100,000 stars project is an accurate, searchable 3D model of the nearest 100,000 stars to the earth, and the ‘scale of the solar system’ video shows how small we are by building a huge model in the desert. FanFiction.net and Archive of our Own This is a good way to encourage reading and incentivize writing practice. For any book, movie or TV show, there are fans who write stories about the canon, such as ‘what if she did this?’ or ‘what if this happened this way?’. These works of ‘fan fiction’ can read just like the original work, or can be very different with only characters from the original work. Everyone enjoys some kind of media, and FanFiction is a good way to get them reading about something they already like. In many cases, the instant availability of interesting reading material on any internet capable device boosts reading skills and sets up a situation where writing is undertaken enthusiastically and for fun. We’ve all seen people type out angry rants when ‘someone is wrong on the internet’. Fan fiction sets up situations where the reader will find a story about characters they’re very invested in and say ‘This story is awful! I could write a better story that this!’. And they do. And the posted story gets comments about what the brand-new author needs to work on. And so they write some more to show them, show them all. After several months the same student who had to be forced to write a three page paper will be feverishly banging out ten page chapters twice a month to keep their fans happy.  NSF test The National Science Foundation periodically surveys the public to see what they know about science, and the results usually aren’t pretty. The link above is to the ten question NSF test and a series of answers, essentially a canned lesson plan for anyone running a science class at any grade level. The printed test fits on a single sheet of paper and can be used to quickly find out how much your students know and catch up those who have holes in their understanding. +Chemistry article referencing the periodic table and nuclear table How different engines work Anyone teaching STEM classes or with an interest in engines may find these animated diagrams useful. They’re not the most detailed, but they cover many different basic types of engines. This link shows the standard four cylinder auto engine in more detail. And this link shows more of the peripheral systems like cooling. Mechanical link. Fun projects  The Long Now foundation building a clock that will run for 10,000 years. The long now is a society dedicated to long term thinking, which involves several projects including a four story tall stainless steel clock that will run for 10,000 years, a project to record all human languages, and another to record old computer operating systems for backwards compatibility. Hundred year time capsule for a dollar A simple article on how to build a time capsule from a wine bottle that will last for one hundred years or more. This is a quick afternoon project that lets anyone from grade school kids to adults send a message to people decades or centuries in the future.  Software defined radio – see and hear everything on every channel with this thumb stick We all know AM and FM radio from cars, and some know more types of radio like citizens band, ham radio, etc, but until recently, receiving on more than one channel required many different radios. Not anymore. Software defined radio uses a computer to translate the signal, and this model costs $25, is the size of thumb drive, yet can receive anything from 500 Kh up to 1.7 Gh. In automotive terms, this would be like a car that could fly, drive, float on the water, dive under the water, rocket into space, yet it fit in your back pocket and cost $25. If you’ve ever thought about dabbling with radio, it’s never been cheaper or easier than this.  Learn to knit… steel rings into medieval body armor – ringlord.com Anyone into the SCA may find this old news, but some people still make armor and jewelry out of steel rings called chainmail. This site sells everything necessary to weave just about anything you want to make.  Incredibly powerful magnets designed for particle accelerators – United Nuclear For all your incredibly powerful magnet needs. These magnets were intended for use in physics labs, and while prices range from $80 to $200, they are strong enough to amputate an arm if careful handling is not used.  Magnetic wedding rings for magicians – Super magnet man These magnetic rings look and feel like normal jewelry, but can be used in magic acts. I have been informed that it is theoretically possible for a cashier to use one to demagnetize a particularly abusive or obnoxious customer’s debit card, though I don’t know of anyone who has. While there are many potential applications, take care not to touch your wallet while wearing one.   Multitool business card – about $1 per card to be remembered by clients/employers – Card + Label (Avery 5317) Business cards tend to lead short lives, but they don’t have to. The listed multitools are the size of business cards, yet they can perform a variety of useful functions, and with the addition of the linked label, they can easily become unusual, useful business cards. If you think it’s worth one dollar to have a client keep your card in their wallet for the next five years, consider some of these. (My then-fiancee made my first batch for me as a college graduation present. Not only have they proved impressive for networking and business purposes, but my wife still designs all my business stationery.)  Gallium – the inexpensive liquid metal that turns aluminum to mush. This one is largely self-explanatory – got something aluminum you don’t want in one piece anymore? Try Gallium!  Ultimate privacy monitor – no one can see your computer screen but you! – Hack how to This clever hack is useful for those who need a privacy monitor. Essentially, all monitors have a thin skin of polarizing plastic in the display to produce a useable image. If you take the monitor apart, peel off this layer and apply it to a set of glasses, only the person wearing the glasses can see the screen – everyone else just sees a blank white light.  Millennium-Disk or M-Disk $5 a disk, $50 for the burner drive An M disk is a CD, DVD, or Blue ray disk made from a stone like material that will read in any conventional drive but retains its data for 1000 years. Most disk media becomes unreadable after a few years of storage, and the same holds true for magnetic hard drives and solid state drives like thumb sticks. Up till recently there wasn’t any way to preserve digital material short of constantly transferring it from one machine to another. Now it’s possible to send video and photos into the future through time capsules, well wishes with our lost loved ones through coffins, or just archive important documents for years to come. What do you want the world to remember when you’re gone?  Krav Maga This is an unarmed combat system developed by what became the Israeli army to deal with NAZIs in the 1930s. This is not a ‘martial art’ full of training dances and karate chops against empty air, it’s a way to take down an attacker trying to kill/rape you. It was built to defend an oppressed minority from F-ing NAZIs and it works, so it’s ideal for children, women, and many others.  The slingshot channel. Yes, this is a thing. If you want to see things hit by overpowered homemade slingshots built by an engineer/body builder and his wife, take a look.  How to build a potato cannon for fun and ballistics demonstrations – spud gun & Pumpkin chucking For everyone who ever wondered how to build an air cannon to throw potatoes, here is an expert. See also Pumpkin chucking for similar designs.  Pocket sized slingshot $20– Pocket shot A remarkably tiny slingshot that still throws for distance.  Cheap disposable pepper cannon $40– Pepper blaster - test video A tiny but highly effective way to deliver capsaicin to the face as cheaply as possible. While not a firearm, the device uses percussion caps to propel the pepper sludge, meaning it works at any temperature, in the rain in the wind, and doesn’t need to be charged up like a battery or a pressure can.g.  Automotive DashCam by ‘Boomyours” for $60 This strangely named camera of Russian manufacture is an indispensable tool for any car. When paired with a $5 micro SD card and adapter (not included, must be purchased separately or it won’t run), the camera suction cups to the windshield like a GPS and records everything happening inside the car and visible through the front window. It starts up as soon as the car starts, records about a month of driving, and automatically overwrites the oldest videos so no action is required by the user, just plug it in and forget it. If you are hit by another driver, now you have video of the other person’s mistake and no amount of lawyers can change who is at fault. “It was my fault because I was on my phone? No, actually, the video clearly shows you hit me and I was not on my phone. That, and the GPS and G-force data shows where, when and how hard you hit my car.” In addition to crash uses, the camera also records what happens during a traffic stop, and many users find the police are more polite when they are being recorded. If not, well, you now have video of exactly what happened and YouTube is free. Finally, the micro-SD to SD card adaptor allows you to quickly pull the card after a hit and run, put the video onto the responding officer’s laptop, and show them exactly what happened within minutes of the accident, resulting in an APB and a much higher chance of catching the hit and run driver.   RainX to improve visibility in wet/snowy conditions - $3 bottle lasts for many years Most people already know about RainX, but if you are one of today’s lucky 10,000 to whom this is news, then read on. Being able to see while driving is pretty important, and RainX makes the task much easier, especially in hard rain or snow. Basically it’s a wax you rub onto your windshield in two minutes using a paper napkin or whatever you have handy in the car. Just as water beads up and runs off a waxed car, the same thing works on glass. The bottle above doesn’t leak like the spray bottles do, and can be tucked into the door compartment and re-applied every three months or so. One $3 bottle will often outlast the car it’s kept in, and it’s a cheap way to reduce the risk of a road accident.  BlueTooth OBD2 car diagnostic scanner for $7 This tool links to your Smartphone using the Torque app and allows you to read and reset trouble codes and check engine lights. It’s a cheap but invaluable tool, and great to have in any glove box. Convert your car to run on French fry grease – Golden Fuels For those interested in free fuel, Golden Fuels sells all the equipment needed to run your diesel truck on waste vegetable oil. The process is simple enough, mainly centered around filtering, and if you find yourself driving many miles in a diesel truck, using McDonalds as a fuel stop can be quite appealing. Thank you for reading, I hope you found something interesting : ) ",
            "date": "Answered November 8, 2018",
            "views": "792",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edmund Burke",
                    "user_href": "/profile/Edmund-Burke-19"
                },
                {
                    "user_id": "Uzzal Robiul",
                    "user_href": "/profile/Uzzal-Robiul"
                },
                {
                    "user_id": "Harbhajan Singh",
                    "user_href": "/profile/Harbhajan-Singh-455"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sara Bennett",
                "href": "/profile/Sara-Bennett-46"
            },
            "answer_text": " To my mind the nest tech gadget under $100 is Pen micro HD camera - Esonic CAM-3HD ",
            "date": "Answered June 25, 2018",
            "views": "104",
            "upvotes": " View Sharers "
        }
    ]
}