{
    "title": "What are some ideas on the topic of technology advancement? - Quora",
    "tags": [
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jay Karan Telukunta",
                "href": "/profile/Jay-Karan-Telukunta"
            },
            "answer_text": "When you particularly ask about the technology advancement, the trend now a days is IoT and artificial intelligence. IoT: Simply speaking, having control over ‘everything’ required using internet . For example ; A family having father ,mother and a kid. Both parents are damn busy with their office stufff. The kid is young that he may not be able to his work until he or she is asked to do. Once the parents couldn't able to make to home due to a hectic schedule. The kid arrives from school then, how will he be able to manage his work ? Any clue? Here comes the usage of IoT. As soon as he enters the home.The door is locked with the help of a smart phone which is with his parents. The refrigerator asks the kid to take his snacks , milk stuff,etc, and if the kid wanna eat quite a large quantity of chocolates for example, the parents monitor from their mob and warns him * _ *. The Television can be operated by their parents if the kid is too much on to TV as well :P. So, basically what I mean to tell inorder to understand IoT is, u have control over each thing using internet. The other advanced idea is Artificial Intelligence: Uhmm..Okay . Let me quote an example for this . How it works if u ask? For example: Let us take an example of a smart band. A professional x in a certain field meets many people each day. He can't remember each one name who meets him. This smart band is wore by x , whenever x meets a new person by greeting newone with a shakehand and the voice with which he was greeted by other person creates a profile of the newone. So , when ever x meets the newone someother time once again, then x's smart band gives a notification to x that this person name is Bla bla bla. This is how secondary intelligence,ie the artificial machine intelligence works. So, hope u understood how the ideas of tech adavcement works in a useful way with above examples. Hope, you would too get something new and a unique idea.. ",
            "date": "Answered February 11, 2017",
            "views": "579",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pavan Thimmavajjala",
                    "user_href": "/profile/Pavan-Thimmavajjala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumnesh",
                "href": "/profile/Sumnesh"
            },
            "answer_text": "There are lots and lots of them but I'll list the ones I think would be too prominent in near future:- Blockchain and associated productsBionics and genetic engineering (which also includes DNA and other bio tech development)Internet of Things and its applications in business environmentNatural language processingArtificial intelligence and it's combination with point number 4Augmented Reality and it's application in data science as inputMixed realityWearables and devices like Drones in logisticsMachine learning and it's application in complex algorithmsMood detection sensors and photo recognition algorithmsAnswer not in specific order of importance P.s. please suggest if I've missed out on something important! ",
            "date": "Answered February 11, 2017",
            "views": "434",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Camz Reyes",
                    "user_href": "/profile/Camz-Reyes-1"
                },
                {
                    "user_id": "Rahul RK",
                    "user_href": "/profile/Rahul-RK-27"
                }
            ]
        }
    ]
}