{
    "title": "What technology has the best chance to give ordinary people their privacy back? - Quora",
    "tags": [
        "Decentralized Networks",
        "Privacy",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Francesco Iovine",
                "href": "/profile/Francesco-Iovine"
            },
            "answer_text": "What is privacy? If you walk by in a street, many people see you and maybe among them there is someone that should not know that you are there in that very moment. From this side the concept of “give ordinary people their privacy back” is not applicable as the perfect privacy has never been among the rights of men. Nevertheless I partially get your point as before these ‘random’ privacy exception depended strongly on the randomness of daily life or on the implementation of expensive espionage techniques, while now it is somewhat passive. The huge processing power of computers and the vast availability of electronic traffic data permits to break passively the privacy of a human being. So the solution is that to get out of this scheme: not using digital media is a way out, but this is only going a couple of centuries back. Yes, you have your privacy back but you live in the past.  If dictators had the current internet technology (for instance in the eastern Germany during the cold war), they would have used it for their terrific purposes, but nevertheless they already had formidable ways con control the citizens, even in the paper-only age. I see a contradiction here: if digital media make breaking the privacy so simple, why do dictators or strong governments (recently it happened in Turkey) block internet? It should be the other way round or not? IMHO, privacy is at risk in the data age, but the data age empowers democracy much more than before. The Big Brother simply does not exist because the enormous entropy of 1–1 communication made possible by internet, makes it useless. As a consequence, I am not worried by the lack of privacy but by the extensive exploitation of social mechanisms that the popularity of internet makes possible. For instance the virality of stupidity. ",
            "date": "Answered June 3, 2017",
            "views": "143",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Terrence Yang",
                    "user_href": "/profile/Terrence-Yang-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yuval Ariav",
                "href": "/profile/Yuval-Ariav"
            },
            "answer_text": "The non-trivial answer is a brain-computer interface. The reality is that technology is, by and large, already up to the challenge of allowing ordinary people to assert their privacy online. From privacy controls on your online profiles to the ability to relatively easily create new burner accounts, it’s pretty much already there for those who seek it. What’s missing is awareness. It’s understandable, really. Two factors play a role here: (a) there is no standard for privacy controls, and (b) the downside is very rarely a matter of life and death. So most people just give up. The interface to controlling our privacy simply involves too much friction. Brain-computer interfaces will change this. For one thing, while privacy of data is something most people classify as “nice to have”, privacy of thought is another thing altogether. Especially considering global trends regarding freedom of speech in both conservative and liberal circles. Additionally, such interfaces will greatly reduce the friction required to manage privacy, enabling effective privacy controls at literally the speed of thought. ",
            "date": "Answered June 2, 2017",
            "views": "852",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arnab Bhowmik",
                    "user_href": "/profile/Arnab-Bhowmik-4"
                },
                {
                    "user_id": "Awais Sehgal",
                    "user_href": "/profile/Awais-Sehgal"
                },
                {
                    "user_id": "Terrence Yang",
                    "user_href": "/profile/Terrence-Yang-4"
                },
                {
                    "user_id": "Alexandre Mercier",
                    "user_href": "/profile/Alexandre-Mercier-メルシヱ-アレックス"
                },
                {
                    "user_id": "Leon Sabree",
                    "user_href": "/profile/Leon-Sabree"
                },
                {
                    "user_id": "Aaron Yip",
                    "user_href": "/profile/Aaron-Yip-2"
                },
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                },
                {
                    "user_id": "Al Simmons",
                    "user_href": "/profile/Al-Simmons-27"
                }
            ]
        }
    ]
}