{
    "title": "What is the age of the Earth? - Quora",
    "tags": [
        "Age of Earth",
        "History of the Earth",
        "Earth Science",
        "Earth (planet)",
        "Astrophysics",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Babu Priyavrat",
                "href": "/profile/Babu-Priyavrat"
            },
            "answer_text": "The age of Earth is unknown. If you believe the latest scientific dogma (this is to invoke curiosity) of 4.5 billion years, you don't have a basic understanding of the evolution of the universe. Earth's core is made of Iron and Nickel. And where do you find Iron in the universe? In the core of dying stars. A star like the Sun takes 10 billion years to die. A star like TRAPPIST can take up to 1 trillion years to die. Some might argue that Earth was formed in the solar system where elements of supernova combine to form a planet. If this is the case, How is it possible that Water on Earth is older than the Sun? Much of Earth's Water Is Older Than the Sun This would mean that Earth's crust would solidify before the formation of Sun and water on the surface is from far-away and not from this solar system. Those who say, the age of the universe is 13.7 billion years ago, they miss the important fact. The age of the observable universe is 13.7 billion years. More reading: Supernova nucleosynthesis - Wikipedia EDIT: Some people have pointed out that in the early universe, a very large Blue-giant star went supernova and converted into Wolf-Rayet star which provided the heavy elements which I agree but it also points to an extrasolar origin of Earth. Most of the material inside the Earth is extrasolar. On the surface, most of the water which is formed later after so-called solidification is older than Sun, which points to aberration in our current understanding that Earth was formed inside the solar system. We should ask : Why we dont find earth like planet in our neighbourhood? Why we end up finding hot Jupiter or Neptune-size planets? Should we start near Wolf-Rayet stars and see if we can find earth-like cousin? If yes, how does Earth end-up 6000 light years away? Wait, there was an ice age of 120 million years when Suspended oxygen in sea dropped? There are so many questions and possibilites which can explain Cambrian explosion, if we try to answer from another perspective: Earth went rogue and it was formed somewhere else.Water vapour from comet 67P, as determined by the Rosetta spacecraft, is substantially different from that found on Earth, which question our underlying the current theory as much of water came from comets.Rosetta (spacecraft) - Wikipedia. The mantle composition of Earth doesn’t match with chrondite meteorite.This answer which raises questions about the age of Earth with available scientific resources and my limited knowledge pool has agitated scientists to very core. My attempt to engage in discussion are resulted into outright rejection, fights or invitation to join the fighting ring in academia. I dont want to get adjusted by peer pressure as I’m fiercely independent person.After a great thought, I’ve accepted the challenge and will be working towards theory that Earth went rogue and might have not formed in the current solar system. I might be wrong but it’s worth a fight.",
            "date": "Updated April 6, 2020",
            "views": "75",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Martin",
                    "user_href": "/profile/Steve-Martin-325"
                },
                {
                    "user_id": "Ravi Shankar Kumar",
                    "user_href": "/profile/Ravi-Shankar-Kumar-32"
                },
                {
                    "user_id": "Chakra Simhan",
                    "user_href": "/profile/Chakra-Simhan"
                },
                {
                    "user_id": "Ben Letto",
                    "user_href": "/profile/Ben-Letto-2"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                },
                {
                    "user_id": "Kuldeep Kalia",
                    "user_href": "/profile/Kuldeep-Kalia-3"
                },
                {
                    "user_id": "Dushyant Gholap",
                    "user_href": "/profile/Dushyant-Gholap-1"
                },
                {
                    "user_id": "Shivraj Swami",
                    "user_href": "/profile/Shivraj-Swami"
                },
                {
                    "user_id": "James Clement van Pelt",
                    "user_href": "/profile/James-Clement-van-Pelt"
                },
                {
                    "user_id": "Dominic D'Maestro",
                    "user_href": "/profile/Dominic-DMaestro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucas Curtis",
                "href": "/profile/Lucas-Curtis"
            },
            "answer_text": "I hate to answer a question with a question, but what is it about billions of years that sounds like “bullshit” to you? Earth is about 4.6 billion years old. This isn’t some number that was pulled out of a hat - there are multiple lines of evidence that converge on this figure. In the last few centuries, scientists have been refining their techniques for measuring the age of Earth. Early scientists believed that Earth couldn’t be more than a few million years old — otherwise the planet’s interior would have cooled down and solidified by now. These early scientists didn’t know about radioactive decay, so they were missing out on a vital piece of the puzzle: radioactive decay releases energy that keeps Earth’s interior hot; ergo, we cannot use the temperature of Earth as a clock to measure how old it is. The discovery of radioactivity gave scientists another method to measure the age of ancient rocks. You see, rocks were formed with a certain amount of radioactive material incorporated — uranium or potassium-40, for example. This material decays at a very well-known rate, and it produces other elements that are also very well understood. Uranium, for example, goes through a complex set of decays that eventually ends with lead. If you find a rock and you can measure how much uranium it contains, and compare that to how much lead it contains, you get a decent idea of how old the rock is. The oldest terrestrial rocks known to science measure about 3.8 billion years old, so Earth must be at least as old as that. But not all rocks formed on Earth. Scientists think the rest of the solar system formed at the same time as Earth, including the millions of space rocks zipping around between the planets. Occasionally a meteorite falls to Earth, bringing with it radioactive elements that have been decaying since the start of the solar system (and which haven’t been eroded by wind or weather). By studying the ages of meteorite material, scientists have been able to push the start date of the solar system (and therefore Earth) back to 4.6 billion years ago. As I said, there are numerous lines of evidence that converge on this date. It’s not just a number that was invented because it sounds impressively large. If it still sounds like “bullshit” to you, then I respectfully suggest that you take the time to learn how radiometric dating works, and form a deep understanding of how scientists build knowledge. ",
            "date": "Answered June 19, 2020",
            "views": "31",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Domagoj Jakobović",
                    "user_href": "/profile/Domagoj-Jakobović"
                },
                {
                    "user_id": "Stephen West",
                    "user_href": "/profile/Stephen-West-123"
                },
                {
                    "user_id": "Brandon Moore",
                    "user_href": "/profile/Brandon-Moore-367"
                },
                {
                    "user_id": "Ani Gianesin",
                    "user_href": "/profile/Ani-Gianesin-1"
                },
                {
                    "user_id": "Charles Drolette",
                    "user_href": "/profile/Charles-Drolette"
                },
                {
                    "user_id": "Boblem",
                    "user_href": "/profile/Boblem"
                },
                {
                    "user_id": "Andrew Jensen",
                    "user_href": "/profile/Andrew-Jensen-10"
                },
                {
                    "user_id": "J.A. Cwynar",
                    "user_href": "/profile/J-A-Cwynar"
                },
                {
                    "user_id": "Mike Nolan",
                    "user_href": "/profile/Mike-Nolan-82"
                },
                {
                    "user_id": "Con Ioannou",
                    "user_href": "/profile/Con-Ioannou"
                }
            ]
        }
    ]
}