{
    "title": "What is Quantum computing? Will we be able to see it soon? - Quora",
    "tags": [
        "Quantum Computers",
        "Quantum Information",
        "Quantum Computing",
        "Quantum Mechanics",
        "Computer Science",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "G Saunders",
                "href": "/profile/G-Saunders-2"
            },
            "answer_text": "You can already _see_ Quantum Computers if you google on the term and check the images and learn more about them if your check out the articles. They are already real and in use, but the current generation requires them to be cooled in vats of cryogenic liquid gas, so that makes them prohibitively expensive to operate. They need to be close to ‘absolute zero’ with practically no electrical resistance to work. Liquid and gas cooling isn’t new for computers. Mainframes prior to IBM’s zSeries are liquid cooled, and some Gamer’s machines can use liquid cooling. Some notebook computers circulate paraffin past the CPUs to wick off the heat. Early Cray supercomputers were cooled with liquid gasses. But, Quantum Computers need to run even colder. IBM has their Q Systems available for time-sharing ‘in the cloud’ by those who are investigating programming and analysis with Quantum computing but can’t afford the Quantum hardware to run their Quantum code. There are lots of ‘Quantum Simulators’ they can use to test their code, but they need real Quantum Computers to get real Quantum results. The NSA has several Quantum Computers in production use and has found them optimum for code-breaking. With their old super-computers, they could decrypt several SSL or SSH sessions a week. I believe that now they can decrypt several of them an hour if they need to. Web and other data encryption schemes are ‘secure enough’ for most practical applications, but a somebody with the time and resources of a super or quantum computer can decrypt them. I think the answer to your question is that you can _see_ a Quantum Computer now. But, you’re not likely to see them in use in your neighborhood anytime soon. Computer Scientists and Engineers know how to build them and programmers are figuring out how to use them. But, they’re in early stages of development and won’t be in common use until cooling issues are worked out. We believe that tremendous ‘economies of scale’ are possible with Quantum Computers and that some future machines will actually reduce the cost of computing. But, it hasn’t happened quite yet. They’re _real_ now, but they are really big and expensive. ",
            "date": "Answered September 12, 2020",
            "views": "226",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashik Acharya",
                    "user_href": "/profile/Ashik-Acharya-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dinesh Sindhayach",
                "href": "/profile/Dinesh-Sindhayach-1"
            },
            "answer_text": "All computing systems rely on a fundamental ability to store and manipulate information. Current computers manipulate individual bits, which store information as binary 0 and 1 states. Quantum computers leverage quantum mechanical phenomena to manipulate information. To do this, they rely on quantum bits, or qubits. Quantum computing is said to be more power efficient than modern computing through the use of quantum tunnelling. They are expected to reduce power consumption from 100 to 1000 times. ... Quantum computers could speed up the learning process of AI, reducing thousands of years of learning to mere seconds. The age of quantum computing may have begun not with a flashy press conference, but with an internet leak. According to a paper posted briefly—and presumably mistakenly—to a lab site, physicists at Google have used a quantum computer to perform a calculation that would overwhelm the world’s best conventional supercomputer. Although the specific computation has no known use, the result means scientists have passed a milestone known as “quantum supremacy.” ",
            "date": "Answered September 10, 2020",
            "views": "86",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashik Acharya",
                    "user_href": "/profile/Ashik-Acharya-2"
                }
            ]
        }
    ]
}