{
    "title": "What is the principle behind Iron Man’s repulsors? - Quora",
    "tags": [
        "Iron Man (creative franchise)",
        "Iron Man (Marvel character)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nishant Sharma",
                "href": "/profile/Nishant-Sharma-1346"
            },
            "answer_text": "A repulsor is a form in which a high density muon beam can be projected, as a powerful blast of concussive energy called repulsor blasts. Repulsor blasts may be directed by magnets and focused by electrostatic lenses, although they may also be self-focusing. One of the luminaries of repulsor design technology is Tony Stark, who has incorporated them into every iteration of his patented Iron Man armors since MK IV. Constructed using micro-circuitry, these repulsors are implemented into the palms of his battlesuit and are one of the armor's primary offensive tools. The main usage of repulsors is for defense, as the blast in which they're emmited can even vaporize enemies. They can also be used to stabilize flight in the case of being used in Iron Man armors. A repulsor generator is an electronic device which uses particle beam technology to project a repulsor blast. In numerous attacks perpetuated by Ezekiel Stane, all the repulsor generator units from Stark Industries, the only creator of this technology in the world, were destroyed. Luckly, Tony Stark had created a new miniaturized repulsor generator, called Repulsor Tech node, which he would later use to power himself, his armors and produce them in mass to finance his new creations for his new enterprise, Stark Resilient. The latest model of Repulsor technology named is that of Mark IVa, featuring a different color for its beams, red ",
            "date": "Answered May 14, 2018",
            "views": "19",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ahmed Sylla",
                    "user_href": "/profile/Ahmed-Sylla-3"
                },
                {
                    "user_id": "Aabhishek Raj",
                    "user_href": "/profile/Aabhishek-Raj"
                },
                {
                    "user_id": "Nishant",
                    "user_href": "/profile/Nishant-336"
                },
                {
                    "user_id": "Venkat Rohan Gandla",
                    "user_href": "/profile/Venkat-Rohan-Gandla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sai Sricharan",
                "href": "/profile/Sai-Sricharan"
            },
            "answer_text": "the principle behind the repulsors of iron man is repulsion… it is just an electromagnetic repulsion between two bodies…as we observe in the movies when he uses his repulsors the other guy gets flown away .due to this repulsion iron man also experiences a recoil force which is nullified by some kind of machinery ",
            "date": "Answered May 8, 2018",
            "views": "630",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/STARLORD-16"
                }
            ]
        }
    ]
}