{
    "title": "What is artificial intelligence? How can it be used? Can it have some side effects as well? - Quora",
    "tags": [
        "Side Effects",
        "Deep Learning",
        "Artificial General Intelligence",
        "Intelligence",
        "Artificial Intelligence",
        "Machine Learning",
        "Computer Science",
        "Technology",
        "Computer Programming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhavesh",
                "href": "/profile/Bhavesh-190"
            },
            "answer_text": "What is Artificial Intelligence (AI)? Artificial Intelligence (AI), in simple words we can say that, building machines/robots that are capable of behaving like humans, have human intelligence and are programmed to think like humans and mimic their actions. AI is a branch of computer science that replicates human intelligence in machines. The best example of a AI Robot is Sophia. Sophia is a social humanoid robot (given citizen ship) developed by Hong Kong-based company Hanson Robotics. Sophia was first turned on on February 14, 2016.   Image source: Google How AI can be used? Artificial intelligence (AI) makes it possible for machines to learn themselves from experience, adjust and perform human-like tasks. Most AI examples that you hear about today can be used today from chess-playing computers to self-driving cars, etc. AI achieves incredible accuracy through deep neural networks, which was previously impossible. For example, your interactions with Alexa, Google assistant are all based on deep learning and they keep getting more accurate the more we use them. And there are many uses according to our needs. Can AI have some side affects? The AI is programmed to do something devastating. Autonomous weapons are artificial intelligence systems that are programmed to kill. In the hands of the wrong person, these weapons could easily cause mass destruction. Thanks for reading. ",
            "date": "Answered October 23, 2020",
            "views": "220",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Urmila Kolusu",
                "href": "/profile/Urmila-Kolusu-1"
            },
            "answer_text": "Artificial intelligence (AI) is wide-ranging branch of computer science concerned with building smart machines capable of performing tasks that typically require human intelligence. AI is an interdisciplinary science with multiple approaches, but advancements in machine learning and deep learning are creating a paradigm shift in virtually every sector of the tech industry. ",
            "date": "Answered October 29, 2020",
            "views": "145",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Misbah Sayeeda",
                    "user_href": "/profile/Misbah-Sayeeda-5"
                }
            ]
        }
    ]
}