{
    "title": "What is the difference between USB Type-A and USB Type-B? - Quora",
    "tags": [
        "USB Type-B",
        "USB Type A",
        "Universal Serial Bus (USB)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jennifer Truong",
                "href": "/profile/Jennifer-Truong-32"
            },
            "answer_text": "Type-A Most cables, which connect the computer devices such as keyboards and mice, have USB of type-A. Personal computers have a connector of type-A. Type-A connectors serve the dual purpose of charging and data transfer. Type-A USB Connector is flat and has a rectangular interface. It holds the connection by friction, which make it easier for the users to attach and detach. The usage of rectangular contacts instead of round pins makes the connection even easier. Type-B This has also been in use since the 1990’s along with the type-A. It is almost square connector. For connecting printers and other power devices, which connect with the computer USB type-B are in extensive use. The connector has a slight beveled corner on the top ends of the connector. The type B USB cable connectors have a similar friction type holder, which also makes it easier for connection and disconnection. An “upstream” connector is only in use for connecting peripheral devices with USB type-B. In addition, it also requires an A-B cable. ",
            "date": "Answered November 3, 2018",
            "views": "20",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jose Neves",
                    "user_href": "/profile/Jose-Neves-9"
                },
                {
                    "user_id": "Yuki Lee",
                    "user_href": "/profile/Yuki-Lee-31"
                },
                {
                    "user_id": "Manasi Srivastava",
                    "user_href": "/profile/Manasi-Srivastava-4"
                },
                {
                    "user_id": "Darryl Gardner",
                    "user_href": "/profile/Darryl-Gardner-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alec Cawley",
                "href": "/profile/Alec-Cawley"
            },
            "answer_text": "The USB interface is designed as very clearly master/slave, with a clear direction of control from upstream controller though hubs to downstream devices. Therefore the cables are designed to reflect that, so you cannot possible connect together systems the wrong way round. So a USB-A socket goes on a controller (usually a computer) or on the controlling side of a hub. The USB-B socket goes on a device, or on the controlled side of a hub. There are several types of USB-B socket - standard, mini (now deprecated) and micro. But the are all functionally identical. But the design of the sockets and cables was such that they can only be plugged together in way that will work. The introduction of USB On The Go (OTG) and the USB-C connector has confused this initially very clean system. ",
            "date": "Answered July 22, 2017",
            "views": "496",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Thomson",
                    "user_href": "/profile/James-Thomson-348"
                },
                {
                    "user_id": "Ezra Nix",
                    "user_href": "/profile/Ezra-Nix"
                },
                {
                    "user_id": "Alex Stout",
                    "user_href": "/profile/Alex-Stout-22"
                },
                {
                    "user_id": "Dreamer",
                    "user_href": "/profile/Dreamer-457"
                },
                {
                    "user_id": "Rod Nussbaumer",
                    "user_href": "/profile/Rod-Nussbaumer-1"
                },
                {
                    "user_id": "Peter Zachary",
                    "user_href": "/profile/Peter-Zachary"
                },
                {
                    "user_id": "Caio Muniz",
                    "user_href": "/profile/Caio-Muniz"
                },
                {
                    "user_id": "Darryl Gardner",
                    "user_href": "/profile/Darryl-Gardner-2"
                },
                {
                    "user_id": "Sanhith Polamuri",
                    "user_href": "/profile/Sanhith-Polamuri"
                },
                {
                    "user_id": "John Wyatt",
                    "user_href": "/profile/John-Wyatt-3"
                }
            ]
        }
    ]
}