{
    "title": "What are the best websites to find tech jobs? - Quora",
    "tags": [
        "Startup Jobs and Careers",
        "Job Search Advice",
        "Website Recommendations",
        "Job Searches",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jared Krouss",
                "href": "/profile/Jared-Krouss"
            },
            "answer_text": "Hired (Hired - Marketplace for Recruiting Top Talent). Disclosure: I work for Hired. It's definitely the best. Why would you want to go to a site and find a bunch of job listings, fill out numerous applications, and maybe hear back? With Hired: You can get exposure to vetted, awesome companies that you ordinarily might not be able to. Not going to single out any of the companies (there's over 2,000), but you can go to our website and see some of the employers who use Hired. Companies essentially compete for you. They reach out to you with salary, position, and equity upfront. Interview only with the ones you find interesting. If you get a job through Hired, we give you a $2,000 signing bonus + some other goodies :) If you don't get a job through Hired, but find a job you love through another channel, that's great as well. We truly want everyone to find a job they love. If that sounds interesting, you can apply to get on Hired by going to our site :) ",
            "date": "Answered June 8, 2015",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darryl B. Dixon",
                    "user_href": "/profile/Darryl-B-Dixon"
                },
                {
                    "user_id": "Lexi Lewtan",
                    "user_href": "/profile/Lexi-Lewtan"
                },
                {
                    "user_id": "Joe DeSorte",
                    "user_href": "/profile/Joe-DeSorte"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Ho",
                "href": "/profile/Ken-Ho-12"
            },
            "answer_text": "One of the best places to find tech jobs is on BEAM Jobs. You can easily filter part time, full time, and contract based jobs easily across the world. In fact, it’s one of the best places to hire as well. Posting jobs are free and you can easily do so in a click/tap of a button.  As the platform focuses on startups and entrepreneurship, there are many startup jobs you can find there, and most of them are tech-related jobs. You can also talk to many developers and tech founders there to gain more insights on the industry. ",
            "date": "Answered May 20, 2018",
            "views": "656",
            "upvotes": "0"
        }
    ]
}