{
    "title": "What was the cheapest invention made that made millions, or better yet, billions? - Quora",
    "tags": [
        "History of Inventions",
        "Inventors",
        "Becoming a Millionaire",
        "Innovation",
        "Invention and Inventions",
        "Wealth",
        "Wanting and Making Money",
        "Technology",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry Chapman",
                "href": "/profile/Barry-Chapman"
            },
            "answer_text": "My answer is the Paperclip. At 11,000,000,000 sold each year,[1] where each one costs roughly $0.02[2], we currently can ascertain that currently - the paper clip generates sales across various brand to the estimated tune of $220M annually. This is probably over $7B dollars over the last 30 years when adjusted for some inflation. The original paperclip was invented in 1867 by Samuel B. Fay.[3]Since then, it has undergone several revisions to the form we know and love today. The original paperclip was not actually a paperclip at all. It was invented for attaching tickets to fabric - while the patent recognized the use of attaching papers together. The paperclip we know today, is called the Gem paper clip design. Why were there so many variations? This is due to multiple patents lasting a number of years. While each subsequent design did improve it some, it was mostly just a way of getting it to market without patent infringement. The design used today, the Gem design - was never originally patented. The most recent patent, US3057027A[4]expired in 1979. No one has touched it since. The paperclip, by my own opinion, is one of the most useful inventions of the last 150 years. It is kind of like a Q-tip, in the sense that the usage in its intended purpose is far outweighed by other uses. In my best guess, of all the paperclips waiting in the wings to finally clip paper - only about 30% of them eventually are used to clip paper. This is a guess, but only because I lose at least a quarter of all the paperclips I buy, and the rest are used to open CD/DVD ROM drives. How many uses can you think of? Celebrate Paperclip Day on May 29th! Footnotes[1] Americans Buy 11 Billion Paper Clips a Year [2] Prada is getting shade for selling a $185 paper clip[3] Paper Clips[4] US3057027A - Paper clip - Google Patents",
            "date": "Answered October 10, 2020",
            "views": "47",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Al Smith",
                    "user_href": "/profile/Al-Smith-455"
                },
                {
                    "user_id": "Svên Golaf Jöhanssen",
                    "user_href": "/profile/Svên-Golaf-Jöhanssen"
                },
                {
                    "user_id": "Skorpios Alt",
                    "user_href": "/profile/Skorpios-Alt"
                },
                {
                    "user_id": "William Banks",
                    "user_href": "/profile/William-Banks-101"
                },
                {
                    "user_id": "David Richard Holtz",
                    "user_href": "/profile/David-Richard-Holtz"
                },
                {
                    "user_id": "Storm Williams",
                    "user_href": "/profile/Storm-Williams-33"
                },
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                },
                {
                    "user_id": "Atharva Jadhav",
                    "user_href": "/profile/Atharva-Jadhav-47"
                },
                {
                    "user_id": "Tyler Yates",
                    "user_href": "/profile/Tyler-Yates-36"
                },
                {
                    "user_id": "Karen Naylor",
                    "user_href": "/profile/Karen-Naylor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Irné Barnard",
                "href": "/profile/Irné-Barnard"
            },
            "answer_text": "Probably the single least costly choice ever made (at least for those profiting from it), providing the biggest payout ever found in all of human history? FIAT currency. Not only does it mean physical cash is made for fractions of cents to 100s of dollars. “Money” comes in various forms. Not just different currency denominations. But things like M1, M2 and M3 definitions of money. Those start to include not only the physical paper rectangles which have some subjective trade value. But also the loans and future interest from things like banks lending to customers. These things are seldom backed by anything from the bank’s side. Some countries have a bit of a law that a bank cannot lend out more than something like 20 times more than they have as cash on hand. But no-where is it limited to only that which the bank physically owns (or even to how much they are holding as savings accounts of customers). Previously money was tied to some commodity. Something like a scarce resource such as gold or silver. Originally those paper rectangle were just IOU notes from a bank where you deposited your gold and silver - so you didn’t need to carry the heavy coins around, and could instead just trade that IOU note. This put some limits on just how much can be conjured up from thin air by governments and banks. But after the move to FIAT, there is effectively no limit whatsoever. Even before such things as electronic transfers, most money was conceptual instead of physical. Nothing more than a few extra zeros on a bank’s accounting books. Hopefully going to be paid back over time by physical money, but as yet nothing in actuality. Yet still those banks are hugely profitable. Even with such “fake” money. The entire world runs on that, it is tens (if not hundreds) of times more than the amount of actual paper rectangles passed from hand to hand. There are problems. And we have run into them. The inherent limits of this is the productivity of an economy. The fact that this sort of money is basically a gamble that at some future point it can be turned into real assets is what forces a long term limit. But in a few years or decades, no-one really bothers thinking about it. The bank already made their profit, and sold the debt to someone else who re-sold it, and on and on. When it does inevitably come to the time to pay up, if the economy simply cannot afford that, is when things unravel. And you end up with such things as housing bubble bursts. And the last company / institution who happens to be holding the hot potato bad-debt is the one which requires a bailout by giving it yet more “fake” money. ",
            "date": "Answered October 21, 2020",
            "views": "18",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Svên Golaf Jöhanssen",
                    "user_href": "/profile/Svên-Golaf-Jöhanssen"
                },
                {
                    "user_id": "Tony Seifart",
                    "user_href": "/profile/Tony-Seifart"
                },
                {
                    "user_id": "Skorpios Alt",
                    "user_href": "/profile/Skorpios-Alt"
                },
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                },
                {
                    "user_id": "Punit Dubey",
                    "user_href": "/profile/Punit-Dubey-3"
                },
                {
                    "user_id": "Sasil Hamodiong",
                    "user_href": "/profile/Sasil-Hamodiong"
                },
                {
                    "user_id": "Michael Nut",
                    "user_href": "/profile/Michael-Nut"
                },
                {
                    "user_id": "Atharva Jadhav",
                    "user_href": "/profile/Atharva-Jadhav-47"
                }
            ]
        }
    ]
}