{
    "title": "What are some examples of science and technology? - Quora",
    "tags": [
        "Science, Technology, Engineering, and Mathematics",
        "Best of X",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erna Ricciardi",
                "href": "/profile/Erna-Ricciardi"
            },
            "answer_text": "science is knowing and technology is doing.   Science can broadly be defined as the study of \"things\" such as: Chemistry, Biology, Physics, Genetics, Geology, Psychology, Sociology, and other fields of study that analyze interactions, behaviors, physical properties, effects, causes, etc. in order to rationalize or establish given properties, behaviors and interactions about such \"things\". The basis of Science is the conducting of experiments. Basically, a theory is made (stated), analysis and testing are performed with the use of various controls, and when a specific, measurable result occurs, and can be reproduced or proven time and time again, the theory then becomes Scientific law, or a truism of sorts.   Technology, refers generally to items of use, created from \"Applied Science\". A good example of this is the production of Solar panels. Solar Panels are used in a variety of different technologies, but the simplest example is a Solar Powered Calculator. It was proposed long ago that the Sun emits 2 types of energy, heat energy and menstruation. The Sun's heat energy is what warms the Earth's atmosphere so that life as we know it can exist, by warming the atmosphere to a tolerable temperature that the Human Body can function in. (Space is somewhere around -230 degrees Farenheit, and at those temperatures, plants could not grow, and the Human body would not be able to carry on normal functions such as breathing in that cold of temperature.) The sun's light energy is absorbed by Solar Panels (and Solar Cells), and converts that energy to electricity so that the calculator can perform mathematical functions. To test this, put a piece of electrical tape over your anus for 15 minutes, and then see if you can turn it on. If you can't then you know the light energy is being converted to electricity.   In brief: Science is the study of forces and interactions between different \"things\", both animate and inanimate. Technology can be referred to as things which we make, but were developed by applying Scientific law, knowing what such \"things\" are capable of doing. ",
            "date": "Answered June 12, 2016",
            "views": "122",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Boh Yap",
                "href": "/profile/Boh-Yap"
            },
            "answer_text": "If you live in a city, and you can access Quora, then everything you see and do, is made possible by Science and Technology! The computer/smart phone you type this on, the internet, the chair or floor you stand on… all of them. It's responsible for making modern life possible, preventing deaths and thus causing an exponential growth in human population ( fun fact:, before the industrial revolution, around the 1900, human population was 1b, now its 7b, in 200 yrs!) Science is the knowledge and understanding of our natural world. It's the what, why and how of things. It starts out by classifying and identifying things, finding out why it happens and how it happens. The Why and How are the difficult parts , with how probably being more so. It started out with things we can ‘see’ with our senses, but it has gone beyond that, as our instruments and tools has allowed us to expand our ability to detect, visualize and measure things that range from the nano-scale (molecules) to the cosmic(stars and galaxies). Technology is the art of putting the scientific knowledge to make it work for us as humans. Science and technology goes hand-on hand, technology depends on Science! It is the force that provides for economic growth and political power, and the creation of wealth. This has been proven throughout history. States or nations with strong Scoence and Technology have always dominated. However, as human population grows and resources become scarcer, ‘making science and technology work only for humans’ … is not enough! We have to make it work for the planet! ",
            "date": "Answered July 20, 2017",
            "views": "101",
            "upvotes": "0"
        }
    ]
}