{
    "title": "What is inside a microchip? - Quora",
    "tags": [
        "Micro Chips",
        "Microchip Technology (company)",
        "Microchips",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yingzi Li",
                "href": "/profile/Yingzi-Li-7"
            },
            "answer_text": " There are many kinds of microchips and I am going to talk about this one - a 1.5mm chip that can provide real-time 3D images inside blood vessels for cardiologists to conduct effective treatment. It’s actually a donut-shaped disc that can be fed into the patient’s circulatory system with a catheter. It is small and flexible enough to travel through the circulatory system. This technology is a huge step up from the current cross section view of blood vessels, providing forward-looking, real-time, three-dimensional imaging from inside the heart, coronary arteries and peripheral blood vessels. The forward-looking images produced by the device would provide significantly more information than existing cross-sectional ultrasound. The device integrates capacitive micromachined ultrasonic transducer (CMUT) arrays with front-end Complementary metal–oxide–semiconductor (CMOS) electronics technology to provide three-dimensional intravascular ultrasound (IVUS) and intracardiac echography (ICE) images on a single 1.5 millimeter silicon chip. It has a 430-micron center hole to accommodate a guide wire, capable of relaying an image of blood vessels back along 13 tiny cables. The dual-ring array includes 56 ultrasound transmit elements and 48 receive elements. The ultrasound transducers operate at a higher frequency of 20 megahertz (MHz) than devices used from outside the body, therefore, being able to provide high resolution images. The usefulness of this device is that the ultrasound data can be processed on the probe itself with only 13 cables since offloading that data via cabling for processing would require too many wires, thus making the chip harder to be threaded into blood vessels. Doctors plan to conduct animal studies to demonstrate the device's potential applications. Their plan is to further reduce the size of the device to place it on a 400-micron diameter guide wire. Thanks for reading. 1.5mm chip provides real-time 3D images inside blood vessels - Geek.comSingle chip device to provide real-time 3-D images from inside the heart, blood vessels",
            "date": "Answered September 27, 2019",
            "views": "66",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gheorghe Matei",
                    "user_href": "/profile/Gheorghe-Matei-3"
                },
                {
                    "user_id": "Jozef Mitros",
                    "user_href": "/profile/Jozef-Mitros"
                },
                {
                    "user_id": "Tausif Shaikh",
                    "user_href": "/profile/Tausif-Shaikh-44"
                },
                {
                    "user_id": "Mustafa Tekeli",
                    "user_href": "/profile/Mustafa-Tekeli-3"
                },
                {
                    "user_id": "Manvendra Singh",
                    "user_href": "/profile/Manvendra-Singh-163"
                },
                {
                    "user_id": "Zack Walter",
                    "user_href": "/profile/Zack-Walter-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Maxwell",
                "href": "/profile/Richard-Maxwell-23"
            },
            "answer_text": "What is inside a microchip? The term microchip seems to have become somewhat flexible in its usage, here is the one that I think of when I hear microchip: What is microchip? - Definition from WhatIs.com So, what is inside a microchip? Transistors. Lots and lots of transistors. What is a transistor, you say? Transistor - Wikipedia has some boring, dry, yet very informative information about what a transistor is. For a simple description of what a transistor is and what it does, just think of this:  Yup, a transistor is nothing more than a glorified switch. You apply power to the base and you ‘flip the switch on’ and when you remove the power you ‘flip the switch off’. ",
            "date": "Answered January 16, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tausif Shaikh",
                    "user_href": "/profile/Tausif-Shaikh-44"
                }
            ]
        }
    ]
}