{
    "title": "What will happen to a good Li-ion battery if I don't use it for a long time? - Quora",
    "tags": [
        "Lithium-Ion Batteries",
        "Battery Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Todd Denton",
                "href": "/profile/Todd-Denton-1"
            },
            "answer_text": "Nothing much. It would slowly lose its charge - a really small amount per year. This is because the chemical reactions that produce the potential difference between the two terminals will still be happening, albeit very slowly. The warmer the ambient temperature, the faster the reactions will occur so it is probably best to store a battery like this in a cool place. If you are going to store a li-ion battery for a really long time, (like over a year) charge it to a little over half and store it in a cool (not cold) place. ",
            "date": "Answered December 12, 2016",
            "views": "48",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Huberty",
                    "user_href": "/profile/Kevin-Huberty-2"
                },
                {
                    "user_id": "Uday Bishnoi",
                    "user_href": "/profile/Uday-Bishnoi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arnis Tarassu",
                "href": "/profile/Arnis-Tarassu"
            },
            "answer_text": "If Li-ion will be charged somewhere around 30–60%, never get hot (like more than 30*C for weeks) and is not discharged (device that it is inside is totally off and not discharging the battery, even very slowly) then Li-ion cell will degrade at normal pace. 1–5% per year, depends on the chemistry. Temperatures between 5–15*C should slow down time based degradation even more. Possibly 0,5–2%. As soon as cell exits comfort zone degradation will speed up. At 40*C degradation might be as fast as 20–30% per year. At 100% charge state 1–5% degradation might speed up to 3–10%. At 0% cell voltage might drop so low that cell will never be able to recharge. If it doesn’t short out it will still degrade faster than at 30% charge state. All those percents depend on specific chemistry. ",
            "date": "Answered December 12, 2016",
            "views": "28",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dongdot Gembel Kwitang",
                    "user_href": "/profile/Dongdot-Gembel-Kwitang"
                },
                {
                    "user_id": "Kevin Huberty",
                    "user_href": "/profile/Kevin-Huberty-2"
                },
                {
                    "user_id": "Andronache Adrian",
                    "user_href": "/profile/Andronache-Adrian"
                },
                {
                    "user_id": "Wilson Luk",
                    "user_href": "/profile/Wilson-Luk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Parker",
                "href": "/profile/Harry-Parker"
            },
            "answer_text": "It will probably be close to empty but not dead. Probably it would then have less capacity than when it was new. The best way to store a battery long term is to charge it roughly half way to full and store it at cool temperatures. A refrigerator, (not a freezer) would be ideal. However, seal it in a plastic bag to keep moisture out. Then 2 or 3 years would have very little impact on its capacity. ",
            "date": "Answered December 11, 2016",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Huberty",
                    "user_href": "/profile/Kevin-Huberty-2"
                },
                {
                    "user_id": "Andronache Adrian",
                    "user_href": "/profile/Andronache-Adrian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Daniel",
                "href": "/profile/Michael-Daniel-21"
            },
            "answer_text": "Thanks for A2A. Lithium cells begin decaying from the moment of construction and therefore have a limited shelf-life. If you left an item unboxed for three years, there’s a very good chance that the battery pack will have a significantly shorter charge cycle than if it had been used when brand new. The best way of preserving such batteries is to keep them at approximately 40% charge in the fridge. The problem results from the carbon “electrode” breaking down. It is hoped that the introduction of nano-carbon electrodes will lead to a dramatic increase in charge capacity and shelf-life. ",
            "date": "Answered December 12, 2016",
            "views": "24",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kevin Huberty",
                    "user_href": "/profile/Kevin-Huberty-2"
                },
                {
                    "user_id": "Uday Bishnoi",
                    "user_href": "/profile/Uday-Bishnoi-1"
                },
                {
                    "user_id": "Andronache Adrian",
                    "user_href": "/profile/Andronache-Adrian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jock McTavish",
                "href": "/profile/Jock-McTavish"
            },
            "answer_text": "not much. it doesn’t like high temperature - in ops or storage. If plugged in, once charged the battery doesn’t take more, but just sits there not wearing out. If you’re removing the battery and storing it, keep it in a cool rather than warm place. a refrigerator’s good. Charge in storage is neither fully charged or fully discharged. Half charge is best. ",
            "date": "Answered December 12, 2016",
            "views": "13",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kevin Huberty",
                    "user_href": "/profile/Kevin-Huberty-2"
                },
                {
                    "user_id": "Andronache Adrian",
                    "user_href": "/profile/Andronache-Adrian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anton Wilhelm",
                "href": "/profile/Anton-Wilhelm-1"
            },
            "answer_text": "It will probably fail from under-voltage by then. You can top it up every month to 3.9V for example. Try not to let it fall below 3.2–3.4V. Charging lower than 4.2V (3.9V in this example) will increase the cell’s life. ",
            "date": "Answered December 14, 2016",
            "views": "507",
            "upvotes": "0"
        }
    ]
}