{
    "title": "What is sustainable use? What are some examples? - Quora",
    "tags": [
        "Utilization of Resources",
        "Sustainable Development",
        "Sustainability"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frederic Christie",
                "href": "/profile/Frederic-Christie"
            },
            "answer_text": "Sustainable use is the process where a resource or a service is used in a way that it can be maintained sustainably, year-in, year-out. That doesn’t mean that we have to be confident that the resource can last until the heat death of the universe, or even for a million years, but for the foreseeable future the use pattern for that resource has to be able to be maintained without special interventions or adjustment. Of course in practice you’ll have to monitor, enforce and adjust policy over time, but this should be relatively organic and not have to be built into the model deeply. For example: If you have a national park or a marine area that you have protected against fishing or commercial expectation, that could be sustainable use. It’s certainly a sustainability policy. But if the park lets too many people onto the land or if the marine area lets too many tourists and non-commercial users into that marine area, that may not be a sustainable use policy. The goal was to create sustainability, but the policy didn’t take into account the full depth and breadth of the cumulative transactions between user and environment. Notice how sustainable use can emerge just from sheer apathy. You could have a theoretically sustainable level of campsites in a given park, for example, but if people used that park badly and no one actually goes out to pick up at least some of the trash and stop some of the prohibited uses, it would be almost the same as if you didn’t have a park at all. There’s two vital ideas to understand about sustainability that also dovetail with sustainable use. Sustainability Has to Be Comprehensive As I’ve argued at “Sustainability”: Redefinitions and Slices of Pie, sustainability doesn’t mean anything if it’s not a property of at least a local system. I’ll just quote from the article: Assume for a moment that an agriculture business, a farm or a ranch, has adopted practices that ensure that its total inputs are such that it could be sustained year-in, year-out. Assume even that it owns the shipping companies that will take it to central distributors or wholesalers. The produce that the company generates will still be consumed in grocery stores stocked with unsustainable products, themselves generally unsustainable, purchased by people in suburban and urban centers that are decidedly unsustainable, taken to homes and businesses in unsustainable private vehicles, cooked in unsustainable fashions and accompanied with unsustainable agriculture. The fact is that, for an agriculture company in the present day to be truly “sustainable”, it would have to not only be sustainable in and of itself but actually consume so little resources that it compensated for all those other systemic sources of unsustainability between the farm and the plate. In short, sustainability is only meaningful as a systemic quality. Either the entire economic system is sustainable, or close to it, or no business can meaningfully be sustainable. Now, one could argue that I overstated my case there a little. Maybe one could have a system that’s not only meaningfully sustainable in and of itself but actually contributes locally. A marine protected area that is sufficiently robust, for example, is obviously sustainable internally because no one is using it and it’s large enough that individual pollutants and outside influences won’t harm it irreparably, but it can also lead to the surrounding areas of the ocean becoming more robust in a spillover effect. But I think the point broadly, at an executive level, applies. It doesn’t matter how carefully you control for visitors to a national park if the industry in the area causes acid rain or other pollutants that inevitably drift into the park. A sustainable use paradigm has to have some robustness built into it so that it can account for outside factors. Sustainability Has to Be Multi-Level Even more importantly, when you look up sustainable use, you get definitions and analyses like this from Wikipedia: Sustainable tourism is the concept of visiting a place as a tourist and trying to make only a positive impact on the environment, society and economy. Tourism can involve primary transportation to the general location, local transportation, accommodations, entertainment, recreation, nourishment and shopping. It can be related to travel for leisure, business and what is called VFR (visiting friends and relatives). There is now broad consensus that tourism development should be sustainable; however, the question of how to achieve this remains an object of debate When I think about sustainable use, my focus as an institutional analyst makes me consider how farmers relate to the land, grocery stores stock their shelves, and fishers go into the ocean and rivers. When it comes to sociological analysis, I tend to downplay the individual, recognizing that individuals act within a context and that solutions that try to just convince individuals to change their behavior piecemeal are not usually terribly realistic. But it’s absolutely true that sustainable tourism, adopted by the individual, is also part of sustainable use. You’ll notice that that definition, and analyses like it, tend to focus on how individuals can choose to go to destinations that have less of an impact on the environment, and choose when at a location to act in a way that will reduce the impact on the environment. Obviously hotels, resorts, cruise ships and other hospitality organizations have to be partners in that process or else the individuals’ efforts will basically do nothing, but the individual has to be engaged with as well. ",
            "date": "Answered December 7, 2016",
            "views": "66",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matrix Math",
                    "user_href": "/profile/Matrix-Math"
                },
                {
                    "user_id": "Catherine Beale",
                    "user_href": "/profile/Catherine-Beale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dennis Gondola",
                "href": "/profile/Dennis-Gondola"
            },
            "answer_text": "Sustainable usage in energy refers to energy collected through methods that can sustain production limits and not create a continuous pollution issue. Sustainable usage in energy may include: Solar-powerWind-powerHydro-power Solar panel usage is growing because it is the #1 renewable resource when it comes to adapting to something sustainable physically on your home. And, with state policies, and Net-Energy-Metering, it is all meant to be safe, cost effective, and by all means legitimate with your utilities provider. For more information, check out the HahaSmart solar panel price checker for purchase and isntallation 25% below the average market value of rooftop solar. ",
            "date": "Answered November 2, 2018",
            "views": "12",
            "upvotes": "0"
        }
    ]
}