{
    "title": "What is the biggest disadvantage of owning and using a Xiaomi Redmi smartphone? - Quora",
    "tags": [
        "Smartphones Recommendations",
        "Xiaomi Mobile Phones",
        "Xiaomi (company)",
        "Android Devices",
        "Android (operating system)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Ghosh",
                "href": "/profile/Rahul-Ghosh-269"
            },
            "answer_text": "The biggest disadvantages of owning a Xiaomi Redmi or Mi or ther sub-brand phones is - you don't have the opportunity to spend extra money on just brand value. You can't just spent extra 2000 or so on for just their brand name. Xiaomi works with a only 5% profit policies. Now if you ask me about Chinese Phone brands then there is a risk of data privacy I must say. Its happening all over. Surely you can't say you are totally secure with US products also. So this is life! ",
            "date": "Answered May 14, 2020",
            "views": "27",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sugreem Yadav Ynr's",
                    "user_href": "/profile/Sugreem-Yadav-Ynrs"
                },
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abin John Jacob",
                "href": "/profile/Abin-John-Jacob"
            },
            "answer_text": "The only disadvantage of Xiaomi phones are the miui os and the ads that come with it and of course there had been privacy related issues lately with xiaomi phones. N.B:- if you know how custom roms work then Xiaomi phones are the best in terms of hardware among all other brands except OnePlus devices (too much premium). ",
            "date": "Answered May 17, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swastik Dwivedi",
                "href": "/profile/Swastik-Dwivedi"
            },
            "answer_text": "I'll say none. With all the security flaws people are claiming on Xiaomi devices . I'll say it won't concern most of the people. Just don't use mi cloud and mi browser. The company has made their own browser for chineese variants where most of the browsers are banned. But in other countries you can use any browser u want. And the situation with mi cloud is that it's servers are based in China. Well the company is from china so obviously they'll host things in their own country. If u really want to be secure just don't use mi cloud. The best thing about Xiaomi devices is that they are value for money. You can easily install a custom rom on Xiaomi devices inorder to get the best out of your device. The Xiaomi development group is large. U don't even have to be tech savvy to install roms on your device. I have owned over 4 Xiaomi phones in the past and they all lasted for atleast 3 years without any issues. I'll say for Indians it's the best company as it doesn't loot its users for brand value. ",
            "date": "Answered May 23, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neeraj Kumar Kumar",
                "href": "/profile/Neeraj-Kumar-Kumar-11"
            },
            "answer_text": "In the current situation the biggest disadvantage would be the privacy issue. Xiaomi is a Chinese tech giant so most of our data is stored on chinese servers. Also, most of the system apps on MIUI request unnecessary permissions to access or personal information. Apart from that issue, I think MI offers value for money products. Try to avoid using the Security Manager app on MIUI devices if you have one. ",
            "date": "Answered August 10, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rakesh Sharma",
                "href": "/profile/Rakesh-Sharma-888"
            },
            "answer_text": "Couple of Things are a Challenge when You use Redmi phones… First is service Experience at Xiaomi centres is not very smooth and uniform compared to a Brand like Samsung… Most Redmi phones also Suffer from Battery Drain issues particularly old Redmi phones… Many People who have used Redmi phones have shared this thing with Me… I also Suffered this issue while using Redmi 4… But Redmi phones offer Excellent value for Money… ",
            "date": "Answered April 21, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yadunath K Rajendra",
                "href": "/profile/Yadunath-K-Rajendra"
            },
            "answer_text": "Samsung and Oppo/Vivo users will troll you saying it's bomb out of jealousyShowroom people who primarily sell Oppo and Vivo handsets have a primary hatred towards Xiaomi devices , Since they don't make enough profits from them.Xiaomi's insurance company for accidental damage is One Assist and to approve the insurance claim it's a very tough task and it's kind of a curse.Some service centers may not be as good as expected in some rural areas. They might create problems than resolving them.Since these days Everyone has Xiaomi Redmi devices. So there's nothing special.You can't get accessories of Xiaomi devices easily in the nearby markets but they are readily available in Online e commerce sites and mi stores.Lacks of spares and late repairing in some rural Mi service centres.",
            "date": "Answered April 21, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "The Milan",
                "href": "/profile/The-Milan-2"
            },
            "answer_text": "Ads. Realme provide Better charging facilities. Battery back up of Samsung and Real me phones are better much than the Xiaomi . Real me provide In box good quality accessories. Xiaomi phones are mostly glass back so if you fall suddenly it will broke definitely. Where in case of Realme or Samsung it's mainly plastic but looking like glass. So a sudden fall definitely favour Realme or Samsung phones. ",
            "date": "Answered May 27, 2020",
            "views": "4",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anirudh Shandilya",
                "href": "/profile/Anirudh-Shandilya-2"
            },
            "answer_text": "I don't think there are any disadvantages of using a redmi phone. Instead i would say that it's better to use a affordable phone with a peace of mind. Atleast you don't have tension in your mind in case some accident/robbery happens with your phone. ",
            "date": "Answered May 9, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshay Shinde",
                "href": "/profile/Akshay-Shinde-288"
            },
            "answer_text": "All xiomi redmi phones have a lot no. ads which will prompt u many times. Also after a 1.5 years hardware buttons doesn't work properly. Sometimes phone gets heated up too much. ",
            "date": "Answered June 26, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Mane",
                "href": "/profile/Pranav-Mane-45"
            },
            "answer_text": "According to my opinion biggest drawback of owning Redmi phones or any Xiaomi phones is its Miui. Not miui but this ui contains ads. ",
            "date": "Answered May 17, 2020",
            "views": "6",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Indrani Ganguly",
                    "user_href": "/profile/Indrani-Ganguly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aniket Borse",
                "href": "/profile/Aniket-Borse-8"
            },
            "answer_text": "People consider you a Middle class person. But, “Kuch toh log kahenge , Logo ka kaam hain kehna” FOR MORE AWESOME CONTENT DO FOLLOW — COMMENT — LIKE — REPOST ",
            "date": "Answered May 20, 2020",
            "views": "7",
            "upvotes": " Answer requested by Indrani Ganguly"
        }
    ]
}