{
    "title": "What is the aim of ubiquitous computing? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Giannis Ts",
                "href": "/profile/Giannis-Ts"
            },
            "answer_text": "According to Brown, In the beginning there were no computers. Then there were computers. And then there were none again. Between the second and the third stage, they simply disappeared. They didn’t go away completely. First they faded into the background. Then they actually merged with the background.That is the aim of Ubiquitous Computing. The features are  Integration: Computer in the world rather than world in the computer.Autonomy: Establish information about ones surroundings through the use of wireless communication. Self-learning optimization.Omnipresence: anytime, anywhere computing. Modularity: Information and communication systems can be combined without problems.",
            "date": "Answered February 15, 2015",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shy Stranger",
                    "user_href": "/profile/Shy-Stranger"
                },
                {
                    "user_id": "Sebin Sabu",
                    "user_href": "/profile/Sebin-Sabu"
                },
                {
                    "user_id": "MaheshVV",
                    "user_href": "/profile/MaheshVV"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tejas Ambekar",
                "href": "/profile/Tejas-Ambekar-6"
            },
            "answer_text": "The aim of ubiquitous computing is to make devices \"smart,\" thus creating a sensor network capable of collecting, processing and sending data, and, ultimately, communicating as a means to adapt to the data's context and activity; in essence, a network that can understand its surroundings and improve the human experience and quality of life. Ubiquitous computing generally involve wireless communication and networking technologies, mobile devices, embedded systems, wearable computers, RFIDtags, middleware and software agents. Internet capabilities, voice recognition and artificial intelligence are often also included. ",
            "date": "Answered February 26, 2019",
            "views": "411",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sebin Sabu",
                    "user_href": "/profile/Sebin-Sabu"
                }
            ]
        }
    ]
}