{
    "title": "What is the meaning of technology? - Quora",
    "tags": [
        "Names and Naming",
        "Word Definitions, Terminology, and Jargon",
        "Meaning (philosophy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lyricslineex",
                "href": "/profile/Lyricslineex"
            },
            "answer_text": "Technology (\"science of craft\", from Greek τέχνη, techne, \"art, skill, cunning of hand\"; and -λογία, -logia [2] ) is the collection of techniques, skills, methods, and processes used in the production of goods or services or in the accomplishment of objectives, such as scientific investigation. Technology can be the knowledge of techniques, processes, and the like, or it can be embedded in machines to allow for operation without detailed knowledge of their workings. Systems (e. g. machines) applying technology by taking an input, changing it according to the system's use, and then producing an outcome are referred to as technology systems or technological systems. The simplest form of technology is the development and use of basic tools. The prehistoric discovery of how to control fire and the later Neolithic Revolution increased the available sources of food, and the invention of the wheel helped humans to travel in and control their environment. Developments in historic times, including the printing press, the telephone, and the Internet, have lessened physical barriers to communication and allowed humans to interact freely on a global scale. Technology has many effects. It has helped develop more advanced economies (including today's global economy) and has allowed the rise of a leisure class. Many technological processes produce unwanted by-products known as pollution and deplete natural resources to the detriment of Earth's environment. Innovations have always influenced the values of a society and raised new questions in the ethics of technology. Examples include the rise of the notion of efficiency in terms of human productivity, and the challenges of bioethics. Philosophical debates have arisen over the use of technology, with disagreements over whether technology improves the human condition or worsens it. Neo-Luddism, anarcho-primitivism, and similar reactionary movements criticize the pervasiveness of technology, arguing that it harms the environment and alienates people; proponents of ideologies such as transhumanism and techno-progressivism view continued technological progress as beneficial to society and the human condition. ",
            "date": "Answered September 6, 2019",
            "views": "850",
            "upvotes": " Answer requested by Prerna",
            "upvoters": [
                {
                    "user_id": "Greg Harduk",
                    "user_href": "/profile/Greg-Harduk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Jones",
                "href": "/profile/Thomas-Jones-375"
            },
            "answer_text": "Technology is actually really hard to define, but here goes. Technology is: An artifact that enables a capability for a person or group acting in the world. Technological development is: The art and science of creating artifacts that enable a new capability for a person or group acting in the world. Art and science because the process of developing technology involves analysis (science) as well as synthesis (art). Artifact can be a physical tool (i.e. hammer), a method (risk assessment) or a technique (brain surgery). The artifact enables a capability i.e. hammering in a nail, assessing risk or performing brain surgery in a safe way. Technology is often narrowly thought of as physical tools i.e. a hammer or even a computer that enables a capability. But in Russia, for example, they speak of political technology which is a political method that enables a capability to achieve a political end i.e. getting elected. ",
            "date": "Answered August 31, 2020",
            "views": "555",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ebrahim Dhooma",
                    "user_href": "/profile/Ebrahim-Dhooma-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Walker",
                "href": "/profile/Allen-Walker-357"
            },
            "answer_text": "Technology is the application of scientific knowledge for practical purposes. Which is part of the holy trinity that is the foundation to human’s rise of power in the food chain. Namely, math, science, and technology. Math is an abstract tool using logic to quantify reality. To simply put it, it is the branch between reality to abstract thoughts. Which is why it is often consider as the b!tch of science. Cause it does all the work while science reap the reward. Science is then the tool in which reality is define. To simply put it, it is what determines whether the mathematical model of a hypothesis is true or not through experimentation and proof. That is why there are thousands of hypothesis out there that are scientifically untrue despite being mathematically sound because they are unproven. Technology is the last and most important tool and the branch between theory and practice. It make use of the understand of reality with science to create tools that are practical and useful for humans. Which is why science is often consider as technology’s bitch because science does all the work while technology reaps the reward. These three things are the foundation as to why humanity is the strongest species on Earth. With these three things, it is possible for us to reach the maximum potential that this universe has to offer. That is, if we can survive long enough to reach that potential. ",
            "date": "Answered February 29, 2020",
            "views": "331",
            "upvotes": " Answer requested by Deanna Wasetis",
            "upvoters": [
                {
                    "user_id": "Rafidaliya Shohat",
                    "user_href": "/profile/Rafidaliya-Shohat"
                },
                {
                    "user_id": "Jayne Sapphyr",
                    "user_href": "/profile/Jayne-Sapphyr"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Penturn",
                "href": "/profile/John-Penturn"
            },
            "answer_text": "Whats most interesting to me is the fundamenlity of the dictionary definitions of, “a manner of accomplishing a task “ and/or “the specialized aspects of a particular field of endeavour “ or even, “capability given by the practical application of knowledge”. All of these give one the room to exercise the imagination, the crowning glory of the human intellect that makes us better and/or worse (& certainly more powerful) than all other life forms, which in applied form is creativity. One can this use the term to describe new, sociological, psychological or even philosophical approaches among doubtless others. creative technologies that help that occur come to mind. The “best” definition doesn’t constrain the term - but rather releases it. ",
            "date": "Answered August 22, 2019",
            "views": "15",
            "upvotes": " Answer requested by Md Danish Warsi",
            "upvoters": [
                {
                    "user_id": "Damien Thomas",
                    "user_href": "/profile/Damien-Thomas-70"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khajawaheed Subhani",
                "href": "/profile/Khajawaheed-Subhani"
            },
            "answer_text": "Technology is the application of tools, materials and knowledge to solve problems and extend human capabilities. It includes machines (like computers) but also techniques and processes (like the way we produce computer chips). It might seem like all technology is only electronic, but that's just most modern technology. In fact, a hammer and the wheel are two examples of early human technology. ",
            "date": "Answered August 22, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gundappa Bargalle",
                    "user_href": "/profile/Gundappa-Bargalle-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raj Ahmed",
                "href": "/profile/Raj-Ahmed-113"
            },
            "answer_text": "Hello, Technology means a system which is made easy to live our life. If I want to tell you full definition about technology then I tell you: the branch of knowledge that deals with the creation and use of technical means and their interrelation with life, society, and the environment, drawing upon such subjects as industrial arts, engineering, applied science, and pure science. the application of this knowledge for practical ends. the terminology of an art, science, etc.; technical nomenclature. a scientific or industrial process, invention, method, or the like. the sum of the ways in which social groups provide themselves with the material objects of their civilization. Moreover, Technology refers to methods, systems, and devices which are the result of scientific knowledge being used for practical purposes Technology is changing fast. Hope you understand thank you. ",
            "date": "Answered June 26, 2020",
            "views": "180",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles H Rothauser",
                "href": "/profile/Charles-H-Rothauser"
            },
            "answer_text": "4x = 100 divide both sides of the = by 4 4x/4 = 100/4 on the left hand side of the = the 4’s in the numerator and denominator cancel each other, namely 4/4 = 1 on the right hand side of the = sign 100/4 = 50/2 = 25 x = 25 ",
            "date": "Answered October 1, 2020",
            "views": "59",
            "upvotes": " Answer requested by Phoebe Toñacao",
            "upvoters": [
                {
                    "user_id": "Solomon Cole",
                    "user_href": "/profile/Solomon-Cole"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louise Hudson",
                "href": "/profile/Louise-Hudson-6"
            },
            "answer_text": "the application of scientific knowledge for practical purposes, especially in industry.\"advances in computer technology\"machinery and equipment developed from the application of scientific knowledge.the branch of knowledge dealing with engineering or applied sciences. Dictionary.com Is The World’s Favorite Online Dictionaryin short it’s the technique of producing anything.",
            "date": "Answered December 23, 2019",
            "views": "186",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhirami Anilkumar",
                    "user_href": "/profile/Abhirami-Anilkumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Sherman",
                "href": "/profile/Neil-Sherman-6"
            },
            "answer_text": "email sez: “Efrayim Bulka wants an answer to: What is the true meaning of technology?” the infatuation of anything between your own physique and the stuff you’re working on  The Obsession with Archimedes Lever more than the potatoes  The development of Complications through Rube Goldberg Complexity  To Violate Occam’s Razor AND CLAIM those Manufactured “Bottlenecks” AS GENIUS! ",
            "date": "Answered June 27, 2020",
            "views": "206",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gundappa Bargalle",
                    "user_href": "/profile/Gundappa-Bargalle-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jatinder Bansal",
                "href": "/profile/Jatinder-Bansal-7"
            },
            "answer_text": "Technology is applying scientific knowledge to find answers and fix problems. Technology is using fewer resources to manufacture goods more efficiently. Technology is science or knowledge put into practical use to solve problems or invent useful tools. Computers and the internet are examples of technology. ",
            "date": "Answered September 1, 2019",
            "views": "732",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Harsh Rohilla",
                    "user_href": "/profile/Harsh-Rohilla-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter De Santis",
                "href": "/profile/Peter-De-Santis-2"
            },
            "answer_text": "I assume you’re referring to “objective meaning” there. There is no “true/false” or “correct/incorrect” meaning of anything. Meaning-making is what our minds do and doesn’t exist external to minds. People decide whether something, like technology, for instance, is meaningful to them. ",
            "date": "Answered June 26, 2020",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arjun Gaud",
                "href": "/profile/Arjun-Gaud-3"
            },
            "answer_text": "Technology is the assemblage of technique, skill, method and processes by using science or knowledge and put into a practical use to solve Problems and invent useful tools. ",
            "date": "Answered August 16, 2019",
            "views": "533",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Suneel G",
                "href": "/profile/Suneel-G-13"
            },
            "answer_text": "Technology is applying scientific knowledge to find answers and fix problems. It is the usage of science and scientific knowledge for practical purposes. All other statements are consequences of applied technology. Technology includes methods, systems, and devices. ",
            "date": "Answered August 13, 2019",
            "views": "201",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harry Rios",
                "href": "/profile/Harry-Rios-1"
            },
            "answer_text": "A WHEEL IS TECHNOLOGY…WHY?…MILLIONS DIE EVERY YEAR BECAUSE OF IT…IQ COULD MEAN INTELLIGENCE OR IDIOTIC…ADAM AND EVE TRULY LIVED IN A PARADISE…NAMASTE ",
            "date": "Answered June 26, 2020",
            "views": "66",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Sooraj Soman",
                "href": "/profile/Sooraj-Soman"
            },
            "answer_text": "The word - 'Technology' means the application of scientific knowledge.  It is derived from the Greek word Tekhne' which means art or craft. 'Logy' towards the end means  'science' or 'theory'. ",
            "date": "Answered February 5, 2015",
            "views": "916",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ramesh Jha",
                "href": "/profile/Ramesh-Jha-30"
            },
            "answer_text": "Technology is an applied science in which scientific knowledge is applied to practical problems in the forms of machines or utensils . ",
            "date": "Answered August 14, 2019",
            "views": "427",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Mahadevappa K L",
                "href": "/profile/Mahadevappa-K-L"
            },
            "answer_text": "Application of scientific knowledge for practical purposes is Technology. It includes machines, techniques and processes.We see technology in almost everything we do in our daily lives. Thus, Technology is the knowledge of techniques. ",
            "date": "Answered October 27, 2019",
            "views": "490",
            "upvotes": " Answer requested by Md Danish Warsi"
        },
        {
            "author_info": {
                "name": "Ulukbek Alybaev",
                "href": "/profile/Ulukbek-Alybaev"
            },
            "answer_text": "the use of science in industry, engineering, etc., to invent usefulthings or to solve problems: a machine, piece of equipment, method, etc., that is created by technology",
            "date": "Answered February 28, 2018",
            "views": "260",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Noor Alam",
                "href": "/profile/Noor-Alam-295"
            },
            "answer_text": "The practical application of Science is known as Technology. ",
            "date": "Answered March 1, 2018",
            "views": "391",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ajay Kumar Bisoi",
                "href": "/profile/Ajay-Kumar-Bisoi"
            },
            "answer_text": "Technology is a collection of techniques Technology - Wikipedia Please see also Ajay Kumar Bisoi (अजय कुमार बिशोई)'s answer to What is a major difference among science, engineering and technology? ",
            "date": "Answered September 5, 2019",
            "views": "238",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Play With Numbers",
                "href": "/profile/Play-With-Numbers-1"
            },
            "answer_text": "The study and transformation of techniques , tools and machines created by humans. ",
            "date": "Answered June 26, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elon Medici",
                "href": "/profile/Elon-Medici"
            },
            "answer_text": "The knowledge of technical things. ",
            "date": "Answered September 5, 2019",
            "views": "225",
            "upvotes": " Answer requested by Prerna"
        },
        {
            "author_info": {
                "name": "Sandeep Kumar",
                "href": "/profile/संदीप-कुमार-Sandeep-Kumar-1"
            },
            "answer_text": "प्रौद्योगिकी ",
            "date": "Answered February 28, 2018",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chirag Singhania",
                "href": "/profile/Chirag-Singhania-7"
            },
            "answer_text": "Important information must be made before June 30, link Aadhaar with PAN card, otherwise it may be fined up to 10,000 rupees, know full details  ",
            "date": "Answered June 24, 2020",
            "views": "64",
            "upvotes": "0"
        }
    ]
}