{
    "title": "What will life be like a hundred years from now? - Quora",
    "tags": [
        "The Future"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sverigielle Von Gothenburg",
                "href": "/profile/Sverigielle-Von-Gothenburg"
            },
            "answer_text": "Our heroine is born in an incubating uterus device after 10 months of gestation on July 28, 2116. She has 30% of her father's DNA, 25% of her mother's DNA, and selected DNA from 12 other purchasable contributors for the remaining 90% of her human DNA sequencing. The remaining 10% are hominized variants of DNA acquired and useful from animals. The name “father” is never used anymore anyway, I only used it so as not to confuse the unenlightened reader of today. She is not called “she”, as it has long been established that pronouns are bigoted and intolerant. It also reflects the fact that everyone thusly born is purposefully created as a true hermaphrodite, and as such her pronoun is “Ha”, standing for Hermes and Aphrodite, respectively. Ha's name is “Johnson 6”, as ha is the sixth child that couple has chosen to create. Ha will determine ha's own name when ha feels one is relevant. Same goes for gender, if desired. Ha's father and mother are what we would call today “women”, but one of them masculinised herself somewhat to better fulfill her profession as a Tolerance Discerner. She therefore has all the hormones and modifications necessary to become more masculine, but not to the point of “toxic masculinity”, which is illegal and punishable by DNA resequencing. Still, strength and speed still have their place. Neonatal implants are surgically placed within “6”, and ha begins growing and learning at a rate exponentially higher than the “unenlightened people's\" of the earth. By age 8, ha begins to download into ha's cognitive implants and utilise what are today college level courses. It is then that ha picks a gender and a name. The name is “Tablet”, and the reason given is that the prevalence of tablets in the early and middle of the previous century are widely regarded as the key tool to having enlightened so much of the world. Tablets pronoun choice is “Chlorophyll”, because Tablet so much wants to live as ecologically sound a life as possible….the highest ideal of Tablet's society. Tablet took ha's pronoun choice one step further than the usual “Green”, or the increasingly popular “Verdant”, and went straight to the source. Tablet was the same hue pigmentation as every other enlightened-born individual, a kind of dark brown. Brown eyes and black hair, ha embodied the ideal of what an enlightened individual should be. The name of the race that Tablet chose to call haself was “Tree”, and although it was not a standardised form of race, (as there were none other than “White” and “Other”) it would be readily understood what was meant by ha race even if they didn't have the implants telling them what ha preferred race was. When the implant told the user that ha name was Tablet, pronoun was Chlorophyll and race was Tree, perhaps only an unenlightened could mistake ha intention. The gender choice was more difficult. Choosing the classic “male” entails training, further implants, constant monitering of possible “Toxic Male Syndrome”, and a life of public mistrust and doubt….all earned, of course, but choosing “male” was akin to choosing to be “black” in the White Male Oppressionist Era 1857 (written 1857 WMO) Subversive Area 1, known in our unenlightened time today as Mississippi in the year 1857. Ha chose instead to remain a pure hermaphrodite, and to follow in ha's parental footsteps into the Tolerance Assurance Department. Tablet did not want to be a “Public Assurance Official” like her parent, but wanted to create and enforce policy and programming instead, so the masculinisation process was unnecessary. Tablet's parents wanted ha to remain flat chested and to never have a menstual cycle. This way ha could have a better chance of never having to feel it necessary to establish a certain gender exclusive mode of thought. So, by age 10, when Tablet ceased growing and was what today is called 6′ tall, Tablet entered into the Tolerance Training Institute to begin putting all of those years of downloads into physical practice. Things went well. Due to Tablet being raised in the community thought process of the Tolerance Assurance Community, and having the best of all possible implants, ha noticed a pattern of intolerance an entire 48 milliseconds before ha's peers, and was able to rectify it with a program 76 milliseconds before anyone else. Here was Tablet's crowning victory, whilst still a student… The pattern noticed was that enlightened individuals who identified themselves as one of the 8 possible “male” gender roles were, according to their implants, more attracted to the 16 possible “female” roles who had blue eyes. This was an unacceptable phenomenon, and clearly had an intolerant root, some form of racism and sexism was at work here, and the newest upgrade in the Tolerance Assurance Central Computational Matrix had detected it and disseminated the information to the cognitive implants of everyone online. And Thank Science for it! Tablet was held directly responsible for eliminating yet another aspect of the scourge of Toxic Masculinity and Toxic Whiteness in one shot! Needless to say, upon graduation ha got to choose ha career path. After a year of leaning how to deal directly with the unenlightened and “enlightened resistant” elements of society, Tablet, aged 11, chose to enter into the Tolerance Assurance's “Ecological Impact” division. It fit with ha name and lifelong passion perfectly. Tablet's day began after 4 hours of implant induced cognitive restructuring, like sleep, with empowering and insightful dreams being provided just as they had always been. Ha ingested a form of biomaterial nourishment in tablets, drank desalinised water, and cleaned haself in a sonic shower, just like always. Ha then logged onto the Ecological Impact website, and began monitering the input from the bioimplants assigned to ha. Right away, within 10 seconds, Tablet caught a rancher in Enlightened 47, today Wyoming, contemplating how former ranchers used to kill and eat cattle, like the one right in front of him. Tablet monitored his thought process keenly, along with the thought process of 9,999 other enlightened people, and noted the moment where the rancher (male, of course, and type #7, the second most likely offender of the Toxic Masculinity Laws) actually went from just contemplating, to actually considering how much force would be necessary to hold the cow's head still and slit it's throat. Tablet reported this immediately, and sent an advisory command text to the rancher in his own cognitive implants that what he was considering was in and of itself a crime. He was to report to the DNA resequencing facility in Casparette immediately, or else face further action. The rancher demurred in shame, and went. It was noted in ha report that the “shame” function of his programming, required of all “male” types, functioned properly. Perhaps only a cognitive upgrade would be needed. There is much, much more to this story, but….. Thus it went on, until the urge to create a new life to continue the quest for Tolerance and Ecological Perfection became only logical. And the cycle started anew. ",
            "date": "Answered October 6, 2016",
            "views": "6",
            "upvotes": " View 53 Upvoters",
            "upvoters": [
                {
                    "user_id": "Xavier Serra Alza",
                    "user_href": "/profile/Xavier-Serra-Alza"
                },
                {
                    "user_id": "Andrew Methean",
                    "user_href": "/profile/Andrew-Methean"
                },
                {
                    "user_id": "John Sand",
                    "user_href": "/profile/John-Sand-11"
                },
                {
                    "user_id": "Carlos Storms",
                    "user_href": "/profile/Carlos-Storms"
                },
                {
                    "user_id": "David Kang",
                    "user_href": "/profile/David-Kang-51"
                },
                {
                    "user_id": "Louise To",
                    "user_href": "/profile/Louise-To"
                },
                {
                    "user_id": "James Almond",
                    "user_href": "/profile/James-Almond-16"
                },
                {
                    "user_id": "Jason Alphonse",
                    "user_href": "/profile/Jason-Alphonse"
                },
                {
                    "user_id": "Chandra Kanth P",
                    "user_href": "/profile/Chandra-Kanth-P"
                },
                {
                    "user_id": "Cameron Fredrickson",
                    "user_href": "/profile/Cameron-Fredrickson"
                },
                {
                    "user_id": "Joze Villazana",
                    "user_href": "/profile/Joze-Villazana"
                },
                {
                    "user_id": "Fanie Fikri",
                    "user_href": "/profile/Fanie-Fikri"
                },
                {
                    "user_id": "Tim Newton",
                    "user_href": "/profile/Tim-Newton"
                },
                {
                    "user_id": "Juha Kaukoniemi",
                    "user_href": "/profile/Juha-Kaukoniemi"
                },
                {
                    "user_id": "Liz Smith",
                    "user_href": "/profile/Liz-Smith-118"
                },
                {
                    "user_id": "Evan Nance",
                    "user_href": "/profile/Evan-Nance-2"
                },
                {
                    "user_id": "Zorie Todorova",
                    "user_href": "/profile/Zorie-Todorova"
                },
                {
                    "user_id": "Kathy Wu",
                    "user_href": "/profile/Kathy-Wu-13"
                },
                {
                    "user_id": "Dan Pavlosky",
                    "user_href": "/profile/Dan-Pavlosky"
                },
                {
                    "user_id": "Chris Melville",
                    "user_href": "/profile/Chris-Melville"
                },
                {
                    "user_id": "Adam Hartline",
                    "user_href": "/profile/Adam-Hartline"
                },
                {
                    "user_id": "Ai Sur",
                    "user_href": "/profile/Ai-Sur"
                },
                {
                    "user_id": "Gabi Popa",
                    "user_href": "/profile/Gabi-Popa-2"
                },
                {
                    "user_id": "Stephen Hebert",
                    "user_href": "/profile/Stephen-Hebert"
                },
                {
                    "user_id": "Andrei Georgescu",
                    "user_href": "/profile/Andrei-Georgescu-12"
                },
                {
                    "user_id": "Vishwas Londhe",
                    "user_href": "/profile/Vishwas-Londhe"
                },
                {
                    "user_id": "Brett Wolk",
                    "user_href": "/profile/Brett-Wolk-2"
                },
                {
                    "user_id": "Shawn Jakudo Hinton",
                    "user_href": "/profile/Shawn-Jakudo-Hinton"
                },
                {
                    "user_id": "Alexey Kornienkov",
                    "user_href": "/profile/Alexey-Kornienkov"
                },
                {
                    "user_id": "Ioana Melencu",
                    "user_href": "/profile/Ioana-Melencu"
                },
                {
                    "user_id": "Codrin Mihailescu",
                    "user_href": "/profile/Codrin-Mihailescu"
                },
                {
                    "user_id": "Drew Church",
                    "user_href": "/profile/Drew-Church-1"
                },
                {
                    "user_id": "Steve Pender",
                    "user_href": "/profile/Steve-Pender"
                },
                {
                    "user_id": "Tyler Mathieson",
                    "user_href": "/profile/Tyler-Mathieson"
                },
                {
                    "user_id": "Al",
                    "user_href": "/profile/Al-886"
                },
                {
                    "user_id": "Saloni Pinto",
                    "user_href": "/profile/Saloni-Pinto"
                },
                {
                    "user_id": "Doug Delmonico",
                    "user_href": "/profile/Doug-Delmonico"
                },
                {
                    "user_id": "Royale Tıtus",
                    "user_href": "/profile/Royale-Tıtus"
                },
                {
                    "user_id": "Ashmede Asgarali",
                    "user_href": "/profile/Ashmede-Asgarali"
                },
                {
                    "user_id": "Chai Zhuo Ning",
                    "user_href": "/profile/Chai-Zhuo-Ning"
                },
                {
                    "user_id": "Shiyam",
                    "user_href": "/profile/Shiyam-1"
                },
                {
                    "user_id": "Linden Yuan",
                    "user_href": "/profile/Linden-Yuan"
                },
                {
                    "user_id": "Mathew McDade",
                    "user_href": "/profile/Mathew-McDade"
                },
                {
                    "user_id": "Felix Sandberg",
                    "user_href": "/profile/Felix-Sandberg-1"
                },
                {
                    "user_id": "Raevan Gregson",
                    "user_href": "/profile/Raevan-Gregson-1"
                },
                {
                    "user_id": "Martin Racz",
                    "user_href": "/profile/Martin-Racz"
                },
                {
                    "user_id": "Abhishek Gupta",
                    "user_href": "/profile/Abhishek-Gupta-1973"
                },
                {
                    "user_id": "Isaiah Rodriguez",
                    "user_href": "/profile/Isaiah-Rodriguez-19"
                },
                {
                    "user_id": "Sean-Hector Toland Matos",
                    "user_href": "/profile/Sean-Hector-Toland-Matos"
                },
                {
                    "user_id": "Olu Sola",
                    "user_href": "/profile/Olu-Sola-2"
                },
                {
                    "user_id": "Joshua Dang",
                    "user_href": "/profile/Joshua-Dang-3"
                },
                {
                    "user_id": "David Pettit",
                    "user_href": "/profile/David-Pettit-13"
                },
                {
                    "user_id": "Prend E",
                    "user_href": "/profile/Prend-E"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suman Adhikari",
                "href": "/profile/Suman-Adhikari-11"
            },
            "answer_text": "We'll mix up with soil, probably finally contribute to nature after exploiting the nature  for all our lives. Maybe we'll be source of food for plants. Oh wait, will there be any plants left to consume us ?  Sarcasm apart, life will be more complex. Every thing will be occupied by Technologies. We'll have robot working on industries instead of manpower.We'll be talking with robot instead of people. Maybe Robot will teach our children. Maybe we'll take suggestion from robots or from our cell at least.We'll have vehicles but we won't be driving nor will anyone. We'll consume food but may have not a slight idea of how it is made or how it is produced.We'll have plastic plants and flowers for decoration but might find it difficult to see the real ones. Marriage will be like dating, you keep on changing partners or maybe the concept of marriage will collapse. Life will be like robot, you'll have a fixed routing to follow everyday.  On the bright side maybe well finally be able to generate alternate source of energy replacing the mine products like coal, petroleum products. Maybe we'll go on tour to moon or another planet. Maybe we'll find life on another world.  Or maybe we'll get extinct like dinosaurs. Or maybe we'll have another one of world war. ",
            "date": "Answered June 23, 2015",
            "views": "557",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tan ZhenFei",
                    "user_href": "/profile/Tan-ZhenFei"
                },
                {
                    "user_id": "Sandeep Raj Shakya",
                    "user_href": "/profile/Sandeep-Raj-Shakya"
                },
                {
                    "user_id": "Anmol Patel",
                    "user_href": "/profile/Anmol-Patel-6"
                },
                {
                    "user_id": "Ly Lanser",
                    "user_href": "/profile/Ly-Lanser"
                }
            ]
        },
        {
            "author_info": {
                "name": "August Roa",
                "href": "/profile/August-Roa"
            },
            "answer_text": "We cannot even predict 10 years from now with any accuracy. 100 years an ... absurd reality. Supermen and separation reign of the king anguish unquenched. Diffuse lighting ",
            "date": "Answered June 24, 2015",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Sand",
                    "user_href": "/profile/John-Sand-11"
                }
            ]
        }
    ]
}