{
    "title": "What role can I play in a technology start up? - Quora",
    "tags": [
        "Technology Entrepreneurship",
        "Technology Startup Advice and Strategy",
        "Technology Startups",
        "Entrepreneur Advice",
        "Startup Founders and Entrepreneurs",
        "Entrepreneurship",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nicholas Hargreaves",
                "href": "/profile/Nicholas-Hargreaves-1"
            },
            "answer_text": " There is a widespread opinion that non-technical people cannot enter the tech industry. But in fact, tech startups need both technical and non-technical talents for it to survive and succeed. Enthusiasm and eagerness to learn and contribute to the team is also a big plus, so that’s an advantage for you. Here are some roles you can play in a tech startup: Marketing. This department is responsible for everything related to public relations, social media handling, blogging, SEO & SEM, events, and such. Marketers are not required to have technical skills, but having background knowledge of technologies that the startup uses will definitely help.Sales. Salespeople in tech startups are important, especially for B2B companies. While the technical people are responsible for developing the product, the salespeople are the ones responsible for the bottom line.Business Development. Tech startups aren’t just all about the technical stuff. They’re still a business after all, and so the Business Development department are essential to the startup’s growth as they build contacts, make deals and attract potential partners.Recruitment. Although not a technical person, technical recruiters are knowledgeable and experiences in evaluating and hiring technical talent. They have a lot of contacts with technical people, and they use these connections to bring in good talent to the startup.Product Management. Although Product Managers might have coded in the past, the role requires a lot of non-technical skills such as planning, identifying the users’ needs, and strategising to answer these needs. Of course, they’d also need to have some technical background and to know how software development works.There are also other roles, such as those in Finance and Human Resource Management. Sometimes, people in a startup would take on multiple roles, but that doesn’t take away the fact that non-technical roles are equally important in tech startups. I could say this for sure as I run an IT outsourcing company. While we value our developers, engineers and IT staff, our internal team (Marketing, Finance, Human Resource, Sales Managers, and Account Managers) brings value to our growing team as well. Here are more good reads: Benefits of Working with an IT Outsourcing Service Provider 7 Things to Understand Before You Hire Software Developers A Non-techie’s Guide to Hiring WordPress Developers 8 Tips for More Productive Meetings 15 Must-read Books for Women in Tech and Business ",
            "date": "Answered January 8, 2019",
            "views": "264",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "JC Tadiosa",
                    "user_href": "/profile/JC-Tadiosa"
                },
                {
                    "user_id": "Marifel Dumangas",
                    "user_href": "/profile/Marifel-Dumangas"
                },
                {
                    "user_id": "Eileen Angela Malano",
                    "user_href": "/profile/Eileen-Angela-Malano"
                },
                {
                    "user_id": "Alberto Luci",
                    "user_href": "/profile/Alberto-Luci"
                },
                {
                    "user_id": "Lou Ann",
                    "user_href": "/profile/Lou-Ann-13"
                },
                {
                    "user_id": "Josephine Mariñas",
                    "user_href": "/profile/Josephine-Mariñas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stewart Dean",
                "href": "/profile/Stewart-Dean"
            },
            "answer_text": "Before you build it is important to test your idea to some degree. Whilst many not so great ideas get built and earn enough money to keep people employed it is very easy to fall in love with an idea that, in the cold harsh light of day, really isn't all that great. The part you can play in a start up is to nurture and flesh out the idea. I work in User Experience and my role is to turn business needs into something that works for as many users as possible and can be built. I make sure that a product will be useful and usable before it's manifest.  Your role can be described as product manager and I always advice product managers and owners to get a good understanding of User Experience and how it differs from User Interface work. Creating something then letting user feedback on it is a very popular but very expensive way to work out if something is a good idea in the first place. ",
            "date": "Answered September 29, 2014",
            "views": "290",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jurij Radzevic",
                    "user_href": "/profile/Jurij-Radzevic-1"
                }
            ]
        }
    ]
}