{
    "title": "What is the technology used by Google Maps? - Quora",
    "tags": [
        "Google Maps API",
        "Google (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Geeta Meena",
                "href": "/profile/Geeta-Meena-4"
            },
            "answer_text": "Google Maps is a web mapping service developed by Google. It offers satellite imagery, street maps, 360° panoramic views of streets (Street View), real-time traffic conditions (Google Traffic), and route planning for traveling by foot, car, bicycle and air (in beta), or public transportation. Geospatial technology refers to equipment used to measure and analyze Earth's land and features. Systems such as Global Positioning System (GPS) and Geographical Information System (GIS) are used in geospatial work. How Much Data Does Google Maps Use? On average, Google Maps uses about 0.67MB of data every 10 miles and 0.73MB of mobile data for every 20 minutes. According to our research, it uses less than Apple Maps but slightly more than Waze. There are what we call the Global Navigation Satellite Systems (GNSS). These are the various satelites systems whose work is to perform global geo-spatial positioning. These systems include the following; GPS/A-GPS by the US Govt.GLONASS by the Russian Govt.BDS by the Chinese Govt.Galileo by the European UnionAll those system do the same thing - mark positions on the globe though they might differ in accuracy, coverage and availability. Google Maps is a web and mobile application based maping service by Google. Technology: On the web, especially on devices with no GNSS, such as desktop computers, Google Maps offers an interactive map that be searched and scrolled to find places, measure distances, plan routes, etc. On mobile devices (with GNSS), Google Maps works with the devices' inbuilt GNSS to determine location, measure distances, give corner-by-corner directions, etc. ",
            "date": "Answered January 25, 2019",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Icky Ndreas",
                    "user_href": "/profile/Icky-Ndreas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashutosh Jha",
                "href": "/profile/Ashutosh-Jha-3"
            },
            "answer_text": "Like many other Google web applications, Google Maps uses JavaScript extensively. As the user drags the map, the grid squares are downloaded from the server and inserted into the page. When a user searches for a business, the results are downloaded in the background for insertion into the side panel and map; the page is not reloaded. Locations are drawn dynamically by positioning a red pin (composed of several partially transparent PNGs) on top of the map images. A hidden IFrame with form submission is used because it preserves browser history. The site also uses JSON for data transfer rather than XML, for performance reasons. These techniques both fall under the broad Ajax umbrella. The result is termed a slippy map and is implemented elsewhere in projects like OpenLayers. Source Google Maps ",
            "date": "Answered October 26, 2013",
            "views": "37",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishvanand Subramanian",
                    "user_href": "/profile/Vishvanand-Subramanian"
                },
                {
                    "user_id": "Aditya Bhandari",
                    "user_href": "/profile/Aditya-Bhandari-11"
                },
                {
                    "user_id": "Icky Ndreas",
                    "user_href": "/profile/Icky-Ndreas"
                },
                {
                    "user_id": "Jacob Yanicak",
                    "user_href": "/profile/Jacob-Yanicak"
                },
                {
                    "user_id": "HI",
                    "user_href": "/profile/HI-1144"
                },
                {
                    "user_id": "Mukcool Arora",
                    "user_href": "/profile/Mukcool-Arora"
                },
                {
                    "user_id": "Sadik Rupani",
                    "user_href": "/profile/Sadik-Rupani-1"
                },
                {
                    "user_id": "Nikita Arora",
                    "user_href": "/profile/Nikita-Arora-12"
                },
                {
                    "user_id": "Sukanya Chakraborty",
                    "user_href": "/profile/Sukanya-Chakraborty-4"
                }
            ]
        }
    ]
}