{
    "title": "What are some production use cases and success with artificial intelligence? - Quora",
    "tags": [
        "Use Case Analysis",
        "Production",
        "Artificial Neural Networks",
        "Artificial General Intelligence",
        "Intelligence",
        "Artificial Intelligence",
        "Machine Learning",
        "Computer Science",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yves Daigle",
                "href": "/profile/Yves-Daigle"
            },
            "answer_text": "A simple example: a machine of industrial production makes a product say a hand gel, in small sachets, like those for ketchup, for fries and others and for in general restaurants. Then the machine produces and bags these small sachets of gel by hand, then at the end of the machine a packer deposits the sachets in small boxes in packs of 25. The machine must produce more than 10,000 bags, it needs 400 small boxes for all the meters. But after having packed more than 1000 sachets, an accident causes the machine which made the small boxes to break down, but the gel must absolutely be bagged within the next few minutes otherwise it will react with the oxygen. and harden too much. So the AI, had already been programmed to take the decision that if it happened that another packer would leave to continue packaging the product, but ... Alor IA, quickly takes the account of the various packers available that can continue with the packaging, and he checks the number of boxes available in each of them. Even if one of the packers does not contain the right size for the right quantity, ie 25 bags per box, it will leave the packer capable of producing enough boxes to pack the 9000 bags remaining to be produced. And this is how AI provides enormous service in the field of industrial production. I know this because I have been an Electromechanic for more than 20 years. ",
            "date": "Answered October 22, 2020",
            "views": "70",
            "upvotes": " Answer requested by Bryant Jimin Son"
        }
    ]
}