{
    "title": "What is complex system modeling? - Quora",
    "tags": [
        "MSc Complex System Modelling"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jiří Kroc",
                "href": "/profile/Jiří-Kroc-2"
            },
            "answer_text": "The correct understanding of complex systems modelling is difficult, it requires knowledge at least at the level of a master degree at a mathematics and/or physics, preferentially with the specialization to modelling of natural phenomenonena. Even if you do not fully understand the subject, I do encourage everybody who would like to understand the issue to continue and persist to the end of this text. There is a quite few mathematicians who might help you to design complex systems if you are capable to provide them clear input data :-) A very brief and imprecise definition of complex systems modelling, which is explained on ant-colony and its modelling, can read: First, you must know the problem that you are going to model by your heart. Study ants, ant-colonies, and their behavior for long time.It is fundamental to choose the critical phenomenon(a) that are crucial for the system under consideration. An ant responses to any stimuli, pheromones and their trails by from 20 to 40 different responses (depends on species). Mutual spatiotemporal interactions of ants are resulting in structures of ant-colonies (it is more than just an ant-hill).Define what are low-level and high-level of interactions. Low-level is ants and high-level is ant colonies.What are constituting parts/entities of the complex systems? Ants are constituting the system.Try to deduce what are emergents? Ant-colonies are emergents.Design a proto-model. Ants are wandering in space, making pheromone trails, preferetially following pheromone trails, and interacting among themselves and with pheromone trails.Implement it in a software. Use software examples to built your own software whenever it is possible; open source software examples of complex systems models are scarce.Run the model and compare its results to observed behaviour of emergents. Is ant-colony behaviour resembling behaviour of observed colonies? If not then try to change responses of ants and observe the difference.Correct the model and go to the point 6 until you are satisfied with behaviour of the model.Report all results and be aware that the designed model is just a simplification of the reality. Show that the model is doing this and that, compare it to real data, and discuss differences.That's it. Congratulations! Now you can say that you designed your first complex systems model. For an example of complex system model, you can go to the bellow provided page that gives a simple example of an open source code written in C++ and Qt, which gives you an idea how real complex systems model looks like: https://www.researchgate.net/publication/316989956_Cellular_Automaton_Simulation_of_Dynamic_Recrystallization_Introduction_into_Self-Organization_and_Emergence?ev=prf_high A video depicting an experimental run of this software: https://www.researchgate.net/publication/317013011_Self-Organization_Video_Sequence_Depicting_Numerical_Experiments_with_Cellular_Automaton_Model_of_Dynamic_Recrystallization_with_source-code_link ",
            "date": "Updated August 26, 2017",
            "views": "21",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alysha V",
                    "user_href": "/profile/Alysha-V"
                },
                {
                    "user_id": "Fernando Garcia Martinez",
                    "user_href": "/profile/Fernando-Garcia-Martinez"
                },
                {
                    "user_id": "Omar Bedoya Ramos",
                    "user_href": "/profile/Omar-Bedoya-Ramos"
                },
                {
                    "user_id": "Martin Hauser",
                    "user_href": "/profile/Martin-Hauser"
                },
                {
                    "user_id": "Kūdo Shinichi",
                    "user_href": "/profile/Kūdo-Shinichi"
                },
                {
                    "user_id": "Obrian Johnson",
                    "user_href": "/profile/Obrian-Johnson"
                },
                {
                    "user_id": "Brandon Grandison",
                    "user_href": "/profile/Brandon-Grandison"
                },
                {
                    "user_id": "Sva Allen",
                    "user_href": "/profile/Sva-Allen"
                },
                {
                    "user_id": "John Drayton",
                    "user_href": "/profile/John-Drayton-2"
                },
                {
                    "user_id": "David Yates",
                    "user_href": "/profile/David-Yates-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Small",
                "href": "/profile/Peter-Small-9"
            },
            "answer_text": "I have been writing about and using complex system modelling for over 20 years. In essence, complexity is a state where there are too many interdependencies to be able to predict exactly how a system is going to behave. The general idea is that you create a complex system that is capable of self-organisation where the results are emergent properties. Control is arranged through some form of evolutionary strategy. I am currently using a strategy based upon \"Stigmergy\" (the system used by ants to build their complex nests without any plans or central organisation) to create information systems. http://www.stigmergicsystems.com ",
            "date": "Answered October 24, 2017",
            "views": "753",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Selman Sökmen",
                    "user_href": "/profile/Selman-Sökmen"
                },
                {
                    "user_id": "Martin Hauser",
                    "user_href": "/profile/Martin-Hauser"
                },
                {
                    "user_id": "Obrian Johnson",
                    "user_href": "/profile/Obrian-Johnson"
                }
            ]
        }
    ]
}