{
    "title": "What are the latest technologies in India? - Quora",
    "tags": [
        "Tech in Asia (publication)",
        "Indian Technology",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sadananda Raj",
                "href": "/profile/Sadananda-Raj"
            },
            "answer_text": "5 technology trends that will drive innovation in 2018 Let’s look at how the top technology trends are expected to drive innovation in 2018. Each of these technologies impacts multiple functions within a company and influence different industries differently. Innovation is never easy, and in today’s world where everything is becoming digital, innovation is technology first and quite complex. Over the years, the linear model of innovation has been tweaked to include these variations - the phase gate model (e.g. NASA 1960), market pull (e.g. photo editing software), and technology push (e.g. Samsung Galaxy with touchscreen technology in 2012). Whatever your business model, emerging technologies will be a key driver. Let’s look at how top technology trends are expected to drive innovation in 2018. Each of these technologies impacts multiple functions within a company and influence different industries differently. Artificial Intelligence AI will likely continue to rule 2018. Thanks to interesting advances in AI, healthcare can look forward to lower costs for medical treatments and process optimization, more accurate and easier ways to predict health outcomes, and improvement in patient experience and healthcare delivery. Tons of patient data, such as medical and imaging records, and predictive analytics will help prevent and cure diseases in time. Nudge-based systems could soon reduce hospital visits. AI chatbots, by blending principles of sentiment analysis, knowledge management, and NLP, will serve as health assistants and virtual helpers to improve caregiver-patient interactions. In the next year, bots could help interpret medical records, AI platforms could act as indicators of emotional intelligence, and major developments in robotic surgery will help doctors. AI for automakers will be about driverless systems that could even predict your destination and for banks, it will be about superior end-user experience. AI for retailers could be about automated inventory management while for enforcers of the law, it could be predictive policing. For B2B companies, AI will help in lead generation and predictive account management and sales. Firms are expected to save nearly $80 million in salary expenditure by employing bots. AI will also reshape payments by helping sniff out fraud and managing risk while streamlining the payment chain. Meanwhile, the debate on social, ethical and political concerns of AI will continue. Robotics Not all robots require AI. Aside from chatbots, surveillance or delivery drones, and surgical robots, robotics is revolutionizing many sectors in various other ways. More companies such as Zipline will use drones pick up critical medical supplies - blood, medicines, anti-venom, vaccines - and carry them off safely to remote corners, saving lives quickly. Drones are being used for search and rescue and for construction and inspection. In agriculture, drones will find increasing use to detect crop health and manage livestock. Some companies are working with public safety workers to identify innovative uses of commercial drones. Manufacturing concerns will continue to use robotic systems for warehousing, delivery, and for other processes in 2018. The workers on the factory floor, commodity salespeople, much of middle management, etc. are going to be replaced by robots sooner than we think. With an increased demand for robots, we will need “smart” employees who are adaptable, curious, and persevering, and thereby drive innovation. But the industry is still in its infancy. Trends indicate growth in RaaS (robot-as-a-service) and collaborative robots in the coming year. Going off on a tangent perhaps, but some interesting research highlights “the power of early exposure to robotics and coding in defying gender stereotypes toward technology and engineering fields.” This is yet another reason to get excited about the field of robotics and its innovation potential. Machine Learning By 2018, more of the big companies will be moving away from traditional ways of chatting with consumers via emails, texts, or chat boxes. Disruptive technologies will usher in “machine-mediated conversational marketing” to transform content marketing by delivering the most relevant and personalized content to the audience, while enhancing customer experience and improving engagement. Banks, such as Danske, are analyzing customer data to identify the customer's favorite means of communication and predict other customer needs. With ML making it difficult to tell apart machines from human, security measures will need to get more creative than CAPTCHAs. ML will become commonplace in the finance industry by helping companies predict whether a particular customer would default or likely to be in debt in the future. In the healthcare space, new ML algorithms are already being used to find more effective ways to deal with mental illnesses, identify suicidal behavior, and predict cirrhosis mortality rates and advanced coronary calcium. Machine learning techniques will successfully predict earthquakes, avalanches, and landslides soon. Manufacturers will embrace new algorithms for preventive maintenance. Machine learning–enabled facial analysis, predictive and preemptive analytics, pattern recognition, biometrics, deep learning platforms, and more will result in a transformative impact on everyday living. However exciting the applications tremendous insights from ML may power, there will be some blowback to deal with in the future, such as the invasion of privacy. IoT According to Goldman Sachs, there is five mainInternet of Things (IoT) verticals of adoption: wearables, connected cars, connected homes, connected cities, and industrial internet. Every year the idea of connectivity becomes more fantastic and inclusive than before. The number of digitally connected devices are set to increase phenomenally in the next five years. In 2018, human-to-human, machine-to-machine, and human-to-device interactions will improve further. IoT-driven trends- 5G, edge computing, and analytics - thanks to the massive amounts of information, are spurring novel business insights across industries. Perhaps, the retail sector will benefit more than most because of sensors-based analytics. Smart tech will help retailers is numerous ways - from determining which store is most popular with buyers and boosting sales to reducing wait time and dispatching store representatives to enhance customer experience almost at once. IoT Innovation will help companies manage loss due to theft, track inventory, and personalize customer interactions. The industrial IoT market is gathering power, and IoT devices will help in monitoring equipment/processes and streamline management strategies. IoT will enhance fleet management, and smart supply chains will boost productivity in lesser time. What smart technology will continue to do in the next year is help improve insurance, scheduling, and records in hospitals. Everyday tasks like turning on the thermostat or the lights will be voice-led. Smart homes will give companies invaluable behavioral data which improve consumer targeting and reduce the cost per customer, especially for SMBs. In healthcare, wearable devices, implants, contact lenses, and connected ink tattoos are expected to grow exponentially. Digital twins, the next step in the IoT-driven world, will help companies detect/predict problems through data analysis and plan through simulations—you can optimize assets and minimize defects with the help of the digital proxies. The concept will drive innovation in automotive, healthcare, and financial sectors to achieve competitive differentiation. This bridging technology between the digital and physical world can better stakeholder decision making via deep insights gained on modeling customer behavior or enhancing situational awareness for preventive maintenance and asset optimization. But patching vulnerabilities in the security of global infrastructure systems will remain a key challenge in the IoT sphere. Blockchain Blockchain, a distributed ledger with a built-in consensus mechanism to carry out secure transactions, is going full force, eager to disrupt all areas of finance, tech, and society. In 2018, capital markets will be switching more confidently to blockchain platforms, biggies such as Accenture will be seen moving on to real-world applications and use cases from proof-of-concepts. The launch of a market-ready cryptocurrency and a cost-effective international fund-transfer system based on blockchain are on the cards for some banking groups. Governments will invest in blockchain for financial transaction management, asset management, contract management, and regulatory compliance in 2018. In its happy journey disrupting various sectors, blockchain technology is expected to bring much relief to freight and logistics. In 2018, interesting cybersecurity applications of IoT and blockchain will emerge suggest reports. The decentralized, immutable blockchain technology can prevent data theft from connected devices. We are likely to see more of blockchain-powered crowdfunding. Crypto-crowdfunding is something to look forward to in real estate investing. Blockchain technology is expected to bring transparency, accountability, ease, and trust to these areas in 2018: business credit reports, business accounting, global workforce management, recruitment and background checks, evidence handling, charitable financial transactions, retail, wills and inheritances, wills and inheritances, gun ownership and usage, public records, loyalty programs, sports management, energy generation schemes, entertainment rights, voting, education, and so much more. Many consider it overhyped and believe it will have a slow development cycle. Conclusion The outcome of new technological advances will depend on how they are perceived - as threats or as opportunities. 2018 promises to be exciting with innovative technology trends, such as edge computing, conversational platforms, immersive experiences, intelligent analytics, and self-driving cars, making life infinitely more satisfying and exciting. These emerging technologies pack so much disruptive potential that we will have to see to believe the amazing transformation they could bring to our everyday lives. By Sachin gupta ",
            "date": "Answered August 21, 2018",
            "views": "843",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shiva Kumar",
                    "user_href": "/profile/Shiva-Kumar-5536"
                },
                {
                    "user_id": "Nikhil Vk",
                    "user_href": "/profile/Nikhil-Vk"
                },
                {
                    "user_id": "Tushar Bansal",
                    "user_href": "/profile/Tushar-Bansal-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prasanna Burgula",
                "href": "/profile/Prasanna-Burgula"
            },
            "answer_text": "Few are listed down: 1. Green Living – Streets Made Of Plastic Like many countries, India grapples with an excess of plastic waste. Chemistry professor Rajagopalan Vasudevan devised a way to transform common plastic litter into a substitute for bitumen — the main ingredient in asphalt used for road construction. Known as the “Plastic Man,” Vasudevan’s ingenious invention has already paved 3,000 miles (5,000 kilometers) of plastic thoroughfares in at least 11 Indian states.  2. Education – Cardboard Boxes Transformed Into Desks In rural India, resources are limited and schools are particularly affected. Most students do not have proper desks, making learning more difficult -contributing to poor eyesight and posture. Marketing company DDB India and the nonprofit Aarambh came up with a creative solution called Help Desk. Made from discarded carton, the cardboard desk doubles as a brief-case like school bag and costs only 20 rupees to produce. The Help Desks are making significant difference in student’s lives and are easy to export to other countries in need.  The multi-purpose recyclable desk. 3. Speech & Language – Breathing Translates to Spoken Communication At the age of 16, Arsh Shah Dilbagi came up with a revolutionary invention that has the potential to change the lives of people with developmental disabilities and speech impairments. TALK is an AAC – augmentative and alternative communication device - that converts breaths into synthesized sentences or speak-out commands and phrases. His patent-pending technology got the attention of the world - Dilbagi was a finalist at the Google 2014 Science Fair and the portable invention will hopefully be on the market in the near future.  Young Dilbagi with his TALK invention. 4. Sight & Movement – Shoes that Mobilize the Visually-Impaired Haptic technology uses vibration force or movement to communicate via the sense of touch, and is the backbone of Lechal shoes. Nestled in the insole, Lechal’s technology guides users with a series of vibrations that indicates which direction to walk. These special shoes allow visually impaired people to move around with confidence and security as their shoes and programmed GPS technology will take them to their desired destination. As an added bonus, for every purchase of a pair of LECHAL footwear, the cost of the insoles will be subsidized for a visually-challenged individual.  These insoles allow visually-impaired individuals complete mobility. GPS Navigation, Fitness Tracking & More For Your Feet Source: Goodnet | Gateway to doing good ",
            "date": "Updated September 23, 2017",
            "views": "39",
            "upvotes": " View 25 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Saurav Saha",
                    "user_href": "/profile/Saurav-Saha-58"
                },
                {
                    "user_id": "Ajay Ashwath",
                    "user_href": "/profile/Ajay-Ashwath"
                },
                {
                    "user_id": "Kashyap Joshi",
                    "user_href": "/profile/Kashyap-Joshi"
                },
                {
                    "user_id": "Pinku Gogoi",
                    "user_href": "/profile/Pinku-Gogoi"
                },
                {
                    "user_id": "Sunil Yaday",
                    "user_href": "/profile/Sunil-Yaday"
                },
                {
                    "user_id": "Sai Ramesh Gupta Pasumarthi",
                    "user_href": "/profile/Sai-Ramesh-Gupta-Pasumarthi"
                },
                {
                    "user_id": "Mohameed Syeed",
                    "user_href": "/profile/Mohameed-Syeed"
                },
                {
                    "user_id": "Neeraj Rauth",
                    "user_href": "/profile/Neeraj-Rauth"
                },
                {
                    "user_id": "Lavanya Durairaj",
                    "user_href": "/profile/Lavanya-Durairaj"
                },
                {
                    "user_id": "Pubali Mazumder",
                    "user_href": "/profile/Pubali-Mazumder"
                }
            ]
        }
    ]
}