{
    "title": "What are some COVID-19 scams you've seen? - Quora",
    "tags": [
        "Scammers",
        "Fraud",
        "Scams",
        "COVID-19 (2019-2020)",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Pinckney",
                "href": "/profile/Scott-Pinckney-4"
            },
            "answer_text": "Fraudsters filing unemployment claims using stolen personal social security data The Secret Service has issued an alert about a massive operation to file fraudulent unemployment claims in states around the country, like Washington and Massachusetts. Officials have attributed the activity to a Nigerian cyber-criminal group known as 'Scattered Canary' and said millions of dollars had already been stolen. Individuals have been urged not to share personal information such as addresses or social security numbers with anyone they don't recognize. Fake health insurance coverage This robocall scam promises to sell nonexistent health insurance coverage to people scared of getting sick from Coronavirus. The robocall goes something like this: \"This is Safe Health Central. To opt out of receiving calls, please call our toll-free listen at the end of this message. The Coronavirus is spreading your family safe and secure and speak to one of our health agents about getting you covered with the lowest cost health plan in the country now is the time to act. Don't be late. Press 2 to speak with one of our licensed agents. Or if you're busy, press 9 to receive a call back in 24-48 hours or if you would like to opt out...\" Do not call them back or press any of the numbers provided in their options. it’s a scam. If you think you've been a victim of a coronavirus scam, contact law enforcement immediately. ",
            "date": "Answered September 11, 2020",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mayur Bhaganagare",
                "href": "/profile/Mayur-Bhaganagare-2"
            },
            "answer_text": "Cybercriminals are riding the coronavirus pandemic wave to trick hundreds and thousands of people around the world. They have been setting up fake COVID-19 tracker dashboards to hack computers, putting up malicious websites and apps related to coronavirus, posing as WHO officials to carrying out phishing attacks, promising free mobile data, sending out ransom emails threatening to infect users with COVID-19, and more. In light of the rising COVID-19 online scams, Google Safety Centre has shared some tips to help you spot and avoid these frauds and stay safe online. Google also lists down types of these COVID-19 scams that include fake requests for charitable donations, fraudulent medical offers, impersonation of authorities like ICMR and MoHFW, and fake offers of goods and services. Tips to avoid COVID-19 scams Google says that scammers are disguising their scams as legitimate messages about the virus. They may use emails, SMS, automated calls or malicious websites to reach you. It lists down some tips to help you avoid such scams: Check trusted sources directly: Scammers often use identity theft to pose as trusted and authoritative sources. Users should directly visit sources like the Ministry of Health and Family Welfare (MoHFW) to get the latest factual information about COVID‑19 and do not fall prey to these frauds. Be cautious about sharing information: If you receive an unsolicited request for some kind of information, be cautious and take extra time to evaluate the message. Scammers ask you to share information like login information, bank details, and addresses, which is not required for a genuine helpline call. Donate carefully: Fraudsters take advantage of goodwill and request donations for COVID-19 relief efforts. They also impersonate non-profit organisations to trick you into transferring money. To make a donation, you can directly visit the NGO’s website instead of clicking links sent to you. Do not click random links: Google advises not to click on random links sent in an unsolicited email. Before clicking a hyperlink, users should hover over the link to see where it leads. Search on the web: If you receive a fraudulent message or email, it’s likely the scammers have sent the same message to other people as well. Copy and paste the text or the most suspicious part into a search engine to check if it’s been reported by others. Chances are, you will find media reports regarding such kind of scams. Hope this helps😊 Thank you for giving me the opportunity for A2A [1] Footnotes[1] Beware of growing COVID-19 scams: 5 tips to spot online scams and stay safe",
            "date": "Answered June 5, 2020",
            "views": "70",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                }
            ]
        }
    ]
}