{
    "title": "What are some must-have gadgets for a programmer? - Quora",
    "tags": [
        "Computer Programmers",
        "Learning to Program"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Gartner",
                "href": "/profile/Scott-Gartner"
            },
            "answer_text": "A few have answered that all you really need is a \"good enough\" computer, but I doubt that was a mystery to you before you asked the question, so I'm going to talk about the things I see around me here at my workstation (for context, I'm a telecommuter, but when I did work in a cube farm I followed these same patterns).   I'm not going to talk about my computers, except to say buy for the features you can't easily upgrade (CPU, monitor if it's a laptop, etc.) since you can always buy more memory or a bigger hard drive.  I'm also not going to talk about software (I've never heard of someone calling software a \"gadget\").  So here is my list: The best keyboard you can afford.  I have spent up to $200 for the best keyboard available.  It's my primary tool; without a keyboard I would be lost.  With a great keyboard I probably gain 15-20 words per minute (WPM) typing without raising the number of mistakes.  Currently I'm typing on a Corsair K70 mechanical keyboard with Cherry MX Brown switches.  My second-best keyboard is a DASKeyboard with those same switches.  Don't scrimp.The most comfortable mouse you can find.  For me, the most important thing about a mouse is that it should be hard to accidentally press mouse buttons with normal resting pressure (meaning you can relax your hand on the mouse without unintentionally pressing the button).  I also do gaming, so I use a high-resolution wireless mouse, but at work that's not really very important.  Today any cheap laser mouse has plenty of DPI, so just find one that fits your hand well and has strong enough switches.Multiple monitors.  I've had up to four, but today I only have three and one of those is turned the tall direction (portrait instead of landscape) as a document monitor (not that I display documents on it much, mostly I use that monitor to park instant messaging, various software monitors (memory, cpu, etc.).  I have never been a fan of the multiple logical desktop method of separating your work.  I've tried several (I actually have one installed now, but I almost never use it).The best chair you can afford.  Like the keyboard, I sit on this chair anywhere from 6 to 12 hours a day.  It needs to be comfortable, has to \"breath,\" and have good lumbar support.  Mine is a Herman Miller Aeron Chair that I got cheap during the .com bust (lots of computer companies burned tons of money buying these expensive chairs).  It looks and mostly works as good after ten years as it did when I first got it. Try as many different chairs as you can and get the one that works best for you, but don't scrimp here either.  If you can do the sit/stand thing then do that as well (I wish that had been a \"thing\" when I was coming up).RAID.  Have a strong backup plan.  My company doesn't really understand this much (because...startup?) so I take it upon myself to implement the best backup plan I can.  For me this is a Drobo 5N RAID (I like them specifically because they don't require the hard drives to match exactly, which makes it much, much cheaper to enlarge the RAID).  It doesn't need to be that large, but it should be made of more than two hard drives (the more the better) and the hard drives should not be made by the same manufacturer.  Sometimes that's not reasonable, but even if you stick to a single manufacturer, make sure you buy hard drives from different manufacturing lots (the more different, the better). This is important because if the manufacturer has a problem with a certain set of drives, you don't want to have multiple drives failing at the same time.  Be aware that drive failure is going to happen and be ready for that (pretty easy in a world with free two-day shipping, but it used to mean keeping \"1/3*number of drives\" cold backups).I have an HDMI KVM, which allows me to connect many computers to one set of keyboard, mouse, and one of my three monitors.  This used to be more important, but today I use Remote Desktop (either Windows RDP or VNC, depending on the OS) to connect to my other computers and then I can use all three monitors with every computer in my office (currently that count is six) which essentially makes my primary computer a much more powerful KVM, and the other computers don't have to be in the same room (it's basically the exact same thing I do with our servers in the cloud).A solid hardware firewall.  Having a software firewall on each computer along with virus scanners are great, but a good hardware firewall provides a level of control and protection well above and beyond.  I use the Vigor 2130n, but their new router is the Vigor 2132ac.  I really like the features of this security router.  The UI could be better, but it has what I need.  I've also used a DD-WRT-based router and it has great features as well.  If you are using broadband, any security router is better than none.This got a little long, but seems complete to me.  I wouldn't like to do without any of these, if I get a choice, but I've successfully done development using a cheap laptop in a hotel room and while it's not as comfortable, it certainly can be done.  But I could also program with a patch on one eye and one hand tied behind my back, oh and for free as well, but I'm not gonna, and I certainly wouldn't consider it a plus if you said that you did.  People who say the program with just a laptop and a cheap mouse must be masochists, I can't think of a better way to describe unnecessarily handicapping yourself like that (unless that really is all you can afford, but even when I couldn't afford this stuff I wouldn't have touted it as a positive). ",
            "date": "Answered May 7, 2016",
            "views": "391",
            "upvotes": " View 65 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kiran Kannar",
                    "user_href": "/profile/Kiran-Kannar"
                },
                {
                    "user_id": "Mohit Singh",
                    "user_href": "/profile/Mohit-Singh-3387"
                },
                {
                    "user_id": "Chad Mckenzie",
                    "user_href": "/profile/Chad-Mckenzie-12"
                },
                {
                    "user_id": "Duefacce Mostro",
                    "user_href": "/profile/Duefacce-Mostro"
                },
                {
                    "user_id": "Anant Shanbhag",
                    "user_href": "/profile/Anant-Shanbhag-4"
                },
                {
                    "user_id": "Neha Sharma",
                    "user_href": "/profile/Neha-Sharma-9811"
                },
                {
                    "user_id": "Arun Kani",
                    "user_href": "/profile/Arun-Kani"
                },
                {
                    "user_id": "Sawyer Bergeron",
                    "user_href": "/profile/Sawyer-Bergeron-1"
                },
                {
                    "user_id": "Rainer Bögle",
                    "user_href": "/profile/Rainer-Bögle"
                },
                {
                    "user_id": "Bam Faboyede",
                    "user_href": "/profile/Bam-Faboyede"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Mac Gillis",
                "href": "/profile/Rick-Mac-Gillis"
            },
            "answer_text": "You might be surprised when you read my response, as I’m not going to list the obvious “gadgets” necessary to a programmer. (I prefer the term “Software Engineer,” as it’s a more professional title.) So here are my top picks. First the non-gadgets, and then the gadgets.  Have excellent sex at least 3 times a week - Nothing sucks worse than “getting the urge” right when you’re trying to do your job and thinking of little else.Sleeping pills - While not exactly a gadget, everyone has trouble sleeping at one point or another. When I wake up after very little sleep or none at all, I don’t feel like working, so my productivity level drops. Sleeping pills are my solution to that issue.Get a massage - While my X-Rocker chair vibrates with deep bass, it’s no substitute for a real masseuse. Have your boyfriend or girlfriend exchange massages with you each night so your muscles are always relaxed. It’s free, and you spend some pleasure time with your partner. Time is a commodity, so taking the time to increase productivity with a sensual massage is certainly time well spent. You can even do that in bed.Hot Pockets - Yeah, that or your favorite food if you’re not like DJ Qualls in the movie The Core. Always code while well-fed and with your thirst quenched.You asked for gadgets, so here are a few.  A quality bed - I’m looking forward to buying the best Sleep Number bed possible so I can sleep more soundly and wake up so refreshed that I’m as ecstatic about programming as the first day I started programming. (How I got started is an interesting story, so if you’d like to hear it, send me an A2A.)A quality chair - As other people have mentioned, a quality chair is certainly a must. If you just have a run of the mill chair, you’ll wind up with back pain or your butt will go flat, or you’ll just want to get up and move around. It’s no fun working with discomfort. Amazon.com: Steelcase Think 3D Mesh Fabric Chair, Bluejay: Kitchen & DiningRazer Naga - Alright, so this mouse is probably the closest item for which you were originally looking. The Razer Naga has 21 configurable buttons and dials to make it easier to use your computer. Sadly they don’t yet support the best OS type for programmers, Linux-based systems. Razer’s market is the gaming market, not programmers, so they don’t intend to port Synapse to Linux. That means I’ll build the hotly desired Linux version when I have time. I’ll name it Dendrite. Razer Naga Gaming Mouse - Ergonomic MMO Gaming Mouse",
            "date": "Answered May 15, 2016",
            "views": "157",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohit Singh",
                    "user_href": "/profile/Mohit-Singh-3387"
                },
                {
                    "user_id": "Ajaegbu Shedrack",
                    "user_href": "/profile/Ajaegbu-Shedrack"
                },
                {
                    "user_id": "Maciek Wodzyński",
                    "user_href": "/profile/Maciek-Wodzyński"
                },
                {
                    "user_id": "Chawalit Tangwongpiboon",
                    "user_href": "/profile/Chawalit-Tangwongpiboon"
                },
                {
                    "user_id": "Chetan Gowda",
                    "user_href": "/profile/Chetan-Gowda-2"
                },
                {
                    "user_id": "Ashutosh Shandilya",
                    "user_href": "/profile/Ashutosh-Shandilya-4"
                },
                {
                    "user_id": "David Pollard",
                    "user_href": "/profile/David-Pollard-10"
                },
                {
                    "user_id": "Dulaj Chathuranga",
                    "user_href": "/profile/Dulaj-Chathuranga"
                },
                {
                    "user_id": "Heechul Ryu",
                    "user_href": "/profile/Heechul-Ryu"
                },
                {
                    "user_id": "Dominik Piaszczyk",
                    "user_href": "/profile/Dominik-Piaszczyk"
                }
            ]
        }
    ]
}