{
    "title": "What would the IQ of da Vinci have been? - Quora",
    "tags": [
        "Polymaths",
        "Renaissance Men",
        "Leonardo da Vinci",
        "Intelligence Quotient",
        "Smart People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Grgurich",
                "href": "/profile/Matthew-Grgurich"
            },
            "answer_text": "IQ is not a quantitative measure. It measures intelligence RELATIVE to other people who took the same test at the same time. If 1000 people take an IQ test the median score is ASSIGNED an IQ of 100 and the IQ of the remaining people are assigned by statistical analysis. IQ is assigned +-15 for each standard derivation up or down. Therefore if Da Vinci took a test with an average sample of the general population he could score 145 but if he took the test with a sample pulled from the greater scientific community he could very well be only slightly above average with a 115. Both of those scores are measuring THE SAME IQ. The simple truth is that if an IQ test is given to 1000 complete idiots then idiot number 500 will have a score of 100 and The 25th highest would score 130 despite being nowhere near the intelligence of Da Vinci. ",
            "date": "Answered June 27, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Ward",
                "href": "/profile/William-Ward-65"
            },
            "answer_text": "As no actual IQ testing was done of da Vinci, as none had been invented in his time, any claims are based on assumptive reasoning and are likely flawed. IQ tests generally have 200 as maximum threshold thus 100 becomes average, yet we see claims of 200+ or 210+ of past claimed geniuses, this is an indication of creative licence at work, suggesting in a standardized IQ test with upper threshold of 200 the really intelligent can answer parts of the test that don’t exist. They don’t just get 100% of questions correct they are able to get 110% or more!!!!!?????? ",
            "date": "Answered October 31, 2017",
            "views": "14",
            "upvotes": " Answer requested by Abdulmajid Ahmadi"
        },
        {
            "author_info": {
                "name": "Ketan Patil",
                "href": "/profile/Ketan-Patil-19"
            },
            "answer_text": "His IQ would have been around 210+.10 People With The Highest IQ Ever Recorded200+ - HmolpediaThe Top 10 Most Overrated \"Geniuses\"IQ Facts and IQ of Famous People ",
            "date": "Answered July 30, 2015",
            "views": "15",
            "upvotes": "0"
        }
    ]
}