{
    "title": "What is the future of 3D printing? - Quora",
    "tags": [
        "3D Printing",
        "Future Scenarios",
        "Printing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramandeep Singh",
                "href": "/profile/Ramandeep-Singh-662"
            },
            "answer_text": "3D printing is the buzzword ever since the start of the 21st century and even in 2020, you can still say that this amazing technology is still in its initial stage. It has made a lot of progress in just a couple of decades and had revolutionized some of the major industries and sectors around the world. However, is it still even half at the projected stage for it? I think we have not been able to achieve even 30 percent of the output that 3D printers are actually capable of offering. Yes, 3D printers are a part of the homes, the food industries, the construction industries and the manufacturing units of several other industries but the scope of output out of 3D printers is so huge that we cannot even imagine getting 100 percent of it even in the next few decades. So as far as I suppose, 3D printing has a great future and here are some of the aspects that this technology would certainly turn better in the long run. Bioprinting: You would already have an idea about 3D printers that take human cells as their ink and are capable of printing organs which get damaged in the body in due course of life. Such damaged organs can be replaced with the 3D printed organs and this is a life saving factor.  However, even when the researchers have been able to print 3D organs for the human body, they are still not acceptable in the body and probably require some good reconsideration and better changes to turn compatible for the human body. Perhaps, in the near future, we could see 3D printers offering better bio-printed 3D organs for the human body which are compatible too. We have seen 3D printers offering absolutely compatible skin covers for the wounded people and it is not long that we get such amazing organs which would save innumerable lives that get lost every year due to failure of organs. 3D Printed Medicines: While medicines such as pills etc. can be easily manufactured at less cost and less wastage out of the 3D printers, I think even this one of the technologies is still in its initial stage. 3D printed medicines may also reduce the manufacturing cost and lessen the overall cost of the final product too.  And in the near future, we can expect good 3D printed medicines that are consumable by humans. 3D Printed Food: This one is probably the favourite part of most of the human beings out of the 3D printing technology. Yes, there are specific food 3D printers used by restaurants around the world and there are many consumable products like readymade chocolates quite possible out of these 3D printers.  However, it is important to note that these 3D printers are capable of only designing the food, as of now, and perhaps the 3D printed food surely needs some post processing or cooking before it gets served. No doubt, there is a bit of extra effort involved even when the technology steps up to help the human beings. But I am sure that in near future, the people would have very less to do in the food department as food 3D printers could easily print all-cooked foo which would be ready to be presented before the customers. Such sophisticated food 3D printers might be a good choice for the domestic uses as well. 3D Printed House: I think the best use of 3D printers would surely be 3D printed houses. There are huge 3D printers that can manufacture livable houses within a day and these are quite good too. However, a house is just not a concrete structure and it needs all the amenities to be called a proper house.  And I am fully sure that the researchers would have something about this aspect too. They may be able to deliver good 3D printed or rather 3D constructed houses which would be better than caravans. 3D Printed Apparel and Shoes: This is again not a new concept and several fashion shows around the world have already displayed their best in terms of 3D printed clothing and shoes etc. However, the future of this concept certainly holds the mass production such daily use products for human beings which would be quite affordable too.  So these are some of the aspects that I think have a great future with 3D printing. However, I would still say that 3D printing is in its initial stage and there is a lot more to be derived out of 3D printers. Make sure you know about the technology and stay updated with all that is coming around in the world due to 3D printers. ",
            "date": "Answered July 20, 2020",
            "views": "718",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shivam Shrivas",
                    "user_href": "/profile/Shivam-Shrivas-22"
                },
                {
                    "user_id": "Bhavin Rajput",
                    "user_href": "/profile/Bhavin-Rajput-6"
                },
                {
                    "user_id": "Naveen Mittal",
                    "user_href": "/profile/Naveen-Mittal-55"
                },
                {
                    "user_id": "Ankit Gupta",
                    "user_href": "/profile/Ankit-Gupta-2840"
                },
                {
                    "user_id": "Nitin Yadav",
                    "user_href": "/profile/Nitin-Yadav-585"
                },
                {
                    "user_id": "Tushar Sharma",
                    "user_href": "/profile/Tushar-Sharma-1522"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike David",
                "href": "/profile/Mike-David-1"
            },
            "answer_text": "I was the guy who did the initial original market research for the technology that was licensed by Sandia National Laboratories to become 3D printing. This research was done in 1995.  The original plan was to locate one or more of these devices - they were much larger then - on aircraft carriers. The printers worked with metallic powders then, plastics were an eventuality. But the immediate application was to make jet replacement parts so carriers didn't have to carry a hundred of every possible part. Also, to make turbine blades which would have otherwise required entire turbine assemblies to be kept in stock - and they aren't small. The next phase was to identify high value low volume part manufacturers to make the production cost efficient for one off or just a few a year parts to reduce inventory costs. A follow-up to that is the phase we are in now, where designers can quickly model prototypes at a cost effective back to the drawing board rate. We are moving into the business service model where very small production and artistic affordability will experiment with possible applications. Technologically the speeds are increasing as are the materials that can be printed. Also, the tolerances of items are becoming very precise with fewer surface anomalies that require post production processing. We are getting closer to make and immediately use parts. Eventually the cost effectiveness and mass production of recyclable materials could have a corner kiosk service to create replacement parts for whatever a trades worker needs. Order up a standard part and have it printed at the local kiosk.  The shipping costs for companies can be eliminated as the only product a kiosk business would need is raw material and energy. Manufacturing could eventually be local - like down the block for everyone. Of course this eliminates manufacturing jobs and creates McDonalds like local print and assemble parts jobs - though much of this can be automated. There will be an increase in local delivery jobs to deliver these products to customers. And there will be improved recycling procedures and policies for materials when used up. If you want to get into this emerging industry, find a way to create the corner kiosk production center - probably initially located near industrial parks and small manufacturers with limited funds who would like fast prototyping without having to invest in the knowledge to operate these machines and pay costs to maintain and operate a machine they don't use all the time. Perhaps a technology incubation center, or small business support facility. It will take a lot of understanding what kinds of small parts people could benefit from your production of them locally. Then franchise the operation. ",
            "date": "Answered July 18, 2014",
            "views": "27",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kelly Erickson",
                    "user_href": "/profile/Kelly-Erickson"
                },
                {
                    "user_id": "Zeeshan Ali",
                    "user_href": "/profile/Zeeshan-Ali-335"
                },
                {
                    "user_id": "Daniel Rhodes",
                    "user_href": "/profile/Daniel-Rhodes-9"
                },
                {
                    "user_id": "Deeptish Pawar",
                    "user_href": "/profile/Deeptish-Pawar"
                },
                {
                    "user_id": "Harshan Nampoori",
                    "user_href": "/profile/Harshan-Nampoori"
                },
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                },
                {
                    "user_id": "Matej Korytar",
                    "user_href": "/profile/Matej-Korytar"
                },
                {
                    "user_id": "Earls Hobby Shop",
                    "user_href": "/profile/Earls-Hobby-Shop"
                },
                {
                    "user_id": "Jonathan Ippolito Gays",
                    "user_href": "/profile/Jonathan-Ippolito-Gays"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiara Owens",
                "href": "/profile/Kiara-Owens-15"
            },
            "answer_text": "During the next 10 years, 3D printing is well positioned to begin to revolutionize manufacturing processes and methodologies worldwide. The word ‘revolutionise’ is used because until now most plastic and metal parts relied on older, and in some cases ancient, molding technologies for shaping parts and products into the required design. 3-D printing technology has come a long way in recent years, and it's really started to mature in terms of its capabilities and real-world applications. It's no longer just theoretical -- it's practical in a wide variety of instances, and that's good news for 3-D printing innovators and early adopters, as well as for the rest of the world. It is still at the beginning of the true 3-D printing revolution, and it's likely that as the technology improves and comes down in price, we'll continue to see innovative ways of putting 3-D printing technology to good use. Nevertheless, there are some pretty cool uses of the technology on the market already and a strong indication of further disruption to come. 3D printing, promises to create such parts and products by simply printing the shape in a standalone process. Furthermore, 3D printing has the capability of not only printing very complex parts, but also printing completely integrated part combinations as a single finished product, and in many cases being able to print more complex designed parts than could ever be done by traditional molding processes. Four key factors will define the future growth of 3D printing, namely: Improving printer capabilitiesBroadening applicationsNew print toolsRaw materials advance.All 3D printing technology is based on a relatively simple principle that if enough 2D cross-sectional layers can be ‘built’ on top of each other in the proper design sequence, then a 3D shape and model can be created. Therefore, a 3D model or design is simply the successive layering of 2D cross-sectional patterns of the intended 3D design. Technologies differ in the way the 2D layers are created and what types of materials constitute the layers. Expected improvements will come from a variety of important performance changes, including: New designs for CAD programs and improved STL file interface, or replacement of standard STL files by new 3D programming instruction codesMore accurate and precise digital control of 3D equipmentFaster printing speed (use of multiple printing heads) and material application designsNew materials and chemistry to meet improved printing speed, enabling multi-materialsImprovements to allow greater use of metal and ceramicsTo get more about the future of 3D printing, visit 6 Must-See ISA Sign Expo Sessions To Catch and Why | Massivit 3D. ",
            "date": "Answered May 8, 2018",
            "views": "5",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paul Oroborust",
                    "user_href": "/profile/Paul-Oroborust"
                },
                {
                    "user_id": "Sumit Negi",
                    "user_href": "/profile/Sumit-Negi-89"
                },
                {
                    "user_id": "Rob Shuttleworth",
                    "user_href": "/profile/Rob-Shuttleworth"
                },
                {
                    "user_id": "Zeeshan Ali",
                    "user_href": "/profile/Zeeshan-Ali-335"
                },
                {
                    "user_id": "Sunil Mathpal",
                    "user_href": "/profile/Sunil-Mathpal"
                },
                {
                    "user_id": "Sasank Bonagiri",
                    "user_href": "/profile/Sasank-Bonagiri"
                },
                {
                    "user_id": "Jer Ram",
                    "user_href": "/profile/Jer-Ram"
                },
                {
                    "user_id": "E. Marin",
                    "user_href": "/profile/E-Marin"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-16335"
                },
                {
                    "user_id": "Tim Holmes",
                    "user_href": "/profile/Tim-Holmes-57"
                },
                {
                    "user_id": "Christopher Perkins",
                    "user_href": "/profile/Christopher-Perkins-46"
                },
                {
                    "user_id": "William Smith",
                    "user_href": "/profile/William-Smith-1034"
                },
                {
                    "user_id": "Hamza Riazuddin",
                    "user_href": "/profile/Hamza-Riazuddin-1"
                },
                {
                    "user_id": "Fatema Tuz Zohra",
                    "user_href": "/profile/Fatema-Tuz-Zohra-6"
                },
                {
                    "user_id": "Baki Billah",
                    "user_href": "/profile/Baki-Billah-7"
                },
                {
                    "user_id": "Ilgaz Er",
                    "user_href": "/profile/Ilgaz-Er"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Liu",
                "href": "/profile/William-Liu-351"
            },
            "answer_text": "Speaking of the future of 3D printing, I want to say the 3D printing application in our daily life first, especially during the Corona-virus pandemic. In order to solve the problem of the shortage of emergency supplies in epidemic prevention and control, a lot of countries start using 3D printers to produce ventilator accessories, personal protective masks. 3D printing plays an important role in global epidemic prevention and control. More importantly, 3D printing does not require mould opening, integrated moulding, and has a short production cycle. It is very suitable for the production and rapid delivery of products with complex structures and small batches. So based on the above, it is widely used in prototyping, custom production, and complex parts of manufacturing. Last but not least, with economic development and the improvement of living standards, consumers are more pursuing more personalized needs. 3D printing will be integrated with robots, artificial intelligence and other technologies to increase the flexibility of manufacturing production lines. 3D printing can produce customized products at very low costs. The production model is transformed from mass production to individual customization. At the same time, with the advantages of saving warehousing and logistics costs and quickly responding to the local market, 3D printing will promote the development of manufacturing to a local manufacturing model. I have no doubts that along with the in-depth promotion of 3D printing education and the rise of the maker movement. Home printers and small 3D printing shops will become more and more popular, and people will be able to make products of their own design. In the future, with the development of 3D printers, materials and post-processing technologies, the application fields of 3D printing will continue to expand.. ",
            "date": "Answered August 28, 2020",
            "views": "339",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kabir Ahlawat",
                    "user_href": "/profile/Kabir-Ahlawat-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tasha White",
                "href": "/profile/Tasha-White-67"
            },
            "answer_text": "If you try to imagine the future of 3D printing, the imagination will draw a rather interesting picture. Taking into account the great interest of scientists in the method of 3D bioprinting, which is one of the most promising technologies of 3D printing, the production of artificial organs on a 3D printer is not far off. It is also safe to say that the future of 3D printing will bring us radical changes in such areas as: Construction. 3D printing of houses, or contour construction, attracts many with its futuristic and simplicity. The first steps in this direction have already been taken. Pioneers in 3D home printing were the Chinese, followed by the Dubai government's discovery of contour construction. The city of the future has already built its first 3D printed office building, and a whole block is planned to be printed in the near future. And just recently, the first printing house in Europe was built on a 3D printer; Electronics. Listing the prospects of 3D printing, this item should be given special attention. Scientists believe that 3D printing of electronics will be the future of digital devices, and it is not without reason. At present, research on the properties of graphene and its application in additive production is being actively conducted. A huge breakthrough in this field is the creation of a graphene battery with an unlimited service life on a 3D printer; Automotive and aerospace industries. The future of 3D printing is largely based on its ability to reproduce almost any element of varying complexity. In this connection, already now the 3D press is widely applied at working out of planes, cars and satellites. ISS even has its own 3D printer, not to mention a number of successful results of 3D-printing of cars. Pharmaceutical industry. Yes, yes, you can imagine. The future of 3D printing is in the manufacture of pills and other medicines. The confirmation of it are the tablets legalized in the USA from epilepsy, made on a special technique. The essence of this perspective of 3D printing is the gradual release of active substances, so that instead of many pills you can take just one. Food industry. 3D food printers are gradually taking up space in cafes and restaurants. While this is probably one of the most dampest 3D printing technologies, it also has potential. 3D food printers are particularly interesting for the possibility of making food for astronauts, as well as the freedom of culinary talent. This is confirmed by the amazing 3D printed desserts of our compatriot. ",
            "date": "Answered August 1, 2019",
            "views": "25",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Oroborust",
                    "user_href": "/profile/Paul-Oroborust"
                },
                {
                    "user_id": "Junaid Akhtar",
                    "user_href": "/profile/Junaid-Akhtar-179"
                },
                {
                    "user_id": "David Withers",
                    "user_href": "/profile/David-Withers-38"
                },
                {
                    "user_id": "Mohini Dey",
                    "user_href": "/profile/Mohini-Dey-1"
                },
                {
                    "user_id": "Annah",
                    "user_href": "/profile/Annah-13"
                },
                {
                    "user_id": "John Olsen",
                    "user_href": "/profile/John-Olsen-135"
                },
                {
                    "user_id": "Rob Shuttleworth",
                    "user_href": "/profile/Rob-Shuttleworth"
                },
                {
                    "user_id": "Lyle Hamer",
                    "user_href": "/profile/Lyle-Hamer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avinash Kumar Mehta",
                "href": "/profile/Avinash-Kumar-Mehta-7"
            },
            "answer_text": "A lot of people ask, is 3D printing hype? And I'm really a strong believer that not only is it a big revolution, but we haven't seen most of it yet. We've only seen the tip of the iceberg. Part of it is this expansion in materials. Right now, most 3D printers print in relatively passive materials. You have plastic, some print in metal. Maybe ceramics. But these are sort of single materials, they're fairly passive materials. But as the technology expands to printing in active materials, materials that conduct electricity, materials that can sense, can move, can compute, can store power. If you can print in a dozen base materials simultaneously the combinations of those materials, you can use to create objects in 3D, what we call metamaterials, is far greater than just 12. It's a power of 12. That's just, in the exponential nature of this technology. The design space, the things that we can make expand so dramatically that anything we make today from these passive materials will pale in comparison. And so that's why I think that we really are just at the beginning of what is a long journey in this ability to create objects with multiple materials with active materials really. Moving from passive parts to active systems and that's, I know the design space is vast and unexplored. For everyone: There's one type of printer that everybody would need in their home because they'll need to use it right away. And that's a food printer. I think it's one of these, beyond plastic, metal, and ceramics there's bio-printing, which is very interesting for biology and medicine. But food printing is this idea that basically a printer assembles food for you and cooks it in line, in a data-driven way. So based on your biometrics, on your needs, you can get the food that has the right level of calcium, sugar, protein, vitamins, whatever you need that day, in a data-driven way. So again it's not a, it's not about to replace your entire kitchen but I think it's something that many people will want in their kitchen very much the same way they have an espresso machine. Thank you. Reference: “Fabricated” A book by Hod lipson. ",
            "date": "Answered June 20, 2020",
            "views": "288",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Monika Mehta",
                    "user_href": "/profile/Monika-Mehta-177"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Joseph Andrews",
                "href": "/profile/Matthew-Joseph-Andrews"
            },
            "answer_text": "At this point, in terms of the equipment, we’ve more or less reached a point where we’re up against the laws of physics. A printer can only work so fast against its own inertia and while some steps have been taken to calculate the velocities and deceleration of movements, there’s only so much number crunching you can do on this front before you realize you’ve dug yourself a hole rather than looking for another means of solving the same problem. Granted, I may well be proven wrong, but I’ve yet to see anything for FDM (fused deposition modeling) printing that indicates some unlocked potential, hence companies like Stratasys investing in polyjet printing. From my perspective, the real innovations are going to be in the materials employed. SLA, or resin printing, right now really emphasizes the “prototyping” aspect of printing; the materials simply aren’t strong enough to make practical objects. At best, they’re used to make positives in lost wax or sand casting or some other molding means. This is changing, fortunately. We’re also seeing advances in metal printing processes apart from SLS (Selective Laser Sintering) though a lot of this is still behind trade secrets and non-disclosure agreements. There’s also a process called 4D printing, which is a bit of a misleading term (especially if you’ve an extremely active imagination). NASA is particularly invested in this for the manufacture of satellites and other structures while in orbit. The various bioprinting firms have also experimented with these materials. The idea is that once you print out the desired shape, the piece continues to form itself after the fact. For example, say your build volume is a 20cm cube, but you need a part that’s 50cm in length and it has to be one piece. You could print the piece “coiled up” and have it expand to its full length when exposed to light or heat or a chemical agent. That’s one of many proposed processes, but you get the idea. The mechanical engineering will continue to grow, but may hit a wall sooner than later. The chemical engineering, on the other hand, is just getting started. ",
            "date": "Answered March 28, 2018",
            "views": "26",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Olsen",
                    "user_href": "/profile/John-Olsen-135"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scot Morgan",
                "href": "/profile/Scot-Morgan"
            },
            "answer_text": "The future of 3d printing is something i think about a lot. If you want to make your mark on something, get in the beginning of it. This is still the beginning, the hardware pieces are still developing and growing. the software is infantile still. I imagine that 3d printing will become much more common in every aspect of life, though maybe not as expected. Here is just one example in different categories of what I believe is to come. Restaurants - you want a wedding cake that has little look a like fondant statues of the bride and groom, any baker will be able to do it for you.NASA - Imagine a lunar base, complete with synthetic atmosphere, ready to be staffed, but no human has set foot yet. a 3d printer robot landed and started building. 3d printing is by far not limited to plastics, I have seem metal printers, concrete printers, and even glass printers.Hospitals - already there are printers that use your own skin to make more skin for your 3rd degree burn. Surgeons print life models of infant brains and hearts so they can practice an upcoming surgery. in the future they will be able to print living organs with no fear of rejection because it was made from your own stem cells. WestWorld comes to mind.This is just the tip of what is to come, and to be honest I am already behind as much of this is already being created. see below. Bocusini - World's first plug & play 3D Food Printing System Team Develops 3-D Printed Heart To Help Pediatric Surgeons New brain surgery trick: Practice on a 3-D model International Space Station’s 3-D Printer     ",
            "date": "Answered September 25, 2017",
            "views": "942",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Morgane Alinaï",
                    "user_href": "/profile/Morgane-Alinaï"
                },
                {
                    "user_id": "Davis Gathinji",
                    "user_href": "/profile/Davis-Gathinji"
                },
                {
                    "user_id": "Jan Moralee",
                    "user_href": "/profile/Jan-Moralee"
                },
                {
                    "user_id": "Teresa Spanics",
                    "user_href": "/profile/Teresa-Spanics"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheshadri Ramalingam",
                "href": "/profile/Sheshadri-Ramalingam"
            },
            "answer_text": "The future development of 3D printing is 4D printing!!. This is a brand new technology which is under the roof of research and has potential application in the field of bio-medical and logistics. 4D printing is not a physical 4th dimension the 4th 'D' corresponds to the time dependent transformation of a shape memory material in response to some stimuli. The stimuli can be anything like temperature,pH, force etc., This technology is actually a bio-mimetic (resembling nature) from the movement of sunflower with respect to sun movement. One notable and potential application of this 4D printing is tissue printing. There are special type of 3D printers called bio - printers which uses bio-inks to print tissues. These bio inks has droplets with DNA reinforced in them thus they can synthesis protein and resembling real muscle!!. To understand this concept in a better way avenger VISION from the movie age of ultron is the first bio printed avenger. Organs like kidney ear can be printed. Even small tissues like bronchioles can be printed and it has been proved functional (tested with 3 patients) . Many other technology such as tracheobronchial split is based on this 4D printing. Hope this is useful!! ",
            "date": "Answered March 12, 2019",
            "views": "938",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "C Haridev",
                    "user_href": "/profile/C-Haridev"
                },
                {
                    "user_id": "Harikishan T S",
                    "user_href": "/profile/Harikishan-T-S"
                },
                {
                    "user_id": "Hari Haran",
                    "user_href": "/profile/Hari-Haran-1284"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johni Barresto",
                "href": "/profile/Johni-Barresto"
            },
            "answer_text": "Imagine printing a new valve for a broken water faucet or a new plate when your five-year-old drops the good dishes. Imagine not being limited by commercial pipe sizes or designs requiring individual pieces that can be fit together by current commercial equipment. Imagine custom creating every gift given to each friend or family member to incorporate favorite song lyrics, literary quotations, inside jokes, or photographs. This world isn’t yet a reality, but it’s getting closer every day thanks to advancements in the field of rapid prototyping and 3-dimensional printing. The new cancer application also involves 3D molds that can be filled with liquid, allowing experts to see in detail the flow of radiopharmaceuticals. Radiopharmaceuticals are drugs containing radioactive material that may be injected into a vein, taken by mouth or placed in a body cavity. They are used to treat a number of different tumors, including thyroid cancer, cancers of nerves cells in children and certain tumors that have spread to the bones. Often, the difficulty in this procedure is calculating a dose that is high enough to kill the cancer cells without causing too much damage to healthy tissue. In the future, accurate modeling could allow doctors to fine-tune dosing. Using duplicates in reconstructive surgery As part of reconstructive surgery, plastic surgeons have begun using 3D printers to help create duplicates made from polymers. Models from 3-D printers serve as templates and help surgeons carve out bone replicas as well. Experts believe that the use of digital planning in prosthesis development produces superior results by reproducing the exact shape from CAT-scan data. This makes the replacement bones a good match to the patient’s natural bone. Engineers and physicians print entire prosthetic limbs, which helps to create a more exact fit for patients. Here are the best 3d printers listed here. Children with prosthetics also can benefit as the children grow and need replacements. Digital blueprints can be kept in their files for reference, and because the process requires less labor, the price is more affordable. 3D printing also has been used in making tablets and sensors for post-operative care, which can be implanted in a patient’s body, prosthetic parts, tissues with blood vessels, cardiovascular models, bones, ear cartilage, heart valves, and replacements for cranium and synthetic skin. New applications of 3D printing are being used in the medical field every day. Researchers are developing printers that can print out human tissue or even pills. In the future, patients may be able to print their own drugs at home. ",
            "date": "Answered October 6, 2018",
            "views": "263",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Israt Jahan",
                "href": "/profile/Israt-Jahan-48-1"
            },
            "answer_text": "We find ourselves on the cusp of another industrial revolution. 3D printing has reached a tipping point, and it’s about to become mainstream in a big way. While many engineers and hobbyists have used this innovative manufacturing technology in their daily work, much of the general public is still unaware of this powerful new tool. However, this is about to change as 3D printing continues to become more accessible. At its core, 3D printing is a process that allows for the creation of solid objects from digital files. Also known as additive manufacturing, this technique is unique from other manufacturing techniques. Traditionally, manufacturing has relied on subtractive techniques, which require huge machines that cost tens of thousands of dollars. On the other hand, 3D printing can be accomplished on desktop-friendly machines. Using affordable materials like plastics, these printers can create everything from novelty figurines to hard-to-find automotive parts. Believe it or not, NASA even uses a 3D printer on the International Space Station to print custom tools! Affordability, accessibility, and a shallow learning curve combine to drive the impact of 3D printing on businesses, workforces, and societies. Impact on Businesses In 2019, 51% of enterprises actively used 3D printing in production, largely for proof of concept and prototype testing. When over half of businesses adopt a technology, it’s no longer a fad. Instead, it’s the future, and additive manufacturing is poised to transform the way organizations around the world approach manufacturing, supply chains, and beyond. Some of the key impacts that 3D printing will have on businesses include: Rapid Prototyping: 3D printing allows for small batches of parts to be created in only a few hours. This has given rise to the art of rapid prototyping, which enables businesses to test a new concept or idea in days instead of weeks. Popular toymaker Hasbro leverages this approach when designing new products, which allows them to get to market faster than their competitors.Lower Manufacturing Costs: Transitioning early-stage manufacturing processes from traditional methods to 3D printing leads to lower manufacturing costs. In most cases, it’s much cheaper to create prototypes, jigs, tooling, and fixtures using additive manufacturing. However, processes like injection molding are still more affordable at scale, so shifting all manufacturing to 3D printing is not yet practical.Fewer Supply Chain Woes: 3D printing files can be viewed as the storage of spare parts in the cloud. It’s the perfect solution for low volume parts that are only needed on occasion. Parts can be designed in Europe or Asia and then manufactured in North America over the course of a single day, which completely redefines the supply chain. When leveraged effectively, additive manufacturing can eliminate the cost and time of shipping for certain components.As we have seen, the future of 3D printing will offer key benefits to countless businesses. Similarly, the widespread adoption of additive manufacturing is sure to positively impact workforces around the world. Impact on Workforces It’s no secret that the workforce for industries like manufacturing has been in flux for the past few decades. The rise of globalization has driven an increasing number of jobs to wherever the cheapest labor can be found. This trend, combined with a steady rise in automation, has made well-paid manufacturing jobs more difficult to find. However, there’s good news to be had. 3D printing is poised to positively impact workforces in several ways, including: New Job Growth: While job growth in traditional manufacturing sectors is floundering, additive manufacturing is driving job growth in key areas. From 3D computer-aided design (CAD) to equipment technicians, there are an exciting number of new job openings driven by this innovation. Better yet, initiatives are in the works to retrain displaced blue-collar manufacturing workers for white-collar jobs in 3D printing.Freelance Manufacturing: The widespread availability of affordable 3D printers is leading to the creation of freelance manufacturing opportunities. For example, websites like Shapeways allow anyone to open their own 3D print shop online. This presents a fantastic opportunity for entrepreneurial individuals who want to pursue modern manufacturing opportunities.Educational Opportunities: While today’s workforce is working to adapt to a world with 3D printing, future generations will benefit from more educational opportunities. Additive manufacturing is already becoming a key component of high school, with a number of post-secondary offerings also under development. Look for the next generation of workforce professionals to be well-versed in additive manufacturing fundamentals.This is a truly exciting time for workforce professionals interested in additive manufacturing. Nevertheless, one could argue that the greatest impacts of 3D printing will be on society as a whole. Impact on Societies Amazon and other digital retailers have driven the rise of throw-away culture. After all, why should you spend the time to repair something if a replacement is just a few clicks away? While this is a reasonable argument, it’s impossible to maintain in a world grappling with the early effects of climate change. Thankfully, the growing popularity of 3D printing is revitalizing the practicality of repair, which could have massive impacts on our world: Maker Culture: Consumer-grade 3D printers are a direct result of maker culture, a movement using modern technology to redefine DIY repairs. The maker movement encourages individuals to leverage additive manufacturing to make the most out of what they already have, which is key to sustainability. From household repairs to unique designs, there are 3D printing ideas for everyone.A New Generation of Innovators: In the 1980s, the growth of computers led to a generation of innovators. In many ways, the development of 3D printing is mirroring this trend. Dozens of innovators and business leaders are already leading the way with this new technology.3D printing is already having a profound impact on businesses, workforces, and societies. Believe it or not, this is just the beginning of an exciting trend. As 3D printers continue to improve and become more affordable, look for innovation to become the new normal in the world of additive manufacturing. ",
            "date": "Answered October 10, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Pako-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monica Chandran",
                "href": "/profile/Monica-Chandran-3"
            },
            "answer_text": "3-D printing is an unstoppable force. Not too long ago, the printing speed and limited output of 3-D printers made them suitable only for rapid prototyping. But in the coming years, 3-D printers will be at the heart of full-scale production capabilities in several industries, from aerospace to automotive to health care to fashion. Manufacturing as we know it will never be the same. The stage for this change wasn’t set overnight. Decades of innovation have led us to the precipice of the 3-D printing industrial revolution. But recent advancements in speed, printing technology and material capabilities are now aligned, and together they will push the entire industry forward. Along with growing competition and investment in the 3-D printing industry, these new capabilities will reshape custom manufacturing. The 3-D printing industry is on the verge of another tipping point, and here are the reasons why. Innovations In Direct-Metal Printing Direct-metal printing is getting faster and more capable, and many new technologies are now coming into play. The number of metal alloys that can be 3-D printed is on the rise, and they have exceptional performance characteristics. You can get high-performance lightweighting and complexity that is impossible with traditional design and manufacturing processes. With these changes, imagine the possibilities: Complex and highly detailed products critical for the aerospace, automative and mechatronic industries will soon be available for production at a fraction of the cost. If your car needs a repair, you’ll soon be able to purchase a shift knob or fuel-door hinge pin that was quickly and inexpensively printed. Aerospace engineers will use the same technology to produce jigs and fixtures for spacecrafts. The implications are staggering. What’s more, there are fully automated, multistation direct-metal printers that are essentially an entire factory in a box. With automated parts changes and material replenishment, they can literally operate around the clock. GE is a major player in the direct-metal printing field, and the company predicts that its metal business alone will surpass $1 billion in annual revenue in the next couple years. And early-stage companies such as Desktop Metal and Markforged have received several hundred million dollars in funding to deliver entry-level direct-metal systems that print from a metal-plastic filament. So on one hand, entry-level grassroots companies will disrupt conventional CNC machining and local machine-shop businesses. And on the other, you see high-complexity precision aeroframe manufacturing solutions from GE and many other 3-D companies. Innovations In Printing Speed For decades, 3-D printing has been capable in terms of geometric precision and accuracy, but printing speeds remained very slow. But this too is changing. The CLIP technology from Carbon 3D and similar technologies from companies like one of mine, Nexa 3D, are capable of continuously printing photo-curable polymers at very high speeds -- 40 or 50 times the speed of a conventional stereolithography 3-D printing system. With the ability to print a centimeter every minute, these systems will no doubt play a major role in the design-to-manufacturing cycle. While a similar job used to take days, now you can get parts in your hand in five, 10 or 15 minutes. It will also unleash work with completely new chemistries, particularly within several variants of urethane. You can make the output rigid, semi-rigid or flexible, and these kinds of variations in chemistry open up a lot of end-use applications, from athletic shoes to vehicle interiors to apparel. ",
            "date": "Answered September 25, 2018",
            "views": "443",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Radomsky",
                "href": "/profile/Andrew-Radomsky"
            },
            "answer_text": "The fourth technical revolution is in full swing. Thanks to 3D printing, many areas of business have been blessed with a fresh breath of air in doing business. Medicine & healthcareLimb prosthetics, stimulators of bone growth, synthetic skin and lungs are just an indicative list of the possibilities of modern 3D engineering. BuildingA huge niche that benefits a lot from 3D printing. Chinese entrepreneurs have demonstrated the ability to even print apartment buildings in a matter of hours. Fashion3D printing allows you to create exquisite, unique products using materials that are not used or difficult to process in traditional production: development of comfortable sandals, insoles according to individual patterns; contemporary design and production of affordable jewelry using innovative materials; the creation of individual glasses according to scans of customers' faces. DesignStartups enabling the production of unique forms using non-standard materials: unique fixtures made from environmentally friendly materials based on corn; the ability to choose readymade 3D printable objects for unique products or the embodiment of your own creative ideas. Food industry3D printing provides a wide field for the production of new products from non-standard ingredients, minimizing the percentage of waste: a printer that creates food products from fresh ingredients of a strictly specified size and shape; a chain of restaurants with 3D printing that combines advanced features and traditional aesthetics in fine cuisine. EntertainmentOne of the pioneers in 3D printing technology adoption. Using innovations, it is possible not only to create unique toys of authentic design but also to produce figurines based on a scan of the body, of any size and purpose. ",
            "date": "Answered February 12, 2020",
            "views": "337",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nikita Diachenko",
                    "user_href": "/profile/Nikita-Diachenko"
                },
                {
                    "user_id": "Diana Latypova",
                    "user_href": "/profile/Diana-Latypova-3"
                },
                {
                    "user_id": "Adrian Sandu",
                    "user_href": "/profile/Adrian-Sandu-16"
                },
                {
                    "user_id": "Kateryna Davydova",
                    "user_href": "/profile/Kateryna-Davydova-1"
                },
                {
                    "user_id": "Helga Zabalkanskaya",
                    "user_href": "/profile/Helga-Zabalkanskaya"
                },
                {
                    "user_id": "Deandre Davis",
                    "user_href": "/profile/Deandre-Davis-39"
                },
                {
                    "user_id": "Helen Merka",
                    "user_href": "/profile/Helen-Merka"
                },
                {
                    "user_id": "Alexandra Gladchenko",
                    "user_href": "/profile/Alexandra-Gladchenko"
                },
                {
                    "user_id": "Olya Ilnytska",
                    "user_href": "/profile/Olya-Ilnytska"
                },
                {
                    "user_id": "Marian Danko",
                    "user_href": "/profile/Marian-Danko"
                },
                {
                    "user_id": "Anna Zinchenko",
                    "user_href": "/profile/Anna-Zinchenko-7"
                },
                {
                    "user_id": "Sonia Hanson",
                    "user_href": "/profile/Sonia-Hanson-6"
                },
                {
                    "user_id": "Alice Wise",
                    "user_href": "/profile/Alice-Wise-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sushant Arora",
                "href": "/profile/Sushant-Arora-6"
            },
            "answer_text": "Let’s divide this question into different aspects of 3D printing: technology, application, and growth. Technology: These technologies will become mainstream soon: 4D Printing: A 3D-printed structure transforms itself into another structure over time or due to an external stimuli.Tomography-based 3D Printing: It uses biological fluid or translucent plastic to 3D print high-precision objects in less than 30 seconds.3D resins from food waste: The use of cooking oil and other food waste for 3D printing purposes.Applications: Commercial Aerospace: You might witness rockets with 3D-printed parts by some powerful and massive 3D printers.Affordable housing: 3D Printed-houses will meet the challenge of homelessness across the globe.3D-Printed Vehicles: Soon, you might drive cars with 3D printed bodies and other parts.The industries like healthcare, dental care, and manufacturing will also witness dominance of 3D printing. Growth: The global 3D printing market is expected to reach USD 34.8 billion by 2024, as predicted by Markets and Markets. The sales of compact industrial metal printers are expected to cross 1.05 billion dollars by 2027. Other Predictions: 1) There will be a significant drop in prices of materials and hardware 2) It will become a mainstream technology in almost every developing country. 3) Almost every school will introduce it in their curriculum. 4) Design software will become easier to use. Get updates from the realm of 3D printing from here: https://www.mystem3d.in/blog.html. Sources: 3D Printing Market by Offering (Printer, Material, Software, Service), Process (Binder Jetting, Direct Energy Deposition, Material Extrusion, Material Jetting, Powder Bed Fusion), Application, Vertical, Technology, and Geography - Global Forecast to 2024. THE FUTURE OF 3D PRINTINGHow 4D Printing Will Impact Additive ZoneWelcome to McDonald’s; Would you like resin with that?10 Predictions on the Future of 3D Printing [Expert Roundup]Smart Tech Analysis",
            "date": "Answered February 18, 2020",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wim ten Brink",
                "href": "/profile/Wim-ten-Brink-1"
            },
            "answer_text": "Well, 3D printing is too expensive for manufacturing of parts, unless we’re talking about extremely small parts. The reason for this is because the voxel size will matter and smaller voxels will create more details, but will require more energy to get the voxels in the right location. So for making some 3D model in large quantities, you would basically just print a single object and use that to make a mold. You can then use the mold to make as many copies of this object as you like. But the big advantage for 3D printing is prototyping, especially when combined with electronics. Right now, 3D printing is mostly used for decorative purposes and jewelry and occasionally to make new parts that broke down and need to be repaired but their biggest advantage is when you combine 3D printing with the production of electronic devices, especially prototypes. For example, a lot of people are messing around with Arduino boards and there are models for cases for these kinds of boards. Something like this, for example:  And this is where the biggest innovation for 3D printing lies, combined with consumer electronic toolkits like the Arduino. People can now create their own robots, radios and lots of other electronic tools, connect them to the Internet or with Bluetooth to a mobile device and create all kinds of neat things. And this electronics needs to look neat when people actually want to use it. For companies, it also becomes interesting at a slightly more advanced level as they can use 3D printing for their own prototypes. A car manufacturer, for example, could make small versions of their cars as models showing what the result would look like. Most of it would be designed on the computer but before they make it at the original size, they could make on at a 1:12 scale as sample. Same for an architect, who can use the computer to design a complete house and then print it scaled in 3D for the customer to evaluate. He would have a real 3D model that their customers could hold and look at from all directions. Mostly, they would need some handwork and proper craft skills to make it but this way, the computer will just make it for them. So, the future for 3D printing will mostly be prototyping so models can be made before they continue to work on the product and make it final. The 3D printer could also be used to make molds that would later be used for mass production. But 3D printing requires a lot of energy and a lot of time since a small print like the Arduino box above will easily take 12 hours or more… ",
            "date": "Answered September 22, 2017",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ishan Kulkarni",
                    "user_href": "/profile/Ishan-Kulkarni-26"
                },
                {
                    "user_id": "Ana Licata",
                    "user_href": "/profile/Ana-Licata-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Dany",
                "href": "/profile/Joseph-Dany"
            },
            "answer_text": "3D printing -- also known as additive manufacturing -- turns digital 3D models into solid objects by building them up in layers. The technology was first invented in the 1980s, and since that time has been used for rapid prototyping (RP). However, in the last few years, 3D printing has additionally started to evolve into a next-generation manufacturing technology that has the potential to allow the local, on-demand production of final products or parts thereof. Already it is possible to 3D print in a wide range of materials that include thermoplastics, thermoplastic composites, pure metals, metal alloys, ceramics and various forms of food. Right now, 3D printing as an end-use manufacturing technology is still in its infancy. But in the coming decades, and in combination with synthetic biology and nanotechnology, it has the potential to radically transform many design, production and logistics processes. 3D printers may also be used to make future buildings. Demonstrating the potential, over in China an amazing company called WinSun Decoration Design Engineering has already 3D printed a number of houses. Produced using a vast material extrusion 3D printer, these include a 1,100 square meter mansion and a five storey apartment block. Another future application is the use of 3D printers to create replacement organs, and even to directly repair the human body in situ. This is known as bioprinting, and is an area of rapid development. You can learn more on the bioprinting page, or see more in my bioprinting video or the Future Visions gallery. ",
            "date": "Answered April 21, 2017",
            "views": "394",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Herman Waltz",
                "href": "/profile/Herman-Waltz"
            },
            "answer_text": "The technology for 3-D printing, also known as additive manufacturing, has existed in some form since the 1980s. However, the technology has not been capable enough or cost-effective for most end-product or high-volume commercial manufacturing. Expectations are running high that these shortcomings are about to change. Several technology trends are feeding these expectations. An emerging class of mid-level 3-D printers is starting to offer many highend system features in a desktop form factor at lower price points. Printer speeds are increasing across the product spectrum; at least one high-end system under development could print up to 500 times faster than today’s top machines. And key patents are about to expire, a development likely to hasten the pace of innovation.  A wide range of commercial 3D printers for industrial application are now available from a range of manufactuers, the two largest of whom are 3D Systems (which works with most technologies and is rapidly acquiring many smaller manufacturers) and Stratasys (which offers FDM and polyjet matrix harware, as well as special 'drop on demand' wax 3D printers for dental work). Both of these companies had a market capitalization at the end of 2012 of over $3 billion. Other large 3D printer manufactuers that are publically traded are Archam (which produces electron beam melting (EMB) machines), the aforementioned ExOne with their metal and sand binder jetting 3D printers, and Organovo, who specialize in bioprinting. Other large but private 3D printer manufacturers of note include EnvisionTEC (who specialize in DLP projection hardware but also make a 'bioplotter' for tissue engineering), EOS (who make selective laser sintering devices for producing objects in metals or sand), Voxeljet (who make really large printers for binder jetting in sand or plastic powders), SLM Solutions (who specialize in selective laser melting), and Optomec (who produce directed energy deposition printers using their own 'laser engineered net shaping' (LENS) technology). You can find information on these and other industrial 3D printing manufactuers in my 3D Printing Directory. Prices for most commercial/industrial 3D printers tend to start in the ten-to-twenty thousand dollar bracket and spiral upwards into the hundreds of thousands of dollars for very-high-end machines that can build fully-dense metal parts. Although some desktop models are on the market, most commercial 3D printers are usually fairly bulky and often floor-standing. The above prices noted, it is already possible for lone designers and private individuals to obtain quality 3D printouts from high-end 3D printing hardware by using an online bureau. For example, Shapeways, iMaterialize and Sculpteo allow anybody to upload their 3D computers models to have their designs 3D printed and marketed online. More information on a wider range of 3D printing services can also be obtained from my 3D Printing Directory. ",
            "date": "Answered April 11, 2016",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Olsen",
                    "user_href": "/profile/John-Olsen-135"
                },
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chip Hill",
                "href": "/profile/Chip-Hill"
            },
            "answer_text": "3D printing is still in its infancy. The MaketBot is one of the most popular desktop printers on the market. At the same time, commercial printers are more capable but much more expensive. This situation is similar to the late 1970’s and early 80’s when personal computers first came on the scene. The Apple II could be purchased for a few thousand dollars (in 1980 terms), had a monochrome green and black screen that only displayed capital letters. Shortly after that the public was wowed with the arrival of Flight Simulator software, in monochrome green. At that time, no one could imagine, much less predict the computer based technology of today. The Internet, Amazon, you tube, Pandora, kickstarter, Bitcoin encryption, and more have been developed as a result of computer technology. 3D printing, or additive manufacturing as it is known by engineers, is poised to change things drastically. One of the main differences between the growth of computer technology and the growth of 3D printing is that 3D printing has the added benefit of the Internet to fuel its growth, so things will be happening more quickly. That's a long way of saying that no one really knows what will happen. It is plausible that someone out there right now in a lab or a garage is working on an idea that others may have missed and that may move the whole thing ahead. It will most likely be an iterative process of trial and error. It will be fun to watch. ",
            "date": "Answered June 22, 2016",
            "views": "941",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mattia Battistich",
                    "user_href": "/profile/Mattia-Battistich"
                },
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                }
            ]
        },
        {
            "author_info": {
                "name": "Madhuri Gajera",
                "href": "/profile/Madhuri-Gajera-2"
            },
            "answer_text": "3D Printing: A New Approach To Building Design Plan Scientists, these days, are adopting 3D printing approach and robots to design, plan and build a house. The latest example of 3D printing and robots is the DFAB House. Eight scientists from one of the known Switzerland university are planning to build a three storey house at the Empa and Eawag Nest building in Dübendorf. It is claimed that the DFAB house is the first house in the world to use digital process not only for designing and planning but also building. It is a live \tproof of the first generation robots building a 200 sq foot house.The \tproject is said to use bleeding edge technologies like 3D printing \tand robots for building design plan and construction. Unlike other construction projects that use only a \tsingle digital process, this project will bring in a range of such processes together for building construction.Earlier, this technology was not so popular as it was complicated and expensive. However, use of 3D printers is increasing these days and it is gaining popularity in industrial practices. 3D printing can be used for creating anything from prototypes to highly technical final products such as airplane parts, medical implants, automobile and even artificial organs using layers of cells. Application of 3D printing in building design plan: 3D printing is termed as ‘additive manufacturing’ when referring to its use within a manufacturing setting. This additive manufacturing provides convenience to build models. In the field of architecture, it is used for creating first renderings of the project. . It is also possible to create a number of design iterations for just one project using 3D printing which is not possible using traditional methods. This allows for Custom House Plan to be made easily. With 3D printing, it is easy to design any kind of structure freely which also includes creating Building Architectural Drawing. It offers a lot of freedom while creating the designs which is really a good advantage to architects. One can 3D print a variety of projects with different designs like offices, hotels, tiny homes, real villas or homes. We can say that 3D printing is the next generation of building design plan. A 3D printed house in just 24 Hours: A Russian company has built a 400 square foot house from scratch within just 24 hours! Standing still in Moscow, this Apis Cor house was built using nothing but 3D printer to give impressive results. It is indeed a matter of fact to built such a house on site within a short duration at low cost. This house is a live example to explain how technology and 3D printing will revolutionize the construction industry in near future. Summary:  Read full content here: 3D Printing: A New Approach To Building Design Plan ",
            "date": "Updated April 6, 2018",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darshit Purohit",
                    "user_href": "/profile/Darshit-Purohit-1"
                },
                {
                    "user_id": "Damion Hamilton",
                    "user_href": "/profile/Damion-Hamilton-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "George French",
                "href": "/profile/George-French"
            },
            "answer_text": "As Kyle says 3D printing is best suited to small volume production and customisation. So stuff to really fit people. It is already used in dental implants, hearing aids, and to make prosthetic sockets etc that fit perfectly to the wearer. But down the line, making less obvious things like bicycle saddles that are based on a scan of the riders body offers the potential for real comfort improvements. As the technology matures we may well see things like shoes custom printed to fit the individuals feet, glasses to fit noses and ears, helmets to fit heads, etc become commonplace. Another advantage 3d printing has is the ability to make geometry that cant be made other ways. This is often over-hyped with hollow metal parts shown that could actually be made by say investment casting. However as designers come to terms with designing for the technique, parts will be made that can only really be made this way. For example we could print very squishy “rubber” parts from a relatively hard elastomer by adding voids to the inside. These would combine light weight properties, with softness, but still have the abrasion resistance of a harder material. On something like an off road tyre this might allow for huge weight savings from inside knobbles, the knobble would be soft enough to conform to the ground for grip but hard enough to have a long service life. Combine this with the ability to print mixed materials and you could put softer grippier rubber where needed too without compromising the strength of the knobbles and making them likely to shear off. As the technology improves designers will get used to making the most of these features and eventually making parts from solid sections of a single material will seem like a ridiculous restriction. ",
            "date": "Answered October 4, 2018",
            "views": "211",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shafiq Bashir",
                "href": "/profile/Shafiq-Bashir-2"
            },
            "answer_text": "The current scenario of any industry tells us a lot about its future. Let us look at the situation of 3d printing right now. By Application, It is being used for-PrototypingToolingFunctional Part Manufacturing By Vertical, It is being used by-Aerospace and DefenseEngineeringHealthcareConsumer ProductsAutomotiveJewelryEducationEnergyArchitecture and ConstructionPrinted ElectronicsFood and CulinaryOthers By Geography, It is being used mostly in- North AmericaEuropeAsia Pacific And, if you look at the number of people having access to 3d printers & the prices of 3d printers today, you’ll realise that it is coming into our homes. More people are learning about it, teaching 3d printing technology to others, and more industries are hiring people with 3D printing skills. My predictions for the future of 3D printing? We’ll see technologies improving to make 3D printing faster, more affordable and with better finishes. Then, we’ll have manufacturing come into our homes - everyone will be a creator. Disclaimer: I am the Founder and Principal of 3DPRMS (3D Printing Materials Store) owned by Meka 3D Printing Pte Ltd. We provide all kinds of 3d Printing Materials and Equipment all over the world. I am here to answer all kinds of queries related to 3D Printing Technology. If you have any questions, feel free to contact me. ",
            "date": "Answered August 3, 2018",
            "views": "332",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alisha Waghmare",
                "href": "/profile/Alisha-Waghmare-1"
            },
            "answer_text": "When it comes to metal 3D printing, it wouldn’t be surprising for 2018 to be a bit uneventful. The reality is that we are still in a sort of trial period and many companies are testing the water to see how the technology can be leveraged for their specific purposes. This year we’ve seen many companies take the plunge and reach out to us about metal 3D printing. This has exposed a knowledge gap when it comes to design-for-manufacturing practices about the process. To help combat this issue, Star Rapid launched online tutorial videos and in-person training at our factory, and other companies have launched various educational initiatives as well. Many companies that know how to design for metal 3D printing have found suitable applications and have ordered parts. But these applications are still in their infancy. Companies are testing small batches of parts to ensure that they successfully operate under real-world conditions with the intended performance. Once this is completed and doubts are erased, the industry will explode with demand. This likely won’t begin to happen until the latter part of 2018. Are there emerging applications for 3D printing? The automotive space is an interesting one to watch unfold. Europe seems to be in an electric car race. Emission limits and electric car incentives are becoming commonplace in this region. Even China has gotten in on the action with electric car mandates. For gas and diesel vehicles, manufacturers continue to seek ways to reduce weight to increase miles per gallon and reduce emissions. Have you noticed that many new cars don’t have a spare tire? That not only reduces weight, but lighter vehicles also have fewer flat tires! 3D printing’s ability to reduce weight, without sacrificing safety or the driver’s experience makes it attractive. The same logic can be applied to electric vehicles. The battery technology is extremely dense and heavy. Lowering weight increases the range a car can get on a single charge – which is very attractive to vehicle manufacturers. In China and globally, we’re seeing renewed interest in additive manufacturing for medical use. In addition to prosthetics that have become quite popular over the last year, we’re also seeing interest in creating medical models and cranium replacements. There is also a growth in micromolding. Micromolding can provide an excellent alternative to designing and manufacturing medical devices used in minimally invasive surgery (MIS). With micomolding, MIS designers don’t have to deal with limitations placed on size or the complexity of material selection for production yields. Medical equipment can be quite expensive so parts created using additive manufacturing present cost-effective, functional alternatives. ",
            "date": "Answered March 12, 2019",
            "views": "321",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Printstop India",
                "href": "/profile/Printstop-India"
            },
            "answer_text": " 3-D printing is moving in several directions at this time and all indications are that it will continue to expand in many areas in the future. Some of the most promising areas include medical applications, custom parts replacement, and customized consumer products. As materials improve and costs go down, other applications we can barely imagine today will become possible.3D printing is yet to find a strong foothold in Indian markets, it is still in nascent stage. Few of the well-known 3D printers and printing service providers in India include Altem Technologies Pvt. Ltd (Indian resellers of the Stratasys Inc.), Chandigarh based LBD Makers, Bangalore-based Brahma3 and Cycloid System, and Mumbai-based Divide By Zero, SharkBots and Kcbots.According to most Indian 3D printers, “small-scale companies are buying them to verify industrial designs and not for mass production”.However, things are looking up for 3D printing, especially in India due to declining costs and wider availability. Basic 3D printers, particularly DIY printing assembly kits seem to be the preferred choice of more and more small-scale companies and hobbyists.The reach of this technology is quite literally boundless as it continues to develop. 3D printing will undoubtedly create more and more opportunities in almost every industry.",
            "date": "Answered July 19, 2018",
            "views": "409",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hussain Bhavnagarwala",
                "href": "/profile/Hussain-Bhavnagarwala"
            },
            "answer_text": "3d printing technology was already being used by the big industrial companies for the sole purpose of prototyping. This technology has slowly been growing and now more materials can be printed other than just plastic. As you can see the technology that has come out more recently is way more expensive than the ones whose patents are over and hence only the large corporate's can use it.  This tech is obviously going to grow as its advantages over weigh its cons ( complexity,cost,scrap reduction). It also has the power to make manufacturing localized, soon people can make their own stuff instead of going to a shop.  Apart from that the printers are going to get cheaper cause the patents will fall off and a lot of companies will jump into it, just like what happened when the FDM patent came off. I think once desktop FDM metal printers come out, the 3d printer will become an household item. Every one will soon be a \" Maker \". Better jump into the maker movement now !! ",
            "date": "Answered September 21, 2014",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "ARTI HINGANE",
                    "user_href": "/profile/ARTI-HINGANE"
                },
                {
                    "user_id": "Nagesh Tallapragada",
                    "user_href": "/profile/Nagesh-Tallapragada"
                },
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                },
                {
                    "user_id": "Dhruba Choudhury",
                    "user_href": "/profile/Dhruba-Choudhury"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prithvi Sinha",
                "href": "/profile/Prithvi-Sinha-12"
            },
            "answer_text": "3D printing, also known as additive manufacturing, is a manufacturing process where a 3D printer creates three-dimensional objects by depositing materials layer by layer in accordance to the object’s 3D digital model. Growing use of 3D printing in automotive industry and rising demand for prototyping and mass customization are expected to drive the 3D printing market during the forecast period. However, high initial investment and required maintenance expertise is expected to restrain the market during the forecast period. Use of 3D printing in aerospace industry is expected to become an opportunity for 3D printing market during the forecast period. For More Detail Click Here Benefit of 3D Printing : Geometric complexity at no extra cost Very low start-up costs Customization of each and every part Low-cost prototyping with very quick turnaround Large range of (speciality) materials  ",
            "date": "Answered January 6, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Magesh Sadasivam",
                "href": "/profile/Magesh-Sadasivam-1"
            },
            "answer_text": "Researchers printed a kidney from the stem cells of an athlete and transplanted the same for him. He is healthy even today after at least 7 years. Printing a human kidney. Surgeons in Netherlands used it for skull transplant. There was a recent publication on a team successfully 3D printed parts of vertebrae and implanted it. There have been successful studies on using calcium based materials as a support implant which enabled growth and effective joining of broken bones in mice replacing the need of using plates and screws, and such items. The list goes on. This is from the bio aspect of 3D printing. These days you could print metals enabling intricate designs inside a prototype structure which wouldn't be possible. 3D printing will become a fluid concept rather than a single machine very similar to what a computer means today that it was a couple of decades ago. 3D printing is a single entity now. Imagine a swarm of drones loaded with metal 3D printing capabilities working together to build an aeroplane. Or a combination of metal extruding spider-like 3D printer working alongside a concrete pouring 3D printer. They could construct a skyscraper within a month along with the needed plumbing. applications are endless. ",
            "date": "Answered August 3, 2016",
            "views": "751",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Oroborust",
                "href": "/profile/Paul-Oroborust"
            },
            "answer_text": "You can now print anything in a overly really faster rate also with the technology will end up having the the potential to fabricate parts with much more accurate and complex geometries that were previously sheer to made impossible with others and even reduce the weight of the structures while maintaining any strength. So they would be end up in lots of biomedical, structural, and energy system applications. For biomedical the most significant applications are found in regenerative medicine (mainly tissue and organ fabrication), ophthalmological implants, 3D printed drugs, customized prosthetic, medical phantoms and cancer research. Hydrogels can also provide support for printing of high resolution, customized 3D geometries. Furthermore, self-healing hydrogels with shear-thinning properties allow the ability to print in any direction. Lots of manufacturing process will end up using 3D printing also would work in the verification of the correctness of the prototype execution. ",
            "date": "Answered July 4, 2020",
            "views": "259",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kishor Kanade",
                "href": "/profile/Kishor-Kanade-4"
            },
            "answer_text": "The demand in the global 3D printing market is projected to expand at a remarkable CAGR of 18.0% during the forecast period of 2017 to 2025, gaining traction from a number of factors such as strikingly higher resolution, reduction in manufacturing cost owing to recent technological advancements, ease in the development of customized products, growing possibilities of using multiple materials for printing, and government investments in 3D printing projects. Use - Commercial and Personal; Technology - PolyJet, Fused Deposition Modeling (FDM), Selective Laser Sintering (SLS), and Stereolithography (SLA) By Application - Consumer Products and Electronics, Automotive, Medical, Industrial, Aerospace, Military & Defense, Architecture, and Education In the near future, North America 3D printing market is anticipated to expand further, with increasing awareness among consumers regarding the benefits of using 3D printing in commercial and household applications. Europe follows North America in terms of the geographical market share. Germany, Italy, France, and Sweden are identified as most lucrative country-wide markets for 3D printing in the region of Europe. Asia Pacific, on the other hand, has been projected to exhibit the best CAGR among all regions under the study during the forecast period. PDF Sample for Detailed Analysis ",
            "date": "Updated May 19, 2019",
            "views": "577",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Surendra Choudhary",
                    "user_href": "/profile/Surendra-Choudhary-60"
                },
                {
                    "user_id": "Jacques Bergier",
                    "user_href": "/profile/Jacques-Bergier-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Siddhesh Lakhan",
                "href": "/profile/Siddhesh-Lakhan-1"
            },
            "answer_text": " If you attempt to envision the fate of 3D printing, the creative mind will draw a somewhat fascinating picture. Considering the extraordinary enthusiasm of researchers in the strategy for 3D bioprinting, which is one of the most encouraging innovations of 3D printing, the creation of fake organs on a 3D printer isn't far-removed. It is additionally protected to state that the eventual fate of 3D printing will get us radical changes such regions as: Development 3D printing of houses, or shape development, pulls in numerous with its modern and effortlessness. The initial phases toward this path have just been taken. Pioneers in 3D home printing were the Chinese, trailed by the Dubai government's revelation of shape development. The city of things to come has just manufactured its first 3D printed place of business, and an entire square is intended to be imprinted soon. What's more, just as of late, the principal printing house in Europe was based on a 3D printer’ To know more about 3dprinting ",
            "date": "Answered July 30, 2020",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chandrashekhar Shetty",
                "href": "/profile/Chandrashekhar-Shetty-2"
            },
            "answer_text": "3D printing will be more observed in the construction and healthcare industry. Recently, the world’s largest pedestrian bridge was completed in Shanghai, China. Many surgeons and health professionals will use 3D printing to build patient-specific organs and bones. It is a method that creates three-dimensional structures by depositing layers with a computer-aided model. 3D printing has the capacity to build houses within a week’s time that provide affordable housing for the below-average population across the globe. 3D Printing is an emerging technology influencing various sectors across the industry verticals. Its adoption is transforming the working process of various industries. Many industries are yet to adopt the technology. For more details visit to the blog 3D-Printing: A Technology To Look Forward In 2020 ",
            "date": "Answered December 30, 2019",
            "views": "163",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sohom Roy",
                "href": "/profile/Sohom-Roy-37"
            },
            "answer_text": "The future of 3D printing is pretty brilliant and undoubtedly it is playing a pivotal role in manufacturing units. With the expanded usage of the technology, discussions about more power are required to add in manufacturing units, so this is actually being possible, compared to two years ago. Before, we were discussing whether there is a financial or technical case to change over from conventional, high volume procedures to an added innovative printer. Presently, there are developing quantities of utilization cases and obvious business benefits demonstrating that addition can be used as a mainstream manufacturing technology. What should be possible with 3D printing isn't hypothetical any longer; it's a reality. ",
            "date": "Answered July 28, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tushki Desale",
                "href": "/profile/Tushki-Desale"
            },
            "answer_text": "The global 3D printing market is expected to reach $81.63 billion by 2030, representing a 2020-2030 CAGR of 20.9% despite the COVID-19 impact. Highlighted with 91 tables and 109 figures, this 214-page report “Global 3D Printing Market 2020-2030 by Component (3D Printers, Consumables, Software, Service), Process and Technology, Use Type (Commercial, Personal), Application, Industry Vertical, and Region: Trend Forecast and Growth Opportunity” is based on comprehensive research of the entire global 3D printing market and all its sub-segments through extensively detailed classifications. Profound analysis and assessment are generated from premium primary and secondary information sources with inputs derived from industry professionals across the value chain. In this report, 2015-2019 is a historical period with 2019 as the base year and estimates/forecast covering 2020-2030. Covid19 Impact on Future of Some Key Players Like: 3D Systems CorporationARC Group Worldwide, Inc.Arcam Ab (General Electric)Autodesk, Inc.Beijing Tiertime Technology Co., Ltd.Carbon, Inc.Concept Laser GmbHCookson Precious Metals Limited.Electro-Optical Systems (EOS) GmbHEnvisiontec GmbHExone CompanyGE AdditiveGroupe GorgéHoganas ABHP Inc. Free Sample Copy of Report: Global 3D Printing Market 2020-2030 by Component (3D Printers, Consumables, Software, Service), Process and Technology, Use Type (Commercial, Personal), Application, Industry Vertical, and Region: Trend Forecast and Growth Opportunity - Qurate Business Intelligence ",
            "date": "Answered April 29, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rebecca Jones",
                "href": "/profile/Rebecca-Jones-1247"
            },
            "answer_text": "4D Printing: A Technology Coming From the Future 4-dimensional printing uses the same techniques of 3D printing through computer-programmed deposition of material in successive layers to create a three-dimensional object. However, 4D printing adds the dimension of transformation over time. Download PDF Brochure of Research Study, Click Here It is therefore a type of programmable matter, wherein after the fabrication process, the printed product reacts with parameters within the environment (humidity, temperature, etc.,) and changes its form accordingly. The ability to do so arises from the near infinite configurations at a micrometer resolution, creating solids with engineered molecular spatial distributions[2] and thus allowing unprecedented multifunctional performance.  Cell Traction Force Cell Traction Force (CTF) is a technique wherein living cells fold and move microstructures into their designed shape. This is possible through the contraction that occurs from actin polymerization and actomyosin interactions within the cell. In natural processes, CTF regulates wound healing, angiogenesis, metastasis, and inflammation. Takeuchi et al. seeded cells across two microplates, and when the glass structure was removed the cells would bridge the gap across the microplate and thus initiate self-folding. The team was able to create vessel-like geometries and even high throughput dodecahedrons with this method. There is speculation that utilizing this technique of cell origami will lead to designing and printing a cell-laden structure that can mimic their non-synthetic counterparts after the printing process has completed. ",
            "date": "Answered September 7, 2020",
            "views": "34",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Manveer Jain",
                    "user_href": "/profile/Manveer-Jain-1"
                },
                {
                    "user_id": "Raghav Das",
                    "user_href": "/profile/Raghav-Das-12"
                },
                {
                    "user_id": "Anuj Lal",
                    "user_href": "/profile/Anuj-Lal-6"
                },
                {
                    "user_id": "Ashish Mangla",
                    "user_href": "/profile/Ashish-Mangla-7"
                },
                {
                    "user_id": "Rajveer Malhotra",
                    "user_href": "/profile/Rajveer-Malhotra-5"
                },
                {
                    "user_id": "Simran Kapoor",
                    "user_href": "/profile/Simran-Kapoor-84"
                },
                {
                    "user_id": "Gaurav Sharma",
                    "user_href": "/profile/Gaurav-Sharma-3994"
                },
                {
                    "user_id": "Rohit Sharma",
                    "user_href": "/profile/Rohit-Sharma-3653"
                },
                {
                    "user_id": "Manisha Singh",
                    "user_href": "/profile/Manisha-Singh-641"
                },
                {
                    "user_id": "Deepak Khurana",
                    "user_href": "/profile/Deepak-Khurana-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Gruszynski",
                "href": "/profile/Jeff-Gruszynski"
            },
            "answer_text": "Yes. But is it what you believed from the hype? And is that problem for you. 3D printing has been the in “hype cycle”, which isn’t strictly a cycle at all but a transient response to the singularity step input of a new idea or product concept. Hype cycle - Wikipedia Step response - Wikipedia 3D Printing is currently in the “climbing slope” phase of the hype curve. So yes there is a future but it will never be all that it was hyped as! For example: Return manufacturing to the USA? NO, never going to happen (at least not due to 3D Printing!)Replace all other types of manufacturing? NO, never going to happenPut a manufacturing plant in every house? NO.Enable people to have an at-home business? Most NO.Make Star Trek replicators? LOL NO!Improve prototyping? In many cases, YESEnable low volume production for certain materials and applications - definitely YESEnable certain unique (but fairly uncommon) geometries of materials to be made at all - YES",
            "date": "Answered May 8, 2019",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "SafirePrint Pack",
                "href": "/profile/SafirePrint-Pack"
            },
            "answer_text": "3D Printing or Additive Manufacturing is a process by which almost any three-dimensional object of any shape can be made from a digital model. This is achieved by an additive process whereby layers of materials are laid down in different shapes. This method differs vastly from traditional machining techniques that rely on the removal of materials either by cutting or drilling which are subtractive processes. 3D printing technology has found varied uses and benefits ranging from rapid prototyping to applications in construction, architecture, engineering, medical industries, fashion, jewellery, military, automobiles, aerospace and in a host of other fields. In the near future it is expected that 3D printers would become easily available consumer goods, thanks to the fact that they can offset the capital costs in procuring them by enabling people to “print” common household items rather than purchasing them from the market.Not to be left behind, a few early adopters and pioneers in India have embraced 3D printing technology and have set up successful businesses around it. We spoke to a few of them about the opportunities, challenges and the future of 3D printing in India. ",
            "date": "Answered February 15, 2019",
            "views": "208",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Monika Sharma",
                "href": "/profile/Monika-Sharma-732"
            },
            "answer_text": "3D printing technology has already being used by the various companies for prototyping. Now more material can be printed other than plastic. The technology that has come out more recently is way more expensive than the ones whose patents are discarded, and hence only the large corporate's can use it.With the help of 3D printers, it becomes more easy and affordable for the average consumer, 3D printing stands to gain a lot from this interest in the technology. It can reduce time and efforts.  In 3D printing, Morphedo did an excellent job. They provide 3D printing consultancy. They offer 3D printing services in 20+ materials and 5+ different types of 3D printing techniques which can cater to all kinds of 3D printing requirements. ",
            "date": "Answered October 25, 2017",
            "views": "714",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                },
                {
                    "user_id": "Jean Beufay",
                    "user_href": "/profile/Jean-Beufay"
                },
                {
                    "user_id": "Gabriella Eldridge",
                    "user_href": "/profile/Gabriella-Eldridge"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anastasia Novikova",
                "href": "/profile/Anastasia-Novikova-1"
            },
            "answer_text": "3D printing is heavily transforming many sectors of our life. The range of 3D-printing influence covers consumer goods production, dental prosthetics, motor vehicles and different medical services. 3D printing allows building solid-state models of different shapes and sizes, using any material you like. Where does that get us? Let’s see, what we can 3D-print and where it is applicable. Medical models of different body parts or organs → healthcare industry, medical research, education;Architectural models, maquettes → construction industry, exterior and interior design;Automotive components → motor-vehicle construction and engineering;Virtually any consumer, household and fashion goods.Having acquainted yourself with 3D printing capabilities, you can now answer, whether 3D printing has the future or not. ",
            "date": "Answered January 23, 2017",
            "views": "822",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manya Jha",
                    "user_href": "/profile/Manya-Jha"
                },
                {
                    "user_id": "Sanjana Nagar",
                    "user_href": "/profile/Sanjana-Nagar"
                },
                {
                    "user_id": "Ritesh Raj",
                    "user_href": "/profile/Ritesh-Raj-87"
                },
                {
                    "user_id": "Sarita Thakur",
                    "user_href": "/profile/Sarita-Thakur-16"
                },
                {
                    "user_id": "Ranveer Singh",
                    "user_href": "/profile/Ranveer-Singh-126"
                },
                {
                    "user_id": "Sahil",
                    "user_href": "/profile/Sahil-195"
                },
                {
                    "user_id": "Monika Sharma",
                    "user_href": "/profile/Monika-Sharma-732"
                },
                {
                    "user_id": "Sanjeev Sinha",
                    "user_href": "/profile/Sanjeev-Sinha-40"
                },
                {
                    "user_id": "Varun Verma",
                    "user_href": "/profile/Varun-Verma-118"
                },
                {
                    "user_id": "Sonia Rani",
                    "user_href": "/profile/Sonia-Rani-40"
                },
                {
                    "user_id": "Darshyiet Shetty",
                    "user_href": "/profile/Darshyiet-Shetty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Taniya",
                "href": "/profile/Taniya-18"
            },
            "answer_text": "3D printing technology has already being used by the big industrial companies for the sole purpose of prototyping. This technology has slowly been growing, and now more material can be printed other than plastic. The technology that has come out more recently is way more expensive than the ones whose patents are discarded and hence only the large corporate's can use it.  With 3D printers now becoming more affordable for the average consumer, 3D printing stands to gain a lot from this newfound interest in the technology. One of the major advantages of it is that it can reduce time and efforts.In 3D printing, Morphedo did a wonderful job. They provide 3D printing consultancy. They offer 3D printing services in 20+ materials and 5+ different types of 3D printing techniques which can cater to all types of 3D printing requirements. ",
            "date": "Updated September 27, 2017",
            "views": "735",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kris Ihli",
                    "user_href": "/profile/Kris-Ihli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Frederiksen",
                "href": "/profile/Dan-Frederiksen"
            },
            "answer_text": "if you can handle it we can cheat and look at UFOs. Visiting ET ships. One famous case is Travis Walton (which the movie Fire in the Sky was based on but misrepresented at the critical moment) where he in 1975 was taken on board an ET ship and later handed over to another ET ship. He described the interior of the ship as one piece. Ceiling, walls, floor, table, monitors. No seams at all, all monolithic. Bob Lazar is another famous case, he described the same but they supposedly cut one up, took it apart. And they found no wires, no components, no circuit board. It was all one monolithic process. No distinction between structure, conduits or electrical function. Like if you made a craft with a microchip wafer process. One big 3D chip with control over every single atom, perfectly arranged. That’s what 3D printing will be. ",
            "date": "Answered June 1, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                },
                {
                    "user_id": "Atin Angrish",
                    "user_href": "/profile/Atin-Angrish-1"
                },
                {
                    "user_id": "Joel Postma",
                    "user_href": "/profile/Joel-Postma"
                },
                {
                    "user_id": "Emmanuel Fabella",
                    "user_href": "/profile/Emmanuel-Fabella"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexandre Mihaly Ederer",
                "href": "/profile/Alexandre-Mihaly-Ederer"
            },
            "answer_text": "I think 3d printing can become the future of ownership, where people no longer work to produce capital but provide ideas for machines that can then easily be printed.  Resources would need to be easily accessible and renewable by some mechanical and chemical stripping process in order for them to be re-printed.   But the 3d printers are here to stay, they have already proven a reliable way to create organs, or create better prosthesis. They already started proving themselves in the manufacturing department to replace multiple small pieces into one larger more durable one. They are also proving themselves in the clothing industry. The only problem would be what to do with common manufacturing and the millions of layoffs that will occur? ",
            "date": "Answered January 26, 2014",
            "views": "840",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Hu",
                "href": "/profile/Jason-Hu-32"
            },
            "answer_text": "I think the future is bright. It can be applied to not only manufacturing small commodities or items like food, guns and tools but also something really big. I read an article, I think it was from WSJ, about a team finished using 3D printing technology to build a real house. This news is just an example but broadened my expectation to 3D printing. So I would say, the future is bright. OMG, I was the first to answer and it was gonna be my first answer on quora, but I made it a comment.~_~ ",
            "date": "Answered April 11, 2014",
            "views": "744",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alex Marshall",
                "href": "/profile/Alex-Marshall"
            },
            "answer_text": "3d printing is a fantastic tool- not really a new industry. It has been around for a while but it is making the news now because it has become cheap and easy enough for people to make or buy and operate their own 3d printers (entered the consumer space).  I say its a fantastic tool because it is. Its future is in enabling people to prototype and experiment more with physical objects. Before it was so cheap, it was difficult for the average person to engineer new inventions/prototypes or everyday items. People were pretty much limited to creating software products. Now, all of the advantages of software development (cheap, easy, ect.) are coming to the physical world.  So, like the explosion of software creation we saw recently enabled by cheap computers, cheap manufacturing (3d printers) will enable an explosion of engineered physical products (including hardware/software integration, network connectivity, ect.) Thats the future. ",
            "date": "Answered September 21, 2013",
            "views": "180",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kapil Gautam",
                    "user_href": "/profile/Kapil-Gautam-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Said Aljabri",
                "href": "/profile/Said-Aljabri-1"
            },
            "answer_text": "Interesting question. The future of 3d printing is very bright. I believe you have already seen that 3d printing things are all over the world, and you can see them everywhere, medical treatments, building houses, steel manufacturing, cars, machines, and etc. Also, there are so many different 3d printers that do different functions and manufacture different material. 3d printers keep progressing and inventors keep adding lots of new and interesting functions on them. 3d printing can reduce the man hand work and reduces the cost of the manufacturing. Therefore, most of the manufacturing companies nowadays using the 3d printers to have a better profit. Also, the quality of the products that comes from the 3d printers is very high. Also, 3d printers save lots of manufacturing time. ",
            "date": "Answered December 4, 2018",
            "views": "185",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ravindra Kulkarni",
                "href": "/profile/Ravindra-Kulkarni-48"
            },
            "answer_text": "The future of 3D printing is bright, with several high stakes players entering the scene. People are looking to solve some very specific, challenging problems with creative innovations. As 3D printing technology advances and more people are exposed to it, they’re realizing it can apply to many different problems in many different fields; thus, the opportunity for innovation is tremendous. So, let’s dive right in! In the following, we present several technological advances you can expect to see in the 3D printing world in the near future. · 3D Printed Electronics · Generative Design · 4D Printing · Bound Metal Deposition · A Lot to Look Forward To Source: https://bit.ly/2Y6cJo8 ",
            "date": "Answered July 1, 2019",
            "views": "204",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santiago Garica Jimenez O'Farrill",
                "href": "/profile/Santiago-Garica-Jimenez-OFarrill"
            },
            "answer_text": "3D printing will evolve thanks to different methods of layer deposition, this is linked to the new polymers and allows develped for big applications.Soon, High Quality Printing will become extremely cheap (more than today). And will make everyone own a 3D printer. IF this happens, people will stop leaving their places to buy thing because they can just desing them or download them and print them in their homes. Today, there are printers that can print:Cells, polymers(an enormous variety), ceramics(like concrete and zriconia oxide), candy, food, metal, resins, paper..,Soon we will se full-set molecules and probably in many years atoms for quantum computing. ",
            "date": "Answered December 24, 2016",
            "views": "426",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                },
                {
                    "user_id": "Firoz Rathore",
                    "user_href": "/profile/Firoz-Rathore"
                },
                {
                    "user_id": "Mohit Dadhich",
                    "user_href": "/profile/Mohit-Dadhich"
                },
                {
                    "user_id": "Matej Korytar",
                    "user_href": "/profile/Matej-Korytar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pavel Morava",
                "href": "/profile/Pavel-Morava"
            },
            "answer_text": "I guess that future of 3d printing is to become big.  Oh, dont look at me like perplexed owl. 3D print is far from being big when compared to 2d print. People, who don’t care about 3d printing, have no idea that somewhere outside lay possibilities of which they have never dreamed. No, I am not talking about cure of cancer, just ordinary piracy. Imagine the house equipped with 3d replicator that enables their owners to download blueprints from the internet (or what our offsprings will use instead) and 3d print pirated new mobile or new hot babe from factory, which build their bussiness on making hot babes. The new future hikikomori need more than virtual reality to splash his/her juices, he or she - as women are catching with their male counterparts - wants true affection, true sensation and true relieve with all possible efects, the touch included. Enter the world of 3d printed partners. The utopia awaits…  ",
            "date": "Answered December 19, 2018",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhimanyu Chavan",
                "href": "/profile/Abhimanyu-Chavan-1"
            },
            "answer_text": "Greetings, This question already has a lot of answers so I’ll try to be as short as possible. The future is bright but it will depend on the material research. The material research has to catch-up withthe rapid developments in the 3D printing industry. The development of Metamaterials will drive future growth of 3D printing. Development of Active materials (those which can conduct & store electricity) so that objects like batteries and devices can be directly 3D printed in a 3D printer rather than just printing the outer shells. This is the future possibility and research area of 3D printing. Another area is the artificial tissue printing which will lead to In-Situ Bioprinting and other related applications. You can subscribe to our Magazine and stay up-to-date on the latest events in 3D printing. Visit our Magazine at Manufactur3D | India's First Magazine on 3D Printing Do Comment if you have any more queries. I hope you liked and agree with the answer. Best Regards, Manufactur3D | India's First Magazine on 3D Printing ",
            "date": "Answered April 15, 2018",
            "views": "289",
            "upvotes": " Answer requested by Darshan Gor",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Mccluney",
                "href": "/profile/John-Mccluney"
            },
            "answer_text": "In the short time since 3d printers were invented, 3D printers have already created an amazing collection of useful devices. Developers printed a gun that could actually fire bullets. Not long ago, NASA tested a rocket engine that had been printed with one of these devices and found that it worked perfectly well.Things are developing rapidly. Now, major government agencies are ordering them and putting them to use. Many people think that 3D printers will follow the same trend that desktop computers followed. At first, the wealthy will have them. As prices lower, however, more and more 3D printers will get into the hands of regular people. ",
            "date": "Answered February 26, 2015",
            "views": "239",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Florence Grote",
                "href": "/profile/Florence-Grote"
            },
            "answer_text": "3D printing is an innovative technology that let us create a physical object from a digital model. It started in the 80’s under the name ‘rapid prototyping’ because this was the purpose of the technology to prototype faster and cheaper. A lot’s changed since then, and today 3D printers offer amazing results and let us create anything we can imagine. 3-D printing is moving in several directions at this time and all indications are that it will continue to expand in many areas in the future. Some of the most promising areas include medical applications, custom parts replacement, and customized consumer products. As materials improve and costs go down, other applications we can barely imagine today will become possible. ",
            "date": "Answered June 21, 2019",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Brown",
                "href": "/profile/Tim-Brown-538"
            },
            "answer_text": "3d printing is one of the fastest growing technology in the world. Most of the Medical industries, Automobiles, Electronics parts and Aerospace use the 3d Printing made Products. So if, you look to the future 3d printing Revolutionize the Future of Development. Binashree is one of them to provide the 3d manufacturing services. ",
            "date": "Updated July 1, 2019",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rendy Himawan",
                "href": "/profile/Rendy-Himawan"
            },
            "answer_text": "I'm working in manufacturing company where traditional methods (plastic molding, aluminum extrusion, and die-cast) are used extensively. 3D printing did help a bit in the past for prototyping purpose. Now, we moved to CNC completely due to cost factor. And most probably will keep doing so. If I were designer/CAD-modeler/engineer then I can only think -of using 3D printing- about creating functional items, which can't be done by “traditional” manufacturing. 3D printing will go mainstream, and once cost (printer, material, and process) is getting more competitive then traditional manufacturing process will be replaced easily. ",
            "date": "Updated December 26, 2018",
            "views": "308",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tanmay Sethi",
                "href": "/profile/Tanmay-Sethi"
            },
            "answer_text": "If I have to answer this, I will say 3D Printing is the future. With the technology getting better each and every day, we are going to see a huge transformation very soon. 3D Printing will revamp the centralized manufacturing entities started post industrial revolution to decentralized manufacturing setup.  Check out how the technology hype has evolved and how the Gartner's hype cycle rate this technology. http://aha3d.in/index.php?id=Blog/first_blog_21116  ",
            "date": "Answered January 24, 2016",
            "views": "968",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Olsen",
                    "user_href": "/profile/John-Olsen-135"
                },
                {
                    "user_id": "Priya Reddy",
                    "user_href": "/profile/Priya-Reddy-443"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neha Bora",
                "href": "/profile/Neha-Bora-40"
            },
            "answer_text": "Aggressive research and development in three-dimensional printing and growing demand for prototyping from healthcare, automotive, and aerospace and defense among other industry verticals are expected to drive the market growth. 3D printing benefits manufacturers in terms of prototyping, designing, and modeling structures and end products. It also reduces time to market. As a result, production expenses have reduced considerably and the manufacturers are able to offer better products at reasonable prices. Get More Information At : https://tinyurl.com/yxy3d9de ",
            "date": "Answered December 27, 2019",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Michael Welcome",
                "href": "/profile/James-Michael-Welcome"
            },
            "answer_text": "The short answer is that 3-D printing will affect every country and every industry, to varying degrees. Many companies and even entire industries (think packaging) will be driven out of business.  For those interested in a more detailed analysis, see my 3,000-word research essay that won the London School of Economics Digital Innovation Challenge: Additive Manufacturing: Present Capabilities and Likely Future Impact ",
            "date": "Answered November 27, 2014",
            "views": "338",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Olsen",
                    "user_href": "/profile/John-Olsen-135"
                },
                {
                    "user_id": "Abhinay Reddy",
                    "user_href": "/profile/Abhinay-Reddy-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rani Chowdary",
                "href": "/profile/Rani-Chowdary-7"
            },
            "answer_text": "3D printing, or additive manufacturing, has the potential to democratize the production of goods, from food to medical supplies. In the future, 3D printing machines could make their way into homes, businesses, disaster sites, and even outer space. 3D Printing technology was already being used by both small scale industries as well as large scale industries. As the need of 3D printers is growing for prototyping, modeling or low volume manufacturing requirements. 3D printers are offering very short lead times and a wide range of materials at a low cost. A big chunk of people depend upon 3D printers and 3D Printing Services.  ",
            "date": "Answered May 3, 2019",
            "views": "210",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Siegfried",
                "href": "/profile/David-Siegfried"
            },
            "answer_text": "That's a very broad question. 3D printers are becoming more accessible but they have a long way to go before they are as ubiquitous as a laser or inkjet printer. They are mostly confined to engineers, artists, and entrepreneurs. The technology will keep moving forward, however.Where 3D printers really have a future is in manufacturing. High-end 3D printing is beginning to have more and more applications in industries such as the automotive industry. ",
            "date": "Answered August 24, 2018",
            "views": "316",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                }
            ]
        },
        {
            "author_info": {
                "name": "Constantine Ivanov",
                "href": "/profile/Constantine-Ivanov"
            },
            "answer_text": "I would say there is a lot of direction which 3d printing will be going to. The major application I think will be the same as now: medical, engineering, architecture, automotive, aerospace and merging with traditional manufacturing technologies. But the devil in the details. I wrote a couple of articles on that topic before: The Next Five Years of 3D Printing AMUG as a 3D Printing Industry Development Indicator ",
            "date": "Answered November 12, 2017",
            "views": "406",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kyla Rehum",
                "href": "/profile/Kyla-Rehum"
            },
            "answer_text": "I think in the future, 3D printing can make it possible to make big prototypes in a very short time and with very little equipment. What can you say if in the future we can 3D print Iron Man statues using out smart phones? Like those 3D objects used in museums. It could really be very handy especially for people who would like to collect life-size objects or statues. ",
            "date": "Answered March 8, 2016",
            "views": "291",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                },
                {
                    "user_id": "Atin Angrish",
                    "user_href": "/profile/Atin-Angrish-1"
                },
                {
                    "user_id": "Virali Modi",
                    "user_href": "/profile/Virali-Modi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stuart Ting",
                "href": "/profile/Stuart-Ting"
            },
            "answer_text": "3-D printing is moving in several directions at this time and all indications are that it will continue to expand in many areas in the future. Some of the most promising areas include medical applications, custom parts replacement, and customized consumer products. 3D printers are extensively used in manufacturing. These are trends of 3D Printing future: 1. Localized Production For Consumer And Industrial Goods 2. Custom Production Materials 3. Nano-Printing. ",
            "date": "Answered March 22, 2017",
            "views": "200",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mufaddal Rasheed",
                    "user_href": "/profile/Mufaddal-Rasheed"
                },
                {
                    "user_id": "Dean Smith",
                    "user_href": "/profile/Dean-Smith-132"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Franklin",
                "href": "/profile/John-Franklin-67"
            },
            "answer_text": "3D printing is a new technology for printing. But the special feature of this tech is you can make virtually every thing. All you need is a 3D printer and a design of the thing you want to make. At present small items like lab equipment, eyewear frames like Monoqool 3D printed frames, scientific equipments etc are being made using D printing. But in near future you may find large items like your TV, Fridge etc are being made by this tech. ",
            "date": "Answered January 11, 2018",
            "views": "132",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcos Voy",
                "href": "/profile/Marcos-Voy"
            },
            "answer_text": "The same way it's being used now! To print out things. It will just be more suitable to print more things that it's not suitable yet, like highly detailed objects and, very small objects, strong objects and, human/animal organs. But 3D printing is already being used for very unexpected purposes like printing entire houses for example. ",
            "date": "Answered June 1, 2020",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Malcolm Sargeant",
                "href": "/profile/Malcolm-Sargeant"
            },
            "answer_text": "It has no major future until it can be used to make items from materials other than soft plastics. At a reasonable cost anyway I know there are very expensive machines out there that can make metal parts. ",
            "date": "Answered January 27, 2014",
            "views": "409",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Steve-Done"
                },
                {
                    "user_id": "Virali Modi",
                    "user_href": "/profile/Virali-Modi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dilanka McLovin",
                "href": "/profile/Dilanka-McLovin"
            },
            "answer_text": "Anyone will be able to send, receive and download physical objects (no matter how big or complicated) by simply using the Internet as a transport mechanism (instead of using long haul trucks). Then, people will be able to just print these physical objects at home for 1/10th of the cost. 3D Printing will democratize manufacturing. What will you print? Well almost anything. Here are some ideas: Randomized idea generator for 3D Printing ",
            "date": "Answered September 22, 2017",
            "views": "180",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                },
                {
                    "user_id": "Jakub Horák",
                    "user_href": "/profile/Jakub-Horák"
                }
            ]
        },
        {
            "author_info": {
                "name": "Digital Xpress",
                "href": "/profile/Digital-Xpress-1"
            },
            "answer_text": "3D printing, or additive manufacturing, has the potential to democratize the production of goods, from food to medical supplies, to great coral reefs. In the future, 3D printing machines could make their way into homes, businesses, disaster sites, and even outer space. Printing and Binding Service Calgary SE offers the best services when it comes to Printing and Copying. ",
            "date": "Answered December 11, 2018",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Xiaoxue Liu",
                "href": "/profile/Xiaoxue-Liu-1"
            },
            "answer_text": "Everywhere you can see, the cost is now 1/5, multi-function equipment, you can print anything you want.Will promote political revolution!Ha haCome now, I did some printers, simple, strong, cheap.Not business, I just only need to do the next new machine Page on costs. my skype:reprap.cn ",
            "date": "Answered July 26, 2014",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Larson",
                "href": "/profile/Joseph-Larson-2"
            },
            "answer_text": "That’s an interesting question, but you know what I wonder; What ever happened to microwaves? For a while there they were all anyone could talk about, but now you hardly hear about them any more. I hear some people still have one and use it for, I don’t know, popcorn or something. There was a thing a while back with boiling water. But besides that you never hear about them any more. There must be no future left for them.  ",
            "date": "Answered May 8, 2019",
            "views": "90",
            "upvotes": " Answer requested by Jeff Monroe",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                },
                {
                    "user_id": "Kamal Gupta",
                    "user_href": "/profile/Kamal-Gupta-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel Postma",
                "href": "/profile/Joel-Postma"
            },
            "answer_text": "According to Dag Kittlaus, the creator of Siri, we will be using it in the future to make nearly everything, including our food. It is fascinating and brings up a lot of questions at the same time. ",
            "date": "Answered June 15, 2014",
            "views": "785",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonetta Rex",
                    "user_href": "/profile/Antonetta-Rex"
                },
                {
                    "user_id": "Gui Stephanus",
                    "user_href": "/profile/Gui-Stephanus"
                },
                {
                    "user_id": "Nance Dave",
                    "user_href": "/profile/Nance-Dave"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Pieniazek",
                "href": "/profile/Larry-Pieniazek"
            },
            "answer_text": "I think we are going to see 3D printing used for more and more things. It will probably not replace custom molds for very high volume or high precision parts but we see more and more uses. ",
            "date": "Answered September 20, 2014",
            "views": "251",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joseph Dany",
                    "user_href": "/profile/Joseph-Dany"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fanfan Feng",
                "href": "/profile/Fanfan-Feng"
            },
            "answer_text": "3D printing can be used in medical, building, film, and life, Design and other aspects, it can reduce labor and bring infinite fun. Now you maybe need an entry-level 3D printer to explore the fun of 3D printing.  ",
            "date": "Answered August 12, 2019",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajish Chandrababu",
                "href": "/profile/Ajish-Chandrababu"
            },
            "answer_text": "Future of 3D Printing will be the replicator in Star Trek.   A machine capable of creating (and recycling) objects including food. https://en.wikipedia.org/wiki/Replicator_(Star_Trek) ",
            "date": "Answered March 22, 2016",
            "views": "92",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Loring Chien",
                "href": "/profile/Loring-Chien"
            },
            "answer_text": "It’s probably just a fad. It’ll go away in a few years, just like PC,s Digital cameras, and smartphones. :-) ",
            "date": "Answered January 1, 2017",
            "views": "84",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Alexa Miller",
                "href": "/profile/Alexa-Miller-28"
            },
            "answer_text": "3D printing is having the future application like prototyping which is very important and some of the examples are bike frames, baby strollers, outdoor gears. ",
            "date": "Answered October 4, 2018",
            "views": "210",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Shagorika Ghosh",
                "href": "/profile/Shagorika-Ghosh"
            },
            "answer_text": "Apparently, in a couple of years, 3D printing can be used to make prosthetic hearts. The reason it will take so long to start production is that the heart is very complex and everything needs to be just right. ",
            "date": "Answered April 17, 2014",
            "views": "308",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cemal Şafak Çöktü",
                "href": "/profile/Cemal-Şafak-Çöktü"
            },
            "answer_text": "Blog - What promise 3D Printers? We believe that 3d printers will triggle the new industrial age . Let’s take a look our blog about for future of 3dprinting. ",
            "date": "Answered April 9, 2017",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mat Delano",
                "href": "/profile/Mat-Delano"
            },
            "answer_text": "They're becoming analogous to the relationship that commercial printers have to home desktop printers. ",
            "date": "Answered July 14, 2014",
            "views": "283",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Frederick Dietz",
                "href": "/profile/Frederick-Dietz-1"
            },
            "answer_text": "Organ printing - Wikipedia, I believe this to be the future for 3d printing technology. And potentially replication, but that’d be nowhere near our lifetime(s). ",
            "date": "Answered August 1, 2019",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Håkan Fägnell",
                "href": "/profile/Håkan-Fägnell"
            },
            "answer_text": "Fingerprinting 3D Printers using Commodity Scanners | 3D Printer Chat I think this will be the future for 3d printing unfortunatly. ",
            "date": "Answered October 24, 2018",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nagesh Kumar",
                "href": "/profile/Nagesh-Kumar-258"
            },
            "answer_text": "When you are ill doctors using ai reach you online and check your BP and using medicine you will get Treated it is usefull of Elders the Transportation Charges will be Saved https://universeprocess.com/docotors-online-artificial-intellignce/ ",
            "date": "Answered January 3, 2020",
            "views": "34",
            "upvotes": "0"
        }
    ]
}