{
    "title": "What are the great features of iphone over any other smartphones? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Yash Dewari",
                "href": "/profile/Yash-Dewari"
            },
            "answer_text": "1-iPhone Can Survive Falls Of Over 13,000 Feet  A skydiver Jarrod McKinney lost his iPhone-4 in midair after jumping from 13,500 feet and the phone landed on a building. Skydiver was using a GPS Tracking app so he was able to find his phone easily. When he found his phone, he noticed that the screen was cracked but the phone was working, he was able to attend his phone calls with it. 2-One Third Of US High Schools Students Now Have iPhones  A survey by market research firm Piper Jaffray, the results of the extensive survey of 5,600 U.S. found that 34% of students now own an iPhone. Furthermore 40% of the High School Students expressed their intent to buy an iPhone in the next 6 months. For a tablet, 34% of students were having some sort of tablet device, with 70% of those indicating that they have an iPad. 53% of those iPad owners also own an iPhone. 3-Advretisement In iPhone Ads Is Always Set To 9:41  You might have noticed that all iPhone’s advertisement shows a time of 9:41. Believe it or not but there is actually a big reason behind it. Whenever Apple releases it’s new product, they want the big reveal of the product happens around 40 minutes. When the image of the product appears on screen, they want that the time shown on a Apple’s product to be close to the actual time on the audience’s watches. 4-Apple’s iPhone Wasn’t The First iPhone  Initially, Cisco owned the ‘iPhone’ trademark. Before Apple, Cisco Systems had originally patented the name. The Cisco iPhone was a VOIP phone that allowed users to call through Skype without having to use a computer. Cisco sued Apple for calling its smartphone an iPhone. After January 2007, Apple and Cisco eventually settled their dispute, promising to collaborate together on products in the future. 5-iPhone Users Are More Loyal  iPhone users are more likely to upgrade to another iPhone than Android users are likely to upgrade to another Android device. About 49% of the people sell their old iPhones before purchasing new ones. That’s something amazing because you don’t see that for any other phone in particular. ",
            "date": "Answered October 31, 2016",
            "views": "311",
            "upvotes": " View 327 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Khoshang Kashyap",
                    "user_href": "/profile/Khoshang-Kashyap"
                },
                {
                    "user_id": "Mahran Mirza",
                    "user_href": "/profile/Mahran-Mirza-1"
                },
                {
                    "user_id": "Utkarsh Tyagi",
                    "user_href": "/profile/Utkarsh-Tyagi-138"
                },
                {
                    "user_id": "Shrideep Chougule",
                    "user_href": "/profile/Shrideep-Chougule"
                },
                {
                    "user_id": "Dwij Mistry",
                    "user_href": "/profile/Dwij-Mistry-2"
                },
                {
                    "user_id": "Armaan Pattnaik",
                    "user_href": "/profile/Armaan-Pattnaik-2"
                },
                {
                    "user_id": "Rahul Sahoo",
                    "user_href": "/profile/Rahul-Sahoo-50"
                },
                {
                    "user_id": "Vpharrish",
                    "user_href": "/profile/Vpharrish"
                },
                {
                    "user_id": "Dhakshayan Appar",
                    "user_href": "/profile/Dhakshayan-Appar"
                },
                {
                    "user_id": "Vivek Mehlawat",
                    "user_href": "/profile/Vivek-Mehlawat-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vidhath Gowda",
                "href": "/profile/Vidhath-Gowda-1"
            },
            "answer_text": "Instant Operating System Updates for AllWhen Apple pulls the trigger on a new iOS update, it reaches every iPhone, iPad and iPod Touch owner almost immediately. That's because Apple has complete control over when its operating system updates roll-out – there's no intervention from mobile carriers, or smartphone manufacturers. As a result, any security vulnerabilities, software glitches or bugs are fixed with ruthless efficiency within the iOS ecosystem. It also means users can get their hands on the latest features as soon as Apple is ready to push them out. That's not always the case with Android. Google pushed out its latest update to the mobile operating system, 6.0 Marshmallow, back in October 2015. However, it wasn't until February 2016 that Samsung Galaxy smartphone owners were able to start downloading the update and enjoy the latest features. 2. Simple, Easy Device-Wide Search By Default Apple's Spotlight search is a phenomenal tool. From any Home Screen panel on your iPhone or iPad, simply touch your finger to the display and drag down to load the search field. You can then launch a search for almost anything on your device – apps, contacts, phone numbers, messages, GarageBand projects, draft emails, individual tracks available to stream via Apple Music. Spotlight can also search the web, so you don't have to fire-up a separate app before you kickstart your next Google search. Like on OS X, Spotlight can handle some basic maths too. So you can type your calculation into the search field and get the answer – without ever leaving the Home Screen. Start using it, and you'll struggle to remember how you lived without it. Many of this is possible from your Home Screen on Android – but not by default. For all its expertise in search, Google bafflingly makes you turn on searching for apps within the Settings of the Google app. 3. iPhones Are More Secure Apple's iOS is a more secure platform than Android. Granted, it's not impregnable. But it is better. In its 2015 Mobile Threat Report, Pulse Secure estimated that a jaw-dropping 97 per cent of all malware written for mobile targeted Android devices. Meanwhile the United States Department of Homeland Security has previously estimated than a meagre 0.7 per cent of malware threats would affect iOS users. One of the reasons for this disparity is that many Android users do not – or cannot – update to the latest version of the operating system. Android also has more users worldwide, which makes it appealing for cyber scammers. ",
            "date": "Answered January 28, 2018",
            "views": "474",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nina Kaur",
                    "user_href": "/profile/Nina-Kaur-32"
                },
                {
                    "user_id": "Prakash Kumar",
                    "user_href": "/profile/Prakash-Kumar-1490"
                },
                {
                    "user_id": "Abhay Hervatte",
                    "user_href": "/profile/Abhay-Hervatte"
                }
            ]
        }
    ]
}