{
    "title": "What is the biggest technological challenge faced by the world today? - Quora",
    "tags": [
        "Technology Companies",
        "Sustainable Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hani Sharif",
                "href": "/profile/Hani-Sharif-2"
            },
            "answer_text": "I think that there is no general scale to measure the technological challenge. So i can only say the answer based on what i think. The following answer is only based on my perspective. Earth is dying. While technology may save it, one of the driving force for this destruction is technology itself. Consider the case of cabon footprint that is being added to the atmosphere by the emissions. This coupled with the ever increasing population is a real threat. And I fear that it may be too late to save the planet. So what is the challenge? To create a sustainable technology is a challenge. Now this comes with several other sub challenges.  For example: Electric vehicles are green but they take time to charge. For eg. 120 KW power output from a charger takes a Tesla car, 1 hr and 10 mins for a 100% charge. Compare this to a gasoline car and you will find the huge difference in time. Furthermore a Tesla can cost much more than an ordinary Gasoline car. The production process of the car is not ‘green’ eventhough the final product is green. Hence the challenge will be to create an EV that is low cost, takes less time to charge and the entire production process do not generate any waste. This is quite a challenge. (Basically the new technology must outweigh the benefits of conventional technology in all aspects) So from my point of view, I would say that, creating a sustainable technology that is practical and surpassing the merits of conventional technology is a real challenge. ",
            "date": "Answered December 23, 2018",
            "views": "110",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Akriti Mattu",
                    "user_href": "/profile/Akriti-Mattu-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arun Kumar Sharma",
                "href": "/profile/Arun-Kumar-Sharma-152"
            },
            "answer_text": "The data speed and processing is the biggest challenge because data is generated at speed much much faster than speed of processing. Today we are having GPU, TPU and NPUs for processing big data but in couple of months these high end processing speed Technologies will start breathe heavily. ",
            "date": "Answered December 24, 2018",
            "views": "29",
            "upvotes": " Answer requested by Akriti Mattu"
        }
    ]
}