{
    "title": "What is the next big home trend? - Quora",
    "tags": [
        "Next Big Things",
        "Home Decor",
        "Housing",
        "Trends",
        "Home Improvement",
        "Technology Trends",
        "Homes and Houses",
        "Real Estate"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carolyn Robbins",
                "href": "/profile/Carolyn-Robbins-5"
            },
            "answer_text": "I’m actually perplexed by this question, not because it’s not a good one, but because it’s so often asked. Part of me wants to raise a large banner and walk down the street in a design parade. The banner would read: “Forget the trends and be original!” I can’t emphasize enough the truth about good design and construction today unless we’re talking: decades of styles merging. Anything goes. If you have a sense of style yourself, or you find a designer who mixes styles, you’ll find this is a current ‘trend’, for lack of a better word, because it’s not really a trend on a grand scale due to the big box stores and what they’re showing. Yet it’s growing in favor. People who are downsizing need minimal furniture. People who are buying their first homes are stretching their budgets. The mid century modern era look became the rage today primarily because it’s easy to work with, clean looking and affordable, given there are so many renditions of it. It’s a break from the traditional styles we’ve seen over the last thirty years. But give it a few more years and the average family’s necessary lifestyle, of living minamally (the correct use of this modern style), isn’t easy to maintain. Then styles like the industrial era or Victorian shabby chic are adopted as well, which can be merged if designed well. I believe innovative, smart designers know that style doesn’t matter as much as how it works with the architecture of the home. That it works for the comfort of the occupants. It works with the other furnishings in a space. More important: it’s beautiful in its esthetic use and its functional use, inside the client’s own style. Not the style of the moment in the retail stores. If these three criterias are met, function and esthetics and personal style, then the trend of the day might be no trend. In other words: what matters more than anything is the artistic nature of the mix of furnishings and the quality of applications used for the interior architecture work. We are in the Original Era, even though the marketplace will seldom show this because it’s not as easy to sell in the box stores, or off the developer’s plans. Nevertheless, the “no trend” trend will prevail. ",
            "date": "Updated July 1, 2019",
            "views": "419",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ines Cortes",
                    "user_href": "/profile/Ines-Cortes"
                },
                {
                    "user_id": "Ann Williams",
                    "user_href": "/profile/Ann-Williams-137"
                },
                {
                    "user_id": "Matt Bible",
                    "user_href": "/profile/Matt-Bible-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Howden",
                "href": "/profile/Patrick-Howden"
            },
            "answer_text": "Biggest threat: LACK OF BEING highly SELF-SUFFICIENT each person, each household, each village, each town, each state & each country. MY 20 LAWS FOR LIVING WITH: PLANET-SAVING - EMISSION-FREE - POLLUTION-AVOIDING - NEAR-FREE - CLIMATE-CONSTANT - HAPPY-HEALTHY - MINIMUM-EFFORT - RE-INDUSTRIALISATION: 1. DON’T GET ANYTHING THAT HAS ONLY 1 USE like plastic, newspapers, matches & mags for which my FREE Internet Library now has a big part; remaining mags & papers to Doctor’s etc waiting rooms + part-clean paper to schools - 2. ONLY ALLOW PLASTIC THAT CAN BE EASILY MELTED & FORMED INTO OTHER ITEMS - 3. DON’T MAKE OR BUY ANYTHING THAT HAS A SHORT LIFE, OR CAN’T EASILY BE RECYCLED, RESTORED, REUSED, REACTIVATED, REMODELED, REDESIGNED, REHABILITATED, RECONDITIONED & RENEWED; avoid all PLANNED OBSOLESCENCE items - 4. BE VERY FRUGAL buy 2nd hand, garage sales; also MAKE, FIX & GROW or Find as much food as possible like our near zero-effort ¼ acre edible dwarf tree-food jungle including native-edibles + sea life; note bus from Brisbane to Melbourne & we see only about 10 front gardens with a food tree in! - 5. OWN SOLAR-CHARGED VEHICLE; MY 1950S DACHSHUND-DOG HILL-ASSISTED LONG-DISTANCE CYCLING; USE PUBLIC TRANSPORT while carrying tiny 11kg folding micro scooter; HITCH-HIKE PICKUP ALL FIJI PRIVATE-VEHICLES INCLUDING TAXIS FOR ABOUT $2 = EMISSION-AVOIDING BUDGET BUS FARE; NO FLYING to AVOID disasters & gross pollution; SAIL BEST; - 6. OWN POWER LIKE SOLAR, HYDRO OR WIND ETC - 7. PRESERVING in SUCH AS FRESHIELD VACUUM, OR WATER BAGS in the wind - 8. COOK SOLAR OR ON 1-STICK STOVE - 9. WORLD BIRTH CONTROL - 10. STOP MOST ALL TOTAL RADIATION - 11. OWN CLEAN WATER LIKE RAIN TANK, STREAM, CLEAN WELL, CARRY A JAR WITH YOU - 12. DON’T FLUSH IF ONLY PISS, COMPOST TOILET saves water, SEPTIC TANK OR DOWN A HOLE - 13. FOOD & GARDEN SCRAPS TO COMPOST, MULCH OR BURY, MICROWAVE PEELINGS FOR DOG - 14. HOME 12-VOLT APPLIANCES WE MAKE, OR GET FROM CARAVAN, SURVIVAL, CAMPING OR BOAT SHOPS - 15. STAND ON LAUNDRY IN A BOWL WHILST SHOWERING - 16. NEVER SMOKE, DRINK, GAMBLE or DRUG - 17. SOLAR DESALINATION IS VITALLY NEEDED, AS IN PART OF S.AMERICA; VAST DESALINATION & PUMPING FOR THE WORLD’S DROUGHT AREAS IS THE JOB FOR A CHEAP NUCLEAR REACTOR, INCLUDING HEAT-EXCHANGERS, EVEN DISTRICT-HEATING - 18. PINE TREE MEALS - 19. MY CORNISH UK GLASSED VERANDA FACING THE SUN HEATED ENTIRE HOME UNTIL LONG AFTER WINTER SUNSET + INSULATE CEILINGS & 3 LAYERS OF CARDBOARD UNDER CARPET + ON WALLS IF POSSIBLE - 20. A PARTNER GIVES PROVEN MORE HEALTH & HAPPINESS; OPTIMUM LOW COST FAMILY is when one partner works or has village business, the other helps family become highly self-sufficient. Swap jobs every 6 months or less! We are not rich because we have the most, but because we need the least… WE ENJOY MOST ALL THE ABOVE IN TOTAL LUXURY at our healthy ages of 85 & 70, thriving on less than 5% pension!! ANY MORE SUGGESTIONS WELCOME? 1-word GOOGLE: DRPATSAWESOMELIBRARY ; 2nd page shows how to access & download FREE Library. ₤ HOMELESS: In several countriesChurch services are followed by tea + loads of cake, sandwiches, fruit sausages etc. Also - including Brisbane's St.Vincent de Paul's gives free or cheap accommodation + meals for those staying there + meals out back for non residents. Over the years in Portobello Road, London & Sydney Markets I have been able to largely feed an entire apartment with market vast left-overs. A tiny folding bike is indispensable, as were British, Yank & Australian Survival books for bush tucker - including Vanuatu villages where hurricanes have destroyed all food gardens. In 1960s & 1970s the book \"Golden Guide to South & East Asia\" fed & housed us from Malaya to Afghanistan & Iran via India, Thailand, etc. TO KEEP WARM IN COLDEST WINTERS: 3 layers of box cardboard insulates on floors under carpets. Also on walls behind Book cases & cupboards against walls facing outside + in ceilings. Long socks on your hands are wonderful in bed etc. Hotwater bottle covered in a knitted bag keeps bed warm all night. Our 46 watt solar panel provides total house power including summer fridge which if outside, will be OFF all winter, blender, fans, LEDs, pumps, TV & radio etc; but best of all a bed warmer comprising a rheostat - variable power resistor - inside a MILO or big coffee can which is placed in the bed. Save bathwater there till cold to warm house a little. In bed we have all 3 meals as well as watch TV, use computer & phone, read books, play & listen to music + radio etc. Our single-stick air-preheating & afterburning Helixtove with flu heats wonders with no wood chopping. Wellington gumboots are real warm outside; fill with water & walk around for a few minutes to clean boots & your feet. Migrate to warm New Zealand, Fiji, Vanuatu or Australia where we virtually have every day cloudless, no violence or guns etc & bananas that ripen all winter in Queensland State. KEEP COOL: We hand-spray our T-shirt with water, then have a small fan playing on the moist T-shirt in real heat waves, that usually gets too cold & we have to slow or redirect the fan. With 2 or 4 watt car fan playing on bare legs is much cooler than if fan playing on face, arms etc; fans can often save more than ½ air conditioning power that we find unnecessary even in Queensland. For low-humidity areas we have a tiny 12volt water evaporator; big home units are very economical & take little power to supply cool air ducted around to each room. For outside in the sun, my favorite is a white hat topped with a small solar PV panel powering a cute little fan built into the front brim. Air Conditioning: Simply have a fan blow air into a bucket of ice if available. Cool water drinks help + cool water swim or garden hose spray. All these replies are using the wrong type of inefficient fridge. Our old unit TOP-LOADING FRIDGE: Homemade most efficient 40L plastic trash drum = 12 volt, 2.3 average-watt unit under house, in breeze & shade + part-buried & never in hot kitchen, with 15 cms polyurethane foam all around; uses 30 times less annual energy than other fridges + good ice maker. Power from a car battery used for entire 12-volt house that is charged by the 46 watt solar panel. Fridge takes about 2 days to cool down. In cool climates, this outside fridge can be permanently off during winter. The unit uses a 12 volt DANFOSS Danish kit compressor system. ",
            "date": "Answered February 21, 2019",
            "views": "70",
            "upvotes": " Answer requested by Matt Bible"
        }
    ]
}