{
    "title": "What is the difference between a cell phone and a mobile phone ? - Quora",
    "tags": [
        "Mobile Phones",
        "Telephones",
        "Telecommunications",
        "Cellular Service Providers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raaj Mehta",
                "href": "/profile/Raaj-Mehta-1"
            },
            "answer_text": "What Is a Mobile Phone? A mobile phone is more frequently called a cellular phone or cellphone. These communication devices connect to a wireless communications network through radio waves or satellite transmissions. Most mobile phones provide voice communications, Short Message Service (SMS), Multimedia Message Service (MMS), and newer phones may also provide Internet services such as Web browsing, instant messaging capabilities and e-mail. What Is a PDA? Short for personal digital assistant, this is the name given to small handheld devices that combine computing, telephone/fax, Internet and networking features. A typical PDA can function as a cellular phone, fax sender, Web browser and personal organizer. These devices are usually pen-based, which requires the use of a stylus rather than a keyboard for input. PDAs today are available in either a stylus or keyboard version. Traditionally, PDAs have not had phone or fax services. What Is a Smartphone? A smartphone is considered to be the combination of the traditional PDA and cellular phone, with a bigger focus on the cellular phone part. These handheld devices integrates mobile phone capabilities with the more common features of a handheld computer or PDA. Smartphones allow users to store information, e-mail, install programs, along with using a mobile phone in one device. A smartphone's features is usually more oriented towards mobile phone options than the PDA-like features. There is no industry standard for what defines a smartphone, so any mobile device that has more than basic cellphone capabilities can actually be filed under the smartphone category of devices. What Is a PDA Phone? It's definitely a lack of standardization that makes the category of mobile devices so confusing to the consumer. As technology changes, so do the functions that these different devices perform. Years ago, many people differentiated PDA and smartphone simply by looking for touch-screen capabilities. If it had a touch screen it was a PDA, if it didn't, it was a smartphone.  The Sony Ericsson Smartphone, for example, offers users both a touch screen and a full QWERTY keyboard.  Despite the fact that the manufacturer calls this product a smartphone, the generic term for a PDA oriented device with cellular phone capabilities is called a PDA phone. Fuzzy Lines Between Smart Devices Even if you can now decide for yourself if a mobile device is simply a cellular phone, a smartphone, a PDA or PDA phone, the fine lines between these types of mobile devices are about to get blurred again as we add in new terms to the mix like Pocket PC, and Smartphone (with a capital letter). So starting with the difference between smartphone, as we've discussed above: When capitalized, it refers to Microsoft's Smartphone platform, which is used for a variety of mobile devices. The latest version, Windows Mobile 6 actually removes the word Smartphone from its title, and over time this should help lessen the confusion between smartphone and Smartphone. Interestingly, , one of the three versions of Windows Mobile 6 is called Windows Mobile 6 Standard for Smartphones. Here the \"For Smartphones\" means \"phones without touch screens\". The Pocket PC itself is not a specific category of mobile devices, but rather the name given to PDAs that use the Microsoft Windows Mobile operating system. Much like the category of PDA devices, Pocket PCs features are focused on computing and data tasks with other features, like cellular phone capabilities being secondary to the PDA functions.  The Pocket PC is one device that is standardized. In order to carry the Pocket PC label the device must meet specific criteria such as use Microsoft's Windows Mobile for Pocket PCs, include a touch screen, include a touchpad, and other specifications. Some Popular Examples The popular Apple iPhone is a combination smartphone and iPodThe HP iPAQ Mobile Messenger is a Pocket PCThe LG Prada is a cellular phone with a touch screen — but its not a smartphoneThe RIM BlackBerry 8800 is considered a smartphone — but its borderline on being a handheld PC device due to its size and featuresThe Palm Treo 700p is a PDA phoneThe Motorola Q is also considered to be a PDA phoneWhat's The Differences, Again? In summing up the differences between these common mobile communications devices you could say that a PDA phone is more PDA than phone and a smartphone is more phone than PDA. And, of course, a cellular phone is more phone than anything else. DID YOU KNOW... The first cellular call was placed on April 3, 1973 by Martin Cooper who was the general manager of Motorola's Communications Systems Division. He made the call to his rival, Joel Engel, Bell Labs head of research. (Source: Selling The Cell Phone) ",
            "date": "Answered May 2, 2016",
            "views": "311",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Waddlie",
                    "user_href": "/profile/Waddlie"
                },
                {
                    "user_id": "Mabarrat Toaha",
                    "user_href": "/profile/Mabarrat-Toaha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shahin Cassim",
                "href": "/profile/Shahin-Cassim"
            },
            "answer_text": "A mobile phone is a broader term used when a phone is mobile, i.e not connected by wires. The term mobile phone is agnostic of technology and covers satellite phones, cell phones or Wi-Fi phones. A Cellphone is a mobile phone that works within radio cells. A cell is an area of radio coverage. Typically cell phones can move from one cell to another without dropping a call. The term Cellphone covers all cell based technopogies 2G, 3G, 4G AMPS, PCS, etc. Satellite phones while they are mobile phones are NOT cell phones. As mobile phones evolved they took on new functionality and the earlier phones allowed simple games, a calendar, connected email etc. These phones were termed feature phones and are still very much used in lower ends of the market in many countries. Feature phones don't describe the radio technology, they only describe the functionality and the radio technology can be any. As these feature phones evolved they became computer like and the term smartphone was coined to distinguish their enhanced capability and differentiate them from feature phones. Again a smart phone doesn't describe the radio access technology. Android phones and IPhones are examples of smart phones. Hope this helps. ",
            "date": "Answered November 9, 2017",
            "views": "22",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": ". Michael A. Martin",
                    "user_href": "/profile/Michael-A-Martin-1"
                },
                {
                    "user_id": "Ivian Dollington",
                    "user_href": "/profile/Ivian-Dollington"
                },
                {
                    "user_id": "Peter Zielinski",
                    "user_href": "/profile/Peter-Zielinski-8"
                },
                {
                    "user_id": "Ria Mukasa",
                    "user_href": "/profile/Ria-Mukasa"
                },
                {
                    "user_id": "Thangs Thangasamy",
                    "user_href": "/profile/Thangs-Thangasamy"
                },
                {
                    "user_id": "Jay Hanson",
                    "user_href": "/profile/Jay-Hanson-15"
                },
                {
                    "user_id": "Rayeann Kemp",
                    "user_href": "/profile/Rayeann-Kemp"
                },
                {
                    "user_id": "Uneeb Babar",
                    "user_href": "/profile/Uneeb-Babar"
                },
                {
                    "user_id": "Robin Harris",
                    "user_href": "/profile/Robin-Harris-74"
                }
            ]
        }
    ]
}