{
    "title": "What is multimedia design? - Quora",
    "tags": [
        "Multimedia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Md Nasir Nofi",
                "href": "/profile/Md-Nasir-Nofi"
            },
            "answer_text": "The Multimedia Design  The Multimedia Design is perhaps the most complete career in the design world, as it allows you to learn and combine different communication techniques with a wide variety of knowledge related to the creation of audiovisual content. The combination of texts, images, sounds, animations, etc., gives the professional in this discipline the possibility of transmitting the message, the client's products in a dynamic and creative way that will produce the best result. In this way, we could say that Multimedia Design combines the best of the disciplines of design, communication and advertising to generate an attractive multimedia message that achieves the objectives of promoting a product. A developed product may take different forms: from a simple audiovisual production, The Multimedia Designer performs Once the product or service to be promoted and the communication objectives have been received, the Multimedia Designer will generate a project, identifying, in order to achieve the most favorable result, the graphic or audiovisual media to be used. In this way you can combine texts, images, sounds, animations, special effects, animations, etc. You will also be able to program web pages or applications, software, perform modeling, etc. With all these tools at your fingertips, you will search, through your communication skills, the most suitable for the transmission of the message. The job opportunity of the Multimedia Designer The possibilities of professional insertion in this career are endless, thanks to the breadth of knowledge acquired and the possibility of applying it to different fields. Many choose to work autonomously, creating their own company, or simply carrying out projects on demand and gradually building their careers. Beyond this, you can participate in or direct projects in one of the following areas: Advertising agencies; television production companies; software development companies; marketing companies; electronic publications; Web applications development; creation and development of video games; in the advertising, promotion or press department of any company or government agency; in teaching; etc. Multimedia Design Of course there will be numerous variations in the study plans, as it is such a comprehensive career, but some of the basic subjects you will come across are: Text Production; Multimedia Language; Aesthetic; Communication theory; Video production; Graphic design; Technical drawing; Computer Animation; Programming; Advertising, Marketing; Digital Illustration; Website Design and Administration; etc. Advantages of studying Multimedia Design It is a good profession to perform independently and create your own company. Your work will depend largely on the use of your creativity. You will incorporate vast knowledge, from numerous areas, and you must train permanently, so you will avoid stagnation in your profession. The number of alternatives for working out, applying your knowledge in the elaboration of a multimedia project or simply using part of them, is immense. The studies that you will carry out will help you to work anywhere in the world. Disadvantages of studying Multimedia Design It is a fashion career, so you will find many professionals like you, and you will have competition when looking for a job. Choose your place of study conscientiously, since you will be able to find institutes of low quality or whose diplomas are not officially recognized. If you choose to work independently, your work will start slowly and gradually, until you can make a name for yourself in the field. Where we study Multimedia Design In each country you will find varieties in the duration and complexity of the Multimedia Design courses. From courses where you will learn only basic notions and some computer programs, through holistic training in the field of design and communication, to masters and specialization courses. Argentina: The National University of La Plata has a Bachelor's and Teaching Degree in Multimedia Design, with a duration of 5 years between the two degrees. The Da Vinci School of Multimedia Art offers a 3-year Multimedia Design Career. At UADE you can study the Bachelor in Multimedia and Interaction Design, for 4 years. Spain: The University School of Design and Innovation offers you a 4-year Degree in Multimedia and Graphic Design. At the University of Valencia you have a Degree in Multimedia Engineering, also lasting 4 years. The Escola Superior d'Imatge I Disseny (IDEP) in Barcelona has a master's degree in Interactive Digital Design and Motion Graphics. Mexico: The Anahuac University has in its academic offer the Degree in Multimedia Design. It lasts 4 years. The Autonomous University of Nuevo León, meanwhile, offers you a Bachelor of Multimedia and Digital Animation, also for 4 years.  Curious fact: One of the most frequent options of Multimedia Design today is the generation of web applications with multimedia content. The great demand for this type of applications causes some that vary between what we could say creative, curious or doubtfully useful to come to light. Some examples: an anti-mosquito web application that emits ultrasounds to combat them (but that we cannot hear); Another that allows you to schedule a false call at a certain time, in which a voice will be heard on the loudspeaker, so you can escape a visit by obligation or an appointment that does not work. Another application informs you when you watch a movie which moments are the least interesting, in case you have to go to the bathroom or make a phone call, and when you return it gives you a summary of the parts you missed. ",
            "date": "Answered April 4, 2020",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Florence S. Hargis",
                "href": "/profile/Florence-S-Hargis"
            },
            "answer_text": "Sight and sound alludes to content that utilizes more than one medium. The classes of media are dangerous, however they by and large include: Text Sound Illustrations/pictures Liveliness/video (live film instead of activity) Mixed media turned into a significant idea as the Web moved away from a generally printed format to a graphical one. Numerous locales were contending to turn out to be genuine interactive media destinations with a blend of text, sound, pictures and recordings. Actually, a video (a few pictures run in progression) with sound qualifies as sight and sound without anyone else. Also, since the Web is fit for giving a genuine mixed media experience, the attention is on rich media – that is, sight and sound with intelligent components. Undeniably, be that as it may, the Web despite everything has far to go before its printed roots are deserted. A significant part of the media and sight and sound on the Web is encased in text since this is as yet the essential strategy for route over the Web. ",
            "date": "Answered August 7, 2020",
            "views": "23",
            "upvotes": "0"
        }
    ]
}