{
    "title": "What is the weirdest DC universe? - Quora",
    "tags": [
        "DC Universe",
        "DC Comic Books",
        "DC Extended Universe (DCEU)",
        "DC Comics Superheroes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabe Candee",
                "href": "/profile/Gabe-Candee-1"
            },
            "answer_text": " Earth-47, aka, “Dreamworld”A psychedelic universe practically pulled straight out of the 70’s. This alternate universe which was lost in crisis was initially created by Grant Morrison and Chaz Truog, first appearing in Animal Man v1 #23 (1990). Apparently, Morrison liked the idea behind this particular universe so much that he decided to adapt it into one of the new 52 universes as presented in The Multiversity: Guidebook (2014). The universe follows the same basic premise and concepts from the original version, though with added and rehashed characters from the Pre-Crisis era. In this universe, all of the known heroes belong to the Love Syndicate. The characters of this universe are pretty unique and certainly “groovy.” Here they are from left to right: President Prez Rickard… Prez is based on Joe Simon and Jerry Grandenetti’s character of the same name, first appearing in Prez v1 #1 (1973). Both versions of the character are in their late teens and have been elected President of the United States. However, this rehashed version by Morrison is functionally immortal as well as the one responsible for funding the Love Syndicate.Sunshine Superman… Sunshine Superman is one of the many Supermen of the Multiverse who appears to be Kryptonian or share similar powers to. Not much is known about him aside from this fact. He’s got one sweet ’fro and an epic insignia, though!Brother Power the Geek… Brother Power appears to be a rehashed version of Joe Simon and Al Bare’s character by the same name, first appearing in Brother Power the Geek #1 (1968). He is a mannequin brought to life by a lightning bolt meeting some bloody hippie’s rags which were doused in oil and warm with heat from a radiator. Thanks to his wired frame, he is incredibly strong, durable, acrobatic, and hyper-intelligent.The Shooting Star… The Shooting Star appears to be a rehashed version of Martin Pasko and Pat Broderick’s Shooting Star (Bruce Wayne), first appearing in “If Bruce Wayne Had Not Become the Batman” of Batman v1 #256 (1974). The premise behind his character is that, instead of a bat, Bruce Wayne encounters a shooting star. This leads him to decide to become “a shooting star.” Nothing besides this inspiration is known about Shooting Star.Speed Freak… Speed Freak is one of the many Flash of the Multiverse who is implied to be another Speed Force conduit. Otherwise, not much is known about her.The Magic Lantern… The Magic Lantern is an enlightened, pot smoking hippie who dons the Magic Lantern Ring which (so far as we know) functions similarly to a Green Lantern Power Ring. His superiors are the Gurus, surreal intergalactic aliens.",
            "date": "Answered October 5, 2020",
            "views": "65",
            "upvotes": " View 194 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cameron Wöltje",
                    "user_href": "/profile/Cameron-Wöltje"
                },
                {
                    "user_id": "Josh Orton",
                    "user_href": "/profile/Josh-Orton-11"
                },
                {
                    "user_id": "Miroslav Iliev",
                    "user_href": "/profile/Miroslav-Iliev-11"
                },
                {
                    "user_id": "John Jr Kitchings",
                    "user_href": "/profile/John-Jr-Kitchings"
                },
                {
                    "user_id": "Dragon Wolf Knight",
                    "user_href": "/profile/Dragon-Wolf-Knight"
                },
                {
                    "user_id": "Korey Daniel",
                    "user_href": "/profile/Korey-Daniel"
                },
                {
                    "user_id": "Dave Smith",
                    "user_href": "/profile/Dave-Smith-757"
                },
                {
                    "user_id": "Sert Doug",
                    "user_href": "/profile/Sert-Doug"
                },
                {
                    "user_id": "Ryan Falls",
                    "user_href": "/profile/Ryan-Falls"
                },
                {
                    "user_id": "Christopher Perkins",
                    "user_href": "/profile/Christopher-Perkins-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julian Shyu",
                "href": "/profile/Julian-Shyu"
            },
            "answer_text": "So… Earth-183 is pretty weird.  Basically it’s an Earth where instead of Superman’s rocket landing in Kansas on The Kent farm, he lands in Africa with some Gorillas. Then for some reason, the Gorillas decided to raise the random baby that came from space. They then called this Kryptonian baby Karkan. So under the sunlight and being protected by the apes, Karkan grows up and becomes the king of the jungle, because frankly, not many things could kill an invincible dude with laser vision. Then Karkan, who seems pretty clean and doesn’t have a twenty-foot long beard after living his whole life in the jungle, finds some humans who were capturing animals.  The humans find out about Karkan and with some luck of finding Kryptonite, they captured him. The blonde lady (shown above) takes pity on Karkan and after a fight with her uncle, they indirectly set Karkan free by knocking the Kryptonite into the water. In short, Karkan beat up all the humans, freed his kidnapped Gorilla buddies, then heads off into civilization with a blonde lady he just met. This DC universe is hella weird. -Nailuj ",
            "date": "Answered October 23, 2020",
            "views": "192",
            "upvotes": " View 730 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Don Howard",
                    "user_href": "/profile/Don-Howard-18"
                },
                {
                    "user_id": "Daniel Mincher",
                    "user_href": "/profile/Daniel-Mincher"
                },
                {
                    "user_id": "Josh Boyer",
                    "user_href": "/profile/Josh-Boyer-20"
                },
                {
                    "user_id": "Felipe Minami",
                    "user_href": "/profile/Felipe-Minami"
                },
                {
                    "user_id": "Vahyala Kwaga",
                    "user_href": "/profile/Vahyala-Kwaga"
                },
                {
                    "user_id": "Manjakaattu Myna Myna",
                    "user_href": "/profile/Manjakaattu-Myna-Myna"
                },
                {
                    "user_id": "Cavwin Dheepak",
                    "user_href": "/profile/Cavwin-Dheepak"
                },
                {
                    "user_id": "Caleb Bravo",
                    "user_href": "/profile/Caleb-Bravo-1"
                },
                {
                    "user_id": "Buwan Mcgyverselvan",
                    "user_href": "/profile/Buwan-Mcgyverselvan"
                },
                {
                    "user_id": "Eshwar Prasad",
                    "user_href": "/profile/Eshwar-Prasad-53"
                }
            ]
        }
    ]
}