{
    "title": "What world problems can Big Data actually solve? - Quora",
    "tags": [
        "Big Data Analysis",
        "Analytics",
        "Data",
        "Data Analysis",
        "Big Data"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ricardo Vladimiro",
                "href": "/profile/Ricardo-Vladimiro-1"
            },
            "answer_text": "None. Data, big or small, solves nothing. Really... we can collect and process all the data in the world and it will not solve a thing. My reasoning is that big data is about handling data that wouldn't be possible to be handled by traditional database systems. In itself this is very important but it doesn't really solve problems other than engineering ones. Not all is bad news... What we do with it can solve a lot of things and without big data a lot of the amazing things we do would not be possible. But big data is a means to an end and the end can be many things: data mining, data science, scientific research. Many world class problems are being addressed with big data. Everything genetics is one and can produce a large impact in many areas. There's a big effort in the US to accelerate cancer research. Disease control and research benefits largely from big data since we can simulate outbreaks and affected areas more precisely. Although I'm not sure, I think that climate change models are founded on big data. On a more local level, there are interesting problems with traffic in large cities which is quite impactful for many people but not global scale ones. ",
            "date": "Answered May 10, 2016",
            "views": "13",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Belina",
                    "user_href": "/profile/David-Belina-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saul Venskutonis",
                "href": "/profile/Saul-Venskutonis-1"
            },
            "answer_text": "Ok let's see: Say you are a farmer and along comes the spring time when you have to decide what to plant in your field. Ideally you'd like to plant it all with strawberries, because you can sell them at a great profit, however there's a catch - last year the weather was so hot that half of the harvest was ruined and that brought you some serious loss. In case this year is as hot as the previous you're prepared to water them extensively. Here's the problem: you rent some expensive watering equipment on a monthly basis, but if that month happens to be rainy you don't use it. So, how do you predict the weather for months in advance to minimise your costs and maximise the profit? Well to make such weather predictions you'd have to look globally at a variety of factors such as humidity, average daily temperatures, air pressure, and so on. Now how do you get this data? You can use big money and lots of time to gather it, or you can use Big Data. Just get readily accessible information from satellites, home IoT devices, weather stations, etc. from the internet and push them into an algorithm (IBM's Watson for example) to find patterns and make predictions. Look at that - June has a 87% chance to be rainy and warm. Perfect for your strawberries. Congratulations, you just saved money and time.  ￼ Of course this is just one example of where Big Data comes into our daily lives (probably not the best one either), but it illustrates the key concept that Big Data = insights and insights = power. Our tweets, comments, sensor output - generate petabytes of data on a daily basis. However, people have come to realise that this mountain of data is not just useless gibberish, but can be analysed and provide very useful analytical insights in finance, medicine, politics and other areas of life, just like shown in the example above. ",
            "date": "Answered September 1, 2016",
            "views": "16",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cyborg",
                    "user_href": "/profile/Cyborg-30"
                },
                {
                    "user_id": "Idrissa Kané",
                    "user_href": "/profile/Idrissa-Kané-1"
                },
                {
                    "user_id": "Rebha Adyanthaya",
                    "user_href": "/profile/Rebha-Adyanthaya"
                },
                {
                    "user_id": "Lemme Stay Unknown",
                    "user_href": "/profile/Lemme-Stay-Unknown"
                },
                {
                    "user_id": "Ashish Kukreja",
                    "user_href": "/profile/Ashish-Kukreja-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Harding",
                "href": "/profile/Ron-Harding-2"
            },
            "answer_text": "only when combined with real live processes using IoT can big data start to contribute. IoT/M2M play their part now in existing systems. the popular machine learning uses training data then real data to capture live data, straight up statistics and data acquisition is well established in many microcontroller systems world wide. when that live data is compared against recorded data is where smart decisions can be made in many settings. keep in mind that this can be applied to pre-existing statistical recorded data processes as well. both approaches will continue to be used side by side. only history will show which approach will overtake. ",
            "date": "Answered September 23, 2020",
            "views": "18",
            "upvotes": " Answer requested by Hema Daryani"
        }
    ]
}