{
    "title": "What things happened between 1992 and 2008? - Quora",
    "tags": [
        "1992"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Lee Chadwick",
                "href": "/profile/Adam-Lee-Chadwick"
            },
            "answer_text": "What things happened between 1992 and 2008? . 42nd President of the United States January 20th, 1993 to January 20th, 2001 Bill Clinton - Inauguration Day On April 13th, 1997; Tiger Woods became the youngest winner of the Masters Golf Championship. He set the record with one of the wildest winning margin in a major golf tournament at just 21 years and 104 days old. He scored (-18) and the second place scored (-6) by ´´Tom Kite.´´ Tiger Woods won the tournament by 12 strokes, and the lowest winning score, with 270 total.  Mike Tyson bit Evander Holyfield ear during a World Heavyweight Title Boxing Fight. June 28th, 1997 MGM Grand Garden, Las Vegas, Nevada  In 2000, Lance Armstrong; the cyclist was stripped of his Olympic Bronze Medal from the 2000 Sydney Games and also was stripped of his seven ´´Tour de France´´ titles because of the use of performance-enhancing drugs. He was given a lifetime ban by the United States Anti-Doping Agency.  43rd President of the United States January 20th, 2001 to January 20th, 2009 George W. Bush - Inauguration Day 2001 Wimbledon Champion Goran Ivanisevic is the only ´´Wild Card´´ entrance ever to win the major ´´Grand Slam´´ in a professional tennis tournament He defeated ´´Pat Rafter´´ 6–3, 3–6, 6–3, 2–7, 9–7 in the finals.  9–11–2001 Attack - Twin Tower War in Afghanistan - October 7th, 2001 Iraq War - March 2003 Financial Crisis (Stock Market Crash & Banking Collapse) - 2007 to 2008 ",
            "date": "Answered January 12, 2020",
            "views": "253",
            "upvotes": "0"
        }
    ]
}