{
    "title": "What is cell phone pinging? - Quora",
    "tags": [
        "Cellular Service Providers",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Fred",
                "href": "/profile/David-Fred-3"
            },
            "answer_text": "It is a signal sent to the device requesting a location update. It occurs normally in the network, or can be initiated via a warrant issued to the carrier to locate the phone for use by law enforcement. It's a term that has been broadened by the writers of crime fiction to include all sorts of things that aren't truly a “ping”. A “ping”, like in the IP world occurs real time by command, much like in the Windows command line when you type “ping xxx.xx.xx.xxxx”. Pings aren't historical, they aren't recorded as such as part of normal network operation. That's not to say that you can't go back and determine a cell phone’s location at some prior time in history. You can, very accurately, with a warrant. The fiction writers now include ping to describe all manner of normal network functions, HLR/VLR updates, periodic registration, making or receiving a call or text, etc. But a true “ping” is a network command driven locate of a phone outside of the phone’s normal network behavior. And before you ask, no, there is no indication to the user it's happening. ",
            "date": "Answered March 9, 2017",
            "views": "25",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saul Zohan",
                    "user_href": "/profile/Saul-Zohan"
                },
                {
                    "user_id": "Aaron Jennings",
                    "user_href": "/profile/Aaron-Jennings-17"
                },
                {
                    "user_id": "Sonia Iceangel",
                    "user_href": "/profile/Sonia-Iceangel"
                },
                {
                    "user_id": "Anthony Tipton",
                    "user_href": "/profile/Anthony-Tipton-7"
                },
                {
                    "user_id": "Federico Joaquín Bustos Fierro",
                    "user_href": "/profile/Federico-Joaquín-Bustos-Fierro"
                },
                {
                    "user_id": "Charles Utz Loper",
                    "user_href": "/profile/Charles-Utz-Loper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jayson Grieve",
                "href": "/profile/Jayson-Grieve"
            },
            "answer_text": "Cell phone pinging is also known as triangulation triangulation is the process of determining the location of a point by forming triangles to it from known points If you have at least three cell phone towers that currently have a cell phone within their broadcast radius, each cell tower can determine how far away from it the device is based on its signal strength.  As you can see from the diagram, the overlapping circles created by this information gives a close approximation of where the cell phone is located. Theoretically, the more towers that are in range, the smaller the possible area should be. Diagram Source: Cell Phone Triangulation Accuracy Is All Over The Map ",
            "date": "Answered March 9, 2017",
            "views": "164",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles Utz Loper",
                    "user_href": "/profile/Charles-Utz-Loper"
                },
                {
                    "user_id": "Dylan Houser",
                    "user_href": "/profile/Dylan-Houser"
                },
                {
                    "user_id": "Paula A. Wray",
                    "user_href": "/profile/Paula-A-Wray"
                },
                {
                    "user_id": "Kevin Rome",
                    "user_href": "/profile/Kevin-Rome-2"
                },
                {
                    "user_id": "Christopher Alomia",
                    "user_href": "/profile/Christopher-Alomia"
                },
                {
                    "user_id": "Ava Reid",
                    "user_href": "/profile/Ava-Reid-7"
                },
                {
                    "user_id": "Madu Upadhya",
                    "user_href": "/profile/Madu-Upadhya"
                },
                {
                    "user_id": "Chester Payne",
                    "user_href": "/profile/Chester-Payne"
                },
                {
                    "user_id": "Dakota Madison",
                    "user_href": "/profile/Dakota-Madison-2"
                }
            ]
        }
    ]
}