{
    "title": "What are some best websites to learn networking? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Sparsh Nigam",
                "href": "/profile/Sparsh-Nigam-2"
            },
            "answer_text": "I can understand your problem as there are a lot of websites avaiable on Internet That doesn’t give full knowledge about networking. As networking is a very big part of a computer and nowadays it is very popular and people wants to know everything about networking you can also get a lot of knowledge on networking . Here is a web where u can find all Knowledge related to Networking Complete Computer networking notes guides tutorials But I would prefer you to get a Tutor hired for this purpose as this Topic is really very complicated and hard to Understand without a professional’s guide. Hope this will be helpful to you If you have any other query ask it in comment section and don’t forget to upvote if you like find this answer Helpful. ",
            "date": "Answered June 20, 2017",
            "views": "58",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Syed Idrees",
                    "user_href": "/profile/Syed-Idrees-16"
                },
                {
                    "user_id": "Rahulkumar Singh",
                    "user_href": "/profile/Rahulkumar-Singh-4"
                },
                {
                    "user_id": "Nisha Soms",
                    "user_href": "/profile/Nisha-Soms-1"
                },
                {
                    "user_id": "Veeraraghavan Srinivasan",
                    "user_href": "/profile/Veeraraghavan-Srinivasan-6"
                },
                {
                    "user_id": "Bhuvana Alapati",
                    "user_href": "/profile/Bhuvana-Alapati"
                },
                {
                    "user_id": "Ravi Teja",
                    "user_href": "/profile/Ravi-Teja-1559"
                },
                {
                    "user_id": "Anirban Dutta",
                    "user_href": "/profile/Anirban-Dutta-74"
                },
                {
                    "user_id": "Udipta Das",
                    "user_href": "/profile/Udipta-Das"
                }
            ]
        },
        {
            "author_info": {
                "name": "Onkar Patil",
                "href": "/profile/Onkar-Patil-32"
            },
            "answer_text": "I think for learning basic things in networking it would be better to follow the various websites available on internet today. But if u prefer to learn the networking for the career purpose then u must also start practicing the things like subnetting, ip address assigning. And theres a youtuber named jagvinder dhind, who constantly uploads vdoz about nwking, and fundamentals of computer troubleshooting. So do follow him also, since his vdos are full of animations but its ok.. Cause the way he explains the concept is easy to understand. ",
            "date": "Answered December 11, 2016",
            "views": "71",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Samuelson Acheampong",
                    "user_href": "/profile/Samuelson-Acheampong"
                }
            ]
        }
    ]
}