{
    "title": "What is Data Virtualization? - Quora",
    "tags": [
        "Data Virtualization",
        "Enterprise Search",
        "Data Integration",
        "Master Data Management",
        "Service-Oriented Architecture (SOA)",
        "Business Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tejas Ambekar",
                "href": "/profile/Tejas-Ambekar-6"
            },
            "answer_text": "Data virtualization is an umbrella term used to describe any approach to data management that allows an application to retrieve and manipulate data without requiring technical details about the data, such as how it is formatted or where it is physically located. Many organizations run multiple types of database management systems, such as Oracle and SQL servers, which do not work well with one another. Therefore, enterprises face new challenges in data integration and storage of huge amounts of data. With data virtualization, business users are able to get real-time and reliable information quickly, which helps them to take major business decisions. The process of data virtualization involves abstracting, transforming, federating and delivering data from disparate sources. The main goal of data virtualization technology is to provide a single point of access to the data by aggregating it from a wide range of data sources. This allows users to access the applications without having to know their exact location. The most recent implementation of the data virtualization concept is in cloud computing technology. Data virtualization software is often used in tasks such as: Data integrationBusiness integrationService-oriented architecture data servicesEnterprise searchSome of the capabilities of data virtualization include: Abstraction of technical aspects of stored data, such as:Application programming interfaceAccess languageLocationStorage structureConnection to disparate data sources and the ability to make data accessible from a single placeData transformation, quality improvement and integration of data, depending on the business requirementsAbility to combine the data result sets across multiple sources (also known as the data federation)Ability to deliver the data as requested by users",
            "date": "Answered May 24, 2018",
            "views": "325",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Zaidi",
                "href": "/profile/Jay-Zaidi"
            },
            "answer_text": "Data Virtualisation is a data architecture design pattern that allows you to create an integrated view of your data from multiple sources. A very simple analogy is that of a database view - which basically creates a virtual view (not physical) of data from several underlying tables or views. The bottom line is that data virtualisation is a great option if you wish to integrate data silos without having to physically move and integrate massive amounts of data. The best place to understand how this works and to see real examples, you can visit a site such as Denodo Home.  Please note that the fact that I'm referring you to this product shouldn't be construed as an implicit or explicit recommendation. I leave it to you to do the due diligence and make an objective determination, based on your specific use cases and data requirements.  ",
            "date": "Answered April 12, 2016",
            "views": "625",
            "upvotes": "0"
        }
    ]
}