{
    "title": "What makes something art or someone an artist? - Quora",
    "tags": [
        "Contemporary Art",
        "Artists and Creative Professions",
        "The Arts",
        "Fine Art"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Isaacs",
                "href": "/profile/Tom-Isaacs"
            },
            "answer_text": "Joseph Beuys liked to say that \"everything is art\" and \"everyone is an artist\". I think he's closer to the truth than people realise, but it might help to be a bit more specific about what art is and what it means to be an artist... What makes something art? In 1915, Marcel Duchamp exhibited his first \"readymade\", a snow shovel with the title En prévision du bras cassé (Prelude to a broken arm).   Other readymades include a bottle rack and a urinal (Fountain). By taking ordinary manufactured items and calling them art, Duchamp established what is pretty much the prevailing view in the art world today: \"If you call it art, then it's art.\" This idea really upsets some people who think that for something to be considered art it has to fit a more exacting set of criteria. Two common examples of such criteria are that art should be beautiful and that it should require some skill on the part of the artist. These people often say things like, \"That's not art!\" or \"A six year old could do that\". I like this quote from Kurt Vonnegut explaining his views on art to his brother:  There are many people who are beneficially stimulated by some, but not all, man-made arrangements of colors and shapes on flat surfaces, essentially nonsense. You yourself are gratified by some music, arrangements of noises, and again essentially nonsense. If I were to kick a bucket down the cellar stairs, and then say to you that the racket I had made was philosophically on a par with The Magic Flute, this would not be the beginning of a long and upsetting debate. An utterly satisfactory and complete response on your part would be, ‘I like what Mozart did, and I hate what the bucket did.’ In other words, it's okay to dislike an artwork, but that's no reason to say that it's not art. If you find it stimulating... great! If not... go find something else to look at. My idea of art is that it is simply a vehicle for an idea. If you are trying to say something about the world or about life you can do it through art. Even ancient works which are far removed from conceptual art still embody ideas. For example religious art is often created to convey some important spiritual truth to the religious. Art can take any form that helps to convey the meaning or concept most faithfully. What makes someone an artist? Conventional wisdom suggests that an artist is someone who makes art. It shouldn't matter whether you're an amateur or a professional, whether you've received formal training or are self-taught, whether you make work to exhibit or just for yourself. If you make art you're an artist. Of course there are some artists, like performance artist Tehching Hsieh, who don't make art.   Can an artist who doesn't make art still be considered an artist? I think the answer is that being an artist, like making art, is about the intention. If you consider yourself an artist then you are an artist. Back to Beuys So to clarify Joseph Beuys' original statement, I would rephrase it like this: \"Anything can be art and anyone can be an artist.\" ",
            "date": "Answered February 28, 2015",
            "views": "77",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Deckers",
                    "user_href": "/profile/Peter-Deckers-1"
                },
                {
                    "user_id": "James Dees",
                    "user_href": "/profile/James-Dees-6"
                },
                {
                    "user_id": "Douglas Gates",
                    "user_href": "/profile/Douglas-Gates-2"
                },
                {
                    "user_id": "Enrico Von Thompsy",
                    "user_href": "/profile/Enrico-Von-Thompsy"
                },
                {
                    "user_id": "Richard Grant",
                    "user_href": "/profile/Richard-Grant-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kyle Varley",
                "href": "/profile/John-Kyle-Varley"
            },
            "answer_text": "I think the level of your question is important. You didn’t ask about painting or music. You asked about art. I’ve struggled with this question for most of my adult life, and I think you have to go to the level of philosophy to get an answer that is equally true for “art” generally, not the individual disciplines. Consider the great philosopher of our time Donald Rumsfeld… and his hilariously awkward quote, which is actually a mythological truism.  For almost everything you do, you’re moving things across the border at X. If you decide to learn Russian, you’re aware that there is a language, history, culture, grammar, etc. behind “Russian”. You know that there is a set of structures that you can incorporate into your mind, and then you’ll be a “Russian speaker”. Learning Russian takes self-actualizing, discipline, and focus, but almost everyone would admit that it isn’t art. The best conception of art would be moving things across the border at Y. Artists play around at the edge, and then see what happens. They sit at the border of what they understand that they don’t understand, the place where human ideas run out. Then, they listen to their own bodies and to the world at large. Some of it “feels right” and then they do what they’re told, so to speak. They don’t know who is speaking to them, what they’re doing with the information, or what the result will be. The attempt to bridge that border — the space between the known unknowns and the pure mystery of whatever is outside of the unknown — is art. It is almost always unsuccessful. When artists play at the edge, virtually everything they discover is useless, which really annoys people with a more conservative temperament, because it truly is a waste of time and effort. Some lefty types tend to hang around at the edge too long, or too often, and they lose touch with the structures of the “known” that keep them alive, hence all the struggling, starving, dying artists. However, there is no other method of expanding the human sphere of influence. We had to move from bacteria to Savannah-dwelling apes somehow, and then we had to go from the plains to downtown Shanghai, and there is no other way to do it. If you want to go somewhere you’ve never been before, you have to take a step out into the genuine darkness at some point. Neolithic rock painters didn’t know they were laying down the concepts for tools and fire. Sumerian sculptors and Greek poets didn’t know they were writing the plot-lines for the Avengers movies. Raphael didn’t know he was overthrowing the dominance of the Church in the 18th-19th centuries. Monet didn’t know he was helping design the digital camera. The artists today have no idea what they’re doing, and as contemporaries we will never understand them, but what they do or do not discover will shape what humans study and learn in the future. It’s famously been stated that art is a process, and not a thing. Art is the process of bringing things from the void, into the fog, so that the rest of us may someday bring them into clarity. ",
            "date": "Updated December 9, 2019",
            "views": "23",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Deckers",
                    "user_href": "/profile/Peter-Deckers-1"
                },
                {
                    "user_id": "Hannah E. Christian",
                    "user_href": "/profile/Hannah-E-Christian"
                },
                {
                    "user_id": "Jessica Anna",
                    "user_href": "/profile/Jessica-Anna-22"
                },
                {
                    "user_id": "Erin Potappel",
                    "user_href": "/profile/Erin-Potappel"
                },
                {
                    "user_id": "William Lottering",
                    "user_href": "/profile/William-Lottering"
                },
                {
                    "user_id": "Camille Le Roux",
                    "user_href": "/profile/Camille-Le-Roux"
                },
                {
                    "user_id": "Susan Forrester",
                    "user_href": "/profile/Susan-Forrester-13"
                },
                {
                    "user_id": "YJ Kim",
                    "user_href": "/profile/YJ-Kim-43"
                },
                {
                    "user_id": "Bob Rawn",
                    "user_href": "/profile/Bob-Rawn"
                },
                {
                    "user_id": "Gonçalo Melo",
                    "user_href": "/profile/Gonçalo-Melo-13"
                }
            ]
        }
    ]
}