{
    "title": "What is e-learning and how it is useful in education? - Quora",
    "tags": [
        "Interactive eLearning",
        "Educational Technology",
        "E-learning",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aditya Bose",
                "href": "/profile/Aditya-Bose-1"
            },
            "answer_text": "I see two questions here. Let us answer them one by one. What is e-learning? E-learning is a kind of educational technology which helps us deliver educational content through the internet without making students sit in a physical classroom. It encompasses downloadable e-books, audio content, video content, and structured courses with assignments and assessments. How is it useful in education? It transcends all the geographical barriers. A kid residing in some remote part of a developing country with little to no access to good schooling can now learn from some of the best teachers in the world in their respective subjects, that too for free or at a very low cost. For generations, our society has said to disadvantaged people like them, \"here are some teachers (but not enough) and here is some money (but not enough) and here are our expectations (very low), go do your best.\" Not anymore. Just give them an internet connection and they will be ready to fly.It promotes flexibility in education. One can learn whenever he/she wants, at his/her own pace. You don’t have to follow a time table set by others. Everyone doesn’t have to learn the same thing at the same time. The need of production line model of education is over, and e-learning helps us step out of this production line model still promoted in schooling systems by making education more flexible.Flexibility promotes mastery learning. If you have to teach a certain number of topics in each subject by a stipulated time, which is what happens in the grade system of school, then you are surely not promoting mastery learning. A person with 40% also passes the examination, a person with 98% also does. The person with 40% has 60% of deficiency in that subject, but nothing is done to remove or lower that deficiency. Instead, he/she is promoted to the next grade and given more sophisticated concepts to learn, building on the very same concepts he/she had 60% deficiency in. What do you expect? A building with a weak base will surely topple down. It does. E-learning promotes learning at one’s own pace till the student learns that concept. Maybe some concepts will take significant time. But studies and student data have shown us, time and time again, that students who get stuck on a certain concept and learn it after a long time, are the ones who speed ahead through the next set of concepts. This grit shown by students in learning the concept even though there were difficulties, determines success in life also.Learn from the best. As mentioned in the first point, any student wanting to learn a subject can now learn from the some of the best teachers of that subject in the world. Salman Khan, the founder of Khan Academy once said, “If Isaac Newton had done YouTube videos on Calculus, I wouldn’t have to.” We now have the facility to learn Machine Learning from Andrew Ng and The Lean Canvas from Ash Maurya, the best in these respective subjects. Elon Musk had once said that education is like the movies. If The Dark Knight was not a film and would be reproduced at a local level everywhere, then it would not be even half as good. We now have the facilities to plan and produce the best educational content and even humanise the classroom experience by flipping the classrooms, with the help of this educational content.Access to data helps to improve educational content, learner experience, and assessments. By getting access to real time student data in big volumes, we can not only improve the educational content to aid better learning but also improve the learner experience to gain and maintain learner interest if there is lack of it, and enhance the diagnosis of general problem areas by improving the assessments.Hope this helps. :) ",
            "date": "Answered July 29, 2016",
            "views": "19",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thamarai Selvan",
                    "user_href": "/profile/Thamarai-Selvan-401"
                },
                {
                    "user_id": "Kusum Vashisht",
                    "user_href": "/profile/Kusum-Vashisht-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prachi Haridwaj",
                "href": "/profile/Prachi-Haridwaj"
            },
            "answer_text": "E-learning means learning system that we can obtain through the internet using an electronic device. It is also known as online learning. Online learning is for everyone, it accommodates everyone’s need. Lets have a look at the advantages - Save time and cost -The use of LMS or learning platforms to create, manage, and carry out educational and training programs saves business hours when compared to traditional methods.Lectures Can Be Taken Any Number Of TimesFlexibility - Students have the freedom to set up their careers and school because they are not tied down to a fixed schedule. They can learn from the platform whenever they want.Comforts - Comfort is the big advantage of online education because you don’t need to attend classes for hours, sitting in uncomfortable desks, etc.Multimedia - Online education systems allow businesses and educational institutions to create multimedia learning features that are attractive and practical using video, images, audio and text which all serve as great tools in learning new skills or information.Gain greater access to expertiseHope this answer helps!! ",
            "date": "Answered July 9, 2020",
            "views": "109",
            "upvotes": "0"
        }
    ]
}