{
    "title": "What are some examples of unethical behavior? - Quora",
    "tags": [
        "Unethical Behavior",
        "Behavior",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hugh Curran",
                "href": "/profile/Hugh-Curran-1"
            },
            "answer_text": "Unethical behavior is behavior that is contrary to our own moral principles as well as the principles admired in the community one lives in. Moral principles, such as fairness, honesty, dignity, and concern for individual rights are of profound importance. I would add that compassion for all living beings, (as made explicit in Albert Schweitzer’s phrase: “reverence for all life” as well as similar principles followed by Gandhi and the Buddhist and Jain religions). These place a high moral value on kindness and compassion for all sentient life which is best exhibited by both refraining from causing harm and by not being complicit in causing harm to any and all forms of life. “Ethics’ refers to “ethos” and in its original meaning in the Greek tradition had to do with “character”. To be unethical in one’s behavior means that one is betraying one’s inner character and eventually experiencing a diminished faith in oneself. Unethical behavior can result, in its more extreme form, in self-loathing and self-harming. Business professionals, politicians and military leaders who behave unethically will eventually be caught in their own mistruths. An elderly friend liked to quote Shakespeare’s famous phrase: “oh what a tangled web we weave when first we practice to deceive”. Unethical behavior includes: lying & misleading others, speaking badly of others, abuse of power relationships to advance one’s own agenda or/and to break trust with others, and/or to gain sexual favors. Among business corporations it includes releasing pollutants in water and toxins in the air that will be harmful to the community, installing defective products knowingly, price fixing, not paying adequate wages to employees, etc. etc. As you can see unethical behavior covers a great deal of territory, both in personal terms, as well as in terms of the collective. ",
            "date": "Answered April 4, 2018",
            "views": "118",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jo Cross",
                    "user_href": "/profile/Jo-Cross-23"
                },
                {
                    "user_id": "SHAHZEEN SYED",
                    "user_href": "/profile/SHAHZEEN-SYED"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SHE-183"
                },
                {
                    "user_id": "Sapna Dahiya",
                    "user_href": "/profile/Sapna-Dahiya-8"
                },
                {
                    "user_id": "Reginald Marv",
                    "user_href": "/profile/Reginald-Marv"
                },
                {
                    "user_id": "Mary Lippitt",
                    "user_href": "/profile/Mary-Lippitt"
                },
                {
                    "user_id": "Zanyar Sad",
                    "user_href": "/profile/Zanyar-Sad"
                },
                {
                    "user_id": "Akhilesh Verma",
                    "user_href": "/profile/Akhilesh-Verma-290"
                },
                {
                    "user_id": "Gold Brain",
                    "user_href": "/profile/Gold-Brain-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rebecca Mellander",
                "href": "/profile/Rebecca-Mellander"
            },
            "answer_text": "The short answer is anything that doesn’t pass the smell test (i.e., it stinks). Always doing the right thing, and if there is no right thing, the outcome that brings the most benefit to the greatest number of people. Ethical and legal are different concepts: not all unethical behavior would be illegal, but all unethical behavior is questionable because either it violates a law or the rights of someone or something else, or both. The specific area of medical ethics is a study in itself, and here common sense will not be much of a guide. There are various principles of ethical belief used to determine medical outcomes when determining who gets what level of care. There are a myriad of small decisions in every clinical situation that would call for reliance on medical ethics, but one example of ethics in use is the allocation of scarce medical resources. Fortunately, most medical resources are not scarce and can be accessed by most patients. But some things, like organ transplants, are very scarce and determining how to choose which one of two apparently equally appropriate recipients is a process of applying these principles (assuming the medical criteria are satisfied). This process is complex and thoughtful, but not obvious to a layman. Thus, a younger person may be chosen over an older one (more life to live) or a person with a family might be chosen over a person without a family (more support and more people to benefit). Hospitals usually have an ethics committee to help guide these kinds of decisions. That committee will be composed of healthcare professionals and often clergy, psychologists or sociologists, each of whom brings a particular expertise to the questions being considered. Unfortunately, business curricula are behind the curve in emphasizing ethical conduct to their students. In 1997, I took a course in ethics, but it was part of a science rotation and not required for the School of Business. So this is an area that is ripe for improvement. If one goes into a profession, like accounting, there are opportunities to learn more about ethics (but mostly business law, which is a different thing), but many B-school grads do not have this extra layer of education. Having worked for some 40-odd years in business, I can attest to the fact that there are many out there who do not have a good foundation in understanding moral absolutes. It is often a question of “can I get away with it” instead of “is it right to do this”. It will be up to the current and future generations of leaders to set a better tone and demand better behavior from those who manage businesses, because this is part of the business’s culture and is a top-down behavior model. Otherwise, regulation will ultimately be imposed, bit by bit, to attempt to force uniform compliance. However, morality (and thus ethics) cannot be legislated, especially in an age of moral relativity. We have to generate it on our own — difficult to do when we are more and more unchurched and untaught at home. ",
            "date": "Answered April 12, 2018",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard P. Morrall",
                    "user_href": "/profile/Richard-P-Morrall"
                }
            ]
        }
    ]
}