{
    "title": "What are some of the best technological developments across the world? - Quora",
    "tags": [
        "Technological Development"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandra Carol",
                "href": "/profile/Sandra-Carol-3"
            },
            "answer_text": "Reversing Paralysis - A brain implant is helping a paralyzed monkey walk again Self-Driving Trucks - If automation is already messing with our economy and our politics, just wait until self-driving trucks arrive Paying with Your Face - In China, you can pay for goods just by showing your face Practical Quantum Computers - You might not know what to do with it, but it’s time to save up for a quantum computer The 360-Degree Selfie - What’s causing the sudden boom in 360 videos in your social feeds? Hot Solar Cells - This device could be a big boost for making solar power much cheaper Gene Therapy 2.0 - How did gene therapy go from experimental disasters to wondrous cures? The Cell Atlas - It’s becoming possible to know our own cells in astonishing, unparalleled detail Botnets of Things - Why website takedowns and other Internet mischief are still increasing Reinforcement Learning - https://www.technologyreview.com/s/603501/10-breakthrough-technologies-2017-reinforcement-learning/ ",
            "date": "Answered January 9, 2018",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jadhav Rajanikant",
                    "user_href": "/profile/Jadhav-Rajanikant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Wilsbacher",
                "href": "/profile/Jeff-Wilsbacher"
            },
            "answer_text": "Boy saved with new gentically modified skin: A boy with a rare disease gets new skin, thanks to gene-corrected stem cells New, better than Lithium-Ion battery invented: Lithium-Ion Battery Inventor Introduces Fast-Charging, Noncombustible Batteries Samsung Fab in Pyeongtaek starts production of 64 layer v-NAND:Samsung’s Multi-Billion Fab in Pyeongtaek Starts Production of 64-Layer V-NAND Magic Leap first AR headset: Magic Leap teases first AR headset, Leap One ",
            "date": "Answered January 8, 2018",
            "views": "164",
            "upvotes": "0"
        }
    ]
}