{
    "title": "What lessons from Heidegger's essay 'The Question of Technology' are relevant for today's tech sector? - Quora",
    "tags": [
        "Martin Heidegger (philosopher, author)",
        "Existentialism",
        "Philosophers",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Richards",
                "href": "/profile/Justin-Richards-10"
            },
            "answer_text": "When we consider technology from the perspective of instrumentality, when the thing is merely a means to an end, there reigns the will to mastery. Heidegger instead advocates a responsibility characterized by starting something on its way, which lets the thing come into presence: to bring forth an occasion. In order to bring forth one brings into unconcealment that which is concealed, bringing forth is a revealing. Techne is a mode of revealing that reveals what does not bring itself forth. What are we talking about, what is revealed is the gathering of the fourfold causes. What characterizes modern science and technology is the harnessing of things which do not appear by themselves, but only through instrumentalization. This links together science and technology, because science can only proceed in particle physics to the extent that technology succeeds in making subatomic particles appear. Solar energy is in this respect no different, the ordinary appearance of the sun is discarded for an unordinary technological appearance, the vibrations of photons. Modern technology is an instance of the will to mastery being extended over and into Nature. Modern technology sets itself upon nature, and challenges nature. Nature becomes reduced to instrumentality, to what it can be used for, and this is the origin of enframing which turns every thing into the standing reserve. What is it for, what can it be used towards - the will to mastery reigns over all presencing appearances: the objectivity of the world is discarded for the ordering of material. The problem of technology is that the human who uses technology becomes technologized. The rank order that turns everything into the ready at hand also orders the human being. Heidegger calls this ordering enframing, enframing is the metaphysical position that mediates between the user of modern technology and the world. Not only is the “world” threatened by enframing, but so is a human’s relation to themselves. How is this so? One must remember, for Heidegger, that things take ontic priority to there being any such thing as a World at all. It is only on the stability of things that a world is able to come into being at all. Things are introduced to us through technology, and tools are a great example of things, but the thinging of a tool is not self-sufficient. A tool is made to do something, it is made of durability which becomes exhausted with use, a tool is a useful thing. The standing reserve takes its mode of existing not from tools and the realm of work upon which a world is constructed, but rather from the realm of labor. The standing reserve is deprived of its durability, it becomes something to use-up and to discard, the results of labor are subject to spoiling, and they must be used before they spoil. They are not stable and are not capable of supporting a world. What a tool can do is create things which are not possessed of durability, cannot be used up, and which certainly do not spoil. This kind of thing is stable, yet it requires preservation and care. This kind of thing is made through technology, but it is not itself technological. Of course, we are talking about the kind of thing made through poesis, and this includes the art object as much as a temple, and also, as much as a dwelling place centered around a hearth. These kinds of things certainly do something, but they are not of the order of cause and effect from out of the will to mastery. The temple sets holiness upon the ground, but does not cause the holiness itself, it is already there waiting to be unconcealed. A dwelling place sets locality upon the ground, there is already space, but locality is different from space. Locality can be merely the ordering of space, the enframing of space, but this is not the origin of locality, instead locality originally gathers what is and reveals it as such. Space becomes invested with a dimension of meaning, and in this dimension human beings are able to dwell. Dwelling is not caused by locality any more than locality is caused by building, but building and locality create the opportunity for dwelling. Building is an occasion that sets forth the possibility of dwelling as it creates locality from mere space . Heidegger wants us to see that technology creates not only from a sense of “in order to to”, but also from a sense of “from out of”. This creating from out of opens up possibilities which are neither intended nor caused by the act of creation, and, from the perspective of the thinking ego - as opposed to the will to mastery or the willing ego - is the horizon of freedom. Freedom for the will lies in an attitude and comportment towards the future and its predictability. Freedom for thinking instead creates an event, a beginning, but does not determine what it has begun. Rather it allows the world to gather itself in the event of its own revealing. Just like a visual artist and a poet gather meaning into a work of art without fully determining the meaning that it has upon a viewer, every act of poesis gathers without fully determining. Stand before a painting of Van Gogh and the work of the work of art is to presence the World. Holderlin’s poems are not simply about rivers, for instance, but about how rivers create the possibility of human dwelling along the banks, the river makes arable the land, building turns the river bank into a location, location allows dwelling. Dwelling turns the land into something more than mere earth, it established a world. The world is gathered into Being by such things, but this gathering was originally an event of the realm of freedom. The question then for those in the tech sector, and the problem concerning technology, is then how does one ensure that one is creating without determining? How does one let the world presence itself through modern technology, rather than determining how and for what it appears? The problem for most human beings concerns how to authentically appropriate technology such that it does not extend its technologization into areas that dehumanize: not all technologization is necessarily bad, a hammer and a pencil both technologize the user every bit as much as a computer keyboard does. A hammer extends the authentic action of human swinging and grasping, while a nail gun harnesses the same phenomenon but more forcefully pulls the user into a specific mode of interaction. A pencil forces one to engage in a certain type of grasping that we must learn, just like we have to learn to tap the keys in a keyboard, but the pencil imitates the fluidity of spoken language more than the seemingly random tap tap tapping away at keys. It is no accident that we think a million monkeys with typewriters would eventually “write” Shakespeare by accident, but make no similar expectation in regards to a million monkeys with pencils. At bottom, we hold a pencil in a specific meaningful relationship to human being that does not endure in the keyboard or typewriter. We become accustomed to the typo, and the typo determines our relationship to the keyboard such that we imagine a million typos by non-human animals could create something as meaningful as the greatest achievements of the pencil. Could we create technology, and or interfaces with such technology that undo this kind of enframing that the typo has created? ",
            "date": "Answered April 4, 2017",
            "views": "62",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Princes Flores",
                    "user_href": "/profile/Princes-Flores-1"
                },
                {
                    "user_id": "Joe",
                    "user_href": "/profile/Joe-3585"
                },
                {
                    "user_id": "Jay Salinas",
                    "user_href": "/profile/Jay-Salinas-11"
                },
                {
                    "user_id": "Limar Gomia",
                    "user_href": "/profile/Limar-Gomia"
                },
                {
                    "user_id": "Darren Gillies",
                    "user_href": "/profile/Darren-Gillies"
                },
                {
                    "user_id": "Tano B. Ramoya",
                    "user_href": "/profile/Tano-B-Ramoya"
                },
                {
                    "user_id": "John Brady",
                    "user_href": "/profile/John-Brady-14"
                },
                {
                    "user_id": "Craig Warren Smith",
                    "user_href": "/profile/Craig-Warren-Smith"
                },
                {
                    "user_id": "Desmond James",
                    "user_href": "/profile/Desmond-James-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cheng Wen",
                "href": "/profile/Cheng-Wen-17"
            },
            "answer_text": "Thanks for the request. I’m not very familiar with today’s tech sector and its current state of development, but if you’re talking about technology alone, I can say something relevant about AI and virtual reality. The main takeaway from that rather short essay of Heidegger is the concept of enframing. Remember that Heidegger went through World War 2 and saw the devastation that warfare technology brought about first hand. Naturally, he sort of confounded science and technology, and saw both of them as orientating our thoughts about the natural world as resources to exploit, instead of a poetic appreciation of nature that he advocates. He was greatly concerned about how science and technology made us look at nature as present-to-hand, thus unable to perceive nature in its pure being. But I think Heidegger’s enframing can be expanded to include other aspects of life other than nature. With regards to virtual reality (VR), we can imagine some undesired consequences of the prevalence of VR technology. I can imagine some extreme cases that Heidegger might brood over if he was alive. For instance, we might begin to think about how our environment can be constructed to be more accommodative for VR engagement, or how elements of nature can be used to enhance VR experience, etc. Heidegger would probably sound like that one of those old men who romantise about purity of experience and how VR pretends to be real. Under such a scenario, the external world is seen as something to give inspiration for VR environments. Regarding AI, I can see Heidegger being one of the most staunch advocates of making the technology viable for the public. AI is built on the intent to emulate human behaviour and cognition. Although I don’t think we’ll ever create a proper AI as we envision any time soon, we can imagine the vast possibilities that the creation of AI can take in the future. While building an AI won’t enframe nature in the way that Heidegger protests, the functions of AI can exacerbate this enframing. Suppose that the AI can give us solutions to resource problems. This kind of AI will likely not attach any value to resources of any kind, and thus will completely instrumentalise nature in its algorithm. Heidegger’s proposed solution is to engage frequently in poiesis, namely, using art as an alternative to enframing by taking the world as it is. Sadly, I don’t think this proposal is ever going to come to fruition, especially when nowadays even movements encouraging art appreciation enframe art as “something to be appreciated”, thus somewhat emptying the value of art appreciation itself. And not to mention, our society is increasingly reliant on technology. It’s not a bad thing — but for Heidegger’s proposal to ever have a chance to work out, we might need to bring our cultural development back to the Greek days, where art is seen as a unifying force of the social, political and religious. ",
            "date": "Answered March 29, 2017",
            "views": "31",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anthony Chang",
                    "user_href": "/profile/Anthony-Chang"
                },
                {
                    "user_id": "Valerie Yip",
                    "user_href": "/profile/Valerie-Yip-5"
                },
                {
                    "user_id": "Desmond James",
                    "user_href": "/profile/Desmond-James-7"
                },
                {
                    "user_id": "Tano B. Ramoya",
                    "user_href": "/profile/Tano-B-Ramoya"
                },
                {
                    "user_id": "Caleb Beers",
                    "user_href": "/profile/Caleb-Beers-1"
                },
                {
                    "user_id": "Michael Masiello",
                    "user_href": "/profile/Michael-Masiello-1"
                }
            ]
        }
    ]
}