{
    "title": "What are the possible technologies that might be invented by 2022? - Quora",
    "tags": [
        "Innovation",
        "Invention and Inventions",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sakibul Hasan",
                "href": "/profile/Sakibul-Hasan-13"
            },
            "answer_text": "Which Technologies Will Dominate in 2022?   PREDICTING THE FUTURE is hard and risky. But predicting the future in the computer industry is even harder and riskier due to dramatic changes in technology and limitless challenges to innovation. At the beginning of my term as 2014 president of IEEE Computer Society, with help from more than a dozen technology leaders, we set out to survey 23 potential technologies that could change the landscape of computer science and industry by the year 2022. With the IEEE CS 2022 Report, we created a comprehensive document that outlines future disruptive technologies, helps scientists and researchers understand the impact of technologies in the future, and provides the general public with an idea of how technology is evolving, along with its implications for society. At the foundation of the report is our understanding that by 2022, we will be well into a phase where intelligence becomes seamless and ubiquitous to those who can afford and use state-of-the-art information technology. At the heart of the “seamless intelligence” revolution is seamless networking, where the transition from one network device to another is transparent and uninterrupted. To achieve seamlessness and realize logical end-to-end connectivity, we’ll need communications to run independently on top of any form of physical networking, regardless of device or location. Through virtualized end-to-end connectivity, total integration of all the ecosystem devices that cater to our specific needs can be achieved. This new world will require sophisticated intelligent coordination software; voice, image, and motion recognition will transform human-computer interfaces into a seamless interaction between the user and all the computing devices in that person’s life. The report represents insights from a strong community of technology leaders from around the world. Hasan Alkhatib of SSN Services LLC; Paolo Faraboschi of HP Labs, Spain; Eitan Frachtenberg of Facebook; Hironori Kasahara of Waseda University; Danny Lange of Microsoft; Phil Laplante of Pennsylvania State University; Arif Merchant of Google; Karsten Schwan of Georgia Tech; and myself conceived the report and wrote many sections. Mohammed AlQuraishi of Harvard Medical School; Angela Burgess of IEEE Computer Society; David Forsyth of Cornell University; Hiroyasu Iwata of Waseda University; Rick McGeer of Communications and Design Group, SAP America; and John Walz, formerly of Lucent/AT&T, all contributed some of the individual sections. In the future that we envision, multicore will allow us to recharge our smartphones just once a month. The Internet of Things will let us dress in clothes that monitor all our activities. Nanotechnology will enable lives to be saved by digestible cameras and machines made from particles 50,000 times as small as a human hair. And amid the exponential growth of large data repositories will be increasing concerns about balancing convenience and privacy. The potential for quantum computing is staggering since it’s constrained only by the laws of physics. Universal memory replacements for DRAM will cause a tectonic shift in architectures and software. 3D printing will create a revolution in fabrication, with many opportunities to produce designs that would have been prohibitively expensive. We predict that machine learning will play an increasingly important role in our lives, whether by ranking search results, recommending products, or building better models of the environment. And medical robotics will lead to many lifesaving innovations, from autonomous delivery of hospital supplies to telemedicine and advanced prostheses. With energy consumption increasing along with the world’s population, electric cars, LEDs, smart grids, smart cities, dark silicon, new battery technology, and new ways of cooling data centers are some areas where advances in sustainability are expected. Silicon photonics will address bandwidth, latency, and energy challenges, and developments at all levels of the network stack will continue to drive research and the Internet economy. In the area of software-defined networks, OpenFlow and SDN will make networks more secure, transparent, flexible, and functional. Read the report here and share your thoughts: Which technologies do you think will dominate in 2022? Dejan Milojicic is President of the IEEE Computer Society, and founding Editor-in-Chief of IEEE ComputingNow. ",
            "date": "Answered September 15, 2017",
            "views": "892",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alden Grover",
                    "user_href": "/profile/Alden-Grover"
                },
                {
                    "user_id": "Gísli Magnússon",
                    "user_href": "/profile/Gísli-Magnússon-2"
                },
                {
                    "user_id": "Hunter Chrisman",
                    "user_href": "/profile/Hunter-Chrisman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "We are at the beginning of the Fourth Industrial Revolution (4IR)  But this one is different With steam power, Electricity, and Computers, each development opened up a new level of applications, but to some extent mainly improved on what already existedWe can actually pinpoint the pioneers of steam power, electricity, and computers, and trace the paths of these ideas from concept to application It is true one could use coal/oil/nuclear power to produce steam power, to produce electricity, to produce and operate computers, but it is a linear process, in that one cannot directly produce a steam operated computer Steam, Electricity, and Computers are ‘Enabling’ utilities. You need an infrastructure in place to use them Once the infrastructure is in place, then the next level is ‘Convergence’ When Steam trains are operating, they can be upgraded to Electric trains, which in turn can be upgraded to Computer controlled electric trains The 4IR is about convergenceWhen you have electricity in your homeyou can have a computerized Smart homeIf you have a carYou can have a computerized Smart car These converge to having a Smart home with solar panel roofto run your home and carYou can also have a solar powered car to run your homeYou can converge these to have a combined home and car, and office if need be Millionaire Creates Uber High Tech RV Camper for His Four-Year-Old Daughter  This is what can be done nowBut the question is ‘Technology five years from now’ Taking the above vehicle as a starting point In five years such vehicles will be electric and self-drivingThey will be made from materials such as graphene that will never deteriorateIt will have puncture proof tiresIt will be a node on a global gridIt will have drones that can fetch and take as requiredIt will be fitted with advanced self-diagnosticsIt will have AI to keep you fully informed on all your interestsThey will have extendable accommodationThere will be an infrastructure to accommodate such vehiclesThe point of this comment is not to repeat what is already known other than say the day of the lone pioneer is overWhat is happening with vehicles is happening with most things to the point where decision making will be a matter of probability rather than vested interests Perhaps the biggest impact of technology is that it will have advanced far enough in five years to show that politicians will be replaced by technocrats, and Democracy as we now know, will be breathing it’s last gasp ",
            "date": "Answered August 31, 2017",
            "views": "246",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohd Zulakmal",
                    "user_href": "/profile/Mohd-Zulakmal-1"
                },
                {
                    "user_id": "Zee Shan Khan",
                    "user_href": "/profile/Zee-Shan-Khan-4"
                },
                {
                    "user_id": "Alon Poleg-Polsky",
                    "user_href": "/profile/Alon-Poleg-Polsky-1"
                },
                {
                    "user_id": "Thomas Knowles",
                    "user_href": "/profile/Thomas-Knowles-6"
                },
                {
                    "user_id": "Noah Löfquist",
                    "user_href": "/profile/Noah-Löfquist"
                },
                {
                    "user_id": "Ric Pounds",
                    "user_href": "/profile/Ric-Pounds"
                },
                {
                    "user_id": "Adam S",
                    "user_href": "/profile/Adam-S-13"
                },
                {
                    "user_id": "Charles-André Guénette",
                    "user_href": "/profile/Charles-André-Guénette"
                },
                {
                    "user_id": "Dmitriy Sintsov",
                    "user_href": "/profile/Dmitriy-Sintsov"
                },
                {
                    "user_id": "Allan Ayamah",
                    "user_href": "/profile/Allan-Ayamah"
                }
            ]
        }
    ]
}