{
    "title": "What are some concerns with genetically modified organisms and food? If GMO food has the potential to dramatically increase our food production, why is it so bad? - Quora",
    "tags": [
        "Genetically Modified Foods",
        "Genetically Modified Organisms (GMO)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julian Miller",
                "href": "/profile/Julian-Miller"
            },
            "answer_text": "At first look GM foods have great promise but unfortunately there are huge flaws in the science. I live in Hawaii and so I talk in terms of the situation here. GE plants and animals contaminate the genome of normal plants and animals that we eat. This is shown in the research below and its been documented elsewhere:Wind Transport And Seed SourceThe GMO industry has no reply to this. Another problem with the above contamination issue is that the GE plant companies are building pesticides and/or pharmeceuticals inside GMO corn and other plants. This sounds interesting but the problem is GMO corn cross pollinates with regular corn growing miles away. So the regular corn is a mix of the GMO and regular corn. Do you want to accidentally eat corn or any other food with built in pharmeceuticals or pesticides? This contamination cannot be retrieved. Here is an example of this outdoors contamination. Human genes engineered into experimental GMO rice being grown in Kansas Just like industries that threw their waste in rivers these GE plants and animals are contaminating regular plants and animals. Instead of invasive species this time its invasive genes and these invasive genes are much more insidious. The release of GE plants and/or animals should be banned for outdoor release. I am all for science but what they are doing is not scientific. Unfortunately GE foods at this time are too little science, a tiny bit of technical knowledge, and a lot of profit motive. These companies oppose labeling but fight to patent these genetic food experiments they create. How is it that in the former case they make a change in corn and can patent it by saying its different from regular corn but in the latter case when the people want labeling of GE foods then the GE companies  oppose labeling by claiming that their GE corn is not different from regular corn. That doesn't make logical sense, GE companies are saying gmo corn is different enough to patent and yet not different enough to label, they can't have it both ways? And yet they do because they are using vast amounts of money on the legal and political system to get their way. Why is it the GE companies claim that these GMO crops will require less pesticides and herbicides but the use of pesticides and herbicides each year climbs higher and higher?Nearly Half of All US Farms Now Have Superweeds I could go on but I oppose anything that helps these companies pour more pesticide, herbicides, experimental plants and animals on the islands. Now, in Hawaii these GE companies are pushing thru bills that would eliminate any libility for mistakes they make in development of ge foods and animals, use of pesticides and herbicides. Why on earth would anyone trust these GE companies with experimenting on foods, with no policing, no need to research, no transparency, no oversight, no idea what they are spraying, no labeling and they can just let their creations fly off anywhere and cross pollinate with anything. Plus, because the wind blows, Monsanto actually sues people who are found to have Monsanto pantented corn growing on their property thru this contamination drift. Indiana soybean farmer sees Monsanto lawsuit reach US supreme courtMy feeling is the famers should be suing Monsanto for the contamination of their fields. We should be suing Monsanto, DOW and Syngenta for contaminating our food supply. The famous geneticist Dr. David Suzuki spells it out:The trouble with Monsanto and GMOs -- Dr. David Suzuki spells it outAnother scientist describes the 7 problems with GMO science:The pro-GM lobby's seven sins against scienceThis is why many call GE science the same as tobacco company science. The profit motive caused tobacco companies to claim cigarettes did not cause cancer even though they knew it did. The profit motive of the GE companies is bending research:Do Seed Companies Control GM Crop Research?The above link in Scientific American has this to say. \"Unfortunately, it is impossible to verify that genetically modified crops perform as advertised. That is because agritech companies have given themselves veto power over the work of independent researchers.…Under the threat of litigation, scientists cannot test a seed to explore the different conditions under which it thrives or fails. …And perhaps most important, they cannot examine whether the genetically modified crops lead to unintended environmental side effects.Research on genetically modified seeds is still published, of course. But only studies that the seed companies have approved ever see the light of a peer-reviewed journal.…when scientists are prevented from examining the raw ingredients in our nation’s food supply or from testing the plant material that covers a large portion of the country’s agricultural land, the restrictions on free inquiry become dangerous.\" Once you let the GE foods out of the lab its a Pandora's box. It starts to alter the plant world that has existed for thousands of years. Don't let this happen in your state. Don't be one of those that let it happen. Many small bills pushed by the GE companies erode our rights. Lets not turn our country into a place where people need hazmat suits to work in their gardens. Lets make sure less pesticides and herbicides each year get to our rivers, lakes, reefs and fish. Lets not pollute the genome of the plants here with pesticides and pharmaceuticals that we eat and enjoy. Lets grow better plants each year based on a real understanding of genetics and ecology not by tinkering.  I hope all politicians, Democrats and Republicans, will see that anything GE is a mistake at this time and oppose it fully and completely in every form it may take. Only recently that junk DNA was discovered to be not junk at all. Breakthrough study overturns theory of 'junk DNA' in genomePerhaps in 10 or 20 years the understanding will be mature enough to not make mistakes but presently the science of GE foods is badly flawed and releasing plant and animal experiments in the wild is bad science. PS A couple more papers about GE foods and the damage they cause to the environment and people:http://www.testbiotech.de/sites/... Regulators Discover a Hidden Viral Gene in Commercial GMO Crops A survey of drug resistance bla genes or... [Environ Sci Technol. 2012] This is a good overview of the myths about GMO's by 3 scientists:http://is.gd/mWZwHI ",
            "date": "Answered February 12, 2013",
            "views": "419",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matan Shelomi",
                "href": "/profile/Matan-Shelomi"
            },
            "answer_text": "Most science-based anti-GMO claims are based on potential threat. That maybe the GMO food will be bad for people, maybe it will be bad for the environment, etc. While potentials always exist,  assuming all GMO's will be dangerous has no basis in scientific fact.  The technology of GMO is perfectly safe, and all GMO crops produced so  far are safe for human consumption and have no negative effects. Claims  of allergenicty or human disease caused by living near GMO crops have all  been disproven. Of course, it is possible to create a GMO food that is  hazardous to human health… and testing by food regulatory industries  will quickly show this to be the case and that product will never be  sold. Scientists agree that any genetically modified products  should be tested individually, on their own merits. Saying all GMO's are  bad because one type can cause allergies is like saying all fruits and  vegetables are bad because some cause allergies, or all cars are bad  because one make and model was faulty. It doesn't make sense. Blanket  bans or labeling of GMO products thus are not supported by food  scientists and biologists. However, the social-science arguments against GMO's are less easily  disproven. There is concern over how the companies that make GMO crops  handle their products and patents, how the crops will affect poor  farmers, etc. Currently (2013), over 75% of all GMO farmers in the world  are small farmers in developing countries, so the claim that GMO is bad  for the poor has been disproven. The claims that GMO's will fight  poverty and hunger, however, haven't been supported either, because so  far the GMO crops are designed for Western markets. We have corn and soy  that require less labor to grow and carnations that are blue, but what  the developing world needs is crops like sorghum and millet that are  drought resistant, for example. Some people worry that using GMO's will  reduce the biodiversity of our agriculture, which is a legitimate  concern, but it is debatable whether biodiversity will be as helpful as  GMO crops in reducing hunger, etc. Some people disagree over the  environmental cost or benefit of GMO's. For example, herbicide-resistant  plants lead to more herbicide usage, which is bad for the environment.  On the other hand, insect-resistant plants lead to less insecticide,  which is great for the environment. Again, being blindly anti-GMO is  illogical. One must study each gene and each crop individually, which  takes a lot of time and effort. Other concerns are humanities ones. Some say GMO tech is playing God,  and reject GMO's on religious grounds. Others say the food is more  \"fake,\" even though humans have been manipulating the genetics of our  food for millennia. Some reject GMO's because they are anti-technology  or pro-organic food, even though feeding 7 billion people on organic  crops only is impossible.  Ultimately a big problem with the anti-GMO movement is that it is  largely among wealthy or otherwise food-secure people, like Europeans  who have plenty of access to lots of healthy food. Here is the key  point: Most anti-GMO activists don't stand to benefit from GMO crops, and can afford to be anti-GMO. It's easy to say \"why eat GMO rice with extra vitamin A when you can eat  kale and sweet potatoes that naturally have vitamin A?\" if you are a  wealthy Westerner, but much of the world can't afford those crops, nor are they available all  year round. The science is irrelevant to these activists, and their activism is  unethical because they are making descisons for people with no access to  supermarkets or organic food Co-ops based on their own biases. The  people who stand to benefit from GMO crops are those who support their  use… unfortunately much of the developing world trades to Europe, and  their governments are enacting anti-GMO laws not due to science, but out  of economic concerns that Europeans will boycott their goods. The GMO  issue is complex and has many factors, and the economic and social science ones are more important. From a biological standpoint, however, the conclusion is clear. There is nothing inherently dangerous with eating a genetically modified plant relative to a conventional plant. Each trait must be analyzed alone, and the regulation on GMO's is so  intense in nations like the USA that GMO crops will arguably be safer  than conventional products or organics.  For some eye opening and unbiased references: Comstock, G., Ethics and Genetically Modified Foods. 2010: p. 49-66.Paarlberg, R., GMO foods and crops: Africa's choice. N Biotechnol, 2010. 27(5): p. 609-13.Qaim, M., The Economics of Genetically Modified Crops. Annual Review of Resource Economics, 2009. 1(1): p. 665-694.Stone, G.D., The Anthropology of Genetically Modified Crops. Annual Review of Anthropology, 2010. 39(1): p. 381-400. Disclosure: I do not work for any biotech or food companies, I am not  paid by any biotech or food companies, etc. I am a rational scientist  who looks at the facts from scientific literature, not from biased  sources of any kind. I am also, conveniently, currently working on a  debate on GMO's to be held at the Entomological Society of America 2013  meeting, where my team has been assigned to be anti-GMO, so I've read the literature from both sides and make my decisions accordingly. [Edit: We won the debates.] ",
            "date": "Updated August 16, 2014",
            "views": "167",
            "upvotes": " View 163 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Deitsch",
                    "user_href": "/profile/David-Deitsch"
                },
                {
                    "user_id": "Jim Crandall",
                    "user_href": "/profile/Jim-Crandall-10"
                },
                {
                    "user_id": "Sam Ruiz",
                    "user_href": "/profile/Sam-Ruiz-39"
                },
                {
                    "user_id": "Don Heller",
                    "user_href": "/profile/Don-Heller-1"
                },
                {
                    "user_id": "Sucitto Teh",
                    "user_href": "/profile/Sucitto-Teh"
                },
                {
                    "user_id": "Haekal Passivista",
                    "user_href": "/profile/Haekal-Passivista"
                },
                {
                    "user_id": "Tishant Doorgapersand",
                    "user_href": "/profile/Tishant-Doorgapersand"
                },
                {
                    "user_id": "Allen Inks",
                    "user_href": "/profile/Allen-Inks"
                },
                {
                    "user_id": "Paul Smith",
                    "user_href": "/profile/Paul-Smith-252"
                },
                {
                    "user_id": "Ryan Foster",
                    "user_href": "/profile/Ryan-Foster-124"
                }
            ]
        }
    ]
}