{
    "title": "What technology was used to build the great pyramids of Egypt? What purpose were they used for? - Quora",
    "tags": [
        "Ancient Technology",
        "Great Pyramid of Giza",
        "Pyramids of Egypt",
        "Pyramids (building structure)",
        "Archaeology",
        "Ancient Egypt",
        "Egypt",
        "Ancient History",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Barriere",
                "href": "/profile/Mike-Barriere"
            },
            "answer_text": "The ancient Pyramids of Egypt may or may not have been built by the people who claim credit. Numerous inscriptions outside of Egypt, in Sudan, Libya and Ethiopia describe the discovery of these monuments covered in sand. Very few of the truly ancient pyramids have any writing on them whatsoever. The only ones that do are dated to the fifth dynasty period. These are tombs and they contain detailed accounts of the early predynastic period. These inscriptions serve as the obvious basis for all knowledge of Hieroglyphic writing, used by the Priests thereafter. This initial discontinuity plays havoc later. The records kept by later scribes deviate considerably from the Pyramid texts at Saqqara, and other locations. The Ethiopians have the most complete and accurate record of the timeline of events. By their admission the Hebrew Slaves found the Pyramids based on divination and recension of Prophetic verses and sacred hymns. This flies in the face of what we are told by conventional Egyptologists such as Zahi Hawass, the self appointed master of Ancient Egypt. This man is a dangerous pawn in a plot for world domination. The Islamic Brotherhood will murder anyone who exposes the facts of humanity’s antiquity. The Islamic, Catholics, and Hebrew orthodoxy can only agree on two points: the first is that they are all related, and the second is their biblical timeline and the current year 5780 as absolute. All three Abrahamic religions pay favor to this concept of the AM (Anno Mundi) calendar dating system. Under this devised concept the current year is 5780, and calendars of Ninevah and Babylon are disregarded. Under this construct of the events of 3760 BC are set as the date of the creation of the Earth, and birth of Adam. Maybe you can see where I am going with this. Recent excavations in Syria uncovered mass graves around Tell Brak which were dated close to ca. 3800 to 3600 BC. These were unearthed, and analyzed to suggest advanced warfare around this period. So we know conclusively that the world did not begin with the Rise of Sumeria and Kemet (Egypt) in 3760, but rather witnessed the collapse of the old world. I hypothesize that this is the exact year the Nile River was deliberately dammed at the %th cataract near modern day Al-Dabbah and Al-Goled. Prior to this point the Nile was split here and only about a third of the water continued down to meet the Mediterranean Sea. After this redirection of the River North the primary outflow to Lake Chad was cut off. This is a problem because the lake Chad basin of today is dry sea, and a sandy wasteland. This entire inland water feature was fed by the Waters of the Nile river, and created a tropical inland sea with high humidity and relatively high annual rainfall. It is well documented the Pyramids are massively eroded by action of flowing water. Some of them appear to have been fully submerged, while the Sphinx is definitely a fountain of some sort. It is clear that these stones were carved by some predecessor civilization, and not by Nomads with Copper Chisels. ",
            "date": "Answered October 22, 2020",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Gleeson",
                "href": "/profile/William-Gleeson-2"
            },
            "answer_text": "Whole books have been written on each of these topics. Opinion is divided between unbelievable orthodox theories versus incredible unorthodox theories. You need to distinguish between the early true pyramids of the Pyramid Age of the Old Kingdom [which were not tombs] …versus the little later copies in the Middle Kingdom, some of which may have been used as tombs. Regarding the true pyramids of the Old Kingdom; According to orthodox professional Egyptologists they were built by peasant farm labourers in their spare time using stone hammers, copper chisels and wooden mallets. As to the purpose… the Egyptian funerary texts say that Osiris [or Horus] was placed in a chamber within the pyramid … not as a burial or interment ‘tomb’ in the modern sense … but as a place of resurrection and ascension into light. Eminent contemporary Egyptologist, M Lehner, has described how Egyptians believed that the pyramid was a ‘cosmic engine’ which enabled the transformation of Osiris into a ‘being of light’. [1] The Egyptian funerary texts describe the pyramid chamber as ‘The Cooking Pot’ or ‘Island of Fire’ within the pyramid designated as the Great Mansion of Osiris; the House of the Double Lion [2 sphinxes]; the Mansion of Fire; the Mansion of Sunrise … and many other similar epithets …from which Osiris came forth as as a blazing radiant light reaching to the ends of the earth and the sky. I am he who made his seat in On, within the shining Mansion of Sunrise. I am he who rises, he of the pyramidion. [Coffin texts, Spell 422] Those who wish for references should read the whole of the Pyramid Texts and the Coffin Texts. [1] Lehner. M (1997). The Complete Pyramids, 20. (Thames & Hudson, London, 1997) ",
            "date": "Answered October 25, 2020",
            "views": "94",
            "upvotes": " Answer requested by Joseph Mendez"
        }
    ]
}