{
    "title": "What are some interesting geology research topics? - Quora",
    "tags": [
        "Research Topics",
        "Earth Science",
        "Geology",
        "Academic Papers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelly Kochanski",
                "href": "/profile/Kelly-Kochanski"
            },
            "answer_text": "I love Earth Science. It’s full of big, unanswered questions. These questions pop up everywhere. They wave at me in class, or sneak onto my Google Maps view. They jump me when I’m on vacation. Here are four questions that have been stuck in my mind for the last few weeks. They draw on paleoclimate, sedimentology, geomorphology, glaciology, paleontology and geophysics. Some of them are worth a lifetime of work. All of them could fill an excellent literature review or class presentation. At time of posting, I am confident that all of them are open research questions. If anyone starts working on these - or finds excellent information that I’ve missed - then I would love to know about it.   The figure above is a map of snowball Earth. That’s a lot of ice - brrrr! The Earth has snowballed - gone into an ice age so major that glaciers reached the equator - at least twice. One of those glaciations, the Sturtian, lasted for fifty-seven million years. The other, the Marinoan, lasted less than a third as long. What makes a snowball Earth stop snowballing? Why did one snowball last so much longer than the other? (Inspired by a talk by Francis Macdonald)   This is the Continental Divide, in Colorado, seen as a green line Google Earth. It looks like it’s been bitten. It looks like the east (right) side has been marked by a series of teeth. The west side of the ridge is smooth. The east side is made of steep valleys, dotted with lakes. Each of these eastern valleys was once carved by a glacier. Why is the Continental Divide asymmetric? (Inspired by conversation with Robert Anderson)   This cave - in the Valle de la Luna in the Atacama Desert in Chile - is not carved into rock. It’s carved in solid salt. The channel above has not eroded, but dissolved. How do meanders form in salt? (Photo and inspiration from a personal vacation) (The closest work I’ve found is Karlstrom’s paper on meander formation in ice)   When this timescale is black - like it is right now, at 0Ma or 0 million years - your compass points towards the north pole. When this timescale is white - like it is at 25Ma, or 25 million years ago - your compass would have pointed towards the south pole. This is called “geomagnetic polarity”. It reverses every few hundred thousand years - except back in the Creaceous (85–115Ma), when it didn’t reverse at all. See “When the Compass Stopped Reversing Its Poles”. What controls the time between geomagnetic polarity reversals? Lots of modern animals - homing pigeons and molluscs and mole rats and possibly even humans - are sensitive to the magnetic field, and use it to navigate. When the magnetic field changes polarity, what happens to magenetosensitive animals? ",
            "date": "Answered March 5, 2017",
            "views": "116",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shailajha Natarajan",
                    "user_href": "/profile/Shailajha-Natarajan"
                },
                {
                    "user_id": "Michael Douglas",
                    "user_href": "/profile/Michael-Douglas-336"
                },
                {
                    "user_id": "Pratibha Chauhan",
                    "user_href": "/profile/Pratibha-Chauhan-12"
                },
                {
                    "user_id": "Aliff Amierul Rusli",
                    "user_href": "/profile/Aliff-Amierul-Rusli-1"
                },
                {
                    "user_id": "Zain Ateeq",
                    "user_href": "/profile/Zain-Ateeq-1"
                },
                {
                    "user_id": "Abhinav Banait",
                    "user_href": "/profile/Abhinav-Banait"
                },
                {
                    "user_id": "Habibat Idris",
                    "user_href": "/profile/Habibat-Idris-2"
                },
                {
                    "user_id": "Anurag A. Upadhyay",
                    "user_href": "/profile/Anurag-A-Upadhyay"
                },
                {
                    "user_id": "Erik Weisheit",
                    "user_href": "/profile/Erik-Weisheit"
                },
                {
                    "user_id": "Bhavana Dahiya",
                    "user_href": "/profile/Bhavana-Dahiya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hisey Patton",
                "href": "/profile/Hisey-Patton"
            },
            "answer_text": "That is a very big question. As a former geology instructor, I find people relate more to science when it has a personal impact. So for instance, if you live on the coast of California, you could do it on beach erosion. If you live up in Northern California you could do it on the volcanoes of the region why they formed (plate tectonics) and their recent history. The same could be said for other regions, which all have their own geology. People find geological hazards interesting. So you could do something on that as regards to the local region. More timely, are topics like fracking and horizontal drilling. No not a condemnation of it but a paper on how it is done and its virtual zero impact on water aquifers and on the causation of earth quakes. I say this because if you actually know the depths and how the techniques are carried out, you will understand that it is nearly impossible for them to cause all the things the fear mongers claim they do. A paper on the history of post and interglacial sea level change would be good, as it will expose the fear mongering on that too. We still happen to be in a glacial period, since we still have massive glaciers. Sea level may rise sometime in the future to past heights which were close to 200 feet higher, but that won’t be for thousands of years, and its just as likely that the climate will take a temperature plunge as it will get a lot hotter. The paper at the link below would be a good place to start. The Great Climate Flip-flop Hope this gives you some starting places and ideas. Here is some support for my assertion that Anti-Frackers are fear mongers. In Wyoming, ground water contamination supposedly caused by Fracking was actually cause in part by the EPA installing ground water monitoring wells to study the problem. Whenever you have chemicals that can melt plastics, you install stainless steel. I know, I used to install monitoring wells. Well the EPA put wells of PVC plastic in where SS was warranted and surprise the well casing melted actually adding chemicals to the ground water. Now in all fairness, subcontractors do the work, and people like myself are hired to oversee the work and certify that it is done correctly. The EPA oversees contractors THEY hire. So in this case you had idiots overseeing low bidders and the EPA idiots apparently did no know their own regulations. The Wyoming Department of Environmental Quality did a study and found that the EPA was at fault, and that the Fracking company WAS NOT. Recall last year in Colorado, the EPA had a subcontractor open an old mine with nearly 100 feet of hydraulic head and thousands of gallons of acid mine fluids causing a massive release into a river in S. Colorado that contaminated rivers down in N. Mexico for hundreds of miles. Were they held responsible? No. The EPA has become a political instrument, not an agency looking out for you or me. I worked with them in the 1990’s and they have become a repository for environmental zealots that want to save the world and they go about tiltiing at windmills costing thousands of jobs and hundreds of millions of dollars to no great affect. In my career I have helped close refineries that could no longer operate within EPA regulations, and we boxed them up and the Chinese bought them lock stock and high carbon footprint to use in China. I had to destroy a wetland in S. Carolina simply because the EPA felt they needed to punish ConocoPhillips because once upon a time they bought property a fertilizer plant was on. They could not prove CP had done anything, but one sample containing high lead(It was in the vicinity of an old Civil war battlefield and could have been caused by one lead bullet in the marsh) was used as grounds to make CP rip up the marsh excavate soil and rebuild the marsh. THAT is the kind of bullshit the EPA oversees. Or the Superfund site in the Tristate Mining district around Joplin Missouri. The pace was mined for lead and zink for nearly 150 years and the ground water ALWAYS had high lead since Galena weathered out in outcrops and was smelted by settlers moving west for bullets. But the EPA insisted that the ground water be cleaned to drinking water standards, something I doubt they were able to achieve after spending millions. I worked the project in its early phases and the area was 27 square miles of land covered with 150 year old mine tailings. The stuff was everywhere. All the beige and white areas in the image below are old tailings, and the bodies of water are open pits with pH of around 2 and are interconnected with the ground water table at several depths. The problem underlies the entire area.  ",
            "date": "Updated November 14, 2016",
            "views": "93",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leslie",
                    "user_href": "/profile/Leslie-7"
                },
                {
                    "user_id": "Sharmin Shahana Badhon",
                    "user_href": "/profile/Sharmin-Shahana-Badhon-1"
                },
                {
                    "user_id": "Denis Oakley",
                    "user_href": "/profile/Denis-Oakley"
                }
            ]
        }
    ]
}