{
    "title": "What is the biggest problem facing renewable energy? - Quora",
    "tags": [
        "Renewable Energy Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Donovan",
                "href": "/profile/Brian-Donovan-13"
            },
            "answer_text": "The fossils and nuclear industries will convince people renewable isn’t ready, they will continue to spend millions, maybe billions on pr and propaganda and buying politicians. The fossils and nuclear industries have gotten long term contracts to sell 100% of their energy for high prices. These contract cause solar and wind to be wasted and fossils fuels burned instead. These are the problems, not the tech. There are NO technical problems going 100% renewable in 15 years or so, faster some places, slower others. The problems are all political and entrenched industry resistance. Solar and wind are now available the cheapest of all energy sources. Solar and wind are 60% or so of all new power installs around the world, 90% in the EU. Big solar and wind project are coming in at under 3 cents per KWH. Solar pv is the fastest to install energy source with a GWp farm going up in less than a year. Solar pv is very reliable and predictable, we know when the sun will shine. Wind is slightly more difficult, but we only have to predict hours to days ahead. Solar and wind need the very same reserve generators that inflexible base load needs for peak and load following. Solar and wind can be installed with an output greater than demand, and they throttle instantly to the load. Base load is a big truck with the throttle stuck on full blast, hates to throttle and so it must be installed to less than the minimum demand or use batteries or storage for the excess energy. Pumped hydro was mainly installed for nuclear. Nuclear and coal need storage, not solar and wind, not that they won’t use it. For a 100% renewable system, the reserve generators can be hydro, geothermal, or turbines running on fuels from wastes. Even batteries are now being used in special situations to backup solar or wind. It’s still cheaper than diesel fuel for many places, particularity islands. Germany and Denmark have at times generated over 100% of their electricity from renewable yet they have the world’s two most reliable grids: ten times less outages than the USA. EV’s are already lifetime cheaper for people who drive a lot and getting cheaper fast. Yet the FUD from the fossils and nuclear industries continues . Fear Uncertainty and Doubt. Standard marketing and pr 101. Renewable are dominating the energy markets right now. Solar and wind backed with hydro, geothermal and fuels from wastes in existing gas turbines is all we need for 100% renewable electricity. Fuels from wastes can supply 10–20% of our total energy enough to backup solar and wind in the reserve generators, supply long haul transport needs after mostly going electricity, and provide the hydrocarbons we need for chemical feed stocks. All cheaper before gov breaks than fossils or nuclear. That’s why it’s dominating new power installs. That’s why even Trump voters and republicans are for renewable not fossils and nuclear. It’s shocking to some people, but renewable are a mature product now the beats all other forms for cost and low pollution. No 5.3T$ in gov breaks for fossils are need, no wars for oil and gas. If we follow the expected “S” market penetration curve and based on the last 20 years of exponential solar and wind growth, we will have more energy from them than total world energy demand, not just electricity, in 15 years. \"The average levelized long-term price from a sample of wind power sales agreements signed in 2014 (and admittedly concentrated in the lowest-priced central region of the country) fell to just 2.35¢/kWh. http://oilprice.com/Alternative-Energy/Wind-Power/Wind-Energy-Could-Blow-US-Coal-Industry-Away.htmlhttp://www.zmescience.com/ecology/climate/cheapest-solar-power/ 2.91 cents per KWH. \"Chile just signed the cheapest unsubsidized power in the world at ¢2.91/kWh. Of course, it’s solar energy\" Utility solar and wind are available cheaper than fossils and 4 times cheaper than nuclear before gov breaks. https://www.lazard.com/media/438038/levelized-cost-of-energy-v100.pdf Fossils get 5.3T$ in gov breaks per year. https://www.imf.org/external/pubs/ft/wp/2015/wp15105.pdf IMF 5.3T$ in gov breaks for fossils not including wars for oil and gas. Brian Donovan's answer to What is a disadvantage to all renewable resources? Apparently some folks are looking hard for problems with renewable. This basic question of “what’s wrong with renewable” comes up seemingly every day. Check my other answers for more rebuttals of FUD . Nothing is wrong with renewable. They are the energy revolution we worked so hard for. Now it’s here. We just have to break our fossil addiction and install renewable. Which is happening. ",
            "date": "Updated May 7, 2020",
            "views": "11",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim DeLong",
                    "user_href": "/profile/Jim-DeLong-6"
                },
                {
                    "user_id": "Mark Diesendorf",
                    "user_href": "/profile/Mark-Diesendorf"
                },
                {
                    "user_id": "YoanaDeyanova YoanaDeyanova",
                    "user_href": "/profile/YoanaDeyanova-YoanaDeyanova"
                },
                {
                    "user_id": "Andrija Erovic",
                    "user_href": "/profile/Andrija-Erovic"
                },
                {
                    "user_id": "Louis Oelofsen",
                    "user_href": "/profile/Louis-Oelofsen"
                },
                {
                    "user_id": "Scott Strough",
                    "user_href": "/profile/Scott-Strough"
                },
                {
                    "user_id": "Assad Chaudhry",
                    "user_href": "/profile/Assad-Chaudhry-1"
                },
                {
                    "user_id": "Mark H. Witte",
                    "user_href": "/profile/Mark-H-Witte"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Kuhlman",
                "href": "/profile/Aaron-Kuhlman-1"
            },
            "answer_text": "The general answer is misinformation, though there are some certain problems that need to be addressed and are being addressed. Let’s start with those problems first. Solar Power - This is a nice one to start with. Solar panels obviously do not work at night since there is no light being given off [citation needed]. However, there are solutions being worked on such as the people at Stanford University who, through science, I don’t claim to understand have created a way to turn radiative cooling into energy during the night.[1]This can work on the level to have some energy during the night. This was tested in December. This, again, has some drawbacks, but is a step in the right direction, at the very least. Another problem with solar panels is that they require a lot more rare materials, and that’s expensive.[2]We will also run out of materials (probably?) before we can replace the world’s energy supply. However, the cost is dropping and efficiency is rising.[3]This is an example of problems coming up and being addressed. Wind Power - It is estimated to kill around 328,000 birds a year.[4]This is obviously bad, however, there are 2 different solutions to this. This first is offshore windmills which, are being implemented on a very large scale[5]While this number does sound big, it pales in comparison to other things like cell towers, or cats.[6]I can’t find the numbers for birds killed by pollution, but I am almost certain it is magnitudes more than 328,000 a year. Considering birds killed by cats is somewhere between 1.4 and 3.7 billion… I think 328,000 is negligible. Almost 1 billion each year die from windows, but you don’t see us getting rid of those either.[7]That’s about the only complaint I’ve head about windmills, besides the noise which is also solved by offshoring windmills. Hydroelectric Power - The biggest problem with this is that we’ve run out of places to dam up and get electricity from. You’ll notice that the National Hydropower association doesn’t talk about damming up more places, but making dams more effective.[8]That’s why they focus on the ability to create 1.4 million jobs, instead of where they can grow to. We can’t put them in more places, leaving little room to grow. I won’t bore you with all of the details of other methods. Misinformation - There is just so much out there that, I think, the best way to cover it all and deal with it is to talk about Solar and Wind power (when comparing nuclear power to specific renewables) and their future compared to what they are usually compared to, nuclear power. So let’s divide this up into a Few categories. Growth and funding, potential job creation, potential output for the economy, energy output, research, and installation time. Growth and Funding - Here is where a lot of people will get tripped up. Nuclear power has more funding than any specific renewable energy. However, when you put them together, renewables and nuclear energy have comparable funding (5.7 billion vs 5.9 billion).[9]However, nuclear power does not have the same potential in growth. In fact, it has stalled out compared to renewables which are growing exponentially.[10]A lot of funding for renewables comes from private companies because there is a profit to be made with them, whereas with nuclear there is not. Unlike what some will try and argue, there is a tax break for nuclear energy as well as renewable energy.[11] Potential Job Creation - There is no job growth in nuclear power. None. It, in fact, is projected to decline.[12]Whereas jobs in wind power[13]or solar power[14]are projected to increase by 57% and 63% respectively. There is no contest. Renewables will create more jobs long term and short term. Potential Output for the economy - Going back to the Bureau of labor statistics, renewables, in about any sector, already provides more jobs than the whole nuclear power sector put together. I am also not aware of any corporations that are looking to fund their own nuclear power plant or creating a company to make power plants. If I’m wrong, feel free to comment. Energy Output - This is where I am going to bring up a source I used earlier.[15]According to this, nuclear power currently outputs more energy, however, it has stagnated since 2007, not producing more than around 800 billion kilowatt-hours. Though there are plans to finish 2 more nuclear reactors, and they’re almost done (complete in 2021 the other in 2022, started in 2012).[16]It is also worth mentioning, from an economic perspective, it is behind schedule and over budget. Going back to the first source mentioned in this paragraph, renewables, on the other hand, has grown 250 billion kilowatt-hours since 2015. With wind power staying on it’s projected course,[17]and solar power showing no signs of slowing down[18](not aware of any projections on it, though I’m sure they exist). While nuclear is producing more right now, it is virtually guaranteed that renewables will overtake it. Research - This is a tricky one. With nuclear power, let’s take the 2 most promising things coming from that field fusion and thorium. Fusion is a long way out, with it being projected to be available in 2050[19]it also has little room for improvement as it operates at 91% efficiency already.[20]Thorium was developed in 2008, and is being implemented, and could provide a fair chunk of power. It would also be much safer than the current nuclear reactors that we have.[21]On the side of renewables, we have people coming up with new ideas quite frequently, such as the idea I mention from Stanford earlier. Other newer examples are heat and hydrogen.[22]These will not be as efficient as nuclear power developments, or as heavy-hitting. However, where renewables shine, is their ability to become more efficient such as with the spike in solar panel efficiency[23]and efficiency with wind power is much in the same[24]wind power, however, is close to reaching it’s maximum. Installation Time - As previously noted, the only 2 nuclear reactors in the United States started with a 5-year time frame, and are now up to a 10 year one. A reactor produces anywhere from 582 to 3,937 megawatts of power each day.[25]We will average this out and say 2,250 megawatts a day (for an equal comparison). Comparing it to solar power first, a solar panel takes 1–3 days to install[26]averaging this out, we will say it takes 2 days for a panel that produces 3 kilowatts a day. 1000 kilowatts in a megawatt means that we need 750 solar panels, which will take 1,500 days, or a little over 4 years. A wind farm, on the other hand, takes 2 months for a 10-megawatt farm, or 6 months for a 50-megawatt farm.[27]Building wind farms one at a time doesn’t happen. For how the wind farm implementation would look in real life, here is a plan South Dakota is putting into place that will provide 2,500 Megawatts/day and it will take a little over a year.[28]  So this means that the biggest problem facing renewable energies isn’t the economics of it, because we create millions of jobs and we get more people involved in the financial sector of it. It isn’t that there are some gaping holes in them, because all other forms of energy have it too, and the one's renewables have we are quickly working towards solutions on them. It’s a combination of the lack of rare earth resources to make and maintain these energy sources, as well as misinformation on what they actually do to the economy, which is driving people away from them. Footnotes[1] This New Device Can Make Renewable Energy from the Cold Night Sky[2] We Don't Mine Enough Rare Earth Metals to Replace Fossil Fuels With Renewable Energy[3] How Solar Panel Cost & Efficiency Change Over Time | EnergySage[4] Will Wind Turbines Ever Be Safe For Birds?[5] The world's largest offshore wind farm is nearly complete. It can power 1 million homes[6] Wind turbines kill fewer birds than do cats, cell towers[7] https://www.washingtonpost.com/national/health-science/stop-blaming-cats-as-many-as-988-million-birds-die-annually-in-window-collisions/2014/02/03/9837fe80-8866-11e3-916e-e01534b1e132_story.html[8] Available - National Hydropower Association[9] FY 2017 Department of Energy Budget Request Fact Sheet[10] Electricity in the U.S.[11] The Nuclear Production Tax Credit[12] Nuclear Technicians[13] Wind Turbine Technicians[14] Solar Photovoltaic Installers[15] Electricity in the U.S.[16] Trump adds $3.7B in support to finish 2 new nuclear reactors[17] Map: Projected Growth of the Wind Industry From Now Until 2050[18] Solar Industry Research Data | SEIA[19] Is Fusion Power Within Our Grasp?[20] Nuclear Power Efficiency | Energy Services Group International[21] Future Thorium Reactors[22] 11 Different Sources of Alternative Energy | Renewable Resources Coalition[23] 11 Different Sources of Alternative Energy | Renewable Resources Coalition[24] Advancements in Wind Turbine Technology: Improving Efficiency and Reducing Cost - Power Engineering[25] How much electricity does a nuclear power plant generate?[26] Solar Panels and Installation Time - Energy Informative[27] Wind energy frequently asked questions (FAQ)| EWEA[28] $3.3 billion wind investment will add 2,500 MW of clean energy in South Dakota",
            "date": "Answered September 25, 2019",
            "views": "42",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris Sawyer",
                    "user_href": "/profile/Chris-Sawyer-22"
                },
                {
                    "user_id": "Ralph Rodriguez",
                    "user_href": "/profile/Ralph-Rodriguez-17"
                },
                {
                    "user_id": "Greg Smestad",
                    "user_href": "/profile/Greg-Smestad"
                },
                {
                    "user_id": "Tim Burke",
                    "user_href": "/profile/Tim-Burke-43"
                },
                {
                    "user_id": "Jesus Soto Martinez",
                    "user_href": "/profile/Jesus-Soto-Martinez"
                },
                {
                    "user_id": "Shrivathsan Margam S",
                    "user_href": "/profile/Shrivathsan-Margam-S"
                },
                {
                    "user_id": "Ann V. Rotvic",
                    "user_href": "/profile/Ann-V-Rotvic"
                },
                {
                    "user_id": "Shmuel Newmark",
                    "user_href": "/profile/Shmuel-Newmark"
                },
                {
                    "user_id": "Tim Lee",
                    "user_href": "/profile/Tim-Lee-291"
                },
                {
                    "user_id": "Megan Laudenslager",
                    "user_href": "/profile/Megan-Laudenslager"
                }
            ]
        },
        {
            "author_info": {
                "name": "Douglas Chapel",
                "href": "/profile/Douglas-Chapel"
            },
            "answer_text": "The primary concern with any source of electricity is reliability. In a developed country, there’s an expectation that sufficient electricity will be available to meet any demand on a 24/7/365 basis; when you turn on a light, or an appliance, or anything else, you expect that enough power will be available to instantly meet that demand. That is tricky to do because electricity is a unique commodity. It can’t be easily stored, and it consumed basically immediately after it’s produced, so you need to be generating about as much electricity as people are using at any given time. Typically, this is done by having both baseload generation and peaking generation available. Baseload generation is there to meet demand for electricity that is essentially constant - traditionally, this comes from sources like coal and nuclear, which take a long time to start and stop but which can provide steady and inexpensive power at a set level. Peaking generation is available to rapidly turn on and off, or to change output level, in response to fluctuations in demand throughout the day. Simple natural gas turbines, functioning like jet engines, are often used for this purpose. The problem with standard sources of renewable energy - that is, wind and solar - is that they are both intermittent and therefore don’t make a good source of baseload generation. The wind doesn’t always blow; the sun doesn’t always shine. So far, this has meant that wind and solar power need to be backed up by some other source of generation that is guaranteed to be reliable on a 24/7/365 basis. In other words, if a wind farm is running at full capacity, putting 100 MW of electricity on to the grid to meet demand, and the wind suddenly dies, then you have to replace that 100 MW essentially immediately. This means you have to have 100 MW of peaking generation that can be ready to go at a moment’s notice. The alternative to having backup generation is to have sufficient storage. Again, electricity is not easily stored, but there are advances in battery technology that could mitigate this issue. If our 100 MW wind farm were attached to a large battery array, then the wind farm could charge the battery while it’s also delivering power to the grid, and if the wind died then the battery could step in and deliver power to the grid instead, at least for a while. ",
            "date": "Answered November 1, 2016",
            "views": "26",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ed Gump",
                    "user_href": "/profile/Ed-Gump"
                },
                {
                    "user_id": "Moneeb Khursheed",
                    "user_href": "/profile/Moneeb-Khursheed"
                },
                {
                    "user_id": "Robert Gauthier",
                    "user_href": "/profile/Robert-Gauthier"
                },
                {
                    "user_id": "Danshyl Boodhoo",
                    "user_href": "/profile/Danshyl-Boodhoo-1"
                },
                {
                    "user_id": "Shivam Singh",
                    "user_href": "/profile/Shivam-Singh-1976"
                },
                {
                    "user_id": "Augustine Hongadi",
                    "user_href": "/profile/Augustine-Hongadi-1"
                },
                {
                    "user_id": "Andy Jacoby II",
                    "user_href": "/profile/Andy-Jacoby-II-1"
                },
                {
                    "user_id": "Mc Darryl Atacador",
                    "user_href": "/profile/Mc-Darryl-Atacador-1"
                },
                {
                    "user_id": "Aduragbemi Adebo",
                    "user_href": "/profile/Aduragbemi-Adebo"
                },
                {
                    "user_id": "Raj Das Gupta",
                    "user_href": "/profile/Raj-Das-Gupta"
                },
                {
                    "user_id": "Janto McMullin",
                    "user_href": "/profile/Janto-McMullin"
                },
                {
                    "user_id": "Ben McFadden",
                    "user_href": "/profile/Ben-McFadden-9"
                },
                {
                    "user_id": "Roland Bavington",
                    "user_href": "/profile/Roland-Bavington"
                },
                {
                    "user_id": "Timothy Soh",
                    "user_href": "/profile/Timothy-Soh-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Friso Sikkema",
                "href": "/profile/Friso-Sikkema"
            },
            "answer_text": "Unfortunately, there are a number of serious problems to choose from. I will list them below, starting with the most serious one. The percentage of the time that the renewable resources produce their “nameplate” capacity is really low. In Germany, the number one example of the energy shift, solar produces its rated power output just 11% of the time, which means you need a backup for 89 % of the time. For wind, the numbers are a little better but they also remain between 15 to 25 % (depending on off-shore on onshore, and the amount of wind per year), so again, 85–75% of the time you need a backup.Because the energy density of wind and solar is very low, you need very large installations to harvest the energy. This means that a lot of material (steel, concrete, glass, PV panels, mounting, cables, etc etc) must be invested first. Al these materials must be produced, which consumes various amounts of resources and a lot of energy. A 3 MW wind turbine is built using 200 tonnes of steel, which is made using coal. Therefore, the actual CO2 output of renewables is higher than most people realize.All technical installations have a limited lifetime. At one point in time, the installation doesn’t work anymore. So you have to replace the installation. As the scale increases, this will be a serious problem. For example, if you install a billion solar panels in the entire USA, all of which have a lifetime of 30 years (= guaranteed lifetime + 10 years) you have to replace more than 90.000 panels every single day, for the rest of civilization. The cost of just the first installation would be (conservative estimate) around 500 billion dollars; the cost of replacing the panels would be around 45 milion USD per day. Much the same goes for wind turbines.In the above example, the one billion solar panels would generate around 250 GW, but ONLY when the sun shines at a proper angle. This is roughly equal to half the US electricity supply. Thus, you would need much, much more.But if you do that, you will have too much electricity when the sun shines, and not enough when it is night. Okay, then what about storage? The hard fact is that not even in the wildest dreams of battery engineers they can come up with a solution that stores that much energy. Even the most massive battery installations that have been built only provide a fraction of what is needed. See below. This massive battery, the largest in the world in energy terms, delivers just 50 MW for six hours. After that, it’s empty. Renewable resources produce, mostly, only electricity. Then what is to be done about the myriad of other consumption such as petrol (gasoline), heating, industrial processes, aviation, shipping and so on?Renewable energy , in conclusion, can certainly have some impact on the electricity consumption, especially in regions where the electricity is expensive (islands), but on the massive scale that we use energy, it won’t make much of a difference. This is confirmed with statistics worldwide: solar power contributes just one percent to the global electricity demand, and wind about 3%. Thus, massive new coal fired capacity is planned worldwide to meet the increase in demand.  This graph (BP world statistics of energy) shows the scale of the challenge. The orange sliver is the entire worlds output of “renewable energy”, which, however, is mostly waste combustion and biofuels. Biofuels have shown to be inefficient in reducing CO2 output, and should be stopped as soon as possible. Waste combustion is mostly plastic (i.e. refined oil) If you would introduce the solar and wind electricity in this graph, they would be barely visible. Remember, barely visible, after trillions of dollars invested. However, LUCKILY, there is a solution to our energy needs, which is clean, very safe, exceedingly powerful, works 24/7/365 and available for 10.000 years. Nuclear. ",
            "date": "Updated October 13, 2020",
            "views": "98",
            "upvotes": " View 45 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Wise",
                    "user_href": "/profile/David-Wise-172"
                },
                {
                    "user_id": "Shaik Saabir",
                    "user_href": "/profile/Shaik-Saabir-1"
                },
                {
                    "user_id": "Samrat Dutta",
                    "user_href": "/profile/Samrat-Dutta-107"
                },
                {
                    "user_id": "John Popovich",
                    "user_href": "/profile/John-Popovich"
                },
                {
                    "user_id": "Ralph Glockemann",
                    "user_href": "/profile/Ralph-Glockemann-1"
                },
                {
                    "user_id": "Goronwy Price",
                    "user_href": "/profile/Goronwy-Price"
                },
                {
                    "user_id": "Rangwala Sakina",
                    "user_href": "/profile/Rangwala-Sakina"
                },
                {
                    "user_id": "Bryan Hayadi",
                    "user_href": "/profile/Bryan-Hayadi"
                },
                {
                    "user_id": "Ryszard Rakowski",
                    "user_href": "/profile/Ryszard-Rakowski"
                },
                {
                    "user_id": "Rick Armknecht",
                    "user_href": "/profile/Rick-Armknecht"
                },
                {
                    "user_id": "Shiran Pallewatta",
                    "user_href": "/profile/Shiran-Pallewatta-1"
                },
                {
                    "user_id": "Robert Pattison",
                    "user_href": "/profile/Robert-Pattison-4"
                },
                {
                    "user_id": "Moneeb Khursheed",
                    "user_href": "/profile/Moneeb-Khursheed"
                },
                {
                    "user_id": "Suhee Vimalesh",
                    "user_href": "/profile/Suhee-Vimalesh"
                },
                {
                    "user_id": "Mredula Sharma",
                    "user_href": "/profile/Mredula-Sharma"
                },
                {
                    "user_id": "Ahmad Seyfaee",
                    "user_href": "/profile/Ahmad-Seyfaee"
                },
                {
                    "user_id": "Robert Gauthier",
                    "user_href": "/profile/Robert-Gauthier"
                },
                {
                    "user_id": "Shrenik Kalambur",
                    "user_href": "/profile/Shrenik-Kalambur"
                },
                {
                    "user_id": "Siddhant Bhardwaj",
                    "user_href": "/profile/Siddhant-Bhardwaj-20"
                },
                {
                    "user_id": "Bohumila Klajblová",
                    "user_href": "/profile/Bohumila-Klajblová"
                },
                {
                    "user_id": "Shivam Singh",
                    "user_href": "/profile/Shivam-Singh-1976"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/NTW-1"
                },
                {
                    "user_id": "Karan Veer",
                    "user_href": "/profile/Karan-Veer-23"
                },
                {
                    "user_id": "Neha Bharti",
                    "user_href": "/profile/Neha-Bharti-241"
                },
                {
                    "user_id": "Nick Minchin",
                    "user_href": "/profile/Nick-Minchin-1"
                },
                {
                    "user_id": "Piyush Warhade",
                    "user_href": "/profile/Piyush-Warhade-1"
                },
                {
                    "user_id": "Ronald J. Dinino",
                    "user_href": "/profile/Ronald-J-Dinino"
                },
                {
                    "user_id": "Jeff Kenny",
                    "user_href": "/profile/Jeff-Kenny-10"
                },
                {
                    "user_id": "Giuliana Falconio",
                    "user_href": "/profile/Giuliana-Falconio"
                },
                {
                    "user_id": "Yogesh Hadke",
                    "user_href": "/profile/Yogesh-Hadke-2"
                },
                {
                    "user_id": "Blair Sergeant",
                    "user_href": "/profile/Blair-Sergeant"
                },
                {
                    "user_id": "Dave Martin",
                    "user_href": "/profile/Dave-Martin-60"
                },
                {
                    "user_id": "Jd Morgan",
                    "user_href": "/profile/Jd-Morgan-4"
                },
                {
                    "user_id": "Caleb Kim",
                    "user_href": "/profile/Caleb-Kim-18"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/Aditya-1019"
                },
                {
                    "user_id": "Anubhav Jain",
                    "user_href": "/profile/Anubhav-Jain-13"
                },
                {
                    "user_id": "Ajay Pratap Singh",
                    "user_href": "/profile/Ajay-Pratap-Singh-42"
                },
                {
                    "user_id": "Vasu Kapoor",
                    "user_href": "/profile/Vasu-Kapoor-4"
                },
                {
                    "user_id": "Paul Ani",
                    "user_href": "/profile/Paul-Ani"
                },
                {
                    "user_id": "VIVEK UNNIKRISHNAN",
                    "user_href": "/profile/VIVEK-UNNIKRISHNAN-5"
                },
                {
                    "user_id": "Aaron Dahlen",
                    "user_href": "/profile/Aaron-Dahlen"
                },
                {
                    "user_id": "Gregory Close",
                    "user_href": "/profile/Gregory-Close"
                },
                {
                    "user_id": "Sidharth Kapoor",
                    "user_href": "/profile/Sidharth-Kapoor-9"
                },
                {
                    "user_id": "Irlyvara Nandini",
                    "user_href": "/profile/Irlyvara-Nandini"
                },
                {
                    "user_id": "Vigneswaran Gandhi",
                    "user_href": "/profile/Vigneswaran-Gandhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Matkin",
                "href": "/profile/James-Matkin"
            },
            "answer_text": "Intermittency and cost - they go together. When the wind does not blow and sun does not shine this intermittency makes renewable unreliable energy. On the grid to prevent black outs fossil fuel energy [often cheaper natural gas} is a mandatory back up. The result is doubling of the end price of electricity making those countries most flocking to the virtue of renewables the worst offenders for energy poverty. Wind turbines are neither clean nor green and they provide zero global energy Charles Rotter / January 10, 2019 From The Spectator We urgently need to stop the ecological posturing and invest in gas and nuclear Matt Ridley  The Global Wind Energy Council recently released its latest report, excitedly boasting that ‘the proliferation of wind energy into the global power market continues at a furious pace, after it was revealed that more than 54 gigawatts of clean renewable wind power was installed across the global market last year’. You may have got the impression from announcements like that, and from the obligatory pictures of wind turbines in any BBC story or airport advert about energy, that wind power is making a big contribution to world energy today. You would be wrong. Its contribution is still, after decades — nay centuries — of development, trivial to the point of irrelevance. Here’s a quiz; no conferring. To the nearest whole number, what percentage of the world’s energy consumption was supplied by wind power in 2014, the last year for which there are reliable figures? Was it 20 per cent, 10 per cent or 5 per cent? None of the above: it was 0 per cent. That is to say, to the nearest whole number, there is still no wind power on Earth. Matt Ridley and climate change campaigner Leo Murray debate the future of wind power: Even put together, wind and photovoltaic solar are supplying less than 1 per cent of global energy demand. From the International Energy Agency’s 2016 Key Renewables Trends, we can see that wind provided 0.46 per cent of global energy consumption in 2014, and solar and tide combined provided 0.35 per cent. Remember this is total energy, not just electricity, which is less than a fifth of all final energy, the rest being the solid, gaseous, and liquid fuels that do the heavy lifting for heat, transport and industry. Such numbers are not hard to find, but they don’t figure prominently in reports on energy derived from the unreliables lobby (solar and wind). Their trick is to hide behind the statement that close to 14 per cent of the world’s energy is renewable, with the implication that this is wind and solar. In fact the vast majority — three quarters — is biomass (mainly wood), and a very large part of that is ‘traditional biomass’; sticks and logs and dung burned by the poor in their homes to cook with. Those people need that energy, but they pay a big price in health problems caused by smoke inhalation. Even in rich countries playing with subsidised wind and solar, a huge slug of their renewable energy comes from wood and hydro, the reliable renewables. Meanwhile, world energy demand has been growing at about 2 per cent a year for nearly 40 years. Between 2013 and 2014, again using International Energy Agency data, it grew by just under 2,000 terawatt-hours. If wind turbines were to supply all of that growth but no more, how many would need to be built each year? The answer is nearly 350,000, since a two-megawatt turbine can produce about 0.005 terawatt-hours per annum. That’s one-and-a-half times as many as have been built in the world since governments started pouring consumer funds into this so-called industry in the early 2000s. At a density of, very roughly, 50 acres per megawatt, typical for wind farms, that many turbines would require a land area greater than the British Isles, including Ireland. Every year. If we kept this up for 50 years, we would have covered every square mile of a land area the size of Russia with wind farms. Remember, this would be just to fulfil the new demand for energy, not to displace the vast existing supply of energy from fossil fuels, which currently supply 80 per cent of global energy needs. Do not take refuge in the idea that wind turbines could become more efficient. There is a limit to how much energy you can extract from a moving fluid, the Betz limit, and wind turbines are already close to it. Their effectiveness (the load factor, to use the engineering term) is determined by the wind that is available, and that varies at its own sweet will from second to second, day to day, year to year. As machines, wind turbines are pretty good already; the problem is the wind resource itself, and we cannot change that. It’s a fluctuating stream of low–density energy. Mankind stopped using it for mission-critical transport and mechanical power long ago, for sound reasons. It’s just not very good. As for resource consumption and environmental impacts, the direct effects of wind turbines — killing birds and bats, sinking concrete foundations deep into wild lands — is bad enough. But out of sight and out of mind is the dirty pollution generated in Inner Mongolia by the mining of rare-earth metals for the magnets in the turbines. This generates toxic and radioactive waste on an epic scale, which is why the phrase ‘clean energy’ is such a sick joke and ministers should be ashamed every time it passes their lips. It gets worse. Wind turbines, apart from the fibreglass blades, are made mostly of steel, with concrete bases. They need about 200 times as much material per unit of capacity as a modern combined cycle gas turbine. Steel is made with coal, not just to provide the heat for smelting ore, but to supply the carbon in the alloy. Cement is also often made using coal. The machinery of ‘clean’ renewables is the output of the fossil fuel economy, and largely the coal economy. Wind turbines are neither clean nor green and they provide zero global energy Fareed's Take: Bernie Sanders' magical thinking on climate ... CNN - Breaking News, Latest News and Videos › videos › 2020/02/15 › exp-gps-0216-fareeds-take 5 days ago - CNN's Fareed Zakaria gives his take on why Bernie Sanders has an unrealistic approach to achieving deep cuts in carbon emissions. Fareed's Take: Bernie Sanders' magical thinking on climate - CNN Video The result is countries most engaged with wind and solar like South Australia, Denmark and Germany have the highest electricity prices and are guilty of increasing energy poverty for the disadvantaged. Even Great Britain subsidies for renewables have create more energy poverty and fatalities than road accidents.  ",
            "date": "Answered April 1, 2020",
            "views": "160",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Samrat Dutta",
                    "user_href": "/profile/Samrat-Dutta-107"
                },
                {
                    "user_id": "Ryszard Rakowski",
                    "user_href": "/profile/Ryszard-Rakowski"
                },
                {
                    "user_id": "Peter Williams",
                    "user_href": "/profile/Peter-Williams-172"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Meier",
                "href": "/profile/Eric-Meier-5"
            },
            "answer_text": "Location, Location, Location! is the mantra for real estate and it applies to renewables too. Why? Often the best sites for renewable generation like wind and solar are located in the deserts or plains of the Midwest. These are often remote areas with few population centers nearby. This is important because it often means a lack of transmission capacity, if any near transmission capacity. Most of these sites need transmission lines built out to them to deliver power to the grid as there isn’t an easy point of interconnection. So which one comes first, the transmission lines or the renewable generators? In Texas, the wind boom was largely facilitated by the building of the Competitive Renewable Energy Zone or CREZ. This project was approved by the legislature to build transmission capacity to west Texas and the Panhandle to facilitate the development of wind power. It’s a Catch-22 situation, the renewable developers will not come if there isn’t a grid to connect to and transmission utilities will not build transmission if there is no demand for it. The foresight of the Texas Legislature led to the wind boom as the Legislature said, lets build and they will come. And come the wind developers did. Total wind power capacity in Texas just eclipsed the total coal generation capacity. And renewable developers can build generation sites much faster than transmission can be built which poses another challenge. Indeterminacy, while an issue is solvable. A combination of storage, flexible fast ramping resources, and more interconnections in the grid can solve this issue. We can achieve rather high rates of renewable penetration without much or any storage currently. Resources that can ramp quickly can address the sharp decrease or increase from renewable power generation due to weather. A more connected grid allows for easier power transfer between regions and can reduce congestion or bottlenecks to supplying electricity. A great on the Texas wind boom is available here: Why the Texas wind boom may be an outlier rather than a model for the wind industry in the rest of the U.S. ",
            "date": "Answered December 28, 2017",
            "views": "17",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim DeLong",
                    "user_href": "/profile/Jim-DeLong-6"
                },
                {
                    "user_id": "Ed Gump",
                    "user_href": "/profile/Ed-Gump"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/JimixMan"
                },
                {
                    "user_id": "Blair Sergeant",
                    "user_href": "/profile/Blair-Sergeant"
                },
                {
                    "user_id": "Paul Mesa",
                    "user_href": "/profile/Paul-Mesa-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Dahlen",
                "href": "/profile/Aaron-Dahlen"
            },
            "answer_text": "Hello Janto, There is a very good case to be made for renewable energy. In the developed world, it currently enjoys the lowest cost of any generation we have.[1]The energy independence to be obtained by free standing systems is compelling. Case in point, the continued tragedy in Puerto Rico. The Department of Labor even lists solar installers as the fastest growing occupation in America. All signals suggest that solar and wind are unstoppable.  Source: U.S. Bureau of Labor Statistics  At this point, we need to step back and ask why we are moving towards renewable energy in the first place. Most would agree that we need to address the trend in sea level rise and the other problems associated with climate change. This Hockey stick graph - Wikipedia from NASA clearly shows the problem with [math]CO_2[/math].  Source: Carbon dioxide concentration | NASA Global Climate Change  Given the clear case supporting solar and wind, you may be wondering why we are even having this conversation. It’s a solved problem isn’t it? Actually, no it isn’t. Solar and Wind are not living up to the promise of clean energy. The biggest problem is intermittency. We need to look at what happens when these sources are unavailable. Your time is important, so I will only ask you to look at one graphic. But one is all you need. This chart, as found in the Annual Energy Outlook 2018, shows the past, present, and predictions for America’s energy mix. Notice the numbers for solar and gas. They are inseparable!  We are not building glean solar. Instead, we are building [math]CO_2[/math] emitting gas-solar plants. This is very good for our economy. It gives us a world class energy system that is very reliable and clean (relative to coal). But are we doing the right thing to solve our world’s problems? If you learned something in this post, you may be interested in my solution: Aaron Dahlen's answer to Is nuclear energy the hope of the future? Regards, APDahlen Footnotes[1] Levelized Cost of Energy 2017",
            "date": "Answered March 9, 2018",
            "views": "17",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tom Flynn",
                    "user_href": "/profile/Tom-Flynn-49"
                },
                {
                    "user_id": "Ilham Kamaruddin",
                    "user_href": "/profile/Ilham-Kamaruddin"
                },
                {
                    "user_id": "Blair Sergeant",
                    "user_href": "/profile/Blair-Sergeant"
                },
                {
                    "user_id": "Liam N. O' Ceallaigh",
                    "user_href": "/profile/Liam-N-O-Ceallaigh"
                },
                {
                    "user_id": "Brian Fey",
                    "user_href": "/profile/Brian-Fey"
                },
                {
                    "user_id": "Martin Voelker",
                    "user_href": "/profile/Martin-Voelker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karl Young",
                "href": "/profile/Karl-Young-10"
            },
            "answer_text": "Affordable ENERGY STORAGE is the biggest missing piece to enable renewable energy to be a practical solution. The intermittency of sunshine and wind cannot provide a 24/7 on-demand power source without lots of energy storage. Hydro works in limited areas as energy storage, but also has some negative environmental impact on fish and inconveniences to people. China’s 3-Gorges Dam submerged 13-cities, 140-towns and 1,600-villages; displacing 1.3-million people. The utilities cannot afford to buy anything that has a service life less than 30–50 years. So, all existing rechargeable chemical batteries are too expensive and their service life is too short. Energy storage needs to be able to tolerate high power in, high power out. Chemical batteries can handle the high power flux only if it were 5–10 times higher in capacity or can handle 10–20C charge rate, 100-times longer cycle-life and 5-10 times less expensive. The only potential energy storage solution is a new generation of supercapacitors using graphene nanoribbons or something similar in performance and cost. It needs to be able to be comfortable in 10–30C power in and out, 50–100 times a day without active cooling. So far, only supercapacitors can handle these requirements. If mini-solar grids are distributed throughout the world in the more sunny regions, and all are connected as in a world grid network, then there will be power 24/7 for everyone. For example, the solar insolation map of the U.S. below shows about 1/3 of the country has excellent sun-hours per day and more than another 1/3 has good annual sun-hours to produce electric power for the entire country. Solar Insolation Map  The numbers above are annual averages of full sun hours per day. More details for other countries: List of cities by sunshine duration - Wikipedia So, not just lots of affordable energy storage, but also if all the renewable energy generation sites can be linked together, then there would be a more even distribution of energy with less stressed grid nodes. ",
            "date": "Answered April 8, 2019",
            "views": "14",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jesse Tetrault",
                    "user_href": "/profile/Jesse-Tetrault"
                },
                {
                    "user_id": "Magnus Alsered",
                    "user_href": "/profile/Magnus-Alsered"
                },
                {
                    "user_id": "Moneeb Khursheed",
                    "user_href": "/profile/Moneeb-Khursheed"
                },
                {
                    "user_id": "Robert Gauthier",
                    "user_href": "/profile/Robert-Gauthier"
                },
                {
                    "user_id": "Rajib Roy",
                    "user_href": "/profile/Rajib-Roy-1"
                },
                {
                    "user_id": "Shreyash Kumar",
                    "user_href": "/profile/Shreyash-Kumar-2"
                },
                {
                    "user_id": "Habbil",
                    "user_href": "/profile/Habbil"
                },
                {
                    "user_id": "Roland Bavington",
                    "user_href": "/profile/Roland-Bavington"
                },
                {
                    "user_id": "Ilias Ryspaev",
                    "user_href": "/profile/Ilias-Ryspaev"
                },
                {
                    "user_id": "Ravi Teja",
                    "user_href": "/profile/Ravi-Teja-16"
                },
                {
                    "user_id": "Prateek Kumar",
                    "user_href": "/profile/Prateek-Kumar-160"
                },
                {
                    "user_id": "Arnab Panda",
                    "user_href": "/profile/Arnab-Panda-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig d'Aberfeldie",
                "href": "/profile/Craig-dAberfeldie"
            },
            "answer_text": "Renewable energy faces a number of problems. The largest one is that carbon-based energy is deeply embedded in our society and our demand for it is vast. This means that substituting renewable energy is easier for some applications like homes but it is very hard for cars, trucks, trains, ships and the like. This is because transport uses a lot of energy, and everyone relies very heavily on transport. Transport systems want to burn carbon-based fuels. A vast amount of old money is still in these fuels. Changing this will be hard, but essential. Shipping alone emits the same GHGs as the eighth-largest country. Decision makers only favour replacing carbon-based sources with other (perhaps less polluting) carbon based sources. For example, replacing coal based electricity generation with natural gas. More efficient (gasoline or diesel) cars and so on. Renewable power is unreliable but that’s the worst of it. If we can adapt society to make the best of it, the source of the energy (the wind, the sun) are free. We just have to work out how to consume a lot less energy in the first place. ",
            "date": "Answered July 31, 2018",
            "views": "523",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alijaeh Go",
                    "user_href": "/profile/Alijaeh-Go"
                },
                {
                    "user_id": "Rajshree",
                    "user_href": "/profile/Rajshree-58"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sosa Eisa",
                "href": "/profile/Sosa-Eisa"
            },
            "answer_text": "In general, money; renewable energy is useful when engineers uses it, engineers work for companies, companies aren’t necessarily run by green humans and usually they take their ROR (investments returns) seriously. renewable energy isn’t always appealing to ROR. Money also is important to do further researches and improve current technology. The cool thing about renewable energy resources is that the input never depletes, but it can be uncontrollable such technology depends heavily on climate so it necessitates creating a technology which would fit climate and sometimes that is not possible (yet). It also isn’t reliable enough to become a primary source or backup source for cities so it would be integrated to the grid later on in the process of power distribution. For example: PV cells: Shading (can be clouds, or dirt) can demolish output and sometimes it can kill the panel, temperature can lower efficiency. Fuel cells: Oxidation reaction sucks and needs to be pushed hardly usually by Pt (precious metal) and the more units you produce the less Pt you’ll have on earth and the more pricey marginal units will become. Operating temperature range for each type is strictly specified. Renewable energy needs also love from society at the moment, that to be seen with objectivity rather than magical expectations. To summarize, renewable energy needs money, money, money and love. ",
            "date": "Answered November 11, 2016",
            "views": "825",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lachlan Cheung",
                    "user_href": "/profile/Lachlan-Cheung-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kirby",
                "href": "/profile/John-Kirby-1"
            },
            "answer_text": "One of the biggest issues is replication of investment, as an independent consultant, I am privileged to see new and exciting projects, recently I visited over a seven month period three, and each were trying to arrive at a solution to the same problem, and making the same mistakes. Another issue is Energy Storage, the effect of relying on renewables is the consistency of supply, microgrids, DC networks and local energy storage will become crucial. Finally, it is about Government Policy, so often the goalposts get moved, Feed in Tariffs / Renewable Heating Allowance get altered, and the way it is done, caused consumer confusion and undermined the professional status of the industry. ",
            "date": "Answered November 6, 2016",
            "views": "706",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/PAul-735"
                },
                {
                    "user_id": "Andy Jacoby II",
                    "user_href": "/profile/Andy-Jacoby-II-1"
                },
                {
                    "user_id": "Timothy Soh",
                    "user_href": "/profile/Timothy-Soh-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Brumlik",
                "href": "/profile/Marc-Brumlik-1"
            },
            "answer_text": "There are two. The first is that we need a way to store energy that’s produced intermittently, to even out the load. Whether batteries, pumping water uphill, compressing air, or some other method. The second is one of perceived cost. The bio-fuel and fossil-fuel industries are heavily subsidized, masking their true cost and making alternatives appear too expensive. Fossil fuel subsidies alone come to 5 Trillion per year annually, which amounts to 6.5% of the worldwide GDP. But we pay that through our taxes, not at the pump so nobody sees it. ",
            "date": "Answered March 24, 2019",
            "views": "243",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alijaeh Go",
                    "user_href": "/profile/Alijaeh-Go"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Brent",
                "href": "/profile/Jason-Brent-2"
            },
            "answer_text": "No matter what action is taken by humanity there will never be enough renewable energy to replace fossil fuels in all their energy uses. No matter what action is taken by humanity, humanity will not be able to replace fossil fuels in all their non-energy uses—plastics, fertilizers, etc.. Nothing available today or in the foreseeable future will replace fossil fuels in their transportation uses—fly planes, propel shipping, and provide the energy for one billion cars and trucks. jgbrent6179@aol.com ",
            "date": "Answered November 6, 2016",
            "views": "442",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nicholas Newman",
                "href": "/profile/Nicholas-Newman-8"
            },
            "answer_text": "Finding affordable and competitive methods for storing surplus power, plus redesigning power distribution networks from traditional hub and spoke distribution to one of distributed power networks. Here is a breakdown of some of the current solutions in energy storage being tried. Energy Storage Technologies On The Way  ",
            "date": "Answered November 6, 2016",
            "views": "894",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dave Martin",
                    "user_href": "/profile/Dave-Martin-60"
                },
                {
                    "user_id": "Martin Voelker",
                    "user_href": "/profile/Martin-Voelker"
                },
                {
                    "user_id": "Andy Jacoby II",
                    "user_href": "/profile/Andy-Jacoby-II-1"
                },
                {
                    "user_id": "Prince Sarker",
                    "user_href": "/profile/Prince-Sarker"
                },
                {
                    "user_id": "Subash Panta Khatri",
                    "user_href": "/profile/Subash-Panta-Khatri"
                },
                {
                    "user_id": "Gennaro Senatore",
                    "user_href": "/profile/Gennaro-Senatore-1"
                },
                {
                    "user_id": "Aarón Rivera-Dominguez",
                    "user_href": "/profile/Aarón-Rivera-Dominguez"
                },
                {
                    "user_id": "Timothy Soh",
                    "user_href": "/profile/Timothy-Soh-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pradeep Kumar",
                "href": "/profile/Pradeep-Kumar-1769"
            },
            "answer_text": "I completely agree with the answer of Douglas Chapel. Apart from the storage of electricity, The biggest problem of implementing RES (Renewable energy sources) in a developing country like India is the, the economics of substituting the existing conventional energy plants. Unless the Returns On Investment of the existing Nonrenewable power sources are completely realized , It is not wise to reinvest a huge amount in the RES, because the initial setup cost ( fixed cost ) is too high for the RES. ",
            "date": "Answered November 1, 2016",
            "views": "546",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Jacoby II",
                    "user_href": "/profile/Andy-Jacoby-II-1"
                },
                {
                    "user_id": "Ding Jing Chuah",
                    "user_href": "/profile/Ding-Jing-Chuah"
                },
                {
                    "user_id": "Janto McMullin",
                    "user_href": "/profile/Janto-McMullin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Dworshak",
                "href": "/profile/Daniel-Dworshak"
            },
            "answer_text": "A source that can supply the “base load” 24/7 is needed. Right now I can think of Hydro and geothermal sources that can do this and are renewable sources. Solar requires batteries to run at night (or some other fuel like natural gas on CST type plants). Wind is dependent on the weather, etc. So a more dependable source is needed. ",
            "date": "Answered August 9, 2018",
            "views": "175",
            "upvotes": " Answer requested by B.A. Ball Doubles the Trouble",
            "upvoters": [
                {
                    "user_id": "Joni Karjalainen",
                    "user_href": "/profile/Joni-Karjalainen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arthur Tunnessen",
                "href": "/profile/Arthur-Tunnessen"
            },
            "answer_text": "The biggest problems are likely to be “surprises” that are unexpected. Most of it is not ready for prime time so it will be costly and slow to incorporate. Bala’s answer is much more extensive but she hits the points. I think the main driver of energy sources is cost. Cheaper always wins. ",
            "date": "Answered April 8, 2017",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mitchel Watson",
                "href": "/profile/Mitchel-Watson"
            },
            "answer_text": "Sunk costs in fossil fuel modes of generation and centralised distribution models, coupled with the political power of these incumbents slowing the rate of change. ",
            "date": "Answered February 25, 2018",
            "views": "239",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Poojitha Ch",
                    "user_href": "/profile/Poojitha-Ch-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "PSC Solar Industries",
                "href": "/profile/PSC-Solar-Industries"
            },
            "answer_text": "I think one of the problem facing the renewable energy is the global warming effect. Click the link below to read what you really need to know about Greenhouse effect and global warming. What you need to know about greenhouse effect and global warming - PSC Solar (UK) ",
            "date": "Answered September 6, 2017",
            "views": "390",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Chacon",
                    "user_href": "/profile/David-Chacon-5"
                },
                {
                    "user_id": "Subash Panta Khatri",
                    "user_href": "/profile/Subash-Panta-Khatri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Rabe",
                "href": "/profile/Philip-Rabe"
            },
            "answer_text": "Battery or other storage technology. Lithium ion was a big leap, but to really give renewables a push, we need a much larger leap for big grid capacity storage solutions. ",
            "date": "Answered July 31, 2018",
            "views": "86",
            "upvotes": " Answer requested by B.A. Ball Doubles the Trouble"
        },
        {
            "author_info": {
                "name": "Kimberly King",
                "href": "/profile/Kimberly-King-1"
            },
            "answer_text": "Real estate. No single renewable energy system has the energy rich density of CONG (coal, oil, nuclear, natural gas). ",
            "date": "Answered November 1, 2016",
            "views": "229",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Jolly Willson",
                "href": "/profile/Jolly-Willson"
            },
            "answer_text": "There is no doubt that renewable energy is the most important as it is pollution free . If you want to more about renewable energy then consult best Renewable Energy Consulting Firms of USA for best results. ",
            "date": "Answered September 7, 2019",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Winslade",
                "href": "/profile/Mike-Winslade"
            },
            "answer_text": "What is the biggest problem facing renewable energy? Intermittency. We need either cheaper energy storage or some other way to eliminate intermittency. I think storage is going to get there first. ",
            "date": "Answered March 13, 2018",
            "views": "142",
            "upvotes": " Answer requested by B.A. Ball Doubles the Trouble"
        }
    ]
}