{
    "title": "What was the first handheld console you owned? - Quora",
    "tags": [
        "Handheld Video Game Consoles",
        "Handheld Devices",
        "Console Games",
        "Video Game Industry",
        "Video Game Consoles",
        "PC Gaming ",
        "Games",
        "Technology",
        "Video Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aayush Verma",
                "href": "/profile/Aayush-Verma-22"
            },
            "answer_text": "The first? Probably a Nintendo DS. Nintendo has been dominating in the handheld console market for a long time. From the Gameboy to the Switch (ok, it's a hybrid, but still), it's no surprise that Nintendo was my first. Yes, the PSP was a thing when I was old enough to even play video games, but it was super expensive (to a kid convincing a parent to buy one) and generally thought as the luxury handheld console. Mind you, it wasn't just mine. My brother is the one who asked for it, as I was way too young to even know it was a thing. However, we both shared it equally (mostly). My brother used to play Pokémon all the time. He's caught almost every single Pokémon in the fourth and the fifth generation. I was more of a casual fan of it, although unlike him, I still pay attention to it. While I didn't own a Sonic game on it (except the Olympic Games) it's also where I started playing Sonic games. Sonic Rush was a game I often played at my friends' homes. Never played too much of it though. Kind of a shame, as to this day, I've still have yet to complete all of the DS Sonic games. I'll miss the DS. But the 3DS and Switch is superior to it in many ways, I'll admit. ",
            "date": "Answered October 14, 2019",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ava Farrugia",
                "href": "/profile/Ava-Farrugia-2"
            },
            "answer_text": "The first handheld console i owned was a Nintendo DSi. Unfortunately the top screen broke, so it doesn’t work anymore. Where did that R4 Flash card go again? ",
            "date": "Answered September 27, 2019",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Heke Huuskonen",
                "href": "/profile/Heke-Huuskonen"
            },
            "answer_text": "Not counting G&W, it was Nintendo DS. A christmas present from my wife in 2006. ",
            "date": "Answered September 26, 2019",
            "views": "7",
            "upvotes": "0"
        }
    ]
}