{
    "title": "What is the best smartphone to buy below 10k rupees? - Quora",
    "tags": [
        "Mobile Phone Recommendations",
        "Mobile Phones",
        "Shopping"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ayaan Goswami",
                "href": "/profile/Ayaan-Goswami"
            },
            "answer_text": "In the past, it could have been pretty difficult to acquire a smartphone that has good features for less than 10k. Times, however, has changed now and one can actually purchase a feature-rich smartphone easily within 10k. Personally, over the period of almost a decade - even I have never had the need to spend more than 10-12k on a smartphone. At the moment, with the constant competition in the smartphone market as well with technological growth - it has become easier than ever to acquire a device within a preferred range of price. I think the best smartphone to purchase below 10k, at the moment, would definitely be the Realme C3. Realme as a brand aspires to provide smartphones which are a combination of style and durability within a reasonable price. Their USP is performance through affordable but advanced technology and stylish designs and the culmination of this aspect is noticeable in the Realme C3. Realme C3 is the successor to the Realme C2. In the aspect of cost, this is an incredibly reasonably priced phone. It is available in two variants and depending on the variant one chooses this phone will cost Rs 6,999 (3GB/32GB) and Rs 7,999 (4GB/64GB). A 4GB RAM phone with an internal storage of 64 GB is a steal deal at the price of 8k especially when numerous contemporary brands provide the 4GB RAM option at around 10k or an above range. The C3 has a decent screen display of 6.5 inches with Corning Gorilla Glass protection. The inclusion of the fingerprint sensor is also a huge plus as it is hardly available in other models of below 10k. It is run by the MediaTek Helio G70 processor. As mentioned before, it has two variants - 3/4 GB RAM + 32/64 GB storage (expandable up to 256 GB) The rear camera is 12MP+2MP dual with LED Flash and the front camera is 5 MP. It is available in Blazing Red and Frozen Blue. The battery power is 5000 mAh and it is run by the Android 10 based colour OS7. The highlight of the C3, however, is the MediaTek Helio G70 processor which is a gaming-focused soc. It was created and designed specifically for elite mobile gamers and the fact that game enthusiasts consumers will be able to procure this at such a low price is a blessing for many. This processor is also equipped to handle long hours of constant gaming by providing reliable performance throughout. It is also the first Realme device to have the Realme User Interface. The G70 chipset will allow the users to indulge in several heavy-duty mobile games like PUBG, Mobile Legends, Asphalt and COD .etc. for long periods of time without facing any issues of latency. Previously, these games could not be played in even mid-range smartphones but with the integration of the G70 chipset - the same are supported with ease in a budget device. Besides, the gaming aspect, the Realme C3 also has other impressive features. It has a very strong battery which would last the users for hours at a time - this battery is capable of withstanding 5-6 hours of continuous gaming sessions without any issues. It is without a doubt - an extremely worthwhile purchase within the range of 10k. A consumer will be able to attain a long list of benefits through a small price with this device. ",
            "date": "Answered March 9, 2020",
            "views": "34",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rushikesh Bhingare",
                    "user_href": "/profile/Rushikesh-Bhingare-2"
                },
                {
                    "user_id": "Vijay Kumar",
                    "user_href": "/profile/Vijay-Kumar-8494"
                },
                {
                    "user_id": "Siva King",
                    "user_href": "/profile/Siva-King-22"
                },
                {
                    "user_id": "Techy Craft",
                    "user_href": "/profile/Techy-Craft"
                },
                {
                    "user_id": "John Bolton",
                    "user_href": "/profile/John-Bolton-12"
                },
                {
                    "user_id": "Kirti Garg",
                    "user_href": "/profile/Kirti-Garg-117"
                },
                {
                    "user_id": "Shiva Derangula",
                    "user_href": "/profile/Shiva-Derangula-1"
                },
                {
                    "user_id": "Akash Shiv",
                    "user_href": "/profile/Akash-Shiv-4"
                },
                {
                    "user_id": "Sriram",
                    "user_href": "/profile/Sriram-405"
                },
                {
                    "user_id": "Vihaan Kulkarni",
                    "user_href": "/profile/Vihaan-Kulkarni-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aarav Agarwal",
                "href": "/profile/Aarav-Agarwal-25"
            },
            "answer_text": "Setting up a budget for a phone is a tough job in itself and finding that phone is even tougher. Smartphones have become a major part of our everyday lives and it is next to impossible to live without it. We are highly dependent on our devices for the most minimal job too and we surely want our smartphones to keep up the pace, don’t we? Choosing a smartphone on the basis of our needs and requirements is easy but if our budget is in the affordable segment, we are usually expected to make compromises on some aspects of the smartphone. If you get this, you might not get that. However, times have changed. And it has changed for the good. If you now, scan through the smartphone markets you would realize that there are various options that are available for us in the budget friendly segment and you wouldn’t even have to compromise on anything. You get to stick to your budget while being able to experience every top-notch and high-end feature of the phone. I am someone who wouldn’t want to spend too much on a phone as I also like to change my smartphone after every few years, therefore I always try to stick to a budget and try not to spend too much on it. Coming to the question at importance here, the best smartphone to buy below 10K rupees. Well, I don’t really have to think too much here. As for me, the best budget buy smartphone right now would be the Realme Narzo 10A. Let’s look at a few feature and specification details of this phone before making a decision. First and Foremost, the Realme Narzo 10A has been priced at Rs.8,499 in India. A perfect fit to our budget. It launched in India on 12th May 2020 and the sale of the same will begin on 22nd May 2020.  It comes with a 6.52-inch touchscreen display with a resolution of 720 x 1600 pixels and an aspect ratio of 20:9. Realme Narzo 10A is powered by one of the most powerful chipsets; an octa-core MediaTek Helio G70 processor with 3GB of RAM. It runs Android 10 is powered by a massive 5000mAh battery. The Realme Narzo 10A runs Realme UI and packs 32GB of inbuilt storage which can also be further expanded. It is a dual-SIM smartphone that accepts Nano SIM and Nano-SIM cards. The phone is not too bulky or heavy. It measures 164.40 x 75.00 x 8.95mm and weighs just about 195grams, which is not bad for a budget friendly phone.  It comes with a 12-megapixel primary camera with an f/1.8 aperture; a second 2-megapixel camera with an f/2.4 aperture and a third 2-megapixel camera with an f/2.4 aperture on the rear. The rear camera also supports autofocus. On the front, it flaunts a 5-megapixel camera. There are two color variants available for this phone- So White and So Blue colors. Connectivity options include Wi-Fi, GPS, Bluetooth, USB OTG. A few sensors included on the device are ambient light sensor, compass/magnetometer, proximity sensor, fingerprint sensor, as well as face unlock. ",
            "date": "Answered May 22, 2020",
            "views": "25",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aniket Jit",
                    "user_href": "/profile/Aniket-Jit"
                },
                {
                    "user_id": "Siva King",
                    "user_href": "/profile/Siva-King-22"
                },
                {
                    "user_id": "Reyansh Madan",
                    "user_href": "/profile/Reyansh-Madan"
                },
                {
                    "user_id": "Jhunuk Borthakur",
                    "user_href": "/profile/Jhunuk-Borthakur"
                },
                {
                    "user_id": "Shaurya Sharma",
                    "user_href": "/profile/Shaurya-Sharma-206"
                },
                {
                    "user_id": "Ayush Nair",
                    "user_href": "/profile/Ayush-Nair-21"
                },
                {
                    "user_id": "Puneet Jain",
                    "user_href": "/profile/Puneet-Jain-597"
                },
                {
                    "user_id": "Prince Kaushik",
                    "user_href": "/profile/Prince-Kaushik-27"
                },
                {
                    "user_id": "Mehvish Asif",
                    "user_href": "/profile/Mehvish-Asif"
                },
                {
                    "user_id": "Uma Parvathy",
                    "user_href": "/profile/Uma-Parvathy-17"
                }
            ]
        }
    ]
}