{
    "title": "What is the difference between WiFi, Ethernet, and the Internet? - Quora",
    "tags": [
        "Ethernet",
        "Internet Connection",
        "Wireless Technology",
        "Wi-Fi",
        "Computer Networking"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott King Walker",
                "href": "/profile/Scott-King-Walker"
            },
            "answer_text": "If you read one answer in Computer Networking, make it this one. Understanding this probably solves half of the computer networking questions on Quora. WiFi is a specific technology for connecting devices wirelessly. It is a word play on “Hi-Fi”, which was short for High Fidelity (audio) back in the day. Ethernet is a specific technology for connecting devices over various types of wires and connectors. The most common forms use 8 twisted pairs of copper wire terminated in a RJ-45 jack that looks like a wide telephone jack. People refer to this as CAT5 or CAT6 wiring based on the specific standard that the wire meets. Most typically, these connections operate at 1Gbps (Gigabit Ethernet), with devices also supporting 100 Mbps (Fast Ethernet) and 10 Mbps (Ethernet) for backwards compatibility with older devices. There are also connections over fiber optic connections which can be Ethernet Over Fiber, or can be other standards. These are outside of the scope of this answer. The Internet is a world wide collection of connected computers and other devices that can (mostly) all talk to each other. Any computer or device that can access the majority of the public content on the Internet is said to be “on the Internet”. This connection can “always on” or “on demand”. You are still “on” the Internet even if your company, your country or your parent blocks access to specific sites. Your Internet connection is the specific technology and service that your Internet Service Provider uses to connect you to the Internet. Everyone has Internet Service Providers, even the largest Internet Service Providers. (The only difference is that that the very “top” they call each other “Peering Partners”.) The challenge, and the reason that this question was needed is that so many people confuse the technology used within their house that lets them reach the Internet with their connection to the Internet, or with the Internet itself. This leads to thousands of questions like “Why is my WiFi slow?” It could be, but it probably isn’t. You mean that your connection to the Internet, which you reach over WiFi is slow. ",
            "date": "Answered June 3, 2020",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Scott",
                "href": "/profile/Mark-Scott-410"
            },
            "answer_text": "Wifi and Ethernet are media. one uses radio waves and the other uses structured cables. The Internet is the largest network in the world and is a global network that allows businesses and the public access to information. The Internet is mainly made up of ethernet connectivity and can be accessed by any form of connection including ethernet and wifi. ",
            "date": "Answered June 3, 2020",
            "views": "50",
            "upvotes": "0"
        }
    ]
}