{
    "title": "What are the implements used in agriculture? - Quora",
    "tags": [
        "Farming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Allen",
                "href": "/profile/Bruce-Allen-53"
            },
            "answer_text": "Agriculture has a variety of implements and a variety of processes that are “required,” along with some that would be considered “best practices.” This answer discusses cereal grain production - wheat, as an example - though other crops may require other implements. Pre-seeding “best practices” may include using a tractor to pull a harrow or a plow to turn the soil, manage straw residue, and accomplish other goals. In order to cultivate any crop, modern farmers drive a tractor to pull a drill at seeding time. This drill will sow the seeds for the crop at the required depth, and it may lay fertilizer as well. Oftentimes, to manage weeds or other pests, farmers will use a tractor to pull a “sprayer” - which is basically a tank with boom arms that spray chemical on the crop. Some areas of the country also use crop dusters - planes that apply chemical from the air. A “combine” is a harvester. It’s called a combine because the machine combines the processes of reaping (cutting the stalks of the grain) and thrashing (freeing the grain from the stalks). The grain is stored in a tank on the combine, while the rest of the material is usually discarded at the back of the machine. After grain is harvested, some farmers will also use a “baler” to gather the discarded straw into bales, which can be sold or fed to livestock after collection. ",
            "date": "Answered October 6, 2017",
            "views": "640",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pandurang Ilager",
                    "user_href": "/profile/Pandurang-Ilager"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Shepherd",
                "href": "/profile/Jim-Shepherd-19"
            },
            "answer_text": "This question really requires you to look at the options your self such is the range of machinery available for the huge number of applications in farming. ",
            "date": "Answered April 25, 2020",
            "views": "16",
            "upvotes": "0"
        }
    ]
}