{
    "title": "What are the best hybrid mobile apps? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Satadru Saha",
                "href": "/profile/Satadru-Saha-2"
            },
            "answer_text": "Using hybrid mobile applications is a delightful experience. The are compatible across multiple mobile OS vendor. Apart from providing vital information they can be a great source of entertainment. Buy Local Deals and Savings Capable of providing accurate store information in your closest proximity Buy Local Deals and Savings is an useful app. You don’t need to hop stores. Simply enter the item of your choice and press the search button. This app will list relevant stores for you. It’s that easy. Near Me- Local Search and Places Are you desperately looking for a business or service in the neighborhood ? Near Me Local Search and Places can be your perfect assistant in the process. All you need to do is manually input the business you sought and the search radius. This app will show relevant business and stores in a split second. GPS travel route finder The utility of GPS Travel Route Finder is invaluable for a frequent traveler. With the integration of multiple features in a smooth and friendly interface you can find places of your choice on demand. This app comes with an altimeter, speedometer, and Near Me search options. mobixed - Android Apps on Google Play ",
            "date": "Answered April 19, 2017",
            "views": "71",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hasmukh Kakka",
                    "user_href": "/profile/Hasmukh-Kakka"
                },
                {
                    "user_id": "Logan Ewing",
                    "user_href": "/profile/Logan-Ewing"
                },
                {
                    "user_id": "Rebeca Anderson",
                    "user_href": "/profile/Rebeca-Anderson"
                },
                {
                    "user_id": "Sanchita Guha",
                    "user_href": "/profile/Sanchita-Guha-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dirk de Kok",
                "href": "/profile/Dirk-de-Kok"
            },
            "answer_text": "Facebook iOS app was HTML, back in 2012 (Here’s why the Facebook iOS app is so bad (UIWebViews and no Nitro)). They learned from it and moved on to purely native iOS. Netflix is purely native. I don't think there are any mobile apps that are beyond reasonable quality that are built with hybrid/html technology ",
            "date": "Answered May 27, 2015",
            "views": "101",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Govind Prajapat",
                    "user_href": "/profile/Govind-Prajapat-3"
                },
                {
                    "user_id": "Gopinath S",
                    "user_href": "/profile/Gopinath-S-4"
                },
                {
                    "user_id": "Rebeca Anderson",
                    "user_href": "/profile/Rebeca-Anderson"
                },
                {
                    "user_id": "Simon Luppescu",
                    "user_href": "/profile/Simon-Luppescu"
                },
                {
                    "user_id": "Thomas Lee",
                    "user_href": "/profile/Thomas-Lee-226"
                },
                {
                    "user_id": "Joanna Eldridge",
                    "user_href": "/profile/Joanna-Eldridge-1"
                },
                {
                    "user_id": "MC",
                    "user_href": "/profile/MC-403"
                },
                {
                    "user_id": "Tamjeed Ah",
                    "user_href": "/profile/Tamjeed-Ah"
                }
            ]
        }
    ]
}