{
    "title": "What is a microchip, and what is it used for? - Quora",
    "tags": [
        "Microchip Technology (company)",
        "Microchips",
        "Microcontrollers",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Geoff Field",
                "href": "/profile/Geoff-Field-2"
            },
            "answer_text": "When people use the term “microchip”, it usually refers to a small device used to identify something. Technically, it’s an RFID (Radio Frequency IDentification) device. There’s a small microcontroller on board, and a very small amount of analog hardware to receive and send signals. They have a small amount of stored data, which is almost always just a number or an identification string. Usually, there’s no energy storage and the device does absolutely nothing until it’s activated by a reader. The physical form varies. I’ve seen them as small pallets that can be injected under the skin (of an animal, usually), as disks on ear tags for cattle, etc, as small flat discs that can be attached to housings, as “blobs” that can be embedded in key fobs and other plastic devices, as credit-card form devices for opening doors, etc. To activate a microchip, a low-frequency field of about 125kHz is generated. This provides power to the microchip via transformer coupling and an activation code (modulated on the 125kHz). The microchip will wake up and, if it sees the activation code, will then send its stored data. The reader then looks at the data retrieved and determines whether it’s in the right format, after which it then does whatever it needs to do, such as unlocking a door, updating a database, etc. ",
            "date": "Answered October 12, 2020",
            "views": "877",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rony Salem",
                    "user_href": "/profile/Rony-Salem-2"
                }
            ]
        }
    ]
}