{
    "title": "What is the selection process of NIIT technologies? - Quora",
    "tags": [
        "Job Selection Process",
        "NIIT Technologies (company)",
        "NIIT (company)",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priyanka Arora",
                "href": "/profile/Priyanka-Arora-282"
            },
            "answer_text": "NIIT Technologies is an IT service provider company with multiple offices in Noida and Gurgaon. Though NIIT name is synonymous with the institute but apparently is among top 20 IT consultants in the world, which speaks volume about their presence in the market. NIIT process is pretty simply consisting of an online test, followed by a technical interview in their office. Here, we will talk about their 2018 interview process in detail, and how can you easily crack their interview. PROFILE: NIIT offers profile of Software Trainee with 3.20LPA CTC. They Offer 6 months of training with stipend of Rs 12K, but have a bond agreement of 3 years! Though NIIT has good reputation in the market, 3 years of bond agreement is a big commitment. Their interview process is quite basic, with shortlisting candidates on the basis of online test, followed by in-office technical interview on a defined day. ONLINE TEST: The test comprises of 2 sections. The first section is their aptitude questions followed by technical questions. Both are of extremely easy level with basic profit and loss, percentage, logical reasoning, c output questions. But next section is pretty interesting which is puzzle round. The missing pattern puzzles are asked and would have 8 options on which option would come in the question mark. DO practice this round on IndiaBix as finding pattern at that moment becomes little tiring and yup irritating too. But, here comes the catch, the platform NIIT uses is terrible, just because almost half of the people’s answer won’t be submitted there! It’s really frustrating that you gave a test for almost 2 hrs and your module wasn’t submitted, so make sure it is submitted because among 200 people there, 50 are shortlisted based on the test solely. INTERVIEW: NIIT Technologies interview is pretty easy and comparable to the mass companies. Basic OOPs, SQL, Project would be asked. You can determine how easy it is from the fact that among 50 who were shortlisted 48 were given offer letter! Communication Skills matter a lot to them, so be confident in that department too. -admin One stop portal for Engineering students (One stop portal for Engineering students) (Visit the website to stay updated regarding latest news in Engineering, India. ",
            "date": "Answered December 29, 2018",
            "views": "58",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hemant Soni",
                    "user_href": "/profile/Hemant-Soni-81"
                },
                {
                    "user_id": "Himanshu",
                    "user_href": "/profile/Himanshu-600"
                },
                {
                    "user_id": "Abhishek Joshi",
                    "user_href": "/profile/Abhishek-Joshi-643"
                },
                {
                    "user_id": "Sattwik Chakrabarti",
                    "user_href": "/profile/Sattwik-Chakrabarti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shankar Sesma",
                "href": "/profile/Shankar-Sesma"
            },
            "answer_text": "I appeared for NIIT tech off campus placement at Sviet Chandigarh and got selected. NIIT technology usually conducts 3 rounds to filter out the Candidates for the profile of software engineer. There was on the spot registration process for the drive on the basis of first come first serves. They entertained around 600 people and afterward stopped further registrations. Post registration, we gathered for small pre placement talk in Sviet auditorium where NIIT officials explained the job profile, role and salary bteakup etc. First round was offline MCQ based paper having aptitude, reasoning, English and few basic technical question which were easy to attempt. One thing I would like to jot down that cut off was much higher than I expected, they were selecting only few candidates and . All the qualified candidates got message for the second round (technical interview ) which was scheduled next day. Out of 600 candidates only 50 people were called for technical round and last round was HR round which didn't happen. Finally they selected 16 candidates and one group picture was taken of all the selected candidates with college director and company Officials. As annoucend by company official, I received joining mail after 3 days of drive and currently working as software developer in NIIT technology Gr Noida campus. ",
            "date": "Answered October 15, 2016",
            "views": "115",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sejal K",
                    "user_href": "/profile/Sejal-K-11"
                },
                {
                    "user_id": "Swapnil Srivastava",
                    "user_href": "/profile/Swapnil-Srivastava-96"
                },
                {
                    "user_id": "Ankita Thakur",
                    "user_href": "/profile/Ankita-Thakur-189"
                },
                {
                    "user_id": "Debabrata Kundu",
                    "user_href": "/profile/Debabrata-Kundu-5"
                },
                {
                    "user_id": "Kslubricans Kslubricans",
                    "user_href": "/profile/Kslubricans-Kslubricans"
                },
                {
                    "user_id": "राजवर्धन सिंह रावत",
                    "user_href": "/profile/राजवर्धन-सिंह-रावत"
                },
                {
                    "user_id": "Vishal Yadav",
                    "user_href": "/profile/Vishal-Yadav-1102"
                },
                {
                    "user_id": "Arshad Khan",
                    "user_href": "/profile/Arshad-Khan-1983"
                },
                {
                    "user_id": "Yatin Chugh",
                    "user_href": "/profile/Yatin-Chugh"
                },
                {
                    "user_id": "Amit Rajput",
                    "user_href": "/profile/Amit-Rajput-404"
                }
            ]
        }
    ]
}