{
    "title": "What kind of battery is used in a Tesla? - Quora",
    "tags": [
        "Tesla Roadster",
        "Electronic Batteries",
        "Classification Question",
        "Batteries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ranjan Riva",
                "href": "/profile/Ranjan-Riva"
            },
            "answer_text": "The batteries that Tesla has been using, sourced from Panasonic, for its Model S electric car are mostly likely a lithium-ion battery with a cathode that is a combination of a lithium, nickel, cobalt, aluminum oxide. The battery industry calls this an “NCA battery” and they’ve been around—and made by Panasonic—for many years. Typically, lithium-ion NCA batteries use a combination of 80% nickel, 15% cobalt and 5% aluminum. It’s unclear what mix Tesla and Panasonic’s battery combination is. (The anodes in these traditional lithium-ion batteries is usually a graphite combination, which acts as a host for the lithium ions.) The addition of the aluminum to the NCA battery makes it more stable. Tesla CEO Elon Musk said on the company’s earnings call that Tesla will be using a high energy lithium-ion NCA battery for its new grid battery. Similar to the one it uses in its cars, the grid battery is intended for use by utility companies for back-up power. These are the batteries that, when used in a big battery “farm,” could replace so-called peaker power plants, the “dirty” and expensive power plants that utilities use only when grid demand peaks, such as during a sweltering summer afternoon. (The Tesla website describes this as the back-up battery with a capacity of 10 kilowatt-hours and a price of $3,500.) In contrast, Musk said that Tesla will use a lithium-ion battery with a nickel, manganese, cobalt oxide cathode for its grid battery. Called an NMC battery, it’s meant to be used for daily cycling for a home, business, or certain types of clean power. “There’s quite a lot of manganese in there,” Musk said. (The Tesla website specs for this battery are 7 kWh battery for $3,000.) Many traditional NMC batteries use one-third equal parts nickel, manganese, and cobalt. Again, it’s unclear what the combination of Panasonic and Tesla’s version is.  Construction of the Tesla Gigafactory outside Reno, Nevada is shown February 18, 2015 ",
            "date": "Answered December 15, 2015",
            "views": "327",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Greenberg",
                    "user_href": "/profile/Michael-Greenberg-61"
                },
                {
                    "user_id": "Mark Dawson",
                    "user_href": "/profile/Mark-Dawson-170"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Renegade-Sheep"
                },
                {
                    "user_id": "Stefano Nesso",
                    "user_href": "/profile/Stefano-Nesso"
                },
                {
                    "user_id": "Mit Galani",
                    "user_href": "/profile/Mit-Galani"
                },
                {
                    "user_id": "Jente Zijlstra",
                    "user_href": "/profile/Jente-Zijlstra"
                },
                {
                    "user_id": "AISWARYA JOESPH",
                    "user_href": "/profile/AISWARYA-JOESPH"
                },
                {
                    "user_id": "Gianni Stovall",
                    "user_href": "/profile/Gianni-Stovall-1"
                },
                {
                    "user_id": "Blake Hendrix",
                    "user_href": "/profile/Blake-Hendrix-1"
                },
                {
                    "user_id": "KyuJung Jun",
                    "user_href": "/profile/KyuJung-Jun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Taylor",
                "href": "/profile/Jason-Taylor-16"
            },
            "answer_text": "Seems like a super popular and trivial question. However, I wasn’t easily able to get any clear answers. I saw three nearly identical unanswered questions here on quora, which I just merged together. So, I will report what little I found. Hopefully, someone else will chime in with something better. Most searches usually pointed to pages discussing packaging details, not chemistry details. Even the name of the package of newer, Model 3, cells seems unclear: 21700 and/or 21-70. Anyway, these are small cells, a few inches or so long. Each car has many. About the chemistry, my guess based on the conductivity to weight ratio of aluminum is nickel cobalt aluminum (NCA) chemistry, perhaps Lithium Nickel Cobalt Aluminium Oxide, LiNiCoAlO₂. If so, that’s 80% Nickel, 15% Cobalt, 5% Aluminum. According to JP, the older cells were similar to Panasonic 18650Bs. The 18650As have a rated mass energy density of 0.225 watt-hours/gram=225 Wh/Kg. A pack will have a lower mass energy density because it needs connecting and controlling wiring. According to a Tesla earnings call, “Cells used in Model 3 are the highest energy density cells used in any electric vehicle. We have achieved this by significantly reducing cobalt content per battery pack while increasing nickel content and still maintaining superior thermal stability. The cobalt content of our Nickel-Cobalt-Aluminum cathode chemistry is already lower than next-generation cathodes that will be made by other cell producers with a Nickel-Manganese-Cobalt ratio of 8:1:1.” According to Tesla’s CTO, J.B Straubel, “And when we went from the Roadster to the Model S, they have improved by about 40% and when we were designing the Model 3, they were about another 30% better.” This site lists a 207 Wh/kg pack for the Model S. Taken together, this implies a ~0.27 Wh/g pack on a Model 3, which exceeds what is possible from buying Panasonic 186650As even if the wiring harness had zero weight. According to TheScienceDude, the “anode is made out of graphite powder with intercalates li-ions (it[‘]s black for obvious reasons), the cathode is made of LiNiCoAlO (no stoichmetry for lazyness) it's also black. The salt that's used in the tesla cells will in all probability be LiPF6, maybe with the additon of LiBOB (Lithium Bisoxalatoborate) for performance improvement.”  Be aware that there are some errors in this video. So far, the maker received 840 downvotes. I appreciated his work even so, so I upvoted his video and hope you do the same. Support independent research! Anyway, I would not be surprised if you cannot easily purchase the same exact cells actually used in Tesla cars, and the companies involved might be under non-disclosure (trade secret) agreements, especially for the Model 3, a teardown of which is here. EDIT: Since I wrote this answer, a video was published that does a great job of answering this question:  ‘ The main difference in our answers is that this video says are three different chemistries, with the newer ones having silicon in addition to replacing aluminum for some heavier elements like cobalt. ",
            "date": "Updated August 4, 2018",
            "views": "24",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sadanand J",
                    "user_href": "/profile/Sadanand-J"
                },
                {
                    "user_id": "Lloyd Selden",
                    "user_href": "/profile/Lloyd-Selden"
                },
                {
                    "user_id": "Sri Siva",
                    "user_href": "/profile/Sri-Siva-30"
                },
                {
                    "user_id": "Ihan Rab",
                    "user_href": "/profile/Ihan-Rab"
                },
                {
                    "user_id": "Antonio Fusco",
                    "user_href": "/profile/Antonio-Fusco-3"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                },
                {
                    "user_id": "David David",
                    "user_href": "/profile/David-David-478"
                },
                {
                    "user_id": "Umair Ali",
                    "user_href": "/profile/Umair-Ali-66"
                },
                {
                    "user_id": "Tirth Meghani",
                    "user_href": "/profile/Tirth-Meghani-1"
                },
                {
                    "user_id": "David Richards",
                    "user_href": "/profile/David-Richards-239"
                }
            ]
        }
    ]
}