{
    "title": "What are the alternatives to planned obsolescence? - Quora",
    "tags": [
        "Planned Obsolescence",
        "Industrial Design",
        "Energy Efficiency",
        "Product Design of Physical Goods",
        "Sustainability",
        "Business Models",
        "Environmentalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Ryan",
                "href": "/profile/John-Ryan-3"
            },
            "answer_text": "I think the obvious alternative to planned obsolescence is to build your brand image on quality.  Generally this approach has worked for companies like Toyota (until lately that is).  Toyota products typically last longer than competitor vehicles, get better gas mileage, and have fewer mechanical issues.  Miraculously they also seem to be cheaper (hmm...). But the point is that Toyota markets their product as a higher quality product which allows them to rely less on planned obsolescence to generate sales revenues.  Planned obsolescence is simply a niche that others have chosen to fill (in this case, the Big 3 automakers in the U.S).  Honestly though they wouldn't necessarily need to employ such techniques if they simply streamlined their operations more and outsourced their incompetentcies.  They are finding this out in the modern global economy and Ford seems to be headed in the right direction.  Really it was planned obsolescence, along with a failure to heed the coming global economy that allowed foreign automakers to overtake the U.S..   So it can definitely be done.  It's a strategic decision that most firms will have difficulty transitioning from unless they make wholesale changes. ",
            "date": "Answered February 12, 2011",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Natalia Romano",
                    "user_href": "/profile/Natalia-Romano"
                },
                {
                    "user_id": "Andrew J. Young",
                    "user_href": "/profile/Andrew-J.-Young"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhinav Jain",
                "href": "/profile/Abhinav-Jain-6"
            },
            "answer_text": "Planned obsolescence is the concept that a product should be designed and produced with the knowledge that it will only be popular, useful and functional for a limited length of time.  The term planned obsolescence was popularized in the 1950s by industrial designer Brooks Stevens, who proposed that corporations should think about a product's entire lifecycle during the design phase and anticipate the consumer's natural desire to continually own something a little newer and a little better. Stevens proposed that an iterative approach to product design would not only help keep production costs down, it would also inspire the consumer to make a purchase a little sooner than might be absolutely necessary, which in turn, would keep the economy growing and create a secondary market for used products. Over the years, critics have blamed the concept of planned obsolescence for everything from poor product quality to the creation of a disposable society that no longer knows what it's like to live in a world where products were \"built to last.\" Proponents of planned obsolescence point out that technology is changing very quickly and it is simply common sense for manufacturers to acknowledge the end of a product's lifecycle and plan ahead for it.  In the computer industry, where iterative software and hardware releases cause obsolescence to occur much faster than in other industry sectors, failure to plan for obsolescence is a real concern. In many data centers, where refresh cycles occur every three years and e-waste disposal is legislated, hardware must be discarded in an environmentally responsible way. It is still developing and many alternatives are yet to be discovered and work is in progress.         ",
            "date": "Answered March 25, 2016",
            "views": "581",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mikaela James",
                    "user_href": "/profile/Mikaela-James"
                }
            ]
        }
    ]
}