{
    "title": "What is the best way to learn to do financial modelling? - Quora",
    "tags": [
        "Financial Modeling",
        "Beginning Computer Programming Advice",
        "Learning New Things",
        "Learning",
        "Learning to Program"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Lynch",
                "href": "/profile/Peter-Lynch-4"
            },
            "answer_text": "I would suggest starting with Learn Financial Modeling | ASimpleModel: it is a free resource that provides video-driven material with notes and templates available for download. Work through all of the exercises and build the models yourself. It may seem like this takes too much time, but you will not learn this skill set without taking the time to struggle through the process yourself. (For more on efficient learning techniques as it relates to financial modeling: On Learning: Knowledge I Wish I Had in College) From there I would move on to http://www.Macabacus.com: the material on this site is more advanced, and provides some instruction as well. If you make it through the instructional material on both, try downloading SEC filings and building your own model. The process will expose what you need to revisit. All the while, use sites like Investopedia - Educating the world about finance to stay on top of new vocabulary. Any time you do not understand a line item in your model or a new term, stop to look it up. I wrote an answer on why this is critical: Why does finance seem so hard? Also, if you are interested in pursuing a career in investment banking, I like to advise reading Investment Banking: Valuation, Leveraged Buyouts, and Mergers & Acquisitions. In addition to covering the various aspects of valuation and modeling, the text also covers the process of moving through a transaction and describes the documents required. All of the content mentioned above is free with the exception of the book, which costs ~$50. As for my background, I started in banking (~3.5 years) and have been in private equity for the last 8+ years. I built ASimpleModel to show that while some models can be complex, most are simple - they all have varying degrees of detail, but the mechanics are generally the same for standard models (integrated, DCF, LBO). In any interview process the model required is also likely to be pretty basic. I pasted a few additional resources below. Free Resources: Learn Financial Modeling | ASimpleModelMacabacus.comNYU Stern Prof. Aswath DamodaranBooks: Financial Modeling and Valuation: A Practical Guide to Investment Banking and Private EquityFinancial ModelingInvestment Banking: Valuation, Leveraged Buyouts, and Mergers & AcquisitionsPaid Programs: Breaking Into Wall StreetTraining the StreetWall Street Prep",
            "date": "Updated March 20, 2017",
            "views": "16",
            "upvotes": " View 110 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Claire Serafina",
                    "user_href": "/profile/Claire-Serafina"
                },
                {
                    "user_id": "Emilio Mengual",
                    "user_href": "/profile/Emilio-Mengual"
                },
                {
                    "user_id": "Deepak Sharma",
                    "user_href": "/profile/Deepak-Sharma-9080"
                },
                {
                    "user_id": "Faisal Naseem",
                    "user_href": "/profile/Faisal-Naseem-2"
                },
                {
                    "user_id": "Srinagesh Katuri",
                    "user_href": "/profile/Srinagesh-Katuri-1"
                },
                {
                    "user_id": "Tanish Bansal",
                    "user_href": "/profile/Tanish-Bansal-30"
                },
                {
                    "user_id": "Sandeep Bommisetty",
                    "user_href": "/profile/Sandeep-Bommisetty-2"
                },
                {
                    "user_id": "Tenzin Lhakpa S",
                    "user_href": "/profile/Tenzin-Lhakpa-S"
                },
                {
                    "user_id": "Radhika Malani",
                    "user_href": "/profile/Radhika-Malani"
                },
                {
                    "user_id": "Shubhankar Jaiswal",
                    "user_href": "/profile/Shubhankar-Jaiswal"
                }
            ]
        }
    ]
}