{
    "title": "What are the disadvantages of technology and science? - Quora",
    "tags": [
        "Disadvantage",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jorge Garcia",
                "href": "/profile/Jorge-Garcia-76"
            },
            "answer_text": "I would break down the negative (i.e. harmful) side effects of science and technology into two types: 1) due to misusing, 2) due to misunderstanding. Due to misusing can be further broken down into two groups: a) intentional; b) unintentional. So now some examples: 1.a (intentional misuse) - I would place all mass killing weapons in this category. (I personally consider individual killing weapons (firearms and edge weapons) to be ok, as they can be justified for self defense and food procurement). 1.2 (unintentional misuse) - this category covers your run-off-the-mill harmful “side effects” like pollution, encroachment on natural habitats (i.e. effects harmful not directly to us humans but to other inhabitants of the planet) physical and mental atrophy from over reliance on our tools (things like weaker bodies thanks to vehicles, weaker memories thanks to Google, and so forth…) 2. (Misunderstanding). This one is trickier. I have always struggled with the fact that I intuitively know Untruth to be bad, but do not intuitively know why. Nevertheless, this is my answer. Science and technology are harmful insofar as we incorrectly believe them to be something they are not. And what they are not is: cure-alls (specifically, evil cannot be engineered out of the world); or alternatives philosophy/religion (specifically, science canot explain existence nor provide us with purpose) ",
            "date": "Answered August 5, 2018",
            "views": "55",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmanuella Kitcher",
                    "user_href": "/profile/Emmanuella-Kitcher"
                },
                {
                    "user_id": "M. Vincent Holguin",
                    "user_href": "/profile/M-Vincent-Holguin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Prabhu",
                "href": "/profile/Pranav-Prabhu-15"
            },
            "answer_text": " The war equipment that was produced by military scientists had several negative effects on the society. Many soldiers lost their lives during this war. In addition, some of them sustained serious injuries after being attacked by tanks. Statistics from World War I reveal that around 117, 465 casualties were reported (Ross 107). Some soldiers who returned from this war developed a posttraumatic stress disorder. Some of them started having nightmares and sleepless nights after remembering how their fellow soldiers died during battle. Science and technology have brought harmful effects to society since it was used to manufacture war equipments during the World War II. Nazi scientist invented RocketV-1, buzz bomb, during the World War II. This aircraft was categorized as a guided missile and the Nazi mainly used it in 1944-1945 (Ross 81). The science and technology that was used in World War II had several negative effects to society. The economy of Japan deteriorated. This is because the atomic bomb destroyed its infrastructure. World War II also affected the Soviet Union. About 40 million people lost their lives due this war (Bishop 71). Germany used its advance weapons to kill civilians in the Soviet Union. Scientists also use advancements in science and technology to conduct human experimentation. Such experiments are harmful to human beings since they may have negative effects to the growth and development of people under study. One of the famous human experimentations was known as the monster study (McCuen 64). Negative Effects of Science and Technology ",
            "date": "Updated August 28, 2018",
            "views": "67",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicholas Hamner",
                    "user_href": "/profile/Nicholas-Hamner-1"
                },
                {
                    "user_id": "Shubhankar Rai",
                    "user_href": "/profile/Shubhankar-Rai-4"
                }
            ]
        }
    ]
}