{
    "title": "What is the gpu used for? - Quora",
    "tags": [
        "Graphics Processing Unit",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gaurav Tomar",
                "href": "/profile/Gaurav-Tomar-109"
            },
            "answer_text": "GPU stands for Graphics Processing Unit. Every thing that you see on your monitor is graphics but that doesn’t mean GPU is used to display it. Most of the simple style OS graphics are displayed with the help of the processor itself(I am not saying the processor’s integrated GPU). But some animations and other effects of the OS become too heavy for the CPU to handle thus companies like intel and amd manufacture a integrated GPU inside their CPUs. This GPU is not very strong but it gets the basic task done like the Windows Glass in Windows 7. But if you want to know what a dedicated GPU is, then it is a GPU which is dedicated to do very heavy graphics related tasks. Like video editing, playing games on high settings etc. If you don’t wanna do a lot of graphics work than don’t buy the dedicated GPU. But if you are a Gamer like me then don’t hustle and buy any GPU. Buy one that suits your need. Get more knowledge by searching internet. Watch videos on YouTube. I would say watch Linus Tech Tips on youtube. He is a big shot when it comes to computers. If you need anything else just ask I can help you because I free and not have anything to do LOL. ",
            "date": "Answered March 18, 2019",
            "views": "597",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raj Sampat",
                "href": "/profile/Raj-Sampat-1"
            },
            "answer_text": "A GPU, or graphics processing unit, is used primarily for 3D applications. It is a single-chip processor that creates lighting effects and transforms objects every time a 3D scene is redrawn. These are mathematically-intensive tasks, which otherwise, would put quite a strain on the CPU. ",
            "date": "Answered March 18, 2019",
            "views": "306",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shilpa Kour",
                "href": "/profile/Shilpa-Kour-2"
            },
            "answer_text": "A GPU, or graphics processing unit, is used primarily for 3D applications. It is a single-chip processor that creates lighting effects and transforms objects every time a 3D scene is redrawn. These are mathematically-intensive tasks, which otherwise, would put quite a strain on the CPU ",
            "date": "Answered March 18, 2019",
            "views": "142",
            "upvotes": "0"
        }
    ]
}