{
    "title": "What is a good source for information on batteries? - Quora",
    "tags": [
        "Power Electronics",
        "Electrical and Electronics Engineering",
        "Batteries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barek Hunt",
                "href": "/profile/Barek-Hunt"
            },
            "answer_text": "Another option is to search Battery companies on the internet.  They are always trying to make current content, so they are regularly posting blogs of battery technology. Take for instance a couple of these: Crown Battery | Resources   This week in batteries (TWiB)  Guilty As Charged Blog  There are many more than that you will find that even link to one another.  A great deal of useful information.  With Crown Battery, you can submit your email and they will send you additional information.  Then you can even ask for specific questions. Hope this helps.  ",
            "date": "Answered February 4, 2016",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "R. Bhargavi",
                "href": "/profile/R-Bhargavi"
            },
            "answer_text": "Books you might find interesting: Battery Technology Handbook, Kiehne, 2003Understanding Batteries, Dell and Rand, 2001Electric Vehicle Battery Systems, Dhameja, 2002; to name a few. Although batteries might be briefly discussed in your undergrad course, their construction, operation, and design specifics are generally a part of electrochemistry if I'm not wrong. The Battery Technology Handbook (Kiehne, 2003) also discusses power systems and technical aspects involved that are related to what you'll be studying in electrical engineering. ",
            "date": "Answered January 24, 2015",
            "views": "234",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Xavier Anderson",
                    "user_href": "/profile/Xavier-Anderson"
                }
            ]
        }
    ]
}