{
    "title": "What is software technology? - Quora",
    "tags": [
        "Software Technology",
        "Software Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shweta Thapa",
                "href": "/profile/Shweta-Thapa-14"
            },
            "answer_text": "Software Technology is a specialization offered by the Master’s programme in Computer Science at the University of Twente. If you are fascinated by the development of high-end software without any restrictions as to the application domain, then this programme is for you. Also have a look at the experiences of Ruxandra, one of our students. WHAT IS SOFTWARE TECHNOLOGY? High-end reliable software development requires a thorough understanding of polished design, programming, and validation skills, and a comprehensive working knowledge of the different phases of software engineering. Aside from these tough requirements, every domain of application has its own special features, languages and techniques. The Software Technology specialization offers a combination of courses that cover all of the aspects listed above. As a graduate, you will be an expert in state-of-the-art technologies and software engineering phases. You will also have specialist insight in the application domain of your choice. In addition to your individual graduation project, you will carry out a team-based project focusing on a real-life industrial problem. Throughout the programme, you will gain theoretical knowledge and practical skills that will make you a real value adder in developing a broad and diverse range of software products and uses. SOFTWARE TECHNOLOGY AT THE UNIVERSITY OF TWENTE The Software Technology specialization is closely linked to the Formal Methods & Tools research group, which is part of the UT’s Digital Society Institute. The Digital Society Institute is one of the largest IT research institutes in the Netherlands. The Computer Science research recently received an excellent evaluation for both its quality and relevance. We apply the UT’s ‘High Tech Human Touch’ approach to designing IT technology for a smarter society. We investigate the design of reliable and secure software systems, with a keen eye for human interaction and social, ethical and business perspectives. PROGRAMME AND COURSE DESCRIPTIONS To help you gain professional experience, the Software Technology specialization offers internship opportunities at high-profile companies. Alternatively, we support research internships at any reputable university worldwide. And of course, you are welcome to conduct your research in our own lab. Go to the courses overview to find out which courses are offered within the Software Technology specialization of the Computer Science Master's programme (note: this overview shows the courses for the academic year 2017 - 2018). CAREER OPPORTUNITIES Software is present in all kinds of application areas nowadays, ranging from computer applications, web services and information systems to the automotive or consumer electronics sector. With a Master’s degree in Computer Science and a specialization in Software Technology you will be able to find employment as a software developer, consultant, or verification engineer in a software-intensive company. Another option is to become a researcher at the university or an industrial research centre. You might also follow your entrepreneurial spirit and start a company of your own, bringing your own state-of-the-art software solutions to the market. ",
            "date": "Answered August 20, 2018",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manjay Kumar",
                    "user_href": "/profile/Manjay-Kumar-281"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nihal Ansari",
                "href": "/profile/Nihal-Ansari-6"
            },
            "answer_text": "software technology A general term covering the development methods, programming languages, and tools to support them that may be used in the development of software. software technology.\" JOHN DAINTITH. \" software technology.\" Nihal Ansari[1] Footnotes[1] Nihal Ansari Present : Best SEO Service In India",
            "date": "Answered July 17, 2016",
            "views": "21",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sachin K S Sachin.",
                    "user_href": "/profile/Sachin-K-S-Sachin-1"
                },
                {
                    "user_id": "Adnan Zaman",
                    "user_href": "/profile/Adnan-Zaman-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/24x7-Service"
                },
                {
                    "user_id": "Urvasi Agarwal",
                    "user_href": "/profile/Urvasi-Agarwal"
                },
                {
                    "user_id": "Manaswini Naramsetty",
                    "user_href": "/profile/Manaswini-Naramsetty"
                }
            ]
        }
    ]
}