{
    "title": "What would the world look like if everyone drove electric powered vehicles? Wouldn't we be faced with a host of new issues such as battery disposal, energy shortages, and infrastructure problems? - Quora",
    "tags": [
        "Battery Electric Vehicles (BEV)",
        "Electric Vehicles",
        "Electric Cars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hugh Rice Kelly",
                "href": "/profile/Hugh-Rice-Kelly"
            },
            "answer_text": "These fears are unfounded, I believe. Adoption of electric vehicles will be spread over a period of 10 to 20 years. Many people will prefer gas or diesel vehicles for a long time, and simply waiting for the existing vehicles to wear out will take 10 years or so. A transition period of this length alone will provide enough time for solutions to the problems you mention to be worked out.Battery disposal is an open question. Batteries too depleted for automotive use may still be usable in storage applications, for example. Also, it is possible that dead lithium ion batteries may have value in recycling. During the long transition period, some reasonable solution will likely be found to resolve whatever battery disposal challenges arise. It should also be borne in mind that automotive grade lithium ion batteries have already demonstrated that they are likely to remain in service for the life of the car, and will not require periodic replacement on a routine basis.Energy shortages and electric infrastructure problems are unlikely, because most electric vehicles are charged at night. This means electric utilities will be able to utilize the generation, transmission, and distribution assets they already have, but are not used much at night when the lights are out, the air conditioning is not running as hard, appliances are not in use, etc. What is now idle capacity will find a great new market charging electric cars at night. Just to illustrate the issue, in Texas we have a lot of wind-powered electricity. The central state dispatching authority selects the cheapest power available and orders it delivered into the grid. For a dozen or more times during the year when the weather statewide is cool but not cold, this means that there is such a surplus of wind power that the energy component of electricity actually drops to zero, leaving only the 4 cents or so to be paid to cover fixed charges for wires and other utility hardware. For consumers with market price rates, the results are great now— but in the future when electric cars are sucking power in the middle of the night, these bargains will be gone, the power instead being sold to charge automobile batteries.There will be some increase in daytime generation, of course. But with increased electric load being added gradually over 10 to 20 years, adding generation, transmission and distribution would be well within the extension-of-service capability of utilities. I suspect also that future high speed direct current charging facilities, such as Tesla Superchargers, will produce some of their own power on site using solar panels coupled with high capacity storage batteries.",
            "date": "Answered March 14, 2018",
            "views": "172",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Daviel",
                "href": "/profile/Andrew-Daviel"
            },
            "answer_text": "It's difficult to make predictions, especially about the future. Re. energy shortages, I crunched some numbers for the UK. If every single car was instantly replaced with an EV, and they all charged at exactly the same time when demand is already at a peak, there would be a 10% power shortfall. If they randomly charged at night, the existing system would not notice. Smart electricity meters have the potential to make that happen by offering owners preferential rates. The existing residential distribution structure might not be able to handle the load and some homes would have to be upgraded; the same was true when electric dryers were introduced. Besides, there are no magic wands and it’s physically impossible to instantly replace every car. Even if all new cars sold were EVs (also impossible without a big ramp-up in manufacturing capacity), it would take decades to replace all gas-powered cars. What would it look like if everyone drove electric ? All the urban gas stations would be quickly reclaimed for their real-estate value (it’s already happening in some cities). All homes and residential parking structures would have a charging outlet per every other stall. Multi-family housing would use ganged stations to limit the instantaneous power demand (those exist already). People would stop worrying about the price of gas or whether they had time to buy gas on their way to work and just plug in their car at night along with their phone and electric toothbrush. The car might even do it itself (there are already inductive chargers where you just have to park in the right spot). We’d see some innovation for those with only on-street parking, such as lamp-post outlets. Or maybe such cars would just be banned outright, as in Tokyo (you cannot buy a car without a parking spot), forcing people to use a car-sharing service (popular already in Vancouver). Gas stations along the highway that sold only gas and candy would disappear. Places like UK motorway service stations, that offer dining, toilets and shops along with fuel would include ranks of fast chargers where people could recharge while eating. Motels would offer charging to stay competitive, as they now offer WiFi and satellite TV. We might see adoption of car-to-grid technology - selling the energy stored in cars back to the electric grid as a load balancing technique. That already exists, but I’m not sure whether it will ever be economically viable. The urban smog would disappear from cities like London, Beijing and even Vancouver (I can see it from out at sea). Less people would die from respiratory disease (2 million in 2015). ",
            "date": "Answered March 14, 2018",
            "views": "671",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darren Talbot",
                    "user_href": "/profile/Darren-Talbot-5"
                },
                {
                    "user_id": "Prakash Rethe",
                    "user_href": "/profile/Prakash-Rethe"
                },
                {
                    "user_id": "William Rogers",
                    "user_href": "/profile/William-Rogers-12"
                },
                {
                    "user_id": "Kirill Kudriavtsev",
                    "user_href": "/profile/Kirill-Kudriavtsev"
                },
                {
                    "user_id": "Mark Hewis",
                    "user_href": "/profile/Mark-Hewis"
                },
                {
                    "user_id": "Arthur Stepanyan",
                    "user_href": "/profile/Arthur-Stepanyan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiki Jewell",
                "href": "/profile/Kiki-Jewell"
            },
            "answer_text": "Some one-to-one comparisons: Fuel: electricity is used in fuel production. So often electric cars are compared to gas cars as if the gas magically appears at the gas station. By some (unverified?) accounts, it’s about 7.5kWh/gallon to process gasoline. Our Leaf gets about 4.1mi/kWh, so 7.5kWh, so that’s about 30mi on the electricity used to process gas — but without the gas! So in short, switching from gas to electricity will cause no change in electric use. I always point out: “if gas is better than electricity, why not run your house on a generator? For all the reasons not, same for cars.” So EVs win there. Battery: Elon Musk said once in an interview that Tesla batteries are so nontoxic you could grind one up and and eat it. (Trying to find a reference…) Lithium Ion is not lead-acid, and doesn’t contain the same level of toxic ingredients, that older battery chemistries do. There are new methods of mining lithium from the ocean. The Gigafactory has plans to recycle Tesla battery packs. Their construction is very simple, so this should be easy. Already there are companies reusing EV batteries, repurposing them to extend their useful life. I put the battery replacement on par with transmission replacement — it’s expensive, and happens sometimes, and taking care of it will extend it’s life; being abusive/ignorant will shorten its life. Today, they are expensive, however, this cost is dropping every year, so by the time we need to replace batteries in our cars, they will be much cheaper — and better. So EVs win there too. Motor: unlike a gas motor, electric motors rarely need maintenance. So this will have a dramatic overall reduction in replaced parts that get thrown away. I have a friend who rebuilds electric cars, and I’ve been shocked — shocked — by how amazingly resilient EVs are to crashes. I saw a wrecked Kia Soul EV that had been smashed right up to the windshield. The BMS (battery management system) was lying open, with the 1/2″ thick aluminum case shattered at the bolts that held it to the frame of the car. All the components still worked! An equivalent gas car wreck would have been unfixable. EVs need far fewer parts replacement. Fluids: unlike gas cars, electric cars need no fluids — no oil, no transmission fluid. This will be a great benefit to petroleum waste. And since dumping oil down the drain is a common issue, this will make a big difference there too. Don’t need to point out they don’t need gas, and there’s nothing to smell or touch when plugging in a car. And home plugs are touched only by you. EVs win again: feels good driving by the oil change store…forever. Brakes: EVs use regenerative braking, and so use brake pads far far less than gas — braking doesn’t put gas back into the tank, like for EVs! We never replaced our brake pads on our Prius, for instance, and we owned that for 10 years. Because the induction motor requires movement to generate the magnetic field, Teslas use their brakes more than some other EVs. The Bolt has “one pedal driving” where you don’t use the brake at all! On an incline, it will engage the parking brake, then disengage it seamlessly when you drive away! EVs rarely need brake pad replacement. Tires: this is where EVs fare worse. Because of the massive torque (even in my wimply 80kW Leaf, and 150kW Bolt), EVs tend to wear tires out more than gas cars. I kinda freaked out the first time I noticed our Leaf’s front tires were almost bald! (Yeah, ok, I have “fun” driving that car!) The torque is instant, no ramp up. Goodyear has designed a new brand of tire specifically for the high torque issues of driving an EV. EVs wear out tires more. And as for torque, I have to say that you have no idea how much a gas car lags until you have driven with “speed-of-light” response! Wow, do EVs just *leap* when you touch the accelerator pedal!! When I’ve gone back to a gas car, you can literally *feel* the lag of the fuel pushing through the lines, the wait for the next piston to come to the top, and the slow speed of injecting the fuel into the cylinder, then the time it takes to fire and expand. Driving a gas car is like riding on the back of a galloping, huffing and snorting bison. Riding in an electric car is like sitting in the cockpit of a high-end jet…or a rocket. Rollercoasters use electric motors because they accelerate so fast. Yeah, they’re just like that feeling — silent and continuous acceleration, while you ride, mouth open and breathless. Any time someone online has said they prefer gas cars, I ask if they’ve *actually* test driven a Tesla — or any EV. This usually shuts them up. :) Because of course they haven’t. If they had, they would be a convert. ",
            "date": "Answered March 13, 2018",
            "views": "58",
            "upvotes": " View 56 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Le Hoang Anh",
                    "user_href": "/profile/Le-Hoang-Anh-1"
                },
                {
                    "user_id": "Jaya Subin",
                    "user_href": "/profile/Jaya-Subin"
                },
                {
                    "user_id": "David van Zijl",
                    "user_href": "/profile/David-van-Zijl"
                },
                {
                    "user_id": "Charles Miranda",
                    "user_href": "/profile/Charles-Miranda-3"
                },
                {
                    "user_id": "Kjetil Torgrim Homme",
                    "user_href": "/profile/Kjetil-Torgrim-Homme"
                },
                {
                    "user_id": "Barclay Kirk",
                    "user_href": "/profile/Barclay-Kirk-1"
                },
                {
                    "user_id": "Miroslav Bujna",
                    "user_href": "/profile/Miroslav-Bujna"
                },
                {
                    "user_id": "Prakash Rethe",
                    "user_href": "/profile/Prakash-Rethe"
                },
                {
                    "user_id": "Bian Cheng Shi Meng",
                    "user_href": "/profile/Bian-Cheng-Shi-Meng"
                },
                {
                    "user_id": "Peter Beckman",
                    "user_href": "/profile/Peter-Beckman-3"
                },
                {
                    "user_id": "Glen Hillier",
                    "user_href": "/profile/Glen-Hillier"
                },
                {
                    "user_id": "Roch Nickols",
                    "user_href": "/profile/Roch-Nickols"
                },
                {
                    "user_id": "Bill Woodcock",
                    "user_href": "/profile/Bill-Woodcock-3"
                },
                {
                    "user_id": "Hans Mulders",
                    "user_href": "/profile/Hans-Mulders-1"
                },
                {
                    "user_id": "Brian Wolfsohn",
                    "user_href": "/profile/Brian-Wolfsohn"
                },
                {
                    "user_id": "Jacob Perez",
                    "user_href": "/profile/Jacob-Perez-14"
                },
                {
                    "user_id": "Seth Schaffer",
                    "user_href": "/profile/Seth-Schaffer"
                },
                {
                    "user_id": "Andrew Heymsfield",
                    "user_href": "/profile/Andrew-Heymsfield"
                },
                {
                    "user_id": "Anthony Brown",
                    "user_href": "/profile/Anthony-Brown-396"
                },
                {
                    "user_id": "Sagar Goswami",
                    "user_href": "/profile/Sagar-Goswami-10"
                },
                {
                    "user_id": "Jamesee Maxwell",
                    "user_href": "/profile/Jamesee-Maxwell"
                },
                {
                    "user_id": "Graham Warrington",
                    "user_href": "/profile/Graham-Warrington"
                },
                {
                    "user_id": "David Terry",
                    "user_href": "/profile/David-Terry-11"
                },
                {
                    "user_id": "Clark Lambert",
                    "user_href": "/profile/Clark-Lambert"
                },
                {
                    "user_id": "Tom Richards",
                    "user_href": "/profile/Tom-Richards-81"
                },
                {
                    "user_id": "Jesus Soto Martinez",
                    "user_href": "/profile/Jesus-Soto-Martinez"
                },
                {
                    "user_id": "Carter Craig",
                    "user_href": "/profile/Carter-Craig-3"
                },
                {
                    "user_id": "Richie Addenbrooke",
                    "user_href": "/profile/Richie-Addenbrooke"
                },
                {
                    "user_id": "James F Monroe",
                    "user_href": "/profile/James-F-Monroe"
                },
                {
                    "user_id": "Terren Peterson",
                    "user_href": "/profile/Terren-Peterson"
                },
                {
                    "user_id": "Harri K. Hiltunen",
                    "user_href": "/profile/Harri-K-Hiltunen"
                },
                {
                    "user_id": "Colin Bremner",
                    "user_href": "/profile/Colin-Bremner-2"
                },
                {
                    "user_id": "Harry Parker",
                    "user_href": "/profile/Harry-Parker"
                },
                {
                    "user_id": "Kyle Ockerlund",
                    "user_href": "/profile/Kyle-Ockerlund-1"
                },
                {
                    "user_id": "William Rogers",
                    "user_href": "/profile/William-Rogers-12"
                },
                {
                    "user_id": "Siva Ananmalay",
                    "user_href": "/profile/Siva-Ananmalay"
                },
                {
                    "user_id": "Andrew Daviel",
                    "user_href": "/profile/Andrew-Daviel"
                },
                {
                    "user_id": "Andrew Boddy",
                    "user_href": "/profile/Andrew-Boddy-2"
                },
                {
                    "user_id": "Tom Hazell",
                    "user_href": "/profile/Tom-Hazell-1"
                },
                {
                    "user_id": "Yevgeni Kovelman",
                    "user_href": "/profile/Yevgeni-Kovelman"
                },
                {
                    "user_id": "Arvid Ekberg",
                    "user_href": "/profile/Arvid-Ekberg"
                },
                {
                    "user_id": "Joshua Harrington",
                    "user_href": "/profile/Joshua-Harrington-1"
                },
                {
                    "user_id": "Eric Braun",
                    "user_href": "/profile/Eric-Braun-1"
                },
                {
                    "user_id": "Joshua Pritt",
                    "user_href": "/profile/Joshua-Pritt"
                },
                {
                    "user_id": "Davman TV",
                    "user_href": "/profile/Davman-TV"
                },
                {
                    "user_id": "Ronald Redlinski",
                    "user_href": "/profile/Ronald-Redlinski"
                },
                {
                    "user_id": "Swaminathan Ramasubramanian",
                    "user_href": "/profile/Swaminathan-Ramasubramanian-1"
                },
                {
                    "user_id": "Martin Gábrš",
                    "user_href": "/profile/Martin-Gábrš"
                },
                {
                    "user_id": "Arnab Dutta",
                    "user_href": "/profile/Arnab-Dutta-47"
                },
                {
                    "user_id": "Eli Poultorak",
                    "user_href": "/profile/Eli-Poultorak"
                },
                {
                    "user_id": "Calum Sinclair",
                    "user_href": "/profile/Calum-Sinclair-7"
                },
                {
                    "user_id": "Paul Scott",
                    "user_href": "/profile/Paul-Scott-32"
                },
                {
                    "user_id": "Jeff Solie",
                    "user_href": "/profile/Jeff-Solie"
                },
                {
                    "user_id": "Laabib Mostafa",
                    "user_href": "/profile/Laabib-Mostafa"
                },
                {
                    "user_id": "Nathan McMaster",
                    "user_href": "/profile/Nathan-McMaster-1"
                },
                {
                    "user_id": "Mark Hewis",
                    "user_href": "/profile/Mark-Hewis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Lindbergh",
                "href": "/profile/Dave-Lindbergh"
            },
            "answer_text": "Yes, of course. The human brain, like much of biology, works on the principle of homeostasis (sometimes known as the “hedonic treadmill”). When we solve a problem we’re happy about it for a while - happier than normal. But eventually we adjust to the new (better) situation, and we’re back to normal - worrying about our remaining problems. And we’re just as unhappy about the remaining problems, despite them being much less important and serious, as we were about the old, worse, problems. After a while. Every technology comes with problems, because nothing in the real world is perfect. But some problems are more serious than others. Automobiles solved the immense problem of horse manure in city streets. Per Eric Morris: In 1894, the Times of London estimated that by 1950 every street in the city would be buried nine feet deep in horse manure. One New York prognosticator of the 1890s concluded that by 1930 the horse droppings would rise to Manhattan’s third-story windows. A public health and sanitation crisis of almost unimaginable dimensions loomed. When we solve more serious problems, in this case those created by fuel-powered vehicles, at first we’re happy. But eventually we get to worrying - just as much - about the new, much smaller, problems that remain. That doesn’t mean we haven’t made real progress. It just means we our level of worry doesn’t change much in the long run. As the Internet meme goes - “first world problems”.  ",
            "date": "Answered March 13, 2018",
            "views": "272",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Rajewski",
                    "user_href": "/profile/David-Rajewski"
                },
                {
                    "user_id": "Rat Allin",
                    "user_href": "/profile/Rat-Allin"
                },
                {
                    "user_id": "Adrian Jamrozik",
                    "user_href": "/profile/Adrian-Jamrozik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Bravi",
                "href": "/profile/Colin-Bravi"
            },
            "answer_text": "If you were thinking about the environment when the first generation of Prius was released and bought one, you made a huge mistake, and would have caused less environmental impact by buying an H1 Hummer. But things have changed since then and technologies, business practices, avalible renewable energy, manufacturing processes, and recycling practices have all changed. Short term if everyone switched over to electric cars in say a three year span, there would be issues with lithium production capacities, recharge station availability and speed, increased load on the power grid, etc…. These issues would be solved fairly quickly though. Governments would have to shift road funding from gas taxes to some other form of user fee such as tolling or milage fees. Battery disposal could easily follow the same model as glass bottle deposits, but would actualy work since the return amount would not just be 5 cents, but real money. The materials in a battery used in vehicles is easily recyclable. So yes, there would be a host of new issues, but none of them are insurmountable. ",
            "date": "Answered March 13, 2018",
            "views": "170",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Hewis",
                    "user_href": "/profile/Mark-Hewis"
                },
                {
                    "user_id": "Nathan McMaster",
                    "user_href": "/profile/Nathan-McMaster-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce A McIntyre",
                "href": "/profile/Bruce-A-McIntyre"
            },
            "answer_text": "If everyone drove electric vehicles, what issues would be involved? Well, both Tesla and the Chinese are building massive battery plants, but these are designed as zero CO2 generation, and include huge battery recovery and re-manufacture, so battery disposal will not be such a huge issue. As far as energy shortages, that won’t be a problem because expanding on renewable energy generation is a lot easier than building many more natural gas or nuclear generation plants. (Don’t even count coal fired plants, they are all going away.) Infrastructure problems will be varied, but not worse. The infrastructure in the US is already approaching 3rd world status, and will get worse, but that is a political problem, not a technology problem. In my opinion, the reality is that energy production will move away from huge centralized generation plants to a much more distributed model. This will not only be easier to do, but will reduce the effect of losing generation capacity when a plant has to close for any reason. ",
            "date": "Answered March 13, 2018",
            "views": "936",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aleksandar Panovski",
                    "user_href": "/profile/Aleksandar-Panovski"
                },
                {
                    "user_id": "Calum Sinclair",
                    "user_href": "/profile/Calum-Sinclair-7"
                },
                {
                    "user_id": "William Qin",
                    "user_href": "/profile/William-Qin-11"
                },
                {
                    "user_id": "Mark Hewis",
                    "user_href": "/profile/Mark-Hewis"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                },
                {
                    "user_id": "Nathan McMaster",
                    "user_href": "/profile/Nathan-McMaster-1"
                },
                {
                    "user_id": "Ramchandra Hegde",
                    "user_href": "/profile/Ramchandra-Hegde-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernie Dunbar",
                "href": "/profile/Ernie-Dunbar-1"
            },
            "answer_text": "Issues we have today: Gasoline disposal.Disposal of gasoline by-products.Disposal of ICE engine waste.Energy shortages.Infrastructure problems, including serious issues with spillage of oil from every part of the supply chain.Please, tell me right now, how this is “better”. I’ll wait. ",
            "date": "Answered March 18, 2018",
            "views": "92",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Harris",
                "href": "/profile/Peter-Harris-161"
            },
            "answer_text": "The world changed dramatically when everyone stopped riding horses and drove cars instead. Fewer stables, more garages, fewer blacksmiths, more service centres, fewer horse droppings in the road, more potholes. Many more tanker ships to bring fuel from overseas. Change happens and gets dealt with. ",
            "date": "Answered March 13, 2018",
            "views": "116",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Daviel",
                    "user_href": "/profile/Andrew-Daviel"
                }
            ]
        }
    ]
}