{
    "title": "What is CMP in stocks? - Quora",
    "tags": [
        "Current Market Price",
        "Investment Advice",
        "Stocks (finance)",
        "Stock Markets"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gagan Singla",
                "href": "/profile/Gagan-Singla-27"
            },
            "answer_text": "CMP is an important criterion for stock market investors. Simply put it stands for Current Market Price. It is also known as Current Stock Value. Current Market Price is a rough value or price of a particular share that is trading at the market at a specific point in time. As the stock market is highly dynamic, you will seldom get the opportunity to buy as many shares as you want at the CMP. The Current Market Price of a stock can be obtained from sources such as financial websites, news channels, and mobile apps. If you decide that you want to sell or buy a particular stock at Current Market Price, then you need to enter the Market Order with a brokerage. You must remember that due to the dynamic nature of the market, there may be a slight deviation in the price from the time you enter the order, to the time the actual trade is executed. In times of high volatility, the change may or may not be significant. In fact, under such circumstances, any large orders can bring about a change in the price. In order to avoid impacts of market fluctuations that affect your trade prices, you can issue Limit Order. With its issue, you can give specific instructions to your broker not to accept a price below the set price in the limit order. You effectively set the minimum price that you want to sell or a maximum price that you want to buy a particular stock. You must read the terms and conditions carefully in such cases as the broker may charge commissions if an order takes more time to fill. ",
            "date": "Answered August 6, 2018",
            "views": "157",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adnan Khan",
                    "user_href": "/profile/Adnan-Khan-2871"
                },
                {
                    "user_id": "Ak Kumar",
                    "user_href": "/profile/Ak-Kumar-76"
                },
                {
                    "user_id": "Keshav Malik",
                    "user_href": "/profile/Keshav-Malik-2"
                },
                {
                    "user_id": "Anurag Mranal",
                    "user_href": "/profile/Anurag-Mranal"
                },
                {
                    "user_id": "Ruchi Yadav",
                    "user_href": "/profile/Ruchi-Yadav-356"
                },
                {
                    "user_id": "Vip Vip",
                    "user_href": "/profile/Vip-Vip-27"
                },
                {
                    "user_id": "Achal Sharma",
                    "user_href": "/profile/Achal-Sharma-4"
                },
                {
                    "user_id": "Senthil Kumar",
                    "user_href": "/profile/Senthil-Kumar-962"
                },
                {
                    "user_id": "Harishanker Sachan",
                    "user_href": "/profile/Harishanker-Sachan"
                },
                {
                    "user_id": "Ankur Sekseria",
                    "user_href": "/profile/Ankur-Sekseria"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanjana Rajpal",
                "href": "/profile/Sanjana-Rajpal-1"
            },
            "answer_text": "CMP: Current Market Price The term CMP, when used in trading stocks, stands for the current market price. Also known as current market value, this refers to the rough price at which shares currently are trading in the market. Since stock prices are always in flux, you won't necessarily be able to buy as many shares as you wish at the currently quoted market price. TIPS: The term CMP refers to the current market price of a stock. It reflects the approximate price for which you can buy or sell a stock. Since stock prices fluctuate more or less continuously, you may not be able to buy or sell at exactly the price that you see quoted at any particular time. Finding the current market priceLimit OrdersStop OrdersFor more information visit stocktry. ",
            "date": "Updated September 26, 2020",
            "views": "443",
            "upvotes": "0"
        }
    ]
}