{
    "title": "What do you need to create a device that would sound an alarm when the device gets a certain distance away? - Quora",
    "tags": [
        "Alarm Clocks",
        "Alarm Systems",
        "Devices",
        "Electrical and Electronics Engineering",
        "Invention and Inventions",
        "Electronics",
        "Technology",
        "Computer Programming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Montgomery",
                "href": "/profile/Paul-Montgomery-7"
            },
            "answer_text": "There are devices on the market that do this, designed to alert a parent when a child wanders off. https://www.amazon.com/Guardian-Children-Protection-Security-Babysitter/dp/B007TW3QG2  I purchased on of these when I had young kids. The transmitter is attached to the kids clothes. When the receiver, kept in my pocket lost the signal from the child’s transmitter, it gave me an alarm. It worked great at finding my 4 yo son in a department store. Back around that same time, I was working for a company whose owner was a bit crazy and paranoid. He asked be to build a device that could be implanted into items he suspected would be stolen by an employee he suspected of theft. He wanted to be able to drive by this employees home and pick up the signal from the device on a receiver, thus proving the employee has stolen the item. So I did. Instead of building the circuits from scratch, I modified a similar child monitor’s transmitter. The transmitter broadcast a “ping” on a selected frequency which you could pick up on a receiver. It worked similarly to the device depicted in “No Country for Old Men”. What my boss did not know, was that at the same time, I built another pinger on a separate frequency and installed it into his car. The receiver located in my office would alert me when the bosses car was within a few blocks of the office. I used this to my advantage for several years until he crashed and totaled the car. BTW, the items that we radio tagged were never stolen. The employee in question was not stealing stuff from him. ",
            "date": "Answered October 27, 2020",
            "views": "558",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Bridgen",
                "href": "/profile/David-Bridgen-2"
            },
            "answer_text": "The device you are thinking of is a proximity detector. I don’t have a circuit for one, but you might find one on the internet. But it would be simpler to buy one. ",
            "date": "Answered October 31, 2020",
            "views": "59",
            "upvotes": "0"
        }
    ]
}