{
    "title": "What happens when you pair two phones with Bluetooth? - Quora",
    "tags": [
        "Bluetooth Devices",
        "Bluetooth"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikoo Shakiba",
                "href": "/profile/Nikoo-Shakiba"
            },
            "answer_text": "This is how it works: Your headset paired and connected to both phones at the same time; it is listening to both signals, the first speaker goes on, the headset will switch you to that phone; in this case the first phone rings, you will switch to that phone.Now you are talking with first caller, the second phone rings. Depending on your headset multi-point version (basic or advanced) one of following cases happens:Basic Multi-Point: The headset will switch you to second call and your first call will dropAdvanced Multi-Point: The headset will switch you to the second call and put your first call on-hold. Optionally you can add the second call to existing call and actually have a conference call NikooPlaer: The only music player app with binaural 3D sound effect ",
            "date": "Answered July 21, 2019",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carlos Gandía",
                    "user_href": "/profile/Carlos-Gandía"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Wilson",
                "href": "/profile/Tom-Wilson-12"
            },
            "answer_text": "It depends on the phone. sometimes they can exchange files. Sometimes, one phone can act as the speaker/mic for another. (I used to do this with my first phone that had BT, back in 2003 or so.) it all depends on which profiles the phones expose as a client and as a server. ",
            "date": "Answered February 4, 2020",
            "views": "17",
            "upvotes": " Answer requested by Nathaniel Suchy"
        },
        {
            "author_info": {
                "name": "Pride Thomas",
                "href": "/profile/Pride-Thomas-1"
            },
            "answer_text": "If your device support you can pair on 4 devices nothing special 2 may receive only call audio and the other 2 will be with media or you call also manually manage services which you want to allow. ",
            "date": "Answered June 8, 2020",
            "views": "595",
            "upvotes": " Answer requested by Nathaniel Suchy"
        }
    ]
}