{
    "title": "What has been the most exciting research project you have worked on? - Quora",
    "tags": [
        "Excitement",
        "Academic Research",
        "Projects",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gustavo Marques Hobold",
                "href": "/profile/Gustavo-Marques-Hobold"
            },
            "answer_text": "Besides the research I am currently being paid to do as a graduate student (which I find very exciting), I am currently working on two projects that are very exciting. Designing, building, instrumenting and operating an experimental platform for evaluating boiling heat transfer performance in engineered fluids in microgravity. My experiment will be go aboard a Brazilian sounding rocket for microgravity experimentation. This has been the most challenging, and possibly the most rewarding, project that I have undertaken. It’s been an eye opener for how difficult rocket science can be, especially in a country with a subdeveloped aerospace industry (Brazil). The goal is to build a remotely operated platform that will turn on the experiment, collect data and images, proccess and transmit everything via telemetry. Everything must be working perfectly. One shot only. We’ve been working for several months for only 6 minutes of high quality data that you cannot get anywhere on Earth.Using machine learning for heat transfer and fluid dynamics analysis. I’ve spent my free time of the past few weeks learning machine learning and Python (it’s surprising how much much free ML content there is on the internet) and implemented a few algorithms myself. I’m very confident that machine learning, and AI in general, is a tool that will revolutionize energy research, particularly with respect to energy utilization optimization, critical system analysis and even at the fundamental level, aiding theoretical analysis of several highly non linear physical phenomena. As a consequence, I’ve started dedicating some time to ML, which has already produced some fruitful results. I am currently using ML to solve an interesting long-standing problem in transport phenomena and expect to have a paper out for publication within the next few weeks. I strongly believe I want have a long standing relationship with ML, given that I see tremendous potential for its application in my field.",
            "date": "Answered April 16, 2017",
            "views": "861",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guobing Li",
                    "user_href": "/profile/Guobing-Li"
                },
                {
                    "user_id": "Udit Singh Parihar",
                    "user_href": "/profile/Udit-Singh-Parihar-1"
                },
                {
                    "user_id": "Kelly Kochanski",
                    "user_href": "/profile/Kelly-Kochanski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sebastian Thrun",
                "href": "/profile/Sebastian-Thrun"
            },
            "answer_text": "How can I possible answer this?? Self driving cars was amazing, as was the creation of Google X. We are now doing a lot of AI research at Udacity I am very excited about. But I also like some of the work coming out of our lab at Stanford, where we are trying to leverage machine learning in the early detection of deadly diseases. Life is so much fun!!! ",
            "date": "Answered May 26, 2016",
            "views": "51",
            "upvotes": " View 94 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ranit Das",
                    "user_href": "/profile/Ranit-Das-20"
                },
                {
                    "user_id": "Glorian Yapinus",
                    "user_href": "/profile/Glorian-Yapinus-1"
                },
                {
                    "user_id": "Sudip Bhandari",
                    "user_href": "/profile/Sudip-Bhandari"
                },
                {
                    "user_id": "Vaibhav Ambasta",
                    "user_href": "/profile/Vaibhav-Ambasta"
                },
                {
                    "user_id": "Jude Joy Kallarakal",
                    "user_href": "/profile/Jude-Joy-Kallarakal"
                },
                {
                    "user_id": "Aadil Ayub",
                    "user_href": "/profile/Aadil-Ayub"
                },
                {
                    "user_id": "Tuguldur Baigalmaa",
                    "user_href": "/profile/Tuguldur-Baigalmaa"
                },
                {
                    "user_id": "Anand Reddy",
                    "user_href": "/profile/Anand-Reddy-19"
                },
                {
                    "user_id": "Daniel Santiago Cuervo Gómez",
                    "user_href": "/profile/Daniel-Santiago-Cuervo-Gómez"
                },
                {
                    "user_id": "Madhu",
                    "user_href": "/profile/Madhu-533"
                },
                {
                    "user_id": "Zaid Al-Husseini",
                    "user_href": "/profile/Zaid-Al-Husseini-1"
                },
                {
                    "user_id": "Akshay Pai",
                    "user_href": "/profile/Akshay-Pai-29"
                },
                {
                    "user_id": "Kirtibhanu Mallik",
                    "user_href": "/profile/Kirtibhanu-Mallik"
                },
                {
                    "user_id": "Harsimran Kaur",
                    "user_href": "/profile/Harsimran-Kaur-130"
                },
                {
                    "user_id": "Akash Singh",
                    "user_href": "/profile/Akash-Singh-264"
                },
                {
                    "user_id": "Murugeshbabu Mahadevan",
                    "user_href": "/profile/Murugeshbabu-Mahadevan"
                },
                {
                    "user_id": "Vatsal Singh",
                    "user_href": "/profile/Vatsal-Singh-6"
                },
                {
                    "user_id": "Yuliani Noriega",
                    "user_href": "/profile/Yuliani-Noriega"
                },
                {
                    "user_id": "Sumanth K Gowda",
                    "user_href": "/profile/Sumanth-K-Gowda"
                },
                {
                    "user_id": "Naveen B",
                    "user_href": "/profile/Naveen-B-144"
                }
            ]
        }
    ]
}