{
    "title": "What is the latest technology with a positive future? - Quora",
    "tags": [
        "EmoSPARK",
        "Latest Technology",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shahab Uddin",
                "href": "/profile/Shahab-Uddin-112"
            },
            "answer_text": "In the course of the last 2 to 3 decades, innovation has turned out to be increasingly a piece of our day by day lives, to the point where it has assumed control over our lives. Pause for a minute, quit perusing this post and check out you. What do you take note? Do you see tech, devices, PCs, video observing? Notice how our lives are encompassed by devices and tech machines. The PC at your work area, the PDA alongside your bed, the Wifi switch, shoot your indoor regulator – all these are cases of how innovation has changed each part of our lives. Some for the great and others may not be so great. In this post we will take a gander at a portion of the most recent accomplishments in innovation and break down their positive and negative effect on our lives. wacvb_summit Cell phone Revolution It was a little more than 10 years back, when phones were essentially utilized for calling and sending writings. However today, the employments of phones run the extent. Telephones do everything from taking high-determination pictures to watching pixel-consummate recordings, perusing the web to playing realistic escalated diversions to observing your developments. It's shocking at how this little gadget can deal with requesting errands notwithstanding satisfying essential correspondence needs. The coming of cell phones has disentangled our lives monstrously. Individuals now associate with their friends and family more much of the time and effortlessly through video calls and texting administrations. Assignments, such as making slides, perusing messages, and making records don't require a PC any longer. More or less, cell phone and applications have changed the way we work, convey and play. Furthermore, the blasting extension of online business and web based organizations is specifically relative to the quick multiplication of cell phones. While the cell phone insurgency has made our lives simple, it has additionally made us languid. Today, the entire world is readily available, and in this manner we don't need to work or move around as we did already to complete things. Our inactive way of life and absence of physical exercises can be mostly ascribed to the over-reliance on cell phones. This is particularly valid for the more youthful age, who are always stuck to their mobile phones. In the cutting edge period, mobile phone compulsion is negatively affecting our lives. Care should be taken to manage this issue in a compelling way. Mechanical autonomy and Artificial Intelligence The headways made by the logical and building group has turned Artificial Intelligence (AI) and apply autonomy from sci-fi to reality. In spite of the fact that we don't have human-like robots like those portrayed in films, smart machines are currently a piece of our every day lives. Consider propelled rambles that are equipped for observation, following, and hostile measures-aren't such machines exceptionally clever robots? Shouldn't something be said about mechanized mechanical production systems in modern plants that can deal with the assembling and bundling of merchandise without anyone else? Modern machines that are equipped for working with insignificant human mediation are advanced robots as well. Driverless autos are yet another case of AI and apply autonomy. With tech goliaths like Google, Tesla, and BMW associated with the generation of driverless autos, it would seem that we will see self-driving autos sooner than any of us anticipated.. While the idea of Robotics and AI sounds energizing, it isn't without its imperfections. Numerous individuals trust that execution of mechanical technology and AI will prompt mass cutbacks and joblessness. We have just perceived how assembly line laborers lost their employments when mechanized mechanical production systems were presented. Presently, with driverless autos, astute chatbots, and additionally thumping at the entryway, it might turn out that drivers and client bolster operators will experience considerable difficulties keeping their occupations. Eventual fate of Technology With each passing day, innovation is developing significantly. Also, notwithstanding worries about joblessness and over-reliance, legitimate utilization of innovation holds a splendid future for us. Anyway, in what manner would technology be able to get down to business the future betterly? We should investigate! Clean Energy clean_energy Extreme utilization of petroleum derivatives has driven our planet to the verge of calamitous results. Nonetheless, innovation is helping us manage this issue by growing clean vitality. Improvement in the field of sun oriented power innovation has radically diminished the cost of sun based cells. Age of power through breeze turbines has likewise picked up a great deal of energy in the current years. Thus, sooner rather than later, innovation can enable us to get rid of dependance on petroleum derivatives and grasp perfect and environmentally friendly power vitality arrangements. Virtual Reality (VR) Keep in mind Pokemon Go? All things considered, that was one of the soonest cases of virtual reality going standard. Tech goliaths like Google, Facebook, and Nokia are spending a tremendous measure of cash to improve VR encounter for the clients. Be that as it may, VR isn't just about immersive media encounter. With time and further improvements, VR can be utilized for correspondence through 3D images, for associating with 3-D objects and other helpful and instructive purposes. Training for all An impressive number of the worldwide populace doesn't approach quality training. With the assistance of the web, anybody on this planet can approach essential instruction as well as cutting edge themes. Rumored instructive organizations from various nations are as of now recording addresses and distributing those materials on the Internet for everybody to watch and learn. With better web availability and cell phones, \"training for all\" won't be a pipedream any longer. Flying autos flying_car This sounds straight out of a motion picture, however flying autos may soon be standard. Amazon has just begun conveying products with the assistance of its automaton armada, and Google is taking a shot at building its own capable automatons. Two or three new businesses are likewise dealing with building flying autos. A flying auto in all plans and intentions is an automaton that is fit for conveying individuals. There are as of now a modest bunch of flying vehicle proto-types: Terrafugia has TF-X; Pal-V has the Pal-V1; Indigenous Peoples' Technology and Education Center (I-TEC) has the Maverick LSA \"Flying Car\"; and in conclusion AeroMobil s.r.o. has the AeroMobil 3.0. These are only a couple of the astonishing advances that we will have in the coming years. What's to come is unusual and the conceivable outcomes are boundless. What's straightaway? Transporting? The sky is the limit! Taking a gander at what instruments you can use for your specialized progressions? Don't hesitate to email us at sales@totalphase.com, or on the off chance that you officially claim one of our gadgets and have a specialized inquiry, please present a demand for specialized help. ",
            "date": "Answered May 4, 2018",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Seetha",
                "href": "/profile/Seetha-22"
            },
            "answer_text": "There are two versions of the future(technology): one which goes in the way of the Terminator, with robots based on pure logic and another full of emotions, -like Wall-E, a cute robot full of emotions who saves humans from logical robots. EmoSpark belongs to the latter. EmoSpark the world’s first home artificial intelligence console is  an android powered Wi-Fi/Bluetooth cube which will recognize each family member’s preferences, that uses emotion text and content analysis to measure the emotional responses of its users. In fact, it actually detects the moods of several people in the room at a time, the same way people do, through facial recognition and learning to interact through conversation.  Technically, EmoSpark accesses NASA’s MODIS satellite, the Freebase and Wiki databases and results in a platform so innovative it will spin the entertainment world on its side.Every EmoSpark has access to a communication grid, accessed only by other cubes, so will be able to recognize other cubes with a similar emotional profile. It can share media enjoyed by other cubes and then recommend this for your enjoyment(cubes can share only media files, so privacy will not be lost). It can interact with the family, help with homework and provide up-to-the-minute updates about anything local or global.  Since it is an A.I. device, it continues to learn and fine-tune its results over time.·        As like our brain EmoSpark can also perceive and process billions of signals and stimuli over time. ·        The Cube connected to Google, Wikipedia and other free resources and is able to answer and project answers in over 39 million topics. ·        You can interact EmoSpark by using your Smart phone, Tablet, T. v or PC. ·         EmoSpark can interact with individuals on a custom, conversational basis because it will recognize the user’s face.·         As interactions become more frequent, EmoSpark will capture and store each emotional nuance with the sole intention of making the user happy.EmoSpark learns everything from you, the way you interact with it, comments and responses.·        EmoSpark can feel an infinite variety in the emotional spectrum based on 8 primary human emotions, Joy, Sadness, Trust, Disgust, Fear, Anger, Surprise and Anticipation.         ·        This Cube Measure your behavior and emotions, then in turn it will create a emotion profile that make you happy and feel comfortable. ·        While it builds each unique Emotional Profile Graph (EPG), it will virtually “feel” sensations and emotions. The applications are unlimited. It already works with users’ smart phones, computers, televisions and games and can connect to Facebook, YouTube, Air play and more.·        The EmoSpark cube also doubles as an e-learning tool.The cube's capabilities lets it install compatible new apps from the Google Play App store, increasing its ability for new functional blocks such as chat bots, new voices, or interfacing with Robot like NAO, Sphero or any other AI technology. I hope it will be released in near future. It costs around Rs.15,000-25,000(USD$260-$315).For more visit,Home - EmoSPARK | The First A.I. Home Console ",
            "date": "Answered July 25, 2014",
            "views": "639",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishal Zuluk",
                    "user_href": "/profile/Vishal-Zuluk"
                },
                {
                    "user_id": "Ankita Majumder",
                    "user_href": "/profile/Ankita-Majumder-12"
                },
                {
                    "user_id": "Sreemukha Taduru",
                    "user_href": "/profile/Sreemukha-Taduru"
                },
                {
                    "user_id": "Raghuram Prabhu",
                    "user_href": "/profile/Raghuram-Prabhu-2"
                },
                {
                    "user_id": "Nikita Patil",
                    "user_href": "/profile/Nikita-Patil-14"
                },
                {
                    "user_id": "Sriram Kumar",
                    "user_href": "/profile/Sriram-Kumar-34"
                }
            ]
        }
    ]
}