{
    "title": "What are the newest, most innovative, POS systems out there? - Quora",
    "tags": [
        "Point of Sale (POS) Systems",
        "Innovation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Eagle",
                "href": "/profile/Dave-Eagle-1"
            },
            "answer_text": "Warning: This post is much less funny/entertaining than the ones I normally write.  Apologies.  If you imagine that I am doing the macarena while answering the question, your entertainment value will double. Square's coming up a lot here, and while they most certainly are responsible for a technological disruption with regards to access to taking credit payments, the actual point in their point of sale app is lacking in features.  That's by design, of course, because the POS isn't where their money is made; they earn money on a per-swipe basis.  They have been adding features and making it more robust, but they're certainly not innovating in that department.  Surprisingly—and I bet you never saw this coming—it just so happens that I think Kounta, the company I write for, is leading the way for hospitality focused Point of Sale systems.  Part of their innovation is that they designed their software with the foodservice industry in mind specifically, yet you can drop it into a retail environment and find there's no compromise in functionality. Running on an open and scalable cloud-based platform, third party integrations—Xero, Deputy, Collect Rewards, Beat the Q, to name a few—help users create unique setups tailored to their needs. Feature-matched with industry POS leaders Micros and Aloha, Kounta will run on almost anything so you're not locked into spendy hardware purchases.  Use it on an iPad, Android, Mac, or Windows PC.  Use it on legacy POS terminals.  With ingredient level inventory tracking, integrated purchase ordering, as well as a CRM module,  and advanced reporting and analytics, the smallest of cafes now have access to the kinds of data tools that big chains and celebrity chefs have enjoyed for years.  Customers are free to integrate with whatever merchant account they choose (so aren't locked into Squares higher-than-average rates), and Kounta is already fully EMV compliant, while still flexible enough to take cash, checks, Apple Pay, and Paypal. ",
            "date": "Answered May 22, 2015",
            "views": "18",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kaviarasan Karthick",
                    "user_href": "/profile/Kaviarasan-Karthick"
                },
                {
                    "user_id": "Manoj Balaji",
                    "user_href": "/profile/Manoj-Balaji-8"
                },
                {
                    "user_id": "Lucas E Wall",
                    "user_href": "/profile/Lucas-E-Wall"
                }
            ]
        },
        {
            "author_info": {
                "name": "John William LeMasney",
                "href": "/profile/John-William-LeMasney"
            },
            "answer_text": "Personally, I love the disruption that Square brought into the market. For the average new business creator who does not have experience in collecting money through credit card transactions, getting started can be daunting, or at least it used to be. Square said, just install this app, create an account, and plug this reader in your phone, we'll take care of the rest. You are your own mobile POS. If you are a traditionalist, you can plug your tablet into a square kiosk station in order to manage transactions, but that's just more plastic to make customers feel more comfortable. Meanwhile, the rest of the industry said \"uh oh\" collectively, and started making mobile card readers their new standard. The disbenefit of square is a higher percentage taken than the average merchant credit card processor, but to a new user who wants simplicity, that matters very very little. I thought of it as a simplicity tax, myself. ",
            "date": "Answered April 30, 2015",
            "views": "798",
            "upvotes": " Answer requested by Lucas E Wall"
        }
    ]
}