{
    "title": "What is an avid reader? - Quora",
    "tags": [
        "Avid (company)",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ruchi Das",
                "href": "/profile/Aditya-Srivastav-2"
            },
            "answer_text": "Along the on and off phases hand in hand with the ups and downs in life, I have been reading :starting from Panchtantra picture books to A song of ice and fire, I can humbly admit I've come a long way.  How do I feel about myself? Confident: When I mentally correct minuscule grammatical details in people's everyday conversations that many people glibly take for granted;The present tense with did, the use of 's' form of verb depending on the number of the subject , any ways and NOT anyways being some common ones. Rich: When I look at the number of books I've marked as read on goodreads, I feel like I'm sitting on a pile of gold gathered through the seasons, year in and year out, through the scalding summer vacations spent chewing on books. Which brings me to: Triumphant: Living between the pages through the ages gives me an authoritative power over those who have started reading recently, those who want to but can't, people who wonder and awe at your superpower to devour tomes in matter of days. This is my superpower, a quality that an average guy can call his own.  Smug: Okay so I read. I don't waste my precious time on petty jokes and the whos and whoms of others lives. So don' t ask me when and how and what should you start  and whine about your lack of time due to a tight schedule. Although, you can look at me wonder how I do it ^.^ And the curtain closer, Complete: No matter where my feet and busy schedule carries me, with or without metamorphic company, I am never alone. I ALWAYS have a book or two in my bag because I feel in company when I carry one. Be it in the noisy cafeteria or a brooding hot bus ride, I have a chapter to finish or a page to complete or even a paragraph to re-read. If I don't touch it for days or start another book, this baby won't start throwing tantrums. It doesn't care if I wander away. It knows I'm eventually coming back to her at the end of a down and dusted day. ",
            "date": "Answered March 31, 2016",
            "views": "79",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Naulak",
                    "user_href": "/profile/David-Naulak"
                },
                {
                    "user_id": "Ashutosh Swain",
                    "user_href": "/profile/Ashutosh-Swain-13"
                },
                {
                    "user_id": "Deepshikha Roy",
                    "user_href": "/profile/Deepshikha-Roy-17"
                },
                {
                    "user_id": "Ashwini Gupta",
                    "user_href": "/profile/Ashwini-Gupta-131"
                },
                {
                    "user_id": "Dan Finch",
                    "user_href": "/profile/Dan-Finch-14"
                },
                {
                    "user_id": "Deborah Graff",
                    "user_href": "/profile/Deborah-Graff-2"
                },
                {
                    "user_id": "Kanupriya Goel",
                    "user_href": "/profile/Kanupriya-Goel-11"
                },
                {
                    "user_id": "Korey Daniel",
                    "user_href": "/profile/Korey-Daniel"
                },
                {
                    "user_id": "P Bee II",
                    "user_href": "/profile/P-Bee-II"
                },
                {
                    "user_id": "Ayush",
                    "user_href": "/profile/Ayush-360"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devinder Sharma",
                "href": "/profile/Devinder-Sharma-1"
            },
            "answer_text": "The word avid means being very eager or enthusiastic or keen, however it also used to emphasize somebody who wants something so badly that can be construed as being greedy. An avid reader is one who reads a lot, many subjects and spends a lot of time reading. I hope you get the feel of what an avid reader is. ",
            "date": "Answered October 4, 2020",
            "views": "202",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gaurav Gahlot",
                    "user_href": "/profile/Gaurav-Gahlot-17"
                }
            ]
        }
    ]
}