{
    "title": "What is the relationship between the power, state and politics? - Quora",
    "tags": [
        "State (political unit)",
        "Power (society)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Wrigley",
                "href": "/profile/Ted-Wrigley"
            },
            "answer_text": "Down to basics, first. Start with a group of people who form a community. As a community — a collective group — they need to make certain decisions about who they are as a community: what do they value, what is important to them, what do they need or want to do in various given situations… Politics is how they make those decisions; politics is (as David Easton liked to put it) the authoritative allocation of values. Politics, thus, implies power; it implies a functional, pragmatic capacity to see that the values society allocates are implemented. The simplest case, perhaps, is when everyone in the society comes to agree that a particular value is good (the democratic ideal) and decides to abide by it without conflict. but in less ideal cases, values can be implemented using a large variety of social, economic, and legal forms. For example, if a society decides that one of the values it wants to implement is that women should be subordinate to men — as (sadly) most societies both modern and traditional seem to do — then it can implement that subordination in any number of different ways. It can collectively decide that women should be asked to cover themselves in heavy cloth to hide their feminineness, or contrarily that women should be asked to wear revealing clothes that expose their feminineness as provocatively as possible. Likewise women might be told that they cannot leave the house without a male escort, or encouraged to be dependent on others so they can be exploited, or be expected to take the brunt of childcare and eldercare in society, or… And once a society has decided how this subordination is to be implemented, it turns to social, economic, and legal power to enforce this implementation. This might be something as simple as bullying, ostracism, or shaming, either because the woman’s behavior is considered too provocative (slut-shaming) or because the woman’s behavior is not provocative enough (body-shaming); or it might extend to economic penalties (barring women from work, funneling them into low-paying jobs, demanding excessive beauty standards for advancement, workplace harassment), legal penalties (jailing women for refusing to do childcare, fining women for going topless or breastfeeding in public), or even violent socially-condoned punishments like rape or murder for women who violate expected values. Even in an ostensibly advanced nation like the US women are still brutally punished for accusing men of sexual impropriety: often both slut-shamed for allowing a man to take advantage of them, and body-shamed if they do not fit the imaginary ideal of the kind of woman men are supposed to want to take advantage of. As we can see from the above, using power to implement social values can often be an offensive and irrational process: good intentions that lead in the long run to fairly hellish outcomes. And so the modern Liberal world has turned to the notion of the ‘state’ as a system for producing rational applications of power. Technically speaking, a state is nothing more than an established territory that is subject to a given set of laws and institutions, but the implication — the thing that sets a modern Liberal state apart from a kingdom or a tyranny or an anarchy — is that the laws and institutions of the state are ostensibly rationalized by public discourse and deliberation, so that the more noxious abuses of power are eliminated. Thus, US law specifically holds that legal punishments should be universal, and should not be cruel or unusual; the idea is to prevent specific jurisdictions from passing laws that are specifically targeted against groups (women, blacks, gays, immigrants) that local authorities would prefer to control or suppress. Whether or not the modern state actually manages to be rational in the way intended is a separate issue. All I can say for certain is that states tend to be more rational than the alternatives, but only to the extent that the state is forced to listen to public discourse and adhere to the interests of its citizenry. Sadly (again) most modern liberal states have managed to take the public bit in their teeth, through gerrymandering and media demagoguery, and serve the interests of the already powerful more than those of the average citizen. We will have to see how that plays out over time. ",
            "date": "Answered December 12, 2017",
            "views": "33",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mariella",
                    "user_href": "/profile/Mariella-4"
                },
                {
                    "user_id": "Albert Suting",
                    "user_href": "/profile/Albert-Suting-3"
                },
                {
                    "user_id": "Firas Alhashimi",
                    "user_href": "/profile/Firas-Alhashimi"
                },
                {
                    "user_id": "Benjamin McGraw",
                    "user_href": "/profile/Benjamin-McGraw-1"
                },
                {
                    "user_id": "Sean McManus",
                    "user_href": "/profile/Sean-McManus-24"
                },
                {
                    "user_id": "Chris van der Walt",
                    "user_href": "/profile/Chris-van-der-Walt-1"
                },
                {
                    "user_id": "Will Connelly",
                    "user_href": "/profile/Will-Connelly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scot Black",
                "href": "/profile/Scot-Black"
            },
            "answer_text": "it has little to do with public power and more to do with economic power. in representive republican nations, the private sector has more influence over policy and decision making. when it doesn't, the reactionaries claim it's socialist. it's not. multi-national corporations go into other countries. countries that don't play ball are usually invaded or have their economy destablized. the rhetoric used by politcians rarely lines up with the facts. they claim we say this because we're conspiracy theorists. sadly, it's not. it's public record. check out micahael parenti. he's an historian. exposes this imperialist agenda. ",
            "date": "Answered December 7, 2017",
            "views": "617",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dena Proctor",
                    "user_href": "/profile/Dena-Proctor"
                }
            ]
        }
    ]
}