{
    "title": "What in Shenzhen is worth a visit? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Bryan Chau",
                "href": "/profile/Bryan-Chau-3"
            },
            "answer_text": "Shenzhen is unlike any other city in China. Its what's called an artificial city. It was literally a fishing town about 70 years ago with about 1 percent of the population it is now.  However, things have drastically changed since then. Welcome to 2019 in Shenzhen.  Looks amazing right? Yes, Shenzhen is now filled with some very tall buildings, green parks, the top tech companies in China, but there is also something missing. There isn’t much of a history which also means there isn’t much to visit in Shenzhen. Unlike Shanghai or Beijing which has all the old historical buildings and structures, there isn’t anything similar to that in Shenzhen. I want to say I was shocked too my first time arriving in Shenzhen, but I heard all about this from my colleagues in Shanghai. In fact, this is quite well-known for anyone living in China. Everyone knows that Shenzhen is an artificial city and people move to Shenzhen to for a better life and not for visiting per se. Shenzhen is absolutely not a city for sightseeing or to find some grand awe-inspiring work of art. There’s few museums here compared to comparable cities in China. However, Shenzhen is definitely a city to live in with lots of possibility for growth. ",
            "date": "Answered August 13, 2019",
            "views": "573",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hu Tao",
                    "user_href": "/profile/Hu-Tao-18"
                },
                {
                    "user_id": "Emily Bowman",
                    "user_href": "/profile/Emily-Bowman-62"
                },
                {
                    "user_id": "Rena Margulies",
                    "user_href": "/profile/Rena-Margulies-1"
                },
                {
                    "user_id": "Kanishg Shiva",
                    "user_href": "/profile/Kanishg-Shiva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Lau",
                "href": "/profile/Edward-Lau-54"
            },
            "answer_text": "Shenzhen is not a tourism city, but a demonstration of a designed economic city. You can come and feel how the city has evolved from nothing 35 years ago up to now. Especially, you can visit the Nanshan district with HQ of Tencent, and many other IT and tech giants. Except this, do not expect more, there is not too much historical sites or gourmet. ",
            "date": "Answered July 27, 2019",
            "views": "111",
            "upvotes": "0"
        }
    ]
}