{
    "title": "What is the scope of information technology after 4 years? - Quora",
    "tags": [
        "Learning About Information Technology",
        "Jobs and Careers in Technology",
        "Jobs and Careers in Information Technology",
        "Information Technology",
        "Technology",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Loraditch",
                "href": "/profile/Daniel-L-272"
            },
            "answer_text": "The industry momentum is towards total replacement of humans for software development. Hardware was the model. No one found anything other than high level research jobs since the late 70s. Commercial software for business is somewhat of an exception. The software market has been turned into a used car environment. The product doesn’t have to pass any standards. It just has to sell. That is the standard. Software is now like dog food. The one who has to eat it is not the one who buys it. So, pretty marketing and promises gets high paid executives to dump the software in place for a new, improved version. They can blame the previous managers for a bad choice. Next comes the realization that all users will need training. This will not necessarily solve anything substantial and will be costly. The goal is to get $300/hr consultants in the store to fix and modify the software. These people may not even know anything but the phone number of the person to supply an answer. It’s astounding. So sleazy. ",
            "date": "Answered May 23, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anirban Saha",
                    "user_href": "/profile/Anirban-Saha-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manish Tranciscolabs",
                "href": "/profile/Manish-Tranciscolabs-1"
            },
            "answer_text": "Nowadays, IT area is so all around developed that it is specifically or in a roundabout way impacting the working of different parts and commercial enterprises. IT area goes about as a supporting figure for different divisions, for example, medicinal services, flight, instruction, fabricating segment, information transfers part, different Government activities and Departments and so forth. Graduates may take up taking after occupation posts in the aforementioned parts Web Developer and DesignerInformation Security OfficerDatabase ManagerProgramming DeveloperData Technology EngineerThe startup situation likewise enlists gifted IT experts. In this way, the individuals who are searching for an imaginative and testing workplace may get an occupation in the startup division. One may likewise utilize IT aptitudes and begin their own endeavor or even a consultancy firm too. Be that as it may, beginning a consultancy business will oblige one to have great work encounter first! Nowadays, IT organizations are notwithstanding enlisting Graduates from other Engineering branches and preparing them to tackle employments in IT Industry. This has prompted general diminishment in compensation of Freshers. Still, in the event that you figure out how to seek after IT Engineering from a presumed Institute, you'll have the capacity to find a well paying occupation right from the begin. The normal beginning pay is by and large between 20k-40k Rupees for every month. ",
            "date": "Answered July 8, 2016",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashwatthama",
                    "user_href": "/profile/Ashwatthama-6"
                }
            ]
        }
    ]
}