{
    "title": "What is the best job search site? - Quora",
    "tags": [
        "Startup Recruiting",
        "Recruiting",
        "Website Recommendations",
        "Job Searches",
        "Websites"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Monaghan",
                "href": "/profile/Jeff-Monaghan"
            },
            "answer_text": "This is an interesting question. The traditional answer is usually Indeed.com, but as of January 9th, 2019, this will no longer be the case. Let me explain why. Before January 9th, Indeed was receiving feeds from any company that posted jobs on their own website. These jobs appeared in Indeed’s organic search results and were free to all employers who wanted their jobs on Indeed. It was a great arrangement for candidates, employers, and Indeed. Indeed then offered sponsored job postings which were paid for by the employer and resulted in a better position in the search results. As you can imagine, these sponsored listings got more applicants and was a win for Indeed and the hiring company. This will all change on January 9th. Back in 2017, I worked for a staffing firm in the Bay Area. During that time, we got an email from Indeed saying that our jobs will no longer show up in Indeed’s organic search results. I quickly scheduled a call with our Indeed sales rep to find out why. After multiple conversations with her, I discovered the reason. She said the quality control team told her our jobs (temporary and permanent ones) were duplicates with the “end employer”. In other words, Indeed thought that the jobs we were tasked to fill by our clients were the same ones the clients had listed on their websites. Now, anyone with common sense will immediately understand what a terrible business model this would be for any staffing firm. And in fact, this “duplicate” scenario simply isn’t true. In an effort to try to understand further, I spoke to Indeed’s quality control team multiple times, trying to explain that they misunderstood the role of staffing firms. I even had them forward the jobs that they considered duplicates. On both occasions, the jobs they considered duplicates, were not. The job descriptions were similar but they were, in fact, within entirely different departments for the end client. Also, in both cases, our jobs were contract positions and the other jobs were direct positions at the company (our client). It was obvious they weren’t duplicates. So now, on January 9th, 2019, Indeed will be cutting off all staffing firm feeds from their organic search results. The result will be a significant reduction in good jobs for job seekers. The only reason for this that I am left with is that Indeed is looking to force staffing firms to buy sponsored job listings. So now, with all of this being said, the best job boards are now likely Glassdoor and ZipRecruiter simply because they have a more comprehensive list of job openings. ",
            "date": "Answered December 16, 2018",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maksym Rohachov",
                    "user_href": "/profile/Maksym-Rohachov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Pachory",
                "href": "/profile/Ashish-Pachory-1"
            },
            "answer_text": "You should remember that job search sites are just search and keyword matching engines that do not have your interest in mind. Yes, you should probably get your resume available on the popular sites so that on the off chance that a match is found with your profile, you don't miss it. But really, what are the odds? The search is so generic that even for niche jobs like CTO/CIO etc., you find 20000+ matches. Can there really be 20000 CTO/CIO level openings today in the country? Obviously not. The trick is that anything remotely to do with technology - from programming to IT strategy is clubbed under this head, just to show how popular the site is. It is similar, or worse, for other positions which are more generic. So in this virtual haystack, what are the odds that your skills will find the exact match that you are seeking, or that you will actually land your dream job? Bottom line - upload your resume but do not bank your hopes on a job search engine. Some more genuine and relevant methods of looking for jobs that match your profile and expectations would be the following: LinkedIn. LinkedIn is most preferred by employers as a hunting ground for talent. Keep your profile up to date, highlighting your latest accomplishments etc. The job search is a lot more refined and contextual on LinkedIn, as you can decide which positions to apply for based on, among other factors, number of applicants already in the queue.Recruitment Consultants. Here again, one needs to tread cautiously but due to the human interface involved (unlike search engines) you can take more decisive calls. Stay with a few that you trust and keep them in the loop on changes in your professional profile.Networking. You are at a big advantage with Social Media at your disposal to enhance your reach. But more than SM, rely on personal contacts through friends and ex-colleagues in other companies. Get referred. The importance of networking is frequently underplayed, but in my view it works best for both the employer and the seeker, due to the higher degree of trust at both ends.Visibility. If you have an opportunity to make a splash, do not let it pass. Publish articles, blogs, white papers, awards, and when possible, participate in debates and talks on your subject area. In short, create a ‘pull’ so that instead of you seeking jobs, the jobs come to you. I know it is easier said than done, but look around you. Most people at high positions got there not because of job search engines, but because they demonstrated a calibre which was sought by others. Start working for it today - you’ll get there.Perhaps the above is overly generic and restating of the obvious, but in the long run, unless you have that benevolent uncle (or aunty) where it matters, you’ve got to make it work for you through one of these methods only. ",
            "date": "Answered November 8, 2017",
            "views": "4",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sukriti Sharma",
                    "user_href": "/profile/Sukriti-Sharma-107"
                },
                {
                    "user_id": "Nayal Ejaz",
                    "user_href": "/profile/Nayal-Ejaz"
                },
                {
                    "user_id": "Govardhana KJ (ಗೋವರ್ಧನ ಕುಂಬಾರ ಜಯಚಂದ್ರ)",
                    "user_href": "/profile/Govardhana-KJ-ಗೋವರ್ಧನ-ಕುಂಬಾರ-ಜಯಚಂದ್ರ"
                }
            ]
        }
    ]
}