{
    "title": "What is the difference between multimedia room and video conference room? - Quora",
    "tags": [
        "Conference Room",
        "Rooms",
        "Multimedia",
        "Video Conferencing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jacqueline Chan",
                "href": "/profile/Jacqueline-Chan-20"
            },
            "answer_text": "I agree with Joe. I think multimedia room is consist of multiple AV products in the meeting room itself. So there might be cables, wireless presentation, video conferencing tools, - pretty much a full system for anyone to make a presentation equipped for remote workers as well.  Video conference room is generally for meeting rooms where they focus on video conferencing with external vendors or with remote workers.  As more organizations are standardizing their meeting rooms, multimedia room would probably be minimalistic as users simply just don't know how to use technology. I'm currently working at Ubiq, where we help users walk into a meeting room, and allow them to make a wireless presentation in under 1 second. Users should not have to worry about setting up their presentations 10 mins prior to the meeting.  ",
            "date": "Answered April 14, 2016",
            "views": "235",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mahmoud Abdel Gawad",
                    "user_href": "/profile/Mahmoud-Abdel-Gawad-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Strong",
                "href": "/profile/Joe-Strong-2"
            },
            "answer_text": "When I hear this question I understand it to mean a Multimedia Room is for local attendees with no external communication. It may draw upon any number of technologies to display information or facilitate discussion, but it is internally focused locally to the one location & its attendees. A VideoConferencing Room by contrast, is intended to facilitate communication and information sharing among at least two and perhaps multiple rooms/different geographical locations. It may also contain any of the technology included in the Multimedia room but will have a focus on being able to transmit and share that information, in addition to the local display. It is a blended internal & externally focused site, that must not only display local multimedia, and transmit the same information away, but also effectively receive and display information from other videoconferencing locations. Note: In my differentiation, a well set up VideoConferencing room could serve as a Multimedia Room also by simply not making a distant connection.  A Multimedia room defeats its own purpose by including VideoConferencing and if the other devices aren't integrated at all, or well, just becomes a bad VideoConferencing room. ",
            "date": "Updated April 16, 2016",
            "views": "472",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mahmoud Abdel Gawad",
                    "user_href": "/profile/Mahmoud-Abdel-Gawad-1"
                },
                {
                    "user_id": "Jacqueline Chan",
                    "user_href": "/profile/Jacqueline-Chan-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurence Chandler",
                "href": "/profile/Laurence-Chandler-1"
            },
            "answer_text": "I think the two answers already have looked to the physical meeting space. And in that sense, the multimedia room is designed to edit media with a host of tools with the video conference room having the sole purpose of hosting a video conference. However, they mean slightly different things when you come into the virtual world. The multimedia room would be a virtual room for you present documents and collaborate documents of all major type of files such as PDF documents. Where as a video conference room would be something along the lines of Google hangouts. This is a pure video conferencing solution where users can simply video call one another. The issue being created within the industry is that solutions such as Drum - Free Instant Web Meetings is offering the entire selection of functionality. Almost merging the two different types of virtual rooms into one super room where users do not experience a feature restriction. ",
            "date": "Answered July 8, 2016",
            "views": "346",
            "upvotes": " Answer requested by Mahmoud Abdel Gawad"
        }
    ]
}