{
    "title": "What positives will the year 2020 bring? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Debra Grasso",
                "href": "/profile/Debra-Grasso-1"
            },
            "answer_text": "The year 2020 will be remembered as the year the proverbial sh*t hit the fan, but every now and then, there are bits of positive outcomes due to the need for social distancing. The DMV (Department of Motor Vehicles) centers in my state have slowly been re-opening since July. They are no longer operating on a “first come-first served” basis, instead appointment are scheduled on-line in 15 minute intervals. Well, I was one of the lucky ones to log in early enough last month and snag an appointment for this morning at 10:15. I needed to renew my driver’s license with a Real ID. I pulled into the parking lot at 10:10, put on my face mask and walked towards the door. A masked woman seated at a folding table outside the front entrance asked me for my name and checked it off on the printed list she had in front of her. Another masked woman opened the door for me and directed me to a service window. I greeted the masked rep with a “Good morning” and handed over my completed application and 2 forms of ID, plus 2 proofs of residency and my current driver’s license. The DMV rep checked all the documents, took my photo, had me sign here and there, I paid the fee, then she handed me back my documents and I was out the door in 8 minutes! It was like a small miracle just happened, I tell you! Pre-pandemic the typical amount of time spent waiting at a DMV was about 2 hours — TWO HOURS minimum. Gotta be thankful for all the little positive things during these trying times. ",
            "date": "Answered August 17, 2020",
            "views": "344",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Donovan Minckler",
                    "user_href": "/profile/Donovan-Minckler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Lee Chadwick",
                "href": "/profile/Adam-Lee-Chadwick"
            },
            "answer_text": "Do I think 2020 is going to be a great year? Why or why not? . The year 2020 will be a wonderful year. I have ´´big plans´´ for this year. My ´´main goal´´ is to head back to the USA. That is my biggest priority. With the United States, I can do everything else that needs to be done to accomplish the task that needs to be complete. 1. I will be heading back to the university again for the very last time and I am 41 years old right now. I just want to get my degree in Sociology. 2. I also will be checking in with the VA facility because I am a veteran and I hope that the doctors can fix my heart. The heart attack that I received in March of 2018 when I was in San Christobal de Las Casas. 3. To get a lawyer (a very good lawyer) and go to the federal court and take action for what happened in 2016. I have to save a lot of money because I am in Mexico right now. But, if I accomplish and get to the United States this year. ´´I would have done a lot.´´ After the states, then I can achieve the rest that needs to be done to live a healthier life. My life has been very challenging and interesting for the last 3 years and 6 months, but getting to the states. It will fix everything. ´´Finally,´´ this year in 2020; it will be a great year to change lives. I am very excited because I will be heading back to the states for all the right reasons. ",
            "date": "Answered January 1, 2020",
            "views": "957",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohamad Noor",
                    "user_href": "/profile/Mohamad-Noor-5"
                }
            ]
        }
    ]
}