{
    "title": "What is the difference between the Internet and a WAN? - Quora",
    "tags": [
        "Wide Area Networks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Peracchio",
                "href": "/profile/Tom-Peracchio"
            },
            "answer_text": "A2A What is the difference between the Internet and a WAN? From the perspective of working in computer networking for many years, when I hear the term WAN, I think of a private network. Likewise when someone says Internet, I think of the global public highway system. You often hear the phrase, \"that's comparing apples and oranges.\" Yes, they are both round fruits, but the comparison breaks down beyond that superficial observation. Likewise, the terms Internet and WAN are both used in computer networking, but attempting to highlight the similarities and differences between two vaguely similar technical terms does not have much value beyond understanding their definitions. Let me expand the question slightly by explaining the difference from LAN to WAN. Any time you have computers sharing resources, file sharing, application sharing, printer sharing, you have a LAN (Local Area Network.) A LAN can be one of many types of networks, such as a peer-to-peer network which may, or may not, be based on TCP/IP protocols. My first certifications in computer networking and system administration was using the Novell OS in the 1990s. Novell originally did not use TCP/IP. They powered some pretty large LANs and WANs back in their heyday. Over the years I have heard many definitions of WAN (Wide Area Network). Some definitions use number of computers, some definitions use distance as a factor. What I was taught was neither number of computers or distance between them was a factor. I was taught that a WAN was more than one LAN connected together using a public connection. Here's an example, let's say I have a LAN (Local Area Network) in my current building where we share resources. It could be two computers, or 200, doesn't matter. I have an office across town that I want to connect their LAN to my LAN. It doesn't matter if that office is 2 miles away, or 200 miles away, in the process of connecting one LAN to another, I create a WAN. There are numerous ways to connect the two LANs, internet service providers, private IP network operators, cable companies, but that really doesn't change the basic definition. Now when we define the term \"internet\" I specifically think of the public network that evolved from the ARPANET based on the TCP/IP protocols developed in the 1980s. ",
            "date": "Answered February 8, 2018",
            "views": "107",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Artem Hevorhian",
                    "user_href": "/profile/Artem-Hevorhian"
                },
                {
                    "user_id": "Collins Okere",
                    "user_href": "/profile/Collins-Okere"
                },
                {
                    "user_id": "Shelly Sood",
                    "user_href": "/profile/Shelly-Sood-8"
                },
                {
                    "user_id": "Richard Nwachukwu",
                    "user_href": "/profile/Richard-Nwachukwu-1"
                },
                {
                    "user_id": "Sarah Ahmed",
                    "user_href": "/profile/Sarah-Ahmed-272"
                },
                {
                    "user_id": "Mahamed Said",
                    "user_href": "/profile/Mahamed-Said-1"
                },
                {
                    "user_id": "Ranjit Bhalerao",
                    "user_href": "/profile/Ranjit-Bhalerao-1"
                },
                {
                    "user_id": "Clayton Jay Hardy",
                    "user_href": "/profile/Clayton-Jay-Hardy"
                },
                {
                    "user_id": "Amanda Grosskopf",
                    "user_href": "/profile/Amanda-Grosskopf"
                },
                {
                    "user_id": "Ankit Sharma",
                    "user_href": "/profile/Ankit-Sharma-3638"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishal Bari",
                "href": "/profile/Vishal-Bari-36"
            },
            "answer_text": "First of all internet is the example of Wide Area Network (WAN) Let us consider definition of Internet and WAN : Internet :- Internet is a network of networks and in other word The Internet is a collection of computer networks that is spread all over the world. Wide Area Network :- Wide area network is that network which covers a large area. It is known as WAN. The size of this type of network is not limited. It is based on the used network. This network uses network and metropolitan area network with each other by high speed devices. Internet is router or other public communication link for connecting personal area network(PAN), local area network(LAN) and metropolitan area network (MAN) with each other by high speed devices. Please upvote if found helpfull ",
            "date": "Answered July 28, 2020",
            "views": "572",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Artem Hevorhian",
                    "user_href": "/profile/Artem-Hevorhian"
                }
            ]
        }
    ]
}