{
    "title": "What is the best technology for a reviews website? - Quora",
    "tags": [
        "Websites"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shubho Ghosh",
                "href": "/profile/Shubho-Ghosh-1"
            },
            "answer_text": "Good question. Let me explain it in a bit more detail. There is no such thing as 'the best technology for ....'. It all depends on various factors. I'll try to list some of them:  What technology are you familiar with?Do you have a partner who is familiar with a technology that can be used to build what you want?What are the choice of softwares that you are looking at? Closed source or open source technology?If you want to out source your work, how much are you willing to shell out?What is the end goal of building this software?Are you looking at extending the features at a later stage?Do you have the time to work on freely available open source softwares?Having said the above, as someone who works regularly with open source software, I can recommend a couple of freely available softwares for your purpose:  WordpressDrupalBlogger from Google and Tumblr (hosted)",
            "date": "Answered February 12, 2014",
            "views": "481",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharat Satyanarayana",
                    "user_href": "/profile/Sharat-Satyanarayana"
                },
                {
                    "user_id": "Arpita Belagavi",
                    "user_href": "/profile/Arpita-Belagavi"
                },
                {
                    "user_id": "Bhushan Nagaraj",
                    "user_href": "/profile/Bhushan-Nagaraj-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhushan Nagaraj",
                "href": "/profile/Bhushan-Nagaraj-1"
            },
            "answer_text": "+1 on Shubhodeep Ghosh's answer. You might also find this link helpful which provides you with a good list of open source software with a one click install solution. It includes the ones named by Shubhodeep ie. Wordpress and Drupal. Bitnami Stacks CheersBhushan ",
            "date": "Answered February 12, 2014",
            "views": "195",
            "upvotes": "0"
        }
    ]
}