{
    "title": "What are some good tech blogs to follow? - Quora",
    "tags": [
        "Tech Blogs and Websites",
        "Bloggers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve L",
                "href": "/profile/Steve-L-32"
            },
            "answer_text": "As others have mentioned there are other aspects and challenges to making a blog successful besides naming. I will put these in context and give you a process for both getting a better name AND for increasing your likelihood of success. If Nick Swinmurn, founder of Zappos.com, had decided that there were already too many shoe stores in the world he never would have bothered to create a company, never would have generated over $1 billion in sales in 2008 and never would have sold to Amazon for $1.2 billion. I’m not saying that will be your story, but I am saying that in a country full of shoe stores he found a way to succeed. So, don’t be discouraged by the naysayers, but do take their comments to heart and think about how to distinguish yourself. A name alone will not make or break your business. However, a good name can help and a bad one can hurt. But what makes one name good and another one bad?! I want to talk about two things: narrowing your blog niche and choosing a name. In the world of blogging it’s a good idea to narrow your niche. It may seem counter-intuitive, but you can find more success by choosing a narrow niche. Refer to my article 8 Ways a Narrow Niche is Better for Your Blog for more details. Tech encompasses a LOT of niches so there’s no reason you can’t find one and become the best in the world for that niche. Next, choosing a name. Zappos was originally named ShoeSite. I would have chosen ShoeSite. I’m not a fan of nebulous names. It worked out fine for Zappos, but I prefer names that are clear and obvious. When you hear the name it should be obvious what the blog is about. This is another reason I’m not really a fan of naming your blog after yourself—not to mention the fact you’d never be able to sell the blog if it’s named after you. So…the name you choose will depend upon the niche you choose. In order to find a good niche, spend some time on Google’s Keyword Planner. This will allow you to find niches that have high search volume (which indicates interest) and yet low or medium levels of competition. Low competition means that that specific keyword is not heavily targeted by other sites. If you’re trying to compete with every other tech blog, yes, you’ll fail. But there are still many under served niches. Let’s walk through an example. I entered “tech blog” in the keyword planner and got back some other related keywords. “Tech blog” itself has a fairly low search volume on Google, only 1–10K per month. But “tech news” gets 100K-1M searches per month. To focus things more, I then searched for “linux blog” which turned up “Ubuntu,” a flavor of Linux, which gets 100K-1M searches per month with low competition. You should probably only use keyword planner as one of several metrics for deciding what is a vibrant, but under served, niche. I’m not sure it tells the whole story. I’d follow up with a general google search on “Ubuntu blog.” You can see in the search results there are several sites devoted to Ubuntu. Look them over and determine whether there’s some aspect they are missing that you can use to distinguish yourself. Here’s one search result that lists the 10 best Ubuntu blogs. It looks like only about four are strictly devoted to Ubuntu. If you’re really passionate about it, you could probably make a dent in that niche. There can be more than one blog on a topic. That’s actually a good thing and shows there’s demand. But if there are already 10 or more large blogs devoted strictly to your niche I’d see if I could focus my niche further. So, after doing your homework to narrow your niche and ensuring there’s demand, I’d choose an obvious name. I searched a few possible domain names and found these available on my first try: http://UbuntuEncyclopedia.com http://Ubuntu2.com http://UltimateUbuntu.com Once you narrow your niche it’s easy to find a name. Obviously, Ubuntu may not be your thing, so explore specific topics you are interested in and see what turns up. I would caution against a generalized tech blog. Stand for something! Narrow your niche! Otherwise, why should anyone read your blog instead of one of the many other tech blogs. Good luck. P.S. Also note that competition in the world of the web is not the same as say, fishermen on a lake. If one fisherman catches a fish in a lake it means that no other fisherman can have that fish. With blogs, many readers read multiple blogs. You can share readers. Some competition is OK and even helpful. ",
            "date": "Answered December 2, 2016",
            "views": "62",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sk Official",
                    "user_href": "/profile/Sk-Official-4"
                },
                {
                    "user_id": "Shashank Shekhar Roy",
                    "user_href": "/profile/Shashank-Shekhar-Roy-2"
                },
                {
                    "user_id": "Hervé Bineli",
                    "user_href": "/profile/Hervé-Bineli"
                },
                {
                    "user_id": "Jason Gordon",
                    "user_href": "/profile/Jason-Gordon-21"
                },
                {
                    "user_id": "Ronald Wafula",
                    "user_href": "/profile/Ronald-Wafula-1"
                },
                {
                    "user_id": "Siddhant Jain",
                    "user_href": "/profile/Siddhant-Jain-299"
                },
                {
                    "user_id": "Jayant Gosain",
                    "user_href": "/profile/Jayant-Gosain"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naseeb Singh",
                "href": "/profile/Naseeb-Singh-8"
            },
            "answer_text": "1. Buzz Feed:- In our top 10 most popular blog in the world, BuzzFeed got 1st rank. BuzzFeed very trusted and popular site below some remarks or BuzzFeed. Got 1st rank on this list Post Rank :-. 1 Alexa rank (global/us) :-. 174/54 {Acc. publish date } Category :-. News Content Value :-. Excellent, 5 star Regular updates :-. Yes User’s friendly:- Yes 2. Business Insider:- In our top 10 most popular blog in the world Business insider got 2nd rank. The business insider very trusted and popular site. Its provide very accurate information about business and other news. Post Rank :-. 2 Alexa rank (global/us) :-. 312/98 Category :-. News Content Value :-. Excellent, 5 star Regular updates :-. Yes User’s friendly:- Yes 3. The Verge:- In our top 10 most popular blog in the world, the verge got 3rd rank. The verge is also a very beneficial and trusted site. the verge provides very fast and good news. You can also check this blog. 3rd position Post Rank :-. 3 Alexa rank (global/us) :-. 400/146 Category :-. News Content Value :-. Excellent, 5star Regular updates :-. Yes User’s friendly:- Yes 4. Gizmodo:- In our top 10 most popular blog in the world, the Gizmodo got 4th rank. The Gizmodo have the news article and latest trending post. Its amazing blog for those loves the latest news. 4th position Post Rank :-. 4 Alexa rank (global/us) :-. 503/151 Category :-. News Content Value :-. Excellent, 5star Regular updates :-. Yes User’s friendly:- yes. If any suggestions regarding answer your welcome tell me via comment section. ",
            "date": "Updated July 26, 2018",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krishna Shrivastava",
                    "user_href": "/profile/Krishna-Shrivastava-25"
                },
                {
                    "user_id": "Prashant Mishra",
                    "user_href": "/profile/Prashant-Mishra-1689"
                }
            ]
        }
    ]
}