{
    "title": "What technology is old, yet still advanced? - Quora",
    "tags": [
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carl Grove",
                "href": "/profile/Carl-Grove-1"
            },
            "answer_text": "Many technologies that we think of as modern actually have origins that go far back in the past. Electricity, for example — we all know about the 1000 year old battery found in Baghdad. The Greeks were making incredibly sophisticated devices employing complex gear trains 2000 years ago. One technology is both old, yet so advanced that it is still not yet really understood — the detection and use of the natural energies of the Earth. Its history is closely connected with the siting and building of ancient stone structures. Observational astronomy goes back many thousands of years. Despite relying upon primitive measurement devices, the ancients came up with surprisingly accurate estimates of stellar and planetary movements, and it was only a few hundred years ago that the Julian calendar, which was derived from ancient Egyptian data, was superseded by the more accurate Gregorian calendar devised originally by Roger Bacon. ",
            "date": "Answered May 5, 2020",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edward W Hackett",
                "href": "/profile/Edward-W-Hackett"
            },
            "answer_text": "I am not sure the period you are looking for when you say “Old.” Landline telephones, fax machines, and answering machines go back to before 1900 and are still in use today. The phones in use today are much improved over the ones that go back 10 or 20 years. Then there is the post office, which some fools want to close down. This service, which is not a business but a service of the government, can trace its roots back to 1775. The actual delivery of the mail is still labor-intensive, but the sorting and processing of the mail, before delivery, has become highly automated. Airplanes have been around in various forms for over 100 years. Balloons have been in use even longer than planes. Submarines were first used in the civil war - not very successfully - they are nuclear now. Moving cargo over the water goes back thousands of years, from oars pulled by slaves, to wind-driven, to steam engines, to diesel engines, and nuclear propulsion. Even something as mundane as cooking has seen significant advances with microwave ovens, steam ovens, and induction cooktops becoming commonplace. Refrigeration has seen vast improvements and, like cooking, is witnessing the introduction of computer technology in everything from motor control to the ability to let you know what items you need to purchase. Computers from huge machines have become small enough to be in watches and embedded in the human body. Radios and television have changed dramatically over time. The list goes on - what old is now new. ",
            "date": "Answered May 5, 2020",
            "views": "150",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jani Kaksonen",
                "href": "/profile/Jani-Kaksonen"
            },
            "answer_text": "Breeding of animals and plants to benefit from them more. This idea and technology is pretty much as old as human race goes - the methodological selection of better genes. It is advanced due despite hightech things allowing direct insertion of gene sequences - the breeding is still very viable option and the breeding has generated hundeds of years worth of science in all eras. Gene tech before even knowing about cells exist and resulting in profound impact on whole history of human race. ",
            "date": "Answered May 5, 2020",
            "views": "81",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Randall Collins",
                    "user_href": "/profile/Randall-Collins-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Oliver Smith",
                "href": "/profile/Oliver-Smith-418"
            },
            "answer_text": "Many technologies come and go but the best ones stay and keep on updating with time. One such technology is Artificial Intelligence or AI. It is relatively old technology and has constantly modified with the changing needs of the people. I have already written a detailed answer to a similar question on Quora. Kindly Click Here to read it. ",
            "date": "Answered May 21, 2020",
            "views": "109",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Olivia Mark",
                    "user_href": "/profile/Olivia-Mark-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Kemper",
                "href": "/profile/Robert-Kemper-4"
            },
            "answer_text": "I have two nominations. Teflon. It introduced the idea of very low friction and adhesion surfaces for everyday use.Velcro. It is amazing stuff. Things can get stuck together pretty firmly, then can be easily separated. Incredible idea. According to one story, Velcro was left behind by the first secret Vulcan visitor to Earth in exchange for some money.",
            "date": "Answered May 5, 2020",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tomas Soto",
                "href": "/profile/Tomas-Soto-10"
            },
            "answer_text": "By far we know that flight was invented on December 17, 1903 by the Wright brothers. However, the Egyptian physician, archaeologist and parapsychologist Khalil Messiha has speculated that the ancient Egyptians developed the first aircraft. In spite of these claims, however, no ancient Egyptian aircraft have ever been found, nor has any other evidence suggesting their existence come to light. Furthermore, although many people seem to give Thomas Savery the credit for inventing the steam engine in 1698, it was actually invented much earlier than that in Alexandria in Ancient Greece. Although Savery created the first modern steam engine and held the patent for its use, it actually wasn't the first that the world had seen. ",
            "date": "Answered May 6, 2020",
            "views": "61",
            "upvotes": "0"
        }
    ]
}