{
    "title": "What are the best neuroscience books for beginners? - Quora",
    "tags": [
        "Neuroscience",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alessandro Crimi",
                "href": "/profile/Alessandro-Crimi-2"
            },
            "answer_text": "Neuroscience is a very broad term for a set of overlapping topics from different disciplines. First of all, I would separate clinical neuroscience from psychological/behavioural/cognitive neuroscience. Then there is computational neuroscience (also called neuroinformatics) which are a series of mathematical models to study or simulate at microscopic level certain aspects of the brain or groups of neurons. Lastly, with the raise of high resolution MRI, we have an emergence of neuroimage which is now a field on its own. Those topics are still full with open questions and complicated concepts. It is hard to mention books which are not superficial and delve a bit. I try… 1. As an introductive book for all aspects I would recommend \"Neuroscience\" by Dale Purves, George J. Augustine, David Fitzpatrick, William C. Hall, Leonard E. White. It is probably among the most used textbook for introductory undergraduate course. I think it is even recommended by a Coursera course from Duke university. I think we are now at least at the 6th edition. The alternative is \"Principles of Neural Science\" by Eric R. Kandel et al.  2. Clinical neuroscience generally entails neurodegeration (Alzheimer's, Parkinson's and similar diseases). Neurodegeneration is still an ongoing trip, so it is better to read most recent papers, and also a good background in molecular biology is required. As an introduction for clinical examination and neuroanatomy, probably the Fitzgerald is a good start  3. For an introduction to neurobiology and some behavioral science I recommend \"Cognitive neuroscience\" of Gazzaniga, Ivry and Mangun.  4. For Neuroimage and brain-connectivity the first book of Olaf Sporns, the alternative is the book of Bullmore, Fornito and Zalesky.  5. Since I can imagine Izhikevich's book are not easy to digest (I had a lot of headaches), a start for computational neuroscience is the Sterrat et al. text.  6. Lastly, if you want to have a broader view, which is not really academic, touches other fields, and are relatively lighter than what I mentioned before, I enjoyed recently the latest books of Antonio Damasio and Sean Carrol (mostly a criticism to Decartes and a revisiting of Schroedinger and Friston)   ",
            "date": "Answered September 9, 2020",
            "views": "905",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harshpreet Kaur",
                    "user_href": "/profile/Harshpreet-Kaur-43"
                },
                {
                    "user_id": "Noma Mothoa",
                    "user_href": "/profile/Noma-Mothoa"
                },
                {
                    "user_id": "Tomo Matic",
                    "user_href": "/profile/Tomo-Matic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Ven",
                "href": "/profile/Harry-Ven"
            },
            "answer_text": "Well, well! I never expected my journey to build products to come to where I am today - an obsession with Neuroscience! When you try to build a product that people love, you end up focusing on “what is that people really want?” . This search took me on a path of academic papers and books on biology, social psychology and yes.. Neuroscience. So without further ado, here are few Neuroscience books that I understood as a beginner and would suggest to anyone who wants to get started. The Strange Order of Things I first came across Antonio Damasio in the Ted Talk about brain and feelings - The quest to understand consciousness. Antonio Damasio is one of the prominent figures in Neuroscience who talks predominantly about feelings. Strange order of things talks about Homeostasis, our feelings and the place of our neural functions in our Survival. In short a biology and neuroscience explanation of “why we do what we do” This book is a perfect book for anyone who wants to understand the basics of our biology and brain on which all the complex culture and systems of today has been built. 2. My Stroke of Insight  A Harvard brain-scientist gets a stroke and she watches as her condition deteriorates where she’s not able to talk, walk, read or write. The book is the account of the scientist and her specific insights about brain through the experience. 3. Phantoms in the brain  The author, V.S Ramachandran takes weird behaviour of brain such as phantom pain in lost legs of the victim, to explain and understand the functions of different parts of the brain. 4. How much brain do we really need  5. The Runaway species  6. How to create a mind  ",
            "date": "Answered October 2, 2018",
            "views": "10",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaithanya Kumar",
                    "user_href": "/profile/Chaithanya-Kumar-94"
                },
                {
                    "user_id": "Fitty P",
                    "user_href": "/profile/Fitty-P"
                },
                {
                    "user_id": "JaQuez Adkins",
                    "user_href": "/profile/JaQuez-Adkins"
                },
                {
                    "user_id": "Ashley Gabika",
                    "user_href": "/profile/Ashley-Gabika"
                },
                {
                    "user_id": "Neet B. Shukla",
                    "user_href": "/profile/Neet-B-Shukla"
                },
                {
                    "user_id": "Mechatron",
                    "user_href": "/profile/Mechatron-1"
                },
                {
                    "user_id": "Widiya Nurcahya",
                    "user_href": "/profile/Widiya-Nurcahya-1"
                },
                {
                    "user_id": "Kim In",
                    "user_href": "/profile/Kim-In-3"
                },
                {
                    "user_id": "Michiko Reynolds",
                    "user_href": "/profile/Michiko-Reynolds"
                },
                {
                    "user_id": "Fatemeh Faezi",
                    "user_href": "/profile/Fatemeh-Faezi"
                }
            ]
        }
    ]
}