{
    "title": "What are the cheapest online shopping sites? - Quora",
    "tags": [
        "Online",
        "Online Shopping",
        "Shopping"
    ],
    "response": [
        {
            "author_info": {
                "name": "Usman Ali",
                "href": "/profile/Usman-Ali-2246"
            },
            "answer_text": "Let’s be honest, grocery shopping can be expensive, especially when you go in only needing a few essentials like milk and bread, then come out with a cart-full of foods you didn’t even know you were craving (we’re looking at you, Cheese-Itz). While many stores have sales, there are other ways to sneak in some great and surprising deals that stores don’t want you knowing about. What I’ve been doing for the last couple of years is called simple price watching. Many websites now give you the option to track down the best price on the majority of groceries and if you’re a regular shopper who plans their shopping list, it’s easy to track down items that you really need. Here are some of the services that I’ve tried in the last couple of years: ● https://www.kupino.com ● https://www.groupon.com ● https://www.tiendeo.us ● https://slickdeals.net There are also other ways to sneak in some deals, which don’t necessarily include price-watching technique and these are: Couponing: You can pretty much find coupons anywhere if you try hard enough. First, there are flyers. A lot of stores and even local newspapers and magazines store coupons in their pages. There are also many online sites that are solely for finding coupons. Apps like Weekly Ads and Hot Deals from 120,671 Stores | Kupino.com or Groupon® Official Site | Online Shopping Deals and Coupons | Save Up to 70% off hundreds of deals and offers, dissecting them by store or product for quick and easy finds.Meat Portioning Technique: Don’t be shy, when you’re getting meat from the Deli section, ask the butcher for the whole thing. For example, buy a roast, have the butcher remove the bone (and use it for soup), run half of the roast through the grinder for chopped meat, and then take the leftover for a pot roast. That portion control saves about 30%, compared to buying sliced meat.Price-per-unit comparison: Check out the pricing labels on the shelves. Compare unit prices and sales prices. This is the cost of the item per unit. If the slightly-higher-priced item has a smaller unit price, you’ve got a bargain.Cashback: If you’re going to spend, you might as well make some of that money back. Cashback reward programs are sometimes offered from credit card companies, and a percentage of the amount spent is paid back to the card holder.Source: Buzzfeed ",
            "date": "Answered October 2, 2020",
            "views": "244",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sunkiss Chel",
                "href": "/profile/Sunkiss-Chel-2"
            },
            "answer_text": "Finding cheap B2B websites is actually very simple. You can search many B2B websites on Google. Nowadays, the digital network is developing rapidly and the price is very cheap. Among them, some wholesale websites are worth trying. 1. Alibaba A well-known and prestigious online trading platform. No one, including me, can deny the excellence and influence of this website, but I think it is difficult to find a product suitable for your business due to the large number of wholesalers and the same products. That being said, the website is the most famous name in the block trading industry and works with numerous wholesale online traders and manufacturers worldwide. If you want to find buyers through this website, you can register and publish 50 products for free, but please note that it will take a lot of time and luck. 2.FashionTIY This is a large multi-category wholesale website in the United States. This is the best online wholesale market for men's and women's fashion, jewelry, accessories, beauty, luggage, shoes, home and gardening, weddings and parties. There is no MOQ limit. Provide the greatest discount and value to ensure you always get the best price. This is a wholesale shopping website with high-quality global shopping experience. 3. eBay They have a large category dedicated to various products. Here you can find the products you need. They collected a huge catalog of wholesale suppliers, distributors, and listed millions of products, covering every style and taste. 4.lightinthebox The website already has tens of millions of registered customers from all over the world, and the cumulative shipping destination countries are as many as 200, covering continents, Asia, Western Europe, the Middle East, South America and Africa. The company also won Paypal 2008 Best Innovative Company and other awards. It covers 14 categories, including clothing, electronics, toys, accessories, household goods and sporting goods. 5. Amazon Amazon has many original products. Delivery is faster. Easy to return and replace. If it is returned, the refund will begin immediately and the refund will be credited within one day. ",
            "date": "Answered October 20, 2020",
            "views": "187",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        }
    ]
}