{
    "title": "What are the leading companies in the voice recognition software space? - Quora",
    "tags": [
        "Siri (software)",
        "Speech Recognition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Franck Dernoncourt",
                "href": "/profile/Franck-Dernoncourt"
            },
            "answer_text": "Foreword: as often, there are different measures to determine which companies are the leaders (number of users, market capitalization, revenues, etc.) Voice Recognition Software Developers in the US Industry Market Research Report Now Available from IBISWorld :  Revenue for the Voice Recognition Software Developers industry is expected to increase an average of 2.3% annually to $1.1 billion over the five years to 2012. In 2012 alone, industry revenue is expected to grow 5.0% due to a 7.9% increase in private investment in computers and software.  Market share concentration within the Voice Recognition Software Developers industry is moderate. The four largest players account for over 50.0% of industry revenue. The two largest players, Nuance Communications and MModal, have rapidly expanded their share of the market during the past five years. Nuance has grown by an average of 18.2% per year as a result of its aggressive acquisition streak. The company has purchased eight other players to enhance its product offerings and reach new markets. Meanwhile, MModal has increased its US industry-specific revenue at an average annual rate of 5.3% due to its own high level of acquisitions. As such, these players have outpaced industry growth and captured an increasing share of the market. For more information, visit IBISWorld’s Voice Recognition Software Developers in the US industry report page. I believe Google will become a key player very soon, as it gathers a huge amount of voice data. Microsoft, through its Windows built-in speech recognition, might also become a very strong player soon.  Related:List of speech recognition software PS: On 30 September 2011, Nuance (one of Loquendo's main competitors) announced that it had acquired Loquendo. http://www.nuance.com/company/news-room/press-releases/Nuance-Closes-Acquisition-of-Loquendo%5B1%5D.doc ",
            "date": "Answered November 29, 2012",
            "views": "141",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ronald Ruslan",
                    "user_href": "/profile/Ronald-Ruslan-1"
                },
                {
                    "user_id": "Alex Sadovsky",
                    "user_href": "/profile/Alex-Sadovsky"
                },
                {
                    "user_id": "Nhat Lan",
                    "user_href": "/profile/Nhat-Lan"
                },
                {
                    "user_id": "Bharathy Saravanan",
                    "user_href": "/profile/Bharathy-Saravanan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Holsinger",
                "href": "/profile/Dave-Holsinger"
            },
            "answer_text": "Nuance is almost certainly the biggest, and recently acquired both SVOX and Loquendo, who were some of its few remaining competitors. Note that Apple uses Nuance's technology for Siri.  IBM has now sold off most of its speech assets to Nuance as well. Microsoft has desktop, server, and mobile speech rec software as well as being part of Ford SYNC. Google has developed its own recognition engine but does not license its use. Vlingo Is a smaller player but a competitor to Google, Nuance, and Microsoft's mobile applications. It licenses ASR from AT&T. ",
            "date": "Updated November 16, 2011",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Brewer",
                    "user_href": "/profile/Steve-Brewer-16"
                },
                {
                    "user_id": "Felix Singerman",
                    "user_href": "/profile/Felix-Singerman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Local 1 Page",
                "href": "/profile/Local-1-Page"
            },
            "answer_text": "Best For Dragon Naturally Speaking offers solutions for business professionals, and those in the legal field, allowing them to create and streamline documents for faster turnaround. Product Details The industry leading speech recognition software used by doctors, lawyers, and other professionals to convert speech into text. Starting at $119.99 for the Premium Edition, Dragon has been used by thousands of professionals for dictation and transcription for over 30 years. Runs on both Windows and Mac platforms. Web:- https://wadeprogram.com/ ",
            "date": "Answered January 21, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prajakta Hebbar",
                "href": "/profile/Prajakta-Hebbar"
            },
            "answer_text": "Uniphore’s speech analytics product “auMina” and virtual assistant product “akeira” are attracting attention and winning customers all across the globe right now. ",
            "date": "Answered December 1, 2017",
            "views": "839",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Pearson",
                "href": "/profile/Gary-Pearson"
            },
            "answer_text": "www.verbyx.com ",
            "date": "Answered November 16, 2011",
            "views": "616",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leo Liu",
                    "user_href": "/profile/Leo-Liu-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Temitope Ola",
                "href": "/profile/Temitope-Ola"
            },
            "answer_text": "Koemei offers a cloud-service (currently in beta) for speech recognition with specific focus on conversation. www.koemei.com ",
            "date": "Answered November 16, 2011",
            "views": "36",
            "upvotes": "0"
        }
    ]
}