{
    "title": "What products are available to help autistic children communicate? - Quora",
    "tags": [
        "Asperger Syndrome",
        "Autism",
        "Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clare Celea",
                "href": "/profile/Clare-Celea"
            },
            "answer_text": "Autistic children are highly visual, so visual communication tools are in common use. These may be PECS - Picture Exchange Communication System - or other visuals. Here is an example of PECS:   Sign language is also used to aid communication with ASD children. Even a very verbal child may find that their ability to process verbal instructions breaks down when they are anxious or distressed, so many carers/parents use simple (or complex) signs as a means of reinforcing verbal communication. It's often beneficial to reduce one's language dramatically in situations of stress. Neurotypical adults have a tendency to keep talking until the child complies, but this is exactly the wrong thing to do with an ASD kid. They often need more time to process verbal instructions anyway, and each time you repeat it you restart the whole process, which means it takes longer, you get more annoyed, the child gets more anxious, and now there's a meltdown. And the kid may not be too happy either ;)  NTs pad out their requests in lots of language. This is how we communicate courtesy and respect to each other, and model polite behaviour to our kids.  'Mary love, could you please go and put your shoes on? We're going to be late if we don't get going. They're right by the front door. Thank you sweetheart, that's very helpful.' Nice, right? Loving, kind, yet clear. No difficulties there, right?  Wrong. If you have a child with verbal processing issues (and if we're talking ASD that is extremely likely), you've just given them a tightly wrapped, densely layered parcel of communication that they have to unpack to try to find the actual instructions. Here's what I say to my son. \"Joshua? Shoes on.\" That's all he needs. Additional verbal frills are not 'nice'. They're not 'polite'. They are directly impeding his ability to understand and comply with my instructions. This was hard for me to learn, as an NT and fairly verbose individual. But as with so much in parenting, it isn't about what is comfortable for me. It's about what's right for my child. (PECS pic Taken from http://homepages.wmich.edu) ",
            "date": "Answered November 19, 2013",
            "views": "16",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Ireland",
                    "user_href": "/profile/George-Ireland-3"
                },
                {
                    "user_id": "Coreen Csicseri Montagna",
                    "user_href": "/profile/Coreen-Csicseri-Montagna"
                },
                {
                    "user_id": "Lisa Galarneau",
                    "user_href": "/profile/Lisa-Galarneau"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/AH-25"
                },
                {
                    "user_id": "Sonnet Fitzgerald",
                    "user_href": "/profile/Sonnet-Fitzgerald"
                },
                {
                    "user_id": "Eivind Kjørstad",
                    "user_href": "/profile/Eivind-Kjørstad"
                }
            ]
        }
    ]
}