{
    "title": "What are some disadvantages modern technology has brought us? - Quora",
    "tags": [
        "Modern Technology",
        "Pros and Cons",
        "List Question",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Imtiyaz Ahmed",
                "href": "/profile/Imtiyaz-Ahmed-41"
            },
            "answer_text": " There are many disadvantages of technology, ehich include and are not limited to safety, price, effect on economy, employment and more. Safety: While the exact risk is not known and has not been proven technology such as mobile phones can be harmful to our body or brain because of the radiation. Any device which is electrical can still be defined as the homology so an x ray is technology and x ray has it's own risk and there currently isn't any technology I'm aware of which protects against that. Then there's also risk in terms of batteries. St the moment battery technology hasn't advanced yet so lithium ion batteries are still being used. As the case with the Samsung galaxy note 7, it is clear what can happen with a defective battery and how it can easily catch on fire and the danger of that. With the rise of electric cars there is another risk, while the cars catching on fire may be less likely because there is no combustion process there is still a chance of fire because of electrics, but it is less likely, however electrocution could be another risk. Reliance: The reliance of technology and it's automation when it isn't replacing jobs is making us more dependent and less skilled. We rely on technology to do things because they can do it for us, this has ultimately led to plane crashes because pilots, sometimes even experienced ones have relied on the auto pilot to do something and just expecting it to happen and when it doesn't they panicked and they made other errors too which has led to a crash. Effect on people: Technology can also be a distraction and addiction, certain people are still using their phone whole driving. The affordability, availibity and portability of technology now means kids are now being given technology at a a young age may mean they do not have as much real life experiences and are not going out which is not good for their social development and may mean they do not have as much awareness and understanding of the world around them. In addition, the use of home assistance can lead to children being more commanding and expecting things because voice assistants listen to a command regardless of how it is asked. In addition, tests have shown that the use of technology makes us less likely to remember experiences and events when a phone is used but also being on the person. Effect on employment and economy: The use of technology will mean that low skill jobs will be replaced, so jobs will be lost leading to higher unemployment rates. Some may argue that if it is low skilled job it should have been replaced anyway, but there is also the effect on the economy. People pay tax, until or unless there is a robot tax, then less money will be paid in tax if technology like robots replace people. The cost of the technology itself is expensive and must be recovered. Security: Technology can make things which are usually very secure unsecure. Cars now using keyless fobs has led to criminals using key jammers, to break into cars without the keys when previously you would need to have the physical key to do it. Any technology becoming connected makes it susceptible to bring hacked, security devices could be hacked and disabled by criminals, or it could be used by criminals to spy on people, a criminal only needs to hack into your wireless network to be able to access and control any of the smart devices in your home so they can cause all sorts of problems. There are countless disadvantage but these are the common, equally there are many advantages which make up for it or which have to be weighed up in order to decided if it is worth the risk. While technology can be risky, risks have to be taken, e.g. If security was such a concern there would be no Facebook for example. Thanks for reading! Hope this helps! ",
            "date": "Updated November 12, 2019",
            "views": "926",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Govt High School Ruknewala",
                    "user_href": "/profile/Govt-High-School-Ruknewala"
                },
                {
                    "user_id": "Krisgail Garcia",
                    "user_href": "/profile/Krisgail-Garcia"
                },
                {
                    "user_id": "Ahmed Sadek",
                    "user_href": "/profile/Ahmed-Sadek-83"
                },
                {
                    "user_id": "Anne Vinluan",
                    "user_href": "/profile/Anne-Vinluan-1"
                },
                {
                    "user_id": "Jacob Langford",
                    "user_href": "/profile/Jacob-Langford-13"
                },
                {
                    "user_id": "Kristina Karas",
                    "user_href": "/profile/Kristina-Karas-2"
                },
                {
                    "user_id": "Vamisetti Gowtham",
                    "user_href": "/profile/Vamisetti-Gowtham"
                },
                {
                    "user_id": "Siddharth Shrivastava",
                    "user_href": "/profile/Siddharth-Shrivastava-32"
                },
                {
                    "user_id": "Abishek Harikrishnan",
                    "user_href": "/profile/Abishek-Harikrishnan"
                },
                {
                    "user_id": "Vabishya Magar",
                    "user_href": "/profile/Vabishya-Magar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jane Parker",
                "href": "/profile/Jane-Parker-157"
            },
            "answer_text": "1. Data Security Digital technology means that vast amounts of data can be collected and stored. This can be private information concerning individuals or organizations. It can be very difficult to keep this data safe. Just a single breach can mean vast amounts of private information going into the hands of criminals, terrorists, foreign enemies, or other malign entities. 2. Crime and Terrorism The internet is fertile territory for malevolent forces to operate, thanks to its international nature, large scale, and the relative anonymity that users can enjoy. Examples of this include: terrorists using social media to promote themselves and encourage others; drug dealers using the dark web to trade; pedophiles using chat rooms and other places to exchange photos, videos and other information; and authoritarian regimes attempting to sway or distort elections in democratic countries. We have become a people unable to comprehend the technology we invent. — Association Of American Colleges, Report, Integrity in the College Curriculum (Feb 1985). 3. Complexity We no longer understand the devices and machines that we interact with on a daily basis. Fixing a modern car now means interacting with a computer, it is no longer just mechanical. Using a phone can involve tackling all sorts of complicated settings. Minor glitches in a laptop can cost both time and expense. 4. Privacy Concerns It's become much harder to have personal privacy in the digital world and that's on top of the dangers of your personal data being stolen or sold. For instance, everybody has the ability to take photos and video footage on their mobile phone, then post it online. Employers can search for people online and maybe find unflattering photographs, or see them expressing controversial opinions in social media or blogs. Digital cameras watch and record our movements in public places. Minor indiscretions can now haunt an individual for life when they're posted on the internet. Controlling your personal information is very difficult and sometimes impossible. 5. Social Disconnect There is an increasing tendency for people to socialize and communicate via digital devices rather than through real life contact. This can easily lead to a sense of disconnect and isolation. Human beings have evolved over thousands of years to have real contact, taking that away is a bad idea. Studies have suggested that the lack of real life contact is causing depression and other forms of mental illness in many people.  There are a number of psychological studies suggesting that the digital world is causing an increased risk of mental illness. Examples include reliance on social media for contact, online bullying, and work stress through information overload. | Source 6. Work Overload Many modern workers spend their days trying to keep up with the hundreds of emails that they are sent each week, all of which require reading and some of which require replies or action. Texts from colleagues in the evenings or on the weekend can mean that people never fully escape work. Organizing the vast amount of digital data acquired in some jobs, such as minutes of meetings, training videos, photographs, reports can also be a huge headache. 7. Digital Media Manipulation Digital media such as photographs, audio, and video are easy to edit, making the manipulation of media widespread. It's not always easy to tell what is real and what is fake anymore. Photographs can be altered using editing tools such as Photoshop. Digital audio and video can be doctored. 8. Job Insecurity It used to be that you had to be physically present at a workplace to do a job, but now many work tasks are performed remotely via the internet. That means a Third World worker in a low wage economy can undercut you and take your job. Increasingly, humans aren't needed at all for many tasks, as computers gradually replace them. Driving jobs, for instance, will disappear soon as vehicles become self-driven. Technology is so much fun but we can drown in our technology. The fog of information can drive out knowledge. — Daniel J. Boorstin, speaking on the computerization of libraries. 9. Plagiarism and Copyright Digital media is remarkably easy to copy and reproduce. Copyright laws are increasingly hard to enforce, as the music and movie industries have discovered to their cost. School kids can copy and paste their homework projects without really learning anything. 10. Anonymity and Fake Personas Digital technology provides wide scope for users to hide their identities. Studies show that people are much more likely to behave anti-socially if they don't think that there will be any consequences. Bullying, trolling, stalking, threatening, and insulting behavior have all increased dramatically with the rise of the internet. People assume fake personas for the purposes of scamming and defrauding. Pedophiles use fake personas to gain access and befriend children. 11. Over-reliance on Gadgets Reliance upon mobile phones, computers, and other digital gadgets has become common. Many people have all their contact information, photographs, texts, and other personal information on their phones. If they lose them, or the gadget breaks or runs out of power, then they are in trouble. Basic living skills, like finding one's way around the streets of a town, have been replaced by taking directions from a GPS system.  Computer gaming addiction can cause multiple problems for users caught up in it. Consequences include negative effects on social life, finances, academic achievement, sleep patterns, as well as emotional and health problems. | Source 12. Addiction Social media, computer games, messaging, and dating websites can all be addictive. Games want you to play so that you will buy the next version. Websites want you to interact so that they can bring in advertising money. Users end up wasting vast amounts of time and hemorrhaging money for low return. 13. Second-hand Living Many people no longer experience real life events directly. Music concerts or live shows are videoed on mobile phones, events are photographed, audio is recorded. Media is uploaded onto social sites. Life becomes something that is experienced through the prism of digital media rather than at first hand. Technology [is] the knack of so arranging the world that we don't have to experience it. — Max Frisch, Homo Faber (1957) 14. Organization and Storage Digital media can be very difficult to organize. Photos and music, for instance, can be located on numerous devices, such as mobile phones, tablets, laptops, and portable hard drives. Individual items can be hard to find, easy to accidentally delete or lose, and the device they are stored on can be lost, stolen, or suffer catastrophic malfunction. Digital media can be difficult to store and maintain long term. File formats change over time. In some instances traditional media can last longer than their digital equivalent. 15. Depersonalized Warfare Digital technology means that weapons can be deployed anywhere in the world without any human military presence. Drones turn war into a computer game. Intercontinental missiles follow streets and landmarks in foreign countries remotely. Satellites photograph and video from space. 16. Longevity Digital gadgets typically have a short lifespan and become archaic quickly. As the technology advances at a pace, devices and machines quickly become unusable because they are too slow, incompatible, or are simply superseded.  Much of life's tasks can now take place without leaving the house. The downside to this is that society is becoming increasing depersonalized. | Source 17. Social Depersonalization Society continues to become more and more depersonalized as digitized machines replace humans. People shop online, do their banking online, pay bills online, and increasingly work online. Transport is also set to become automated, which will result in taxis and delivery vehicles being driver free. Source 17 Disadvantages of Digital Technology ",
            "date": "Answered April 29, 2020",
            "views": "4",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Daisy",
                    "user_href": "/profile/Daisy-793"
                }
            ]
        }
    ]
}