{
    "title": "What is the full form of wifi? - Quora",
    "tags": [
        "Abbreviations",
        "Wireless Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sagar Pokhrel",
                "href": "/profile/Sagar-Pokhrel"
            },
            "answer_text": "The Wi-Fi Alliance, the organization that owns the Wi-Fi registered trademark term specifically defines Wi-Fi as \"wireless local area network (WLAN) products that are based on the Institute of Electrical and Electronics Engineers' (IEEE) 802.11 standards.\" Wi-Fi works with no physical wired connection between sender and receiver by using radio frequency (RF) technology, a frequency within the electromagnetic spectrum associated with radio wave propagation. When an RF current is supplied to an antenna, an electromagnetic field is created that then is able to propagate through space. It's abbreviated form evolved later on as Wireless Fidelity because of the fact that many tech giants, researchers and even organizations related to WiFi Alliance refer this as full form of WiFi in their journals and publications. Also, majority of computer science academic text books mentioned this as full form, we can take it without getting confused but the fact is different and is not actually the full form introduced by WiFi Alliance officially. In fact: A number of the Wi-Fi Alliance squad even were confused by this gibberish term and tried to make sense of it so consumers wouldn't be quite so confused. They decided to add the tagline \"The Standard for Wireless Fidelity\" along with the name Wi-Fi in marketing communications but that was not used later on in other publications. So result, WiFi doesn’t stands for anything officially ! According to webopedia, The false notion that the brand name \"Wi-Fi\" is short for \"wireless fidelity\" has spread to such an extent that even industry leaders have included the phrase wireless fidelity in a press release. You'll also find references to Wi-Fi being short for wireless fidelity on a number of well-known and respected technology-focused publications and websites. The truth is, Wi-Fi isn't short for anything — and it never was.  (Image: wifi humor) To learn more about this technology, you may follow my SlideShare link here Wireless Fidelity (WiFi) Thanks ! #geeksagar References and Image: Wi-Fi Alliance/ Wi-Fi Definition is Not Wireless Fidelity Wi-Fi Doesn't Actually Stand For Anything ",
            "date": "Answered April 16, 2018",
            "views": "224",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swachith Lokini",
                    "user_href": "/profile/Swachith-Lokini"
                },
                {
                    "user_id": "Dk",
                    "user_href": "/profile/Dk-685"
                },
                {
                    "user_id": "Myntram Kumar",
                    "user_href": "/profile/Myntram-Kumar"
                },
                {
                    "user_id": "Bestus Sekar",
                    "user_href": "/profile/Bestus-Sekar"
                },
                {
                    "user_id": "KABERI ROY",
                    "user_href": "/profile/KABERI-ROY-5"
                },
                {
                    "user_id": "Diwakar Vats",
                    "user_href": "/profile/Diwakar-Vats"
                },
                {
                    "user_id": "Suraj Bhattarai",
                    "user_href": "/profile/Suraj-Bhattarai-21"
                },
                {
                    "user_id": "Sandeept (Ankit) Dhakal",
                    "user_href": "/profile/Sandeept-Ankit-Dhakal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Grimshaw",
                "href": "/profile/Paul-Grimshaw-6"
            },
            "answer_text": "What is the full form of WiFi? This question will no doubt get merged into similar questions on Quora asking what the “WiFi” name is short for. But whilst it’s separate I’ll add my take. Phil Belanger, the person within the IEEE 802.11 network standards working group that define the WIFi standards and chose the name, has made it very clear that the name “WiFi” was presented to the group amongst a selection of options for the brand name without any further meaning. It was not short for anything. Once it had been chosen however, a tag line “The standard for wireless fidelity” was subsequently added and used for a while, effectively excusing and explaining the otherwise meaningless choice of brand name, after the fact. The tag line was later dropped as a mistake, as it diluted the brand name. So the correct answer is that “WiFi” is itself the full form of “WiFi”. This said, it’s interesting to speculate on the thoughts of the marketing people who dreamt up the brand name. These thoughts appear not to have been published, but it’s very tempting to imagine that it arose from a play on words: An abbreviation of wireless physical layer, or “wireless phy”, phy itself being a recognised abbreviation for “physical layer”A convenient synergy with the well known term “Hi-Fi”, meaning high fidelity in terms of audio reproductionBut to be clear, this is no more than speculation, and as with many brand names the original derivation was intentionally not carried forward to be a part of the brand. The whole point was to leave this to the imagination of the public, encouragement of this imagination in itself helping to establish the brand. In fact nowadays the WiFi brand has become a lot more than was originally intended. For very many people “WiFi” is now synonymous with internet, as its most common usage is in allowing devices to access the internet. To just about anybody, phrases such as “Do you have WiFi?” or “I have a problem with my WiFi” actually refer to (wireless) access to the internet. ",
            "date": "Updated August 6, 2018",
            "views": "94",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Saurabh Singh",
                    "user_href": "/profile/Saurabh-Singh-1037"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hemanth Kumar",
                "href": "/profile/Hemanth-Kumar-1102"
            },
            "answer_text": "First of all, Wi-Fi is just Wi-Fi nothing more than that. No abbreviation, no short term ntn. Wi-Fi is the name of a wireless networking technology that uses radio waves to provide high-speed network and Internet connections. The Wi-Fi Alliance, the organization that owns the Wi-Fi (registered trademark) term specifically defines Wi-Fi as \"wireless local area network (WLAN) products that are based on the Institute of Electrical and Electronics Engineers' (IEEE) 802.11 standards.\" Initially, Wi-Fi was used in place of only the 2.4GHz 802.11b standard, but the Wi-Fi Alliance has expanded the generic use of the Wi-Fi term to include any type of network or WLAN product based on any of the 802.11 standards, including 802.11b, 802.11a, dual-band, and so on, in an attempt to stop confusion about wireless LAN interoperability. What is Wireless Fidelity? A common misconception is that the term Wi-Fi is short for \"wireless fidelity.\" This is not the case. Wi-Fi is simply a trademarked term meaning IEEE 802.11x. The false notion that the brand name \"Wi-Fi\" is short for \"wireless fidelity\" has spread to such an extent that even industry leaders have included the phrase wireless fidelity in a press release. You'll also find references to Wi-Fi being short for wireless fidelity on a number of well-known and respected technology-focused publications and websites. The truth is, Wi-Fi isn't short for anything — and it never was. The current confusion seems to stem from a brief period early in the days of the Wi-Fi Alliance when a regrettable tag line was added that stated, 'The Standard for Wireless Fidelity.' This was not part of the original name and was not created by Interbrand, but it was added as an afterthought in an attempt to help users make sense of the new and somewhat nonsensical word, Wi-Fi. Regards Hemanth ",
            "date": "Answered January 20, 2018",
            "views": "191",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "IT Pc One",
                    "user_href": "/profile/IT-Pc-One"
                },
                {
                    "user_id": "Hemanth",
                    "user_href": "/profile/Hemanth-338"
                },
                {
                    "user_id": "Stephen Wright",
                    "user_href": "/profile/Stephen-Wright-114"
                },
                {
                    "user_id": "Kean Sakata",
                    "user_href": "/profile/Kean-Sakata-1"
                },
                {
                    "user_id": "Ugyaen",
                    "user_href": "/profile/Ugyaen"
                },
                {
                    "user_id": "Disha Jain",
                    "user_href": "/profile/Disha-Jain-118"
                },
                {
                    "user_id": "Shekar 's",
                    "user_href": "/profile/Shekar-s-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Basel Fowler",
                "href": "/profile/Basel-Fowler"
            },
            "answer_text": "The answer is: I explicitly attribute this answer to Vangie Beal a freelance writer, covering business and Internet technology for more than a decade. She is also managing editor of Webopedia.com. She is based in Nova Scotia, Canada. Following is her answer to “What is the full form of wifi?” A common misconception is that the term Wi-Fi is short for \"wireless fidelity.\" This is not the case. Wi-Fi is simply a trademarked term meaning IEEE 802.11x. The false notion that the brand name \"Wi-Fi\" is short for \"wireless fidelity\" has spread to such an extent that even industry leaders have included the phrase wireless fidelity in a press release. You'll also find references to Wi-Fi being short for wireless fidelity on a number of well-known and respected technology-focused publications and websites. The truth is, Wi-Fi isn't short for anything — and it never was. The current confusion seems to stem from a brief period early in the days of the Wi-Fi Alliance when a regrettable tag line was added that stated, 'The Standard for Wireless Fidelity.' This was not part of the original name and was not created by Interbrand, but it was added as an afterthought in an attempt to help users make sense of the new and somewhat nonsensical word, Wi-Fi. ",
            "date": "Updated June 14, 2020",
            "views": "395",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Habibi Bezi",
                    "user_href": "/profile/Habibi-Bezi"
                },
                {
                    "user_id": "Pranay Dwivedi",
                    "user_href": "/profile/Pranay-Dwivedi-7"
                },
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Sajidul Hoque",
                    "user_href": "/profile/Sajidul-Hoque-9"
                },
                {
                    "user_id": "Thiru Venkatesh",
                    "user_href": "/profile/Thiru-Venkatesh-9"
                },
                {
                    "user_id": "Kraj Chetry",
                    "user_href": "/profile/Kraj-Chetry"
                },
                {
                    "user_id": "Keith Wiemerslage",
                    "user_href": "/profile/Keith-Wiemerslage"
                },
                {
                    "user_id": "Arya Bhagwat",
                    "user_href": "/profile/Arya-Bhagwat-1"
                },
                {
                    "user_id": "Amey Varhade",
                    "user_href": "/profile/Amey-Varhade"
                },
                {
                    "user_id": "Harshal Pathak",
                    "user_href": "/profile/Harshal-Pathak-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shridhar Deshpande",
                "href": "/profile/Shridhar-Deshpande-2"
            },
            "answer_text": "WiFi stands for wireless fieldity. What it does, is establish a Local Area Network (which was done using wires prior to WiFi). It was used for Laptop Computers some years ago, but then technology allowed it to be incorporated in mobile phones.  The network consists of one or more Router(s) and clients. Most WiFi routers allow connection between devices connected to its network. However some do not, for security reasons. WiFi uses radio frequencies 2.4 GHz (there are three types that use this: 802.11 B,G and N) and 5.0 GHz (802.11 e) (not so sure about this, edits welcome) Sometimes ADSL and cable (rarely) modems are integrated in wireless routers. There are some devices which use mobile networks for internet access and create a WiFi network around them for clients.  Nowadays there are phones which can do the above and computer applications which can share the wired internet connection they have. Usually domestic use of WiFi is mainly to access internet, and sometimes for device to device connection. ",
            "date": "Answered January 27, 2016",
            "views": "78",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Evelyn Martin",
                    "user_href": "/profile/Evelyn-Martin-83"
                },
                {
                    "user_id": "Dipti Sharma",
                    "user_href": "/profile/Dipti-Sharma-317"
                },
                {
                    "user_id": "Lining Wang",
                    "user_href": "/profile/Lining-Wang-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eva Evie",
                "href": "/profile/Eva-Evie-1"
            },
            "answer_text": "The Full form of WI-FI is local area wireless technology. WI-FI is a wireless networking technology that uses radio waves to provide high-speed network and Internet connections. Introduced in September 1997, the name Wi-Fi also stands for Wireless Fidelity as it is synonymous with WLAN (Wireless Local Area Network). Wi-Fi allows computers, video-game consoles, smart phones, digital cameras, tablet computers, digital audio players, modern printers and other devices to communicate over a wireless network. Originally licensed by the Wi-Fi Alliance, Wireless Fidelity is a brand to describe the underlying technology of wireless local area networks (WLAN). Wireless access point (WAP) connects a group of wireless devices to an adjacent wired LAN. Wi-Fi networks don’t have any physical wired connection between the sender and receiver. By using radio frequency (RF) technology – a frequency within the electromagnetic spectrum associated with radio wave propagation and when an RF current is supplied to an antenna, an electromagnetic field is created that then is able to propagate through space. It is based on the IEEE 802.11 specifications. ",
            "date": "Answered April 7, 2020",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "K M Raju",
                    "user_href": "/profile/K-M-Raju-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Quora User",
                "href": "/profile/Tech-With-Tech-2"
            },
            "answer_text": "The Full Form of Wi-Fi IS NOT Wireless Fidelity Wi-Fi is a registered trademark. It’s registered to the Wi-Fi Alliance, which used to be called the Wireless Ethernet Compatibility Alliance. The official spelling is, in fact, Wi-Fi. A founding member of the Wi-Fi Alliance, Phil Belanger, gave the actual history of the term Wi-Fi in 2005.  The Wi-Fi Alliance had developed a technology that operated on IEEE 802.11, and Belanger said that they needed a term “that was a little catchier than ‘IEEE 802/11b Direct Sequence.” They actually hired another company, Interbrand, to come up with a name. They sent over 10 options, including Wi-Fi. Interbrand is known for coming up with names that are meaningless, but catchy, with the idea being to create an association with a product, but to allow the product to be its own definition. Thus, Wi-Fi is just a made up word. Continue reading: Wi-Fi Full Form Demystified: What’s the Full Form of the Wi-Fi Acronym? ",
            "date": "Updated July 9, 2020",
            "views": "663",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ajeet",
                    "user_href": "/profile/Ajeet-51"
                },
                {
                    "user_id": "Anna Melnik",
                    "user_href": "/profile/Anna-Melnik-12"
                },
                {
                    "user_id": "Evgenii Lenkin",
                    "user_href": "/profile/Evgenii-Lenkin"
                },
                {
                    "user_id": "Margo Gurova",
                    "user_href": "/profile/Margo-Gurova"
                },
                {
                    "user_id": "Alexey Timofeev",
                    "user_href": "/profile/Alexey-Timofeev-7"
                },
                {
                    "user_id": "Kata1045",
                    "user_href": "/profile/Kata1045"
                },
                {
                    "user_id": "Andru Babuta",
                    "user_href": "/profile/Andru-Babuta"
                },
                {
                    "user_id": "Sergey Sedov",
                    "user_href": "/profile/Sergey-Sedov-5"
                },
                {
                    "user_id": "Alex Alfreg",
                    "user_href": "/profile/Alex-Alfreg"
                },
                {
                    "user_id": "Мargo Оnegina",
                    "user_href": "/profile/Мargo-Оnegina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sunil Thakare",
                "href": "/profile/Sunil-Thakare"
            },
            "answer_text": "Wi-Fi isn’t short-form for Wireless Fidelity! It’a pun on hi-fi. From WiFi isn't short for \"Wireless Fidelity\" Phil Belanger, a founding member of the Wi-Fi Alliance who presided over the selection of the name \"Wi-Fi\" writes: Wi-Fi doesn't stand for anything. It is not an acronym. There is no meaning. Wi-Fi and the ying yang style logo were invented by Interbrand. We (the founding members of the Wireless Ethernet Compatibility Alliance, now called the Wi-Fi Alliance) hired Interbrand to come up with the name and logo that we could use for our interoperability seal and marketing efforts. We needed something that was a little catchier than \"IEEE 802.11b Direct Sequence\". Interbrand created \"Prozac\", \"Compaq\" \"oneworld\", \"Imation\" and many other brand names that you have heard of. They even created the company name \"Vivato\". The only reason that you hear anything about \"Wireless Fidelity\" is some of my colleagues in the group were afraid. They didn't understand branding or marketing. They could not imagine using the name \"Wi-Fi\" without having some sort of literal explanation. So we compromised and agreed to include the tag line \"The Standard for Wireless Fidelity\" along with the name. This was a mistake and only served to confuse people and dilute the brand. For the first year or so( circa 2000) , this would appear in all of our communications. I still have a hat and a couple of golf shirts with the tag line. Later, when Wi-Fi was becoming more successful and we got some marketing and business people from larger companies on the board, the alliance dropped the tag-line. This tag line was invented after the fact. After we chose the name Wi-Fi from a list of 10 names that Interbrand proposed. The tag line was invented by the initial six member board and it does not mean anything either. If you decompose the tag line, it falls apart very quickly. \"The Standard\"? The Wi-Fi Alliance has always been very careful to stay out of inventing standards. The standard of interest is IEEE 802.11. The Wi-Fi Alliance focuses on interoperability certification and branding. It does not invent standards. It does not compete with IEEE. It complements their efforts. So Wi-Fi could never be a standard. And \"Wireless Fidelity\" - what does that mean? Nothing. It was a clumsy attempt to come up with two words that matched Wi and Fi. That's it. So we were smart to hire Interbrand to come up with the name and logo. We were dumb to confuse and water down their efforts by adding the meaningless tag line. Please help reinforce the good work that we did and forget the tag line. ",
            "date": "Answered July 15, 2017",
            "views": "92",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kean Sakata",
                    "user_href": "/profile/Kean-Sakata-1"
                },
                {
                    "user_id": "Abhishek Kumar Lal",
                    "user_href": "/profile/Abhishek-Kumar-Lal-1"
                },
                {
                    "user_id": "Anjali Tejwani",
                    "user_href": "/profile/Anjali-Tejwani-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Syed Danish",
                "href": "/profile/Syed-Danish-40"
            },
            "answer_text": " WIFI: Wireless Fidelity WIFI also Spelled as Wi-Fi is a local area wireless technology. It allows an electronic device to transfer data or connect to the internet using ISM radio bands. It is an underlying technology of wireless local area network (WLAN). Wi-Fi allows computers and other devices to communicate over a wireless network. Wi-Fi network components are based on the one of the 802.11 standards developed by the IEEE and adopted by Wi-Fi alliance. It provides a standard way to connect with wireless network. Wi-Fi is the trademark of the Wi-Fi alliance and used as a brand name for products using the IEEE 802.11 standards. Wi-Fi can be used on several types of devices like personal computers, video game console, smart phones, digital camera, tablet computers etc. You can use Wi-Fi to create a hotspot within the range of 20 meters (66 feet). It is less secure than wired connection because the intruder does not need the physical connection to use the Wi-Fi. ",
            "date": "Answered May 8, 2019",
            "views": "99",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Vishal Tiwari",
                    "user_href": "/profile/Vishal-Tiwari-737"
                },
                {
                    "user_id": "Shalu Verma",
                    "user_href": "/profile/Shalu-Verma-74"
                },
                {
                    "user_id": "Akash Raj",
                    "user_href": "/profile/Akash-Raj-872"
                },
                {
                    "user_id": "Peeyush Gupta",
                    "user_href": "/profile/Peeyush-Gupta-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fakhruddin Kagalwala",
                "href": "/profile/Fakhruddin-Kagalwala"
            },
            "answer_text": "Sometimes we can be so ignorant that we may not know what something is or how it works despite using it every single day. For instance, do you know how Wi-Fi works, or for that matter, what does WiFi stand for? Well, you will be able to answer the question after today. Just keep reading.  What does it Stand for? You must be thinking that you have solved half the puzzle as “Wi” must stand for “wireless,” right?! Well, not really! Contrary to popular belief that it is short for something, it, in fact, does not mean anything. Though many people believe that Wi-Fi stands for wireless fidelity, it is merely a marketing term an advertisement agency came up with back in 1999 when the wireless technology hadn’t found its base among the masses. ",
            "date": "Answered April 4, 2018",
            "views": "1479",
            "upvotes": " View 43 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sanz Deep",
                    "user_href": "/profile/Sanz-Deep"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ANKIT-STUDY-POINT"
                },
                {
                    "user_id": "Rajesh D. Hajare",
                    "user_href": "/profile/राजेश-डी-हजारे-Rajesh-D-Hajare"
                },
                {
                    "user_id": "Hemanth Pothakamuri",
                    "user_href": "/profile/Hemanth-Pothakamuri"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gabriel-okara-2"
                },
                {
                    "user_id": "Shola Babalola",
                    "user_href": "/profile/Shola-Babalola-3"
                },
                {
                    "user_id": "Frank Munisi",
                    "user_href": "/profile/Frank-Munisi"
                },
                {
                    "user_id": "RP Channel",
                    "user_href": "/profile/RP-Channel-2"
                },
                {
                    "user_id": "Jaba Y",
                    "user_href": "/profile/Jaba-Y"
                },
                {
                    "user_id": "Fall Lover",
                    "user_href": "/profile/Fall-Lover-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Parker",
                "href": "/profile/James-Parker-329"
            },
            "answer_text": "Wi-Fi is the name of a popular wireless networking technology that uses radio waves to provide wireless high-speed Internet and network connections. A common misconception is that the term Wi-Fi is short for \"wireless fidelity,\" however this is not the case. Wi-Fi is simply a trademarked phrase that means IEEE 802.11x.  How Wi-Fi Networks Works Wi-Fi networks have no physical wired connection between sender and receiver by using radio frequency (RF) technology -- a frequency within the electromagnetic spectrum associated with radio wave propagation. When an RF current is supplied to an antenna, an electromagnetic field is created that then is able to propagate through space. The cornerstone of any wireless network is an access point (AP). The primary job of an access point is to broadcast a wireless signal that computers can detect and \"tune\" into. In order to connect to an access point and join a wireless network, computers and devices must be equipped with wireless network adapters. ",
            "date": "Answered February 12, 2018",
            "views": "105",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Sadhan Oraw",
                    "user_href": "/profile/Sadhan-Oraw"
                },
                {
                    "user_id": "Azam Ch",
                    "user_href": "/profile/Azam-Ch-2"
                },
                {
                    "user_id": "Jyoti Negi",
                    "user_href": "/profile/Jyoti-Negi-86"
                },
                {
                    "user_id": "Soumitra",
                    "user_href": "/profile/Soumitra-8"
                },
                {
                    "user_id": "Shah Minhal Fida",
                    "user_href": "/profile/Shah-Minhal-Fida"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirankumar",
                "href": "/profile/Kirankumar-18"
            },
            "answer_text": "Actually there is no full for wifi. Wi-fi is commonly mistaken as an acronym for \"wireless fidelity\" and often you may also see it spelled without the hyphen (wifi). Wi-Fi or WiFi is a technology for wireless local area networking with devices based on the IEEE 802.11 standards. Wi-Fi is a trademark of the Wi-Fi Alliance, which restricts the use of the term Wi-Fi Certified to products that successfully complete interoperability certification testing.[1] Devices that can use Wi-Fi technology include personal computers, video-game consoles, smartphones, digital cameras, tablet computers, digital audio players and modern printers. Wi-Fi compatible devices can connect to the Internet via a WLAN network and a wireless access point. Such an access point (or hotspot) has a range of about 20 meters (66 feet) indoors and a greater range outdoors. Hotspot coverage can be as small as a single room with walls that block radio waves, or as large as many square kilometres achieved by using multiple overlapping access points. ",
            "date": "Answered January 17, 2017",
            "views": "131",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bipeen Kumar",
                    "user_href": "/profile/Bipeen-Kumar-9"
                },
                {
                    "user_id": "Misak Saren",
                    "user_href": "/profile/Misak-Saren"
                },
                {
                    "user_id": "Steve Dowd",
                    "user_href": "/profile/Steve-Dowd-2"
                },
                {
                    "user_id": "Randy Lark",
                    "user_href": "/profile/Randy-Lark-1"
                },
                {
                    "user_id": "Michael McKinney",
                    "user_href": "/profile/Michael-McKinney-53"
                },
                {
                    "user_id": "Subhendu Bera",
                    "user_href": "/profile/Subhendu-Bera"
                },
                {
                    "user_id": "Vijay Dahiya",
                    "user_href": "/profile/Vijay-Dahiya-22"
                },
                {
                    "user_id": "Pavithra Sam",
                    "user_href": "/profile/Pavithra-Sam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay",
                "href": "/profile/Jay-6316"
            },
            "answer_text": "WiFi - Wireless Fidelity Wireless Fidelity is a brand,  originally licensed by the Wi-Fi Alliance to describe the underlying  technology of wireless local area networks (WLAN). A person with a WiFi  device can connect to the internet or Local area network using an access  point, provided that the device should be in the range of that Wireless  access point. Wireless access point (WAP) connects a group of wireless  devices to an adjacent wired LAN.  Technical SpecificationIt  is based on the IEEE 802.11 specifications. A typical wireless access  point using 802.11b or 802.11g might have a range of 120 ft indoors and  300 ft outdoors. The region covered by one or several Wireless access  points is called a hotspot. Wi-Fi  is supported by many  applications and devices including video game consoles, Laptops, PDAs,  mobile phones and other consumer electronics. ",
            "date": "Answered November 17, 2015",
            "views": "92",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nijaguna Guna",
                    "user_href": "/profile/Nijaguna-Guna"
                },
                {
                    "user_id": "Balaji P",
                    "user_href": "/profile/Balaji-P-23"
                },
                {
                    "user_id": "Bijinapalli Trinadh",
                    "user_href": "/profile/Bijinapalli-Trinadh"
                },
                {
                    "user_id": "S.Rahaman",
                    "user_href": "/profile/S-Rahaman"
                },
                {
                    "user_id": "NARENDRA KUMAR",
                    "user_href": "/profile/NARENDRA-KUMAR-508"
                },
                {
                    "user_id": "Rahul Raghunath",
                    "user_href": "/profile/Rahul-Raghunath-7"
                },
                {
                    "user_id": "Asif Khan",
                    "user_href": "/profile/Asif-Khan-257"
                },
                {
                    "user_id": "Senthil Vel",
                    "user_href": "/profile/Senthil-Vel-32"
                },
                {
                    "user_id": "Rama Krishna",
                    "user_href": "/profile/Rama-Krishna-696"
                },
                {
                    "user_id": "Sharan Anand",
                    "user_href": "/profile/Sharan-Anand-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Olga Belorusova",
                "href": "/profile/Olga-Belorusova"
            },
            "answer_text": "WiFi is a technology that uses radio waves to transfer information from one electronic device to the other. It’s what makes it possible for your computer to access the internet without cables. How is WiFi different from Internet? The internet is a giant network made up of tons of smaller, local networks. And a router gives your devices access to this network. Even without a router, you can still have a local network - whether cabled or wireless, via WiFi - that connects your devices without access to the internet. A local network, for example, could include your router, your computer, and your wireless printer. Your computer can send a PDF to the printer via a WiFi connection. And all without internet! Learn these 5 things you didn’t know about WiFi. ",
            "date": "Answered February 6, 2018",
            "views": "348",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Malwankar",
                "href": "/profile/Abhishek-Malwankar-3"
            },
            "answer_text": "The name Wi-Fi, commercially used at least as early as August 1999,was coined by the brand-consulting firm Interbrand. The Wi-Fi Alliance had hired Interbrand to create a name that was \"a little catchier than 'IEEE 802.11b Direct Sequence'.\" Phil Belanger, a founding member of the Wi-Fi Alliance who presided over the selection of the name \"Wi-Fi\", has stated that Interbrand invented Wi-Fi as a pun upon the word hi-fi. Interbrand also created the Wi-Fi logo. The yin-yang Wi-Fi logo indicates the certification of a product for interoperability. The Wi-Fi Alliance used the nonsense advertising slogan \"The Standard for Wireless Fidelity\" for a short time after the brand name was created. The name was, however, never officially \"Wireless Fidelity\". Nevertheless, the Wi-Fi Alliance was also called the \"Wireless Fidelity Alliance Inc\" in some publications and the IEEE's own website has stated \"WiFi is a short name for Wireless Fidelity\". Reference: Wi-Fi - Wikipedia ",
            "date": "Answered May 29, 2018",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jugrajbir Singh",
                "href": "/profile/Jugrajbir-Singh"
            },
            "answer_text": "It does not stand for anything It is a misconception that WIFI stands for wireless fidelity.Phil Belanger, a founding member of the Wi-Fi Alliance who was part of the selection process for the term \"Wi-Fi,\" confirmed this fact. Belanger and the other founding members of the Wireless Ethernet Compatibility Alliance (now the Wi-Fi Alliance) hired the company Interbrand to create a name and logo for their wireless internet technology, and they landed on \"Wi-Fi.\" A number of the Wi-Fi Alliance squad were confused by this gibberish term and tried to make sense of it so consumers wouldn't be quite so confused. They decided to add the tagline \"The Standard for Wireless Fidelity\" along with the name Wi-Fi in marketing communications. Eventually, that tagline was dropped. \"'Wireless Fidelity'—what does that mean? Nothing. It was a clumsy attempt to come up with two words that matched Wi and Fi. That's it,\" Belanger is quoted as saying on BoingBoing. ",
            "date": "Answered January 2, 2017",
            "views": "107",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Jose",
                    "user_href": "/profile/Tony-Jose-31"
                },
                {
                    "user_id": "James Greywolf",
                    "user_href": "/profile/James-Greywolf"
                },
                {
                    "user_id": "Anmol Arora",
                    "user_href": "/profile/Anmol-Arora-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijay Koushik",
                "href": "/profile/Vijay-Koushik-3"
            },
            "answer_text": "Wi - stands for Wireless and Fi - stands for Fidelity. Put it together and you will get Wireless - Fidelity (Wi-Fi). Wireless means, well.. obviously without wires and Fidelity means degree of faithfulness or dependable. So WiFi means a wireless dependable network. Wi-Fi or WiFi is a technology for wireless local area networking with devices based on the IEEE 802.11 standards. Wi-Fi is a trademark of the Wi-Fi Alliance, which restricts the use of the term Wi-Fi Certified to products that successfully complete interoperability certification testing. [1] Devices that can use Wi-Fi technology include personal computers, video-game consoles, smartphones, digital cameras, tablet computers, digital audio players and modern printers. Wi-Fi compatible devices can connect to the Internet via a WLAN network and a wireless access point. Such an access point (or hotspot) has a range of about 20 meters (66 feet) indoors and a greater range outdoors. Hotspot coverage can be as small as a single room with walls that block radio waves, or as large as many square kilometres achieved by using multiple overlapping access points. (source) Wi-Fi - Wikipedia ",
            "date": "Answered February 18, 2017",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shah Minhal Fida",
                "href": "/profile/Shah-Minhal-Fida"
            },
            "answer_text": "Its full form is Wireless Fidelity. Some Information About it: Wi-Fi is a family of wireless networking technologies, based on the IEEE 802.11 family of standards, which are commonly used for local area networking of devices and Internet access. Wi‑Fi is a trademark of the non-profit Wi-Fi Alliance, which restricts the use of the term Wi-Fi Certified to products that successfully complete interoperability certification testing. As of 2010, the Wi-Fi Alliance consisted of more than 375 companies from around the world. As of 2009, Wi-Fi-integrated circuit chips shipped approximately 580 million units yearly. Devices that can use Wi-Fi technologies include desktops and laptops, smartphones and tablets, smart TVs, printers, digital audio players, digital cameras, cars and drones. (Source: Wikipedia). ",
            "date": "Updated May 8, 2020",
            "views": "333",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wayne Ruffner",
                "href": "/profile/Wayne-Ruffner"
            },
            "answer_text": "Technically, WiFi essentially means a wireless LAN connection. If that LAN is connected to the internet, off you go… I think it's important to be focused on how the term “WiFi” is misapplied these days. It seems to me that most times technically non-savvy people say WiFi, they mean unfettered, easy internet access without enough understanding the confusion they can wreak: Thinking : Huh, the <somthing> doesn't work on my <doodad>! Hey, my WiFi is dead! There are a lot of other things that could be busted, but way too many people just seem to put it all under that one name, and happily ignore the rest of it. ",
            "date": "Answered January 7, 2018",
            "views": "264",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Violetta Atlantis",
                "href": "/profile/Violetta-Atlantis"
            },
            "answer_text": "Easy explanation: It’s not an abbreviation, but a “nickname”. Long explanation: The name WiFi comes from the development of different networking technologies. The first WLAN standard was made and called 802.11. Unfortunately, 802.11 only support a maximum bandwidth of 2Mbps which was too slow for most applications. However, after a while, they created newer versions and it branched into many different technologies and standards. These explain different metrics such as Speed, frequency band and reach. IEEE 802.11 b 11Mbps>2.4 GHz>140-meter reach>also referred to as Wi-Fi 1 IEEE 802.11 a 54 Mbps>5 GHz>120-meter reach>also referred to as Wi-Fi 2 IEEE 802.11 g54 Mbps>2.4 GHz>140-meter reach>Runs with standard 802.11 b if the Wireless AP is compatible>support by all wireless devices today>also referred to as Wi-Fi 3 IEEE 802.11 n 300Mbps (channel bonding)>2.4/5 GHz which runs with all other WAPs>250-meter reach>also referred to as Wi-Fi 4 IEEE 802.11 ac1300 Mbps (5 GHz)450 Mbps (2.4 GHz)>fastest maximum speed and best signal range>also referred to as Wi-Fi 5 ",
            "date": "Answered July 4, 2019",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Keshab Poudel",
                    "user_href": "/profile/Keshab-Poudel-3"
                },
                {
                    "user_id": "Olatunji Sidiku",
                    "user_href": "/profile/Olatunji-Sidiku"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gunjan Belani",
                "href": "/profile/Gunjan-Belani-1"
            },
            "answer_text": "WiFi ~ Wireless Fidelity A wireless network uses radio waves, just like cell phones, televisions and radios do. In fact, communication across a wireless network is a lot like two-way radio communication. Here's what happens: A computer's wireless adapter translates data into a radio signal and transmits it using an antenna. A wireless router receives the signal and decodes it. The router sends the information to the Internet using a physical, wired Ethernet connection. The process also works in reverse, with the router receiving information from the Internet, translating it into a radio signal and sending it to the computer's wireless adapter. ",
            "date": "Answered May 10, 2017",
            "views": "42",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Azmain Akib Akash",
                    "user_href": "/profile/Azmain-Akib-Akash"
                },
                {
                    "user_id": "Avinash Sharma",
                    "user_href": "/profile/Avinash-Sharma-148"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sambhav",
                "href": "/profile/Sambhav-16"
            },
            "answer_text": "Wi-Fi isn't short for anything — and it never was. The Wi-Fi Alliance used the \"nonsense\" advertising slogan \"The Standard for Wireless Fidelity\" for a short time after the brand name was invented, leading to the misconception that Wi-Fi was an abbreviation of \"Wireless Fidelity\" Phil Belanger, a founding member of the Wi-Fi Alliance who presided over the selection of the name \"Wi-Fi\", also stated that Interbrand invented Wi-Fi as a play on words with Hi-Fi, and also created the Wi-Fi logo. The truth is, Wi-Fi isn't short for anything — and it never was. ",
            "date": "Updated January 15, 2017",
            "views": "874",
            "upvotes": " View 44 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kiran TP",
                    "user_href": "/profile/Kiran-TP-3"
                },
                {
                    "user_id": "Jaydip Barvaliya",
                    "user_href": "/profile/Jaydip-Barvaliya"
                },
                {
                    "user_id": "Srujan Raj",
                    "user_href": "/profile/Srujan-Raj-1"
                },
                {
                    "user_id": "Nijaguna Guna",
                    "user_href": "/profile/Nijaguna-Guna"
                },
                {
                    "user_id": "Umakant Bhope",
                    "user_href": "/profile/Umakant-Bhope"
                },
                {
                    "user_id": "Rajveersingh Parmar",
                    "user_href": "/profile/Rajveersingh-Parmar"
                },
                {
                    "user_id": "Ed Kummel",
                    "user_href": "/profile/Ed-Kummel"
                },
                {
                    "user_id": "Babudhansharma Babudhansharma",
                    "user_href": "/profile/Babudhansharma-Babudhansharma"
                },
                {
                    "user_id": "Susan Call Hutchison",
                    "user_href": "/profile/Susan-Call-Hutchison"
                },
                {
                    "user_id": "Laxman Kumar",
                    "user_href": "/profile/Laxman-Kumar-122"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kapilraj Chouhan",
                "href": "/profile/Kapilraj-Chouhan"
            },
            "answer_text": "Wifi is used for wireless connection. The term Internet access wirelessly is stands for Wifi.    Wi-Fi is increasingly becoming the preferred mode of internet connection all over the world. To access this type of connection, one must have a wireless adapter on their computer. Wi-Fi provides wireless connectivity by emitting frequencies between 2.4GHz to 5GHz based on the amount of data on the network. Areas which are enabled with Wi-Fi connectivity are known as Hot Spots. One can use advanced softwares like Wirelessmon to detect and request connection to Hotspots. To start a Wireless connection, it is important that the wireless router is plugged into the internet connection and that all the required settings are properly installed.   ",
            "date": "Answered April 24, 2015",
            "views": "977",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Francisco Joshua Jr.",
                "href": "/profile/Francisco-Joshua-Jr"
            },
            "answer_text": "Wi-Fi isn't short for anything Source: http://www.webopedia.com/DidYouKnow/Computer_Science/wifi_explained.asp It's simply a trademark. It does not stand for the commonly thought \"Wireless Fidelity\" (or your Fi guess, \"Frequency Interface\"). The term Wi-Fi, commercially used at least as early as August 1999, was coined by brand-consulting firm Interbrand Corporation. The Wi-Fi Alliance had hired Interbrand to determine a name that was \"a little catchier than 'IEEE 802.11b Direct Sequence'\". Phil Belanger, a founding member of the Wi-Fi Alliance who presided over the selection of the name \"Wi-Fi\", also stated that Interbrand invented Wi-Fi as a play on words with hi-fi, and also created the Wi-Fi logo. The Wi-Fi Alliance used the \"nonsense\" advertising slogan \"The Standard for Wireless Fidelity\" for a short time after the brand name was invented, leading to the misconception that Wi-Fi was an abbreviation of \"Wireless Fidelity\". Source: https://en.wikipedia.org/wiki/Wi-Fi ",
            "date": "Answered June 7, 2016",
            "views": "809",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abdul Rouf",
                "href": "/profile/Abdul-Rouf-35"
            },
            "answer_text": "The name given IEEE 802.11 by the Wireless Ethernet Compatibility Alliance (WECA, now the Wi-Fi Alliance), Wi refers to the wireless nature of the LAN and Fi to the fidelity (i.e., faithfulness, or integrity) of the signal.The term also has been attributed to the IEEE 802.11 Working Group, with Wi referring to the fact that a wire traditionally served as the physical medium for LANs, and the homonym Fi referring to PHY, the PHYsical Layer of the OSI Reference Model. So,Wireless PHY became Wi-Fi. One way or another, or perhaps both ways, Wi-Fi became the vernacular for 802.11 and especially 802.11b ",
            "date": "Answered April 26, 2018",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhineet Tomar",
                "href": "/profile/Abhineet-Tomar"
            },
            "answer_text": "The name Wi-Fi is a trademark name, and is a play on the audiophile term Hi-Fi. It is synonymous with WLAN (Wireless Local Area Network) Way back in 1999 the fledgling wireless industry needed a marketing name for the new products that conformed to the technical specifications called 'IEEE 802.11'. 'IEEE 802.11' didn't have much of a ring to it, and the industry association wanted a catchy name. They came up with Wi-Fi , which rhymed with 'hi-fi,' which was short for 'high fidelity', a term that, referred to high-quality sound systems. Source: Scientific American ",
            "date": "Answered October 3, 2014",
            "views": "4",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravikant Prajapati",
                    "user_href": "/profile/Ravikant-Prajapati-3"
                },
                {
                    "user_id": "Vinayak Sahu",
                    "user_href": "/profile/Vinayak-Sahu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepak Sharma",
                "href": "/profile/Deepak-Sharma-1987"
            },
            "answer_text": "Wi-Fi is the name of a wireless networking technology that uses radio waves to provide high-speed network and Internet connections. A common misconception is that the term Wi-Fi is short for \"wireless fidelity.\" This is not the case. Wi-Fi is simply a trademarked term meaning IEEE 802.11x. The false notion that the brand name \"Wi-Fi\" is short for \"wireless fidelity\" has spread to such an extent that even industry leaders have included the phrase wireless fidelity in a press release. You'll also find references to Wi-Fi being short for wireless fidelity on a number of well-known and respected technology-focused publications and websites. The truth is, Wi-Fi isn't short for anything — and it never was. ",
            "date": "Answered January 14, 2017",
            "views": "65",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asad Razzaq",
                    "user_href": "/profile/Asad-Razzaq-9"
                },
                {
                    "user_id": "Duvvuri Lakshmi Narasimham",
                    "user_href": "/profile/Duvvuri-Lakshmi-Narasimham"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranay Khangar",
                "href": "/profile/Pranay-Khangar-1"
            },
            "answer_text": "You may be surprised to hear that many people don't actually know that WiFi is an abbreviated term. Even those who do don't always know what WiFi stands for. There are a number of theories about what the term means, but the most widely accepted definition for the term in the tech community is Wireless Fidelity.  WiFi is a technology that uses radio waves to provide network connectivity. A WiFi connection is established using a wireless adapter to create hotspots - areas in the vicinity of a wireless router that are connected to the network and allow users to access internet services. Once configured, WiFi provides wireless connectivity to your devices by emitting frequencies between 2.4GHz - 5GHz, based on the amount of data on the network. Hope it helps…! ",
            "date": "Answered November 29, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shubham Parate",
                    "user_href": "/profile/Shubham-Parate-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swapan Kr. Mukherjee",
                "href": "/profile/Swapan-Kr-Mukherjee-1"
            },
            "answer_text": "What is WiFi? Full-Form of WiFi: Welcome to All Our Questions where I search the internet for Wi-Fi stands for? \" I'm going to tell you, and we're starting right now! If you're going to a coffee shop or restaurant you say \"do you have Wi-Fi\" what you're simply meaning is do you have a wireless internet connection? What is WiFi? Wi-Fi is a wireless networking protocol that allows devices to communicate without internet cords. It's technically an industry term that represents a type of wireless local area network (LAN) protocol based on the 802.11 IEEE network standard.WiFi stands for Wireless Fidelity. Read more: FullformofWiFi ",
            "date": "Answered November 6, 2019",
            "views": "79",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kartik Sharma",
                "href": "/profile/Kartik-Sharma-1292"
            },
            "answer_text": "what is does wifi stand for and what is wifi meaning wifi is a LAN type network and wifi full form or wifi real name is wireless fidelity and ou say wifi means a local area the wireless network which provides us a high-speed internet which is introduced us in 1997 Wi-Fi allows computers, video-game consoles, smartphones, digital cameras, tablet computers, digital audio players, modern printers and other devices to communicate over a wireless network. Originally licensed by the Wi-Fi Alliance and etc information in my post what is wifi?what is does stand for what is wifi direct everything you need to know ",
            "date": "Answered January 11, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Reliance Jio",
                "href": "/profile/रिलायंस-जिओ-Reliance-Jio"
            },
            "answer_text": "Contrary to popular belief, the full-form of Wi-Fi is NOT wireless fidelity. It was merely a misconception that was perpetuated years ago, which was taken to be valid by many in the industry. Wi-Fi is merely a registered trademark that represents the wireless networking technology. It makes use of radio waves in order to provide high speed internet connections to users. The term was coined as a trademark by its parent organization Wi-Fi Alliance, nothing more. It is based on the Institute of Electrical and Electronics Engineers' (IEEE) 802.11 standards. In conclusion, it would not be inaccurate to say that there is no full-form to this particular term. Jio offers high speed Wi-Fi device for your use with our prime product JioFi. You can know more about it by checking out the link. ",
            "date": "Answered October 4, 2018",
            "views": "86",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pintu Paul Bengali you Tube Channel",
                    "user_href": "/profile/Pintu-Paul-Bengali-you-Tube-Channel"
                },
                {
                    "user_id": "Balaji Vishwanath Manoharan",
                    "user_href": "/profile/Balaji-Vishwanath-Manoharan"
                },
                {
                    "user_id": "Babli Sir",
                    "user_href": "/profile/Babli-Sir"
                },
                {
                    "user_id": "Harshit Jain",
                    "user_href": "/profile/Harshit-Jain-119"
                },
                {
                    "user_id": "Anubhav Verma",
                    "user_href": "/profile/Anubhav-Verma-28"
                },
                {
                    "user_id": "Lokesh",
                    "user_href": "/profile/Lokesh-613"
                },
                {
                    "user_id": "Deepa Ram Suthar",
                    "user_href": "/profile/दीपा-राम-सुथार-Deepa-Ram-Suthar"
                },
                {
                    "user_id": "Arun Jagadish",
                    "user_href": "/profile/Arun-Jagadish-2"
                },
                {
                    "user_id": "Arun Mani",
                    "user_href": "/profile/Arun-Mani-9"
                },
                {
                    "user_id": "Lakshay Jain",
                    "user_href": "/profile/Lakshay-Jain-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pari Mehta",
                "href": "/profile/Pari-Mehta-33"
            },
            "answer_text": "Full Form of WiFi and What is Wifi : This, we're getting to learn regarding the wifi, full form of WIFI, review, benefits and drawbacks of WIFI. Also, Asked Questions : WiFi full form?WiFi full form in computer?WiFi full form in hindi?WiFi full form and meaning?WiFi full form name?WiFi full form wiki?WiFi full form wikipedia?what is wifi full form?WiFi full form in english?what is full form of wifi?what is the full form of wifi?what is wifi full form?what is the full form wifi?what is full form wifi?what is the full form of wifi?For, Above All the questions ans only one and it is Following : What does WiFi mean? Wifi, has been a mechanism that allows electronic devices to exchange data wirelessly. \"Wi-Fi\" is a trademark of their Wi-Fi Alliance and the brand name for products using the IEEE 802.11 family of standards. For Read More, Go in profiles website. Pari Mehta ",
            "date": "Answered April 25, 2020",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aniket Sharma",
                    "user_href": "/profile/Aniket-Sharma-638"
                },
                {
                    "user_id": "Ram Mayu",
                    "user_href": "/profile/Ram-Mayu"
                },
                {
                    "user_id": "Mahi Roy",
                    "user_href": "/profile/Mahi-Roy-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Mac",
                "href": "/profile/John-Mac-60"
            },
            "answer_text": "There is no full-form for Wi-fi. It was a made up term that was invented by a marketing/brand agency called Interbrand back in the 90’s. It was a play on ‘Hi-Fi’ which is short for High Fidelity, but was a term that had become synonymous with advanced home sound systems. There was an advertising slogan that went with it ‘Wi-Fi: The Standard for Wireless Fidelity’. Based on that slogan, you could argue that the full form of Wi-Fi is Wireless Fidelity. However, Fidelity means ‘the degree of exactness with which something is copied or reproduced’. This is relevant when you are talking about a sound system, where you want sound to be reproduced as accurately as possible, but makes little sense when describing a wireless local area network. ",
            "date": "Answered April 2, 2018",
            "views": "39",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Tony Jose",
                    "user_href": "/profile/Tony-Jose-31"
                },
                {
                    "user_id": "Himanshu Dutta",
                    "user_href": "/profile/Himanshu-Dutta-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phil Kearney",
                "href": "/profile/Phil-Kearney"
            },
            "answer_text": "The term Wi-Fi, commercially used at least as early as August 2000, was coined by a brand-consulting firm called Interbrand Corporation. The Wi-Fi Alliance had hired Interbrand to determine a name that was \"a little catchier than 'IEEE 802.11b Direct Sequence'\". Phil Belanger also stated that Interbrand invented Wi-Fi as a play on words with Hi-Fi (high fidelity), and also created the Wi-Fi logo. The Wi-Fi Alliance initially used the advertising slogan, \"The Standard for Wireless Fidelity\", for Wi-Fi but later removed the phrase from their marketing. Despite this, some documents from the Wi-Fi Alliance dated 2003 and 2004 still contain the term Wireless Fidelity. There was no official statement related to the dropping of the term. The yin-yang Wi-Fi logo indicates the certification of a product for interoperability. Source: Wi-Fi wikipedia page ",
            "date": "Answered July 17, 2013",
            "views": "22",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Varin",
                    "user_href": "/profile/Matthew-Varin"
                },
                {
                    "user_id": "Phillip Remaker",
                    "user_href": "/profile/Phillip-Remaker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swapnil Saud",
                "href": "/profile/Swapnil-Saud"
            },
            "answer_text": "The full form of Wi-Fi is Wireless Fidelity. WIFI also Spelled as Wi-Fi is a local area wireless technology. It allows an electronic device to transfer data or connect to the internet using ISM radio bands. Wi-Fi is the trademark of the Wi-Fi alliance and used as a brand name for products using the IEEE 802.11 standards. Here is some amazing facts that you need to know:- WiFi uses radio waves.WiFi was originated in Hawaii in 1979.WiFi has it’s own language.You can connect too Many devices to The WiFi.WiFi can travel far.WiFi is not 100% secure. It’s hack able.",
            "date": "Answered March 24, 2020",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shashank Verma",
                "href": "/profile/Shashank-Verma-88"
            },
            "answer_text": "\"Wi-Fi\" is always hyphenated, with a capital \"w\" and a capital \"f.\" It's not short for anything. Wi-Fi is just a trademark used for IEEE 802.11 (wireless LAN ) standards. Rest fellow qourans Kumarsambhav pandey and Vijay Bhaskar answered correctly. That is a misconception that Wi-Fi stands for wireless fidelity, though this term is not used anywhere technically, and does not even mean anything in technical terms. The term fidelity is just a receiver performance matrix, and defines how faithfully the receiver reproduce the actual audio quality. Thus the term hi-fi is valid term that define a audio system's quality. But that is not the case with Wi-Fi (802.11 wireless LAN ) it's just a communication standard. ",
            "date": "Updated December 20, 2016",
            "views": "94",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Srujan Raj",
                    "user_href": "/profile/Srujan-Raj-1"
                },
                {
                    "user_id": "Ranjit Kharat",
                    "user_href": "/profile/Ranjit-Kharat-1"
                },
                {
                    "user_id": "Kean Sakata",
                    "user_href": "/profile/Kean-Sakata-1"
                },
                {
                    "user_id": "Gagan Googly C",
                    "user_href": "/profile/Gagan-Googly-C"
                },
                {
                    "user_id": "Normas Yakin",
                    "user_href": "/profile/Normas-Yakin"
                },
                {
                    "user_id": "Neha",
                    "user_href": "/profile/Neha-295"
                },
                {
                    "user_id": "Zamran Ali",
                    "user_href": "/profile/Zamran-Ali-1"
                },
                {
                    "user_id": "Suman Yadav",
                    "user_href": "/profile/Suman-Yadav-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "R K Pal",
                "href": "/profile/R-K-Pal-1"
            },
            "answer_text": "WiFi is Wireless Local Area Networking, It’s trademark of the WiFi Alliance, Nobody can use this term for their business. Wi-Fi allows computers and other devices to communicate over a wireless network and It is an underlying technology of wireless local area network (WLAN). Technical Specification Wi-Fi is based on IEEE 802.11 specifications. This is a list of Wi-Fi standards in chronological order. 802.11a802.11b802.11g802.11n802.11ac",
            "date": "Answered September 13, 2018",
            "views": "6",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Bhavya",
                    "user_href": "/profile/Bhavya-106"
                },
                {
                    "user_id": "Abraham Ag",
                    "user_href": "/profile/Abraham-Ag-3"
                },
                {
                    "user_id": "Hemanth Pothakamuri",
                    "user_href": "/profile/Hemanth-Pothakamuri"
                },
                {
                    "user_id": "Jatinder Kaur",
                    "user_href": "/profile/Jatinder-Kaur-283"
                },
                {
                    "user_id": "Deepika Joshi",
                    "user_href": "/profile/Deepika-Joshi-109"
                },
                {
                    "user_id": "Ravi Agarwal",
                    "user_href": "/profile/Ravi-Agarwal-367"
                },
                {
                    "user_id": "Adnan Shami",
                    "user_href": "/profile/Adnan-Shami-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Parveen Kaur",
                "href": "/profile/Parveen-Kaur-18"
            },
            "answer_text": "WiFi - Wireless Fidelity . Wi-Fi or WiFi is a technology that allows electronic devices to connect to a Wireless Local Area Network (WLAN) network, mainly using the 2.4 gigahertz (12 cm) UHF (Ultra High Frequency) and 5 gigahertz (6 cm) SHF (Super High Frequency) ISM (Industrial, Scientific & Medical) radio bands. A WLAN is usually password protected, but may be open, which allows any device within its range to access the resources of the WLAN network. ",
            "date": "Answered June 30, 2016",
            "views": "73",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Prateek",
                    "user_href": "/profile/Prateek-147"
                }
            ]
        },
        {
            "author_info": {
                "name": "V Bhas",
                "href": "/profile/V-Bhas"
            },
            "answer_text": "from wiki: Wi-Fi Wi-Fi (or WiFi) is a local area wireless computer networking technology that allows electronic devices to connect to the network, mainly using the 2.4 gigahertz (12 cm)UHF and 5 gigahertz (6 cm) SHF ISM radio bands.The Wi-Fi Alliance defines Wi-Fi as any \"wireless local area network\" (WLAN) product based on the Institute of Electrical and Electronics Engineers' (IEEE) 802.11 standards.[1] However, the term \"Wi-Fi\" is used in general English as a synonym for \"WLAN\" since most modern WLANs are based on these standards. \"Wi-Fi\" is a trademark of the Wi-Fi Alliance. The \"Wi-Fi Certified\" trademark can only be used by Wi-Fi products that successfully complete Wi-Fi Alliance interoperability certification testing .... ",
            "date": "Answered November 17, 2015",
            "views": "51",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Varun Rai",
                    "user_href": "/profile/Varun-Rai-58"
                },
                {
                    "user_id": "P.chandana 1706",
                    "user_href": "/profile/P-chandana-1706"
                },
                {
                    "user_id": "Anand Dev Sharma",
                    "user_href": "/profile/Anand-Dev-Sharma"
                },
                {
                    "user_id": "Manju Elaiya",
                    "user_href": "/profile/Manju-Elaiya"
                },
                {
                    "user_id": "Deepak Singh",
                    "user_href": "/profile/Deepak-Singh-1109"
                },
                {
                    "user_id": "Dnyan Sutar",
                    "user_href": "/profile/Dnyan-Sutar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dane Clarke",
                "href": "/profile/Dane-Clarke-1"
            },
            "answer_text": "Q: What is the full form of WiFi? \"Wi-Fi\" There is no other full form, in the sense you are thinking. It isn't an abbreviation, you see. The name Wi-Fi, commercially used at least as early as August 1999,[19] was coined by the brand-consulting firm Interbrand. The Wi-Fi Alliance had hired Interbrand to create a name that was \"a little catchier than 'IEEE 802.11b Direct Sequence'.\"[20][21] Phil Belanger, a founding member of the Wi-Fi Alliance who presided over the selection of the name \"Wi-Fi\", has stated that Interbrand invented Wi-Fi as a pun upon the word hi-fi.[22] Wi-Fi - Wikipedia ",
            "date": "Answered June 27, 2018",
            "views": "15",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "Abhishek Bhandari",
                    "user_href": "/profile/Abhishek-Bhandari-111"
                },
                {
                    "user_id": "Dat Cong Dinh",
                    "user_href": "/profile/Dat-Cong-Dinh"
                },
                {
                    "user_id": "Gabriel J. Ferrer",
                    "user_href": "/profile/Gabriel-J-Ferrer"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "R. E. Bruce Martin",
                "href": "/profile/R-E-Bruce-Martin"
            },
            "answer_text": "While computer and consumer technology sales people are not technician or teachers, they can give you a bit of basic info. Also check out the telecmmunications sevices providers in your country. Howeve while they have some interest in supporting thepublic’s questions, that is also limited. Telecommunications services are usually under the authority of a country’s Federal government, but what that results in will depend largely on just how truly democratic and free a country is. ",
            "date": "Answered July 6, 2019",
            "views": "35",
            "upvotes": " Answer requested by Abwao Lucas and Peeyush Gupta",
            "upvoters": [
                {
                    "user_id": "Aayushi Singh",
                    "user_href": "/profile/Aayushi-Singh-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zeni Gupta",
                "href": "/profile/Zeni-Gupta"
            },
            "answer_text": " The full form of WIFI stands for “Wireless Interconnection From Internet” the WIFI is a key source of inter and interconnection with your entire beloved or professional domain. WIFI is giving you easy accessibility to connect your device and exchange your personal or official communication under the seconds. Data Transfer: Indeed, WIFI availability is the best source to transfer your data from one device to another device with single and easy steps. WIFI play a bridge role to connect both devices with each other securely to share what type of information you want to share. More ",
            "date": "Answered June 24, 2020",
            "views": "152",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aashish Paliwal",
                "href": "/profile/Aashish-Paliwal"
            },
            "answer_text": "Wi-Fi or WiFi is a local area wireless computer networking technology that allows electronic devices to connect to the network, mainly using the 2.4 gigahertz (12 cm) UHF and 5 gigahertz (6 cm) SHF ISM radio bands. Wi-Fi uses radio waves to provide wireless high-speed Internet and network connections. A common misconception is that the term Wi-Fi is short for \"wireless fidelity,\" however this is not the case. Wi-Fi is simply a trademarked phrase that means IEEE 802.11x. ",
            "date": "Answered September 25, 2016",
            "views": "6",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Anna Jimmo",
                    "user_href": "/profile/Anna-Jimmo-1"
                },
                {
                    "user_id": "Arif Hasan",
                    "user_href": "/profile/Arif-Hasan-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marco Biagini",
                "href": "/profile/Marco-Biagini-1"
            },
            "answer_text": "Wi-Fi doesn't stand for anything. It is not an acronym. There is no meaning.” Wi-Fi and the ying yang style logo were invented by Interbrand. We (the founding members of the Wireless Ethernet Compatibility Alliance, now called the Wi-Fi Alliance) hired Interbrand to come up with the name and logo that we could use for our interoperability seal and marketing efforts. We needed something that was a little catchier than \"IEEE 802.11b Direct Sequence\". ",
            "date": "Answered June 8, 2017",
            "views": "570",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Willmore",
                    "user_href": "/profile/Frank-Willmore-1"
                },
                {
                    "user_id": "Nilesh Kala",
                    "user_href": "/profile/Nilesh-Kala"
                },
                {
                    "user_id": "London Lacy",
                    "user_href": "/profile/London-Lacy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mahmuda Akhter",
                "href": "/profile/Mahmuda-Akhter-4"
            },
            "answer_text": "WiFi is defined as an abbreviation for wireless fidelity, meaning you can access or connect to a network using radio waves, without needing to use wires. an example of WiFi is when you go Starbucks and can join on their network to get on the Internet without having to connect your computer to any wires. a trademark for the certification of products that meet certain standards for transmitting data over wireless networks.  Source: Wikipedia Man, I have tried my best to help you, please let me know if you need more help :) ",
            "date": "Answered August 11, 2017",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Smruti Ranjan",
                    "user_href": "/profile/Smruti-Ranjan-134"
                },
                {
                    "user_id": "Ved Prakash",
                    "user_href": "/profile/Ved-Prakash-990"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chaitanya Challa",
                "href": "/profile/Chaitanya-Challa-13"
            },
            "answer_text": "Wireless Fidelity is a brand, originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks (WLAN). ... Wireless access point (WAP) connects a group of wireless devices to an adjacent wired LAN. Technical Specification. It is based on the IEEE 802.11 specifications. Wi-Fi is the name of a popular wireless networking technology that uses radio waves to provide wireless high-speed Internet and network connections ",
            "date": "Answered August 16, 2017",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubham Wagh",
                "href": "/profile/Shubham-Wagh"
            },
            "answer_text": "Wi-Fi is the name of a popular wireless networking technology that uses radio waves to provide wireless high-speed Internet and network connection. It is simply a trademarked phrase that means IEEE 802.11x. It is a common misconception that the term Wi-Fi is short for \"wireless fidelity\". It is merely a marketing term an advertisement agency came up with back in 1999 when the wireless technology hadn’t found its base among the masses. ",
            "date": "Answered April 8, 2018",
            "views": "880",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amogh Desai",
                    "user_href": "/profile/Amogh-Desai-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dana F Anderson",
                "href": "/profile/Dana-F-Anderson"
            },
            "answer_text": "A common misconception is that the term Wi-Fi is short for \"wireless fidelity,\" however this is not the case. Wi-Fi is simply a trademarked phrase that means IEEE 802.11x. Wi-Fi or WiFi is technology for radio wireless local area networking of devices based on the IEEE 802.11 standards. Wi‑Fi is a trademark of the Wi-Fi Alliance, which restricts the use of the term Wi-Fi Certified to products that successfully complete interoperability certification testing. [2] ",
            "date": "Answered September 1, 2018",
            "views": "347",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Govind Maurya",
                "href": "/profile/Govind-Maurya-24"
            },
            "answer_text": "The term Wi-Fi suggests Wireless Fidelity, resembling the long-established audio-equipment classification term Hi-Fi or high fidelity. Actually, Wi taken from Wireless and Fi taken from Fidelity… What is Wi-Fi? Wi-Fi, is a mechanism that allows electronic devices to exchange data wirelessly over a computer network. “Wi-Fi” is a trademark of the Wi-Fi Alliance and the brand name for products using the IEEE 802.11 family of standards. ",
            "date": "Answered June 24, 2018",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Bauch",
                "href": "/profile/Matthew-Bauch-2"
            },
            "answer_text": "“Wireless Fidelity.” It’s a wireless communications technology using short radio waves (2.4 GHz and 5 GHz bands) over which any of the usual protocols can be utilized. It can also be encrypted, and SHOULD be so, as otherwise anyone with a laptop and a packet sniffer can see your traffic in the clear. WPA2 is the *minimum* recommended encryption and even that’s not proof against hacking. ",
            "date": "Answered January 8, 2018",
            "views": "27",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Chris Owen",
                    "user_href": "/profile/Chris-Owen-53"
                },
                {
                    "user_id": "Kishore Kumar Sinha",
                    "user_href": "/profile/Kishore-Kumar-Sinha-3"
                },
                {
                    "user_id": "Telbisz van Dierendonck",
                    "user_href": "/profile/Telbisz-van-Dierendonck-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aman Gupta",
                "href": "/profile/Aman-Gupta-2946"
            },
            "answer_text": "wireless fidelity is the full form of wifi.  ",
            "date": "Answered April 12, 2019",
            "views": "20",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Honey Dhiman",
                    "user_href": "/profile/Honey-Dhiman-24"
                },
                {
                    "user_id": "Jo Rahangdale",
                    "user_href": "/profile/Jo-Rahangdale"
                },
                {
                    "user_id": "Poonam Krishnani",
                    "user_href": "/profile/Poonam-Krishnani"
                },
                {
                    "user_id": "Chintu Kumar",
                    "user_href": "/profile/Chintu-Kumar-449"
                },
                {
                    "user_id": "Iti Verma",
                    "user_href": "/profile/Iti-Verma-2"
                },
                {
                    "user_id": "Ankita Mourya",
                    "user_href": "/profile/Ankita-Mourya-4"
                },
                {
                    "user_id": "AHIN S",
                    "user_href": "/profile/AHIN-S-2"
                },
                {
                    "user_id": "Kishore Kumar",
                    "user_href": "/profile/Kishore-Kumar-1734"
                },
                {
                    "user_id": "Ashok Kumar Pal",
                    "user_href": "/profile/Ashok-Kumar-Pal-26"
                },
                {
                    "user_id": "Banita Pradhan",
                    "user_href": "/profile/Banita-Pradhan-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeno Snetrem",
                "href": "/profile/Jeno-Snetrem"
            },
            "answer_text": "It actually has no real meaning. It’s not an abbreviation for something. I quote: \"It is not an acronym. There is no meaning,\" Belanger said. \"We (the founding members of the Wireless Ethernet Compatibility Alliance, now called the Wi-Fi Alliance) hired Interbrand to come up with the name and logo that we could use for our interoperability seal and marketing efforts. We needed something that was a little catchier than 'IEEE 802.11b Direct Sequence.'\" ",
            "date": "Answered December 14, 2017",
            "views": "141",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Watson",
                    "user_href": "/profile/Alex-Watson-51"
                },
                {
                    "user_id": "Brijesh Nirmal",
                    "user_href": "/profile/Brijesh-Nirmal"
                },
                {
                    "user_id": "Vikas Jangir",
                    "user_href": "/profile/Vikas-Jangir-8"
                },
                {
                    "user_id": "Bevan Audstone",
                    "user_href": "/profile/Bevan-Audstone"
                },
                {
                    "user_id": "Arthur Homan",
                    "user_href": "/profile/Arthur-Homan"
                },
                {
                    "user_id": "Collin Gardner",
                    "user_href": "/profile/Collin-Gardner-2"
                },
                {
                    "user_id": "Dave Nelson",
                    "user_href": "/profile/Dave-Nelson-89"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bijendra Yadav (बिजेंद्र यादव)",
                "href": "/profile/Bijendra-Yadav-बिजेंद्र-यादव"
            },
            "answer_text": "WIFI: Wireless Fidelity. WIFI also Spelled as Wi-Fi is a local area wireless technology. It allows an electronic device to transfer data or connect to the internet using ISM radio bands. ... Wi-Fi is the trademark of the Wi-Fialliance and used as a brand name for products using the IEEE 802.11 standards. ",
            "date": "Answered January 31, 2019",
            "views": "464",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ramesh Kumar",
                    "user_href": "/profile/Ramesh-Kumar-3201"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sahil Kumar",
                "href": "/profile/Sahil-Kumar-761"
            },
            "answer_text": "WiFi is a technology for wireless local area networking with devices based on the IEEE 802.11 standards. WI-Fi is the name of a wireless networking technology that uses radio waves to provide high-speed network and Internet connections. This Webopedia \"Did You Know...\" article explains Wi-Fi technology: how it works and misconceptions about Wireless Fidelity. I think now it is very clear to you . Thanks!! Have a successful day . …………………… …………………………….…….{Sahil Kumar} ",
            "date": "Answered June 9, 2017",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nijaguna Guna",
                    "user_href": "/profile/Nijaguna-Guna"
                },
                {
                    "user_id": "Burridevavara Prasad",
                    "user_href": "/profile/Burridevavara-Prasad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prashant Singh",
                "href": "/profile/Prashant-Singh-434"
            },
            "answer_text": "WiFi stands for Wireless Fidelity. It allows a device within close vicinity of the WiFi modem to connect to the Internet wirelessly. Needless to say, the device should support WiFi connectivity. Nowadays two bands are available, the 2.4GHz one and the relatively new 5GHz.  One should know that while installing a modem, the position matters a lot. WiFi signals don't have a large coverage and are affected by obstacles such as doors, walls, etc. ",
            "date": "Answered April 20, 2015",
            "views": "12",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ada Lin",
                    "user_href": "/profile/Ada-Lin-16"
                },
                {
                    "user_id": "Pallavi Thakur",
                    "user_href": "/profile/Pallavi-Thakur-3"
                },
                {
                    "user_id": "Shorya Choudhary",
                    "user_href": "/profile/Shorya-Choudhary"
                },
                {
                    "user_id": "Abhishek Singh",
                    "user_href": "/profile/Abhishek-Singh-1397"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Severs",
                "href": "/profile/Mark-Severs-5"
            },
            "answer_text": "It is supposed to make you think of “Wireless Fidelity”, as a pastiche of the term “Hi-Fi” which means “High Fidelity” in terms of domestic audio equipment, that is to say, meaning “high quality”. The term was dreamed up to create an easy-to-remember term for a Wireless Local Area Network. Accordingly, “WLAN” is a valid term for the same type of network, especially in languages where the term “Wi-Fi” does not trip off the tongue as easily as it does in English. ",
            "date": "Answered April 8, 2018",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ali Kausen",
                "href": "/profile/Ali-Kausen"
            },
            "answer_text": "Wireless Fidelity, or the most popularly known as WiFi. The term was first used somewhere in the year 1999, allows users to share data packets over the net. It can also be used to provide internet access to the devices with the range of a wireless network which has access to Internet. Coverage area of such has been noted from a small area to as large as several square kilometers. Of course, the range can be further increased with network booster tools or by using a group of different access points. For further information, you can look up the Wikipedia. ",
            "date": "Answered March 31, 2019",
            "views": "635",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Puneeth Reddy",
                "href": "/profile/Puneeth-Reddy-72"
            },
            "answer_text": "wifi is abbreviated as wireless fidelity. wifi is the most popular wireless communication technology used within a room or a building for connecting to the internet. wifi uses radio waves (RF) to allow two or more devices to communicate with one another. the technology is most commonly used to connect devices like computers, tablets and mobile phones to the internet. wifi networks need to be password protected for security purposes to safeguard it from unauthorised users. Wifi uses radio waves but using an ether net cable gives more Internet speed. The WiFi has wireless connection and provides Internet,. It is provided by isp’s like: Hathway Airtel Jio Reliance Act fibernet Idea Vodafone ",
            "date": "Answered May 2, 2020",
            "views": "248",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Antara Sharma",
                    "user_href": "/profile/Antara-Sharma-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Springs",
                "href": "/profile/David-Springs"
            },
            "answer_text": " Wi-Fi (or WiFi, wifi) is a play on the older term Hi-Fi, which stood for “High Fidelity,” which was an early term for high quality or stereo sound equipment. When wireless networking came along, someone decided that co-opting that term into WiFi sounded better than just “wireless” or “wireless networking” and here we are. So I suppose you could say that the “Fi” in Wi-Fi means “fidelity” but in reality, it doesn’t really mean anything. Hope this helps. ",
            "date": "Updated August 29, 2018",
            "views": "339",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saurabh Negi",
                "href": "/profile/Saurabh-Negi-16"
            },
            "answer_text": "Full form of WI-FI is local area wireless technology. WI-FI is a wireless networking technology that uses radio waves to provide high-speed network and Internet connections. Introduced in September 1997, the name Wi-Fi also stands for Wireless Fidelity as it is synonymous with WLAN (Wireless Local Area Network). Wi-Fi allows computers, video-game consoles, smart phones, digital cameras, tablet computers, digital audio players, modern printers and other devices to communicate over a wireless network. ",
            "date": "Answered June 20, 2019",
            "views": "349",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Peeyush Gupta",
                    "user_href": "/profile/Peeyush-Gupta-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neel Patel",
                "href": "/profile/Neel-Patel-298"
            },
            "answer_text": "Wi-Fi is defined as an abbreviation for wireless fidelity, meaning you can access or connect to a network using radio waves, without needing to use wires. An example of Wi-Fi is when you go to Starbucks and can join on their network to get on the Internet without having to connect your computer to any wires. ",
            "date": "Answered December 12, 2017",
            "views": "52",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SAURABH-RAJPUT-314"
                },
                {
                    "user_id": "Stephen Wright",
                    "user_href": "/profile/Stephen-Wright-114"
                },
                {
                    "user_id": "Martha Jones",
                    "user_href": "/profile/Martha-Jones-58"
                },
                {
                    "user_id": "Ekta Vikas Kohli",
                    "user_href": "/profile/Ekta-Vikas-Kohli"
                },
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                },
                {
                    "user_id": "IrfanR Saleem",
                    "user_href": "/profile/IrfanR-Saleem"
                },
                {
                    "user_id": "Sharmistha Bhatt",
                    "user_href": "/profile/Sharmistha-Bhatt"
                },
                {
                    "user_id": "Debananda Sagar Sahu",
                    "user_href": "/profile/Debananda-Sagar-Sahu"
                },
                {
                    "user_id": "Zain Ally",
                    "user_href": "/profile/Zain-Ally"
                },
                {
                    "user_id": "Rz Rashid",
                    "user_href": "/profile/Rz-Rashid"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naushad Khan",
                "href": "/profile/Naushad-Khan-169"
            },
            "answer_text": " WIFI also Spelled as Wi-Fi is a local area wireless technology. It allows an electronic device to transfer data or connect to the internet using ISM radio bands. … Wi-Fi is the trademark of the Wi-Fi alliance and used as a brand name for products using the IEEE 802.11 standards. Wifi Full Form in HindiWIFI: वायरलेस निष्ठा Wifi Full Form in EnglishWIFI: Wireless Fidelity Note: Before using our information, you must get confirmation from Google or Wikipedia. Thank you for your valuable time.🙏 ",
            "date": "Answered January 17, 2020",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Blache",
                "href": "/profile/David-Blache"
            },
            "answer_text": "Wireless Fidelity The name Wi-Fi, commercially used at least as early as August 1999, was coined by the brand-consulting firm Interbrand. The Wi-Fi Alliance had hired Interbrand to create a name that was \"a little catchier than 'IEEE 802.11b Direct Sequence'.\" Phil Belanger, a founding member of the Wi-Fi Alliance who presided over the selection of the name \"Wi-Fi\", has stated that Interbrand invented Wi-Fi as a pun upon the word hi-fi. Wi-Fi - Wikipedia ",
            "date": "Answered February 7, 2018",
            "views": "77",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Normas Yakin",
                    "user_href": "/profile/Normas-Yakin"
                },
                {
                    "user_id": "Aryan Kumar Prasad",
                    "user_href": "/profile/आर्यन-कुमार-प्रसाद-Aryan-Kumar-Prasad"
                },
                {
                    "user_id": "Mayandi Mayandi",
                    "user_href": "/profile/Mayandi-Mayandi-1"
                },
                {
                    "user_id": "Kiel Hunt",
                    "user_href": "/profile/Kiel-Hunt"
                },
                {
                    "user_id": "Paul Williams",
                    "user_href": "/profile/Paul-Williams-216"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shreejit Gangadharan",
                "href": "/profile/Shreejit-Gangadharan"
            },
            "answer_text": "It is a trademark used by the brand-consulting firm called Interbrand Corporation and means \"Wireless Fidelity\".  It is a play on the words \"Hi-Fi\" (High Fidelity). The term \"fidelity\" refers to the faithfulness/accuracy of reproduction or transmission of the signal, and \"wireless\" is a distinguishing feature that contrasted with earlier internet connection technologies such as ethernet. Source:http://en.wikipedia.org/wiki/Wi-Fi#The_name ",
            "date": "Answered January 10, 2014",
            "views": "66",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jean Lagrange",
                    "user_href": "/profile/Jean-Lagrange-3"
                },
                {
                    "user_id": "Abhilash Kumar",
                    "user_href": "/profile/Abhilash-Kumar-47"
                },
                {
                    "user_id": "Vishal Pandey",
                    "user_href": "/profile/Vishal-Pandey-424"
                },
                {
                    "user_id": "Rishikesh SR",
                    "user_href": "/profile/Rishikesh-SR-1"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                },
                {
                    "user_id": "Kaushik D",
                    "user_href": "/profile/Kaushik-D"
                },
                {
                    "user_id": "Vivek Verma",
                    "user_href": "/profile/Vivek-Verma-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Leggs",
                "href": "/profile/Dan-Leggs"
            },
            "answer_text": "WiFi was a play on HiFi which meant High Fidelity... so WiFi would also means Wireless Fidelity. This is True! Fidelity means you don't know its there... but its there. Like a Trust or faith. So it means if all conditions are perfect you will receive the best connection possible. Trust isn't blind you just cant see so its also called Fidelity. When you break an invisible border its also called Fidelity, like cheating. But also WiFi is only a Logo now, as adopted by the Wifi associations of some sorts, it means nothing so is a symbol. ",
            "date": "Answered March 9, 2018",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Local Alien",
                    "user_href": "/profile/Local-Alien"
                },
                {
                    "user_id": "Betsy Megas",
                    "user_href": "/profile/Betsy-Megas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Clouse",
                "href": "/profile/Robert-Clouse"
            },
            "answer_text": "Wi-Fi is actually the full name of it. Wi-Fi is a trademark of the Wi-Fi Alliance, which restricts the use of the term Wi-Fi Certified to products that successfully complete interoperability certification testing. It is a trademark name. It is a short way to say what it actually is ‘IEEE 802.11b Direct Sequence’. Wi-Fi - Wikipedia ",
            "date": "Answered March 7, 2018",
            "views": "38",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Newt-16"
                },
                {
                    "user_id": "Will Busby",
                    "user_href": "/profile/Will-Busby-2"
                },
                {
                    "user_id": "Michael Mossman",
                    "user_href": "/profile/Michael-Mossman-1"
                },
                {
                    "user_id": "Matthew Plascencia",
                    "user_href": "/profile/Matthew-Plascencia-2"
                },
                {
                    "user_id": "Nilesh Mukherjee",
                    "user_href": "/profile/Nilesh-Mukherjee-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshitha D'Souza",
                "href": "/profile/Harshitha-DSouza-2"
            },
            "answer_text": "Wi-Fi - Wireless Fidelity Wi-Fi is the name of a popular wireless networking technology that uses radio waves to provide wireless high-speed Internet and network connections. WiFiconnection is established using a wireless adapter to create hotspots - areas in the vicinity of a wireless router that are connected to the network and allow users to access internet services. ",
            "date": "Answered June 30, 2019",
            "views": "8",
            "upvotes": " Answer requested by Peeyush Gupta",
            "upvoters": [
                {
                    "user_id": "Feranmi Ajayi-Henry",
                    "user_href": "/profile/Feranmi-Ajayi-Henry"
                },
                {
                    "user_id": "Kalidasan Kalidasan",
                    "user_href": "/profile/Kalidasan-Kalidasan-1"
                },
                {
                    "user_id": "Sanjeev Kumar",
                    "user_href": "/profile/Sanjeev-Kumar-5338"
                },
                {
                    "user_id": "Gnana Sukumar",
                    "user_href": "/profile/Gnana-Sukumar"
                },
                {
                    "user_id": "Rachit Sharma",
                    "user_href": "/profile/Rachit-Sharma-69"
                },
                {
                    "user_id": "Vishal Vishal",
                    "user_href": "/profile/Vishal-Vishal-190"
                },
                {
                    "user_id": "Varinder Singh",
                    "user_href": "/profile/Varinder-Singh-179"
                },
                {
                    "user_id": "Layaa Veeravalli",
                    "user_href": "/profile/Layaa-Veeravalli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankesh Pandey",
                "href": "/profile/Ankesh-Pandey-27"
            },
            "answer_text": "The fullform of WiFi is Wireless Fidelity They just wanted to make a rhyming name like jim-jam, tik-tak or ping-pong… So they included Fi along with Wi and the name became WiFi. Upvote if helped ! ",
            "date": "Answered October 14, 2017",
            "views": "44",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suresh Kumar",
                    "user_href": "/profile/Suresh-Kumar-15382"
                },
                {
                    "user_id": "Gourav Garg",
                    "user_href": "/profile/Gourav-Garg-35"
                },
                {
                    "user_id": "Pooja Sharma",
                    "user_href": "/profile/Pooja-Sharma-1426"
                },
                {
                    "user_id": "Rishav Nath Pati",
                    "user_href": "/profile/Rishav-Nath-Pati"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aryak Sen",
                "href": "/profile/Aryak-Sen-1"
            },
            "answer_text": "WiFi stands for Wireless Fidelity. Well, what if I say that this is actually wrong? Yes, this is technically a wrong notion that cropped up from a nonsense advertising slogan, “The standard for ‘Wireless Fidelity’.” The term WiFi was actually invented as a play on words of the term, Hi-Fi (High Fidelity). But anyway these days, we call it WiFi- Wireless Fidelity.  By the way, if we haven't met before, I am Aryak .Have a great day! ",
            "date": "Answered April 19, 2018",
            "views": "118",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peeyush Gupta",
                    "user_href": "/profile/Peeyush-Gupta-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Morley",
                "href": "/profile/Paul-Morley-12"
            },
            "answer_text": "I used to always think WiFi was short for Wireless Fidelity because I’m old enough to remember cassette tapes that were Hi-Fi (High-Fidelity), which roughly translates to ‘high quality’, so to prove myself right I did some research and I was wrong. WiFi is nothing more than a trademark for the 802.11 protocol which was a clever marketing strategy and rolls of the tongue easily. ",
            "date": "Answered September 27, 2018",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harsh",
                "href": "/profile/Harsh-957"
            },
            "answer_text": "There is a misconception that Wi-Fi stands for Wireless Fidelity. Wi-Fi takes its name from the Wi-Fi alliance. Wi-Fi Alliance is an organization made up of leading wireless equipment and software providers with the missions of certifying all 802.11-based products for interoperability and promoting the term Wi-Fi as the global brand name across all markets for any 802.11-based wireless LAN products. ",
            "date": "Answered July 26, 2019",
            "views": "315",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mayandi Mayandi",
                    "user_href": "/profile/Mayandi-Mayandi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shahariar Kabir",
                "href": "/profile/Shahariar-Kabir-7"
            },
            "answer_text": "WI-FI is a local area of wireless technology. WI-FI is a wireless networking technology that uses radio waves to provide high-speed network and Internet connections. The names Wi-Fi also for Wireless Fidelity as it is synonymous with WLAN (Wireless Local Area Network). Wi-Fi networks don’t have any physical wired connection between the sender and receiver. ",
            "date": "Answered July 6, 2019",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sujeet Kumar",
                "href": "/profile/Sujeet-Kumar-182"
            },
            "answer_text": "Wifi Full Form is Wireless Fidelity. It normally refers to systems that use 802.11 standards developed and released by IEEE or Institute of Electrical and Electronic Engineers in the year 1997. Initially, this system was promoted largely by a trade group called ‘Wi-Fi Alliance’, which mastered commercialization of technology and eventually it reached its pinnacle. This could possibly be the reason why WiFi full form has its namWiFi ",
            "date": "Answered July 28, 2016",
            "views": "5",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raghunath RS",
                    "user_href": "/profile/Raghunath-RS-1"
                },
                {
                    "user_id": "Mohammed Hassen Mohammed",
                    "user_href": "/profile/Mohammed-Hassen-Mohammed"
                },
                {
                    "user_id": "Samuel Liu",
                    "user_href": "/profile/Samuel-Liu-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kris Lim",
                "href": "/profile/Kris-Lim-4"
            },
            "answer_text": "It's a wireless local area network for mobile devices to network and mostly used to connect to the Internet without physical wires. Area of coverage for a single hotspot are normally around twenty metres for those used indoors in homes and small offices to 50 plus metres outdoors. However according to Starhub, a telco in Singapore, there is a different definition:     ",
            "date": "Answered July 8, 2015",
            "views": "905",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Salami Guadalupa",
                    "user_href": "/profile/Salami-Guadalupa"
                },
                {
                    "user_id": "Peter Nunn",
                    "user_href": "/profile/Peter-Nunn-11"
                },
                {
                    "user_id": "Neha Sharma",
                    "user_href": "/profile/Neha-Sharma-5521"
                },
                {
                    "user_id": "Stephen Wright",
                    "user_href": "/profile/Stephen-Wright-114"
                },
                {
                    "user_id": "Opeyemi Kowe Sorunke",
                    "user_href": "/profile/Opeyemi-Kowe-Sorunke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Owen",
                "href": "/profile/Chris-Owen-53"
            },
            "answer_text": "What is WiFi? As of this answer You had 29 replys. Let me add this to WIFI since the “INDUSTRY” is changing due to “5G eneraton” cellular. Wi-Fi is rebranding itself: Here's how to understand the new naming So 2.4G or ghz and 5G or ghz WiFi has gotten confused with what “5G Generation” cellular is. WiFi is a mix of alphabets A) Typically Commercial, Now called WIFI1 B) Consumers grade, Now called WIFI2 G) Consumers grade, Now called WIFI4 N) Consumers grade, Now called WIFI5 AC) Consumers grade Newest to be released, Now called WIFI6 AX) is being developed now, Now called WIFI7 All of these are derived from 802.11 standards where 5G cellular is a standard of its own and follows the 2G, 3G, 4G, cellular generations that have been created. ",
            "date": "Answered January 12, 2019",
            "views": "188",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Subin V.s",
                "href": "/profile/Subin-V-s-4"
            },
            "answer_text": "Wi-Fi is a brand originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks (WLAN) based on the IEEE 802.11 specifications. Wi-Fi is a brand originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks (WLAN) based on the IEEE 802.11 specifications.wifi stands for wireless fidelity. ",
            "date": "Answered January 16, 2019",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Samuels",
                "href": "/profile/Kevin-Samuels-14"
            },
            "answer_text": "WiFi was originally chosen as a catchy name that corresponds to Hi-fi, which is an abbreviation for High fidelity. So you could say that WiFi is an abbreviation for “wireless fidelity”, but nobody ever called it that. I’d say it isn’t an abbreviation for anything. Wi-Fi#etymology - Wikipedia ",
            "date": "Answered June 6, 2018",
            "views": "647",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Tara Kant",
                    "user_href": "/profile/Tara-Kant-1"
                },
                {
                    "user_id": "Techoradar",
                    "user_href": "/profile/Techoradar"
                },
                {
                    "user_id": "Srujan Raj",
                    "user_href": "/profile/Srujan-Raj-1"
                },
                {
                    "user_id": "Shivanshu Kesharwani",
                    "user_href": "/profile/Shivanshu-Kesharwani-1"
                },
                {
                    "user_id": "Julius Rowe",
                    "user_href": "/profile/Julius-Rowe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suneet Srivastava",
                "href": "/profile/Suneet-Srivastava-10"
            },
            "answer_text": "Wireless Fidelity Wi-Fi, is a mechanism that allows electronic devices to exchange data wirelessly over a computer network. “Wi-Fi” is a trademark of the Wi-Fi Alliance and the brand name for products using the IEEE 802.11 family of standards. The term Wi-Fi suggests Wireless Fidelity, resembling the long-established audio-equipment classification term Hi-Fi or high fidelity. ",
            "date": "Answered January 16, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan McDonough",
                "href": "/profile/Dan-McDonough-9"
            },
            "answer_text": "W I F I !!! Does Not Mean Anything, Just was a Quick Name That Stuck To a discovery of a New Wireless System of Transporting a Radio signal, Sound & Video Capable of relay around the world, Transmitters / Phone lines send your Router & Hot Spots signals from a source & are relayed out to receivers, This is just a short answer to your question But is more complex, ",
            "date": "Answered February 6, 2018",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Whipp",
                "href": "/profile/Steve-Whipp"
            },
            "answer_text": "It’s Wireless Fidelity. In the same way that Hi-Fi is High Fidelity. Fidelity meaning “The degree of exactness with which something is copied or reproduced.” So in this case it’s suggesting that we can throw data around, wirelessly and be assured to get an exact copy of it. ",
            "date": "Answered January 26, 2018",
            "views": "62",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Debaditya Shrestha",
                    "user_href": "/profile/Debaditya-Shrestha"
                },
                {
                    "user_id": "Stulity",
                    "user_href": "/profile/Stulity-1"
                },
                {
                    "user_id": "Ayush Bhatt",
                    "user_href": "/profile/Ayush-Bhatt-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Pratap Singh",
                "href": "/profile/Abhishek-Pratap-Singh-156"
            },
            "answer_text": "WiFi does not stand for “Wireless Fidelity”. It does not stand for anything, it's just a name provided according to the IEEE. It's a “myth” that Wireless Fidelity is the full form of WiFi which isn't. And for information, you can simply google it by “wifi” & you'll get whatever you need to know. Also, there might b some pages or websites which will define it as “Wireless Fidelity” but they all are wrong so don't get confused. Ok. Trust Wikipedia & Read about it from there. Hope this helps. ",
            "date": "Answered June 2, 2017",
            "views": "57",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Susanna Fowler",
                    "user_href": "/profile/Susanna-Fowler"
                },
                {
                    "user_id": "Jayati Dhar",
                    "user_href": "/profile/Jayati-Dhar"
                },
                {
                    "user_id": "Ravi Agarwal",
                    "user_href": "/profile/Ravi-Agarwal-367"
                }
            ]
        },
        {
            "author_info": {
                "name": "V Seshadri",
                "href": "/profile/V-Seshadri"
            },
            "answer_text": "Wi-Fi or WiFi is technology for radio wireless local area networking of devices based on the IEEE 802.11 standards. Wi‑Fi is a trademark of the Wi-Fi Alliance, which restricts the use of the term Wi-Fi Certified to products that successfully complete interoperability certification testing. ",
            "date": "Answered September 13, 2018",
            "views": "79",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gkgf",
                    "user_href": "/profile/Gkgf"
                },
                {
                    "user_id": "Jitendra Singh Rathore",
                    "user_href": "/profile/Jitendra-Singh-Rathore"
                },
                {
                    "user_id": "Aaditya Barnwal",
                    "user_href": "/profile/Aaditya-Barnwal-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lorith Arp",
                "href": "/profile/Lorith-Arp"
            },
            "answer_text": "wifi :- Wireless Fidelity Wi-fi is a brand licensed and a local area wireless Technology based on the IEEE specification. It works as a data exchanger and connect to the net using 5GHz SHF and 2.4GHz Radio waves. It works with variety of Wireless network products like – Television, Laptop, Computer, Mobile Phone, Gaming console, DVD Players, Digi Camera etc. WIFI is a common and most popular word nowadays, If Internet comes first then WIFI must be placed at second spot. ",
            "date": "Answered December 20, 2016",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ananya Verma",
                "href": "/profile/Ananya-Verma-71"
            },
            "answer_text": "Wifi means Wireless Fidelity. Wi-Fi is a technology for wireless local area networking with devices based on the IEEE 802.11 standards. Wi-Fi is a trademark of the Wi-Fi Alliance, which restricts the use of the term Wi-Fi Certified to products that successfully complete interoperability certification testing. ",
            "date": "Answered January 10, 2018",
            "views": "37",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Yeptho",
                    "user_href": "/profile/Paul-Yeptho-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prachi Sharma",
                "href": "/profile/Prachi-Sharma-575"
            },
            "answer_text": "Wi-Fi is the name of a popular wireless networking technology that uses radio waves to provide wireless high-speed Internet and network connections. A common misconception is that the term Wi-Fi is short for \"wireless fidelity,\" however this is not the case. Wi-Fi is simply a trademarked phrase that means IEEE 802.11x. ",
            "date": "Answered November 2, 2019",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mickey Balvert",
                "href": "/profile/Mickey-Balvert"
            },
            "answer_text": "WiFi is a technology that uses radio waves to provide network connectivity. A WiFi connection is established using a wireless adapter to create hotspots areas in the vicinity of a wireless router that are connected to the network and allow users to access internet services. Once configured, WiFi provides wireless connectivity to your devices. ",
            "date": "Answered August 24, 2016",
            "views": "169",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lakshmi Kumari",
                "href": "/profile/Lakshmi-Kumari-59"
            },
            "answer_text": "wifi-Wireless Fidelity It is basically a brand, originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks (WLAN). ... Wireless access point (WAP) connects a group of wireless devices to an adjacent wired LAN. Technical Specification. It is based on the IEEE 802.11 specifications. ",
            "date": "Answered November 24, 2018",
            "views": "163",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peeyush Gupta",
                    "user_href": "/profile/Peeyush-Gupta-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Techoradar",
                "href": "/profile/Techoradar"
            },
            "answer_text": "The Wi-Fi is stands for “Wireless Fidelity”. The Wi-Fi is a local wireless technology (unguided medium) that provides high speed internet access using a radio waves to users. There is no wired connection between the sender and the receiver by the use of a radio frequency technology. The Full Form of WIFI is the trademark of Wi-Fi Alliance, which is the use of the term WIFI certified to product that complete testing. ",
            "date": "Answered February 15, 2020",
            "views": "191",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prashant Lomate",
                "href": "/profile/Prashant-Lomate-3"
            },
            "answer_text": "Wi-Fi is the name of a popular wireless networking technology that uses radio waves to provide wirelesshigh-speed Internet and network connections. A common misconception is that the term Wi-Fi is short for \"wireless fidelity,\" however this is not the case. Wi-Fi is simply a trademarked phrase that means IEEE 802.11x. ",
            "date": "Answered May 8, 2019",
            "views": "246",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rahul Pawar",
                    "user_href": "/profile/Rahul-Pawar-827"
                },
                {
                    "user_id": "Dharamveer Dheer",
                    "user_href": "/profile/Dharamveer-Dheer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amandeep",
                "href": "/profile/Amandeep-87"
            },
            "answer_text": "Wi-Fi : Wireless Fidelity. WIFI also Spelled as Wi-Fi is a local area wireless technology. It allows an electronic device to transfer data or connect to the internet using ISM radio bands. ... Wi-Fi is the trademark of the Wi-Fialliance and used as a brand name for products using the IEEE 802.11 standards.  ",
            "date": "Answered May 20, 2019",
            "views": "316",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bhargob Chetry",
                    "user_href": "/profile/Bhargob-Chetry"
                },
                {
                    "user_id": "Umesh Kumar Chaurasia",
                    "user_href": "/profile/Umesh-Kumar-Chaurasia-1"
                },
                {
                    "user_id": "Normas Yakin",
                    "user_href": "/profile/Normas-Yakin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sajandeep Singh",
                "href": "/profile/Sajandeep-Singh-1"
            },
            "answer_text": "Wireless Fidelity is a brand, originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks (WLAN). ... Wireless access point (WAP) connects a group of wireless devices to an adjacent wired LAN. Technical Specification. It is based on the IEEE 802.11 specifications. ",
            "date": "Answered June 2, 2017",
            "views": "96",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sumit Chavda",
                    "user_href": "/profile/Sumit-Chavda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srikrishna Chaitanya",
                "href": "/profile/Srikrishna-Chaitanya-3"
            },
            "answer_text": "wifi is the acronym of wireless fidelity.It is a communication protocol, which facilitates the data transfer through wireless technology. Generally the range of a wifi zone is 30M radius. (it slightly varies by the capacity of the modem)now a days almost all smart fones have wifi facility and adde to this they can act as a wifi source (hotspot) ",
            "date": "Answered September 24, 2015",
            "views": "440",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charles Gitahi",
                    "user_href": "/profile/Charles-Gitahi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devin Say",
                "href": "/profile/Devin-Say"
            },
            "answer_text": "Wi-Fi is the name of a popular wireless networking technology that uses radio waves to provide wireless high-speed Internet and network connections. A common misconception is that the term Wi-Fi is short for \"wireless fidelity,\" however this is not the case. Wi-Fi is simply a trademarked phrase that means IEEE 802.11x. ",
            "date": "Answered November 22, 2018",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Dowd",
                "href": "/profile/Steve-Dowd-2"
            },
            "answer_text": "Wi-Fi is a Network Topology that supports the 802.11 a/b/g/n standards as specified by IEEE. Each of those standards supports different throughputs. It has come to relate to the internet router provided by most ISPs, but the router is not part of the standard. ",
            "date": "Answered August 11, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hirok DAS",
                    "user_href": "/profile/Hirok-DAS-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajendra Maharana",
                "href": "/profile/Rajendra-Maharana-3"
            },
            "answer_text": "Hey There, WI-FI is the short form or abbreviation of Wireless Fidelity. It is a technology for radio wireless local area networking of devices based on the IEEE 802.11 standards. For more info, please check the wikipedia link out below. Wi-Fi - Wikipedia I hope this information helps. Please don’t forget to upvote if you find this answer useful ",
            "date": "Answered June 24, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saniya",
                "href": "/profile/Saniya-171"
            },
            "answer_text": "WIFI: Wireless Fidelity. WIFI also Spelled as Wi-Fi is a local area wireless technology. It allows an electronic device to transfer data or connect to the internet using ISM radio bands. ... Wi-Fi is the trademark of the Wi-Fi alliance and used as a brand name for products using the IEEE 802.11 standards. ",
            "date": "Answered December 17, 2018",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashish Bhargava",
                "href": "/profile/Ashish-Bhargava-15"
            },
            "answer_text": "Wireless fidility is a brand, originally licensed by the Wi-FiAlliance to describe the underlying technology of wireless local area networks (WLAN). ... Wireless access point (WAP) connects a group of wireless devices to an adjacent wired LAN. Technical Specification. It is based on the IEEE 802.11 specifications. ",
            "date": "Answered June 6, 2017",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ripul Agrawal",
                    "user_href": "/profile/Ripul-Agrawal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ananda Vaishnav",
                "href": "/profile/Ananda-Vaishnav"
            },
            "answer_text": "What doesWiFimean? .Wi-Fi, is a mechanism that allows electronic devices to exchange data wirelessly over a computer network. “Wi-Fi” is a trademark of the Wi-Fi Alliance and the brand name for products using the IEEE 802.11 family of standards. The term Wi-Fi suggests Wireless Fidelity, resembling the long-established audio-equipment classification term Hi-Fi or high fidelity. ",
            "date": "Answered October 15, 2017",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shivendu Pratap Bajpai",
                    "user_href": "/profile/Shivendu-Pratap-Bajpai"
                },
                {
                    "user_id": "Arthur Homan",
                    "user_href": "/profile/Arthur-Homan"
                },
                {
                    "user_id": "Dave Nelson",
                    "user_href": "/profile/Dave-Nelson-89"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajan Srivastav",
                "href": "/profile/Rajan-Srivastav-2"
            },
            "answer_text": "Wi-Fi is the name of a wireless networking technology that uses radio waves to provide high-speed network and Internet connections. A common misconception is that the term Wi-Fi is short for \"wireless fidelity.\" This is not the case. Wi-Fi is simply a trademarked term meaning IEEE 802.11x. ",
            "date": "Answered December 14, 2017",
            "views": "21",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Lincoln",
                    "user_href": "/profile/Peter-Lincoln-6"
                },
                {
                    "user_id": "Razvan Serb",
                    "user_href": "/profile/Razvan-Serb"
                },
                {
                    "user_id": "Dan Leggs",
                    "user_href": "/profile/Dan-Leggs"
                }
            ]
        },
        {
            "author_info": {
                "name": "Supraj Ranga",
                "href": "/profile/Supraj-Ranga-1"
            },
            "answer_text": "“Wireless Fidelity” Wi-Fi is the name of a popular wireless networking technology that uses radio waves to provide wireless high-speed Internet and network connections. A common misconception is that the term Wi-Fi is short for \"wireless fidelity,\" however this is not the case. ",
            "date": "Answered June 20, 2020",
            "views": "3",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tana Mongoose",
                "href": "/profile/Tana-Mongoose-7"
            },
            "answer_text": "Wi-Fi stands for Wireless Fidelity. It is just a trademarked term used for IEEE 802.11x. Wi-Fi uses radio waves to communicate between devices and provides a high speed wireless internet connection to Wi-Fi enabled devices. Its development began in 1971 and was released in 1997 in US. Its further development and maintenance is lead by the Wi-Fi alliance. ",
            "date": "Answered April 23, 2018",
            "views": "395",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vandana Chaurasia",
                "href": "/profile/Vandana-Chaurasia-6"
            },
            "answer_text": "WIFI: Wireless Fidelity. WIFI also Spelled as Wi-Fi is a local area wireless technology. It allows an electronic device to transfer data or connect to the internet using ISM radio bands. ... Wi-Fi is the trademark of the Wi-Fi alliance and used as a brand name for products using the IEEE 802.11 standards. ",
            "date": "Answered November 23, 2018",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashish Bishwas",
                "href": "/profile/Ashish-Bishwas"
            },
            "answer_text": "WIFI: Wireless Fidelity is a technology for wireless local area networking with devices based on the IEEE 802.11 standards. It was introduced on september 1998. Compatible Hardwares : Personal Computers, Gaming Consoles,Televisions,Printers ",
            "date": "Answered March 7, 2018",
            "views": "41",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chandan Kulkarni",
                    "user_href": "/profile/Chandan-Kulkarni-7"
                },
                {
                    "user_id": "Musa Muhammad Shamsudeen",
                    "user_href": "/profile/Musa-Muhammad-Shamsudeen"
                },
                {
                    "user_id": "Vivek Shakya",
                    "user_href": "/profile/Vivek-Shakya-4"
                },
                {
                    "user_id": "Shubhendu Shekhar",
                    "user_href": "/profile/Shubhendu-Shekhar"
                },
                {
                    "user_id": "Shreejit Gangadharan",
                    "user_href": "/profile/Shreejit-Gangadharan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma Elizabeth",
                "href": "/profile/Emma-Elizabeth-117"
            },
            "answer_text": "Hi, The term Wi-Fi suggests Wireless Fidelity, resembling the long-established audio-equipment classification term Hi-Fi or high fidelity. Wi-Fi is the name of a popular wireless networking technology that uses radio waves to provide wireless high-speed Internet and network connections. I hope it helps you! Thank You! ",
            "date": "Answered April 12, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Harrison",
                "href": "/profile/Steve-Harrison-64"
            },
            "answer_text": "A commonly held myth is that it stands for wireless fidelity. This is likely due to people understanding, correctly, that HiFi stands for High Fidelity. However, Wi-Fi was patented as simply Wi-Fi and should not be extended to anything else. Redirect Notice ",
            "date": "Answered May 18, 2019",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Moorthi Karuppusamy",
                "href": "/profile/Moorthi-Karuppusamy"
            },
            "answer_text": "I'm not trying to be offensive or make fun of you but you could have googled it ..Its the easiest way to find such things..Use the right tool for the right thing..It makes your work a lot easier.. ",
            "date": "Answered January 10, 2014",
            "views": "1",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nitin Devlal",
                    "user_href": "/profile/Nitin-Devlal"
                },
                {
                    "user_id": "Bhargob Chetry",
                    "user_href": "/profile/Bhargob-Chetry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gunjan Sain",
                "href": "/profile/Gunjan-Sain-1"
            },
            "answer_text": "Wireless Fidelity, Wi-Fi, is a mechanism that allows electronic devices to exchange data wirelessly over a computer network. “Wi-Fi” is a trademark of the Wi-Fi Alliance and the brand name for products using the IEEE 802.11 family of standards. ",
            "date": "Answered February 2, 2017",
            "views": "49",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Harshit Gupta",
                    "user_href": "/profile/Harshit-Gupta-108"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bibjos",
                "href": "/profile/Bibjos"
            },
            "answer_text": "The word wifi doesn't sounds like a complete word, but it actually is. The word \"WiFi is commonly mistaken for Wireless Fidelity, but its not true. WIFI just doest has a full form. If you want to know more just browse through WiFi isn't short for \"Wireless Fidelity\" ",
            "date": "Answered February 28, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajshankar Maheswaran",
                "href": "/profile/Rajshankar-Maheswaran"
            },
            "answer_text": "There is no full form for Wi-Fi, apparently, when Wi-Fi was created, the creators decided to name it so because it used to rhyme with Hi-Fi.[1] The term Wi-Fi is meaningless. Stop worrying about it’s full form. Footnotes[1] WiFi isn't short for \"Wireless Fidelity\"",
            "date": "Answered May 30, 2017",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akash Devmorari",
                "href": "/profile/Akash-Devmorari"
            },
            "answer_text": "Wi-fi stands for. Wireless Fidelity, is a mechanism that allows electronic devices to exchange data wirelessly over a computer network. “Wi-Fi” is a trademark of the Wi-Fi Alliance and the brand name for products using the IEEE 802.11 family of standards. The term Wi-Fi suggests Wireless Fidelity, resembling the long-established audio-equipment classification term Hi-Fi or high fidelity. ",
            "date": "Answered July 10, 2017",
            "views": "629",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sushma Kumari",
                    "user_href": "/profile/Sushma-Kumari-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Grant",
                "href": "/profile/Jeremy-Grant-40"
            },
            "answer_text": "WiFi is a technology that uses radio waves to provide network connectivity. A WiFi connection is established using a wireless adapter to create hotspots - areas in the vicinity of a wireless router that are connected to the network and allow users to access internet services. ",
            "date": "Answered January 11, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Mitchell",
                "href": "/profile/Jim-Mitchell-83"
            },
            "answer_text": "facility allowing computers, smartphones, or other devices to connect to the Internet or communicate with one another wirelessly within a particular area. Origin  1990s: from wireless + an apparently arbitrary second element, after hi-fi; sometimes incorrectly interpreted as a shortening of Wireless Fidelity . ",
            "date": "Answered August 11, 2017",
            "views": "925",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sudheer Manikonda",
                "href": "/profile/Sudheer-Manikonda"
            },
            "answer_text": "Wireless Fidelity is a brand, originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks (WLAN). ... Wireless access point (WAP) connects a group of wireless devices to an adjacent wired LAN. Technical Specification. It is based on the IEEE 802.11 specifications. ",
            "date": "Answered June 11, 2017",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Taresh Garg",
                "href": "/profile/Taresh-Garg"
            },
            "answer_text": "Thanks for A2A!! WiFi stands for Wireless Fidelity It is a technology based on IEEE 802.11 standard to transmit and receive data between two terminal devices wirelessly. One can use it to connect two devices or can share internet between two computers/mobiles. WiFi also stands for Wireless Internet for Frequent Interface. ",
            "date": "Answered October 8, 2016",
            "views": "31",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Neeraj Nishad",
                    "user_href": "/profile/Neeraj-Nishad-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajay Sharma",
                "href": "/profile/Ajay-Sharma-483"
            },
            "answer_text": "WiFi is abbreviated “Wireless Fidelity\". Wi-Fi is technology for radio wireless local area networking of devices based on the IEEE 802.11 standards.  For more information please check Wi-Fi - Wikipedia. PS - If you found this helpful, feel free to upvote this answer so it can help more people! ",
            "date": "Updated April 2, 2019",
            "views": "123",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aditya Nair",
                "href": "/profile/Aditya-Nair-30"
            },
            "answer_text": "Wi-fi is a local area wireless computer networking technolog or in other words its a facility allowing computers, smartphones, or other devices to connect to the Internet or communicate with one another wirelessly within a particular area.P.S. - To me its love cause like love its in the air :P hope this helps :) ",
            "date": "Answered May 11, 2015",
            "views": "353",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sukanya Bhangimatam",
                "href": "/profile/Sukanya-Bhangimatam"
            },
            "answer_text": "WiFi stands for Wireless Fidelity. “Wi-Fi” is a trademark of the Wi-Fi Alliance and the brand name for products using the IEEE 802.11 family of standards. The term Wi-Fi suggests Wireless Fidelity, resembling the long-established audio-equipment classification term Hi-Fi or high fidelity. ",
            "date": "Answered May 30, 2017",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Owen",
                    "user_href": "/profile/Chris-Owen-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kim Grennan",
                "href": "/profile/Kim-Grennan-3"
            },
            "answer_text": "Wireless connectivity, also know as WiFi, is the technology that enables us to connect our PC, mobile, or tablet to high speed internet. The radio signals the technology uses are what enable us to transmit information to our devices. Check out this article for more in depth info! ",
            "date": "Answered August 23, 2018",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gurpreet Singh Dhaliwal",
                    "user_href": "/profile/Gurpreet-Singh-Dhaliwal-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jannee Fertility Centre",
                "href": "/profile/Jannee-Fertility-Centre"
            },
            "answer_text": "The Wi-Fi Alliance defines Wi-Fi as any \"wireless local area network\" (WLAN) product based on the Institute of Electrical and Electronics Engineers' (IEEE) 802.11 standards. However, the term \"Wi-Fi\" is used in general English as a synonym for \"WLAN\" since most modern WLANs are based on these standards. ",
            "date": "Answered October 7, 2017",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deepti Sagar",
                    "user_href": "/profile/Deepti-Sagar-1"
                },
                {
                    "user_id": "Ronak Verma",
                    "user_href": "/profile/Ronak-Verma-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sayyad Atif",
                "href": "/profile/Sayyad-Atif-2"
            },
            "answer_text": "Wireless Fidelity is a brand, originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks (WLAN). ... Wireless access point (WAP) connects a group of wireless devices to an adjacent wired LAN. Technical Specification. It is based on the IEEE 802.11 specifications. ",
            "date": "Answered January 23, 2018",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Miller",
                "href": "/profile/John-Miller-2107"
            },
            "answer_text": "Wireless Fidelity. It is a local area wireless technology. It allows an electronic device to transfer data or connect to the internet using ISM radio bands. Wi-Fi is the trademark of the Wi-Fialliance and used as a brand name for products using the IEEE 802.11 standards. ",
            "date": "Answered May 8, 2019",
            "views": "258",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rahmat",
                "href": "/profile/Rahmat-18"
            },
            "answer_text": "Full form of WiFi is wireless Fidelity . It allows an electronic device to transfer data or connect to the internet using ISM radio bands. Wi-Fi is the trademark of the Wi-Fi alliance and used as a brand name for products using the IEEE 802.11 standards. ",
            "date": "Answered May 24, 2019",
            "views": "114",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhay Gupta",
                "href": "/profile/Abhay-Gupta-259"
            },
            "answer_text": "This what I got from a Google search. Wi-Fi stands for nothing it's just a name for advertising of a company. But many believe it is Wireless Fidelity in comparison with Hi-Fi which stands for High Fidelity. You can read the full article here: No Seriously, What Does Wi-Fi Stand For? ",
            "date": "Answered May 4, 2017",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Krishan Shah",
                "href": "/profile/Krishan-Shah-8"
            },
            "answer_text": "Wireless Fidelity is a brand, originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks (WLAN). ... Wireless access point (WAP) connects a group of wireless devices to an adjacent wired LAN. Technical Specification. It is based on the IEEE 802.11 specifications. ",
            "date": "Answered October 7, 2017",
            "views": "503",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mandip Kumar",
                "href": "/profile/Mandip-Kumar-10"
            },
            "answer_text": "Originally Answered: What is the full form of WiFi? Wi-Fi, is a mechanism that allows electronic devices to exchange data wirelessly over a computer network. “Wi-Fi” is a trademark of the Wi-Fi Alliance and the brand name for products using the IEEE 802.11 family of standards. ",
            "date": "Answered May 30, 2018",
            "views": "708",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saurabh Kurwar",
                "href": "/profile/Saurabh-Kurwar"
            },
            "answer_text": "Wi-fi stand for wireless fidelity. Devices that can use Wi-Fi technologies include desktops and laptops, video game consoles, smartphones and tablets, smart TVs, digital audio players and modern printers. ",
            "date": "Answered September 1, 2018",
            "views": "759",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anbu Arasu",
                    "user_href": "/profile/Anbu-Arasu-169"
                },
                {
                    "user_id": "POONGAI LAKSHMI",
                    "user_href": "/profile/POONGAI-LAKSHMI"
                },
                {
                    "user_id": "Impractical Jokers",
                    "user_href": "/profile/Impractical-Jokers-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vignesh.16",
                "href": "/profile/Vignesh-16-2"
            },
            "answer_text": "Wireless Fidelity - It uses radio waves to provide high speed internet connections and has a range of about 20 meters or so depending on the number of antennas on the router. ",
            "date": "Answered September 1, 2018",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Andersen",
                    "user_href": "/profile/Thomas-Andersen-36"
                },
                {
                    "user_id": "Eric Joyce",
                    "user_href": "/profile/Eric-Joyce-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sreenath Pradeep",
                "href": "/profile/Sreenath-Pradeep-1"
            },
            "answer_text": "Wi-Fi is a trademark of wireless local area networking (WLAN). As a result, there is no such acronym for it Wi-Fi is simply a trademarked term meaning IEEE 802.11x. The false notion that the brand name \"Wi-Fi\" is short for \"wireless fidelity\" has spread to such an extent that even industry leaders have included the phrase wireless fidelity in a press release. ",
            "date": "Answered July 6, 2019",
            "views": "177",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                },
                {
                    "user_id": "IrfanR Saleem",
                    "user_href": "/profile/IrfanR-Saleem"
                },
                {
                    "user_id": "Kevin Thomas",
                    "user_href": "/profile/Kevin-Thomas-457"
                }
            ]
        },
        {
            "author_info": {
                "name": "Indra Kumar Sanku",
                "href": "/profile/Indra-Kumar-Sanku"
            },
            "answer_text": "WIFI :Wireless Fidelity is a local wireless connectivity. it helps in connecting electronic devices, internet using radio bands to access or exchange of data over the network using routers and is standardized under IEEE 802.11. ",
            "date": "Answered December 13, 2017",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kiran TP",
                    "user_href": "/profile/Kiran-TP-3"
                },
                {
                    "user_id": "Sumit Kumar",
                    "user_href": "/profile/Sumit-Kumar-1190"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tushar Pandey",
                "href": "/profile/Tushar-Pandey-65"
            },
            "answer_text": "A very simple and straighforward answer… AND ITS CORRECT!!! WIFI stands for WIreless FIdility Im a guy pursuing B.tech Computer Sceince, and on a very serious note I request you to NOT to listen to anyone saying anything else about it…..they are wrong!!! ",
            "date": "Answered October 30, 2017",
            "views": "66",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nagendra Gupta",
                "href": "/profile/Nagendra-Gupta-2"
            },
            "answer_text": "well it’s WIreless FIdelity. I think quora may not be the best place for this question as you can easily google it without waiting for someone to answer. I do know how addictive quora is, but common you’re stretching it way far. ",
            "date": "Updated December 3, 2016",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harsh Sharma",
                "href": "/profile/Harsh-Sharma-236"
            },
            "answer_text": "Wifi stands for Wireless Fidelity.. Wireless Fidelity is a brand, originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks .Wi-Fi is just a trademarkused for IEEE 802.11 (wireless LAN ) standards.A computer's wireless adapter translates data into a radio signal and transmits it using an antenna…. ",
            "date": "Updated June 23, 2018",
            "views": "387",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nondita Ray (Ruch)",
                "href": "/profile/Nondita-Ray-Ruch"
            },
            "answer_text": "Dear student, Wifi stands for Wireless Fidelity Wireless Internet For Idiots Wireless Internet for Frequent Interface Water in Fuel Indicator Wireless Imagination Found Interesting Wireless Internet Frequent Interface Women In The Fastener Industry Women In The Footwear Industry ",
            "date": "Answered June 28, 2019",
            "views": "20",
            "upvotes": " Answer requested by Peeyush Gupta",
            "upvoters": [
                {
                    "user_id": "Sunil Jha",
                    "user_href": "/profile/Sunil-Jha-99"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gokul Kasturirangan",
                "href": "/profile/Gokul-Kasturirangan"
            },
            "answer_text": "Wi-Fi stands for Wireless Fidelity We can use WI-FI for transferring data from one device to another without using copper wires. But Li-Fi (light fidelity) is better than Wi-Fi because it can transfer data at better speeds than Wi-Fi ",
            "date": "Updated December 19, 2017",
            "views": "820",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maayank Tyagi",
                    "user_href": "/profile/Maayank-Tyagi"
                },
                {
                    "user_id": "Kriti Goel",
                    "user_href": "/profile/Kriti-Goel-1"
                },
                {
                    "user_id": "Protyusha Ahmed",
                    "user_href": "/profile/Protyusha-Ahmed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Md. Sojibul Islam",
                "href": "/profile/Md-Sojibul-Islam-1"
            },
            "answer_text": "WiFi is defined as an abbreviation for wireless fidelity, meaning you can access or connect to a network using radio waves, without needing to use wires. an example of WiFi is when you go Starbucks and can join on their network to get on the Internet without having to connect your computer to any wires.  Look at the image examples wifi ",
            "date": "Answered May 10, 2018",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephanie Siow",
                "href": "/profile/Stephanie-Siow-8"
            },
            "answer_text": "Wireless Fidelity. Local area wireless technology it allows a electronic device to transfer data to connect to the internet using ISM Radio Bands WiFi is the trade of the WiFi Alliance and used as a brand name for products using technology",
            "date": "Answered January 14, 2019",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suresh Bhumenahalli",
                "href": "/profile/Suresh-Bhumenahalli"
            },
            "answer_text": "Wireless Fidelity is a brand, originally licensed by the Wi-Fi Alliance to describe the underlying technology of wireless local area networks (WLAN). ... Wireless access point (WAP) connects a group of wireless devices to an adjacent wired LAN. Technical Specification. It is based on the IEEE 802.11 specifications ",
            "date": "Answered June 7, 2017",
            "views": "84",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daaminh T Khan",
                    "user_href": "/profile/Daaminh-T-Khan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pradeep Kumar",
                "href": "/profile/Pradeep-Kumar-6292"
            },
            "answer_text": "This type of wireless internet technology has been developed which can provide connections faster than traditional WiFi 100 times faster. LiFi has proved capable of sending data at speeds of 1 GBps, which is almost 100 times higher than current Wi-Fi connection ",
            "date": "Answered February 22, 2018",
            "views": "599",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarthak Goel",
                "href": "/profile/Sarthak-Goel-14"
            },
            "answer_text": "Since you took up quora to know about it and not Google..  Here is your answer... It is something which when given outside your home to you..  It is water in a desert. ",
            "date": "Answered April 21, 2015",
            "views": "229",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Gaskill",
                    "user_href": "/profile/Alexander-Gaskill"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Anderson",
                "href": "/profile/Jeffrey-Anderson-29"
            },
            "answer_text": "The name Wi-Fi, commercially used at least as early as August 1999, was coined by the brand-consulting firm Interbrand. The Wi-Fi Alliance had hired Interbrand to create a name that was \"a little catchier than 'IEEE 802.11b Direct Sequence ",
            "date": "Answered December 26, 2018",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Indrani Bilup",
                "href": "/profile/Indrani-Bilup"
            },
            "answer_text": "Wi-Fi is an abbreviation for ‘Wireless Fidelity’. It is a mode of wireless Internet that can service multiple digital devices at once (like Airtel Wi-Fi broadband) and has a monthly plan with a certain amount of data, network speed, etc. Airtel Wi-Fi broadband offers unlimited broadband across most of its plans, and is ideal even for large offices. ",
            "date": "Answered June 23, 2019",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Toelle",
                    "user_href": "/profile/Michael-Toelle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Shaw",
                "href": "/profile/Aditya-Shaw-7"
            },
            "answer_text": "Wi-Fi - Wikipedia Sorry to just paste the link rather than writing an answer. ",
            "date": "Answered January 18, 2018",
            "views": "435",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SAURABH-RAJPUT-314"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashutosh Singh",
                "href": "/profile/Ashutosh-Singh-1712"
            },
            "answer_text": "Wireless Fidelity WiFi networks dont have any physical connections between the sender and receivers. By using radio frequency (RF) technology . RF technology - when a RF current is supplied to an antenna , an electromagnetic field is created which is able to propagate through space called Radio waves. for more read this What does WI-FI stand for ? ",
            "date": "Answered May 20, 2019",
            "views": "251",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Beyer",
                "href": "/profile/Ian-Beyer-1"
            },
            "answer_text": "Not sure what exactly you mean by “full form”. Wi-Fi is Wi-Fi. It’s a marketing trademark owned by the Wi-Fi Alliance, and refers to the technical standards defined in IEEE 802.11. ",
            "date": "Answered September 6, 2018",
            "views": "209",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rohan Khul",
                    "user_href": "/profile/Rohan-Khul-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sri Ram",
                "href": "/profile/Sri-Ram-1075"
            },
            "answer_text": "Wireless Fidelity\tWireless Technology\t(or) Wireless Internet for Frequent Interface. Some people are allergic to Wifi this is called as Electromagnetic hypersensitivity. This could cause the people a prolonged headache. ",
            "date": "Answered February 12, 2017",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Priyadharshini",
                "href": "/profile/ப்ரியதர்ஷினி-Priyadharshini"
            },
            "answer_text": "Well, WI-FI is the term coined by interband on request by IEEE( Institute of Electrical and Electronics engineers. WI-FI really doesn't have abbreviation which suits for it, there are so many abbreviations like wireless fidelity, wireless network fidelity, etc,. But there is no approved abbreviation for wi-fi. We commonly use wireless fidelity as an abbreviation for wi-fi. ",
            "date": "Answered April 19, 2018",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Robert",
                "href": "/profile/Daniel-Robert-49"
            },
            "answer_text": "The full form of WiFi is Wireless Fidelity . Also once known before as the Wireless Fidelity Alliance Inc in some publications and the IEEE's own website has stated any-who WiFi is a short name for Wireless Fidelity . ",
            "date": "Answered December 13, 2017",
            "views": "484",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maheshwara Rao",
                "href": "/profile/Maheshwara-Rao-1"
            },
            "answer_text": "Against the common misconception that WiFi is Wireless Fidelity, actually WiFi stands for IEEE 802.11. Pretty weird though. If you have doubts check it on 10 to the 100th power. :) Cheers!!!!! ",
            "date": "Answered September 27, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ananya Jha",
                "href": "/profile/Ananya-Jha-9"
            },
            "answer_text": "Wi-Fi stands for Wireless Fidelity. It normally refers to the systems that use 802.11 standards, developed by the IEEE ( Institute of Electrical and Electronics Engineers ) in 1997. In simpler terms, it is a technology that uses wireless networking of two or more devices. ",
            "date": "Answered August 26, 2016",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Soham",
                    "user_href": "/profile/Soham-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Graham Howe",
                "href": "/profile/Graham-Howe-3"
            },
            "answer_text": "What is the full form of WiFi? It appears that the full form of WiFi is…… “Wifi”!!!! The name was invented (as a kind of pun on HiFi) because it was a lot catchier than the original name of the invention: 'IEEE 802.11b Direct Sequence' ",
            "date": "Answered December 12, 2017",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zaawar Ejaz",
                "href": "/profile/Zaawar-Ejaz"
            },
            "answer_text": "The name was, however, never officially \"Wireless Fidelity\". Nevertheless, the Wi-Fi Alliance was also called the \"Wireless Fidelity Alliance Inc\" in some publications and the IEEE's own website has stated \"WiFi is a short name for Wireless Fidelity ",
            "date": "Answered May 1, 2018",
            "views": "352",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Palash Jain",
                "href": "/profile/Palash-Jain-55"
            },
            "answer_text": "Wireless fidelity. a facility allowing computers, smartphones, or other devices to connect to the Internet or communicate with one another wirelessly within a particular area. ",
            "date": "Answered April 19, 2015",
            "views": "773",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Kemper",
                "href": "/profile/Jeff-Kemper-2"
            },
            "answer_text": "WiFi is the name that Al Gore invented to call wireless access (that he also invented) to the Internet (that he also invented back when he was Vice President)…… ",
            "date": "Answered November 6, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vivek Banerjee",
                "href": "/profile/Vivek-Banerjee-9"
            },
            "answer_text": "It means Wireless Fidelity.. Fidelity means Faithfulness, which on the whole means that the data received is transmitted wholly to the equipment used by any person through WiFi without any losses.. ",
            "date": "Answered July 9, 2017",
            "views": "713",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Venkat Venky",
                    "user_href": "/profile/Venkat-Venky-203"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SAURABH-RAJPUT-314"
                }
            ]
        },
        {
            "author_info": {
                "name": "Obi Pritam",
                "href": "/profile/Obi-Pritam"
            },
            "answer_text": "Wi-Fi is not short for “wireless fidelity,” but Wi-Fi is simply a trademarked phrase. However, The tech community calls it “Wireless Fidelity”. https://last.agency/wi-fi-tutorial/ ",
            "date": "Answered August 22, 2019",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Piyush Mahajan",
                "href": "/profile/Piyush-Mahajan-89"
            },
            "answer_text": "Full form of WiFi is wireless fidelity. Wi-Fi is a wireless networking technology that uses radio waves to provide wireless high-speed Internet and network connections. ",
            "date": "Answered March 14, 2020",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shawn McCaslin",
                "href": "/profile/Shawn-McCaslin"
            },
            "answer_text": "“WiFi” is a technical term that describes the consumer perspective (brand/trademark) of the technology described in the IEEE 802.11 family of standards. Note that WiFi is a trademark owned by the WiFi Alliance. ",
            "date": "Answered July 20, 2018",
            "views": "340",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dan Leggs",
                    "user_href": "/profile/Dan-Leggs"
                },
                {
                    "user_id": "Gavin Ellis",
                    "user_href": "/profile/Gavin-Ellis-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael McKinney",
                "href": "/profile/Michael-McKinney-53"
            },
            "answer_text": "All WiFi routers have a maximum number of users that can connect at one time. When this number is reached, subsequent users will either receive a “no-connect” or a “full” message. ",
            "date": "Answered January 28, 2018",
            "views": "552",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zeiter Dachs",
                "href": "/profile/Zeiter-Dachs"
            },
            "answer_text": "It is an abbreviation for “Wireless Fidelity”. It means, connecting your computer to the internet, wirelessly (without using ethernet cables, or other types of wired connections) ",
            "date": "Answered July 6, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sagar Yadav",
                "href": "/profile/Sagar-Yadav-180"
            },
            "answer_text": "It is Wireless Fedility ",
            "date": "Answered April 22, 2018",
            "views": "473",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                },
                {
                    "user_id": "Ashu Gupta",
                    "user_href": "/profile/Ashu-Gupta-439"
                }
            ]
        },
        {
            "author_info": {
                "name": "Learn Better",
                "href": "/profile/Learn-Better-5"
            },
            "answer_text": "Wi-Fi is a registered trademark of non-profit organisation ‘Wi-Fi Alliance’. The term ‘Wi-Fi' is simply a trademark phrase for Institute of Electrical and Electronics Engineers (IEEE) 802.11 standards. ",
            "date": "Answered June 16, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rags",
                "href": "/profile/Rags-9"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered December 17, 2017",
            "views": "323",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ramon Ropain",
                    "user_href": "/profile/Ramon-Ropain"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simran Chauhan",
                "href": "/profile/Simran-Chauhan-26"
            },
            "answer_text": "wireless fidelity ",
            "date": "Answered December 13, 2017",
            "views": "806",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Menon",
                    "user_href": "/profile/Rohan-Menon-16"
                },
                {
                    "user_id": "Ravikanth Naik",
                    "user_href": "/profile/Ravikanth-Naik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mahendra Paudel",
                "href": "/profile/Mahendra-Paudel"
            },
            "answer_text": "wireless local area networking it send the data one person to other person and Wi-Fi is a wireless networking technology that allows computers and other devices to communicate over a wireless signal. ",
            "date": "Answered February 6, 2018",
            "views": "140",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Keval Ahalpara",
                "href": "/profile/Keval-Ahalpara"
            },
            "answer_text": "Full form of WiFi: wireless fidelity This name is licensed under WiFi. It is used for data exchange in electronic devices. ",
            "date": "Answered September 15, 2018",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Herraghty",
                    "user_href": "/profile/John-Herraghty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashok Kumar",
                "href": "/profile/Ashok-Kumar-6743"
            },
            "answer_text": "The full form of wifi is wireless fidelity.Wi-Fi is a local area wireless computer networking technology that allows electronic devices to connect to the network. ",
            "date": "Answered July 9, 2017",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anubhav Sangwan",
                "href": "/profile/Anubhav-Sangwan-1"
            },
            "answer_text": "WiFi stands for Wireless Fidelity. It is a facility that allows computers, smartphones, or other devices to connect to Internet or communicate over a wireless signal. ",
            "date": "Answered August 14, 2017",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheetal Krishna",
                "href": "/profile/Sheetal-Krishna-1"
            },
            "answer_text": "Heard of something called Google? ",
            "date": "Answered August 4, 2016",
            "views": "309",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shubham Tiwari",
                    "user_href": "/profile/Shubham-Tiwari-75"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bachan Nigam",
                "href": "/profile/Bachan-Nigam"
            },
            "answer_text": "There is no any full form of wifi.Who says the full form is wireless fidelity then he is wrong.It is just adopted by wifi alliance. And have no full form. ",
            "date": "Answered February 12, 2017",
            "views": "25",
            "upvotes": " Answer requested by Sīlēnt Kīllēr",
            "upvoters": [
                {
                    "user_id": "Akash Raj",
                    "user_href": "/profile/Akash-Raj-872"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neelesh Patel",
                "href": "/profile/Neelesh-Patel-101"
            },
            "answer_text": "The full form of WiFi is Wireless Fidelity.[1] WiFi Full Form and Meaning - WIFI Stands For - Full Form HUB Footnotes[1] WiFi Full Form and Meaning - WIFI Stands For - Full Form HUB",
            "date": "Answered March 6, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anaghraj Santhosh",
                "href": "/profile/Anaghraj-Santhosh"
            },
            "answer_text": "Wireless Fidelity , its a brand name which describes the technology of Wireless Local Area Network (WLAN). You can connect different wireless devices using Wifi adapters. ",
            "date": "Answered June 21, 2018",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Prunty",
                "href": "/profile/Chris-Prunty-3"
            },
            "answer_text": "That's it WiFi is a made up word some people this it means wireless fidelity but it doesn't it was created because it sounded cool their is no long version of it ",
            "date": "Answered December 13, 2017",
            "views": "139",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prabakaran Balaguru",
                "href": "/profile/Prabakaran-Balaguru"
            },
            "answer_text": "WiFi Full Form is Wireless Fidelity. It normally refers to systems that use 802.11 standards developed and released by IEEE or Institute of Electrical and Electronic Engineers in the year 1997. ",
            "date": "Answered December 24, 2016",
            "views": "309",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jake Blazsek",
                "href": "/profile/Jake-Blazsek"
            },
            "answer_text": "Wifi is a wireless signal to connect multiple device to the internet. The Wireless signal is put out by a router that's connected to an Internet Service Providers modem. ",
            "date": "Answered May 1, 2018",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tushar Kuwar",
                "href": "/profile/Tushar-Kuwar"
            },
            "answer_text": "wi-fi don't have any full form. It is an trademark of wi-fi Alliance. “Wireless Fidelity “ is common full form considered but, it's just an misconception ",
            "date": "Answered August 13, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sushmita Mishra",
                "href": "/profile/Sushmita-Mishra-56"
            },
            "answer_text": "\"Wi-Fi\" is short for \"wireless fidelity\" has spread to such an extent that even industry leaders have included the phrase wireless fidelity in a press release. ",
            "date": "Answered June 17, 2018",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Sims",
                "href": "/profile/Jim-Sims-3"
            },
            "answer_text": "Basically wireless networking (using certain standard and protocols) ",
            "date": "Answered March 9, 2018",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tanuja Shinde",
                    "user_href": "/profile/Tanuja-Shinde-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tamal Biswas",
                "href": "/profile/Tamal-Biswas-3"
            },
            "answer_text": "Wi Fi is a type of wireless signal which enables different kind of devices to connect to network.  ",
            "date": "Answered April 20, 2015",
            "views": "458",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hangkum Chang",
                    "user_href": "/profile/Hangkum-Chang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shruti Nair",
                "href": "/profile/Shruti-Nair-108"
            },
            "answer_text": "It has no full. It is actually a notation for IEEE standard 11x. But many publications and IEEE papers have published it has Wireless Fidelity which is not true ",
            "date": "Answered May 1, 2018",
            "views": "139",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Fall",
                "href": "/profile/Richard-Fall"
            },
            "answer_text": "Original question: What is the full from WiFi? Perhaps, if you’re not just a bot, you can rephrase the question to make some kind of sense? ",
            "date": "Answered January 27, 2018",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Himanshi Khatri",
                "href": "/profile/Himanshi-Khatri-12"
            },
            "answer_text": "Full form of Wi-fi is Wireless Internet for Frequent Interface. Wi-Fi can be termed as a technology that uses wireless networking of two or more devices. ",
            "date": "Answered August 26, 2016",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kumar Neelotpal",
                "href": "/profile/Kumar-Neelotpal-2"
            },
            "answer_text": "Question : “WIFI” is abbreviation for what?  Answer : “WIFI” is stylised as “Wi-Fi”. It stands for “Wireless Fidelity”. [1] Footnotes[1] Wi-Fi - Wikipedia",
            "date": "Answered April 22, 2018",
            "views": "777",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Debu Viral",
                "href": "/profile/Debu-Viral"
            },
            "answer_text": "It stands for Wireless Fidelity  ",
            "date": "Answered May 14, 2019",
            "views": "4",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Radhika N",
                    "user_href": "/profile/Radhika-N-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Faısal Alı Khan",
                "href": "/profile/Faısal-Alı-Khan"
            },
            "answer_text": "Simply, “Wireless Fidelity” ",
            "date": "Answered April 15, 2018",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amritesh Ojha",
                "href": "/profile/Amritesh-Ojha"
            },
            "answer_text": "Wireless Fidelity is the full form of WiFi. ",
            "date": "Answered December 19, 2016",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jason Lee",
                    "user_href": "/profile/Jason-Lee-1139"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mayur Ingale",
                "href": "/profile/Mayur-Ingale-16"
            },
            "answer_text": "The full form of WiFi is Wireless Fidelity ",
            "date": "Answered June 24, 2018",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Venkatesh Navali",
                    "user_href": "/profile/Venkatesh-Navali-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaspreet Kaur",
                "href": "/profile/Jaspreet-Kaur-269"
            },
            "answer_text": "Its Wireless Fidelity ",
            "date": "Answered February 22, 2018",
            "views": "419",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Disha Prateechee",
                    "user_href": "/profile/Disha-Prateechee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aakura Pyakura",
                "href": "/profile/Aakura-Pyakura"
            },
            "answer_text": "Wireless Fidelity. ",
            "date": "Answered April 8, 2018",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Shukla",
                "href": "/profile/Rahul-Shukla-99"
            },
            "answer_text": "Wireless Fidelity. ",
            "date": "Answered March 13, 2015",
            "views": "211",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Satwik Shekhar",
                    "user_href": "/profile/Satwik-Shekhar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gunjeet Kumar",
                "href": "/profile/Gunjeet-Kumar-1"
            },
            "answer_text": "wireless fedelity ",
            "date": "Answered September 1, 2016",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Utkarsh Bharti",
                    "user_href": "/profile/Utkarsh-Bharti-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vivek Singh",
                "href": "/profile/Vivek-Singh-2487"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered April 23, 2018",
            "views": "509",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Virender Prasad",
                    "user_href": "/profile/Virender-Prasad-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prakash Verma",
                "href": "/profile/Prakash-Verma-160"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered June 17, 2018",
            "views": "83",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tanu Dwivedi",
                    "user_href": "/profile/Tanu-Dwivedi-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranjit Kumar Mishra",
                "href": "/profile/Ranjit-Kumar-Mishra-7"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered June 17, 2018",
            "views": "70",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Mohan Saud",
                "href": "/profile/Mohan-Saud-1"
            },
            "answer_text": "himanchu ",
            "date": "Answered April 22, 2018",
            "views": "466",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ashish Singh",
                "href": "/profile/Ashish-Singh-4329"
            },
            "answer_text": "Wireless Fidelity. Wi-Fi is the trademark of the Wi-Fi alliance and is used as a brand name for products using the IEEE 802.11 standards. ",
            "date": "Answered April 16, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Schwertfeger",
                "href": "/profile/Eric-Schwertfeger"
            },
            "answer_text": "Wireless Fidelity, though that oddly enough isn’t the official name, just part of the slogan. Wi-Fi - Wikipedia ",
            "date": "Answered September 27, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dharmesh",
                "href": "/profile/Dharmesh-68"
            },
            "answer_text": "wifi is a tool that is a big tool to connect without cable and other nets. Wifi helps in securing net in many devices. If you want to know all the information: wifi kya hai ",
            "date": "Answered March 10, 2019",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chander Dutta",
                "href": "/profile/Chander-Dutta-2"
            },
            "answer_text": "WiFi: Wireless Fidelity, meaning you can access or connect to a network using radio waves, without needing to use wires. ",
            "date": "Answered December 18, 2017",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gale Stanley",
                "href": "/profile/Gale-Stanley-2"
            },
            "answer_text": "Could be Wireless Fidelity. It allows electronic devices to exchange data wirelessly over a computer network. ",
            "date": "Answered March 20, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andy Rooke",
                "href": "/profile/Andy-Rooke-1"
            },
            "answer_text": "Wireless Fidelity. Fidelity referring to the accuracy of the data, and wireless should be pretty obvious . . . ",
            "date": "Answered April 28, 2018",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nandan Pai",
                "href": "/profile/Nandan-Pai-5"
            },
            "answer_text": "It’s Wireless Fidelity. But using Quora to ask it is like trying to kill an ant using a nuclear bomb. ",
            "date": "Answered February 9, 2017",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bhavya Gautam",
                "href": "/profile/Bhavya-Gautam-5"
            },
            "answer_text": "Wireless Fidelity and i know you wrote this to trouble people because you could have easily searched on google for it ",
            "date": "Answered December 14, 2017",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sunny Singh",
                "href": "/profile/Sunny-Singh-651"
            },
            "answer_text": "It does not have any name we just call it wireless fidelity It uses radio wave for high speed internet ",
            "date": "Answered October 7, 2017",
            "views": "217",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eswar Katakam",
                "href": "/profile/Eswar-Katakam"
            },
            "answer_text": "Wireless Fidelity.The word Fidelity means faithful transmission.The term WiFi means Wireless Faithful communication ",
            "date": "Answered April 26, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maharshi Kushwaha",
                "href": "/profile/Maharshi-Kushwaha"
            },
            "answer_text": "WiFi full form: Full form of WiFi in hindi ",
            "date": "Answered May 6, 2018",
            "views": "12",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Sunil Kumar",
                "href": "/profile/Sunil-Kumar-12796"
            },
            "answer_text": "Wi-Fi Stand for Wireless Fidelity. वाई फाई का फुल फॉर्म वायरलेस फिडलिटी हैं। WIFI Full Form is Wireless Fidelity. ",
            "date": "Answered August 18, 2018",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vishu Bishu",
                "href": "/profile/Vishu-Bishu"
            },
            "answer_text": "Wireless Fidelity>>> AS UNDERSTOOD BY MOST PEOPLE. But in actual fact it, “DOES NOT MEAN ANYTHING” NOR IS IT AN ACRONYM FOR SOMETHING. ",
            "date": "Answered February 17, 2017",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Kumar",
                "href": "/profile/Abhishek-Kumar-4305"
            },
            "answer_text": "there is no any full form of WiFi.. WiFi is not an acroynm. It's just a word. ",
            "date": "Answered January 5, 2017",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ravikanth Naik",
                "href": "/profile/Ravikanth-Naik"
            },
            "answer_text": "Wireless Fidelity. Latest Upgrade in WiFi : 802.11ac check that once. Would be useful. Thanks ",
            "date": "Answered August 17, 2016",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashish Dhariwal",
                "href": "/profile/Ashish-Dhariwal-7"
            },
            "answer_text": "Wireless Fidelity for more information about short keys of computer explore :- Website ",
            "date": "Answered May 9, 2018",
            "views": "105",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubham Tayade",
                "href": "/profile/Shubham-Tayade-18"
            },
            "answer_text": "Wi-Fi is the wireless version of a wired Ethernet network. i.e. Wireless fidelity ",
            "date": "Answered April 2, 2018",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raunak Sethia",
                "href": "/profile/Raunak-Sethia"
            },
            "answer_text": "you could have just googled it.. nevertheless its “Wireless Fidelity “ ",
            "date": "Answered March 14, 2018",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ishwor Giri",
                "href": "/profile/Ishwor-Giri"
            },
            "answer_text": "It`s Wireless Fidelity refers to any of the IEEE (Institute of Electrical and Electronics Engineers) 802.11 wireless LAN standards ",
            "date": "Answered December 18, 2017",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Miral Shah",
                "href": "/profile/Miral-Shah-22"
            },
            "answer_text": "Full form of WiFi is “WIRELESS FIDELITY”, and the WiFi Alliance was also called the \"Wireless Fidelity Alliance Inc.\" ",
            "date": "Answered April 30, 2018",
            "views": "581",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roy",
                "href": "/profile/Roy-98"
            },
            "answer_text": "the full form of wifi is Wireless Internet for Frequent Interface ",
            "date": "Answered July 17, 2016",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Boro",
                "href": "/profile/Bill-Boro"
            },
            "answer_text": "Wireless Fidelity ( similarl to HiFi= high fidelity (music)) ",
            "date": "Answered March 7, 2018",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Faisal Hussain",
                "href": "/profile/Faisal-Hussain-3"
            },
            "answer_text": "Wirless Fidelity For further info look at:Wi-Fi - Wikipedia ",
            "date": "Answered April 24, 2018",
            "views": "359",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Teja",
                "href": "/profile/Teja-85"
            },
            "answer_text": "Many in social media use the term “wifi” to refer wife ! ",
            "date": "Answered June 12, 2017",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kumar Atul Jaiswal",
                "href": "/profile/Kumar-Atul-Jaiswal"
            },
            "answer_text": "I think the name of WiFi is Wireless Fidelity Alliance Inc. ",
            "date": "Answered April 24, 2018",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajay Kumar",
                "href": "/profile/Ajay-Kumar-8578"
            },
            "answer_text": "Wifi full form is Wireless Fidelity Thx for reading…. ",
            "date": "Answered December 12, 2017",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Satyajit Mishra",
                "href": "/profile/Satyajit-Mishra-56"
            },
            "answer_text": "WiFi doesn’t have any full form; it is a trademark name. ",
            "date": "Answered August 3, 2018",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mario Salmeron",
                "href": "/profile/Mario-Salmeron-1"
            },
            "answer_text": "Wireless Fidelity??? But for reals… what is the answer? ",
            "date": "Answered April 22, 2018",
            "views": "3",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Niranjan Aloor",
                "href": "/profile/Niranjan-Aloor"
            },
            "answer_text": "Wi-Fi stands for wireless fidelity  ",
            "date": "Answered September 5, 2018",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amit Sharma",
                "href": "/profile/Amit-Sharma-1940"
            },
            "answer_text": "The full form of WI-FI is wireless Fidelity ",
            "date": "Answered July 20, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohit Agarwal",
                "href": "/profile/Mohit-Agarwal-149"
            },
            "answer_text": "It's is an abbreviation for Wireless Fidelity. ",
            "date": "Answered March 15, 2015",
            "views": "222",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Donovan Enas",
                "href": "/profile/Donovan-Enas"
            },
            "answer_text": "WiFi stands for Wireless Fidility. Its more like a rhyming abbreviation. ",
            "date": "Answered May 1, 2018",
            "views": "347",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Siddhartha Pundit",
                "href": "/profile/Siddhartha-Pundit"
            },
            "answer_text": "WIRELESS FIDELITY is the full form of WI-FI ",
            "date": "Answered August 16, 2016",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajay Singh",
                "href": "/profile/Ajay-Singh-1022"
            },
            "answer_text": "Wireless-Fidelity is the full form of WIFI. ",
            "date": "Answered February 19, 2017",
            "views": "3",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kiran Kumar",
                "href": "/profile/Kiran-Kumar-3434"
            },
            "answer_text": "wireless fidelity is the full form of WIFI ",
            "date": "Answered January 14, 2017",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashish Anand",
                "href": "/profile/Ashish-Anand-201"
            },
            "answer_text": "Wireless Fidelity is the full form of WIFI. ",
            "date": "Answered January 3, 2017",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aditya T.S.",
                "href": "/profile/Aditya-T-S"
            },
            "answer_text": "Wireless Fidility is the full form of WIFI ",
            "date": "Answered February 25, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amar Dhure",
                "href": "/profile/Amar-Dhure-1"
            },
            "answer_text": "Wireless Fidelity (WiFi)  Read more ",
            "date": "Answered May 6, 2020",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fantãśťiç Ąşű",
                "href": "/profile/Fantãśťiç-Ąşű"
            },
            "answer_text": "WiFi is a short name for Wireless Fidelity ",
            "date": "Answered December 14, 2017",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Siddhartha Shankar",
                "href": "/profile/Siddhartha-Shankar-32"
            },
            "answer_text": "Wireless Fidelity is the full form of WiFi . ",
            "date": "Answered June 17, 2018",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bala Subramanyam",
                "href": "/profile/Bala-Subramanyam-51"
            },
            "answer_text": "Wireless Internet for Frequent Interface ",
            "date": "Answered July 30, 2016",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kunal Mukherjee",
                "href": "/profile/Kunal-Mukherjee-23"
            },
            "answer_text": "The formal name of Wi-Fi is IEEE 802.11. ",
            "date": "Answered December 25, 2016",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manik Malhotra",
                "href": "/profile/Manik-Malhotra-36"
            },
            "answer_text": "wireless fidelity is the full form of wifi .. ",
            "date": "Answered December 15, 2017",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aishwarya Indudhar",
                "href": "/profile/Aishwarya-Indudhar-1"
            },
            "answer_text": "U mean full form...... Its wireless fidelity ",
            "date": "Answered April 24, 2018",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vishal Bari",
                "href": "/profile/Vishal-Bari-36"
            },
            "answer_text": "Full form of Wifi is Wireless fidelity ",
            "date": "Answered July 31, 2020",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vikrant Singh",
                "href": "/profile/Vikrant-Singh-233"
            },
            "answer_text": "Full form of wifi is Wireless Fidelity ",
            "date": "Answered August 4, 2016",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akhil Sai",
                "href": "/profile/Akhil-Sai-95"
            },
            "answer_text": "Wireless Fidelity is the full form of WiFi ",
            "date": "Answered January 28, 2018",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Piyush Songara",
                "href": "/profile/Piyush-Songara-1"
            },
            "answer_text": "Wi-fi stands for Wireless Fidelity. ",
            "date": "Answered December 18, 2017",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gajendra Parmar",
                "href": "/profile/Gajendra-Parmar-15"
            },
            "answer_text": "Abbreviation of WiFi Wireless Fidelity . ",
            "date": "Answered May 5, 2018",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ojas Jain",
                "href": "/profile/Ojas-Jain-7"
            },
            "answer_text": "Wireless Internet for Frequent Interface ",
            "date": "Answered September 5, 2016",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nikhil Vispute",
                "href": "/profile/Nikhil-Vispute-2"
            },
            "answer_text": "Wireless Internet for Frequent Interface ",
            "date": "Answered July 30, 2016",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Geeky Major",
                "href": "/profile/Geeky-Major"
            },
            "answer_text": "Click for more information What is Wi-Fi? ",
            "date": "Answered March 6, 2019",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harshal Bhatt",
                "href": "/profile/Harshal-Bhatt-10"
            },
            "answer_text": "full form of WIFI is Wireless Fildity... ",
            "date": "Answered August 7, 2016",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Surya Das",
                "href": "/profile/Surya-Das-19"
            },
            "answer_text": "WIFI stands for “Wireless Fidelity”. ",
            "date": "Answered May 4, 2017",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shourya Vikram",
                "href": "/profile/Shourya-Vikram"
            },
            "answer_text": "For this you can Google it…why ask here.. ",
            "date": "Answered January 17, 2017",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rishwa Mathur",
                "href": "/profile/Rishwa-Mathur"
            },
            "answer_text": "WiFi stands for Wireless Fidelity ",
            "date": "Answered December 18, 2017",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gayatri Rout",
                "href": "/profile/Gayatri-Rout-2"
            },
            "answer_text": "Full of wifi is Wireless Fidelity. ",
            "date": "Answered July 16, 2016",
            "views": "36",
            "upvotes": " Answer requested by Sagar Sankhala"
        },
        {
            "author_info": {
                "name": "Vaibhav Sharma",
                "href": "/profile/Vaibhav-Sharma-1493"
            },
            "answer_text": "The full form of WIRELESS FIDELITY ",
            "date": "Answered December 17, 2017",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Koshish L.c",
                "href": "/profile/Koshish-L-c"
            },
            "answer_text": "It stands for wireless fidelity ",
            "date": "Answered December 13, 2017",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "MyluruVamshikanth Reddy",
                "href": "/profile/MyluruVamshikanth-Reddy"
            },
            "answer_text": "Wide interior firewall internet ",
            "date": "Answered June 3, 2017",
            "views": "4",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akshay Korgaonkar",
                "href": "/profile/Akshay-Korgaonkar-2"
            },
            "answer_text": "WiFi is wireless fidelity. ",
            "date": "Answered December 14, 2017",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deeksha Bhadoria",
                "href": "/profile/Deeksha-Bhadoria"
            },
            "answer_text": "Wireless fidelity alliance inc ",
            "date": "Answered April 21, 2018",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kishore Bhatnagar",
                "href": "/profile/Kishore-Bhatnagar"
            },
            "answer_text": "It stands for wireless fidelity ",
            "date": "Answered December 15, 2017",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rishav Sahoo",
                "href": "/profile/Rishav-Sahoo-2"
            },
            "answer_text": "Wi- wireless Fi- fidelity ",
            "date": "Answered May 4, 2017",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashwini Chillagatta",
                "href": "/profile/Ashwini-Chillagatta"
            },
            "answer_text": "What is the full form of wifi? ",
            "date": "Answered May 1, 2018",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sparsh kushwaha",
                "href": "/profile/Sparsh-kushwaha-2"
            },
            "answer_text": "WiFi=Wireless Fidelity ",
            "date": "Answered April 23, 2018",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sparsh Sachan",
                "href": "/profile/Sparsh-Sachan-4"
            },
            "answer_text": "Wireless Fidelity Alliance Inc ",
            "date": "Answered April 25, 2018",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kaushal Shah",
                "href": "/profile/Kaushal-Shah-50"
            },
            "answer_text": "Wireless free Internet! ",
            "date": "Answered April 21, 2015",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony Jaquais",
                "href": "/profile/Tony-Jaquais"
            },
            "answer_text": "Its Wireless Frequency ",
            "date": "Answered August 16, 2017",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maloy Ghosh",
                "href": "/profile/Maloy-Ghosh-7"
            },
            "answer_text": "What is full form of wifi ",
            "date": "Answered October 28, 2018",
            "views": "3",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manideep",
                "href": "/profile/Manideep-12"
            },
            "answer_text": "wifi-wireless fidelity ",
            "date": "Answered December 18, 2016",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maanasa Cherukupalli",
                "href": "/profile/Maanasa-Cherukupalli-2"
            },
            "answer_text": "Wireless fiedility ",
            "date": "Answered April 27, 2018",
            "views": "156",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeyaram Sethuraj",
                "href": "/profile/Jeyaram-Sethuraj"
            },
            "answer_text": "Wirless Fidelity ",
            "date": "Answered March 14, 2018",
            "views": "806",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Niyaz Mohmmad",
                "href": "/profile/Niyaz-Mohmmad"
            },
            "answer_text": "Without finolex wire. ",
            "date": "Answered February 11, 2017",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adeep Varghese",
                "href": "/profile/Adeep-Varghese"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered March 14, 2018",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajiya Farheen",
                "href": "/profile/Rajiya-Farheen"
            },
            "answer_text": "wireless fidibililiy ",
            "date": "Answered November 5, 2017",
            "views": "27",
            "upvotes": " Answer requested by Hiremath Hiremath"
        },
        {
            "author_info": {
                "name": "Shivam Bisht",
                "href": "/profile/शिवम-बिष्ट-Shivam-Bisht"
            },
            "answer_text": "Wireless Fidelity. ",
            "date": "Answered May 7, 2019",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bilby Yang",
                "href": "/profile/Bilby-Yang"
            },
            "answer_text": "“Wireless Fidelity” ",
            "date": "Answered December 17, 2017",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepak Yadav",
                "href": "/profile/Deepak-Yadav-410"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered June 8, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jamil Miya",
                "href": "/profile/Jamil-Miya"
            },
            "answer_text": "Wireless Frequently ",
            "date": "Answered April 25, 2018",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rishabh Bhardwaj",
                "href": "/profile/Rishabh-Bhardwaj-117"
            },
            "answer_text": "Wireless fidelity ",
            "date": "Answered April 25, 2018",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "DivyAnshu",
                "href": "/profile/DivyAnshu-26"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered December 12, 2017",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajit Nale",
                "href": "/profile/Ajit-Nale-2"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered April 14, 2018",
            "views": "287",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Srinivasaiah T.K",
                "href": "/profile/Srinivasaiah-T-K"
            },
            "answer_text": "wireless fidelity ",
            "date": "Answered April 2, 2018",
            "views": "139",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vijya Sapna Singh",
                "href": "/profile/Vijya-Sapna-Singh"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered July 25, 2018",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ankit Bannatwala",
                "href": "/profile/Ankit-Bannatwala"
            },
            "answer_text": "Wireless Fidelity. ",
            "date": "Answered July 15, 2016",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aayush Singh",
                "href": "/profile/Aayush-Singh-368"
            },
            "answer_text": "wireless fidelity ",
            "date": "Answered April 23, 2018",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akintayo Olusegun",
                "href": "/profile/Akintayo-Olusegun"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered April 9, 2018",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akash Yamavarapu",
                "href": "/profile/Akash-Yamavarapu"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered April 20, 2018",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raj Deo Pal",
                "href": "/profile/Raj-Deo-Pal"
            },
            "answer_text": "Wireless fidelity ",
            "date": "Answered April 3, 2018",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "NITESHKUMAR MEHTA",
                "href": "/profile/NITESHKUMAR-MEHTA"
            },
            "answer_text": "wireless fedility ",
            "date": "Answered December 13, 2017",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vardhman Travels",
                "href": "/profile/Vardhman-Travels"
            },
            "answer_text": "WIRELESS FIDILITY ",
            "date": "Answered January 31, 2017",
            "views": "4",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Annamol Alex",
                "href": "/profile/Annamol-Alex"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered September 3, 2016",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harish B.Harish",
                "href": "/profile/Harish-B-Harish-1"
            },
            "answer_text": "Wireless fedility ",
            "date": "Answered December 13, 2017",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Wilson",
                "href": "/profile/William-Wilson-70"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered December 14, 2017",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ankit Kumar",
                "href": "/profile/Ankit-Kumar-2574"
            },
            "answer_text": "wireless fidility ",
            "date": "Answered December 19, 2016",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edward Tocco",
                "href": "/profile/Edward-Tocco-1"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered April 20, 2018",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bhaskar De",
                "href": "/profile/Bhaskar-De-1"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered March 14, 2018",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dhruv Patel",
                "href": "/profile/Dhruv-Patel-562"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered July 16, 2016",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ankit Mishra",
                "href": "/profile/Ankit-Mishra-21"
            },
            "answer_text": "wireless fidelity ",
            "date": "Answered June 24, 2018",
            "views": "75",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bhagya Raju",
                "href": "/profile/Bhagya-Raju-16"
            },
            "answer_text": "WIRELESS FIDELITY ",
            "date": "Answered December 14, 2017",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Al Imran",
                "href": "/profile/Al-Imran-37"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered December 16, 2017",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashika Shetty",
                "href": "/profile/Ashika-Shetty-10"
            },
            "answer_text": "Wireless fiderlity ",
            "date": "Answered April 16, 2018",
            "views": "267",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manu Prakash",
                "href": "/profile/Manu-Prakash-27"
            },
            "answer_text": "Wireless fidility ",
            "date": "Answered July 14, 2017",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lumbanbatu Kornelius",
                "href": "/profile/Lumbanbatu-Kornelius"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered April 24, 2018",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajan Chaudhary",
                "href": "/profile/Rajan-Chaudhary-23"
            },
            "answer_text": "Wireless fidility. ",
            "date": "Answered December 20, 2016",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sai Krishna",
                "href": "/profile/Sai-Krishna-5415"
            },
            "answer_text": "wireless fidility ",
            "date": "Answered June 12, 2017",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Srini Vasan",
                "href": "/profile/Srini-Vasan-631"
            },
            "answer_text": "Wireless fidelity ",
            "date": "Answered April 29, 2018",
            "views": "375",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Keyur Ganvit",
                "href": "/profile/Keyur-Ganvit"
            },
            "answer_text": "WIRELESS FIREWALL ",
            "date": "Answered June 9, 2017",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bhargob Chetry",
                "href": "/profile/Bhargob-Chetry"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered August 7, 2018",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Addi Smith",
                "href": "/profile/Addi-Smith-3"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered April 22, 2018",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shivam Mittal",
                "href": "/profile/Shivam-Mittal-145"
            },
            "answer_text": "Wireless fidelity ",
            "date": "Answered December 13, 2017",
            "views": "362",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ravendra Singh",
                "href": "/profile/Ravendra-Singh-66"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered December 12, 2017",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ozana",
                "href": "/profile/Ozana-2"
            },
            "answer_text": "WIreless-FIdelity Wi-Fi ",
            "date": "Answered April 22, 2018",
            "views": "268",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kishore Mali",
                "href": "/profile/Kishore-Mali-1"
            },
            "answer_text": "Wireless Fidelity. ",
            "date": "Answered April 24, 2018",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prabhjot Singh",
                "href": "/profile/Prabhjot-Singh-624"
            },
            "answer_text": "Wireless fidelity ",
            "date": "Answered July 25, 2018",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raven Isuan",
                "href": "/profile/Raven-Isuan"
            },
            "answer_text": "Wireless fidelity ",
            "date": "Answered April 30, 2018",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nedu .C.",
                "href": "/profile/Nedu-C"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered April 25, 2018",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jackson Monteiro",
                "href": "/profile/Jackson-Monteiro-1"
            },
            "answer_text": "Winding and Finding ",
            "date": "Answered December 13, 2017",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sathyaraj",
                "href": "/profile/Sathyaraj-7"
            },
            "answer_text": "Wireless - Fidelity! ",
            "date": "Answered December 12, 2017",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Krishna Chaithanya Rapur",
                "href": "/profile/Krishna-Chaithanya-Rapur"
            },
            "answer_text": "Wireless Frequency ",
            "date": "Answered March 6, 2018",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jayanta Behera",
                "href": "/profile/Jayanta-Behera-10"
            },
            "answer_text": "Wireless fidelity ",
            "date": "Answered June 17, 2018",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nakirekanti Jahnavi",
                "href": "/profile/Nakirekanti-Jahnavi"
            },
            "answer_text": "Wireless Fidility ",
            "date": "Answered April 25, 2018",
            "views": "295",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vishwa Adhikari",
                "href": "/profile/Vishwa-Adhikari"
            },
            "answer_text": "Wireless Fidelity ",
            "date": "Answered April 25, 2018",
            "views": "338",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sohan Dhakal",
                "href": "/profile/Sohan-Dhakal"
            },
            "answer_text": "Wirelessfidility ",
            "date": "Answered December 13, 2017",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Azom Khan UZZOL",
                "href": "/profile/Azom-Khan-UZZOL"
            },
            "answer_text": "mobile data ",
            "date": "Answered December 13, 2017",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "3yrs-Lu",
                "href": "/profile/3yrs-Lu"
            },
            "answer_text": "emmm…the source of life ",
            "date": "Answered June 20, 2018",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prince Suraj",
                "href": "/profile/Prince-Suraj-5"
            },
            "answer_text": "Isha wifi ",
            "date": "Answered April 22, 2018",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ye Yint",
                "href": "/profile/Ye-Yint-74"
            },
            "answer_text": "SEPTEMBER ",
            "date": "Answered April 23, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Farhan Mir",
                "href": "/profile/Farhan-Mir-7"
            },
            "answer_text": "FRIENDS ",
            "date": "Answered December 17, 2017",
            "views": "3",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Moha Rafiq",
                "href": "/profile/Moha-Rafiq"
            },
            "answer_text": "Rafiqu ",
            "date": "Answered April 29, 2018",
            "views": "296",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jahid Ali",
                "href": "/profile/Jahid-Ali-25"
            },
            "answer_text": "Moh ",
            "date": "Answered April 22, 2018",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pradip Kumar Roy",
                "href": "/profile/Pradip-Kumar-Roy-7"
            },
            "answer_text": "Oh ",
            "date": "Answered December 20, 2018",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Krishnendu Sekhar Ghosh",
                "href": "/profile/Krishnendu-Sekhar-Ghosh"
            },
            "answer_text": "  ",
            "date": "Answered April 15, 2019",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nagina Devi",
                "href": "/profile/Nagina-Devi-3"
            },
            "answer_text": "2 ",
            "date": "Answered April 28, 2019",
            "views": "13",
            "upvotes": "0"
        }
    ]
}