{
    "title": "What is Avnet, and what products do they manufacture? - Quora",
    "tags": [
        "Working at Avnet",
        "Jobs and Careers at Avnet",
        "Avnet (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lawrence Roberts",
                "href": "/profile/Lawrence-Roberts-4"
            },
            "answer_text": "What a lovely question. I have worked for Avnet for the past 15 years so let me try and answer this for you. I am guessing you have been to www.avnet.com and are still none the wiser? You wouldn’t be the first and if you are new to this part of the industry it can take some time to get your head around it. So let me try and explain this as simply as I can in one post. View Avnet as a critical cog that lowers the cost of the IT supply chain. Ultimately it means it costs you and I less to get our hands on IT tech. How? Well there are two parts to the business. Avnet Electronics Marketing globally distributes the products produced by IT component manufactures (semiconductors, boards, sensors passives etc.) and supplies them to IT manufactures (also known as Original Equipment Manufacturers – OEMs). Avnet Technology Solutions globally distributes IT hardware, software and services produced by IT manufacturers/OEMs (IBM, Cisco, HP, etc) and supplies them to IT companies who provide IT solutions to their customers (known as the IT channel). To help grease the cogs, Avnet provides an incredible number of other services that customers can choose from. This may include financing options, training, marketing, technical engineers to install and maintain equipment, responsible recycling etc. The services cover everything from design through to disposal. So what do we manufacturer? As an IT distributor Avnet has mainly sold other peoples products. But we also have manufacturing capabilities. So, if you came to us and said you wanted some IT hardware to perform a specialist function, we could design and build it from scratch. You could take the hardware and sell it into vertical markets. We also have teams of software developers who have created software products to solve certain business challenges. One of the key areas where are skills are coming together is the internet of things (IoT). This is such an exciting area. We are helping companies deploy sensors into their existing products and then taking the data that is being generated, putting it into the cloud, combining it with other data sets and providing some incredible business intelligence. Long since gone are the days where IT distributors just simply supply other people’s products. Today Avnet’s experts provide cost effective ways to transform technology into solutions that provide a better business outcome. Our belief is that technology should make the world a better place to live, work and play. I hope this answers your question? ",
            "date": "Answered September 2, 2016",
            "views": "762",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Will Grubb",
                    "user_href": "/profile/Will-Grubb"
                },
                {
                    "user_id": "Uthara Nair",
                    "user_href": "/profile/Uthara-Nair-2"
                }
            ]
        }
    ]
}