{
    "title": "What are some examples of environmental impacts of development? - Quora",
    "tags": [
        "Environmental Engineering",
        "Environmental Science",
        "Environmentalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shynyan Kh",
                "href": "/profile/Shynyan-Kh"
            },
            "answer_text": "Development means growth, progress or a positive change as many would say the same. It is, in most cases, aimed at improving global economy and the way of our living.However, it can affect our natural and social way in many ways mainly due to improper use of resources for the development and improper growth practices. This is known as unsustainable development which will ultimately degrade environment and the human health. Those problems may include: Air pollution: Industrialization and urbanization releases enormous amount of toxic gases and particulate pollutants.Water pollution: Run-off from agricultural fields, industries, houses, contains toxic as well as nutrients making the water polluted and enabling the water to be rich in nutrients which results in eutrophication and hence depletion of dissolved oxygen.Soil pollution: Green revolution has greatly enabled the use of pesticides in many agricultural fields. These pesticides are broad spectrum and are highly persistence and could affect the soil microorganisms which would degrade the soil fertility.Global Warming and climate change: Release of GHGs from many developmental activites leads to high concentration of GHGs which enhances the greenhouse effect leading to warming of the earth and hence alters our climate pattern anthropogenically.Lost of forest cover: Developmental activities requires land. Therefore forest becomes the liable area thereby reducing the forest cover area.Lost in biodiversity: Forest are a home to many wildlife. Making fragments and deforestation could harm those wild animals thereby reducing biodiversity.There are other lots which could be put as a problem. However, at the end of the day, it all comes down to human health and many generations to come. If we develop things in a sustainable manner, it would put human at a greater chance for survival . ",
            "date": "Answered March 13, 2020",
            "views": "23",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sheryl Anne Haynes",
                    "user_href": "/profile/Sheryl-Anne-Haynes"
                },
                {
                    "user_id": "Tsepang Hlabathe",
                    "user_href": "/profile/Tsepang-Hlabathe"
                },
                {
                    "user_id": "Nkeletseng Mokhakala",
                    "user_href": "/profile/Nkeletseng-Mokhakala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cyril Deons Vithali",
                "href": "/profile/Cyril-Deons-Vithali"
            },
            "answer_text": "Development activities are carried out by converting natural land into a developed one. Industrialisation and urbanisation are all part of it.When we build dams,roads,buildings etc. we usually remove the trees and plants,the wetlands,and all that serve humanity with essential commodities for every day life. By removing forests we destroy the natural source of oxygen,water,fertile topsoil,living space of animals and plants or the living organisms.The web of life is interconnected and interdependent.If a chain loses one link it becomes weak.Likewise a link in web of life disappears the the whole living world is affected.The diverse forms of life whether it is plant or animal,one celled or many celled give strength to each other.We know only a fragment of the living organisms and their role in the kingdom of life.From our limited knowledge it is clear that what ever be the circumstances the degradation or destruction of natural environment affects the normal life of humans as well as other living things in general. Natural ecosystem services make our life possible.Any decrease in the ecosystem service negatively affects the whole natural system.Loss of trees,rivers,animals ,plants and the whole nature as such impacts our economy,our health,our well being and even longevity. Every developmental activity affects natural balance.Managing the use of natural resources,development,protecting or conserving nature enables people and communities to provide for their social,economic,and cultural well-being and for their health and safety by adopting methods that cause least imbalance or negative impact on nature. ",
            "date": "Answered March 4, 2018",
            "views": "176",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cabdicasiis Jaamac",
                    "user_href": "/profile/Cabdicasiis-Jaamac"
                },
                {
                    "user_id": "Tanvirul Islam",
                    "user_href": "/profile/Tanvirul-Islam-12"
                },
                {
                    "user_id": "Varsha Bihani",
                    "user_href": "/profile/Varsha-Bihani"
                },
                {
                    "user_id": "Senjuti Shuvo Ahmed",
                    "user_href": "/profile/Senjuti-Shuvo-Ahmed"
                },
                {
                    "user_id": "Saswata Saha",
                    "user_href": "/profile/Saswata-Saha-18"
                },
                {
                    "user_id": "Isaac Qacha",
                    "user_href": "/profile/Isaac-Qacha"
                },
                {
                    "user_id": "Kuldeepsinh Rana",
                    "user_href": "/profile/Kuldeepsinh-Rana-1"
                },
                {
                    "user_id": "Nankereza Jackline",
                    "user_href": "/profile/Nankereza-Jackline"
                },
                {
                    "user_id": "Max Chand",
                    "user_href": "/profile/Max-Chand"
                },
                {
                    "user_id": "Musa Naseri",
                    "user_href": "/profile/Musa-Naseri-1"
                }
            ]
        }
    ]
}