{
    "title": "What happens to a zombie underwater? Do they drown? - Quora",
    "tags": [
        "Drowning",
        "Underwater"
    ],
    "response": [
        {
            "author_info": {
                "name": "Van Davis",
                "href": "/profile/Van-Davis"
            },
            "answer_text": "Using the commonly accepted definition of “drowning” as suffering respiratory impairment, and eventually death, from inhalation of a liquid… Infected, but still-living beings (28 Days Later, The Crazies, etc.) would eventually drown; if they didn’t retain enough self preservation instinct to hold their breath, or surface for air. If you’re talking about “ghouls” or walking corpses (Night of the Living Dead, The Walking Dead, Return of the Living Dead, etc), they would not drown. They may or may not take in water, causing them to sink to the bottom; but there would be no asphyxiation. One would THINK that oxygen deprivation would cause damage to the brain, and disable the corpse as much as any bullet or blunt force trauma. But if we suppose that the brain has ALREADY been deprived of oxygen for an extended period, from a lack of breathing and a lack of functioning circulatory system, we are left with the assumption that some unknown force, other than oxygen, is fueling brain cell activity. ",
            "date": "Answered August 3, 2016",
            "views": "2",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yahya Mouman",
                    "user_href": "/profile/Yahya-Mouman-1"
                },
                {
                    "user_id": "Elton Zeqiri",
                    "user_href": "/profile/Elton-Zeqiri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendy Taylor",
                "href": "/profile/Wendy-Taylor-5"
            },
            "answer_text": "It depends a lot on whether the author/creator wants them to swim or not. In World War Z (Book), as I recall, the zombies could basically walk under water much like the skeleton pirates in the first Pirates of the Caribbean movie. In Fear the Walking Dead, our group survivors encounters zombies floating in the water. This makes sense to me, as dead bodies do float (as evidenced recently, unfortunately, by events in Rio). Those floating zombies are still dangerous and try to bite when humans are near; the water doesn’t seem to stop that. It seems to me that if there was to be “accuracy” here (and I put that in quotes because hey, we’re talking about zombies) the zombies should float since they are dead bodies. But if an author wants them to sink, I’m sure a plausible reason could be given for that. ",
            "date": "Answered August 1, 2016",
            "views": "779",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elton Zeqiri",
                    "user_href": "/profile/Elton-Zeqiri"
                },
                {
                    "user_id": "Tony Alcala",
                    "user_href": "/profile/Tony-Alcala"
                },
                {
                    "user_id": "Nick Paliocha",
                    "user_href": "/profile/Nick-Paliocha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cody Jackson",
                "href": "/profile/Cody-Jackson-14"
            },
            "answer_text": "Hi Joel, this will depend on what type of apocalypse we've gotten ourselves into. There are many types but as most likely, I'm sure The Walking Dead does a pretty good job at portraying the ideal and most realistic zombie. But to answer your question, there's a few scenes that I can remember from past episodes in TWD where the governor(a antagonist in a sense) tied a zombie to the bottom of a lake. He stood above on the surface watching it try and reach him. It was not drowning or choking because it was already dead, it purely wanted to eat him. Zombies are essentially dead beings unless of course like we discussed before we have a different type of apocalypse. ",
            "date": "Answered August 22, 2016",
            "views": "541",
            "upvotes": " Answer requested by Joel De La Cruz"
        },
        {
            "author_info": {
                "name": "Brett Kliethermes",
                "href": "/profile/Brett-Kliethermes"
            },
            "answer_text": "There is a t.v. series c as lied the walking dead it airs on AMC channel well there is this episode in season 4 I believe that has a character called the governor well this character chains a person he killed and hides the body underwater at the end of a dock and the person chained underwater died and became a zombie is very much alive chained underwater not to mention all the zombie heads the same character kept in aquariums in his hidden room which were still alive because the zombie brains were still intact... ",
            "date": "Answered August 11, 2018",
            "views": "248",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mingyun Seo-Bang",
                "href": "/profile/Mingyun-Seo-Bang"
            },
            "answer_text": "I guess it all depends on which zombie apocalypse you're reading or watching. I'll answer based on Robert Kirkman and his comics and series The Walking Dead and Fear the Walking Dead. Yes, they are just as dangerous in water as they are on land. The don't swim as the living would but they just float along until they encounter something living and then tear it to shreds. If you're interested in seeing how walkers function in water watch episodes 1-4 Season 2 of Fear of the Walking Dead. ",
            "date": "Answered August 1, 2016",
            "views": "425",
            "upvotes": " Answer requested by Joel De La Cruz"
        },
        {
            "author_info": {
                "name": "Riley Mitchell",
                "href": "/profile/Riley-Mitchell-2"
            },
            "answer_text": "Well, drowning is water cutting off air and filling lungs. Zombies don’t need to breath and are heavier then humans with less air and such inside. They would likely simply walk across the bottom of lakes and such. ",
            "date": "Answered August 4, 2016",
            "views": "206",
            "upvotes": " Answer requested by Joel De La Cruz"
        },
        {
            "author_info": {
                "name": "Robert Flowers",
                "href": "/profile/Robert-Flowers-21"
            },
            "answer_text": "In “Juan of the Dead”, (Zombie-Comedy Movie set in Cuba, 2011) there are scenes of underwater zombies. Also, in the Movie “The Rezort” (2015), the final scene implies zombies have floated or crawled underwater to the mainland. ",
            "date": "Answered January 14, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ryan Benshoof",
                "href": "/profile/Ryan-Benshoof"
            },
            "answer_text": "Technically they are dead so they don't need oxygen. Therefore, zombies will drown but still be “alive”, but they will just be lurking in the water, SO DONT GO SWIMMING IN A ZOMBIE APOCOLYPSE! ",
            "date": "Answered August 3, 2016",
            "views": "292",
            "upvotes": "0"
        }
    ]
}