{
    "title": "What's the likelihood of Apple discontinuing the iPod Touch? - Quora",
    "tags": [
        "Likelihood",
        "iPod Touch (Apple Product)",
        "iPod",
        "Apple (company)",
        "iPhones (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jesse Hollington",
                "href": "/profile/Jesse-Hollington"
            },
            "answer_text": "Personally I’d say it’s quite unlikely that Apple will completely discontinue the iPod touch in the near future. Where does the iPod touch fit in? The first thing that needs to be considered is what the purpose of the iPod touch is within Apple’s device ecosystem.  On a purely technical level, it’s an iPhone without the “phone” components. The iPod touch has no technical features that make it more desirable than an iPhone. It’s also been sporadically updated, with the current sixth-generation model coming out almost two years ago,[1] which basically added the A8 CPU from the iPhone 6, but excluded any other significant improvements that really brought it much beyond the iPhone 5 era. However, in my opinion that’s not really the point of the iPod touch. Except in a very few specific cases, no smartphone user would even consider an iPod touch. However, not everybody is a smartphone user — in short, there are still people who don’t want to have a cell phone plan to go with their iOS device. For those users, the iPod touch remains a “gateway drug” into the iOS ecosystem (and Apple Music as well). Parents who won’t buy their kids a cell phone will have less of an issue buying them an iPod touch. Employees who are “issued” a non-iOS device by their employer may see little reason to have a personal cell phone, but may want an iPod touch as their personal device. Then there are those folks who still prefer “feature phones” for various reasons who may still want an iOS device for specific apps or as a portable media player. However, if those users start with an iPod touch, get used to iOS, and buy a bunch of apps, what device do you think they’re going to be most likely to buy when they’re actually ready to get a smartphone? Couldn’t Apple just make a low-cost iPhone instead? Sure, Apple could definitely address this by producing a low-cost entry-level iPhone and let customers buy and use it as if it were an iPod touch (e.g. don’t put a cell phone plan on it). However, I don’t personally think that’s Apple’s style. If anything, it should have been the introduction of the iPhone SE last year that would have signalled this step for Apple, but despite this, a new sixth-generation iPod touch still arrived four months later. At the time, a 16GB iPhone SE sold for $399 USD, while a 16GB iPod touch came in at $199. In fact, you could get a 128GB iPod touch for the same price as the iPhone SE, the latter of which didn’t even have a 128GB model available at the time. Basically, the iPhone SE was released for those folks who still wanted a 4″ iPhone, and definitely not intended to cater to the iPod touch market.  It’s clear that this is exactly the way that Apple wants things. Firstly, it’s difficult to activate and use an iPhone without a SIM card. Apple has taken specific steps to make sure if you buy an iPhone, you’re using it as a phone, and not a glorified iPod touch. While Apple could obviously rearchitect iOS to change these rules, they’ve had almost ten years to do this, and have shown no desire to do so. By comparison, the iPod touch is a device that’s very clearly not a phone — there’s no “phone” app and no phone-like mic and speaker arrangement. Secondly, there’s the whole marketing game with cellular carriers. No cellular provider wants Apple giving away phones at really low prices…. That’s why the least expensive iPhone you can get right now off-contract is $399 USD (now a 32GB iPhone SE) — almost twice the price of an equivalent iPod touch. The point is that carriers want iPhones to be “marked up” by Apple so that they can then turn around and give their customers “great deals” in response to signing a two-year contract. This game between manufacturers and carriers has been played since long before Apple even entered the cell phone market, and Apple tried to create its own business model with AT&T back in 2007, but that failed and by the time the iPhone 3G came out a year later, Apple was in the same pricing game as every other cell phone manufacturer. Then there’s the matter of perception. Apple markets the iPhone as a phone. They want it to be used as a phone. They don’t even like the idea of people not having a data plan, since that limits what the device can do, and how Apple wants people to be seen using it. A bunch of people running around with iPhones that are being used as glorified iPod touch devices doesn’t serve Apple’s marketing machine, since that’s not what Apple designed the device for, and we all know how much Apple is about marketing and image. Lastly, if Apple sells you a cheap iPhone, then when you want to “upgrade” to having a smartphone, you’re more likely to just pop in a SIM card, activate a data plan on it, and call that good enough. If you’ve got an iPod touch, you’ll be hooked into the iOS ecosystem, but when it comes time for a smartphone, well, you’re going to buy an iPhone, and chances are you’ll be more likely to buy a better, more current model. In short, the iPod touch continues to fill a very important product niche for Apple, creating a distinct device that Apple can sell as an iOS “starter device” for those who don’t want or can’t have a smartphone, and that Apple can price how it pleases without having to worry about the carriers getting bent out of shape. How frequently Apple will update it is another story, of course, but my gut feeling is that much like with the recent 2017 iPad, Apple will continue to keep a model on the market that’s “good enough” for that target market — Apple wants to make sure that you want an iPhone, but if that’s absolutely out of the question, they’d still rather you settle for an iPod touch and at least be part of the iOS family. Footnotes[1] Reviews: Apple iPod touch (Sixth-Generation)",
            "date": "Answered April 16, 2017",
            "views": "95",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                },
                {
                    "user_id": "Erik Fair",
                    "user_href": "/profile/Erik-Fair"
                },
                {
                    "user_id": "Arijit Saha",
                    "user_href": "/profile/Arijit-Saha-9"
                },
                {
                    "user_id": "Brad Zyler",
                    "user_href": "/profile/Brad-Zyler"
                },
                {
                    "user_id": "Taiwo Alabi",
                    "user_href": "/profile/Taiwo-Alabi"
                },
                {
                    "user_id": "Mike Marquardt",
                    "user_href": "/profile/Mike-Marquardt-1"
                },
                {
                    "user_id": "Zach Herras",
                    "user_href": "/profile/Zach-Herras"
                },
                {
                    "user_id": "Arun Prakash",
                    "user_href": "/profile/Arun-Prakash-28"
                },
                {
                    "user_id": "Tegar Yudha",
                    "user_href": "/profile/Tegar-Yudha"
                },
                {
                    "user_id": "Riyadh Ali",
                    "user_href": "/profile/Riyadh-Ali-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Maynard",
                "href": "/profile/Jason-Maynard-11"
            },
            "answer_text": "The iPod touch line has experienced poor sales, and estimates suggest that the sales are getting worse every year. This is potentially evident by the lack of regular updates by Apple. And also lack of advertising. Remember, iPods used to have impeccable advertising campaigns, and now you don’t hear a peep about them. In recent years, as iPhone prices have gone up, Apple wants to focus more on their iPhones, because the profit margins are much higher. Therefore, economically speaking, Apple has more interest in their iPhones rather than iPods due to greater profits and sales. There is still a market for iPods though, which is why I think Apple still sells them. Many parents don’t want their young children having iPhones, and because it has a smaller screen and price tag, it serves as a great “starter” electronic for young kids. If a new iPhone costs $750 but a new iPod costs $200, parents may feel more inclined to buy a cheaper iPod for their children rather than an expensive phone. This could also be the reason for Apple’s lack of updates to the iPod line. Most young children don’t necessarily care about new features. Nor do parents if it’s a device for their kids. Will Apple discontinue the iPod touch? It’s a possibility. With few upgrades, slacking sales, and zero marketing it may not be economical for Apple to keep offering them. Should they discontinue it? In my opinion, no. Children are an excellent market to appeal to, and iPods appeal to both parents and children. Children because it’s a cool, new tech toy that can keep them busy for ages. Parents because they’re cheap, their kids can’t use data or text fandoms, and it keeps their kids busy for ages. In the end, I suppose only time will tell what Apple will decide what to do with the iPod touch. ",
            "date": "Answered October 10, 2018",
            "views": "447",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aundreana Phiffer",
                    "user_href": "/profile/Aundreana-Phiffer"
                },
                {
                    "user_id": "Up Sude",
                    "user_href": "/profile/Up-Sude"
                }
            ]
        }
    ]
}