{
    "title": "What is the history of technology? - Quora",
    "tags": [
        "History of Technology",
        "World History",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Peracchio",
                "href": "/profile/Tom-Peracchio"
            },
            "answer_text": "A2A What is the history of technology? The question is so broad, the best I can do to answer it is to give you some context to my personal perspective. The implementation of technology has been my profession for more than four decades. Building websites telling the stories about the history of technology has been my passion for more than two decades. As a passionate geek who loves technology, who is also a cranky cynic that hates buzzwords, as I sort through the various stages of the evolution of technology in my writing, I am trying to give context to the jargon. In my stories of the history of technology I start with looking at various machines powered by animals. In the very basic definition, beasts of burden refers to animals used by humans to perform various tasks, such as pack animals used to carry heavy loads. In the context of studying the evolution of humans and machines, I look at working animals such as horses that were domesticated to power the machines of humans. In the next stage of technology I look at the evolution from living horse power to machines with the invention of steam powered machines. One of my favorite times in the history of technology I call “the age of railroads and robber barons,” roughly the period academic scholars call the Second Industrial Revolution. George Westinghouse, one of great American inventors of the era, started out inventing various products for the railroad industry and moved on to defeating Thomas Edison in the War of Currents. As you can see by my history here at Quora, that's where I have spent a lot of time answering question. My next major wave of ideas is the birth of Silicon Valley, the semiconductor stories of the 1950s and 1960s, the internet pioneers of the 1960s and 1970s. I already have much of the content edited, just doing some final editing to spin it to the web. That's a quick brain dump of my ideas as I sort through the history of technology. One of the few television shows I watch on a regular basis is \"Mysteries at the Museum\" on the Travel Channel, and yes, I do visit as many museums as I can every year on my annual road trips. Studying the history of technology is my passion. The topic is so vast, to summarize the history of technology in a few hundred words for this question does not do the topic justice. ",
            "date": "Answered February 25, 2018",
            "views": "401",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Clayton Jay Hardy",
                    "user_href": "/profile/Clayton-Jay-Hardy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohamed Ajmal Haarun Thariq",
                "href": "/profile/Mohamed-Ajmal-Haarun-Thariq"
            },
            "answer_text": "Its way simple to understand. The word Technology doesn’t mean only to the things which are not visible to our naked eyes ( Radio waves and computer programs, etc.,) . The history of technology started right from the first human being evolved on this planet. When they learned to drink water (which was the foremost life source) using a bowl or deep shaped stone, instead of drinking by bending over the water body to drink directly using their lips. And the evolution of Technology started right from the moment when they made bags out of animal skins to store water and food and carry then wherever they moved. THE POINT TO BE NOTED HERE IS THAT, TECHNOLOGY IS THE COMPREHENSIVE DEVELOPMENT OF HUMAN INTELLIGENCE TO LESSEN THEIR BURDEN AND GET THE WORK DONE MORE EFFICIENTLY i.e., WORKING SMART INSTEAD OF WORKING HARD. So, the history of technology started right from the first humans itself. ",
            "date": "Answered October 10, 2017",
            "views": "423",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vaishali Bisht",
                    "user_href": "/profile/Vaishali-Bisht-2"
                },
                {
                    "user_id": "Somesh Ranjan",
                    "user_href": "/profile/Somesh-Ranjan-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neelam Chandel",
                "href": "/profile/Neelam-Chandel-20"
            },
            "answer_text": " Martin \"Marty\" Cooper (born December 26, 1928) is an American engineer. He is a pioneer in the wireless communications industry, especially in radio spectrum management, with eleven patents in the field. While at Motorola in the 1970s, Cooper invented the first handheld cellular mobile phone (distinct from the car phone) in 1973 and led the team that developed it and brought it to market in 1983. He is considered the \"father of the (handheld) cell phone\" and is also cited as the first person in history to make a handheld cellular phone call in public. Cooper is co-founder of numerous communications companies with his wife and business partner Arlene Harris; He is co-founder and current Chairman of Dyna LLC, in Del Mar, California. Cooper also sits on committees supporting the U.S. Federal Communications Commission and the United States Department of Commerce. ",
            "date": "Answered September 29, 2020",
            "views": "96",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Panks Chandel",
                    "user_href": "/profile/Panks-Chandel"
                },
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                },
                {
                    "user_id": "Siddharth Choubey",
                    "user_href": "/profile/Siddharth-Choubey-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Young Pedersen",
                "href": "/profile/Alex-Young-Pedersen"
            },
            "answer_text": "History of technology concerns technology very broadly. It tries to make sense if technology in a specific historic context. As a academic discipline it tries to analyze and understand different aspects of technology. Both its technical aspects and many other factors relating to technology such as human, social, cultural, economic, scientific, political and philosophical factors. ",
            "date": "Updated August 3, 2018",
            "views": "245",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marvin Dookharan",
                "href": "/profile/Marvin-Dookharan"
            },
            "answer_text": "Technology unneeded for survival began with a religion/form of government/organization/culture creating an artificial need for unneeded technology. In the Middle Paleolithic times there was really no religion or form of government that existed so humans just went by survival instincts like other animals. They had some survival tools and that’s it. Prior to fire making humans were pretty similar to gorillas and chimpanzees. Fire-making and other things probably also came out because of a religion/tradition/organization/culture since our natural survival instincts do not have knowledge of it automatically like how we automatically understand oral language or avoid physical pain…you don’t actually need a fire for survival it’s pretty easy to survive without it. In the Neolithic times humans were more religious and started building temples and religious artifacts that’s really when technology unneeded for survival began. Humans because of religion started studying things like astronomy and philosophy which was really just pseudoscience and speculations. Around the Middle Ages the scientific method came out but it still wasn’t used that much. The scientific method is really a form of logical empiricism that came from studying philosophy used to determine if something is true or false. Then around the 17th Century Newtonian physics and higher mathematics came out which changed engineering dramatically. Newtonian physics is actually an advanced astronomical model. Calculus was invented to solve astronomical problems. The real reason why people were studying astronomy was because of religion (for astrology, clocks). Now in modern times it seems like all modern day technology unneeded for survival came out because of capitalism (form of government), or government-sponsored projects for national defense and other purposes (form of government), or religion (temples, clocks, architecture). The life expectancy if you control for the infant mortality rate is still nearly the same as Paleolithic times. Humans are not naturally inquisitive as the media portrays they naturally go by survival instincts and only become inquisitive if a religion/form of government/organization/culture creates an artificial need to be. If humans are naturally inquisitive like many seem to think then when in history did humans ever come up with technology unneeded for survival without a religion/tradition/culture/organization/form of government creating an artificial need for unneeded technology? The answer is never, it never happened before. Conclusion: If there is no religion/form of government/organization/culture creating an artificial need for unneeded technology then technology unneeded for survival won’t exist…humans would automatically become the same as Paleolithic humans. Humans are still the same as other animals going by survival instincts naturally but most humans in developed countries have been heavily conditioned out of their natural survival instincts through punishment/reward and other methods of conditioning at early ages. By age 5 humans reach 90% of their adult brain size so a lot of human behavior becomes fixed then. We can also condition other non-human animals to perform tricks when conditioned at early ages just the same but they won’t naturally act that way…the same with humans. The natural human with no religion/form of government/organization/culture conditioning them to act differently is the Paleolithic human. That’s how humans acted for most of history. ",
            "date": "Updated July 3, 2019",
            "views": "699",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yashkirti Dipankar",
                "href": "/profile/Yashkirti-Dipankar"
            },
            "answer_text": "Information technology has been around for a long, long time. Basically as long as people have been around, information technology has been around because there were always ways of communicating through technology available at that point in time. There are 4 main ages that divide up the history of information technology. Only the latest age (electronic) and some of the electromechanical age really affects us today, but it is important to learn about how we got to the point we are at with technology today. ",
            "date": "Answered November 12, 2016",
            "views": "2",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Franc Gupta",
                    "user_href": "/profile/Franc-Gupta"
                },
                {
                    "user_id": "Kitty Cruz",
                    "user_href": "/profile/Kitty-Cruz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Myers",
                "href": "/profile/Mike-Myers-63"
            },
            "answer_text": "A very, very long time ago. Someone needed to move things. So they carried things. This was tedious, and time consuming, so they thought about how they could improve this. Boats They discovered that wood floats, and that it could carry them on the water, as well as things they wanted to move. The Wheel Someone said, “Hey, that’s cool and all, but I need to move things on land.” They noticed that boulders and rocks rolled down hill, and with a little creative engineering they created the wheel. They attached it chariots, and platforms that became wagons. Airplanes Ok, so what if a place was really far away, and a wagon and boat would take too long? Well, the Wright Brothers had a great idea. So, there you go. Necessity is the mother of invention, and technology is one of those catalysts of invention. ",
            "date": "Answered June 3, 2018",
            "views": "291",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Preethi Sunder",
                    "user_href": "/profile/Preethi-Sunder"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Jones",
                "href": "/profile/Allen-Jones-174"
            },
            "answer_text": "That’s probably using a broken tree branch as a spear so several hundred thousand years ago and likely in many places independently. A knife shaped out of sharp jagged pieces of flint with something wrapped around the gripping surface and set in a chunk of bone or wood is probably the first piece of “technology”. That goes back to fire, cooking, and the change in brains and systems with cooked proteins so pre-modern humans. ",
            "date": "Answered February 14, 2019",
            "views": "174",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aldo Fadhila",
                "href": "/profile/Aldo-Fadhila"
            },
            "answer_text": "My professor always says : “ A Technology is everything that we create to help human, making our lives easier” For example in the stone age, those people created fire, arrows,a spear ,etc. That fire ,spear and arrows were the best “technolgy” at that time, it helps them to survive keep them warm. So the conclusion is, technology begin when humans invented stuff to make their lives better ",
            "date": "Answered November 11, 2016",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gibran Erlangga",
                    "user_href": "/profile/Gibran-Erlangga"
                },
                {
                    "user_id": "Erik Rodriguez",
                    "user_href": "/profile/Erik-Rodriguez-41"
                },
                {
                    "user_id": "Kitty Cruz",
                    "user_href": "/profile/Kitty-Cruz"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Betty-B-Daaf"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anders Wahlberg",
                "href": "/profile/Anders-Wahlberg"
            },
            "answer_text": "There was this chap called, let’s say, Ug. He discovered a lump of stone tat was perfectly round and shared like a disc with a hole in the middle. He didn’t discover technology. Another chap called Nump discovered another piece of rock very much like Ugs. He didn’t discover technology. Then along came a chap called Bif and he looked at both the rocks and then found a lump of wood and put it through the holes in both rocks. Then they realised that they’d made wheels for a cart. Sadly it tok another 5000 years before someone invented a cart. Now, That’s technology. ",
            "date": "Answered June 2, 2018",
            "views": "893",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nedal Zahran",
                "href": "/profile/Nedal-Zahran"
            },
            "answer_text": "Technology is the pool of human know-how from the application of fire to the Apple watch. You cannot discuss a starting point in any part of this history because it is a cumulative process. You cannot discuss TV without cameras, cameras without talking lenses, or lenses without discussing glass. ",
            "date": "Answered July 2, 2015",
            "views": "291",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Barry",
                "href": "/profile/Kevin-Barry-39"
            },
            "answer_text": "The first person who broke a piece of rock to get a sharp edge to make primitive knife or an axe. He created the first tool which multiplied what a human could do using only his hands (without the benefit of a tool). Of course the progress was very slow at the beginning. But human ingenuity has been present from the beginning and the outcome really accelerated with the invention of the steam engine; and of machines driven by the steam engine; with the invention of AC electricity and the electric motor; with the internal combustion engine; with the concept and reality of the production line; with the invention of motororised flight; with analogue electronics;with the jet engine; and finally with digital electronics and the Internet. The rate of acceleration of invention has increased exponentially ",
            "date": "Answered May 31, 2018",
            "views": "640",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "When the first primitive human knocked a couple of pieces of rock together and off came a flake that was sharp enough to cut his finger… Or to skin a mammoth or cut it up into useable bits. Likely other items before that… Like learning to control fire or finding that the end of a stick left in the fire became not only pointy… But hard. Technology is merely making “artifacts”….. ",
            "date": "Answered October 27, 2020",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Frank Vanris",
                    "user_href": "/profile/Frank-Vanris"
                }
            ]
        },
        {
            "author_info": {
                "name": "Antonio García González",
                "href": "/profile/Antonio-García-González-2"
            },
            "answer_text": "Way before humans existed. Chimps use stones to crack nuts, little sticks to fish ants and thicker sharp sticks to stab small mammals out of a hole in a tree. Just a few steps from using a stone to smash someone's skull, sharpen a wooden stick or build something else. ",
            "date": "Answered October 27, 2020",
            "views": "448",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rosa Banuelos",
                    "user_href": "/profile/Rosa-Banuelos-6"
                },
                {
                    "user_id": "Frank Vanris",
                    "user_href": "/profile/Frank-Vanris"
                },
                {
                    "user_id": "Welwyn Dsouza",
                    "user_href": "/profile/Welwyn-Dsouza-1"
                },
                {
                    "user_id": "Bob Wheeler",
                    "user_href": "/profile/Bob-Wheeler-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moaz Qudeer",
                "href": "/profile/Moaz-Qudeer-1"
            },
            "answer_text": "History of technology means the development completed in time of systematic techniques for making and doing things. The history of technology is the history of discovery of tools and techniques and is parallel to the other sides of history. The term technology came from the Greek word “techne” and it means “art and craft” Read Detailed Article About “History of Technology[1]” on the given link. Footnotes[1] History of Technology and Revolution of this History",
            "date": "Answered January 6, 2019",
            "views": "103",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Gruszynski",
                "href": "/profile/Jeff-Gruszynski"
            },
            "answer_text": "The history of technology is as complex as the \"history of war\" or \"history of Europe\".  You aren't going to get a meaningful answer here.  A starting point is Wikipedia: History of technology.  Beyond that you have to be more specific about what part is of interest. ",
            "date": "Answered December 13, 2015",
            "views": "303",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tom Peracchio",
                    "user_href": "/profile/Tom-Peracchio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Håkan Olofsson",
                "href": "/profile/Håkan-Olofsson-1"
            },
            "answer_text": "1829, Jacob Bigelow. ",
            "date": "Answered May 31, 2018",
            "views": "453",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Toni Frank",
                    "user_href": "/profile/Toni-Frank-2"
                },
                {
                    "user_id": "Frank Sommer",
                    "user_href": "/profile/Frank-Sommer-1"
                },
                {
                    "user_id": "Catharine Bertrand",
                    "user_href": "/profile/Catharine-Bertrand"
                },
                {
                    "user_id": "Gloria Garcia",
                    "user_href": "/profile/Gloria-Garcia-60"
                },
                {
                    "user_id": "Robin Carter",
                    "user_href": "/profile/Robin-Carter-35"
                },
                {
                    "user_id": "Emily Williams",
                    "user_href": "/profile/Emily-Williams-300"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony McKeirnan",
                "href": "/profile/Anthony-McKeirnan-1"
            },
            "answer_text": "Technology wasn’t discovered… it just happened. People wanted the best of something and would keep on improving or inventing new ways to do things.For example, the bronze tipped apear was considered technologically superior to a stone spear. ",
            "date": "Answered November 30, 2017",
            "views": "437",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gísli Magnússon",
                    "user_href": "/profile/Gísli-Magnússon-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Wessal",
                "href": "/profile/Sharon-Wessal"
            },
            "answer_text": "Well…nobody knows the person’s name but they lived about 2.5 million years ago. They made stone scrapers to skin animals and such. Genious of his time. Technology doesn’t have to be machines or anything complex, it’s just an invention to make life a little easier. Afterall, the first machine ever was either a hand axe or hoe. ",
            "date": "Answered November 30, 2017",
            "views": "553",
            "upvotes": " Answer requested by Boaz Äz",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Leavy",
                "href": "/profile/John-Leavy-4"
            },
            "answer_text": "According to David Derbyshire, writing for MailOnline, September 15, 2009, Stone Age man, in order the traverse the country, used a similar system to satellite navigation. It is postulated that all those stone circles, hill forts and other land marks such as Stonehenge, “...allowed travelers to trek hundreds of miles with pinpoint accuracy.” So there you have it. The first to make technology was this guy here:  STONE AGE MAN ",
            "date": "Answered September 29, 2020",
            "views": "177",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Diane Thompson",
                "href": "/profile/Diane-Thompson-36"
            },
            "answer_text": "The definition of technology is \"tools and skills people use to meet their needs.\" The first caveman to pick up a stick or a stone discovered technology. ",
            "date": "Answered June 1, 2018",
            "views": "205",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Myers",
                "href": "/profile/Bob-Myers-5"
            },
            "answer_text": "Last time big light was in sky, Og find big flat rock. Og pick rock up. Rock feel really good, like it make Og more strong! Og swing rock and hit one of the good-tasting animals in the head. Him no move after that, Og and family have big feast! Tomorrow Og take rock, find that jerk from next cave who say Og have big nose… ",
            "date": "Answered November 14, 2016",
            "views": "898",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Silberberg",
                "href": "/profile/Steve-Silberberg"
            },
            "answer_text": "Ug the first man ",
            "date": "Answered February 14, 2019",
            "views": "32",
            "upvotes": "0"
        }
    ]
}