{
    "title": "What has been invented in the last 30 years? - Quora",
    "tags": [
        "Innovation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aarav Jain",
                "href": "/profile/Aarav-Jain-132"
            },
            "answer_text": "I think the best invention in last 30 years are Mobil Phones  Cell phones are the perfect way to stay connected with others and provide the user with a sense of security. In the event of emergency, having a cell phone can allow help to reach you quickly and could possibly save lives. However, the importance of cell phones goes way beyond personal safety. Modern cell phones are capable of internet access, sending and receiving photos and files, and some cell phones are equipped with GPS technology, allowing for use in most locations around the world and allowing the cell phone to be found or the user located in the event of loss or emergency.  Cell phone reception has become reliable and of high quality due to advances in wireless technology. Wireless service providers offer excellent packages and promotions for cell phone users. Finding a dependable service provider is no longer an issue for cell phone users. The expansion of the wireless service provider industry gives cell phone users a choice and the increased competition has caused a drop in prices of wireless cell phone service. The importance of cell phones goes way beyond the ability to make or receive phone calls. Cell phone users can instantly send data to the home or office, check for important email, use their cell phone as a PDA or calendar, and store photos which can be easily transferred to a PC or laptop computer. Pic Source : Google. ",
            "date": "Answered July 5, 2020",
            "views": "37",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Matthew Akisan",
                "href": "/profile/Matthew-Akisan"
            },
            "answer_text": "I got this list from Wharton University of Pennsylvania of the top 30 innovations of the last 30 years: Internet, broadband, WWW (browser and html)PC/laptop computersMobile phonesE-mailDNA testing and sequencing/Human genome mappingMagnetic Resonance Imaging (MRI)MicroprocessorsFiber opticsOffice software (spreadsheets, word processors)Non-invasive laser/robotic surgery (laparoscopy)Open source software and services (e.g., Linux, Wikipedia)Light emitting diodesLiquid crystal display (LCD)GPS systemsOnline shopping/ecommerce/auctions (e.g., eBay)Media file compression (jpeg, mpeg, mp3)MicrofinancePhotovoltaic Solar EnergyLarge scale wind turbinesSocial networking via the InternetGraphic user interface (GUI)Digital photography/videographyRFID and applications (e.g., EZ Pass)Genetically modified plantsBio fuelsBar codes and scannersATMsStentsSRAM flash memoryAnti retroviral treatment for AIDS",
            "date": "Answered July 6, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "S Chandra",
                "href": "/profile/S-Chandra-2"
            },
            "answer_text": "Please Google it to find the details, Do you know how to do a Google search or not ? ",
            "date": "Answered July 5, 2020",
            "views": "9",
            "upvotes": "0"
        }
    ]
}