{
    "title": "What is the future of smartphones? - Quora",
    "tags": [
        "Future of Technology",
        "The Future",
        "Mobile Phones",
        "Technology Trends",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Avishek Sharma",
                "href": "/profile/Avishek-Sharma-40"
            },
            "answer_text": "The future of smartphones will be much more than you can even think off. Let me give you a simple example. Camera in mobile phones became one of the biggest achievements ever achieved (after successfully putting a chipset that can work off from a small DC battery). The first phone to have come with a camera from softbank mobile (model-J-SH04) and it had 0.1 MP camera with a CMOS sensor (ok, it was way small). People became amazed with its applications since you can get a quick photo from anywhere (unless the phone has charge in it) and you dint need a digital point and shoot camera to carry everywhere(if it was available at that time since reel cameras in smaller bodies were available, Kodak cameras being the most common ones). Following that, all mobile companies started to revolutionize this little technology and from there started the camera war, which even continues today. Apart from all others, one was NOKIA, which we all know to be the king of camera smartphones. And YES, nokia was first to involve CARL ZEISS optics, which includes a series of lens (first, it was 4 lens used together, then it increased to 5 in the lumias, and finally, the 6-lens system that became part of smartphone cameras comparable to that of DSLRs) that filter out excess light so that you can get the perfect image. It was actually Paul Rudolph, who first designed the TESSAR lens system for mobile photography. From there, Nokia completely revolutionized smartphone cameras to a whole new level that nobody ever thought. Bringing the brilliant lens system of cameras to mobile phones, combined with big sensors, probably bigger than cameras, Nokia first introduced 808 PUREVIEW.  This is the still the symbiant smartphone to use the second biggest 1/1.2″ CMOS sensor (digital Point and Shoot cameras used nomally 1/2.8″, 1/2.6″,, now almost all PnS camera use the traditional 1/2.5″ and a bigger 1/2.3″), with a much useful XENON flash. That on a big 41MP camera. Output?, you can get high resolution pictures (upto 38MP) with only 20% decrease in details compared to mobile cameras at that time. Apart from that, you can get incredible PUREVIEW images at 8MP (also 5MP, 2MP) with almost 0% noise, extreme Details and exact Colours that are only possible in DSLRs. This technique got shifted into the LUMIA 1020 with a bit smaller 1/1.5″ BSI CMOS and it came with more features. Also, Nokia introduced Lumia 1520 with similar hardware technique with added power. Then Microsoft introduced the LUMIA 950/950XL with its camera hardware based on old lumias ( 20MP on 1/2.4″ BSI CMOS sensor, 2X loseless zoom, with 5th GEN OIS, Triple RGB flash, and upto 4K recording) that even clicked much amazing photos in any light. This was sure to be followed by android and iOS phones, but that aint happened as expected. They introduced other technologies like providing bigger sensors on small MP so as to create bigger pixels (HTCs Ultrapixel 4MP cameras), high FPS recording (apple had 720p 240 fps option, which was amazing at that time, xperia now has 1080p at 960fps too, its RX 100 IV specific feature), the more popular Dual camera system was first introduced by honor in its budget phone with a 13MP+2MP, then a 8MP dual camera, whereas LG introdced its dual system with an extra ultra wide 8MP with its usual 16MP, the other wide one got replaced with a monochrome, an optical 2X zoom. Even Apple and Google now have separate dedicated chipsets for their camera for faster performance and accurate photos. And still, they seemed to have made success in making smartphone camera better than ever, though not following the hardware trend. Future of smartphones will be better, but in which way we cant possible say that. It can be on anything. Chipsets, cameras, battery backup, screen, funtionality, all of these are getting better in unexpected ways. But predictions can be made that phones in future will have ; better chipsets in smaller sizes(less than 10nm), better processors, GPUs(to render 4K screens even better), Memory types(better than DDR5).Better camera hardware(probably high quality bigger sensors, better stabilization techniques, better Software algorithms, better imaging processes), increased higher resolution video recording at higher frame rates (more than 960fps)Better screen quality (probably higher resolutions 4K, 8K screens in small sizes, for better quality and clarity)better battery backup (smaller chipset sizes, software optimizations, bigger battery in small sizes)faster OS.Other technology included like mini projectors with Light sensors, Hologram projectors.",
            "date": "Answered March 31, 2018",
            "views": "2",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Justice Varner",
                    "user_href": "/profile/Justice-Varner-1"
                },
                {
                    "user_id": "Rakshith B",
                    "user_href": "/profile/Rakshith-B-7"
                },
                {
                    "user_id": "Vamsi Madugula",
                    "user_href": "/profile/Vamsi-Madugula-2"
                },
                {
                    "user_id": "Pulkit Gupta",
                    "user_href": "/profile/Pulkit-Gupta-326"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zolta Ha",
                "href": "/profile/Zolta-Ha"
            },
            "answer_text": "My guesses: Near future (in some years): The name will not be smartphone, but PC again. Coming from “personal computer\" but just called PC. (My PC told me… Your PC needs a version upgrade…) A more integrated device. Better, smaller batteries. Perfect multi way voice interface. Perfect inter language voice translations. A device without any holes. Everything without wires. Better outside sensors, not built into the smartphone, but keeping “touch” with the phone all the time. E.g. glasses. earpieces, cameras, mikes, body health sensors, tiny internet extenders. Auto connecting, without much setup. A bit farther future: More integrations with your body. One central unit and perhaps a backup unit.. For example a box. Probably in your pocket all the time. Or perhaps under your skin. Lots of sensors and small devices doing their separate functions. All communicating with the central little box. Some of these little devices will be part of your body. The display monitor will be inside your eye. Sensors would understand your words, murmurs, thoughts. Would play only for you inside your ears and eyes… A mike, a camera, an earpiece implant, a blood monitor under your skin, in your vein,… No batteries, your body will provide the energy, through some means. Or just tiny batteries that need to be changed after some years only. You will always be connected to central networks. So some companies will always know where you are and how to communicate with you. Alerts will be triggered automatically if you have health problems or if your data flow coming from you was interrupted for any reason. Extra guesses: First these features and services will be available only for selected groups of people. Then those will get mainstream and people will not be able to opt out. Police will be sitting behind giant maps and looking at blinking red lights. There will be no paper money, or cards. All incoming and outgoing payments will be personal and automatic through the device on or in you. ",
            "date": "Answered March 21, 2020",
            "views": "353",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dinisuru Madawala",
                "href": "/profile/Dinisuru-Madawala"
            },
            "answer_text": "The Smartphone is dying. With the introduction of iPhone X, the mobile industry is just booming. The technology they occupy is really impressive and it evolves time to time. Apple, Samsung, Google and other notable tech companies in the mobile market thrive to make their products more efficient and awesome.  However, some other technologies are being developed in the shadows. Most people would not notice this change due to the excessive use of smartphones. but Augmented reality (AR) is rising behind the curtains. I’m not talking about the technology, I'm explaining the possibility of wearable devices with AR technology which could replace Smartphones on a massive scale.  AR devices aren't much of a trend these days, but in the near future, AR devices will outnumber smartphones and create a new industry which will combine with a number of different fields such as entertainment, transport, telecommunication, education and so on. People like new things, it was the same when the first smartphone came out. Everyone who saw the product wanted one and it will be the same when a really advanced AR product is introduced. Google glasses sure was an innovative product, but comparing its capabilities with a smartphone, it is inferior.  When Graham-bell invented the Telephone, it was just lined communication, not much of a deal if you ask someone these days. That simple innovative product transformed the telecommunication sector, resulting advance devices that could do tasks which weren't even thought of back then. The same thing happened when Steve Jobs introduced the iPhone. This will be the same effect for AR. Google glasses could operate really well and it could be further developed to do tasks which weren't even thought of in the present era. Currently, a number of companies work on these devices. Smartphones are changing our lives, AR will revolutionize the world.  AR devices will be the next big thing. I’m not saying that smartphones would be completely dead when this happens, but with the evolution of the world, smart cities, artificial intelligence, driverless cars and all these new things, smartphones seem a bit outdated. The world's evolving. Let’s Embrace it # thanks for reading :) ~ Dinisuru Madawala ",
            "date": "Updated February 15, 2018",
            "views": "631",
            "upvotes": " View 207 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David F. Prenatt Jr.",
                    "user_href": "/profile/David-F-Prenatt-Jr"
                },
                {
                    "user_id": "Dakshit ( Annkiit Katiekar )",
                    "user_href": "/profile/Dakshit-Annkiit-Katiekar"
                },
                {
                    "user_id": "Aditya Anil Hatzade",
                    "user_href": "/profile/Aditya-Anil-Hatzade"
                },
                {
                    "user_id": "Karthik B",
                    "user_href": "/profile/Karthik-B-31"
                },
                {
                    "user_id": "Vinod Dagur",
                    "user_href": "/profile/Vinod-Dagur-1"
                },
                {
                    "user_id": "Cherry Goswami",
                    "user_href": "/profile/Cherry-Goswami"
                },
                {
                    "user_id": "Yashraj Mishra",
                    "user_href": "/profile/Yashraj-Mishra-10"
                },
                {
                    "user_id": "Kajal Dey",
                    "user_href": "/profile/Kajal-Dey-41"
                },
                {
                    "user_id": "Pradumya Shrivastava",
                    "user_href": "/profile/Pradumya-Shrivastava"
                },
                {
                    "user_id": "Vishal Paul",
                    "user_href": "/profile/Vishal-Paul-70"
                },
                {
                    "user_id": "Siddeshwar Sid",
                    "user_href": "/profile/Siddeshwar-Sid"
                },
                {
                    "user_id": "Jena Wood",
                    "user_href": "/profile/Jena-Wood-4"
                },
                {
                    "user_id": "Tejaswi Khetan",
                    "user_href": "/profile/Tejaswi-Khetan-2"
                },
                {
                    "user_id": "Daniel Mård",
                    "user_href": "/profile/Daniel-Mård"
                },
                {
                    "user_id": "Liran Cohen",
                    "user_href": "/profile/Liran-Cohen-26"
                },
                {
                    "user_id": "Tristan Le Sommier",
                    "user_href": "/profile/Tristan-Le-Sommier"
                },
                {
                    "user_id": "Soliman Hossain",
                    "user_href": "/profile/Soliman-Hossain-1"
                },
                {
                    "user_id": "Camilla Kristine Karlsen",
                    "user_href": "/profile/Camilla-Kristine-Karlsen"
                },
                {
                    "user_id": "Prabhakar Rao",
                    "user_href": "/profile/Prabhakar-Rao-149"
                },
                {
                    "user_id": "Anthony Jayasinghe",
                    "user_href": "/profile/Anthony-Jayasinghe"
                },
                {
                    "user_id": "Robert l Anderson",
                    "user_href": "/profile/Robert-l-Anderson-2"
                },
                {
                    "user_id": "Matthew Zhang",
                    "user_href": "/profile/Matthew-Zhang-71"
                },
                {
                    "user_id": "Ricard Efendi",
                    "user_href": "/profile/Ricard-Efendi"
                },
                {
                    "user_id": "Brian Nyapara Barasa",
                    "user_href": "/profile/Brian-Nyapara-Barasa"
                },
                {
                    "user_id": "Menya Nkuutu",
                    "user_href": "/profile/Menya-Nkuutu"
                },
                {
                    "user_id": "David Peterson",
                    "user_href": "/profile/David-Peterson-343"
                },
                {
                    "user_id": "Patricia Mc Dermott",
                    "user_href": "/profile/Patricia-Mc-Dermott-1"
                },
                {
                    "user_id": "Michael Perez",
                    "user_href": "/profile/Michael-Perez-208"
                },
                {
                    "user_id": "Patrick Christian",
                    "user_href": "/profile/Patrick-Christian-16"
                },
                {
                    "user_id": "Chaitu Gawande",
                    "user_href": "/profile/Chaitu-Gawande"
                },
                {
                    "user_id": "Sarathi S",
                    "user_href": "/profile/Sarathi-S-15"
                },
                {
                    "user_id": "Jaxen McInnis",
                    "user_href": "/profile/Jaxen-McInnis"
                },
                {
                    "user_id": "Siyanbola Yazid",
                    "user_href": "/profile/Siyanbola-Yazid"
                },
                {
                    "user_id": "Eman Saqri",
                    "user_href": "/profile/Eman-Saqri"
                },
                {
                    "user_id": "Malayranjan Parida",
                    "user_href": "/profile/Malayranjan-Parida"
                },
                {
                    "user_id": "Shona Ahmed",
                    "user_href": "/profile/Shona-Ahmed-3"
                },
                {
                    "user_id": "Priyanka Gupta",
                    "user_href": "/profile/Priyanka-Gupta-1994"
                },
                {
                    "user_id": "Rakshith B",
                    "user_href": "/profile/Rakshith-B-7"
                },
                {
                    "user_id": "An Phi Xuan",
                    "user_href": "/profile/An-Phi-Xuan"
                },
                {
                    "user_id": "Ganesh Pawar",
                    "user_href": "/profile/Ganesh-Pawar-298"
                },
                {
                    "user_id": "Henry Oviri",
                    "user_href": "/profile/Henry-Oviri"
                },
                {
                    "user_id": "Harris Kurniadi",
                    "user_href": "/profile/Harris-Kurniadi"
                },
                {
                    "user_id": "Martin Quintanilla",
                    "user_href": "/profile/Martin-Quintanilla-3"
                },
                {
                    "user_id": "Joshua Gregoire",
                    "user_href": "/profile/Joshua-Gregoire-1"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-16335"
                },
                {
                    "user_id": "Mitia Raoely",
                    "user_href": "/profile/Mitia-Raoely"
                },
                {
                    "user_id": "Nyle Hawking",
                    "user_href": "/profile/Nyle-Hawking"
                },
                {
                    "user_id": "Jyotishman Hazarika",
                    "user_href": "/profile/Jyotishman-Hazarika-5"
                },
                {
                    "user_id": "VIDHIKA MATHUR",
                    "user_href": "/profile/VIDHIKA-MATHUR"
                },
                {
                    "user_id": "Meer Riz",
                    "user_href": "/profile/Meer-Riz"
                },
                {
                    "user_id": "Alan Connan",
                    "user_href": "/profile/Alan-Connan"
                },
                {
                    "user_id": "Kai Lamarr",
                    "user_href": "/profile/Kai-Lamarr"
                },
                {
                    "user_id": "Nathan Coppedge",
                    "user_href": "/profile/Nathan-Coppedge"
                },
                {
                    "user_id": "Srikanth Parimi",
                    "user_href": "/profile/Srikanth-Parimi-5"
                },
                {
                    "user_id": "Deltron Angel",
                    "user_href": "/profile/Deltron-Angel"
                },
                {
                    "user_id": "Aryaman Jai",
                    "user_href": "/profile/Aryaman-Jai"
                },
                {
                    "user_id": "Razi Xu",
                    "user_href": "/profile/Razi-Xu"
                },
                {
                    "user_id": "Theo Jayd",
                    "user_href": "/profile/Theo-Jayd"
                },
                {
                    "user_id": "Roland Spiff",
                    "user_href": "/profile/Roland-Spiff"
                },
                {
                    "user_id": "Loke Wei Lun",
                    "user_href": "/profile/Loke-Wei-Lun"
                },
                {
                    "user_id": "Hamizan Mizan",
                    "user_href": "/profile/Hamizan-Mizan"
                },
                {
                    "user_id": "Anirudhha Nandaniya",
                    "user_href": "/profile/Anirudhha-Nandaniya"
                },
                {
                    "user_id": "Bridgette Craig",
                    "user_href": "/profile/Bridgette-Craig-1"
                },
                {
                    "user_id": "Jean Šadl-Ferš",
                    "user_href": "/profile/Jean-Šadl-Ferš"
                },
                {
                    "user_id": "William Sterling",
                    "user_href": "/profile/William-Sterling-3"
                },
                {
                    "user_id": "Edward Mike",
                    "user_href": "/profile/Edward-Mike-8"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Idy-Udoma"
                },
                {
                    "user_id": "Philip Nartey",
                    "user_href": "/profile/Philip-Nartey"
                },
                {
                    "user_id": "Ian McKenzie",
                    "user_href": "/profile/Ian-McKenzie-35"
                },
                {
                    "user_id": "Auon Kumar",
                    "user_href": "/profile/Auon-Kumar"
                },
                {
                    "user_id": "Adarsh Kumar",
                    "user_href": "/profile/Adarsh-Kumar-32"
                },
                {
                    "user_id": "Darryl M Perrilloux Jr",
                    "user_href": "/profile/Darryl-M-Perrilloux-Jr"
                },
                {
                    "user_id": "Sundar Krishnamoorthy",
                    "user_href": "/profile/Sundar-Krishnamoorthy-1"
                },
                {
                    "user_id": "Narain",
                    "user_href": "/profile/Narain-3"
                },
                {
                    "user_id": "Saurabh Singh",
                    "user_href": "/profile/Saurabh-Singh-47"
                },
                {
                    "user_id": "Harsh Kumar",
                    "user_href": "/profile/Harsh-Kumar-24"
                },
                {
                    "user_id": "Craig Harbin",
                    "user_href": "/profile/Craig-Harbin-1"
                },
                {
                    "user_id": "William Bailo",
                    "user_href": "/profile/William-Bailo"
                },
                {
                    "user_id": "Harish Yadav",
                    "user_href": "/profile/Harish-Yadav-300"
                },
                {
                    "user_id": "Sanjaya Basnet",
                    "user_href": "/profile/Sanjaya-Basnet-1"
                },
                {
                    "user_id": "Heath Rogers",
                    "user_href": "/profile/Heath-Rogers-4"
                },
                {
                    "user_id": "Bijay Pegu",
                    "user_href": "/profile/Bijay-Pegu"
                },
                {
                    "user_id": "Shivam Chauhan",
                    "user_href": "/profile/Shivam-Chauhan-15"
                },
                {
                    "user_id": "Yang Jinsong",
                    "user_href": "/profile/Yang-Jinsong"
                },
                {
                    "user_id": "Bhavesh Tiwari",
                    "user_href": "/profile/Bhavesh-Tiwari-3"
                },
                {
                    "user_id": "Jaivet Ealom",
                    "user_href": "/profile/Jaivet-Ealom"
                },
                {
                    "user_id": "Morris Albert Figeredo",
                    "user_href": "/profile/Morris-Albert-Figeredo"
                },
                {
                    "user_id": "Gobinda Khanal",
                    "user_href": "/profile/Gobinda-Khanal-1"
                },
                {
                    "user_id": "Mohd Zulakmal",
                    "user_href": "/profile/Mohd-Zulakmal-1"
                },
                {
                    "user_id": "Samuel Liu",
                    "user_href": "/profile/Samuel-Liu-7"
                },
                {
                    "user_id": "Dave Quick",
                    "user_href": "/profile/Dave-Quick-4"
                },
                {
                    "user_id": "Pronab Jyoti Nath",
                    "user_href": "/profile/Pronab-Jyoti-Nath"
                },
                {
                    "user_id": "Aryan Dara",
                    "user_href": "/profile/Aryan-Dara-2"
                },
                {
                    "user_id": "Antonio Isaza",
                    "user_href": "/profile/Antonio-Isaza-1"
                },
                {
                    "user_id": "Morris Njue",
                    "user_href": "/profile/Morris-Njue-1"
                },
                {
                    "user_id": "Shawn Williams",
                    "user_href": "/profile/Shawn-Williams-361"
                },
                {
                    "user_id": "Apoorv Vishnoi",
                    "user_href": "/profile/Apoorv-Vishnoi-1"
                },
                {
                    "user_id": "Frank Ordu",
                    "user_href": "/profile/Frank-Ordu"
                },
                {
                    "user_id": "Mohamed AlShawi",
                    "user_href": "/profile/Mohamed-AlShawi"
                },
                {
                    "user_id": "Mayank Verma",
                    "user_href": "/profile/Mayank-Verma-126"
                },
                {
                    "user_id": "Udyan Sharma",
                    "user_href": "/profile/Udyan-Sharma-4"
                },
                {
                    "user_id": "Steve Soutar",
                    "user_href": "/profile/Steve-Soutar-3"
                },
                {
                    "user_id": "Becky Nguyen",
                    "user_href": "/profile/Becky-Nguyen-9"
                },
                {
                    "user_id": "Steven Carrigan",
                    "user_href": "/profile/Steven-Carrigan-1"
                },
                {
                    "user_id": "Fajar Seno Adi",
                    "user_href": "/profile/Fajar-Seno-Adi"
                },
                {
                    "user_id": "Andy Lee",
                    "user_href": "/profile/Andy-Lee-64"
                },
                {
                    "user_id": "Maria T",
                    "user_href": "/profile/Maria-T-41"
                },
                {
                    "user_id": "Craig Desmond Jones",
                    "user_href": "/profile/Craig-Desmond-Jones"
                },
                {
                    "user_id": "Troy Scalise",
                    "user_href": "/profile/Troy-Scalise"
                },
                {
                    "user_id": "Marcus Michael",
                    "user_href": "/profile/Marcus-Michael-3"
                },
                {
                    "user_id": "Logan Ince",
                    "user_href": "/profile/Logan-Ince-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Mystogan-15"
                },
                {
                    "user_id": "Anthony Witt",
                    "user_href": "/profile/Anthony-Witt-5"
                },
                {
                    "user_id": "Jason Daniel",
                    "user_href": "/profile/Jason-Daniel-12"
                },
                {
                    "user_id": "Rodolfo Martinez",
                    "user_href": "/profile/Rodolfo-Martinez-3"
                },
                {
                    "user_id": "Ryan Lindmar",
                    "user_href": "/profile/Ryan-Lindmar-1"
                },
                {
                    "user_id": "Torikul Akbar",
                    "user_href": "/profile/Torikul-Akbar"
                },
                {
                    "user_id": "Sid Singh",
                    "user_href": "/profile/Sid-Singh-51"
                },
                {
                    "user_id": "Faiz Shaikh",
                    "user_href": "/profile/Faiz-Shaikh-56"
                },
                {
                    "user_id": "AJ Vande Kamp",
                    "user_href": "/profile/AJ-Vande-Kamp"
                },
                {
                    "user_id": "Michael Dunn",
                    "user_href": "/profile/Michael-Dunn-117"
                },
                {
                    "user_id": "Jonathan Hooper",
                    "user_href": "/profile/Jonathan-Hooper-2"
                },
                {
                    "user_id": "Silen Naihin",
                    "user_href": "/profile/Silen-Naihin"
                },
                {
                    "user_id": "Augusto Lopetegui",
                    "user_href": "/profile/Augusto-Lopetegui"
                },
                {
                    "user_id": "Nate Mcmaster",
                    "user_href": "/profile/Nate-Mcmaster-1"
                },
                {
                    "user_id": "Gille Fromka",
                    "user_href": "/profile/Gille-Fromka"
                },
                {
                    "user_id": "Dave Shelton",
                    "user_href": "/profile/Dave-Shelton-2"
                },
                {
                    "user_id": "Kartik Aggrwal",
                    "user_href": "/profile/Kartik-Aggrwal"
                },
                {
                    "user_id": "YY Xie",
                    "user_href": "/profile/YY-Xie"
                },
                {
                    "user_id": "Scott Kiskaddon",
                    "user_href": "/profile/Scott-Kiskaddon"
                },
                {
                    "user_id": "Kevin Cheung",
                    "user_href": "/profile/Kevin-Cheung-71"
                },
                {
                    "user_id": "Andre Leong",
                    "user_href": "/profile/Andre-Leong"
                },
                {
                    "user_id": "Chris Cunningham",
                    "user_href": "/profile/Chris-Cunningham-87"
                },
                {
                    "user_id": "Sean Agyemang",
                    "user_href": "/profile/Sean-Agyemang"
                },
                {
                    "user_id": "Arjun Randhawa",
                    "user_href": "/profile/Arjun-Randhawa-2"
                },
                {
                    "user_id": "Matt Hur",
                    "user_href": "/profile/Matt-Hur-1"
                },
                {
                    "user_id": "Michael Mina",
                    "user_href": "/profile/Michael-Mina-10"
                },
                {
                    "user_id": "Jim Franz",
                    "user_href": "/profile/Jim-Franz"
                },
                {
                    "user_id": "Alejandro Louis",
                    "user_href": "/profile/Alejandro-Louis"
                },
                {
                    "user_id": "Maciek Szpytma",
                    "user_href": "/profile/Maciek-Szpytma"
                },
                {
                    "user_id": "Wyatt Edminster",
                    "user_href": "/profile/Wyatt-Edminster"
                },
                {
                    "user_id": "Zahil Zainurin",
                    "user_href": "/profile/Zahil-Zainurin"
                },
                {
                    "user_id": "Joseph G. Alessi",
                    "user_href": "/profile/Joseph-G-Alessi"
                },
                {
                    "user_id": "Stephen Vaudreuil",
                    "user_href": "/profile/Stephen-Vaudreuil"
                },
                {
                    "user_id": "Griffin Pfenniger",
                    "user_href": "/profile/Griffin-Pfenniger"
                },
                {
                    "user_id": "Rahul Punde",
                    "user_href": "/profile/Rahul-Punde"
                },
                {
                    "user_id": "Wathik Schiyth",
                    "user_href": "/profile/Wathik-Schiyth"
                },
                {
                    "user_id": "ESL Training",
                    "user_href": "/profile/ESL-Training-2"
                },
                {
                    "user_id": "Luca Celestino",
                    "user_href": "/profile/Luca-Celestino"
                },
                {
                    "user_id": "Sandeep Chintu",
                    "user_href": "/profile/Sandeep-Chintu-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma Martin",
                "href": "/profile/Emma-Martin-263"
            },
            "answer_text": "The modern smartphone is a metaphorical giant oak tree of a technology the world had previously never seen before. With a powerful camera, high-speed connectivity, touchscreen interface and millions of different apps available at our fingertips, it is a device that seemingly has no limits to what it can perform. You have heard the rumors of Apple’s potential wireless charging feature for the upcoming iPhone 8. And chances are that you've been to a Starbucks and seen the Circular Powermat charging pads on the tables. But real wireless charging -- or as I like to think of it, wireless power -- where our smartphones don't need to physically be tethered to another device, is coming soon to a phone near you. Despite the obvious appeal of not having to search for outlets, buy a new power cord because you lost yours yet again and just having power available wherever you go, there are going to be some very interesting changes to the phone itself when wireless power is available en masse.  Let's jump to the future, where real wireless power (I’m talking about a feature that works similar to Wi-Fi -- not the cradle/pad version) is ubiquitous, screens are transparent and our smartphones are byproducts of advanced AI. To truly appreciate the design process of a smartphone, we only need to look at the source and limit of all its features, the power unit of the phone: the battery. The battery size ends up defining just about everything we know and love in a smartphone: the computational power of the CPU, the resolution of the screen, the pixel count of the camera, the available memory on the device and, of course, the speed of the internet. Once the battery size is defined, consuming the battery's available power becomes the single most important resource. If a phone had unlimited power sent over the air, the battery would not have to store so much power. Without the need for extra storage power, the battery itself could be smaller, leaner and much more efficient, leaving room to develop other features within the hardware that were previously impossible. Now, let’s look at the next obvious evolution for the smartphone: the screen. For years, different smartphone companies have imagined that phones would become transparent, AR-type devices that would integrate into the world around us. In 2013, Polytron Technologies general manager Sam Yu told Macworld that the transparent phone would become a reality by the end of that same year. Obviously, that never came to fruition. ",
            "date": "Answered November 15, 2018",
            "views": "743",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kristi Elliott",
                "href": "/profile/Kristi-Elliott"
            },
            "answer_text": "Oh how I love answering this question... simply because it's purely based on speculation and trend.  Plus, I love giving \"Kristi's Crystal Ball View\" of the future of mobility. First, let me give you some background. I received my first Blackberry somewhere in the late 90's. Back then they looked like pagers with a full keyboard.  Since then, I've watched the cellular data market explode, built an incredible career in mobility and seen many trends come and go. With that experience, I have developed my theory on where we are headed at least in the enterprise; and believe me, I don't think we are too far from this. When you start a new job, you will be issued three things: 1) A smartphone2) A wi-fi tablet3) Your \"real estate\" or office space So here's where it gets fun... Your smartphone will be integrated with secure VPN -- thus, no need for a separate RSA code generator, your phone will know what code to enter for your secure connection from a remote location.  Your phone will be equipped with NFC, so as long as you have your phone, the building doors will unlock when you approach. Eliminating the need for a security badge.  Plus, with NFC your corporate credit card will also be integrated into your device, so you'll pay for that business lunch with a swipe of your phone. Like today, your office phone will be VOIP, allowing you to program your desk phone to ring to your smartphone. Don't worry, there will be a smartphone dock at your desk that auto-disables this when you're in the office. So what else is in that office?  You'll have a large monitor, a device that looks like a desk phone with no buttons connected to Ethernet, a wireless keyboard and mouse.  When you are working in the office, you will simply \"dock\" your tablet into that \"desk phone\".  At that point, the image on your tablet switches to what looks like a phone speed dial list and a phone keypad, auto-connecting to the LAN and VOIP system based on the ID in the device.  When the phone rings, a picture of the person comes up on the tablet, as well as, a smaller notification pop-up comes up on your monitor. You can answer with a headset or a normal handset, or for video calls, touch the notification for a face-to-face conversation with your colleague at the international office. But wait! There's more! (shameless infomercial reference) That docked tablet also connects you to a client system in the cloud. This system registers your ID and position, then gives you access to all the applications you will need for your job.  This \"terminal connection\" is rendered onto the monitor at your desk. Where you can either touch the application to launch it or use the traditional keyboard/mouse method. When you logout at the end of the day, any open documents will be cached on the tablet so you can continue your work later from home. So then, while working remote, you'll use the smartphone's hotspot feature to provide a secure connection to office.  Access it through your tablet and use the travel keyboard and mouse that came as accessories.  When you turn the tablet on at home, the applications and documents you were working on are right there for you to continue working. So, you lose a device? The company has GPS to locate them both, in case your kindergartner \"stole\" them for show and tell, but otherwise, a simple mouse click, disables both devices and wipes all company data. The company will be out $500-$1000, a drop in the bucket! In summary, if you think we are \"smartphone junkies\" now... I'm fairly certain that our future livelihood will depend on them!  ",
            "date": "Answered October 15, 2011",
            "views": "25",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Shah",
                    "user_href": "/profile/Rohan-Shah-307"
                },
                {
                    "user_id": "Camelia Ganea",
                    "user_href": "/profile/Camelia-Ganea"
                },
                {
                    "user_id": "David Jones",
                    "user_href": "/profile/David-Jones-1790"
                },
                {
                    "user_id": "Arun Chennuru",
                    "user_href": "/profile/Arun-Chennuru"
                },
                {
                    "user_id": "Amy Castor",
                    "user_href": "/profile/Amy-Castor-2"
                },
                {
                    "user_id": "Nritya Guru",
                    "user_href": "/profile/Nritya-Guru"
                },
                {
                    "user_id": "Benjamin Alderoty",
                    "user_href": "/profile/Benjamin-Alderoty"
                },
                {
                    "user_id": "Flynn Macfarlane",
                    "user_href": "/profile/Flynn-Macfarlane"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Hargreaves",
                "href": "/profile/Nicholas-Hargreaves-1"
            },
            "answer_text": "It’s already 2018 and smartphone developments continue to impress us with their innovation and creativity. What more can smartphones possibly showcase in the future? Here are features that might continue or be included in the future lineups of smartphones.  Wireless - With Apple’s introduction of the AirPower, portable wireless charging will most likely be possible in the future. Wireless accessories, such as Apple’s wireless earphones called AirPods, will also most likely be a commercial possibility in the future. Thinner - Phones will continue to become thinner and lighter, thus making it more portable. How thin could phones get? A thinner hardware would mean lesser space for necessary computer processes such as microchips. Producing smaller but more capable chips would prove to become a challenge in the future. Battery - Batteries would most likely contain powerful and longer-lasting power. An idea presented in an article via Forbes on the future of smartphones, suggests that if phones are capable of receiving power over the air, batteries would not need to have extra storage power and can become smaller and leaner. Solar-powered smartphones are also a possibility. Transparent - With smartphones becoming more transparent, this removes a phone’s back side and allows both sides of the phone to function. This is possible as long as we manage to figure out how to put and fit all the necessary phone accessories like the battery and microchip while unseen. Aside from the difficulty of producing this kind of phone, questions on privacy would surface as the content you would be viewing would be seen through your phone. Smarter - How smart can smartphones get? We still don’t know how expansive software can get but as development for Artificial Intelligence and machine learning continues, it is possible for smartphones to be so smart that they can be able to predict queries or situations or already give out answers. Imagine yourself about to type a question, but before you could touch your screen, your smartphone has already predicted what it is and has already suggested your question on the search engine. That’s possibly how smart they can get, or more. While we’re waiting for these to happen, here are some of the things you can do with your smartphones: 10 Must-Have Fitness Apps (Part 1: Let’s Get Moving!) 10 Must-Have Fitness Apps (Part 2: Let’s Lose Weight!) 7 Mobile Apps to Help You Learn Coding on the Go Technology for People: Software Making a Difference Part 1 Technology for People: Software Making a Difference Part 2 ",
            "date": "Answered February 9, 2018",
            "views": "52",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rakshith B",
                    "user_href": "/profile/Rakshith-B-7"
                },
                {
                    "user_id": "Capri Béo",
                    "user_href": "/profile/Capri-Béo"
                },
                {
                    "user_id": "Sarina Marie",
                    "user_href": "/profile/Sarina-Marie-17"
                },
                {
                    "user_id": "Lou Ann",
                    "user_href": "/profile/Lou-Ann-13"
                },
                {
                    "user_id": "Alberto Luci",
                    "user_href": "/profile/Alberto-Luci"
                },
                {
                    "user_id": "Josephine Mariñas",
                    "user_href": "/profile/Josephine-Mariñas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harvir Dhindsa",
                "href": "/profile/Harvir-Dhindsa"
            },
            "answer_text": "This is the thing about how people interact with technology, specifically with a personal computing device such as a laptop or smartphone. Most tech futurists and analysts point toward a future with seamless productivity. A future where people can browse the internet and watch their favorite YouTube videos, for example, through slim and elegant augmented reality (AR) devices. We are supposedly heading towards immersing ourselves in fabricated, 3D digital environments where upon any level of productivity and/or play should be possible and streamlined. Instead of holding a smartphone in our hands, we will have the capabilities of a smartphone available to us in this world of AR. Simply have your favorite applications launch before your eyes without have to touch anything physical. But here is the thing. People enjoy tactile feedback in their technology. Using a physical keyboard, even one on a touchscreen, is something that will be difficult to replace. Swiping through the air is indeed simpler and perhaps more intuitive once one gets used to it. But replacing physical technology with only gestures isn’t something people will get accustomed to quickly, Considering all of this, I believe that at least the short-term future of smartphones and other personal computing devices will become more and more in tune with AR capabilities. They will slowly abandon more and more physical key pressing. However, tactile feedback will likely continue to be an option for those who want it. Whether that be in the form of wearable haptic feedback technology, I do not know. But, I believe some sort of option will be available at least for the short-term. In 40 years, I don’t see any smartphones resembling those we have today. ",
            "date": "Answered August 13, 2018",
            "views": "847",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rakshith B",
                    "user_href": "/profile/Rakshith-B-7"
                },
                {
                    "user_id": "Joey Hensley",
                    "user_href": "/profile/Joey-Hensley-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramandeep Singh",
                "href": "/profile/Ramandeep-Singh-662"
            },
            "answer_text": "It isn’t an exaggeration to say that smartphones are certainly an essential future of almost all products and services. These smart devices with a six-inch screen and an internet connection have replaced innumerable objects in our lives and have certainly headed us towards a future that appears quite promising and convenient. But what could be the future of these smart devices? Do you think the smart devices could turn smarter? Well, as of now, you can control smart devices with the help of your smartwatches and you can also control the appliances in your home with the help of your smartphones. However, the future of these smart devices does hold something better.  In future, we can expect the smartphones to turn smaller and slimmer (slimmer than the present paper-smartphones which are being tested). And such slip products can be folded multiple times to keep them in your pocket, saving a lot of space. You would not need to take them out for any reasons as you can control almost every function in your smartphone with the help of a bracelet sized smart wearable in your hand and you can even clock the smart wearable to access the photos and videos in your smartphone in a digital format, just as you view the virtual keyboard and the virtual screens, without having anything physical. Just as convenient this sounds to be, it would be a securer technique and would offer nothing to the burglars and the pickpockets. Furthermore, we may see times when your smartphone would not be needed to be carried in your pockets. All you need is a smart wearable that stays connected with your smartphone all the time and you just need to wear the smart bracelet without facing any troubles with your smartphone. However, this is just a personal illusion and since I am not a technology enthusiast, my expectations and imaginations on technology are a bit meeker than the others. However, I would surely like to know your imaginations in the comment section. ",
            "date": "Answered June 8, 2020",
            "views": "216",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ankit Gupta",
                    "user_href": "/profile/Ankit-Gupta-2840"
                },
                {
                    "user_id": "Naveen Mittal",
                    "user_href": "/profile/Naveen-Mittal-55"
                },
                {
                    "user_id": "Bhavin Rajput",
                    "user_href": "/profile/Bhavin-Rajput-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Jen",
                "href": "/profile/Mark-Jen"
            },
            "answer_text": "There are some trends that are likely to continue: Larger screensLonger battery lifeThinner and lighter form factorsBetter biometric security (e.g. facial recognition, fingerprint scanners, etc.)However, I think one of the most interesting advances is the connectivity capability of the modern smartphone and where we can expect that to go. As few as 5 years ago, we used to have to choose phones based on what radio frequencies and protocols it supported. Most of the time, your phone would only work in one country on a specific carrier and you were lucky if it worked in more. The latest Qualcomm X55 modem supports a dozen protocols across over 30 frequency bands all in a single chip! New phones also support the latest Wi-Fi and Bluetooth standards making them a true “swiss army knife” of connectivity. The general idea here is that your smartphone will always be connected at faster speeds and lower latency than ever before. There are a lot of interesting cases that become available when connectivity improves. At the very least, it is interesting to consider whether we will still have “apps” in the 5G era. Recall that for the first 25 years of PC computing we relied primarily on apps, but have now transitioned to spending most of our PC time entirely on the web. Downloading and installing programs is no longer necessary for most desktop / laptop usage. We are now about 10 years into the smartphone era. As 5G rolls out and smartphones have more connectivity, will we see the end of downloading / installing mobile apps? The next frontier looks to be wearables. Google Glass and Apple Watch are really only the very first forays into this space and are limited by the capabilities of current technology (much like the Palm Pilot and Apple Newton were the early forays into the smartphone/tablet era). Within the next 10 years, we may be expanding our ideas around what devices we use to accomplish the smartphone use cases of today. And the final frontier that we can currently see is one that has started via the evolution of smartphone system-on-chips (SoCs): the integration of communication stacks into the CPU/GPU/memory core. As this trend continues, all devices will have processors that include wireless functionality, so that eventually you will be unable to buy an alarm clock, coffee maker, or toaster oven that does not include the ability to connect to the internet. Thus, “the future of smartphones” is that everything will become what we today consider a smartphone. ",
            "date": "Answered August 22, 2019",
            "views": "26",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gayatri Puwar",
                    "user_href": "/profile/Gayatri-Puwar-1"
                },
                {
                    "user_id": "Murali Gupta",
                    "user_href": "/profile/Murali-Gupta"
                },
                {
                    "user_id": "Nallapu. Madhuri",
                    "user_href": "/profile/Nallapu-Madhuri"
                },
                {
                    "user_id": "Avinash Hiremath",
                    "user_href": "/profile/Avinash-Hiremath-1"
                },
                {
                    "user_id": "Markandeya Janaswamy",
                    "user_href": "/profile/Markandeya-Janaswamy"
                },
                {
                    "user_id": "John Weber",
                    "user_href": "/profile/John-Weber-222"
                },
                {
                    "user_id": "James Taylor",
                    "user_href": "/profile/James-Taylor-1393"
                },
                {
                    "user_id": "Dayla Reagan-Buell",
                    "user_href": "/profile/Dayla-Reagan-Buell"
                },
                {
                    "user_id": "Allan Ng",
                    "user_href": "/profile/Allan-Ng-19"
                },
                {
                    "user_id": "Tomo Marinsek",
                    "user_href": "/profile/Tomo-Marinsek"
                },
                {
                    "user_id": "Ben Allen",
                    "user_href": "/profile/Ben-Allen-233"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prakhar Shirivastava",
                "href": "/profile/Prakhar-Shirivastava"
            },
            "answer_text": "The entire smartphone market is converging to a singular point. Let's take a look at the past industry trend. In two perspectives, the first one internal. The phone have been getting insanely more powerful hardware then before. The new generation SOC's are breaking all the previous performance benchmarks. They are on par with many entry level laptops and with the ARM architecture, the performance is extremely optimised, being incredibly battery friendlyThe screen's are getting bigger by the day. The quality of display has improved drastically. The screen's are being used for media consumption at such a high rate that companies make it their mission to get it right.The battery life has been constantly increasing, with more capacity and faster charging speed. The phone's themselves are becoming efficient in their usage of power. The large capacity battery make sure that a full day's is completed on a single charge.The camera has been improving exponentially. Give are the days of point and shoot digital cameras. The phone's are performing much better than those cameras. Some phones have camera quality comparable to previous generation DSLR's.The internal storage has gone up. Phones with 64 GB of internal storage are common these days. The Ram on board the phone's is increasing as well, giving rise to multitasking and easy switching between applications.The barrage of sensors that phone come with these days is astounding. Apart from the obvious fingerprint sensor, gyroscope, accelerometer and light sensor, phones now have heart rate monitors, step counters, barometer, iris scanner, IR Blasters and a lot of others that I've missed.The phones today are coming with high quality audio. Not just the speakers but the inclusion of 24 bit DAC maha them ideal for music lovers.Now for the aesthetic changes or what I call cosmetic changes. The phone's are getting lighter. This making them extremely portable even with the increasing battery life and screen size.They are becoming much more reliable and durable. With IP rating certifications and other cool technology used to safeguard the phone, it's longevity has improved. Phones now are incredibly reliable as much more reliable due to construction and because of the materials used.Disappearing bezels, make the phone more aesthetically pleasing to look at. But it also makes more use of the phone body for screen.Now where does this all lead to, if the answer isn't obvious from the points mentioned above, then read them again. The smartphone of today has slowly started replacing individual items of technology which we used on daily basis. It has slowly taken over multiple devices and started to merge them into a single identity. The first industry to take a hot from this was the portable music player market, the market is currently extinct with almost no one using a specialized device for listening to music. Smartphones engulfed this market and emerged on top of it. Take the tablet market for example, this market is currently on the brink of extinction. This is due to the sole fact the smartphones have replaced them completely. The next market is declining rapidly is of the consumer camera market. The point and shoot digital cameras are slowly phasing out of existence. The next thing to phase out would be the entry level DSLR'S. Followed by the laptop industry. I personally don't remember the last time I used a flash drive. Well this is the case for most Androids. The huge internal storage serves as flash drive. Media consumption has never been higher than what it is now on the smartphone. Basic instruments which needed to be individually carried around are now integrated into the phone. So where is the smartphone industry heading, I don't know exactly but I can make huge speculation based on the trend that we see today. It's going towards a singularity. A singular device for all your needs. Be it work, gaming, photography, music, videos or any other thing that encompasses the general requirements. So I can safely say, in the not so distant future, everyone will have one device for all their tasks. ",
            "date": "Answered July 2, 2018",
            "views": "21",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Technical Sagar",
                    "user_href": "/profile/Technical-Sagar-29"
                },
                {
                    "user_id": "M Martinů",
                    "user_href": "/profile/M-Martinů"
                },
                {
                    "user_id": "Alexandre Vld",
                    "user_href": "/profile/Alexandre-Vld"
                },
                {
                    "user_id": "Yaseen Ayaz",
                    "user_href": "/profile/Yaseen-Ayaz"
                },
                {
                    "user_id": "Rakshith B",
                    "user_href": "/profile/Rakshith-B-7"
                },
                {
                    "user_id": "Deepak Balachandar",
                    "user_href": "/profile/Deepak-Balachandar"
                },
                {
                    "user_id": "Supriya Jagadeesh",
                    "user_href": "/profile/Supriya-Jagadeesh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ricard Efendi",
                "href": "/profile/Ricard-Efendi"
            },
            "answer_text": "In its journey, humans managed to find a telecommunications device that allows them to still be able to contact the people closest to them without being constrained by space and time, called cellphones. The development of the device continues, starting from just calling anywhere, sending short messages, to playing simple games, now mobile phones exceed the expectations of most people. Thus, many things you can do with a cellphone today, such as visiting websites, chatting, accessing GPS, scanning documents, and watching a video from YouTube. The nature of human beings who will never be satisfied makes it to continue to bring something new, no wonder if at this time a variety of concepts of a mobile phone that is beyond the imagination or need can be found easily. These concepts are claimed to be able to simplify and improve the quality of human life. What kind of smartphone concept is there now? How many of them have been realized? Ear-Phone  In order to keep looking for easy steps for humans to communicate, an unnamed company presented a mini cellphone concept called The Kambala. The device is claimed to be the most compact device. Users simply attach The Kambala to their ears, so that every incoming call is received immediately, without having to make physical contact with it. The screen flexibility of the device is the key to its compact form. However, it seems that the concept will just disappear, thanks to bluetooth earphones that are already crowded in the market. Folding Sail  The concept of a cellphone with a foldable screen has been around for several years. Ever heard of rumors about Nokia 888? From the concept that is spread in cyberspace, the cellphone has a long enough size that is claimed to be able to be folded and adjusted to the shape desired by the user. Trusted Reviews At present, the concept of folding phones is starting to be realized, one of them by Samsung. The South Korean vendor is reportedly going to have one of the folding cellphone products, named Samsung Galaxy X. A prototype of the device was exhibited at the CES 2013 event, carrying the foldable display concept. 3D screen and hologram After Apple emerged with Retina Display, finally the smartphone manufacturers are now pinning 3D to smartphone screens. With the advent of the 3D screen, smartphone users can expect holographic projections, which are a combination of 3D features and projections from a smartphone. 3D display can be integrated with movement elements when users interact with smartphones. For example, users can resize photos using their hands to 'pull' or 'compact' holographic photos that appear in front of the user. There are a number of technologies that will be available and pinned on smartphones in the future. -Ricard Efendi - ",
            "date": "Answered March 2, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nirmal Kumar.A",
                    "user_href": "/profile/Nirmal-Kumar-A"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranjit Bhinge",
                "href": "/profile/Ranjit-Bhinge"
            },
            "answer_text": "The functionality of Smartphones comes down to a few fundamental things: Connectivity between peopleConnectivity to the internetPersonal tasks (like planning, notes, games, reminders, etc.)Great UI/UX (ease of use)Over the years, as accessibility to better tech emerged, Smartphones could offer more services to their users. For example, before the time of 3g connectivity, watching Youtube videos on a Phone was unheard of and Video calls were impossible.Before Smartphones could handle several GBs of RAM, having so many Apps running simultaneously was impossible, having games with detailed graphics was impossible, and having a super responsive and intelligent OS was impossible. So the answer to the Smartphone question is in emerging tech. Let me highlight some of these: Mobile Payment and CryptocurrenciesBlockchain and distributed ServersAR, VR and MRAI, Analytics and Big Data5G and IoTWearablesLow Power devices and Energy HarvestingEven better RAM and onboard memoryDigital identities and miniature biometricsBCI / NCI - controlling devices through thoughtQuantum Computing (Not really sure of this, since it has its own pros and cons and complications)My calculated guess is that Smartphones will cease to exist in the next 20 years and will be replaced by a new generation of Personal Devices. These devices will be either worn or embedded in our bodies and will be able to instantly identify the user.These will be devices that are so deeply and well connected to each other, that they go beyond the concept of being independent devices and start behaving as nodes (like neurons of the brain) of a singular larger global device. Each of these devices will be continuously picking up authentic data about the user, the environment, traffic, weather, etc. and sharing it with this closely knit network.The concept of cash and cards will cease to exist with these devices, and cryptocurrencies will be transacted securely and instantly.All these devices would be thin clients on a near zero-latency network, meaning that the Cloud would be so accessible that it would feel like it’s running on your device.These devices will be controlled by your thought. So the future of Smartphones is pretty clear, there isn’t any. But there’s a lot to look forward to in what could replace Smartphones.Whatever it is will be an extension of our body and mind and will bring the people and devices of the world together to form one big supercomputer. ",
            "date": "Answered December 16, 2017",
            "views": "22",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Kuzevich",
                    "user_href": "/profile/Mark-Kuzevich"
                },
                {
                    "user_id": "Utsav Vats",
                    "user_href": "/profile/Utsav-Vats"
                },
                {
                    "user_id": "Petros Raptakis",
                    "user_href": "/profile/Petros-Raptakis"
                },
                {
                    "user_id": "Divya Singh",
                    "user_href": "/profile/Divya-Singh-1139"
                },
                {
                    "user_id": "Ankit Gawande",
                    "user_href": "/profile/Ankit-Gawande"
                },
                {
                    "user_id": "Vishwanath Taykhande",
                    "user_href": "/profile/Vishwanath-Taykhande-1"
                },
                {
                    "user_id": "Ritunjoy Das",
                    "user_href": "/profile/Ritunjoy-Das-1"
                },
                {
                    "user_id": "Suraj Gupta",
                    "user_href": "/profile/Suraj-Gupta-291"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zaynab Khan",
                "href": "/profile/Zaynab-Khan-22"
            },
            "answer_text": "The mobile phones of the future are expected to be more closely embedded in our day-to-day lives than ever before. Some futurologists and industry experts predict that in years to come mobile phones will become remote controls for our whole lives, while others forecast that in the future mobile phones will literally run our lives for us. One thing’s for certain: the technology involved in mobile phones and mobile networks has developed so rapidly over the last few years, it's going to be an exciting ride but, can be devastating too! Some experts believe that in the not too distant future, mobiles will change the way we learn and teach. With more than one-in-three school children owning a mobile phone, a future where camera and voice recorder phones are both learning and teaching tools is highly possible. We have already seen some education authorities using texts to alert parents to the truancy and even to notify pupils of classroom changes. Companies are always looking to make their products more environmentally friendly, and phone makers are no exception, with researchers looking into biodegradable materials and cleaner energy charging. For most of us nowadays though, this sentiment applies to our smartphone. From setting alarms and reminders to checking our Facebook feed, doing online shopping and managing our finances, we reach for our phones as soon as we wake up and don’t really put them down until we’re ready to sleep. ",
            "date": "Answered July 15, 2018",
            "views": "153",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hardik Sharma",
                    "user_href": "/profile/Hardik-Sharma-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Armaan Agrawal",
                "href": "/profile/Armaan-Agrawal-4"
            },
            "answer_text": " With the iPhone 8 going to be released later this year, we can say that phones have gotten quite advanced. But with every new phone release , there seems to be a trend.  #1: Thinner.  iPhone 7, Samsung Galaxy S8, Google Pixel. What do they all have in common? They’re thin. Why? Because then, they’re easy to move around, and convenient to use. Plus, they look better. Nobody likes this:  #2: Convenient.  Using a phone is almost like a race. You need to be able to quickly unlock, find what you’re looking for, and then quickly put it back. This is the reason Fingerprint-Scanners were put onto phones. This is the reason why you’ve got voice-conntrol. This is the reason why your important apps are always docked. #3: Graphics.  Most of our phones are now 4K. Incredibly beautiful graphics, running at amazing speeds, able to handle crazy processing power. Phones will not stop getting quicker, and more beautiful. #4: Features.  Phones in the future are expected to have Face/Eye Scanning.Blood Pressure Scanning.Augmented Reality.3D Display.Hologram Capabilities.Wireless Charging.Incredibly powerful cameras. In the end, phones are simply expected to optimize everything for the better. Whether that be to advance the market as a whole, appear as ‘innovative’, or simple awe the audience. There is no denying that phones will get more innovative than you’ve ever thought. ARMAAN AGRAWAL ",
            "date": "Answered August 10, 2017",
            "views": "48",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Advay Rao",
                    "user_href": "/profile/Advay-Rao-1"
                },
                {
                    "user_id": "Camelia Ganea",
                    "user_href": "/profile/Camelia-Ganea"
                },
                {
                    "user_id": "Rakshith B",
                    "user_href": "/profile/Rakshith-B-7"
                },
                {
                    "user_id": "Ruchitha Teki",
                    "user_href": "/profile/Ruchitha-Teki"
                },
                {
                    "user_id": "Avishek Chourasia",
                    "user_href": "/profile/Avishek-Chourasia-1"
                },
                {
                    "user_id": "Emre Güzel",
                    "user_href": "/profile/Emre-Güzel-4"
                },
                {
                    "user_id": "Selena",
                    "user_href": "/profile/Selena-97"
                },
                {
                    "user_id": "Linda Jennifer",
                    "user_href": "/profile/Linda-Jennifer"
                },
                {
                    "user_id": "Aabishkar Wagle",
                    "user_href": "/profile/Aabishkar-Wagle"
                },
                {
                    "user_id": "Chris Botha",
                    "user_href": "/profile/Chris-Botha-17"
                },
                {
                    "user_id": "Jiang Junbo",
                    "user_href": "/profile/Jiang-Junbo"
                },
                {
                    "user_id": "Ayush Tomar",
                    "user_href": "/profile/Ayush-Tomar-32"
                },
                {
                    "user_id": "Shiv Sai",
                    "user_href": "/profile/Shiv-Sai-4"
                },
                {
                    "user_id": "Edijs Leitass",
                    "user_href": "/profile/Edijs-Leitass"
                },
                {
                    "user_id": "Julian Frias",
                    "user_href": "/profile/Julian-Frias"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anjali Rai",
                "href": "/profile/Anjali-Rai-293"
            },
            "answer_text": "I still remember the June of 2008 when I brought my first phone, the Sony Ericsson W700i with a dedicated music button, audio synthesizer and a 2 MP Camera that rocked. Steve Jobs dropped the biggest innovation in the world by releasing the iPhone which was a disruption because it discarded the need for a keypad on a phone. All these were impossible things to do at one point of time in life but were made a reality through technological innovation. Here are a few similar innovations that can evolve the way we interact with smartphones Controlling phone features using our mind: Not impossible since I’ve heard of the recent AlterEgo technology which has helped convert thoughts into words. It’s not far away when we carry out operations like sending a text, browsing the internet or simply reading a book on the phone through a tony stark like device fitted on our heads.Dockless Charging: Wireless charging as a term does signify freedom from charging cords but you still need to have the phone kept on the charging dock, this means you are unable to use your device when you’re charging it “wirelessly”. Hence Dockless Charging could be a big innovation which would change the way we charge our phones.AR and VR: While AR and VR have already been released in smartphones, the technology is yet to evolve in terms of its application. We have only scratched the surface and deeper use of AR and VR in shopping, travel and tourism, communication is yet to be exploredAcute Personal Assistant Customization: Remember Jarvis from Iron Man. Imagine what if you could have an assistant who understood you’re behaviour and helped you enhance your mobile experience. This could be the disruptive revolution of smartphone usage.",
            "date": "Answered May 30, 2019",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jamie Terbeest",
                "href": "/profile/Jamie-Terbeest"
            },
            "answer_text": "We’re seeing examples of data centers (Amazon AWS Snowball & Microsoft Azure Data Box) that are physically distributed versions of extremely robust processing centers. As a result, we will soon witness phones without processors as we know it. This means we will no longer have phone processing at the edge but close by in the cloud (on site at every primary cell tower or close by). One may call this fog computing or pervasive computing. Without a processor, you’re left with sensors, a wireless modem, antennas, a much smaller battery, and some kind of visual interface. Batteries may even go away with wireless power or leverage miniature super capacitors (charge for a few seconds and you are good for the day). With the advent of Augmented Reality and smart glasses, I opine we will soon see (~10–15 years) elimination of the smartphone, tablet, and personal computers. Our whole world will be transformed where we can completely eliminate the physical world (immersive ourselves in Virtual Reality) or switch to Mixed Reality and “augment” our physical existence with information and visualizations formed around what we are interacting with. The only key for this to happen is having a truly robust wireless network everywhere we go where processing only is a few thousand feet away. We’re well on our way with an available 5G standard, but the wireless carriers must do even better to provide robust connectivity (significant bandwidth to large populations with extremely low latency) in indoor and large outdoor areas. A daunting, but achievable challenge. ",
            "date": "Answered July 27, 2019",
            "views": "167",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ridhwaan Shakeel",
                    "user_href": "/profile/Ridhwaan-Shakeel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khushru Lim",
                "href": "/profile/Khushru-Lim"
            },
            "answer_text": "The Cell phone will keep on evolving, it mostly will evolve / merge with maybe a different product. A few possibilities below:- But first let’s see the past trend as below…when the cell phone was invented it was mostly for voice calls and was about 9 inches to 1 feet in length, in approx the 70’s/ 80s.It began then to shrink due to technology upgrades in 20 years or so then came the popular smaller Nokia’s., with added sms features … it upgraded to features with music facility and radios(fm). And we got smaller and smaller cell phones..Then came the smart phones with bigger screens and apps.Now the cell phones are comparable to computers in some aspects with DSLR quality photo capability, and bigger screens.Going forward the trend might be that the phones might integrate with some kind of google glass type technology, where the display could be floating in front of the user and only be viewable to the user and the voice could be a cochlear implant types or a small Bluetooth like device for the ear.Integration of cellphone into a watch like device with a floating display like a projector and a ear piece Bluetooth..A flexible display , kind of a roll out sheet with a ear piece..No one know how some unknown technology or innovation might just integrate with the cell phone to create a more flexible and different product in the future..Upvote and comment.. Thank you for reading…",
            "date": "Answered July 2, 2018",
            "views": "321",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Khushru Limbuwala",
                    "user_href": "/profile/Khushru-Limbuwala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mihnea Serbu",
                "href": "/profile/Mihnea-Serbu"
            },
            "answer_text": "They will probably dissappear. Let me explain. The current black/blue/red slab with a screen on the front face is an evolution based on the initial devices created in the 70s for voice and from 2007 by the iPhone for the apps and the multimedia content. All of them linked by the SIM and the Google /Apple account. 5G and eSIM will change something very important.: the ability of the user to move their digital avatar in the different locations of his /her life. We will be able to move the number from device to device seamingless. Then use the same account in the self driving car, the smart house, the mobile office and so on. It means that in the future phones might become niche products to use between the other devices we are going to have. That will give them the opportunity to evolve again: flexible screen or new design more easily pocketable, modules to be added or removed based on needs. ",
            "date": "Answered August 23, 2017",
            "views": "594",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mihai Movilescu",
                    "user_href": "/profile/Mihai-Movilescu"
                },
                {
                    "user_id": "Adam J. Adel",
                    "user_href": "/profile/Adam-J-Adel-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diran George",
                "href": "/profile/Diran-George-2"
            },
            "answer_text": "The far future? Most computers and smartphones will be replaced by biomicroprocessor chips that can be implanted into your body, working with your central nervous system/neurons and using the brain for additional “computing” ability and storage, assisted by a built-in neural engine/AI. You’ll be able to project images directly through your retina into your eyes, similar to Augmented Reality and like HUDs. They will also allow you to capture images through your eyes. These chips will allow have receivers and transmitters with high encryption standards, so future humans will be able to make & receive calls and hear audio through bone conduction, connect to each other and transfer information/feelings/thoughts, or connect to open/secure networks to gain access to any information available on the internet. You’ll be able to experience “real” sensations in a virtual world - even playing multiplayer games will be more lifelike. These chips will be mega efficient/green and be powered by body heat/electric fields - no more need for additional hardware, batteries or inevitable electronics waste. All parts will be easily upgradable. A cyborg revolution will take place as people move to become more and more machine like to assist and improve their lives and gain access to infinite knowledge instantly. This will lead to a world of factions (human & cyborg / cyborg only / human only) and a major event will trigger a world war between the factions. The outcome of this war, who knows. Well, this is my future of smartphones anyway. P.S. The above is a plot for a story I’m working on - if anyone steals it, I’ll know! ",
            "date": "Answered October 24, 2017",
            "views": "821",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "RAKSHITH B",
                    "user_href": "/profile/RAKSHITH-B-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arpan Panicker",
                "href": "/profile/Arpan-Panicker"
            },
            "answer_text": "The future of the smartphone is to become one with everything! Try and imagine this if you can. You have a chip embedded in your body that has your identity and data.It can transmit information directly to your retina or project it on any convenient surface nearby, if you want to share your display with someone else or if you want to give your eyes a break from immersive visuals.These surfaces range from tabletops to windows, doors, and walls.These surfaces sense your information and show you information that only you can see, thanks to your retina data personalizer.Phone calls (and all sounds) are directly routed to embedded transmitters that route voice through bone conduction without interfering with your hearing.Your neural channels are mapped to data entry and control parameters that you can watch form in your retinal map, allowing you to input information and chat/work/write Quora answers.There are cameras everywhere. At any point, you can draw up all the available images of you in this moment and pick one to customize and save as your photo/video.This chip and these sensors run on your bio-electricity and need no charging. Upgrade replacements can be done surgically depending on your budget and enthusiasm for these things.That, I believe, is the future of smartphones and all digital devices. We are probably a couple of decades away from being able to do all of this seamless, especially the biological integration. But we are well on our way! Exciting times ahead! ",
            "date": "Answered April 13, 2018",
            "views": "304",
            "upvotes": " Answer requested by M Sreenivasa Prasad",
            "upvoters": [
                {
                    "user_id": "Rakshith B",
                    "user_href": "/profile/Rakshith-B-7"
                },
                {
                    "user_id": "Arun Chennuru",
                    "user_href": "/profile/Arun-Chennuru"
                },
                {
                    "user_id": "David Chidakel",
                    "user_href": "/profile/David-Chidakel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Natasha Hook",
                "href": "/profile/Natasha-Hook-2"
            },
            "answer_text": "With data transmission rates reaching blistering speeds and the incorporation of WiFi technology, the sky is the limit on what smartphones can do. Possibly the most exciting thing about smartphone technology is that the field is still wide open. It's an idea that probably hasn't found its perfect, real-world implementation yet. Every crop of phones brings new designs and new interface ideas. No one developer or manufacturer has come up with the perfect shape, size or input method yet. The next \"killer app\" smartphone could look like a flip phone, a tablet PC, a candy bar or something no one has conceived of yet. Perhaps the most challenging consideration for the future is security. Smartphones may be vulnerable to security breaches such as an Evil Twin attack. In one of these attacks, a hacker sets a server’s service identifier to that of a legitimate hotspot or network while simultaneously blocking traffic to the real server. When a user connects with the hacker’s server, information can be intercepted and security is compromised. ",
            "date": "Answered February 14, 2016",
            "views": "712",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Atul Patel",
                    "user_href": "/profile/Atul-Patel-146"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saad Shaikh",
                "href": "/profile/Saad-Shaikh-269"
            },
            "answer_text": "The smartphone industry is changing everyday and every company is developing new features which they think is Game changer. Here is some of change which might happen according to me More Pocket Friendly Devices - Now a days size of a smartphone is getting bigger and some phones are like mini tablet and can't keep them in Pocket and sit without adjusting the phone in Pocket.Wireless Charging - Not which exist true today the wireless charging which exist today is not really wireless charging it's just like charging from power bank and even worse than charging from power bank atleast you can use your phone while charging from power bank but you can't use phone while charging wirelessly.Foldable Display - Foldable display might me implemented soon by big names in smartphone industry soon Recently Samsung Had to Call back the launch of Samsung Fold which was hyped so much because during test devices given to tech reviewers it was found there was Major issue with display. But Samsung again launched it with some tweaks.Self Charging Phone - I would love to have phone which I would not required charging as I constantly use my phone throughout the day I have to keep charge atleast 2 time a day. So it would love to have this phone.Smartphone with AI Assistant - Not like which we currently have like Siri, Alex but an actual AI Assistant which can understand natural language like Jarvis of Iron Man.",
            "date": "Answered August 7, 2019",
            "views": "173",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martha Soto",
                    "user_href": "/profile/Martha-Soto-46"
                },
                {
                    "user_id": "Sridhar Palla",
                    "user_href": "/profile/Sridhar-Palla-4"
                },
                {
                    "user_id": "Arunita Singh",
                    "user_href": "/profile/Arunita-Singh-1"
                },
                {
                    "user_id": "Meer Riz",
                    "user_href": "/profile/Meer-Riz"
                },
                {
                    "user_id": "Shruti Mishra",
                    "user_href": "/profile/Shruti-Mishra-97"
                },
                {
                    "user_id": "John Mendis",
                    "user_href": "/profile/John-Mendis-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Erickson",
                "href": "/profile/Rob-Erickson-1"
            },
            "answer_text": "The future of smartphone technology is going to be greater integration with voice assistance and the disappearance of the physical phone. Technology will get small enough that an earbud will be all that is needed. The earbud will connect to a larger centralized server that runs the virtual assistant. Screens might be an accessory but won’t be used as much. If they are it will be projected onto larger screens than what people can carry in their pocket. Articles will be read by the authors and people will interact via voice chat facilitated by the virtual assistant. One of the biggest benefits will be that people won’t be looking down as much hurting their neck. And people will feel a stronger connection with each other due to vocal communications. ",
            "date": "Answered July 28, 2018",
            "views": "318",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hitesh Barik",
                "href": "/profile/Hitesh-Barik"
            },
            "answer_text": "The future smartphones will be thinner, smarter, AR (Augmented Reality) enabled with flexible screens and seamless voice controls.  In 2008, Nokia and the University of Cambridge introduced Morph, a nano-technology phone concept that showed how mobile phones might become stretchable and flexible, enabling users to bend their devices into different shapes. Its key feature then would be the ability to bend, so it could be worn on the wrist.  In the subsequent time, we might change the parts of our smartphones according to our needs such as adding more RAM to it, adding a new and better camera or perhaps a powerful speaker. Companies like Google and Moto are attempting to bring us there with devices such as Moto Mod and Google Project Ara.  In future smartphones, we will have a faster processor, more RAM and graphics and all our data stored in the cloud there is still more possibility that we will control our smartphones through the cloud. Smartphones will come to a match with personal computers.  With the voice assistants such as Siri, Google Assistant, Cortana we will have the seamless handling of our smartphones. We will be capable of booking flights, order foods, receive directions, take pictures, use an app with no touch on the screen of our smartphone at all. Although voice assistants are in preliminary stages but are also growing at a prodigious rate and are right on par with human intelligence and this is all been possible owing to AI learning.Smartphones companies are attempting to change from a 2-D display to a 3-D display the primary occurrence of this can be observed in Apple's Retina display. ",
            "date": "Answered June 11, 2017",
            "views": "21",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anubhav Singh",
                    "user_href": "/profile/Anubhav-Singh-493"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suraj Pradhan",
                "href": "/profile/Suraj-Pradhan-95"
            },
            "answer_text": "Well before giving this answer ,I would like to pay your attention about the history of mobile phones. 20–25 years ago we all came across bulgier Nokia phones and before 10 years we came across firstly introduced smartphones that were capable to make calls,texting messages,taking pictures, browsing,and many more.  First introduced mobiles..  Mobile 10 years before.. Nowadays,mobiles like iPhone X comes with bezzleless screen,processors better than even some computers,taking 4k videos and surfing with a lot of applications..  But in future these mobiles phones are likely to replace the computers and laptops,coming with more powerful Snapdragon and mediatek processors ,browsing with more data speed {5g,6g,7g etc.}, The future mobile phones can come with a 3d portable smart display{PSD} with foldable technology giving a new reality of viewing to the screen as well as provide a better experience to the user .  And with a high quality wireless ,better long distance connecting virtual sound it will definitely give the user the best experience it can have… So let's see what the future brings in its surprise. whatever it brings sure it will be beneficial… ",
            "date": "Answered May 8, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Sweet",
                    "user_href": "/profile/John-Sweet-20"
                },
                {
                    "user_id": "Nathan Coppedge",
                    "user_href": "/profile/Nathan-Coppedge"
                },
                {
                    "user_id": "Ron Keopke",
                    "user_href": "/profile/Ron-Keopke"
                },
                {
                    "user_id": "Lior Cohen",
                    "user_href": "/profile/Lior-Cohen-31"
                },
                {
                    "user_id": "Jay Titerle",
                    "user_href": "/profile/Jay-Titerle"
                },
                {
                    "user_id": "Jordan Burns",
                    "user_href": "/profile/Jordan-Burns-6"
                },
                {
                    "user_id": "Pierce Brown",
                    "user_href": "/profile/Pierce-Brown-6"
                },
                {
                    "user_id": "Craig E. Ransom",
                    "user_href": "/profile/Craig-E-Ransom"
                },
                {
                    "user_id": "Jinesh Panchal",
                    "user_href": "/profile/Jinesh-Panchal-2"
                },
                {
                    "user_id": "Debora Cutrich",
                    "user_href": "/profile/Debora-Cutrich"
                },
                {
                    "user_id": "Aryaman Jai",
                    "user_href": "/profile/Aryaman-Jai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Khedekar",
                "href": "/profile/Pranav-Khedekar-1"
            },
            "answer_text": "Nanochips,Body embedded chips or sensors ,neurolinks,etc. the list goes on. Here are some of the ideas which can prevail in future to make mankind achieve inumerable feats! Nanochips:This chips are less than 5nm and are twice as powerful as our current chips. This save space for other components in smartphone thereby generating less heat and more power thus saving costs on cooling systems and making technology more affordable.Human embedded chips: Imagine a chip is embedded near your heart and in case it stops beating( or cardiac arrest) takes place,this chips send an message to your smartphone and automatically calls nearby hospital thereby increasing your survival chances! Wouldn't this be a great idea? But it's hazardous effects on health could be a concern.Neurolinks: Imagining a situation where you are mute or deaf but your brain is connected to your smartphone (sound's weird doesn't it?) but you want to wish your valentine ASAP wouldn't this be great? your mind will generate an impulse which will be converted into an Electronic signal and will be send to your smartphone which will analyse it and will send the message meaning you don't even have to use your hands!Handheld robots: smartphones are becoming more powerful day by day ( for eg. iPhone XS MAX is more powerful than a 2016 iMac) what if they could order groceries automatically based on our previous purchases or preferences? Or even answer calls on our behalf?(I know that Google's assistant,Siri can do it still they are in developing stage)So, this are just an few examples and technology is developing everyday and also we don't know what our future holds for us! Peace✌ ",
            "date": "Answered February 22, 2019",
            "views": "284",
            "upvotes": " Not for Reproduction ",
            "upvoters": [
                {
                    "user_id": "Jin Markov",
                    "user_href": "/profile/Jin-Markov"
                },
                {
                    "user_id": "Raghavaramananathane",
                    "user_href": "/profile/Raghavaramananathane"
                },
                {
                    "user_id": "Harshit Muchhal",
                    "user_href": "/profile/Harshit-Muchhal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ciprian Dumitrescu",
                "href": "/profile/Ciprian-Dumitrescu-1"
            },
            "answer_text": "Probably no future. Why ? because for every function the smartphone has there are already alternatives capable of doing better. The question is not how to make evolve a display by adding functions on it, but how to integrate most of these functions in a more ergonomic/natural way. Why need a smartphone anyway, when the network is everywhere ? Perhaps the smart things around will replace smartphones one day. Perhaps images can be projected on other surfaces than a smartphone displays (like anonymous objects or your retina / brain). But really, are’nt you tired to change your smartphone so frequently without having much value in return ? Are’nt you tired to pay attention not to broke it or just use his small screen ? In the next future all these questions will find answers that will radically change the smartphone the way we know it today. ",
            "date": "Answered October 24, 2017",
            "views": "43",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ritika Bharadwaj",
                    "user_href": "/profile/Ritika-Bharadwaj-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mona Agrawal",
                "href": "/profile/Mona-Agrawal-56"
            },
            "answer_text": "Future of Smartphone is going to be huge and huge! With the abruption by the Reliance Industries on the usage of internet, the activities over the mobile and internet has reached a new peek. Smartphones companies invested a tons of money on upgraded features, specifications and designs. In the near future, smartphones will have : Huge rise in demand, due to the introduction of the 5G Internet.Sleek Design due to comfort ability and class.Apps and workings based on AI.Data Visualization, which will see a new phase.But for us, as customers, we will be benefited hugely, as the advancements in the technology always comes up with new features and advantages. ",
            "date": "Answered March 26, 2020",
            "views": "123",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Subhojit Dasgupta",
                    "user_href": "/profile/Subhojit-Dasgupta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darshana",
                "href": "/profile/Darshana-45"
            },
            "answer_text": "Smartphones have become a necessity rather than luxury. More than half of the global population own smartphones. It is a comprehensive, portable device which helps in communication, data storage, and gives accessibility to huge data available from around the world. Smartphones have substituted technologies such as large desktop computers, expensive cameras, and landline phones. Presently, smartphones are available at much lower price than they were five years ago; therefore, people of all income groups can afford them. This has increased sales of smartphones across the globe. Brochure With Latest Advancements and Application @ Request for Brochure Report Smartphones are available in various sizes, price range, and supports different operating systems. People use smartphone not only for calls but also for browsing, storing data, and clicking photographs. Smartphone penetration has increased in the last two years. The smartphone market has reached market maturity in some countries. ",
            "date": "Answered July 18, 2018",
            "views": "221",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sandipan Kundu",
                "href": "/profile/Sandipan-Kundu-2"
            },
            "answer_text": "Smartphones are day by day developing more than we ever thought of. According to me in the next two decades we should not be shocked if the smart phones have the features mentioned below : Transparent smartphones- Yeah , this is still a fantasy but its very much possible. Even some companies have started developing these phones P.S.-The above picture is just an artist’s impression. Touch free interface- By that i mean you can do everything in your phone by only speaking to it.True wireless charging- Not the type of wireless charging we see in galaxy note 8 or iphone X. Soon there will be smartphones where you will just switch on a charger connected to the socket and the phone will get charge irrespective of where you are in the room.For now I can only think of these. I will update my answer when I get some new idea. ",
            "date": "Answered September 20, 2017",
            "views": "672",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Fathurahman Rasyid",
                    "user_href": "/profile/Fathurahman-Rasyid"
                },
                {
                    "user_id": "Safi Bhatti",
                    "user_href": "/profile/Safi-Bhatti"
                },
                {
                    "user_id": "Aryaman Jai",
                    "user_href": "/profile/Aryaman-Jai"
                },
                {
                    "user_id": "Milos DeBeljkovic",
                    "user_href": "/profile/Milos-DeBeljkovic"
                },
                {
                    "user_id": "Joan Ardon",
                    "user_href": "/profile/Joan-Ardon-1"
                },
                {
                    "user_id": "Prasanna Vishnuram",
                    "user_href": "/profile/Prasanna-Vishnuram"
                },
                {
                    "user_id": "Mika M",
                    "user_href": "/profile/Mika-M-42"
                },
                {
                    "user_id": "Morgan Noel",
                    "user_href": "/profile/Morgan-Noel-4"
                },
                {
                    "user_id": "Carl Glaux Llama",
                    "user_href": "/profile/Carl-Glaux-Llama"
                },
                {
                    "user_id": "Matt Mock",
                    "user_href": "/profile/Matt-Mock-4"
                },
                {
                    "user_id": "Adi Suja",
                    "user_href": "/profile/Adi-Suja"
                },
                {
                    "user_id": "Giriraj Puvar",
                    "user_href": "/profile/Giriraj-Puvar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Apoorva Sharma",
                "href": "/profile/Apoorva-Sharma-24"
            },
            "answer_text": "The role of the smartphone is really going to be huge in the future. Like from times everything was done in hard copies, computers were a revolution. They started an era that removed physical boundaries to things like letters, documents, communication, etc.But now times are changing again. Carrying the computer everywhere with you is not really a feasible option. So now it time for the smartphones to shine. Its something you carry everywhere with you. Its a basic necessity even as of today. And it will be of utmost importance in the coming future. Communication being the least of what a phone provides, it will serve as a gadget that helps you in tons of ways. M-commerce is trending and in the near future will be a primary method of payment. So bye bye cash and credit cards. All you need is a phone. Phones might have nfc tags that hold your unique identity codes that help you get along various areas or to produce identity proofs as and when need be. They can serve as a replacement to everypossible thing you carry as of now, from driving license to debit cards, cash to identity cards, its all here and its all integrated. PEACE OUT! ",
            "date": "Answered February 2, 2015",
            "views": "614",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "G V Kushal",
                    "user_href": "/profile/G-V-Kushal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucas Martin",
                "href": "/profile/Lucas-Martin-40"
            },
            "answer_text": "It will definitely be like this:  There is already a technology researched by MIT that can power up small chips in the brain and also the US Millitary is planning on giving brain implants to soldiers to improve their memory. So the future will be either the whole smartphone in the brain (in a smaller chip) or a chip as an extension of the smartphone, with which you can interact via sight/though. The future would be quiet lame if the only things that improved in smartphones were thinness and speed, don't you think? ",
            "date": "Answered June 10, 2017",
            "views": "69",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Madiha Samu",
                    "user_href": "/profile/Madiha-Samu"
                },
                {
                    "user_id": "Aman Japa",
                    "user_href": "/profile/Aman-Japa-1"
                },
                {
                    "user_id": "Sarath Menon",
                    "user_href": "/profile/Sarath-Menon-31"
                },
                {
                    "user_id": "Mp Pranesh",
                    "user_href": "/profile/Mp-Pranesh"
                },
                {
                    "user_id": "Tharun Karthick",
                    "user_href": "/profile/Tharun-Karthick-3"
                },
                {
                    "user_id": "Shasaang Saravanakumar",
                    "user_href": "/profile/Shasaang-Saravanakumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tabrez Khatri",
                "href": "/profile/Tabrez-Khatri-5"
            },
            "answer_text": "No guess because technology is getting better day by day. When we were using black and white phone. Did anyone noticed that we would be able to use a 1080hd bluray 3d effect quality Screen after some year. Yes we can say that in future we will be able to use the phones like hiw we see in 3gra3d graphic movies . Because that is possible . camera rays can detect your eye retina to unlock Screen then it is possible that we can use Electronic items seen in movies like matrix clone war . . In future smartphones can have actual HD Slr camera like Nikon, Canon, Kotak, etc Which won't blur even if u zoom for 8 pixels. We can get actual 3D speaker with loud and clear Voice with mini woofer. A Bluetooth or hotspot or wifi range which can connect 500 metre range. 4D calling, network excess even if we are on 100th Floor. Forget about phones . If our Indian experts get permission then they have the capacity that they can introduce such machines- that a man can fly. Don't even underestimate the power of a common technical student. ",
            "date": "Answered December 1, 2017",
            "views": "451",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harikiran Singh",
                    "user_href": "/profile/Harikiran-Singh-2"
                },
                {
                    "user_id": "Gurkiran Singh",
                    "user_href": "/profile/Gurkiran-Singh-10"
                },
                {
                    "user_id": "Prince Kaushik",
                    "user_href": "/profile/Prince-Kaushik-27"
                },
                {
                    "user_id": "Ayush Nair",
                    "user_href": "/profile/Ayush-Nair-21"
                },
                {
                    "user_id": "Akshat Kumar",
                    "user_href": "/profile/Akshat-Kumar-188"
                },
                {
                    "user_id": "Lakshay Agarwal",
                    "user_href": "/profile/Lakshay-Agarwal-22"
                },
                {
                    "user_id": "Ankit Gupta",
                    "user_href": "/profile/Ankit-Gupta-2840"
                },
                {
                    "user_id": "Mayank Bhatt",
                    "user_href": "/profile/Mayank-Bhatt-97"
                },
                {
                    "user_id": "Nitin Yadav",
                    "user_href": "/profile/Nitin-Yadav-585"
                },
                {
                    "user_id": "Puneet Jain",
                    "user_href": "/profile/Puneet-Jain-357"
                },
                {
                    "user_id": "Anshu Sharma",
                    "user_href": "/profile/Anshu-Sharma-360"
                },
                {
                    "user_id": "Gaurav Jeyaraman",
                    "user_href": "/profile/Gaurav-Jeyaraman-1"
                },
                {
                    "user_id": "Shivraj Jadhav",
                    "user_href": "/profile/Shivraj-Jadhav-22"
                },
                {
                    "user_id": "Danish Pandey",
                    "user_href": "/profile/Danish-Pandey"
                },
                {
                    "user_id": "Tushar Sharma",
                    "user_href": "/profile/Tushar-Sharma-986"
                },
                {
                    "user_id": "Naveen Mittal",
                    "user_href": "/profile/Naveen-Mittal-55"
                },
                {
                    "user_id": "Ramandeep Singh",
                    "user_href": "/profile/Ramandeep-Singh-662"
                },
                {
                    "user_id": "Pulkit Jain",
                    "user_href": "/profile/Pulkit-Jain-300"
                },
                {
                    "user_id": "Ravi Rana",
                    "user_href": "/profile/Ravi-Rana-155"
                },
                {
                    "user_id": "Abhishek Kumar",
                    "user_href": "/profile/Abhishek-Kumar-10321"
                },
                {
                    "user_id": "Lokendra Kumar",
                    "user_href": "/profile/Lokendra-Kumar-49"
                },
                {
                    "user_id": "Pallav Mohan",
                    "user_href": "/profile/Pallav-Mohan-1"
                },
                {
                    "user_id": "Bhavin Rajput",
                    "user_href": "/profile/Bhavin-Rajput-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiran Jagadale",
                "href": "/profile/Kiran-Jagadale"
            },
            "answer_text": "We all get excited about future of smartphones, but does your excitement be same in next 5-10 years?Let’s have a look… We all use smartphones nowadays and we also wait for new smartphones like Samsung recently launched Galaxy Note 8 and Apple will be launching new iPhone 8 in coming months, and we always get excited about new features of smartphones, but does this excitement will be same in next 5-10 years because we always want new features and always wait for new features that are new to us and change the way of using the phones every time a new phone is launched. Read More[1] Footnotes[1] Future of Smartphones ",
            "date": "Answered August 30, 2017",
            "views": "787",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubh Chaturvedi",
                "href": "/profile/Shubh-Chaturvedi-6"
            },
            "answer_text": "Smartphone is one the most powerful gadget but it's going to be the most powerful gadget because we're going to more & more dependable on this. From banking to traveling or shopping we are dependable on these smartphones. In upcoming days we will see only electric vehicles. which would be control by smartphone & believe me smartphone would be the most important thing after food & oxygen. The future of smartphone would be like the one who offers: 1: Long battery life with less charging time 2: lite weight with big screen 3: High quality camera. 4: Wireless charging & Ear plugs Apart from these three qualities smartphone is going to be very effortless to keep because no body want to hustle. That's how a smartphone is going to look in future because gone are those days when people were using smartphone just for internet & usual selfies. People of this generation wants to be more carefree. That's how we're changed. Thanks. ",
            "date": "Updated January 9, 2020",
            "views": "173",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bo Luijten",
                "href": "/profile/Bo-Luijten"
            },
            "answer_text": "Maybe you should read this article written by Tim Urban: Neuralink and the Brain's Magical Future - Wait But Why This article is about the way we (probably) will interact with technology. The whole idea of a smartphone now is to interact with each other through: Your brain > smartphone > internet > the other’s smartphone > the others brain It is a very long way of communicating with each other with a very slow way of transferring information with each other. Tim explains the way to directly communicate with each other (or the internet or Artificial intelligence) through or visual cortexes in the brain for example via an advanced neurotransmitter you implanted in your future brain. There’s no better explainer for these big questions than Tim Urban, please check out his website Wait But Why , the future is incredibly exciting! ",
            "date": "Answered July 22, 2017",
            "views": "716",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Gallagher",
                "href": "/profile/Robert-Gallagher-51"
            },
            "answer_text": "Smart phones will advance to where they are a miniature computer with no buttons to push or keys to tap. It will do almost anything by voice command, and will have real time video conferencing capabilities. You wont have to know how to work it, you will just tell it what you want to do and it respond. Directions, heartbeat/pulse rate , purchase groceries, get instructional on how to replace the water pump on your car, get medical diagnoses, or how to slice into someones chest without killing them and massage their heart to keep them alive, call your car to pick your child up from school and take him straight home, how to cook a lobster, etc. ",
            "date": "Answered October 13, 2018",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gokul Ramasamy",
                "href": "/profile/Gokul-Ramasamy-5"
            },
            "answer_text": "You are gonna just walk into a store,use an app,enter the store and pickup what you need and just walk out without waiting in a queue. Introducing Amazon Go  Slowly we are gonna move from cloud based AI to on-device AI. Huawei introduced Kirin 970,the first ever SoC with a dedicated NPU(Nueral Processing Unit),so you are gonna have a real personal virtual assistant. A personal Google Assistant,Siri and whatnot  There is tonnes of other examples… Machine learning and Artificial Intelligence is going to play a key role in the future.Once IoT kicks in not just your phone,your refrigerator,your TV,every electronic device around you is gonna be smart and interconnected. ",
            "date": "Answered December 6, 2017",
            "views": "13",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arun Chennuru",
                    "user_href": "/profile/Arun-Chennuru"
                },
                {
                    "user_id": "Casey Gunn",
                    "user_href": "/profile/Casey-Gunn-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Salman Haque",
                "href": "/profile/Salman-Haque-6"
            },
            "answer_text": "s we gaze into the future using our crystal ball smartphone app, we came up with some predictions about what phones will be like in 2050. But this is just our own idea of what might happen and we want to know what you predict! Share your thoughts with us in our comments section. Forecasting the technological future is tricky at best. Back in the 1980s, the thought of carrying around a small, portable phone seemed to belong in the realm of science fiction. Then in the 1990s, imagining a phone that would allow you to browse the World Wide Web -- something that didn't even exist until 1990 -- was outlandish. Today, smartphones can surf the Web, run applications, play games and those with a near field communication (NFC) chip can act as a transaction method for purchases. Oh, and they can still make phone calls too. ",
            "date": "Answered July 28, 2018",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vaibhav Bhatnagar",
                "href": "/profile/Vaibhav-Bhatnagar-51"
            },
            "answer_text": "The future of the smartphone is really bright, with better processors and features this race does not seem to end soon. Every brand is concentrating to provide its customers with something new which helps them to lead a simpler life. The best of screens, memory, locks, face scan, camera, quality of the sound, just everything is going under a change. You buy one model and it gets obsolete in a few months that is the speed of the industry to grow. ",
            "date": "Answered December 2, 2017",
            "views": "385",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Space of Spades",
                    "user_href": "/profile/Space-of-Spades"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pavan Kumar",
                "href": "/profile/Pavan-Kumar-2001"
            },
            "answer_text": "Martin cooper invented the mobile phone in 1973. From then onwards it evolved with mankind. Firstly we have mobile with single camera.  then with two camera..  with triple camera..  though it may be boring by now. wait till last with quadriple camera  even with five cameras ..now!  in the future .  edit:- This is my personal opinion on a lighter note and I am not promoting any brand. thanks for having patience untill last . If you have come till here kindly appreciate with the upvote which motivates me to come up with new content. ",
            "date": "Answered April 7, 2020",
            "views": "220",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Krishna Verma",
                    "user_href": "/profile/Krishna-Verma-93"
                },
                {
                    "user_id": "Rajnish Chaudhary",
                    "user_href": "/profile/Rajnish-Chaudhary-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Chidakel",
                "href": "/profile/David-Chidakel"
            },
            "answer_text": " ​​ This is kind of awful to say but the future of smartphones is that they won't be \"cool\" anymore. Pretty much everyone'll have one. It will become like - what's the big deal?  They might even become a little uncool. I can imagine kids saying \"A smartphone? Seriously? Like mom? Ugh! \" Don't worry. Something else will come along to obsess over. ",
            "date": "Updated February 24, 2016",
            "views": "811",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Souvik Chakraborty",
                    "user_href": "/profile/Souvik-Chakraborty-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Obunga",
                "href": "/profile/Jeff-Obunga"
            },
            "answer_text": " Advanced holographic capabilitiesAI (Artificial Intelligence) combined with voice and visual assistanceFoldable displaysMore computing power than most laptops / notebooksAccess to vast quantities of data and information and increased processing capabilitiesAble to power every other device in our homes, cars, offices etc. all through advanced wireless techonologyAdoption of more advanced wireless technologies (i.e. Li-Fi)Will modular composition make the impact it should have done in the market?Approach to 99% body ratio displayMore sustainable power usageMore advanced display, camera and battery technologiesHope this helps. ",
            "date": "Answered March 11, 2018",
            "views": "247",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nathan Coppedge",
                    "user_href": "/profile/Nathan-Coppedge"
                },
                {
                    "user_id": "Kiran Shaw",
                    "user_href": "/profile/Kiran-Shaw-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Maurya",
                "href": "/profile/Akash-Maurya-102"
            },
            "answer_text": "It has been a very long time since we have seen a major upgrades in mobile phones. As far as I remember when Apple has launched it's first iPhone with touch screen. Since then only there are few changes just like small processor, good processing power, bigger screen, camera improvements. there is not major change which we hade seen in upgrade to keypad to touch screens. It was an evolutionary upgrade in mobile history. We haven't seen an upgrade like this. Some improvement may be possible in near future. Foldable screen.Transparent screen.Screen projection.Replacement of mobiles with wearables.",
            "date": "Answered March 30, 2018",
            "views": "298",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ram K Reddy",
                    "user_href": "/profile/Ram-K-Reddy"
                },
                {
                    "user_id": "Arun Chennuru",
                    "user_href": "/profile/Arun-Chennuru"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishi Maheshwari",
                "href": "/profile/Rishi-Maheshwari-19"
            },
            "answer_text": "Wonderful questions! I appreciate you for this question. Do, Let's begin, Future of Smartphone is at maturity stage, it's developed in U.S.A, European union, Russia and even in India. Phones like iPhone X, Samsung Note 8 are coming and people will buy! So what do you think? Future of Smartphone is going to be at higher stage and it will book like anything as smartphones are part of life nowadays. Removing old age people groups, in India almost 66–75% people have smartphones so future is booming. They update smartphones in three years (maximum) and new models are coming so fast and aggressively user like me, going mad for it. Price matters, so smartphones market do, SWOT analysis in India will say that market and future of Smartphone in India is hot as it's in maturity stage.For Africa it will take time yet. ",
            "date": "Answered September 19, 2017",
            "views": "994",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Binu Babu",
                    "user_href": "/profile/Binu-Babu-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yvan Testu",
                "href": "/profile/Yvan-Testu"
            },
            "answer_text": "I have a device in my pocket and I use it to watch Netflix i use it to make transactions on my banking account I use it to read numerous pages and articles per day i use it to make payments at the supermarket I use it to take pictures I use it to find my way in an unknown place I use it to receive mails and I have no idea why they call it a phone Ah yes i can receive phone calls as well ",
            "date": "Answered December 28, 2017",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harshaa Vardaan",
                "href": "/profile/Harshaa-Vardaan"
            },
            "answer_text": "I think there is no future for smartphones. Why? Because you can only make smartphones thin and compact to a certain degree.Moreover it has a very small screen which is not ideal for watching TV or gaming.Instead we will head towards a future where AR technology takes over smartphones. Maybe in the distant future we will have chips implanted in our brains. ",
            "date": "Updated June 18, 2017",
            "views": "307",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rohit",
                "href": "/profile/Rohit-1580"
            },
            "answer_text": "Once Moore gave a law on size of transistor and it's processing power, but Technology went far ahead of his prediction and Today No one can predict what will be there after two year for sure. It does not mean that discussion is closed here , keeping in mind the immense possibility of brighter future of smartphone I am sure that this technologies will be made public in recent times. For instance consider Liquid cooling: Don't surprise it is not just limited to high end computers. You would be very soon having smartphone with this technology as the cover line.Not to wait too long even xiaomi made possible recently in its poco phone this is not just the end there are many more, got curious, follow here for complete list ",
            "date": "Answered November 13, 2018",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kavin raja",
                "href": "/profile/Kavin-raja-38"
            },
            "answer_text": "This is an interesting one!! Within past 4 years (2014–2018) we are seeing a major changes in smart phone industry and that too in 2018 We can really say that it’s a year of smart phones because we have seen many new inventions like apple’s notch,vivo’s indisplay finger print and popup camera and oppo popup camera and much more. So after two years by assumption we can expect the following like More and more changes in designThe full charging may happen in 15 minutes or even lesser.Foldable smartphones used in day to day life.Weight less than 100g or even less than thatso many interesting inventions are ahead of us in smart phone industry. Let’s wait and watch. PS: This is a merge answer from my previous post Kavin raja's answer to What will phones look like in 20 years? ",
            "date": "Answered September 5, 2019",
            "views": "101",
            "upvotes": " Answer requested by Avinash Hiremath",
            "upvoters": [
                {
                    "user_id": "Shruthi Somadatha Srinath",
                    "user_href": "/profile/Shruthi-Somadatha-Srinath"
                },
                {
                    "user_id": "Mounika Chithaluri",
                    "user_href": "/profile/Mounika-Chithaluri"
                },
                {
                    "user_id": "Sreeram Aravind",
                    "user_href": "/profile/Sreeram-Aravind-2"
                },
                {
                    "user_id": "Anubhav Verma",
                    "user_href": "/profile/Anubhav-Verma-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenzi Burton",
                "href": "/profile/Kenzi-Burton-1"
            },
            "answer_text": "The future of the smartphone is really bright, with much better processors and features this competition cannot apparently end quickly. Every brand is focusing to give its clients with anything brand new that will help all of them to lead a less complicated life. The best of screens, memory, hair, face scan, camera, quality of the sound, only all things are going under a change. You buy one design also it gets obsolete in a few months that is the rate associated with the business to cultivate. ",
            "date": "Answered April 12, 2020",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Babu Hillary",
                "href": "/profile/Babu-Hillary"
            },
            "answer_text": "It is possible now to operate almost all electronic equipments and or mobile phone is capable enough to do the work done by many electronic equipments. The size matters and few things were still not able to match the full utility of the original equipments like photography and computer. This is not possible since all all manufacturers are behind a thinner mobile, they believe a thinner one is the nextgen mobile and this misconcept will never help the industry to grow more further. ",
            "date": "Answered July 28, 2018",
            "views": "139",
            "upvotes": " Answer requested by Joey Mikhail",
            "upvoters": [
                {
                    "user_id": "Jonathan Ankin Dranoff",
                    "user_href": "/profile/Jonathan-Ankin-Dranoff"
                }
            ]
        },
        {
            "author_info": {
                "name": "Perry Wiersma",
                "href": "/profile/Perry-Wiersma"
            },
            "answer_text": "In the animated series Futurama, the character Amy has a cell phone so tiny that she ends up swallowing  it. Although the technology inside phones will get smaller and smaller  (think nanotechnology), don’t expect any nearly invisible phones anytime  soon. ",
            "date": "Answered December 10, 2015",
            "views": "62",
            "upvotes": " Answer requested by Wang Bin",
            "upvoters": [
                {
                    "user_id": "Chinmaya Siddarth",
                    "user_href": "/profile/Chinmaya-Siddarth"
                },
                {
                    "user_id": "Anubhav Singh",
                    "user_href": "/profile/Anubhav-Singh-493"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dhanraj Zurange",
                "href": "/profile/Dhanraj-Zurange-1"
            },
            "answer_text": "The global smartphone market has the potential to grow by 59.05 million units throughout 2020-2024, and also the market’s growth momentum can accelerate throughout the forecast amount attributable to the steady increase in year-over-year growth. Mobile Phone and Smart Phone Market Development Study of Growing Trends, Future Scope, New investment and Upcoming Opportunities ",
            "date": "Answered June 21, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Giga Geek",
                "href": "/profile/Giga-Geek"
            },
            "answer_text": "nice one…as technology evolves smartphone becomes embedded with Artificial Intelligence and becomes highly intuitive..current example is existing mobile operating systems…Alexa & Siri…who monitor all your usage pattern and then adapt for immediate response when prompted..sameway once AI becomes embedded with our devices which will be extremely sophisticated wearables…they will merge with our thinking processes and respond to our non verbal commands…thats the future of smart mobile telephony… ",
            "date": "Answered February 21, 2018",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abelc Macias",
                "href": "/profile/Abelc-Macias"
            },
            "answer_text": " smartphone has become more important in people today, we use many times sartphone nd we buy smartphone because we can get all the feature which are available in smartphone, Interesting fact thet if you are not in the current place or you want to talk tp the person or you need to spesak to someone you can always use the smartphone beacuse smartpone have better apps which makes other person to know your tears and happines. ",
            "date": "Updated August 29, 2018",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anirudh Manohar",
                "href": "/profile/Anirudh-Manohar-4"
            },
            "answer_text": "Disaster. Seriously speaking, today world is not coming to the reality. In act the reality is becoming the age of smartphones. No one is enjoying anything else than some stupid videos in youtube or useless chatting . Even a child has a smartphone. It sucks man. There is no connect with the nature with this stupid gadget. It has become a global drug. ",
            "date": "Answered February 21, 2018",
            "views": "176",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James",
                    "user_href": "/profile/James-6480"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glyn Williams",
                "href": "/profile/Glyn-Williams"
            },
            "answer_text": "The future of the smartphone is the contact lens computer: A wearable AR display,  which along with ear buds will allow us to see, hear and interact with people and software through the internet. I guess after that comes actual neural implants.  - Augmentation. Neural lace. ",
            "date": "Updated May 13, 2014",
            "views": "774",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Bishop",
                    "user_href": "/profile/Frank-Bishop-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sadie Parker",
                "href": "/profile/Sadie-Parker-1"
            },
            "answer_text": "Better user-interface, more promising, more secure, to me, this is the future of smartphones. I was reading an article yesterday about the best smartphones to buy in 2018 and I am glad this has begun to happen. Smartphones actually getting smarter. ",
            "date": "Answered January 29, 2018",
            "views": "250",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "WorkKey",
                    "user_href": "/profile/WorkKey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rudra Jaggi",
                "href": "/profile/Rudra-Jaggi"
            },
            "answer_text": "Future of smartphones is very interesting See Wrist Phone  Sliding Panel Phone  Seven-D Phone  Change Me Phone  Notebook Phone  Come out Phone  Transparent Phone  Info On Air Phone  Thanks ~RUDRA JAGGI  ",
            "date": "Answered February 21, 2018",
            "views": "154",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jameel Shariff",
                    "user_href": "/profile/Jameel-Shariff-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prathamesh Bhanuse",
                "href": "/profile/Prathamesh-Bhanuse"
            },
            "answer_text": "Smartphones are going to be instilled with AI which would help us to do any task without spending even a calorie. The camera Gonna be better, it will be competition which would be very exciting to see, as smartphones will take the place of PCs, DSLRs and what not. ",
            "date": "Answered March 29, 2018",
            "views": "140",
            "upvotes": " Answer requested by M Sreenivasa Prasad",
            "upvoters": [
                {
                    "user_id": "Urvaksh Sheriar",
                    "user_href": "/profile/Urvaksh-Sheriar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Curocudile Tobi",
                "href": "/profile/Curocudile-Tobi"
            },
            "answer_text": "There is a high possibility that every features of the actual smartphone will be improved. . Storage: the Ram will skyrocket . Today the common one enable an 8Go. In near future we will be able to get 12/16 RAM .Battery Life : We already can see it through the latest smartphone. . Camera : Huge compétition will impropre .Foldable : we can see it from Samsung’s Galaxy Fold and Huawei's mate X The Augmented reality can be a real issue for the future of the smartphone . ",
            "date": "Answered March 10, 2019",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Murali Sankar",
                "href": "/profile/Murali-Sankar-26"
            },
            "answer_text": "In my opinion, future smartphones will be having just a wireless display and a wearable band interface. The prominent hsrdwsre would be squeezed to a small square slab which could be slipped inside a pocket or be kept in the bag. Security features will be iris scanner and maybe pheromone scanner. (iSmell and eNose have been a buzzword for years now). With 5G and WiMax, speed will be much more and wireless connectivity can provide infinite storage capacity. ",
            "date": "Answered September 19, 2017",
            "views": "297",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Asaur Rahman",
                "href": "/profile/Asaur-Rahman-1"
            },
            "answer_text": "The future of smartphones is very bright.The next big thing in the tech world is AI.That's artifial intelligence.Which is most likely to play a big role in our daily life in near future.Some smartphone companies like Asus with zenfone 5Z,Huawei with P20 pro had already brought AI on smartphones.and they are simply amazing.But what we are gonna loss is the productive functions of our brain(personal opinion). ",
            "date": "Answered July 4, 2018",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abilash S",
                "href": "/profile/Abilash-S-26"
            },
            "answer_text": "Immediate future, in 6-months to an year, expect foldable smartphones to become a reality. Samsung & LG are frontrunners in this race, followed by Huawei and Apple Rumour/Imagination And in the longer term future, 2–4 years, AR/VR headsets may double up as display for our smartphones. This will be a revolution of sorts. ",
            "date": "Answered May 23, 2018",
            "views": "122",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Owings Bellora",
                    "user_href": "/profile/Owings-Bellora"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles",
                "href": "/profile/Charles-706"
            },
            "answer_text": "Thats a question you have to ask to Smartphone companies.. Basically what they do is fulfill the customer needs and their requirements.. But i have noticed their primary point to focus is camera. If they keep that aside, and perform some innovations then you will be nothing short of amazed ",
            "date": "Answered December 7, 2018",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sriharsha Palanki (శ్రీహర్ష పాలంకి)",
                "href": "/profile/Sriharsha-Palanki-శ్రీహర్ష-పాలంకి"
            },
            "answer_text": "Smartphones may look like this (scene from a popular movie)  (A PDA modelled on the Iron Man phone in the Avengers movie)     Smartphones may also look like this: (a smaller version, because this image is a TV)  ",
            "date": "Answered September 20, 2020",
            "views": "71",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Urvaksh Sheriar",
                    "user_href": "/profile/Urvaksh-Sheriar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregg Gray",
                "href": "/profile/Gregg-Gray-1"
            },
            "answer_text": "There are custom models that shoot bullets. I'm sure somewhere someone has made one into a mini stun gun. They are about as packed as they can get them right now. Even with improvements in technology I don't think we will see much more function in them, just better ways to do it. Perhaps one day we will be able to prick our finger and put a drop of blood on the camera lenses for analysis instead of going to the Doctor as much. There are apps out there that read vital signs, blood oxygen, and lipids already. ",
            "date": "Answered February 21, 2018",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dragan Evgen Grasic",
                "href": "/profile/Dragan-Evgen-Grasic"
            },
            "answer_text": "The prices of smartphones will be going down. There will be better processors and more ram and more powerful batteries than flagships phones have today - for much less money. The difference between Android and Apple iPhones will be even greater in future. Today we have 5 cameras on top Android and iPhone 11 Pro only has 3. iPhone will become de-facto mid range hardware but Apple will still be harvesting top of the range purchasing prices. Apple share will shrink even more. Apple will start to push cheap SE models which will be cheaper but still too expensive when compared to Android peers. Android will be pushing the envelope as before. Xiaomi and Oppo will challenge Samsung for market domination. Eventually we will see Huawei coming back with a alternative OS. ",
            "date": "Answered December 2, 2019",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karan Gowda",
                "href": "/profile/Karan-Gowda-4"
            },
            "answer_text": "Complete bezelless Full screen biometric sensor Nfc(for sharing) Completely waterproof(not water resistant) Ruggedness Mst (for payments) 128 bits And lithium ion battery that needs to be charged only once or twice a year Now that is the future ",
            "date": "Answered May 8, 2018",
            "views": "313",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aayushi Dadhich",
                    "user_href": "/profile/Aayushi-Dadhich-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Hartmann",
                "href": "/profile/Brett-Hartmann"
            },
            "answer_text": "Do you really need the answer to that. Since the introduction of the computer changes have been small but consistent. Smartphone will the the same. Faster more effentient cpu More Memory higher resolution displays longer life batteries You get the idea little steps until things become quite different to user needs ",
            "date": "Answered February 23, 2018",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dipak Kumar",
                "href": "/profile/Dipak-Kumar-1422"
            },
            "answer_text": "Transparent or like a thin glass frame, because now a days technology is spreading rapidly and the future will be depend on technology so the things will defenately would be change and we will see the result. ",
            "date": "Answered September 20, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alex Smirnoff",
                    "user_href": "/profile/Alex-Smirnoff-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Berry Thomas",
                "href": "/profile/Berry-Thomas-6"
            },
            "answer_text": " According to the question, actually the modern use of technology this days has made alot of things looks more easier and faster so it is likely that cell phone becomes the most important thing that people are going to caring about due to some kind of technical software on most phone this days. ",
            "date": "Answered May 29, 2019",
            "views": "53",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Rick Chapman",
                "href": "/profile/Rick-Chapman-4"
            },
            "answer_text": "Their transformation into bendable, scrollable, wearable strips. Rick Chapman Managing Editor and Publisher, Softletter Author: Selling Steve Jobs’ Liver. A Story of Startups, Innovation, and Connectivity in the Clouds” “In Search of Stupidity: Over 20 Years of High-Tech Marketing Disasters” “SaaS Entrepreneur: The Definitive Guide to Succeeding in Your Cloud Application Business” ",
            "date": "Answered May 28, 2018",
            "views": "119",
            "upvotes": " Answer requested by Jonathan Ankin Dranoff"
        },
        {
            "author_info": {
                "name": "Vaibhav Sharma",
                "href": "/profile/Vaibhav-Sharma-2012"
            },
            "answer_text": "I guess that there won't be any cell phones in the future, instead everything would be fitted in the eyes of a person via smartglass or eye lens which would show them their screens in front of their eyes and interaction would be by brain sensing. ",
            "date": "Answered February 22, 2019",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Indrajeet",
                "href": "/profile/Indrajeet-32"
            },
            "answer_text": "Android smartphones with the best battery life (January 2019) Some people might think that the most important feature in a smartphone is its display size. ... The smartphones of the future I envision would combine OLED and e-ink technology into one, likely killing dedicated e-readers. ",
            "date": "Answered July 8, 2019",
            "views": "21",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Big Boss",
                "href": "/profile/Big-Boss-243"
            },
            "answer_text": "I hope that oneday vendor create a smartphone with more sophisticated sistem that can prevent the phone from facing the lagging or stuck that happening now and has more advanced features like voice assistant like bixby,faster facial recognition,better camera and well-priced ",
            "date": "Answered November 12, 2017",
            "views": "58",
            "upvotes": " Answer requested by Valerio Cietto"
        },
        {
            "author_info": {
                "name": "Bharathi Dasan",
                "href": "/profile/Bharathi-Dasan-156"
            },
            "answer_text": "Stretchable phones Flexible displays will be the next big thing in future smartphone technologies. With Samsung Galaxy Fold, Royole FlexPai and Huawei Mate X, we have already seen the trailer. In future, you might be able to stretch or decrease the size of smartphone display according to your needs. ",
            "date": "Answered February 28, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Amu S",
                "href": "/profile/Amu-S-4"
            },
            "answer_text": "Well a few rumored specs of 2019 upcoming smartphones are: 1> fold able devices : What we know so far about Samsung's foldable phone (Updated November 9) 2> side mounted finger print scanners : [CompareRaja EXCLUSIVE] First Leaked Renders of Sony Xperia XZ4 Compact | Versus By CompareRaja 3> 5 rear cameras for 3D imaging : Best new phones expected in 2019 ",
            "date": "Answered December 7, 2018",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony Martin",
                "href": "/profile/Tony-Martin-51"
            },
            "answer_text": "Far future smartphones won't exist as a separate handheld device and will be implanted into our bodies or on some type of wrist strap with integration into our Optical and auditory nerve system ",
            "date": "Answered October 13, 2018",
            "views": "21",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Sha",
                "href": "/profile/Sha-338"
            },
            "answer_text": "Project ara will rewrite the smartphone industry.  The way we talk about laptops now like 4gb ram 500gb hard drive,  i5 processor will be the same in case of smartphones in future. ",
            "date": "Answered December 10, 2015",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kelly Zheng",
                "href": "/profile/Kelly-Zheng-32"
            },
            "answer_text": "Full ScreenScreen fingerprint identification5GAIGraphene cell (In a longer term)www.vanstardigital.com ",
            "date": "Answered May 23, 2018",
            "views": "146",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Bhavin Ganatra",
                "href": "/profile/Bhavin-Ganatra-2"
            },
            "answer_text": "This is the future you might see in the smartphones.  Tell me which one do you like in the comments section. ",
            "date": "Answered July 7, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Gulshan Singh",
                "href": "/profile/Gulshan-Singh-249"
            },
            "answer_text": "Future smartphones will be fully touch no body at all exept touch And the camera of smartphone will beat any dslr ",
            "date": "Answered July 2, 2018",
            "views": "71",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ravi Kanyal",
                "href": "/profile/Ravi-Kanyal"
            },
            "answer_text": "If you have seen movie Ironman ?? you know about jarvis ??? A character in ironman (Google it, if you don't know. ). Yes! That is the future of smartphone….. In future you going to see a complete new concept of smartphone . ;) ",
            "date": "Answered March 29, 2018",
            "views": "87",
            "upvotes": " Answer requested by M Sreenivasa Prasad"
        },
        {
            "author_info": {
                "name": "Sandeep Rao",
                "href": "/profile/Sandeep-Rao-12"
            },
            "answer_text": "The future of smart phones should be like contact lenses. The screens comes up where you are looking at. Something like hololens but much better. ",
            "date": "Answered April 3, 2016",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tathagat Arya",
                "href": "/profile/Tathagat-Arya-1"
            },
            "answer_text": "I can’t see any more innovations but that may be because I’m not creative enough. I think smartphones will just get better and more efficient rather than add new features. ",
            "date": "Answered February 21, 2018",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Damion Freeman",
                "href": "/profile/Damion-Freeman-1"
            },
            "answer_text": "I'd think that there will be a device that is a transmitter and people will use vr sets for interaction and always be using video chat. The phone itself will not matter. ",
            "date": "Answered October 10, 2018",
            "views": "9",
            "upvotes": " Answer requested by Markus Bel"
        },
        {
            "author_info": {
                "name": "Faheem Ahmed",
                "href": "/profile/Faheem-Ahmed-318"
            },
            "answer_text": "Now Sony is preparing a rollable smartphone. The time has come, when Sony responded to Samsung and HUAWEI. That will be able to easily take over everywhere, like pencil smartphone. This smartphone from Sony could launch early next year. HERE ITS LINK Sony is preparing a rollable Smartphone. ",
            "date": "Answered October 29, 2019",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Urvaksh Sheriar",
                "href": "/profile/Urvaksh-Sheriar"
            },
            "answer_text": "no bezels, in-display camera, 4k screen, fingerprint sensor in-display, all-screen display, glass body, 5G network, 1 rear camera; wide-angle, portrait mode, manual mode, 8X zoom, 20+mp, and this, folks, is my prediction ",
            "date": "Answered August 7, 2019",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "Let’s leave this open-ended. But I would look into omniscience applications, the rudimentary basis of which is free to develop with citation of Nathan Coppedge or Nathan Copedge, philosopher visible in the product / software: OMNI-SCIENCE The Programmable Heuristics may have many technology applications: Guessing questions.Objective knowledge.General problem-solving.Psychic predictions.Formula for creativity.Formula for the souls of literature.Secondary heuristic combinations.",
            "date": "Answered March 4, 2018",
            "views": "176",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Hong Nguyen Ngoc",
                "href": "/profile/Hong-Nguyen-Ngoc"
            },
            "answer_text": "The future of smartphone is that it will be disapeared! It will be replaced with (more comvenient) portable/embeded devices. ",
            "date": "Answered July 17, 2017",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Clickon Gadget",
                "href": "/profile/Clickon-Gadget"
            },
            "answer_text": "Artificial Intelligence and Augmented Reality applications, 5G are the futuristic applications and advancements for smartphones. ",
            "date": "Answered May 8, 2018",
            "views": "161",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ken Just",
                "href": "/profile/Ken-Just-3"
            },
            "answer_text": "It was a phone without a Physical keyboard, 3.5 mm jack. It will be a phone without a screen. It's time to eliminate the screen. ",
            "date": "Answered March 6, 2019",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nitish Kumar",
                "href": "/profile/Nitish-Kumar-2955"
            },
            "answer_text": "I Think future smartphone is so cool & awesome. It is change our life. Future smartphone may be transparants ,battey less,& outstanding. What's your? ",
            "date": "Answered March 30, 2018",
            "views": "33",
            "upvotes": " Answer requested by M Sreenivasa Prasad"
        },
        {
            "author_info": {
                "name": "Massey T Ruth",
                "href": "/profile/Massey-T-Ruth"
            },
            "answer_text": "The future Nokia 2030 would be scratch-resistant and small, at only 2 x 4.75 x 0.25 inches and have a touchscreen. Oddly, it still has a physical phone number pad. Even with a super thin glass screen. ",
            "date": "Answered April 4, 2016",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anmol Thakur",
                "href": "/profile/Anmol-Thakur-46"
            },
            "answer_text": "The technology is increasing day by day…you can observe in previous year will http://now….so I think it's gonna take place inside our body and we will made like a robot ",
            "date": "Answered December 1, 2017",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bruce Weigand",
                "href": "/profile/Bruce-Weigand"
            },
            "answer_text": "After 40 years of use and many phones, I can say remember the Jetsons tv series and the sky is the limit! ",
            "date": "Answered October 13, 2018",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sudipto Roy",
                "href": "/profile/Sudipto-Roy-71"
            },
            "answer_text": "Extremely sorry can't give you any information about that ",
            "date": "Answered May 23, 2018",
            "views": "42",
            "upvotes": " Answer requested by Jonathan Ankin Dranoff"
        },
        {
            "author_info": {
                "name": "Tulika Jaiswal",
                "href": "/profile/Tulika-Jaiswal-3"
            },
            "answer_text": "Drink warm lime water with 1 teaspoon of honey everyday. This will really help. you can do some morning belly excercise . Most importantly you need to take care of proper diet. Have salad more and chapatis exclude rice from your diet. Try this out for a month. ",
            "date": "Answered March 29, 2018",
            "views": "117",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George Smith",
                "href": "/profile/George-Smith-1399"
            },
            "answer_text": " Xiaomi Mi MIX Alpha. ",
            "date": "Answered October 10, 2019",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben And Gwen",
                "href": "/profile/Ben-And-Gwen"
            },
            "answer_text": "Extinction. ",
            "date": "Answered February 21, 2018",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Renu Rai",
                "href": "/profile/Renu-Rai-4"
            },
            "answer_text": "Good ",
            "date": "Answered December 25, 2014",
            "views": "92",
            "upvotes": "0"
        }
    ]
}