{
    "title": "What are the main differences between 4G and 5G? - Quora",
    "tags": [
        "5G (wireless communication)",
        "4G (wireless communication)",
        "Telecommunications",
        "Wireless Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leo Ueno",
                "href": "/profile/Leo-Ueno"
            },
            "answer_text": "5G is the 5th version or iteration of wireless cellular data transmission technology. Main differences include speed and wavelength. Speed While some networks claim an 20 fold improvement in speed over 4G, that is just the theoretical numbers, which are far from reality and unrealistic. That being said, there is still a noticeable, significant change in speed over 4G. In the most optimal conditions speeds up to 1Gbps+ are possible, but usual speeds will be around 100–200 Mbps. Wavelength Most deployments of 5G use a technology called millimeter wave. That uses a much higher spectrum of radio frequencies. 4G uses frequencies around 5–6Ghz and 5G uses 24–96Ghz. While that increases throughput, (speed) it also allows signals to deteriorate much faster. While 4G may work fine through walls and shrubbery, with 5G, you will see a significant drop in signal range and speed. Some reports by 5G users even claim that rain has a detrimental effect on the speed. ",
            "date": "Answered June 4, 2020",
            "views": "71",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charity Melchor-Stophel",
                    "user_href": "/profile/Charity-Melchor-Stophel-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Smith",
                "href": "/profile/Daniel-Smith-2680"
            },
            "answer_text": "4th generation connectivity is very common in the modern world. But things are changing continuously. The incapability of 4G to manage the huge number of connections has resulted in the arrival of 5G. 4G was introduced in 2009. Now it is 2K20 and everyone is in need of connection with great capacity. 5G is extensively believed to be smarter and more efficient than 4G. It is expected that 5G would be more efficient than 4G. The delivery speed can be up to 100 gigabits per second. Well, in that case, 5G can be ~100 times faster than 4G. Low latency is the main difference between 4G and 5G. The advancement of technology has made it possible for 5G to fix bandwidth issues. The congestion is expected to be eliminated which could be the major difference between 4G and 5G. 5G would be the catalyst for establishing a connection between humans and machines. ",
            "date": "Answered January 24, 2020",
            "views": "574",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Green",
                    "user_href": "/profile/Tim-Green-80"
                },
                {
                    "user_id": "Hasan Dilshad",
                    "user_href": "/profile/Hasan-Dilshad"
                }
            ]
        }
    ]
}