{
    "title": "What would Martin Heidegger say about modern technology? - Quora",
    "tags": [
        "Martin Heidegger (philosopher, author)",
        "Philosophy",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cheng Wen",
                "href": "/profile/Cheng-Wen-17"
            },
            "answer_text": "Thanks for the request. As you might know, Heidegger is quite repulsed by the advancement of technology and writes about it in a foreboding manner. Technology enframes our perception of nature, making it seem like a tool instead of something that we should admire and preserve. The most relevant field that will come under Heidegger’s attack would be the development of AI. Recently, I browsed some videos from TED and found that there were quite a number of speakers who voiced out concerns over the ethical issues of developing AI. If Heidegger were to be present today, he would probably be one of the main proponents of such apprehension - that one day we might end up in mercy of the AI, and the human race becomes enframed into mere tools for further development. The representative of his view would be Stanley Kubrick’s 2001: A Space Odyssey. For other fields such as computer and internet, Heidegger will most likely talk about how the computer has been misused to fulfil the proper social functions that could have been done on flesh. He would probably warn about the dangers of internet immersion, and the confusion of virtual reality with the actual one. I believe he will be accepting of the invention of computers, but as someone who is concerned of finding the core essence of things (he did that throughout Being and Time for Dasein), he would most likely be very concerned about how to retain the core functionality of computers (for data processing, communication etc.), while being averse to the changes that the computer will be adapt to. Essentially, you can think of Heidegger as an old man romanticising about how technology should serve us, and how things were as compared to the now. ",
            "date": "Answered March 2, 2017",
            "views": "36",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": " Warren McAlpine Jr.",
                    "user_href": "/profile/Warren-McAlpine-Jr"
                },
                {
                    "user_id": "Michael Masiello",
                    "user_href": "/profile/Michael-Masiello-1"
                },
                {
                    "user_id": "Matthew Moppett",
                    "user_href": "/profile/Matthew-Moppett"
                },
                {
                    "user_id": "Michael Oxenrider",
                    "user_href": "/profile/Michael-Oxenrider"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Richards",
                "href": "/profile/Justin-Richards-10"
            },
            "answer_text": "One of the things that concerned Heidegger about the advance of technology was the pace at which new technologies are introduced, and this has only accelerated with the ever increasing modernization of technology. When one appropriates a technology, ne becomes technologized. When we learn to use a keyboard and a mouse we enter into a relationship to the world that is dictated by the keyboard and mouse. Right now, my ability to communicate to you is mediated through my interaction with these two devices. My speech, as typed speech, moves in way that is distinct from speaking, and from the act of writing, it has a different fluidity to it. I have to stop typing, grab the moue and correct typos (or not). This is not necessarily a bad thing, but, learning to type displaces these other forms of communication, to a certain extent. And, learning to type was awkward at first, only later to become relatively easy, I am not as distracted from communicating by the act of typing as I once was. All appropriation is at first inauthentic, and can only with time become authentic - and this is one of the biggest issues for Heidegger with technology. Consider how long people have been writing, several thousand years. During this time human civilizations were able to authentically appropriate the act of writing, which still approaches every child learning to write as something inauthentic. There is a place and a meaning and a culture of writing within most cultures today, as we learn to type, and depend on typing more and more, the traditions of writing are becoming displaced. When was the last time you hand wrote a letter? Why bother when we can just e-mail someone immediately? Does not the mediacy of such communication lessen its importance? When you write a letter, you think about what you should say, what you want to say, and what you want to leave unsaid, the timeliness of its delivery (especially before modern mail delivery systems) placed a special importance on what was being communicated, and on the act of such communication. One begins a letter “Dear” and ends it “sincerely”, there is a certain comportment towards letter writing. Compare this with the way that some people write e-mails. They just write what they have to say, they do not address it to someone they care about, they don’t emphasize the sincerity of their words in the absence of physical presence and facial cues. They just say, here is the information you requested, you know who I am and I know who you are and we do not need to address each other. Sometimes we don't even bother to write an e-mail, we can just text after all. What destruction of the traditions of language are carried out with text messages! The problem is not the technology itself, it is our ability to authentically appropriate the advances of technology (leaving aside the question of the concealment of Being, the enframing of technology), the destruction of tradition at the hands of such advancement, and the technologization of the individual who uses technology. A hammer technologizes the individual every bit as much as a keyboard and mouse do, I tell you this as a person who wears tool belts and has hammers on hand quite frequently, to a person with a hammer everything appears as something to be potentially struck. What does the world appear as to a person technologized by computers? Does it not appear as something to be posted, to be commented upon, to be upvoted, downvoted, liked, loved, emojied, muted, or deleted? We do not even need philosophers to call into question this addiction to posting pictures and videos on social media, we have commercials for products that promise to free us up to enjoy the moment at the same time that we document and share that self same moment. Our very ability to be present is being concealed by the technologization of ourselves through our use of computers. And yet, here I am, using a computer to talk about this exact problem. Does not the inauthenticity of certain ways of appropriating technology point towards possible authentic appropriations of technology? Absolutely. The difference between authentic and inauthentic writing does not have to do with the technology used to create it but with the ability of the speaker to effectively communicate through story or scholarly discussion. Quora is absolutely full of this kind of writing, authentic stories expressed through the mediation of modern technology. Experiences shared across time and space and through barriers of language. Elucidations of the most complex ideas, and recommendations for further readings. It is not the what that matters but the how. My professor used to talk about the Amish people, a very Heidegger approved people, and how they rejected telephones until the invention of the cellular phone. They rejected the telephone because they didn’t want the sanctity of hearth and home to be interrupted, but recognized the usefulness of a portable communication device, and, the fact that the phone could be turned off when interruption was undesirable. The Amish do not reject all modern technology out of hand, as many people think they do, but, they meditate, discuss and pray concerning which technologies they should and should not allow, because they know that, good or ill, technology affects the user of that technology. ",
            "date": "Answered March 6, 2017",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nabalde Rechelle",
                    "user_href": "/profile/Nabalde-Rechelle"
                },
                {
                    "user_id": "Alpay Bayraktar",
                    "user_href": "/profile/Alpay-Bayraktar-1"
                },
                {
                    "user_id": " Warren McAlpine Jr.",
                    "user_href": "/profile/Warren-McAlpine-Jr"
                },
                {
                    "user_id": "Bradley Erwin",
                    "user_href": "/profile/Bradley-Erwin-1"
                },
                {
                    "user_id": "Lino Wirag",
                    "user_href": "/profile/Lino-Wirag"
                },
                {
                    "user_id": "Desmond James",
                    "user_href": "/profile/Desmond-James-7"
                },
                {
                    "user_id": "Patrick Caughron",
                    "user_href": "/profile/Patrick-Caughron"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lino Wirag",
                "href": "/profile/Lino-Wirag"
            },
            "answer_text": "When talking about Heidegger and technology you most consider his notion of the so-called “Gestell” (rack/frame): If you can read German you will find more information here: Martin Heidegger – Wikipedia ",
            "date": "Answered May 10, 2017",
            "views": "439",
            "upvotes": "0"
        }
    ]
}