{
    "title": "What makes Tesla cars unique? - Quora",
    "tags": [
        "Tesla Model S",
        "Battery Electric Vehicles (BEV)",
        "Elon Musk",
        "Electric Vehicles",
        "Electric Cars",
        "Tesla (company)",
        "Automotive Industry",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lealand Young",
                "href": "/profile/Lealand-Young"
            },
            "answer_text": "Tesla’s big claim to fame is proving the viability of an electric passenger vehicle and that there is a market big enough to support it. Tesla’s Supercharger Network is also the most extensive charging network in the US as well. In my opinion most unique aspect is their manufacturer direct sales which eliminates the usual manufacturer to dealer then customer sales model. The primary benefit to Tesla is that it allows them more margin per vehicle. Tesla claims up to a 30% profit on its various models compared to the average single digit returns most of the industry sees with the exception of some manufacturers like Porsche or Ferrari which usually see much less than Tesla’s claimed 30%. Manufacturer direct sales also saves Tesla money since they don't have to support an extensive dealer network (a considerable amount of cash goes between the two entities as they support one another). Another unspoken benefit is that since Tesla isn't beholden to a dealer network they can cater more to the end user as in the manufacturer to dealer model the dealer is the actual customer and they hold considerable sway of what a manufacturer produces and can sometimes create a confusing array of vehicles as the dealer attempts to capture as many sales as it can (for example when Pontiac was around the majority of dealers demanded an economy model for the “excitement” division despite Chevrolet existing in the hierarchy for just such a vehicle and Pontiac supposedly from more upscale offerings . GM catered to the dealers and supplied them with a sales dud). As far as engineering Tesla uses better than average electronics when it comes to processing capability with high density boards (manufactured by Nvidia as I recall) that allow for faster processing and affords them an edge when it comes to implementing some features like its “autopilot” They are or were on top of the battery game as well but this is an area that sees continual improvement so somebody else might be wearing that hat now. Tesla vehicles are mostly novel for an extremely low center gravity owing to the battery pack located on the bottom of the vehicle which gives it some fairly interesting characteristics when it comes to handling. Another neat feature by dint of being electric - performance isn't effected by altitude. A Tesla runs as hard at sea level as it does at the top of Pikes Peak (with further advantage gained by less drag at higher elevation however slight it might be). That said, for the more conventional automotive aspects (chassis and body and so on) Teslas tend to be average in many aspects and below average in others. And most importantly and unique not in a good sense is Tesla’s manufacturing system which is largely inefficient despite Tesla’s claimed extensive use of robotics. Bob Lutz correctly observed that Tesla has a 9,000 person workforce with the capacity for turning out only about 150,000 or so vehicles a year right now which makes them highly inefficient compared to their more established peers. Mercedes for example uses a highly refined and almost completely automated assembly line for some of its models with humans only really used for tasks that require more dexterity and problem solving than a robot can afford. BMW with its i3 city car approached the problem of low volume and profitability in several novel ways like absolutely pairing waste to a minimum at every level of manufacturing and recycling as much as they can (the roof on an i3 for example is made from the trimmings cut from other parts) or its use of diecast chassis components to reduce machining operations. ",
            "date": "Answered September 20, 2018",
            "views": "604",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Zucco",
                    "user_href": "/profile/Frank-Zucco"
                },
                {
                    "user_id": "Dan Colestock",
                    "user_href": "/profile/Dan-Colestock"
                },
                {
                    "user_id": "Jeff Armstrong",
                    "user_href": "/profile/Jeff-Armstrong-35"
                },
                {
                    "user_id": "Kelly Voss",
                    "user_href": "/profile/Kelly-Voss-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosario D'Souza",
                "href": "/profile/Rosario-DSouza"
            },
            "answer_text": "I don’t usually write such articles. Let me tell you little bit about myself so that you can understand the significance of me writing such an article... I don’t like buying expensive things. What’s more, I positively hate buying hugely expensive things. When my wife says, “Honey, let’s buy this expensive dining table,” I ask, “What wrong with the inexpensive one we have right now?” When she says, “Let’s buy a new set of bedroom furniture to replace this set that we’ve had for the past 22 years, I turn to her with a deadpan expression, and ask, “Why?” Before I bought my spanking new Tesla Model 3, I owned two cars – a 1999 Honda Odyssey EX (with 140K miles) and a 2004 Honda Accord EX (with 70K miles). I was very happy with these cars, and had no intention of buying another. I watched Tesla from a distance, and always considered the Model X and Model S outside my modest budget. In all these years, it’s not that I couldn’t afford to buy a new car. I could pay cash for one if I wanted to. But I saw no need to buy a new car – because they offered me nothing more than what my existing old cars already provided me. Then one day, my wife said, “SRP (our local electric power company) is hosting an EV (electric vehicle) event. They will have all kinds of hybrids and EVs available for display and test drives.” You can see my wife has become incredibly smart when it comes to dealing with me. No more, “Let’s buy a ...” Instead, it has become a, “Let’s look at ...” And what man can resist test driving cool, new technology? So we went to the SRP event. We got lots of data. Now I am a natural analyzer of data. You put data in front of me, and I began to analyze it – just like how a monkey grabs a banana in front of him and eats it. So I came home from the SRP event and began to analyze the data, and do some of my own research. I ended up buying a Tesla Model 3 the very next day! It just made a lot of sense to do so. I’ve written this article so that you can benefit from my research, and enjoy the experience of driving a Tesla too. If you’re like me, when you leave home for work in your car, you are probably thinking about your workday, and it is quite possible that you will forget to close your garage door. How nice if your car can detect that you are driving away from home, and shut your garage door automatically as you drive away. Similarly, when you are arriving home, how nice if your car is able to recognize when you’ve reached, and open the garage door at just the right time. You will be pleasantly surprised to know that Tesla cars do just that! When it rains – and especially when it rains sporadically – you have to turn on your wipers, and then keep adjusting them to the correct speed so that they take the water off your windshield quickly enough, and yet not go on wiping when there is no water. Keeping on top of that can be such a bother. Wouldn’t it be convenient to have the wiper automatically sense the water on your windshield and wipe it off, and stop when the water is gone? You guessed it – Tesla cars do just that! When you are driving on a dark, divided highway at night, using high beams is a must. What’s a bother is that, as a good citizen, you must dim that high beam every time a car approaches from the opposite direction. If the traffic is frequent but sporadic, doing this can become a tiresome chore. It would be so convenient if your car could do that automatically. Once again, Tesla cars do just that! Welcome to the grand experience of driving a Tesla! It seems as if Tesla has analyzed every aspect of driving a car, and built a car that makes driving as pleasant and convenient as possible, using the latest technologies available. To explore this in more detail, let’s take a look at what one typically does with and in their car, and examine how Tesla makes it better. When you are on the highway, what does driving entail? You must steer to keep within the lane. You must slow down if there is a car in front of you, and accelerate to your cruise speed when the road ahead is clear. You need to determine whether your lane is slower and a lane change will save you time. Occasionally, you need to change lanes. If your trip requires you to change highways, you need to be alert to that and make the change at the proper time. If an ambulance or police car appears behind, you need to move to the side, and slow down or park. Your Tesla Model 3 will do all of that for you automatically (except for the last one, which is expected to be available soon). If you cross lanes without using your turn signal (this happens when people are sleepy), an alarm will sound. And yes, you can indeed configure your Model 3 to even tell you when changing to a different lane will allow you to go faster due to reduced traffic in that lane. How cool is that? While you’re on a surface road, what does driving entail? You must do things similar to highway driving. In addition, you must watch for signals and traffic signs, and pedestrians and other objects that may be in your path. Your Tesla offers you adaptive cruise control whereby it will slow down if there is a car in front of you, and accelerate to your cruise speed when the road ahead is clear. This single facility, when done well (which is how Tesla does it), can simplify driving significantly. If you use your turn signal to indicate that you want to change lanes, you will be notified if it is unsafe to do so. If a crash is imminent when adaptive cruise control is on, an alarm will sound. Your Tesla will also show you objects (cars, motorcycles and people) around you. What’s more, on most well-marked surface roads, your Tesla will also steer automatically for you too. However, right now, you own stopping at traffic signals and signs, but that too will be taken care of soon. Whether you are on a highway or a surface road, as the speed limit changes, you need to change your cruise control speed limit to account for this change. That is such a bother. But Tesla has a solution! Since your Tesla car knows the speed limit of the road that it is on, it allows you to set your car to go at that speed limit, or a set miles above or below it; as a result, when you have traffic aware cruise control on in a Tesla, you no longer have to think about whether you are too fast or too slow – the car will automatically adjust your maximum cruise speed to the set limit relative to the current speed limit of the road, and slow down as little as possible when another car is in front of you. Brilliant! When you want to park, what does driving entail? Well, there usually are three options: parallel parking or perpendicular parking or angled parking. Angled parking is simple and needs no assistance. When perpendicular parking, it is preferable to park with the front facing outwards. You need to spot a location as you drive by, and then park. Parking is easy if there are no cars in adjacent spots, but difficult otherwise. Your Tesla will automatically spot a suitable location as you slowly drive by, and will automatically park for you if you so desire. If you are parking manually, your Tesla will tell you how far objects around and close to you are in precision of inches. If you are about to hit something it will tell you to stop. So cool! What’s more, if your garage is small, or you are trying to fit too many cars in it and you don’t have enough place to open a car door while parked, Tesla allows you to stand near your car and move it forward or back remotely. So you can pull it out of the garage to a place where there is more space and then enter it. Oh, I just love that! One of the complexities of driving is figuring out ‘how to get there.’ Google has made this easier through Google Maps. But using it in a car is cumbersome – you are stuck with the small screen of your smartphone. Tesla cars have a 15” (or bigger) touchscreen monitor that displays maps and directions in 60% of the screen area – big enough to see your location and direction and path to the destination, and the surrounding area. You can give it a specific address, and it will direct you to it. If you want to find a certain place (e.g. a Chinese restaurant nearby, or a Tesla supercharger, or a ChargePoint charger) you can ask (i.e. speak to it), and your Tesla will show you several options (potential destinations), and after you select one, it will give you step by step driving directions to it, and show you the surrounding area (with labels for what’s there) on a screen that is about ten times bigger than your smartphone. Further, it knows how much battery charge you have left, and will also include necessary Tesla supercharger locations at intermediate destinations so that you don’t run out of battery. It solves your navigation problems (i.e. your problems of finding a suitable destination (such as a particular type of restaurant in an unfamiliar place), and how to get to there) – all without touching a dial. Better still, wherever you are, you can simply say, “Navigate to home” and it will show you how to go home. At the end of a long and tiring day, I find that rather comforting. A key part of the driving experience is keeping yourself and your guests entertained as you drive. You want variety (i.e. different types of music and radio and podcasts) and flexibility (i.e. different sources of content like streaming, smartphone, USB, etc.). Most of all, you want ease of use (no fiddling around with buttons and dials to find the content you want). In a Tesla, you can listen to music or radio or podcasts from your USB, or your smartphone (via Bluetooth), or via streaming radio, or from music distribution sites. But that’s not all! While driving, when you think of a song you want to hear, you don’t want to be fiddling around trying to find it on your USB drive or smartphone or on some streaming site. That’s downright dangerous. Ideally, you just want to say something like, “Play Jailhouse Rock by Elvis Presley,” and presto, the song should start playing. You can do that in your Tesla! When streaming, you can ask your car to play almost any song (just like you do with Amazon’s Alexa) – you don’t have to touch a dial to get content. Needless to say, moving to the previous or next song, pausing your song, or adjusting volume can all be accomplished without taking your hands off the steering wheel. Similarly, when you want to make a phone call to someone in your smartphone contacts, you can simply say, “Call Mom,” for example, and your Tesla will initiate the call to the phone number labeled ‘Mom’ in your smartphone contacts. No searching for, and selecting, ‘Mom’ on some screen. Of course, all the while, your phone remains in your pocket or purse. That is the power of voice recognition technology, and Tesla makes excellent use of it. Another uniquely wonderful thing about Tesla cars is that the software that gives the car its smarts can be updated over the air (OTA) – you don’t need to go to a service center to do it. Due to the practicality of OTA updates, your car becomes smarter as time goes by, and your driving experience continually improves – and (this is so cool!) you don’t have to pay more for this. You can use your Tesla’s front camera as a dash cam. It saves the video to a USB stick you put in. This dashcam functionality came in a recent software update, and is a perfect example of the value of over the air (OTA) software updates. Someone in Tesla had the bright idea of using the front camera as a dash cam. They implemented the functionality and added an icon to the touchscreen, and updated the owner’s manual, and voila, without any hardware update or recall, you now have valuable new functionality without having to pay for it. In addition, Tesla cars like the Model 3 simplify controls by replacing almost all controls with a graphical user interface (GUI) operated by a touchscreen. This allows for an highly configurable car. This also reduces cost and assembly time because you have fewer buttons and dials to buy and install. This also reduces maintenance. For example, you will never have to deal with issues like having the cruise control buttons stop working (I had to have these replaced in my past cars). In addition, this also allows for a dynamically changing user interface that grows as the car’s capability grows; specifically, a touchscreen GUI interface allows Tesla to add new features to, and improve existing features in, the GUI as time passes by, giving car owners a continually increasing value for their initial expense. Further, the chances of recall are reduced because fixes can be sent via OTA updates, saving Tesla even more money. Other neat features of Tesla cars are: the safety rating is at the top of the list; the car handles superbly due to its low center of gravity, they have excellent acceleration and instant response, allowing you to get out of danger when needed; the drive is unusually smooth due to no engine vibration; they have all wheel drive, giving you excellent traction on uneven surfaces; and finally, having no engine in the front allows crush space to absorb the energy of the collision better than ICE cars and hybrids. Further, the dual motors increase traction, and reliability – if one motor goes bad you can still drive the car on the other one to a repair shop. Tesla cars come with a thick tinted glass roof that meets all safety requirements. Glass has far better thermal insulation than metal. Therefore, your car will absorb less external heat and cold via conduction, and it will take less energy to keep your interior temperature constant even when it is very hot or cold outside. The tint sufficiently prevents too much sunlight (and harmful UV radiation) from entering into the car. You can use an aftermarket tint to make this even better. Tesla provides you with a smartphone app that serves as a Bluetooth based key. But that’s not all… With it, you can unlock the car just be approaching it, and lock the car just by walking away from it. You can also lock or unlock it remotely. The app also allows you to move the car forward and back while standing near it (enabling you to get out of a tight parking spot, for example). You can open the (rear) trunk, front trunk (or frunk), doors and charge port with it too. You can even set the internal temperature of the car with it so that you can cool the car down on a hot day, or warm it up on a cold day, ready for you to enter in and drive in comfort. You can set the battery charge limit with it so that the car will charge only up to that point. You can see the current charge. You can get notified when the charge limit is about to be reached. You can view the location of the car – which is a big theft deterrent. You can set the maximum speed limit of the car – which is useful when you loan it to a teenager. You can put the car in valet mode – which limits its functionality (e.g. the glove box cannot be opened and the configuration cannot be changed). You can flash the lights or honk the horn – this helps you locate the car if you have forgotten where you parked. What a useful app! I like going camping, and sometimes going all alone to ‘get away from it all’ for a few days. However, doing that in the height of summer, or depth of winter, can deter getting a good night’s sleep, because a tent doesn’t offer much insulation from the heat or cold. Using an RV is out of the question because it is simply too expensive. But now that I have a Tesla whose rear seats fold flat with the trunk, I can actually sleep in the car. I can keep the cabin at a balmy 72 degrees throughout the night, typically losing only ~10-15% of the charge. And I don’t need to worry about the battery getting too low if I camp in an RV site with 50 amp power outlets because I can charge my car while I sleep. I can’t do this in an ICE car because the battery is too small to last the night, and I can’t keep the engine on all night because its noise will disturb other campers. Soon after I bought my Model 3, I bought a 4” thick folding foam mattress that forms a very comfortable bed in my Model 3 , and made camping reservations at many of Arizona’s state parks that offer RV camping throughout the year. Next year, I will go even further. In fact, in this way, I can travel throughout the US on a cheap budget and answer the call of the sky (you may be familiar with the poem ‘Wander-Thirst’ by Gerald Gould). No other car can do all these things, and do them as well as a Tesla. Now you may think, “All this is great, but isn’t this an expensive car?” Yes it is an expensive car – but only if you take a shortsighted perspective! If you consider the cost of purchasing and maintaining and repairing the car over its lifetime, it can actually be cheaper than an ICE or hybrid car. This may not be very obvious, so let me explain... When you buy an EV (electric vehicle) instead of an ICE (internal combustion engine) car or hybrid, one of the key savings over the life of the car comes from significantly less maintenance for the EV. Simply speaking, an EV just has a battery, an inverter, and one or two induction motors. These need little maintenance over the life of the car. An EV doesn’t have an ICE, and because of that, it has no transmission, no starter system (i.e. no starter motor, solenoid, Bendix gear, etc.), no gasoline fuel system (i.e. no fuel pump, fuel filter, etc.), no fuel injection system (i.e. no engine air filter, carburetor or fuel injector, etc.), no ignition system (i.e. no spark plugs, distributor cap, etc.), no exhaust system (i.e. no exhaust manifold and gasket, catalytic converter, muffler, resonator, etc.), and no generating system to keep the battery charged (i.e. no alternator, solenoid, etc.). You have no emissions tests, no oil changes, no transmission fluid changes, no engine air filter or fuel filter changes, and so on. Fewer things can go wrong, and fewer things need regular maintenance. Even the brakes last longer because EVs have regenerative braking – the car slows down as soon as you take your foot off the accelerator. This saves you time (the time to keep your car well maintained) and money – lots of it (at least $15K, and perhaps even $20K) – over the life of the car. For example, over the life of the car (~20 years) you will save $2K on oil changes, $3K on transmission and steering wheel fluid changes, $3K on brakes, 0.5K on emissions testing, $0.2K on air and fuel filters, and perhaps $7K - $10K on other things that go bad. When compared to a well-equipped Tesla Model 3, buying an ICE will cost you about $10K - $30K less in the initial purchase. But buying an EV will give you $7.5K federal tax credit (or maybe just half of that now). Furthermore, many states also offer incentives to buy an EV. For example, Arizona has lowered the registration fee for an EV by as much as $500 / year, and so a five year registration will cost you just $150 instead of $2.5K. At the time of my writing, California offers a tax credit of $2.5K, and Colorado offers a tax credit of $5K. These incentives can shave off ~$10K from the cost. Another significant cost associated with a car is what you pay for fuel. EVs are a big winner here too. Electric motors are far more efficient than ICEs (~80% vs. ~20%). It turns out that in most places, the cost of electricity to drive a given number of miles in an EV is much less (half to one eighth) than the cost of gasoline for an ICE car. As a result, with an EV, you also save on the cost of fuel. Further, if you have solar installed in your home, you utility company will typically sell you electricity at an even lower cost. For example, in Arizona, I get electricity at the cost of ~4 cents per KWh during off peak hours (vs ~8 cents per KWh if you have an EV but no solar). As a result, it costs me less than $5 to charge my Model 3 to 90% of its full range of 310 miles. To go that far on gasoline would cost me ~$40. If you fill up every two weeks you save just under $1K per year, or ~$18K over the lifetime of the car (assuming the cost of gasoline stays around the same over all those years). As you can see, when taking into consideration the savings on incentives, maintenance, repair and fuel, an EV can be a whole lot cheaper than an ICE or hybrid car over its lifetime. If you are in the market for a new car, you have three broad choices: an electric vehicle (EV), an internal combustion engine (ICE) vehicle, or a hybrid of the first two. If you want a car that you will take on long trips (and who doesn’t want such a car?) then the only EVs that makes sense are ones from Tesla. No other car company that sells EVs has a supercharger network that can almost fully charge your car in under an hour, and an EV that has a range of over 300 miles on a single charge (as is the case for a dual motor Tesla Model 3). Multi-hour charging on a road trip kills the fun in the trip and makes long trips inconvenient. Hybrid cars have an ICE as well as a (smaller) battery. This allows you to get the range of an ICE when you want to take long trips, and the cheap fuel advantage by using the battery for short trips. Most hybrids also qualify for the $7.5K federal tax credit. However, since hybrids have all the components of an ICE car as well as all the components of an EV, maintenance costs for a hybrid will be more than for an EV, and also more than for an ICE car. Hybrids are also more expensive due to their many components. For these reasons, a hybrid is not as good an option as a Tesla EV. Perhaps this was why Chevy decided to stop producing the Volt. EVs (and Tesla EVs in particular) have many other benefits. For example, EVs allow fine control of the speed and the torque of the electric induction motors that turn the wheels. They also respond almost instantaneously. This makes it easier to provide automatic driving capabilities like adaptive cruise control (aka Traffic Aware Cruise Control for Tesla cars), auto steer, auto lane change, auto parking, and remote control (aka ‘Summon’ for Tesla cars). Tesla cars have one of the best ‘autopilot’ features I’ve seen in a car. As mentioned earlier, the ‘summon’ feature is useful if you have a small garage or if you have parked in a space that is so tight that there is no room to open the door of the car to get in. One cool feature of EVs is regenerative braking. Normally, the battery powers the induction motors that power the wheel. However, when you take your foot off the accelerator, the car’s momentum keeps it moving forward, and the wheels now power the motor which now generates electricity and feeds it back to the battery. Powering the motor causes the wheels to slow down much faster, and this is called regenerative braking. In ICE cars, the energy is wasted (because having the wheel drive the engine doesn’t result in the creation of gasoline) whereas in EVs the kinetic energy of the car can generate the electricity that is used to power the battery. When used well, regenerative braking reduces the use of the actual brakes significantly, making it possible for the brakes to last for up to double or triple the lifetime of brakes in ICE cars. An EV without a supercharging network is like Laurel without Hardy. To make long trips feasible in an EV, fast charging (90% charge in under an hour) along the way is a necessity. Most other companies that build EVs are just figuring this out. However, Tesla already has its supercharging network fully functional and established in the US, Western Europe, China, Japan, Taiwan, South Korea, New Zealand, and southwestern Australia. This network is still growing rapidly. Using a supercharger is very simple – just park so that the charge port is near the charge connector, open the port and stick the charger in. Then you can walk away and do other stuff. You can monitor your charging status via your phone app. Further, your phone app will notify you when you are nearly done, and also when you are done. While charging, no one can unplug you. There is no credit card to swipe, and nothing to pay. It is all taken care of behind the scenes because the charge port can recognize your car, and it knows your credit card number, and will automatically charge the correct amount to it. You can view the details later via your app or by logging into your Tesla account. What could be more convenient than that? EVs are almost silent, and therefore, on quiet roads, your music and media experience is far better than that of ICE cars (ICE cars and hybrids have a noisy engine and undesirable vibrations even after muffling the sound). With Tesla’s superb premium sound, you can really rock and roll as you drive. All Tesla cars have drag reducing door handles that also contribute to the silent drive. Some people have expressed concerns about how long a Tesla’s battery will last. Tesla has an eight year, unlimited mile, warranty on the battery. I read somewhere that the battery will lose ~5% charge in 10 years. That’s not bad. Other stats say that the battery will last for the lifetime of the car without too much degradation. To ensure long battery life, only charge the battery to full capacity when you are about to go on a long trip; for normal commute don’t go beyond 90% charge. Also, don’t supercharge too often. Tesla is a recent car company – it came on the scene only about a decade ago, but it competes with companies that have built cars for decades. It doesn’t spend on advertising – at least, I haven’t seen any Tesla ads in the USA. Yet, of the ~135 car brands that sold sedans in the US in December 2018, the Tesla Model 3 ranked fifth highest in sales. That tells you something – people are beginning to recognize the value of buying a Tesla Model 3! Unless the car was exceptional, such a thing wouldn’t have happened. In the interests of full disclosure, I must also tell you that Tesla cars have no spare tire. However, if you ever have a flat, you can call Tesla roadside assistance for help to repair the flat. Assuming you normally fix your own flats, this can make flats a painful experience, but on the other hand, flats don’t occur too often. In the past 25 years of driving, I’ve had only one flat. For those of you who must have a spare tire, Tesla does give you the option of buying a spare and keeping it in your trunk. Finally, among the three Tesla cars: the Model X, the Model S and the Model 3, the Model 3 has the best price, the best range / price ratio, and the best engineering. It is among the best selling sedans in 2018, and a Detroit magazine voted it the car of the year for 2018. This is very significant because Detroit is the home of ICE cars, and Michigan doesn’t allow Tesla to sell cars there. Further, people who have driven the top cars over several decades swear that the Model 3 is the best car ever for its price. Yes, it is relatively slower and smaller (i.e. it doesn’t accelerate as fast as the Model S, and doesn’t have as much space as the Model X), but how many people want a bigger, costlier, very fast car anyway? Taking all this into consideration, it seems to me that an EV beats out an ICE car or a hybrid, and among EVs, Tesla cars are the best, and among Tesla cars, the Model 3 is the best in many ways. Hope this answers your question. Edit: Tesla has recently begun a new referral program. If my answer has helped you decide to buy a Tesla, if you care to, please use my referral code: https://ts.la/rosario38710 when you purchase your Tesla. You will get 1000 free supercharger miles. ",
            "date": "Updated March 24, 2019",
            "views": "12",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akash RP",
                    "user_href": "/profile/Akash-RP"
                },
                {
                    "user_id": "Clara Smith",
                    "user_href": "/profile/Clara-Smith-101"
                },
                {
                    "user_id": "Jim Dale",
                    "user_href": "/profile/Jim-Dale-7"
                },
                {
                    "user_id": "Michael Smith",
                    "user_href": "/profile/Michael-Smith-1171"
                },
                {
                    "user_id": "Philip Wong",
                    "user_href": "/profile/Philip-Wong-6"
                },
                {
                    "user_id": "Salil Joshi",
                    "user_href": "/profile/Salil-Joshi-8"
                },
                {
                    "user_id": "Vince Mendenhall",
                    "user_href": "/profile/Vince-Mendenhall"
                },
                {
                    "user_id": "B Ramakrishna",
                    "user_href": "/profile/B-Ramakrishna-5"
                },
                {
                    "user_id": "Matthew Schwartz",
                    "user_href": "/profile/Matthew-Schwartz-3"
                }
            ]
        }
    ]
}