{
    "title": "What would happen if every computer in the world crashed and never came back? - Quora",
    "tags": [
        "Doomsday",
        "Hypothetical Question",
        "The World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Dillard",
                "href": "/profile/Steven-Dillard"
            },
            "answer_text": "It would be catastrophic, of course. Every nuclear facility would become uncontrollable, and there would be numerous meltdowns. All the airplanes would fall out of the sky. Trains and cars and all forms of transportation except pretty old vehicles would become unworkable. Those that were moving would crash. The rest would become unusable. Most communications would stop. NO phones. No email. No snapchat. No nothing. Businesses and government would grind to a halt. The electrical grid would go down. Dams would be uncontrollable. Factories would be unusable. The economy would take a huge hit. There would be massive starvation, as we could no longer grow the food we need, since tractors wouldn't work. People would probably have to move to the country and start growing food by hand. There would be massive riots as people fought over land.  A lot of people would die, but people would start going back to the way we did things before computers: by hand. We would write on paper and calculate with abacuses. We would cultivate with hoes and shovels. We would ride bikes and horses.  We would analyze things on paper and with brute force calculations.  It's a dystopic vision, and not one I think is really worth thinking about. It is highly unlikely. Hard to imagine what could bring such a world about. But disastrophists like this kind of scenario, and I think they like to own compounds in Montana, and they have stored lots of food for such an eventuality. They also have a lot of guns to protect themselves against the riots and people who would steal what they have. I suppose it'll be good if some people survive, but it'll be better if the disaster never happens. ",
            "date": "Answered July 19, 2014",
            "views": "64",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adhi Reddy Tilak",
                    "user_href": "/profile/Adhi-Reddy-Tilak"
                },
                {
                    "user_id": "Onesmus Nefeke",
                    "user_href": "/profile/Onesmus-Nefeke"
                },
                {
                    "user_id": "Johan J Ingles - Le Nobel",
                    "user_href": "/profile/Johan-J-Ingles-Le-Nobel"
                },
                {
                    "user_id": "Cristian M. Ioan",
                    "user_href": "/profile/Cristian-M-Ioan"
                },
                {
                    "user_id": "T.J. SnackAttack",
                    "user_href": "/profile/T-J-SnackAttack"
                },
                {
                    "user_id": "Mei Douthitt",
                    "user_href": "/profile/Mei-Douthitt"
                },
                {
                    "user_id": "Huyền My",
                    "user_href": "/profile/Huyền-My-1"
                },
                {
                    "user_id": "Jeff Fuhrman",
                    "user_href": "/profile/Jeff-Fuhrman"
                },
                {
                    "user_id": "Punit Soni",
                    "user_href": "/profile/Punit-Soni-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexandru Marton",
                "href": "/profile/Alexandru-Marton"
            },
            "answer_text": "To name a few examples of things that would cease to exist: 1) There would be no internet anymore. 2) Mobile phones would be useless, the networks they run on would disappear over night. 3) All digital cash would disappear. This would mean that we need to go back to cash/gold to trade. The speed at which trade occurs would be slower as people and processes will need to be setup and regulated. It would cause an economic crisis that would make the 2007/2008 banking crisis seem like a walk in the park. 4) Logistics systems would break down. A lot of computers and robots are used in logistics, without those packages will be delivered to the wrong addresses more often, go lost, even be stolen by staff. 5) For a while television networks would also be down. In particular those that have switched to digital transmissions. Add the entire chaos that will arise because people won’t know what’s happening… and basically you end up with an apocalyptic scenario (worth making a series about). ",
            "date": "Answered August 1, 2016",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abdul Aziz Muhammad",
                    "user_href": "/profile/Abdul-Aziz-Muhammad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Carr",
                "href": "/profile/Tom-Carr-1"
            },
            "answer_text": "We would eventually get back to an economy based on the technology of the  1950's, before we had computers.  We would have cars, trains, tractors, more simple radio and TV and movies.   There  would be less easily available oil, because we have used so much of it.   Probably half the world's population would starve and then we would be back to the population of the 1950's  and could use that technology to feed those left alive, but we would have to do it with  less oil. ",
            "date": "Answered August 8, 2014",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Rice",
                    "user_href": "/profile/Martin-Rice-15"
                },
                {
                    "user_id": "Huyền My",
                    "user_href": "/profile/Huyền-My-1"
                },
                {
                    "user_id": "Trace Doyle",
                    "user_href": "/profile/Trace-Doyle"
                }
            ]
        }
    ]
}