{
    "title": "What are the things that can be done by a Raspberry Pi? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Shivam Mittal",
                "href": "/profile/Shivam-Mittal-94"
            },
            "answer_text": "Well as you might probably know, Raspberry Pi is small palm sized computer that runs on Debian based Linux OS. So, it can possibly do anything that a computer can do. 1. You can play videos, hear songs and play games on it by attaching an external display to it. 2. As it has GPIO ( General Purpose Input/Output) pins on board, it gives you ample of opportunities to use it more than hearing songs and seeing videos such as: You can connect PIR motion sensors output to GPIO pins and write a python script to detect a human presence anywhere.You can make a toy RC car or helicopter or drones that can be used for surveillance or click a selfie of you if you attach a Pi camera with a drone.You can use it as a cloud storage space as it has Ethernet/Wi-fi port on board.You can make a water level controller using an ultrasonic sensor for you home.In few words, I would like to say “You can automate everything your mind wants you to do”. *Bonus fact: Two augmented Raspberry Pi computers (called Astro Pis) were flown to the International Space Station (ISS) as part of British ESA Astronaut Tim Peake’s mission (Principia Mission - Astro Pi). They are both equipped with the mighty Sense HAT that can measure the environment inside the station, detect how it’s moving through space, and pick up the Earth’s magnetic field. Each Astro Pi is also equipped with a different kind of camera; one has an infrared camera, and the other has a standard visible spectrum camera.For more information about it, you can go to: (Astro Pi Mission - Astro Pi) So I think, now you can easily evaluate it’s limits… ",
            "date": "Answered August 28, 2017",
            "views": "551",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mikko Rivio",
                    "user_href": "/profile/中不聪-非一休-Mikko-Rivio"
                },
                {
                    "user_id": "Hamza Rafi",
                    "user_href": "/profile/Hamza-Rafi-7"
                },
                {
                    "user_id": "Joshua Conway",
                    "user_href": "/profile/Joshua-Conway-5"
                },
                {
                    "user_id": "Radu Revutchi",
                    "user_href": "/profile/Radu-Revutchi"
                },
                {
                    "user_id": "Warren Kelly",
                    "user_href": "/profile/Warren-Kelly-4"
                },
                {
                    "user_id": "Gurudev Hassan Prasad",
                    "user_href": "/profile/Gurudev-Hassan-Prasad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanjeeb Dey",
                "href": "/profile/Sanjeeb-Dey-1"
            },
            "answer_text": "There are infinite uses of the Raspberry Pi. The sky is truly the limit with it. Here are a few things that can be done with it. You could use it to make: a web servera network drivea dedicated machine for downloadinga media centerrobotsa portable PCdesign a home automation systemcontrol devices through interneta wireless printera Retro game player",
            "date": "Answered November 15, 2015",
            "views": "224",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hamza Rafi",
                    "user_href": "/profile/Hamza-Rafi-7"
                },
                {
                    "user_id": "R R Yohith",
                    "user_href": "/profile/R-R-Yohith"
                },
                {
                    "user_id": "Pradeep Kanyal",
                    "user_href": "/profile/Pradeep-Kanyal"
                },
                {
                    "user_id": "Jaime Carnevale",
                    "user_href": "/profile/Jaime-Carnevale"
                },
                {
                    "user_id": "Daniel Ortega",
                    "user_href": "/profile/Daniel-Ortega-68"
                }
            ]
        }
    ]
}