{
    "title": "What are the differences between the technology now and 50 years ago? - Quora",
    "tags": [
        "History of Technology",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pranav Prabhu",
                "href": "/profile/Pranav-Prabhu-15"
            },
            "answer_text": "Well, when you say technology, there are a lot of forms of technology. Everything newly discovered or newly created is the development of technology. So, I’ll give you one of my favorite choice. My favorite form of technology is….. AUTOMOBILE INDUSTRY (AUTO TECH) The automobile was first invented and perfected in Germany and France in the late 1800s, though Americans quickly came to dominate the automotive industry in the first half of the twentieth century. Henry Ford innovated mass-production techniques that became standard, and Ford, General Motors and Chrysler emerged as the “Big Three” auto companies by the 1920s. Manufacturers funneled their resources to the military during World War II, and afterward automobile production in Europe and Japan soared to meet growing demand. Once vital to the expansion of American urban centers, the industry had become a shared global enterprise with the rise of Japan as the leading automaker by 1980. The 1950s were pivotal for the American automobile industry. The post-World War II era brought a wide range of new technologies to the automobile consumer, and a host of problems for the independent automobile manufacturers. The industry was maturing in an era of rapid technological change; mass production and the benefits from economies of scale led to innovative designs and greater profits, but stiff competition between the automakers. By the end of the decade, the industry had reshaped itself into the Big Three, Studebaker, and AMC. The age of small independent automakers was nearly over, as most of them either consolidated or went out of business. A number of innovations were either invented or improved sufficiently to allow for mass production during the decade: air conditioning, automatic transmission, power steering, power brakes, seat belts and arguably the most influential change in automotive history, the overhead-valve V8 engine. The horsepower race had begun, laying the foundation for the muscle car era. Automobile manufacturing became the largest industry segment in the US, and the largest ever created; the US auto industry was many times larger than the automotive industries of the rest of the world combined. By 1960, one-sixth of working Americans were employed directly or indirectly by the industry, but automation and imports eroded the need for such a large workforce within a couple of decades. The 1950s were the pinnacle of American automotive manufacturing and helped shape the United States into an economic superpower.  Autonomous and electric cars, connectivity, and ridesharing are changing the way auto industry players think about value chains, data analytics, and manufacturing. Behind all the talk of robo-cars, electric vehicles, and increased car connectivity is a focus by major car companies on serving customers’ more intricate technological needs. In this episode of the McKinsey Podcast, senior partners Asutosh Padhi and Andreas Tschiesner speak with McKinsey’s Simon London about how four trends—autonomous driving, connectivity, electrification, and ridesharing—are paving the way for entirely new forms of mobility. Credits: Automobile History American automobile industry in the 1950s - Wikipedia How the auto industry is preparing for the car of the future ",
            "date": "Answered November 23, 2018",
            "views": "896",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anne Bynum",
                    "user_href": "/profile/Anne-Bynum"
                },
                {
                    "user_id": "Stuart Vealey",
                    "user_href": "/profile/Stuart-Vealey"
                },
                {
                    "user_id": "Dawn Donyou",
                    "user_href": "/profile/Dawn-Donyou"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayden Ye",
                "href": "/profile/Ayden-Ye"
            },
            "answer_text": "Over the past few years, the buzz surrounding VR has reached an all-time high. Without exception, everyone who hears about VR technology is interested on some level, and because of this and its many uses, some have already started using VR technology. Currently, VR technology has been welcomed by a few gamers, educators and others; most people are still waiting for further development before widespread adoption occurs. This is largely due to the fact that VR is a nascent technology with supporters that believe VR has the potential to improve and revolutionize many fields including education, business, research, military, therapy, travel, art, design, to name a few. Now let’s take a look at the history of Virtual Reality and Virtual Reality headsets. Intro to VR Development  Although the technology is new, the term virtual has been used since the 1400’s to mean “being something in essence or effect, though not actually or in fact”, this is the earliest usage of the word as fits into a modern context and is a forerunner of the meaning of virtual that people understand today. (Of course, it would be almost 600 years before the birth of modern VR technology and VR headsets). In 1938, playwright Antonin Artaud used the phrase “réalité virtuelle” in a collection of essays he published to comment on the illusory nature of characters and objects. He believed that audience members of a play should suspend disbelief of the truthfulness of the story and see it as reality- a theme still used in VR today. Then in 1958, his works were translated and published in English as “The Theater and its Double”, this is the earliest use of virtual reality. VR Development 1960-2000 From my research, I’ve discovered that the earliest form of virtual reality came in 1962 when Morton Heilig built the Sensorama. It was a device that the user sat in-front of while their head was encased on four sides by a screen and they watched any one of five films, which all engaged sight, sound, smell and touch. Because the apparatus pre-dated digital computers, it was mechanical.  In 1968, Ivan Sutherland and Bob Sproull created the first head-mounted display (HMD) system for immersive simulation applications. Being that it was the first HMD both quality of the interface and realism of the simulation were rather low, and it weighed so much that it had to be suspended from the ceiling by metal cables. From the 1970s to the 1990s, the VR industry mainly provided devices for medical, flight simulation, automobile industry design, and military training purposes. NASA also made significant contributions during this time, specifically through their artist in residence David Em, who made navigable worlds for NASA’s jet propulsion laboratory. In 1979, Eric Howlett developed the Large Expanse, Extra Perspective (LEEP) optical system. Users were impressed by the system because of its sensation of depth that was created by the stereoscopic imaging and large field of view and corresponding realism. The LEEP system was redesigned for use by NASA in 1985 and is still the basis for most virtual reality headsets. Atari founded a lab for virtual reality research in 1982, but it closed down two short years later due to the North American video game crash of 1983. However, this is still a pivotal time in VR history because of big names in the VR community, such as Tom Zimmerman, Scott Fisher, Jaron Lanier, Michael Naimark and Brenda Laurel, were employed there (all early believers and later pioneers of VR). By the 1980s, Jaron Lanier popularized the term virtual reality and founded VPL Research. They created many VR devices including, the Data Glove, the EyePhone, and the Audio Sphere. When they licensed the data glove to Mattel to create the Power Glove, this is one of the first instances of an affordable VR device that was readily available to the general public, costing just $75 USD.  The 1990s saw a boom in both augmented reality and virtual reality, giving users a more sensory feel and for the first time allowing them to see their own body in relation to others in the room. In 1991, the first cubic immersive room dubbed ‘the cave’ was developed by a PhD student in her thesis. This breakthrough created a multi-projected environment and allowed people to see their bodies in relation to others in the room. During the period of 1989-1992 Nicole Stenger created the first real-time immersive movie named “Angles”. Data glove and high-resolution goggles were used to view the experience. Due in large part to these breakthroughs, the first commercial releases of consumer headsets occurred starting in the 90s. In 1991, Sega released Sega VR headsets for arcade games and the Mega Drive console. In 1994, they released the Sega VR-1 motion simulator arcade attraction which tracked head movement. In 1995, Nintendo developed the Virtual Boy console, and lastly, in 1999, entrepreneurs tried to create what they called ‘the rig’ or a prototype of computer monitors that users would wear on and around their shoulders. VR Development 2000- Present Since the year 2000, there has been continued growth in VR technology and is arguably the period with the most tremendous innovation since VR’s inception. In 2001, SAS Cube created the first PC based cubic room that then led to the development of Virtools VR pack, a library pack add-on. After its 2007 release of Google Street View, in 2010, Google introduced stereoscopic 3D mode for Street View. This allowed users to stand on the street and physically look around the 3D image. It was also in 2010 that 18-year-old Palmer Luckey created the first prototype of Oculus Rift, the famous VR headset. It was the first time a 90-degree field of vision was used, and the new Oculus Rift headset relied on the processing power of a computer to render its visuals. This reinvigorated interest in the VR space. 2012 was also a big year for Palmer Luckey, he launched a Kickstarter campaign for Oculus Rift that raised $2.4 million USD in funding. Two years later, in 2014, Facebook bought Oculus VR company for 2 billion USD. 2014 was an exciting year for the VR community. Not only was Oculus VR company purchased by Facebook, but Sony announced their VR headset for the PS4 under the name ‘Project Morpheus’. 2014 was also the year that Samsung announced the Samsung VR gear that would eventually be released in 2016. In 2016, HTC Vive, Oculus Rift and PlayStation VR were all released. It is also the first year, many say, that VR became accessible to consumers in their own homes for gaming and media entertainment. All headsets had accompanying hand-held devices that allowed for movement and use of hands when interfacing with VR. Because of how pricey the VR headsets and handsets were, most of the VR users in 2016 were underwhelmed with the VR’s affordability. It’s also important to note that June 2016 is the birth month of Veer! 2017 was the year that bridged the gap between expectations and reality. In 2016, many were excited about VR potential, but thought that the content was sparse and the price of VR headsets too expensive. In 2017, Sony bundled PS4 consoles with PSVR headsets in order to attract more users. This fact paired with Oculus’ summer sale of hardware spurred the purchasing of VR headsets and gear. 2017 is also the year that Microsoft entered the VR industry.  This past September Oculus hosted the OC5, their annual conference detailing hardware, software and content innovation in VR. At the conference they announced: The Oculus Quest, available in Spring 2019, which is their first all-in-one headset with positionally tracked controllers; an exclusive Star Wars game that allows the player to take up a lightsaber like a Jedi; and a professional-grade, set ready 3D/360 camera created in partnership with Facebook and RED. At the E3 video game conference, HTC announced an adapter for the Vive to make it wireless which is set to launch this summer. Veer’s Place in the History of VR Throughout my research, and subsequently this list, I found a distinct lack of information about VR platforms. While most are focused on hardware and content, there is only one real platform that allows for the viewing of VR content through the internet, that platform is Veer. Veer VR is a pioneering global VR content community that was founded in June of 2016. It allows content creators to upload content such as pictures and videos in 360 degrees, and also allows them to access VeeR Editor to edit their content. However, the site isn’t just limited to creators but also allows users to access what has been uploaded thereby expanding interest in VR and VR’s user base. Users don’t need to have headsets to enjoy content using the Android or iOS apps and can also use their computer monitors to explore all the 360 VR videos and pictures on the site. However, because Veer is partnered with Oculus, Windows, Vive, Xiaomi, Oculus Go, Samsung Gear VR, and Daydream are VR headsets all compatible with the site. Veer aims to be the preeminent platform for sharing high-quality digital VR content that also helps to create an inclusive international VR community.  Do you like VR videos and immerse yourself in a VR World? Check out VeeR VR, feel free to follow and request me any 360 or/and VR relevant questions! :) ",
            "date": "Answered November 23, 2018",
            "views": "655",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pranav Prabhu",
                    "user_href": "/profile/Pranav-Prabhu-15"
                }
            ]
        }
    ]
}