{
    "title": "What is audio conferencing? - Quora",
    "tags": [
        "Web Conferencing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurence Chandler",
                "href": "/profile/Laurence-Chandler-1"
            },
            "answer_text": "Audio Conferencing is fundamentally a phone call for more than two participants with fluid entry and exit for each participant. If using a service such as Powwownow: Hassle Free Conference Calling or Drum - Free Instant Web Meetings - Drum for an audio conference, you are likely to take the following steps: Create accountLocate the appropriate dial-in number (rates vary!)Identify the host pin (your pin to enter the conference) and the guests pin (your guests pin to enter the conference)Share the dial-in numbers with your attendeesDial the number and enter the pin!You will also join, have a lovely conversationIts all pretty simple. They are designed to join more than two people on the same phone call. ",
            "date": "Answered January 22, 2019",
            "views": "350",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Reve Systems",
                "href": "/profile/Reve-Systems-4"
            },
            "answer_text": "An audio call with more than 2 participants can be termed as audio conferencing. Audio conferencing is different from a traditional phone call. In a traditional phone call, all participants dial into a central system that connects them instead of directly dialling each other. Audio conferencing helps in communications and collaboration simultaneously. Many audio conferencing products come with online collaboration elements standard or optional, like screen-sharing capabilities, to further increase the value of audio meetings. There are two types of audio conferencing: Point-to-point: The point-to-point conferencing system enables two people located in different locations to collaborate and communicate.Multipoint conferencing systems: This has the ability to facilitate communication and collaboration for three or more people located in different placesFor audio conferencing to occur, all participants must install a conferencing software in their devices( PC/Laptop/tab/phones). The devices for conferencing should also have speakers and microphones, and a stable data connection. ",
            "date": "Answered September 18, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}