{
    "title": "What is the Air Force's TACP training like? - Quora",
    "tags": [
        "USAF TACP",
        "U.S. Air Force",
        "Training",
        "Military"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Walters",
                "href": "/profile/Dave-Walters-33"
            },
            "answer_text": "I’ve written a few answers to variations of this type of question, but in this answer, I’m going to provide what the current TACP training pipeline consists of versus my experience going through it, mainly due to the many changes that have been implemented over the years. Additionally, I will lay out every single course that you will need to attend and graduate from to become a fully operational TACP in the United States Air Force. US Air Force Basic Military Training - 8.5 WeeksSpecial Warfare Prep Course - 8 WeeksTACP Prep (Selection Course) - 1 WeekTACP School House - 21 weeksUS Air Force SERE Course - 3 WeeksUS Army Airborne School - 3 WeeksFormal Training Unit - 20 WeeksUS Air Force Basic Military Training (BMT) 8.5 WeeksAs a Special Warfare candidate, meaning you aspire to become either a CCT, PJ, SR or TACP, you’ll be going through BMT in a Training Flight that consists of nothing but other Special Warfare candidates. This is a great modification, in my opinion, as it allows candidates to be able to train and prepare for the standards of Air Force Special Warfare, which is vastly different and elevated over the standards of the regular Air Force. US Air Force Special Warfare Prep 8 WeeksThe Special Warfare Prep Course is designed to *realistically* prepare candidates for their own respective training pipelines. As previously stated, the SpecWar prep course is dedicated to train and prepare Pararescue, Combat Control, Special Recon and TACP candidates. During this phase, you’ll have Certified Strength and Conditioning coaches that will focus on your physical conditioning, which will greatly benefit your performance during the pipeline. One thing that I’m reminded to mention is individuals going through this course should not think that all you’ll be doing is working out. You will be pushed physically and mentally, and this is done to again, realistically prepare candidates for the selection course to follow. In my opinon, this has been one of the greatest additions to the training structure as it increases physically prepared candidates and it decreases the attrition rate without lowering standards. TACP Prep 1 WeekTACP Prep is the selection course for all TACP candidates and is going to physically and mentally push you to your limit - and then some. This course is a smoke-fest and it will beat you down both physically and mentally. To graduate, candidates must meet and exceed a list of standards before moving on to the TACP Schoolhouse. TACP Schoolhouse 21 WeeksThe TACP Schoolhouse is the official technical training phase for the TACP pipeline. It consists of 5 training blocks with each block of training dedicated to a specific facet of the employment of a TACP. Block I (5 Weeks)Block I revolves around the proficiency of communication equipment such as radios, antennae theory and dialogue. Block I is also where candidates perform the water confidence test, which consists of jumping into a pool with full combat load, ditch everything, then swim to the side and exit the pool. In this block, you’ll also be PT’ing every single day and you will still be getting smoked. In order to graduate Block I, you’ll need to ruck 4 miles within the standards, pass the Block I PT Test, and show proficiency in radio operation, troubleshooting and communication. Block II (5 Weeks)Block II focuses on land navigation, map reading and combatives. I think it’s important to note that Land Navigation, outside of any water based training evolution, is responsible for a great number of drop outs in the pipeline. It’s easy to fuck up and get moving in the wrong direction. This Block will require you to really hone in on your attention to detail. This is also the Block where you’ll be having your first field week which you are responsible for every piece of equipment on you. Lose something, you’re probably going to get rolled back aka recycled. You’ll still be getting smoked in PT during this training Block. To graduate Block II, you’ll need to ruck 6 miles within the standards as well as the Block II PT test. Block III (4 Weeks)Block III is the block where all the “sexy” shit starts to happen. In this Block, you’ll focus on tasks such as rifle and pistol shooting, small unit tactics, patrolling, basic Infantry tacitics, and rappelling, each requiring that you pass an evaluation. During this Block, you’ll be put onto a team and you’ll be assigned “missions” in which you and your team will have to plan for and execute, all of which will be monitored by the Cadre. To graduate Block III, you’ll need ruck 12 miles within the standards at full combat load and the PT test at graduating standards. Block IV (7 Weeks)Block IV is dedicated to educating candidates on the subject of Close Air Support. Here, you’ll learn the basics of conducting an airstrike, how to run through 9-lines, and even the mission planning involved when coordinating CAS platforms. To graduate Block IV, you’ll need to demonstrate your abilities in conducting CAS while being reviewed. The last week, you’re essentially preparing yourself for graduation. You’ll be PT’ing every day, but it’s nothing like the previous training Blocks. At the end of the week, you’ll attend your graduation ceremony in which you’ll don the Black Beret. You will officially be a TACP, however, not an operational one….. Yet. US Air Force SERE School 3 WeeksThe USAF SERE Course, you’ll participate in both classroom and field training. This particular training contains a lot of practices that go deep into TTP’s and therefore I won’t be speaking too much about it. But I will say, you’ll definitely get your feet wet in some bushcraft and outdoor living. And you’ll be HUNGRY. US Army Airborne School 3 WeeksUS Army Airborne School is a popularly known course where you’ll learn how to jump out planes via static line and not end your life prematurely. You’ll do a lot of PT during this school, but compared to the TACP training pipeline, it’s a cake walk. To graduate Airborne School, you’ll have conducted 5 jumps, during the day, night, combat load & Hollywood Jump (no equipment). This will also be your first exposure to the Army and the amazingly fun & challenging PT sessions they conduct. Sarcasm. Formal Training Unit (FTU) 20 Weeks (Being established in October 2020).Historically, TACP’s that graduated the entire training pipeline and follow on courses would go straight into checking in to their first unit and would get the additional training they needed to become Combat Mission Ready. The issue with this is that every TACP’s CMR qualifications wouldn’t be standardized and 1 unit’s standards might differ from another. The FTU is mitigating this by having all newly graduated TACP’s go through the same standardized training to become Combat Mission Ready as well as attain their JTAC qualification. Phase I (16 Weeks)Phase I is the Combat Field Skills block of training. Here, you’ll be fully immersed into the world of being a Ground Based Controller and will understand the JTAC employment process, academics and memorandum agreement of being a Joint Terminal Attack Controller (JTAC) Phase II (4 Weeks)Phase II is the Strike phase of training. Here, you’ll go through simulator training and actual live fly & fire missions in the field. This phase is essentially a reconstructed JTAC qualification course, however, as previously stated, this course is still being stood up and more additions may be happening. To graduate, you’ll need to pass your JTAC evaluation and from here, you’ll be moving on to your first unit if you succeed in doing so. All in all, the TACP pipeline is about 65 weeks in length and is both physically and mentally challenging. While the pipeline itself has become more streamlined and designed to increase numbers, understand that the standards have not been lowered and a journey to the Black Beret is not an easy one. ",
            "date": "Answered August 28, 2020",
            "views": "22",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris Price",
                    "user_href": "/profile/Chris-Price-381"
                },
                {
                    "user_id": "Jake",
                    "user_href": "/profile/Jake-2482"
                },
                {
                    "user_id": "Orion Sakorn",
                    "user_href": "/profile/Orion-Sakorn"
                },
                {
                    "user_id": "Joel Del Rosario",
                    "user_href": "/profile/Joel-Del-Rosario-2"
                },
                {
                    "user_id": "Sam Day",
                    "user_href": "/profile/Sam-Day-117"
                },
                {
                    "user_id": "Arizona Alma",
                    "user_href": "/profile/Arizona-Alma"
                },
                {
                    "user_id": "Christopher Maitland",
                    "user_href": "/profile/Christopher-Maitland-9"
                },
                {
                    "user_id": "Leo Schlosser",
                    "user_href": "/profile/Leo-Schlosser-1"
                },
                {
                    "user_id": "Brendan Chase",
                    "user_href": "/profile/Brendan-Chase-2"
                },
                {
                    "user_id": "Nathan Valle",
                    "user_href": "/profile/Nathan-Valle-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "L. Darnell Florence",
                "href": "/profile/L-Darnell-Florence"
            },
            "answer_text": " Image credit: The ROMAD Locator TL; DR: Harder than you think. Why? Because TACPs (also called JTAC once they get the credential) are typically embedded with Army units - or in some cases - SOF, Delta, SEALs, etc. I have first-hand knowledge of this wonderful inital training pipeline and it's grueling, to say the least! It has to be difficult - not only physically, but also mentally. Sure, ROMADs (Radio Operator Maintainer And Driver - harkens back to the Vietnam days) are known for being brutes, drinking until the wee hours of the morning, and generally beating the crap out of people - but they are also extremely f'king smart. The new pipeline has an INDOC portion (similar to PJ, CCT, SEALs, etc) where you must pass the initial ass-kicking so you can continue on to Hurlburt Field for the wonderful swampy offerings of NW Florida. Once at Hurby, you will encounter a dedicated section of the base portioned-off for the TACP schoolhouse, dorms, and lovely PT pits. Your dorm room will look like hell. It will not be the same dorms as other AFSCs going through technical training. Oh no, it's Army-esque. With sand throughout the halls and rooms from prior trainees who recently graduated - and you will need to clean up the mess. Now that you have settled into your room with your roommate, you have unpacked, cleaned your room, and gotten ready for training. Right? Wait a second. Did you enter the building or leave the building without doing 10 pushups each time? DO IT NOW! That's right... Simple ins-and-outs. You will complete 10 pushups, dips, or pullups (bars provided) whenever you enter or exit any building. You'd be surprised how much this helps for your test! Get caught skipping this fun feat, and you sir, have just registered an integrity violation! I wouldn't want you on my team, that's for sure. After a day of inprocessing, you hit the rack. 0400 and your instructors are on the PT pad waiting for everyone to arrive. You'd better be ontime. Day 1 of training: 7 mile formation run. WOOHOO! Followed by pullups, bear crawls, and any other fun the instructor team has planned. Oh, and you don't get to wear a watch. Only the team leader has a watch. Finally you're done, your legs hurt a bit, because after all that, you did lunges and squats with ammo cans. Delightful. That's just the morning of Day 1. Every day after is even more demanding. Week after week, you will accomplish varying miles of ruck marches and expected to complete them in a designated timeframe. You will learn how to plot maps, coordinate CAS, use proper radio terms, operate and fix various radios, small team tactics, play in the sand and surf of the Emerald Coast, and generally experience the SUCK of being a mud-dwelling TACP. Only after overcoming some of the most demanding and difficult tasks of your life, will you earn the right to wear the coveted black beret and flash. Training doesn't stop there!!! You can go straight to Airborne school!! You also have the opportunity to go through some of the most intense Armed Forces schools in the world, to include HALO, Pathfinder, Ranger school (yes, you can earn the RANGER tab!) and many more. The strong will stand. The weak will fall by the wayside. ",
            "date": "Answered August 16, 2015",
            "views": "365",
            "upvotes": " View 49 Upvoters",
            "upvoters": [
                {
                    "user_id": "L. Darnell Florence",
                    "user_href": "/profile/L-Darnell-Florence"
                },
                {
                    "user_id": "Ward Wensch",
                    "user_href": "/profile/Ward-Wensch"
                },
                {
                    "user_id": "Robert A. Clemons",
                    "user_href": "/profile/Robert-A-Clemons"
                },
                {
                    "user_id": "Kimorri Lobe",
                    "user_href": "/profile/Kimorri-Lobe"
                },
                {
                    "user_id": "Orion Sakorn",
                    "user_href": "/profile/Orion-Sakorn"
                },
                {
                    "user_id": "Bryan Vargas",
                    "user_href": "/profile/Bryan-Vargas-48"
                },
                {
                    "user_id": "Nathan",
                    "user_href": "/profile/Nathan-1734"
                },
                {
                    "user_id": "Ethan Kang",
                    "user_href": "/profile/Ethan-Kang-28"
                },
                {
                    "user_id": "Thomas Washington",
                    "user_href": "/profile/Thomas-Washington-14"
                },
                {
                    "user_id": "Ethan Larsen",
                    "user_href": "/profile/Ethan-Larsen-16"
                }
            ]
        }
    ]
}