{
    "title": "What is your income as a Digital Nomad, and how do you sustain your life? - Quora",
    "tags": [
        "Location-Independent Lifestyle",
        "Digital Nomads",
        "Nomads",
        "Income",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeanette Slagt",
                "href": "/profile/Jeanette-Slagt"
            },
            "answer_text": " Many digital nomads do not have a steady income. So to give you hard figures will be hard. Jobs and sales can fluctuate during a month, quarter or a year and that makes a digital nomads income kind of unpredictable. Like it does for every freelancer. Because of that unpredictability nomads stop and return to regular paid jobs back home or in a country of their choice. The balance between income and travel expenses is sometimes hard to maintain. You have to have a certain mindset to be able to live from day to day, creating income on the go. Especially when your back-up finances start to run out. For me, it is the opposite I create income according to my expenses. So if I live in cheap hotels and travel little, I need less work and less income. If I want to move to another country, need a plane ticket, for example, I work accordingly. So, income wise it is what works best for you: have a steady income stream and live accordingly or adjust your income to your chosen lifestyle. I live a pretty good life, I eat out almost every day, twice a day, I ride big bikes (Owned) whenever and where ever I can, and I make lots of trips, sometimes I have a temporary home base, and I lease a house, other times I am on the road constantly. I adjust my work and income accordingly. So I guess my goals in life have no financial focus. They have a more enjoyable lifestyle focus. And that is the true goal the original digital nomads set out to meet. To work less and live more. Somehow over the years, this goal seems to have shifted to: make a lot of money on the road. But that is not my goals, for that means I have to work more hours or have high scaled jobs with massive targets. Another thing to take into account when you think about nomadic income is whether or not you have to pay taxes. Some do and others don’t. And that makes a huge difference in your nett income and working hours. ",
            "date": "Answered May 10, 2019",
            "views": "306",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                },
                {
                    "user_id": "Joseph TerZino",
                    "user_href": "/profile/Joseph-TerZino"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nora Dunn",
                "href": "/profile/Nora-Dunn-2"
            },
            "answer_text": "Well. It’s like this question was tailored for me. Not only do I publish my income as a digital nomad annually, but I also publish my expenses to travel full-time, thus demonstrating that the digital nomad lifestyle can be completely financially sustainable! But first. It’s important to note that there is no benchmark. There is no “normal”, no “median”, and no “right” or “wrong”. How much money you choose to earn as a digital nomad, along with how you choose to spend it, is completely up to you. (And quite frankly, this applies to everybody, not just digital nomads). Before I became a digital nomad, when I was a young adult, I took up skydiving. Skydiving is a rich man’s sport, and I was not rich, nor a man. In fact, I was a starving artist! It amazes me to this day that I managed to amass almost 300 skydives and to take skydiving-related vacations at least once per year. But it all boiled down to my spending decisions. I lived a very simple life. I cooked most of my meals, I rarely drank alcohol, and I never bought a latte at Starbucks. I made skydiving a priority, and any sacrifices I made along the way to make that dream a possibility didn’t feel like sacrifices at all. Back to financially sustaining the digital nomad lifestyle. When I was writing my second book, my editors pushed me heavily to provide long-term travel budget spreadsheets and other tools that would categorically spell out how much it costs to live and travel full-time. I refused to do it. Why? Because travel – especially when it’s a lifestyle, not just a short vacation – is so incredibly different for everybody. There is no budget. My cost of full-time travel between 2010 and 2018 has ranged from $17,000 to $44,000. This is all in, including travel - and business, and life - expenses. My annual expenses changed drastically for a variety of reasons, not the least of which was life just being life. In 2013 for example, I had almost $20,000 in erroneous expenses as a result of “stuff” happening like a house/passport theft, near-fatal accident, and financially supporting a partner. This “stuff” of life happens whether or not we travel; but – fairly or unfairly – it becomes a part of the “travel budget” when traveling long-term or full-time. Life’s misadventures aside, if I didn’t have the income to support my expenses in general, I wouldn’t have spent (other money) the way I did. For example in 2013 even with those dastardly experiences, I also made other costly choices – such as paying for accommodation (instead of getting it for free which I’ve done so much), and a big splash-out in Europe. So when readers balk (as they occasionally do) at my travel expenses, suggesting that this isn’t “financially sustainable travel” as they see it, I simply point them towards my income for those same years - which ranged from $22,000 to $43,000. Except for a slight differential of less than $1,000 in 2013, I’ve consistently spent less than I’ve earned. So have I been traveling in a financially sustainable way? You betcha. Has it been synonymous with budget travel? Not particularly. Nor was I trying to make it so. Around 2010, a colleague of mine and I were talking about our business plans for the next year. I asked if he had any tips for me. (This was one of those years when I earned - and spent - very little). He said “make more money”! I railed against his response. My full-time travel lifestyle was financially sustainable, and more importantly, comfortable! Why did I need to earn more money and work harder? To me, I would enjoy life even less. To him, I said “My income is a means to my lifestyle, no vice versa.” It’s also worth noting that not all digital nomads are broke, and living in cheap countries earning very little. (By the way, just in case you think I’m one of those “broke nomads”, most of the last 12 years I’ve lived in expensive countries and still kept my costs low, thanks to free accommodation and other travel hacking tips). In my Financial Case Studies series on my website, I profile full-time travelers and digital nomads who earn anything and everything - up to millions of dollars every year! So to any aspiring digital nomads, I say “throw out your perceptions of what you think is possible. Depending on your skills, motivation, career, and lifestyle choices, you can sustain a life as a digital nomad. The only question that remains is whether you want it badly enough to make it happen, because like any other lifestyle, nothing is perfect. For more information: Annual Expense & Income Reviews - The Professional Hobo How to Create a Long-Term Travel Budget: Financially Sustainable Travel ",
            "date": "Answered May 23, 2019",
            "views": "356",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Armando Bennett",
                    "user_href": "/profile/Armando-Bennett-2"
                },
                {
                    "user_id": "Joseph TerZino",
                    "user_href": "/profile/Joseph-TerZino"
                }
            ]
        }
    ]
}