{
    "title": "What are some of the most useless inventions ever made? - Quora",
    "tags": [
        "Innovation",
        "Invention and Inventions",
        "Scientific Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yatharth Bakshi",
                "href": "/profile/Yatharth-Bakshi"
            },
            "answer_text": "Ugh. I damn those stupid people who say they are inventors. Yet the only thing they invented is probably toilet paper. There are shitloads of inventions which have been “invented” by geniuses. The list goes on and on. And thus, I proudly present to you, my dear ladies and gentlemen, the greatest inventions of 21st century! A slinky.Yep. That glossy, glow-in-the-dark, rainbow colored plastic-y spring. It is certainly a pointless invention. I mean, what purpose would a spring bouncing and jumping around serve eh? (Other than to show the propagation of sound waves in the freshman year!) Yeah, I know it keeps kids engaged for hours. But other than that? Probably nothing.  The useless box.Stupid useless box. I must say that I haven't encountered any device as strange as this one. Dumb box, this is. You maybe have heard about this (in)famous device. When you flip the switch on the box, the lid of the box opens and a hand/lever comes out, effectively switching itself off and going back in. That's it! Not glitzy glamorous sparks or lighting or something. What? What else did you expect from a device named useless box?  Pet rock.This adorable (albeit pointless) stony companion profited 15 million in the first six months it was on the market. Each rock was sold for $3.95, profiting Gary Dahl, its inventor, $3 per sale. They came with a hay bed, a pet carrier, and a manual on how to deal with this \"hassle-free\" housemate.  Peanut ButterOkay, I am going to gain a lot of haters from this. I don't know who invented this or why. Just that it is weird. That sticky, gooey texture, solid crunchy pieces in middle and that muddy color. I just can't help comparing it to something more gross. Basically, it sucks. I frickin’ hate it.  Hula HoopsWhy would someone invent this dude? Just why? A colorful ring. Put it around the waist and whee! Not fun at all. Why not just use a conventional exercising method? But no. You would not! Conventional exercising is so old school! Hula Hoops is the future kids! Back in the fifties when it was invented, more than 50,000 were being made everyday!   Dammit! Useless stupid inventions. I would probably invent something much better dude! Won't you? -_- ",
            "date": "Answered April 12, 2017",
            "views": "101",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aryan Singh",
                    "user_href": "/profile/Aryan-Singh-1835"
                },
                {
                    "user_id": "Manyan Tse",
                    "user_href": "/profile/Manyan-Tse-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                },
                {
                    "user_id": "Hari Haran",
                    "user_href": "/profile/Hari-Haran-473"
                },
                {
                    "user_id": "Srinivas Deshpande",
                    "user_href": "/profile/Srinivas-Deshpande-5"
                },
                {
                    "user_id": "Alok Roy",
                    "user_href": "/profile/Alok-Roy-28"
                },
                {
                    "user_id": "Hari Krishna",
                    "user_href": "/profile/Hari-Krishna-1507"
                },
                {
                    "user_id": "Anshuman Mahapatra",
                    "user_href": "/profile/Anshuman-Mahapatra-13"
                },
                {
                    "user_id": "Vijay Sundar",
                    "user_href": "/profile/Vijay-Sundar-14"
                },
                {
                    "user_id": "Nikhil Nishant",
                    "user_href": "/profile/Nikhil-Nishant-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Leavy",
                "href": "/profile/John-Leavy-4"
            },
            "answer_text": "On September 27 last year (according to Quora), I answered the question: “Who was the worst inventor in world history?” I am now pasting here, that response in full, as I am certain it will answer your question also. This is it: “This is the brand of question which at first glance would appear to scream out for a spoof response. For example: ‘The worst inventor in history was the guy who made the square wheel’. Alas, there is no need. For what I am about to write, I will ask my reader to judge for him or herself, if truth is indeed stranger than fiction. One more thing, I really do not know who was the worst inventor in history, but here are a few to be getting along with. On the 30th March 1971, a Mister Donald B. Poynter, of Cincinnati, Ohio, patented a walking golf ball. This is a golf ball with a motor on the inside and legs on the outside. The great advantage about this invention is you do not have to hit the thing, it goes all by itself. The United States Patent Number is 3,572, 696. The following item is a firearm especially designed for trench warfare. So, it will be no surprise to learn therefore that it was patented on the 13th June 1916, that is, at the height of The Great War. This ‘weapon’ was invented by a Mister Jones Wister of Philadelphia, Pennsylvania, and is basically a rifle with a curve on the end so it can fire around corners. The United States Patent Number is 1,187,218. Have you ever felt unappreciated? There you are, achieving great things and no one gives you even a passing glance. Well now, I have just the thing for you. It is a Pat on the Back Apparatus. This is a device that fits on your shoulder, and has a series of pulleys and rods, one of which has a hand shape at the end. All you do is pull a lever and he presto, you have given yourself a pat on the back. The inventor is a Mister Ralph R. Piro, Lindenhurst N.Y., and he submitted the patent on 2nd September 1985. The United States Patent Office Number is 4,608,967. To conclude, I obtained the above information from a marvel of a book entitled “Patent Nonsense”. It was written (published 1994) by the excellent writer and broadcaster, Clive Anderson. As Mister Anderson is also a very good lawyer, I thought it wise to give him a mention. I certainly do not want him on my tail.  Mister Clive Anderson, the guy from whom I stole the information.” ",
            "date": "Answered July 19, 2019",
            "views": "73",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aryan Singh",
                    "user_href": "/profile/Aryan-Singh-1835"
                },
                {
                    "user_id": "Manyan Tse",
                    "user_href": "/profile/Manyan-Tse-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MR-BlueSky"
                },
                {
                    "user_id": "Petar Jukic",
                    "user_href": "/profile/Petar-Jukic-1"
                },
                {
                    "user_id": "Reinier Post",
                    "user_href": "/profile/Reinier-Post"
                },
                {
                    "user_id": "Randy Radcliff",
                    "user_href": "/profile/Randy-Radcliff"
                },
                {
                    "user_id": "John Pearce",
                    "user_href": "/profile/John-Pearce-144"
                },
                {
                    "user_id": "Michael Bailey",
                    "user_href": "/profile/Michael-Bailey-39"
                }
            ]
        }
    ]
}