{
    "title": "What was the success rate of Luftwaffe defensive gunners in the Battle of Britain? How many British fighters did they shoot down? - Quora",
    "tags": [
        "Royal Air Force",
        "Fighter Aircraft"
    ],
    "response": [
        {
            "author_info": {
                "name": "Monty Mason",
                "href": "/profile/Monty-Mason-2"
            },
            "answer_text": "I think this question wants to know how many allied fighters were shot down by German Luftwaffe bombers, using their machine gun protection. The answer already given by Mr. Rusling, makes the point that no one really knows since German war time records are scarce and probably inaccurate. I’ll buy that. However, there is an approach that might elucidate this question somewhat. Please read my comments written on December 10, 2019, that attempts to make the point that B 17’s (Flying Fortresses, so called because of all their machine gun positions) just filled the air with bullets like beginning shotgunners who don’t know how to lead a bird (it must be continuously!) or they will miss. And they did. Later, the B29’s with an automated firing program installed, shot the hell out of Japanese fighters. I dare say, had the B 29’s entered the war in Europe (making the assumption that Germany was still fighting and could still throw a swarm of fighters at the B 29’s), the same thing would occur. Big point: American engineering was capable of responding to the war’s conditions. ",
            "date": "Answered May 28, 2020",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven Rusling",
                "href": "/profile/Steven-Rusling-1"
            },
            "answer_text": "I don’t think anyone has trawled through the records to work out a number. It would be a labour of love. Though many squadron records do specify how an aircraft was shot down, many also use phrases like ‘shot down in combat’ without specifying by what type. Some aircraft simply disappeared and would be listed in vague phrases like ‘missing after combat over Thames estuary’. I have taken Sunday September 15th (Battle of Britain Day) as an example. On that day 19 British aircraft were destroyed (or sustained damage causing them to be written off) by fighters and 4 by bombers. A lot of British accounts do not include aircraft subsequently written off as having been shot down or destroyed, but they surely were. 16 British aircraft were damaged by fighters (but repairable) and 5 by bombers. I would dare to venture that given the rather large sample size on this day the numbers are representative of interceptions of large raids escorted by large formations of fighters. There were also 13 aircraft destroyed or damaged by an unspecified type; 5 destroyed or damaged in combat with bombers and the escort (usually Bf 110s) where it is not possible to be sure which hit the British fighter; 6 combat or other operational crashes resulted in aircraft damaged, destroyed or written off (everything from flying into the ground in combat to crashing into tenders on landing); 1 aircraft was damaged by ‘friendly’ fire, but force landed at Wick Farm, Burnham and was repairable. ",
            "date": "Answered May 27, 2020",
            "views": "845",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Allan Southern",
                    "user_href": "/profile/Allan-Southern"
                },
                {
                    "user_id": "Evangelos Lolos",
                    "user_href": "/profile/Evangelos-Lolos"
                },
                {
                    "user_id": "Phil Nicholas",
                    "user_href": "/profile/Phil-Nicholas"
                },
                {
                    "user_id": "Erik Lund",
                    "user_href": "/profile/Erik-Lund-1"
                },
                {
                    "user_id": "Jim Busbin",
                    "user_href": "/profile/Jim-Busbin"
                },
                {
                    "user_id": "Loring Chien",
                    "user_href": "/profile/Loring-Chien"
                },
                {
                    "user_id": "Andrew Givens",
                    "user_href": "/profile/Andrew-Givens-1"
                },
                {
                    "user_id": "Anthony Davies",
                    "user_href": "/profile/Anthony-Davies-50"
                }
            ]
        }
    ]
}