{
    "title": "What is so great about Leonardo da Vinci? - Quora",
    "tags": [
        "What's So Great About X?"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ratnakar Sadasyula-రత్నాకర్ సదస్యుల",
                "href": "/profile/Ratnakar-Sadasyula-రత్నాకర్-సదస్యుల"
            },
            "answer_text": "Even if Leonardo Da Vinci had just been an artist and painter, he would still have been a great, just for the Last Supper and Mona Lisa.   But Leonardo Da Vinci was not just a painter and artist. He was also an engineer, architect, scientist, inventor, cartographer, anatomist, botanist and writer. He was not what you call a \"Jack of all Trades\", he was a master in almost every field, in effect a true Polymath and genius. As Leonardo Da Vinci had no formal education in Latin or Mathematics, many tended to overlook his scientific work. But one look at his notes and journals, showed this was one man, whose thought was way ahead of his times. He made notes about the human fetus and movement of the arm.   If we look at his notes and drawings, it is clear that Da Vinci had an understanding of the human body that was leagues ahead of his time. In fact, it corresponds very much to the later medical discoveries of the human body.  Not just that he also studied the effect of light on spheres, and he implemented that in his paintings. Notably the extreme contrast of light and shadow in his paintings was the result of his study on effect of light. He was one of the earliest persons to study the dimensions of the human body, dissected human corpses to study anatomy, made drawings on them, that are pretty much similar to drawings of any medical student. He drew maps at a time when Cartography was not yet an advanced science.  One of his other major contributions was to mathematics, when he studied the polyhedra in his journals.  Much before any one else he also conceptualized the tank and helicopter in his drawings.  Leonardo Da Vinci had a tremendous knowledge of hydraulic principles, mechanical designs, cantilevers, pulleys. He knew the principles of momentum, centripetal force, and actually applied them to his inventions. In short Leonardo Da Vinci was not just a brilliant artist; he was an equally great scientist, inventor and architect, whose ideas were way ahead of his time. ",
            "date": "Updated April 13, 2020",
            "views": "419",
            "upvotes": " View 23.3K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lahar Kashyap",
                    "user_href": "/profile/Lahar-Kashyap"
                },
                {
                    "user_id": "Saranya Ramadasan",
                    "user_href": "/profile/Saranya-Ramadasan-1"
                },
                {
                    "user_id": "Vanya Sharma",
                    "user_href": "/profile/Vanya-Sharma-5"
                },
                {
                    "user_id": "Thilaga Thiru",
                    "user_href": "/profile/Thilaga-Thiru"
                },
                {
                    "user_id": "Ayush Jaswal One",
                    "user_href": "/profile/Ayush-Jaswal-One"
                },
                {
                    "user_id": "Gitta Beentjes",
                    "user_href": "/profile/Gitta-Beentjes"
                },
                {
                    "user_id": "Jahnavi Golla",
                    "user_href": "/profile/Jahnavi-Golla"
                },
                {
                    "user_id": "Jasmine Kaur",
                    "user_href": "/profile/Jasmine-Kaur-1175"
                },
                {
                    "user_id": "Amadou Diallo",
                    "user_href": "/profile/Amadou-Diallo-45"
                },
                {
                    "user_id": "Nikhil Ambattuparambil Gopi",
                    "user_href": "/profile/Nikhil-Ambattuparambil-Gopi"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Penturn",
                "href": "/profile/John-Penturn"
            },
            "answer_text": "This answer I gave says much: What were the major achievements of Leonardo Da Vinci? He had a visionary mind that could see deeply into things in a way that was many centuries ahead of his time. Technology in particular, discovering all the principles of aerodynamics (to name one example only) 4 centuries before the rest of the world caught up with him. All based on observation. Of birds & the aerodynamic principles underlying flight in this instance. He not only figured out how to build a workable airplane (except for the engine) but the far more sophisticated aerodynamic principles of the helicopter. This is a man that when he looked at a waterfall did not succumb to the acceptance of all who do. Namely that when the vertical water hits the horizontal - it disappears into it & that’s that. He didn’t stop looking, let alone understanding. He understood it went to either side, in front & underneath in specific ways & with differing force. We know because he drew all of it & have that passed down to us. He tried his hand at designing everything. All of it practical. From fantastical weapons such a the invention of the tank to mechanical apparatuses that allowed public spectacles for the church & others that had people arising from the beneath floor with smoke spewing apparatuses to make it appear as if by magic. His Art had an eerie perfection that made it seem otherworldly. Almost as if designed by an alien pretending to be human, with a precision of mind & artistry that could only be guessed at. His pictures are somehow larger & stranger then life with the merest whiff of the weird. The famous smile of the Mona Lisa is not in fact a smile at all in any normal sense of the word. Looking at it is like grabbing smoke. The more you do, the more it disappears. Its only when you look at it with your peripheral vision you see it. A painting designed to be most deeply seen when you don’t explicitly look at it. The subtly of it is a living thing that is immensely unsubtle once you get the feeling of it. He had it with him unsold at his death & was a private passion peculiarly lacking in eruptive passion, as most define it. He was not like Michelangelo who one can more easily understand as a man letting understandable, epic forces of great majesty move through him. Leonardo walked with & through strange realms it would appear we may never fully understand & then put some of that into semi-recognizable forms that somehow had a vaguely, inhumanly yet mesmerizingly beautiful vibe to them. He was not just a genius - but a genius among geniuses & very much sui generis. Something more then an amplified version of other talented men, something unique. ",
            "date": "Answered April 23, 2017",
            "views": "866",
            "upvotes": "0"
        }
    ]
}