{
    "title": "What are the examples of cutting edge technology public doesn't know about? - Quora",
    "tags": [
        "Cutting Edge Technology",
        "Innovation",
        "Technology Trends",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Blok",
                "href": "/profile/Alex-Blok"
            },
            "answer_text": "Easy! The military use tech that is 10 to 20 years ahead of consumer and commercial use, assuming it ever makes it to those markets. So for the time it is in use exclusively by the military, chances are, the public won't know unless observing in confidence. Two examples, both of which are now in the public domain: Plasma flat screens - Warships in the early 1980s had futuristic at the time plasma screens that didn't make it into laptops and then TVs (in colour for the latter) until the early noughties. I believe the Grid Compass was the first laptop with one.Virtual transparent cockpit- Probably one of the coolest technologies ever developed in my opinion. Don an F35 pilot helmet when in flight and look around. You will be able to look right through the aircraft body at the terrain below as if the fuselage wasn't there or made of a transparent material! How does it work? No, not cameras on the aircraft, that would not allow the crew to see through poor weather or in darkness. The US military has a high resolution 3D model of the Earth and projects the appropriate area onto the helmet visor in real time. Cool or what? Now the clincher! The B2 stealth bomber had this - back in the early 1990s! How do I know? I met a disaffected software engineer in California in about 1992 who worked on it and who probably broke the US secrets act in telling me, but I kept it mum until this week after reading about the F35 version in a public article just yesterday, June 7 2019. (I was interviewing the engineer with regards to developing a live 3D Earth globe to do what Google Earth does now, but even better. He effectively was telling me it had already been done - by the military.) For those interested, almost 20 years since I had the idea for a live 3D globe, my employer is now developing it, our way, it's already looking cool. Yup, going up against the big G. We have some cool ideas, so why not? Anyway, re the original question, sorry that neither of these examples are secret anymore, so less intriguing, but you can be assured that there will be all manner of magical tech in use or in development from handheld laser weapons to fly sized spy drones to stealth (‘invisible man’) army clothing etc.",
            "date": "Answered June 8, 2019",
            "views": "199",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nithin Gigi",
                    "user_href": "/profile/Nithin-Gigi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zisis Kontogounis",
                "href": "/profile/Zisis-Kontogounis"
            },
            "answer_text": "Using the $14 VERTICAL jet bidet, instead of t. paper, for comfort, dignity, 100% cleaning, even on hemorrhoid presence, time sparing, ecology, economy and mainly hygiene ( it reduces: fecal dust and so UTI, HA Infection, antibiotic resistant microbes, as MRSA etc). 99.000 DEATHS EACH YEAR IN USA FROM HA INFECTION. ABOUT THE SAME IS THE CONDITION IN EUROPE. A SIMPLE TEST COULD REDUCE THOSE HAI RATES. WHY CDC OR SOME OTHER HEALTH CARE INSTITUDE DOES NOT DO IT? WHAT DOES IT STOP THEM? Years before, dr Semmelweis saved millions of people since, by doing this simple test: In few words (to shorten the whole story), in order to show the need of hand sanitization in hospitals, he selected two similar clinics. In first one, drs and other staff were sanitizing their hands, while in the other, following the then usual practice, were not. The results are known. The death rates were much less in the first clinic. It is worth noting that Semmelweis's hypothesis, that there was only one cause, that all that mattered was cleanliness, was extreme at the time, and was largely ignored, rejected, or ridiculed. He was dismissed from the hospital for political reasons and harassed by the medical community in Vienna, being eventually forced to move to Budapest. Semmelweis was outraged by the indifference of the medical profession and began writing open and increasingly angry letters to prominent European drs at times denouncing them as irresponsible murderers. His contemporaries, including his wife, believed he was losing his mind, and in 1865, nearly twenty years after his breakthrough, he was committed to an asylum. Now, let return to our contemporary problem of high HAI rates. The causes may be many. But it seems one is more prominent: The human FECAL DUST in hospital wards. “FECAL DUST: It comes from fecal residue, left after wiping with t. paper (complete or, worse of course, incomplete) . Through drying and friction it turns out to dust and through hair is going to all surfaces, at first stage the uro-genital organs, causing UTI, and later to all house, causing food contamination. That phenomenon is more intense in hospitals, as the patients are usually debilitated, weak, with mobility restriction etc, particularly if there are hemorrhoids or anus hair and are unable to wipe properly. So the flying fecal dust reaches to all ward surfaces, dispersing its pathogenic microbes and so being the cause of the known HAI. The flying fecal dust emerges mainly from cloths of patients that can MOVE around, not the ones that are on pampers. Have in mind that in a 4-6 beds hospital wards, moisture and temperature conditions harbor microbes and also microbe density in the wards is a one more factor that increases their chance of developing antibiotic resistance.” It is obvious that the known hygiene measures, as is hand washing etc, are not enough, as now a new microbe source, up to now ignored, is added. Up to now NOT A SINGLE scientific study have ever doubted fecal dust’s existence and its role on microbe dispersion, but however no hygiene measures are imposed or advice is given, particularly to women to prevent UTI, or any guiding to hospital hygiene managers. CDC, responding to my relative question about fecal dust’s role in HAI, said they could not give me any answer positive or negative. That means that nobody had done any relative research work, as anybody could see in internet. The test, I am suggesting is simply a repetition of about dr Semmelweis’s method: a hospital, that takes all the specials measures to prevent human fecal dust forming and then a comparison is made on its HA Infection rates with those of other hospitals, in which no special care is taken. If the answer is positive, imposing those measures would naturally be the next step to all hospitals. On the case this test is not done promptly, everyone is entitled to think, that there are very strong and very suspicious reasons, for somebody to ignore so many deaths, suffering and high hospital function cost. ",
            "date": "Answered June 9, 2019",
            "views": "41",
            "upvotes": " Answer requested by Leon Dolinar"
        }
    ]
}