{
    "title": "What makes 5G faster than 4G? - Quora",
    "tags": [
        "Wireless Communication",
        "Long Term Evolution (LTE)",
        "5G (wireless communication)",
        "4G (wireless communication)",
        "Telecommunications",
        "Electronics and Communication Engineering",
        "Wireless Technology",
        "Cellular Service Providers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samyak Jain",
                "href": "/profile/Samyak-Jain-827"
            },
            "answer_text": "There a number of changes and improvements that have certainly helped technicians and researchers to the successful 5G networks.Although they are not implemented on large scale but it would be done soon. Some of the advancements are : 1. Carrier Aggregation Carrier aggregation is a technique used in LTE advanced to improve the system efficiency. In carrier aggregation, two or more carrier signals are aggregated to support wider bandwidth which allows even up to 100 MHz.  CA uses three techniques for aggregation:Intra-band contiguous: two carriers are transmitted at neighboring channels (as in the figure).Intra-band non contiguous: two carriers are transmitted with channel spacing.Inter-band: In this technique different LTE bands are used for transmission simultaneously. 2. Small Cell Concept In order to increase network efficiency, the cell is sub divided into micro and Pico cells. Spectrum reusability allows to adding more users in a small geographical area and handle network more efficiently. 3. MIMO Concept  MIMO is a transmission technology with the usage of multiple antennas for transmission and reception. Simultaneous data transfer is possible using this technology thus offer efficient data rate. The more the number of antennas, the more transmission and reception can be done. 4. Wi-Fi off loading Wi-fi offloading is one the main feature of the future networks. It allows the user to connect using wi-fi network and the cellular network can be allocated to other users. It would be suitable for some places where cellular network quality is poor and user still have the option to connect to the network without cellular reception. 5. Device to device communication  D2D communication is technique where network authorize two adjacent devices communicate each other directly. Network will have the control over the devices and allows an operator to determine the traffic routing between direct and network path. During the absents of network, one devices can connect to another device. 6. Cloud – Radio Network Access C-RAN is a network technology used for effective communication with a centralized information processing carried out remotely within the cloud system. The signal will be processed at a remote location and the base stations will be connected with most efficient fiber optic connections. It gives lot of advantages in system implementation, maintenance and highly efficient. ",
            "date": "Answered January 27, 2019",
            "views": "26",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Scott Fam",
                    "user_href": "/profile/Scott-Fam-3"
                },
                {
                    "user_id": "Nikki S",
                    "user_href": "/profile/Nikki-S"
                },
                {
                    "user_id": "Pablo Samaritano",
                    "user_href": "/profile/Pablo-Samaritano"
                },
                {
                    "user_id": "John Maria",
                    "user_href": "/profile/John-Maria-3"
                },
                {
                    "user_id": "Workrock",
                    "user_href": "/profile/Workrock"
                },
                {
                    "user_id": "Himesh Shah",
                    "user_href": "/profile/Himesh-Shah-1"
                },
                {
                    "user_id": "Arjun Sanghani",
                    "user_href": "/profile/Arjun-Sanghani-3"
                },
                {
                    "user_id": "Sakthivel Veeraiyan",
                    "user_href": "/profile/Sakthivel-Veeraiyan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tahmina Akter",
                "href": "/profile/Tahmina-Akter-106"
            },
            "answer_text": "5G networks will boost wireless throughput by a factor of 10 and may replace wired broadband. A major difference between 5G and 4G is this congestion will be eliminated. This means no more five bars of networking signal at rush hour but an inability to access a web browser. But arguably, 5G’s biggest differentiator to 4G will be as a gateway for the Internet of things connected the world at scale. Later iterations of 5G networking are expected to be revolutionary for data-driven industries, smart cities, and infrastructure management because it will be possible to have many more devices working, reliably, securely and uninterrupted in the same area. Overall, due to the new technologies, spectrum, and frequencies it uses, 5G has several benefits over 4G higher speeds, less latency, capacity for a larger number of connected devices, less interference and better efficiency. ",
            "date": "Answered July 6, 2019",
            "views": "15",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sourov Dutta",
                    "user_href": "/profile/Sourov-Dutta-4"
                },
                {
                    "user_id": "Chandra Moulie",
                    "user_href": "/profile/Chandra-Moulie-3"
                },
                {
                    "user_id": "Pramod Choudhary",
                    "user_href": "/profile/Pramod-Choudhary-14"
                },
                {
                    "user_id": "Ali Khalid",
                    "user_href": "/profile/Ali-Khalid-6"
                },
                {
                    "user_id": "Abdul Sameeu",
                    "user_href": "/profile/Abdul-Sameeu"
                },
                {
                    "user_id": "Sakthivel Veeraiyan",
                    "user_href": "/profile/Sakthivel-Veeraiyan"
                }
            ]
        }
    ]
}