{
    "title": "What is wireless technology? - Quora",
    "tags": [
        "Wireless Technology",
        "Wi-Fi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pavanesh Narayanan",
                "href": "/profile/Pavanesh-Narayanan"
            },
            "answer_text": "Q) What is wireless technology? A) Anything transmitted over air i.e. without using wires or cables! For example instead of using a wired head phones you can use a wireless headphones to listen to music. Or you can transfer photos between two mobile devices. These application mostly use Bluetooth technology that uses 2.4 GHz frequency. The WiFi are other examples which uses 2.4 or 5 GHz frequency. TV / radios has contents transmitted from satellite to TV using different frequencies. Wireless charging uses a lower frequency signal to transfer energy without using wires. Cellular internet is another example! All these uses different frequencies to transmit without using wire/cables! Checkout the following videos to know more about some of the application of Microwave frequencies:        ",
            "date": "Answered May 22, 2019",
            "views": "204",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jaspreet Cheema",
                    "user_href": "/profile/Jaspreet-Cheema-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prachi Sharma",
                "href": "/profile/Prachi-Sharma-575"
            },
            "answer_text": "Wireless communication is the transfer of information or power between two or more points that are not connected by an electrical conductor. The most common wireless technologies use radio waves.  Types of Wireless Communication Technologies Wireless communication technology is categorized into different types depending on the distance of communication, the range of data and type of devices used. The following are the different types of wireless communication technologies. Radio and Television BroadcastingRadar CommunicationSatellite communicationCellular CommunicationGlobal Positioning SystemWiFiBluetoothRadio Frequency Identification",
            "date": "Answered October 25, 2019",
            "views": "428",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jaspreet Cheema",
                    "user_href": "/profile/Jaspreet-Cheema-27"
                }
            ]
        }
    ]
}