{
    "title": "What are the potential consequences from DeepFake technology? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Caleb Beers",
                "href": "/profile/Caleb-Beers-1"
            },
            "answer_text": "An increase in plausible deniability. Think about it. Until recently, if a video of a person doing or saying something offensive surfaced, it would damage their reputation. If you find a video of a politician saying something off-color in a private conversation, and you publish that video, you’ve ruined that politician. However, once DeepFake becomes known to the general public, all bets are off. “Oh, that video where I said I’d like to nuke the entire state of Alabama if I were elected? That was clearly a DeepFake!” For that matter, it could apply to something as banal as a celebrity sex tape: “Oh, that’s not really me. Clearly, someone DeepFaked that.” There may be ways of detecting DeepFakes, right now. But what happens when the technology becomes sophisticated enough that you can’t analyze a video with any software that will tell you if it was faked? Again, it causes an increase in plausible deniability. Videos of people in compromising positions will no longer have the same power because everyone has an “out” now: “It was DeepFaked!” The big threat that everyone is talking about with DeepFake — that of fake videos and fake news — is certainly present. But I think that the long-term effect will be less trust in media, once DeepFake becomes common knowledge. In fact, it will make it very easy for people to maintain their cognitive biases: “Whatever. That damning video of the politician I’m going to vote for could have been DeepFaked, for all I know.” The overarching principle here is that fabrication destroys any value based on provenance. Let me give you an example: in the United States, at least, you don’t have to be careful about counterfeit currency because American dollars are hard to counterfeit, unless you have access to some very expensive equipment. It’s hard to fake dollar bills, so you don’t spend a lot of time worrying about receiving fake money. As the technology behind DeepFake becomes cheaper (and eventually free), it will become easier and easier to fake videos. To return to the money analogy, if there were a freeware computer program that could make passable counterfeit money, dollars would lose their value overnight. If anybody with a computer and an internet connection can download the software to make convincing fake videos, then what happens to the value of videos as evidence? ",
            "date": "Answered August 12, 2019",
            "views": "23",
            "upvotes": " View 84 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Krasko",
                    "user_href": "/profile/Alex-Krasko"
                },
                {
                    "user_id": "David Clark",
                    "user_href": "/profile/David-Clark-248"
                },
                {
                    "user_id": "Anirudh Kannan",
                    "user_href": "/profile/Anirudh-Kannan-3"
                },
                {
                    "user_id": "Siddhant Bhardwaj",
                    "user_href": "/profile/Siddhant-Bhardwaj-20"
                },
                {
                    "user_id": "Gabriel Ciobanescu",
                    "user_href": "/profile/Gabriel-Ciobanescu"
                },
                {
                    "user_id": "Japhy Me",
                    "user_href": "/profile/Japhy-Me"
                },
                {
                    "user_id": "Alessandro Piccirilli",
                    "user_href": "/profile/Alessandro-Piccirilli-1"
                },
                {
                    "user_id": "Svet Dim",
                    "user_href": "/profile/Svet-Dim"
                },
                {
                    "user_id": "Sasha Webber",
                    "user_href": "/profile/Sasha-Webber-2"
                },
                {
                    "user_id": "Charlotte Spreckley",
                    "user_href": "/profile/Charlotte-Spreckley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Daniel",
                "href": "/profile/Michael-Daniel-21"
            },
            "answer_text": "Thanks for A2A. What are the potential consequences from DeepFake technology? Any technology that has been developed at a professional level eventually filters down to pro-sumer, then consumer, then sub-sumer, until there is some form of free-ware available. People may pay a fortune for the latest version of PhotoShop, although it’s popularity suggests that many users have “cracked” versions. GIMP is the equivalent in computing power as genuine free-ware on the Linux platform. These two packages may be aimed at the specific editing of only one image, but there’s no reason why multi-frame capable software isn’t out there for those who want to find it. I know that I can stand in front of a green-screen, pretending to be Donald Trump and make the most outrageous “public video”. Whether or not I could beat him with a fictional outrage compared to the real thing is a matter of pure conjecture, but the software already exists to replace my image with his, and substitute my voice with his, inserting an appropriate background so that it appears to have been shot in the US and, to all intents and purposes, will be mistaken for genuine footage. Once it’s been passed through a variety of different servers that perform different types of compression, there won’t even be any meta-data embedded in the file that reveals the fakery. It would take forensic-level examination to expose the fraud. This type of technology has already been used in the Star Wars franchise to resurrect Peter Cushing for continuity purposes, but real actors are generally opposed to virtual actors (vactors) because it deprives them of a living and at the moment the technology still uses stand-in actors to give the original performance. Like any technology it can be used benignly or malignantly. It has already been used to change an actor’s appearance dramatically in other movies and TV, except that I can’t find the example I had saved from a revelatory story to show it here. The ultimate ramifications will be that: no news-feed will be trustworthy because it could be manufactured; andvideo evidence presented in Court will have to remain in its source format so that the meta-data remains intact.Film and video has been able to lie to us for decades. This development just makes that capability a little easier. ",
            "date": "Answered February 12, 2018",
            "views": "1",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Keith Otis Edwards",
                    "user_href": "/profile/Keith-Otis-Edwards"
                },
                {
                    "user_id": "Martin Vadakara",
                    "user_href": "/profile/Martin-Vadakara"
                },
                {
                    "user_id": "Benny Ha",
                    "user_href": "/profile/Benny-Ha"
                }
            ]
        }
    ]
}