{
    "title": "What are some incredible photos showing how much the world has changed in 100 years? - Quora",
    "tags": [
        "Human Evolution",
        "Photographs",
        "Photography"
    ],
    "response": [
        {
            "author_info": {
                "name": "Melvin Brown",
                "href": "/profile/Melvin-Brown-116"
            },
            "answer_text": " In April 1920, Herbert McBride broke the world's motorcycle record for amateurs with a speed of 104.4 miles per hour. McBride, along with his teammate, Indian Motorcycles Factory Racing Team professional rider Eugene Walker, broke two dozen speed records over the course of several days along the sands of Ormond Beach, Florida. # 2. Original caption: \"Infantrymen pose for a photograph on the Great Sphinx, built around 2,500 B.C., at Giza, in Egypt. March, 1920.\" #  3. Kentucky Governor Edwin P. Morrow signs the bill ratifying the Nineteenth Amendment (the \"Susan B. Anthony Amendment\"), giving women the right to vote, surrounded by members of the Kentucky Equal Rights Association, on January 6, 1920. #  4. The Russian revolutionary leader Vladimir Lenin gives a speech to Red Army soldiers leaving for the front during the Polish-Soviet War, in Sverdlov Square (now Theatre Square), in Moscow, on May 5, 1920. On the right side of the platform are People's Commissar Leon Trotsky and a Politburo member, Lev Kamenev. #  5. Japanese women hold a demonstration to protest low wages paid to female factory workers. #  6. An aerial view of the crowds on New York's Coney Island Beach during the Fourth of July, circa 1920 #  7. Franklin D. Roosevelt, then a vice-presidential candidate, at his summer home in Campobello with his 14-year-old daughter Anna, in August 1920, on Campobello Island in New Brunswick, Canada. #  8.Type is prepared for a Chinese weekly newspaper. #  9. Original caption: \"The War Department has assigned the 63rd Infantry as a permanent National Guard of Washington, D.C. It will be the duty of the unit to guard the National Capitol in peace times as well as war.\" # Library of Congress  10.The daredevil Ormer Locklear stands on the wing of a Curtiss Jenny biplane going about 90 miles an hour in June 1920. #  11. Original caption, from May 29, 1920: \"Bare legs and scanty one piece bathing suits were very much in evidence at the opening of Washington's municipal bathing beach today. Officials have agreed to disregard as precedents the prohibitory orders issued at Coney Island and Atlantic City.\" #  12. Original caption: \"Wall Street bomb explosion, September 16th, 1920, thirty dead.\" Another eight of the several hundred who were wounded later died in the hospital. Those responsible for the bombing attack in New York's financial district were never identified, though several anarchist and communist groups were suspected and investigated for years. #  13. A sea of hats: A crowd of men gather in New York's financial district, trying to get a glimpse of the aftermath of the Wall Street bombing. #  14. The launching of the steamer Annie E. Morse, probably at the Virginia Shipbuilding Corporation in Alexandria, Virginia #  15. Original caption from December 1, 1920: \"The Women's Militia drilling in Soviet Russia.\" #  16. The suffragist Alice Paul unfurls a banner from the balcony of the National Women's Party headquarters, showing a star for each state that has ratified the Nineteenth Amendment, giving women the right to vote. The women were celebrating the August 18, 1920, ratification of the amendment by Tennessee, making the amendment law. #  17. A street scene in Seoul, Korea, on February 14, 1920 #  18. Original caption from August 17, 1920: \"After finding the bricklaying business too full of ups and downs, this amazing young girl decided to take a shot at iron girdering for a change. She is Miss 'Collie' Collier, a reporter for the Chicago Herald-Examiner.\" #  19. An aerial view of the battleship USS Oklahoma, originally built in 1910. The Oklahoma was operated by the U.S. Navy until she was sunk in Pearl Harbor, Hawaii, in December 1941. #  20. A vending machine enables a daytime worker to purchase goods after shops have closed in London, England, circa 1920. #  21. Original caption from December 4, 1920: \"Writing to Santa Claus\" #  22. Original caption from December 19, 1920: \"Mary Pickford takes a picture of husband Douglas Fairbanks, Sr., who is executing a handstand on the roof of a building.\" # ",
            "date": "Answered May 23, 2020",
            "views": "502",
            "upvotes": " View 281 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Soutar",
                    "user_href": "/profile/Steve-Soutar-3"
                },
                {
                    "user_id": "Greg Lambert",
                    "user_href": "/profile/Greg-Lambert-14"
                },
                {
                    "user_id": "Sting Go Zo",
                    "user_href": "/profile/Sting-Go-Zo"
                },
                {
                    "user_id": "Chris Andrews",
                    "user_href": "/profile/Chris-Andrews-294"
                },
                {
                    "user_id": "Manju Reijmer",
                    "user_href": "/profile/Manju-Reijmer"
                },
                {
                    "user_id": "Occultis Aperta",
                    "user_href": "/profile/Occultis-Aperta"
                },
                {
                    "user_id": "Jen Diaz",
                    "user_href": "/profile/Jen-Diaz-4"
                },
                {
                    "user_id": "Matthew Sidner",
                    "user_href": "/profile/Matthew-Sidner"
                },
                {
                    "user_id": "Bruce Ralph",
                    "user_href": "/profile/Bruce-Ralph-6"
                },
                {
                    "user_id": "Shane Silver",
                    "user_href": "/profile/Shane-Silver"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aleksa Petrovic",
                "href": "/profile/Aleksa-Petrovic-4"
            },
            "answer_text": "Map of Europe was very different. Hundred years ago many nations got their first countries. Middle East and Maghreb were still under European rule, mostly French and British.  The Great War ended and it was the end of the world. Immediately after the war there was Spanish Flu, but more importantly there were more wars. Communist revolution nearly swept the world. The most famous communists at that time were Lav Trotsky and Bela Kun.   Speaking of Bela Kun, if you went to the Square of Heroes during Hungarian Socialist Revolution, it was covered up with red carpet. On left it is written “Long live Hungarian Socialist Republic”.  One notable new country that came to this world was Kingdom of Serbs, Croats and Slovenes, which would be later known as Kingdom of Yugoslavia. It’s sad that so many people died to form a country that no longer exists 100 years later.  Yugoslavia wasn’t the only new thing. Immediately after the war, League of Nations was formed and it already got its hands full. All those wars and new states and nations made it exceptionally hard to create any type of order.  In some places there were genocides. With fall of Ottoman Empire, Assyrians, Armenians and Pontic Greeks experienced their own holocaust.    Surprisingly enough, Syria was very peaceful place. It got stabilized relatively fast. Damascus looks like calm, traditional and overall nice place to live.  While Damascus was peaceful, Berlin was a battle zone. Fraikorps and Communists were killing daily in the streets. It will take some time for Waimer Republic to stabilize things, until the economic crush of 1929.  In Rome, group of men in black shirts made famous March on Rome. Their leader was ever more popular Benito Mussolini. Little did Italians know what horrors awaits them.  Some nations like Turkey were blessed with leader they had. Mustafa Kemal formed new Republic of Turkey and after driving out the invaders from all side, he dedicated himself to modernization. He went to such length, he personally explained to his countrymen how to write in latin alphabet. After his death, his picture can be found on every institution, market and money.  On the other side of the ocean, Mexico was undergoing their own revolution. Mexican society was up in arms shaping their society. Unfortunately for Mexicans, they didn’t have wall up north so Americans entered their territory occupied Veracruz and did whatever they pleased. It is classical example of one country bulling the other for fun.   In USA, conservatives were reveling in their power and madness. In order to “fix society and uphold the Christian moral values” they banned alcohol. The Age of Prohibition started and with it, the rise of mafias and alcohol smuggling.  Apparently, Americans had regular parades of KKK. Let’s not forget that Jim Crow laws were in full effect. Lynching black people was common. Truly, they were upholding good old Christian values.   Not even Europeans were much better. Many colonial powers had “Human Zoos” where they kept Black natives inside cages like animals and fed them. The biggest irony is that Adolf Hitler out of all people was one of the first to ban this practise, but not for humanitarian reasons.   Finally, not everything was that bad. New form of entertainment emerged. Jazz clubs and Caberts were very popular with strange and exiting music, fashion and lifestyle. Smoking cigarets was popular, especially among the women which not long time ago was considered taboo.    There were many things that showed just how much did our society changed for 100 years. It’s pitty I answer this in 2020, because the answer would be much more interesting in 2000. World before The Great War was more orderly, but even more alien to us, then absurd and chaotic 1920s. ",
            "date": "Answered May 21, 2020",
            "views": "34",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Andrews",
                    "user_href": "/profile/Chris-Andrews-294"
                },
                {
                    "user_id": "Ollie Reading",
                    "user_href": "/profile/Ollie-Reading"
                },
                {
                    "user_id": "Božo Sunara",
                    "user_href": "/profile/Božo-Sunara"
                },
                {
                    "user_id": "Xavier Taylor",
                    "user_href": "/profile/Xavier-Taylor-44"
                },
                {
                    "user_id": "Scott Goldman",
                    "user_href": "/profile/Scott-Goldman-34"
                },
                {
                    "user_id": "Mary Novak",
                    "user_href": "/profile/Mary-Novak-11"
                },
                {
                    "user_id": "Adam Daher",
                    "user_href": "/profile/Adam-Daher-1"
                },
                {
                    "user_id": "L. Gratton",
                    "user_href": "/profile/L-Gratton"
                }
            ]
        }
    ]
}