{
    "title": "What are some examples of unethical uses of computers? - Quora",
    "tags": [
        "Unethical Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chak Hong",
                "href": "/profile/Chak-Hong"
            },
            "answer_text": "unethical uses of computers - or any type of equipment like even a car - is when it is used to break a law or when its used in a way that your mother will not approve! (since we are on ethical ground). examples - using it to commit a crime - hacking, infecting others, hold ransom on others, look at child porn, downloading counterfeit software, looking at pirated films, etc. using it unethically without breaking a law - being nasty on facebook, using someone else’s bandwidth (work or uni) to host your own server for questionable downloads, let your computer be unprotected and potentially allow hackers and other baad governments use it to hack others (ignorance is no excuse), etc. can write an essay on bad things that can happen! ",
            "date": "Answered November 28, 2016",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Samuel Beausoleil",
                "href": "/profile/Samuel-Beausoleil"
            },
            "answer_text": "There isn’t per-se any “evil” a computer can do. A computer does exactly what it is programmed to do. As to the unethical part, than that would depend upon the beholder. Are the computers that run enrichment centers for uranium and plutonium unethical? Are the administrative computers of an abortion clinic unethical? Is the programmer(s) behind the programs doing something wrong? All in all, I would say that this is a rather broad question. Perhaps what you mean is more about crackers and their acts. Every few years there are people, hackers/crackers and wannabe script-kiddies who run hundreds of attacks on websites and servers of all kind and often steal data and, sometimes, money as well. ",
            "date": "Answered November 23, 2016",
            "views": "17",
            "upvotes": "0"
        }
    ]
}