{
    "title": "What major wars will occur within the next 10 years? - Quora",
    "tags": [
        "Future of Warfare",
        "Future Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Madoc Karthaus",
                "href": "/profile/Madoc-Karthaus"
            },
            "answer_text": "There are 3 major possibilities in my eyes: Russia and some other country. They are a very aggressive state (it’s not necessarily their own fault either) and this could lead to a Russo-Baltic or Russo-Uzbek war, maybe even a Russo-Turkish war but what’s more likely than all of these is Ukraine being steamrolled for a second time so the Russians take Odessa. China and India. It is unlikely to happen in this decade but a conflict like this in the early 21st century could easily be the biggest conflict in generations. Some accident, misunderstanding or bold power play could turn Asia into a battle ground. If it goes on for long enough there could be serious effects on both sides and if the war is big enough in scale it’s possible India’s economy is stimulated like that of the United States in WW2. Ethiopia and Egypt. These countries argue a lot, each have populations bigger than Germany and is the conflict between them is my best bet for this answer. The reason for war is that Egypt is extremely worried that Ethiopia (where the Nile passes through) could cut off the river at any time or just disrupt water flow in general. When you remember that Egypt relies on the Nile for agriculture and water use in all forms, the cost of a new dam in Ethiopia for Egypt might be more than the cost of war.  For more evidence of Egypt's reliance on the Nile, look no further than Libya. Population in North African countries relies almost solely on 2 factors, size and latitude. Or in other words, the further from the Sahara, the higher the population density. That’s why this map (showing population of countries and the places and the rough borders of the Sahara) should be terrifying for leaders of Egypt, they have nearly 100 million people in a place where water is unbelievably scarce, they should be barely able to support 2 million people, let alone another 97. That is of course, unless there was some gigantic river providing enough water to keep a population the size of Iran’s alive in a desert…  You can see why the Egyptian government was then so worried when Ethiopia tried to build Dams for electricity, any disruption could easily have created the largest refugee crisis in Earth’s history. If it dried up, Egypt could transform from one of the oldest country on Earth into something much closer to Mauritania, a country so insignificant in the broader history of humanity most of you probably didn’t even know it existed. ",
            "date": "Updated October 27, 2018",
            "views": "245",
            "upvotes": " View 51 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anubha Joshi",
                    "user_href": "/profile/Anubha-Joshi-10"
                },
                {
                    "user_id": "Nathan Pellerito",
                    "user_href": "/profile/Nathan-Pellerito"
                },
                {
                    "user_id": "IO Messhias",
                    "user_href": "/profile/IO-Messhias"
                },
                {
                    "user_id": "Corgus Leita",
                    "user_href": "/profile/Corgus-Leita"
                },
                {
                    "user_id": "Josh Roberts",
                    "user_href": "/profile/Josh-Roberts-237"
                },
                {
                    "user_id": "Shovenjit Ghosh",
                    "user_href": "/profile/Shovenjit-Ghosh"
                },
                {
                    "user_id": "Rahul Vedpathak",
                    "user_href": "/profile/Rahul-Vedpathak-1"
                },
                {
                    "user_id": "Michael Feaselman",
                    "user_href": "/profile/Michael-Feaselman"
                },
                {
                    "user_id": "Brett Young",
                    "user_href": "/profile/Brett-Young-33"
                },
                {
                    "user_id": "Sachin Dubey",
                    "user_href": "/profile/Sachin-Dubey-15"
                }
            ]
        }
    ]
}