{
    "title": "What type of clean coal technology reduces the most amount of carbon dioxide? - Quora",
    "tags": [
        "Clean Coal",
        "Carbon Footprint",
        "Coal",
        "Carbon Emissions",
        "Mining Industry",
        "Carbon Dioxide",
        "Carbon (element)",
        "Chemistry of Everyday Life",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amos Cline",
                "href": "/profile/Amos-Cline"
            },
            "answer_text": "The whole point of burning any fuel is to release carbon dioxide (and water) into the atmosphere. If I burn coal or a fossil fuel I hope to convert all the hydrogen and carbon to water and carbon dioxide respectively by combustion. The sun’s chemical energy that was captured along with the carbon is released… the carbon assumes it’s original form as CO2. A tree takes water, carbon dioxide (from the atmosphere) and sunlight to sequester the CO2 and water in polysaccharides (carbohydrates) which are converted to fossil fuels over eons. We frac. and pump them up or dig them up and put the CO2 back into the atmosphere. Clean efficient burning reduces NOx, SO2, soot, and other pollutants in the process of feeding our demands for unlimited amounts of energy we feel that we just have to have for our decadent lifestyles.  http://www.hamiltoncountyrecycles.org/UserFiles/Servers/Server_3788196/File/EnvironmentalServices/AirQuality/History/Department%20History.pdf I lived near the Ohio Valley near Steubenville in the 50s and 60s. The air was orange with sulfur and you could not see half a mile. The industrial revolution has given the world all the comforts that could be hoped for and could not have even been imagined by my grandparents and great grandparents; but, it has also allowed a population of 7.6 billion on earth. We should just be more careful of how much we use and use less… much less. ",
            "date": "Answered October 24, 2020",
            "views": "218",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Kooi",
                "href": "/profile/Richard-Kooi-3"
            },
            "answer_text": "There is no such thing as “CLEAN” coal. There is slightly cleaner coal but You end up getting “ FAR MORE EXPENSIVE COAL “, when you are done! Coal Is losing Market Share at a staggeringly Fast Pace because it is too expensive already. …since Coal Electric is already substantially MORE expensive than either Solar Electric w/storage or Wind Electric w/storage! …you would be creating a totally non sellable item! ",
            "date": "Answered October 24, 2020",
            "views": "112",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}