{
    "title": "What are the things that make us human? - Quora",
    "tags": [
        "Terms and Conditions",
        "Understanding Romantic Relationship Dynamics",
        "The Human Race and Condition",
        "Understanding Human Behavior",
        "Philosophy of Everyday Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Apoorva Ambhoj",
                "href": "/profile/Apoorva-Ambhoj"
            },
            "answer_text": "What distinguishes humans from the rest of the nature (i.e , plants, animals and elements) , is our ability to imagine. All the things that we value- justice, equality, free speech, human rights- are actually concepts churned out of imagination, just like ideas such as God, heaven, hell, rebirth and immorality. We may classify these ideas as secular or religious, rational or supernatural, value one over other, but they are essentially creations of humans, by humans, for humans. They are artificial constructions, not natural phenomenon. They have no independent existence outside humans. Also, only in humans is found the container of beliefs, ideas that humans use to make sense of the world around. Our thoughts and beliefs shape our emotions; our emotions also determine our thoughts and beliefs. In us, senses, emotions and intelligence are highly developed. But what really makes us unique is our imagination (manas). While plants and animals experience hunger, fear and death, humans can imagine infinite hunger and infinite fear and infinite death. Humans can also imagine a world without hunger, fear or death. Hence, the idea of immorality! In any situation, plants and animals think only of themselves, their hunger and their fear. At best they may think of hunger and fear of their young ones, or that of their herd or pack. Dogs do think of their masters, but only their masters, no one else. They are driven by the instinct of self-preservation and self-propagation. They do not have the wherewithal to function in any other way. Humans, however, can sense other people's, even stranger's, hunger and fear and create resources to provide and protect others. It is the one thing that makes humans special. Wherewithal to do so: the enlarged neo-cortex that only humans have ( we can imagine otherwise though, as we often do in fables or on anecdotal evidence). They do not expect help either. Humans can help and expect to be helped, which comes from the ability to imagine and respond to other people's suffering. Animals have no choice but to follow their instinct. Humans do have choice!! ",
            "date": "Answered December 27, 2016",
            "views": "37",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jean Tenebrilux",
                    "user_href": "/profile/Jean-Tenebrilux"
                },
                {
                    "user_id": "Ashleigh",
                    "user_href": "/profile/Ashleigh-39"
                },
                {
                    "user_id": "Ricardo Hidalgo",
                    "user_href": "/profile/Ricardo-Hidalgo-4"
                },
                {
                    "user_id": "Nguyen Hono",
                    "user_href": "/profile/Nguyen-Hono"
                },
                {
                    "user_id": "Rob Scriven",
                    "user_href": "/profile/Rob-Scriven"
                },
                {
                    "user_id": "Bilkis Rahman",
                    "user_href": "/profile/Bilkis-Rahman"
                },
                {
                    "user_id": "Michael Mistik Raziore",
                    "user_href": "/profile/Michael-Mistik-Raziore"
                },
                {
                    "user_id": "Tuğba Özcan",
                    "user_href": "/profile/Tuğba-Özcan-1"
                },
                {
                    "user_id": "Dean Jay",
                    "user_href": "/profile/Dean-Jay-4"
                },
                {
                    "user_id": "Richard Cottone",
                    "user_href": "/profile/Richard-Cottone"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert K. Russell",
                "href": "/profile/Robert-K-Russell-1"
            },
            "answer_text": "Perspective is a wonderful thing. From a few light years away we are just a shadow passing across the face of a star. And perhaps some stray electromagnetic radiationFrom the moon we are part of the blue-green smear of life on the face of this planet and some metallic trash left behind in the odd craterBut through our own eyes, and at our scale, we are special and distinct as a species.Mind you, we have ourselves helpfully defined species, kind of. (The definition moves around a bit, like life itself.) In any case we can identify ourselves readily by sight, although we may hesitate momentarily when confronted with other great apes. Especially if we are in a \"natural\" state, naked and unshaved. But we can still spot the differences. We know who we are, don't we? Although that may not always have been so. When other apes were even closer to us it is more than likely that we saw far fewer differencesIndeed, in light of the genetic evidence, we probably didn't make a great fuss about any distinction between us, the Denisovan and the Neanderthal peoplesNowadays of course we recognise them as “human” as well, yet different.Perhaps at the time we recognised them as very slightly different physically or behaviourally, but close enough to be cousins. But these days it appears it's just us as the sole human species, and we are much clearer about who and what we are. The gap to the “closest” ape relative is wider. (Maybe it's a gap of our own creation, of course.) It's likely therefore that other species (as we call them) \"mind the gap\" in much the same way. Sometimes there's a measurable genetic variation, other times the gap is so narrow that only behaviours separate different species. In any case we've invented the whole differentiation and labelling business, based on our perspective, our observations and what \"works\" or makes sense to us. We have invented the gap, and in many ways it's quite arbitrary. So what makes us human, according to other humans? Well we are attracted to ourselves, by and large. Both socially and sexuallyWe share some common behaviours and abilities as well as our standard morphologyAnd if we dig deeper our genome is 100% us, accepting that it's also partly Denisovan and Neanderthal and arguably a whopping 98.5% chimpanzee, too (give or take).[1]So that arguable 1.5% gap is what makes us \"human\", at least by some measure. (Worth noting that by similar logic we are around 60% chicken, for that matter.) But that's not everything to consider, is it? We aren't clones, and whilst our genetic diversity isn't enormous it does exist. So we are a cloud of genes, varying in scope between extremes. And our behaviours vary as well. We aren't all the same. Worth pointing out that whilst other species are attracted to us socially, like dogs and cats, they don't fit either our morphological or genetic template. Phew. Otherwise it could get confusing. When we get all of the metaphorical ducks lined up, we have our common ‘humanity’. Even so, variation is allowed and accounted for, generally. We remain human - all of us, recognisably so - but we have created endless categories of arguably surface-deep labels to identify sub-groups of humanity, too. Sadly, perhaps, it’s one of our specialties. Reducing humanity to genetic and/or behavioural template-matching seems cold and statistical, but that's one way to do it. Perhaps that's in itself a unique ability? We could also decide \"what is human\" by identifying other possibly unique facilities, abilities, behaviours or emotionsHowever we often find that what is seemingly unique is not these \"things\" in or of themselves but the scale or scope of it. They vary by degree rather than by contrasts of absence or existenceIt becomes a measurement problem. How do you recognise and measure the extent of \"grief\" or \"insight\" or \"empathy\"? Especially across and between species (most of which can't actually tell you how they are feeling).Which is really a greater problem of extent. As I mentioned at the start, we have determined who and what we are by our own perspective and at our scale. Yet in truth we blur genetically into our closest cousins, all the way back to our most distant relatives. And our bodies are hosts to symbionts and parasites alike, sharing our body and our food, providing services we now rely on and arguably even influencing our behaviour. So where do we draw the line between our custom-evolved human cell and our similarly custom-evolved microbiota? Can we live our lives without our microscopic fellow travellers? Aren’t they us, too? In the end, it's arbitrary and variable. We choose the definition according to how we see ourselves, our beliefs and our customs. Further reading:Page on sciencedaily.comHuman microbiotaSymbiosisHuman parasite Thanks for asking! Footnotes[1] Chimpanzee joins the genome club",
            "date": "Updated September 9, 2020",
            "views": "27",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abdalla Adams",
                    "user_href": "/profile/Abdalla-Adams"
                },
                {
                    "user_id": "Conjectures of a Geek",
                    "user_href": "/profile/Conjectures-of-a-Geek"
                },
                {
                    "user_id": "Sibi Mithran",
                    "user_href": "/profile/Sibi-Mithran"
                },
                {
                    "user_id": "Nitish Shinde",
                    "user_href": "/profile/Nitish-Shinde"
                },
                {
                    "user_id": "Assem Elgazzar",
                    "user_href": "/profile/Assem-Elgazzar"
                }
            ]
        }
    ]
}