{
    "title": "What is manufacturing technology? - Quora",
    "tags": [
        "Manufacturing Technology",
        "Manufacturers",
        "Manufacturing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aishwary Pratap Singh",
                "href": "/profile/Aishwary-Pratap-Singh-4"
            },
            "answer_text": "Manufacturing technology is the branch of Mechanical Engineering which is concerned with the industrial production of goods with the use of advanced machine tools and basic equipments. Mechanical engineering is mainly based on Manufacturing technology as it enables the individual to manufacture varies products with use of advance machine tools and equipments, in a economic manner . As a branch of engineering, Manufacturing technology is a good branch but it will not provide a student a better edge in GATE Examination and Engineering service examination. It is so , because the syllabus of Manufacturing is nearly same as that of Mechanical, instead many PSUs exclude Manufacturing technology from the eligibility criteria through gate exam. But on the other side , it helps in designing field through which one can ensure private job easily. Thanks and hope it helps….. ",
            "date": "Answered February 3, 2018",
            "views": "33",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abdul Faheem",
                    "user_href": "/profile/Abdul-Faheem-7"
                },
                {
                    "user_id": "Prakruthi DD",
                    "user_href": "/profile/Prakruthi-DD"
                },
                {
                    "user_id": "Rahul Ranjan",
                    "user_href": "/profile/Rahul-Ranjan-236"
                },
                {
                    "user_id": "Varun",
                    "user_href": "/profile/Varun-367"
                },
                {
                    "user_id": "Prince Chauhan प्रिन्स चौहान",
                    "user_href": "/profile/Prince-Chauhan-प्रिन्स-चौहान"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suswanth Poluru",
                "href": "/profile/Suswanth-Poluru"
            },
            "answer_text": "Manufacturing Technology is a branch of Mechanical Engineering, which deals with fabrication of the desired product produced by production processes. For example, to make a iron rod, we need iron metal. The extraction of iron from its ore comes under production. And from iron, fabricating iron rod (desired product here) from extracted iron metal comes under manufacturing, in which various manufacturing technologies are being studied like casting, moulding, rolling, wire drawing, tube drawing and extrusion etc. Basically, manufacturing deals with shaping the produced metal with the help of various manufacturing technologies. ",
            "date": "Answered September 20, 2018",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sathya Pr",
                    "user_href": "/profile/Sathya-Pr"
                }
            ]
        }
    ]
}