{
    "title": "What unused ancient technologies would have the most use today? - Quora",
    "tags": [
        "Ancient Technology",
        "Archaeologists",
        "History of Technology",
        "Archaeology",
        "Ancient Civilizations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jan Kokes",
                "href": "/profile/Jan-Kokes"
            },
            "answer_text": "Hero’s engine.  It has not been tested much yet (2000 years later), but it works on the same principle as rocket engines, which attain 80% efficiency in vacuum. The problem is that you can’t get much power out of it using the configuration as is. You could, but the efficiency must go down, such as here:  See how wide the nozzles are? They allow much more steam to pass through. No worries, steam expands about 2000 times. You can also tune the engine to be either fast/weak (nozzles close to axis of rotation) or strong/slow (nozzles far from axis of rotation). I designed this one to use both at the expense of some efficiency, but with much more power out. I estimate that this engine hods great promise for aircraft propulsion, being light, fast and efficient. In addition, I don’t think I am the first human ever who thought so:  ",
            "date": "Answered January 28, 2020",
            "views": "245",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nick Deakin",
                    "user_href": "/profile/Nick-Deakin-4"
                },
                {
                    "user_id": "Mark Ferrance",
                    "user_href": "/profile/Mark-Ferrance-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Chesters",
                "href": "/profile/Adam-Chesters"
            },
            "answer_text": "Hate to tell you but 90% of are modern tech is ancient tech just improved and uses better materials , so unused ancient tech is pretty much the stuff that either didn't work or wasn't worth the effort. ",
            "date": "Answered November 19, 2019",
            "views": "11",
            "upvotes": "0"
        }
    ]
}