{
    "title": "What would cause a Fitbit to suddenly stop tracking sleep even though no settings have changed? - Quora",
    "tags": [
        "Fitbit",
        "Wearable Technology",
        "Sleep Science",
        "Sleep Habits",
        "Sleep",
        "Fitness"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Starnes",
                "href": "/profile/David-Starnes"
            },
            "answer_text": "In healthy adult subjects, the Fitbit has been able to predict not only sleep, but stages of sleep. Light, to deep and finally to REM sleep patterns. It uses movement, and heart rate patterns to calculate these patterns. Why would it stop? Hmmm. Movement variation. Perhaps a change in your heart rate patterns? Do you have arrythmia(s)? Those can change heart rate patterns. Or had very restless sleep i.e. tossing and turning? If you have a partner, perhaps they will tell you:)! Experiencing any undue stress? Too many cocktails, or too much caffeine before going to sleep? The Fitbit utilizes a 3-axis accelerometer to record motion. I could see it recording excess movement…tossing and turning…and bringing the device out of sleep recording. Frequent trips to the bathroom? You're awake! I have not looked into their specific algorithm, I changed my primary watch. Excessive Movement. Changes to your heart rate pattern. My 2 guesses. My 2 cents worth. ",
            "date": "Answered August 11, 2019",
            "views": "73",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Greg Davis",
                    "user_href": "/profile/Greg-Davis-218"
                },
                {
                    "user_id": "Mary Scott",
                    "user_href": "/profile/Mary-Scott-258"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin McLauchlan",
                "href": "/profile/Kevin-McLauchlan"
            },
            "answer_text": "QUESTION: What would cause a Fitbit to suddenly stop tracking sleep even though no settings have changed? ANSWER: Maybe it’s broken. Maybe there’s been a recent update that messed up your settings. Not all of them are obvious. And that refers to updates on the Fitbit and updates on your phone or tablet to which you connect. Maybe you just need to clean the emitter and sensor. Maybe you started taking a drug (or changed drugs) that reduces your circulation in your extremities. Maybe you’ve lost some weight, or you sleep with your arm in a position that tips the sensor away from making full contact with your skin. Maybe you’ve gained some weight (or edema) and the strap is now too tight and compresses the blood vessels in the area being monitored. That’s probably not an exhaustive list, but it’s a start. ",
            "date": "Answered August 18, 2019",
            "views": "72",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "Mary Scott",
                    "user_href": "/profile/Mary-Scott-258"
                }
            ]
        }
    ]
}