{
    "title": "What is the most 'Silicon Valley' thing you've ever experienced? - Quora",
    "tags": [
        "Technology Startups in Silicon Valley",
        "Silicon Valley (TV series)",
        "Engineering in Silicon Valley",
        "San Jose, CA",
        "Silicon Valley",
        "San Francisco Bay Area",
        "San Francisco",
        "California (state)",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joshua Woodruff",
                "href": "/profile/Joshua-Woodruff"
            },
            "answer_text": "Thoroughly enjoy Quora, but typically only as a reader. But this question reminded me of so many “only in Silicon Valley” stories I felt compelled to share a few…at least the ones I’m able to without getting in *too much* trouble. When I was working at a software company called PeopleSoft in the late 90s, they spun off a company called \"Momentum\" as a pilot program to offer their software as a service over the Internet, Oracle would periodically send a recruiting truck to drive around our campus parking lot in Pleasanton with a billboard on the back that read \"You want real Momentum? Come work for Oracle!\" until they were chased off by security. They would show up the next day, until at some point security caught on and started to block them. Oracle ended up doing a hostile takeover acquisition of PeopleSoft in 2005. On the infamous billboard in front of Oracle headquarters on highway 101 in Redwood City, there was an SAP ad with a physical mannequin mounted on it representing a large human. Some pro-PeopleSoft folks climbed the billboard and put a large PeopleSoft hoodie on the mannequin - which was competing with SAP for marketshare at the time. On this same billboard some time later, which was just slightly north of Oracle headquarters, on the side facing the freeway if you were driving north on 101, an Informix advertisement read \"You've just passed Oracle. So did we.\", with a sub-title saying something about \"Informix beats Oracle's TPC benchmark\". Always thought that was clever. In 1999, when the dot com boom was in full effect and I was working for a startup in San Francisco, millions of VC money was flooding in to any startup that had a pitch with the word \"web site\" on it, no matter what the revenue model (admittedly there was no proven revenue model for web sites at the time so it was all fair game). This created a nightly raging party scene in San Francisco with free food, free top shelf alcohol, and an ever-increasing competition for the best live music acts, including Beck, Beastie Boys, Prince, Green Day, and U2. This was _every_ _single_ _night_. The city of SF was a massive party for many, many months...until the bubble burst in 2000, of course. During the same dot com boom period in 1999, one of the first viral Internet videos surfaced - Mahir Cagri from Turkey doing a deplorable \"I Kiss You!\" video. Some start up with way too much VC money decided to fly this guy out to join one of the many SF parties, and my girlfriend at the time thought it was so cool she had her picture taken with this \"celebrity\". Bonus points if you remember this video. Ugh. When working at Microsoft's Mountain View campus in the mid-2000s, which was a few short blocks down Shoreline Blvd from Google's headquarters, Steve Ballmer was on a war path to beat Google at search. Bill Gates and Steve Ballmer would fly their helicopter down from Redmond about every quarter and Steve would do his regular sweaty shouting match on \"laser focus to beat Google!\", with a consistent message not to discuss anything work related when out at lunch because you \"never know if you are sitting next to a Google employee\". The talent competition was fierce - at one point Google put a card in every car's windshield parked in the Microsoft campus parking lot that said \"Work at Microsoft? You're good enough for Google. Walk in our door and you have a job.\" In hindsight, it may have been a mistake to assume Google had passed its prime as it had already had its IPO. This was in 2005! In late 2011/early 2012, when working for a startup based out of San Mateo, during off-site events the President would bring everyone many rounds of shots. After a few rounds, everyone would dread getting tapped on the shoulder by the President, because if you did, it meant you had to do 1 of 2 things: demonstrate a super human feat of strength, or perform an interpretative dance. While this was terrifying and humiliating at the time (the alcohol helped), the next work day everyone felt much more like a team - like you had been through something together. Something that was yours and only yours. It was a brilliant leadership move, although maybe a bit on the edgy side, and got us banned from a few places, like the winery where someone scaled the massive metal cask. Let the good times keep rolling! :) ",
            "date": "Answered July 23, 2018",
            "views": "28",
            "upvotes": " View 287 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill Brassfield",
                    "user_href": "/profile/Bill-Brassfield"
                },
                {
                    "user_id": "Billie Reiss",
                    "user_href": "/profile/Billie-Reiss"
                },
                {
                    "user_id": "Shubham Bhattacharya",
                    "user_href": "/profile/Shubham-Bhattacharya-45"
                },
                {
                    "user_id": "Gargi Punathil",
                    "user_href": "/profile/Gargi-Punathil-1"
                },
                {
                    "user_id": "Tabitha Brown",
                    "user_href": "/profile/Tabitha-Brown-38"
                },
                {
                    "user_id": "Clarence Vargas",
                    "user_href": "/profile/Clarence-Vargas-4"
                },
                {
                    "user_id": "Hector Scott",
                    "user_href": "/profile/Hector-Scott-4"
                },
                {
                    "user_id": "Pedro Reed",
                    "user_href": "/profile/Pedro-Reed-3"
                },
                {
                    "user_id": "Theresa Burke",
                    "user_href": "/profile/Theresa-Burke-26"
                },
                {
                    "user_id": "Stacey Steeves",
                    "user_href": "/profile/Stacey-Steeves-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Walker",
                "href": "/profile/Tim-Walker-59"
            },
            "answer_text": "I am going to take a literal shot at the “Silicon Valley” portion of the question. Bachmanity Insanity. This is where art imitates life, or vise versa; it further validates just how what some see as the satire of the show is not only based in real life, but sometimes weirdly accurate. I worked at GoPro pre and post IPO and some of what went on there makes the show “Silicon Valley” look tame and conservative, but this isn’t about GoPro, this is about another startup that went public in SV in 2015/2016. (I will not name the company). This is firsthand knowledge, as an employee there (who has since departed) shared some emails and the shit storm that followed after the some of the details leaked, I was also promised a spot on the guest list. After going public and being awash in cash, the higher-ups wanted to throw a party (they had already had parties where Imagine Dragons and Snoop Dogg had headlined) that would be legendary for all their investors and employees. They decided to rent out Alcatraz for this concert/party. It pretty much played out like Bachmanity did on the TV show. Cost overruns because of logistical problems and the fact the details of the “secret” party had begun to leak outside of the party planners and executive circle. The company was committed so they plugged along and began hyping the party to the internal stakeholders that it would be the best party ever. They booked two huge bands headlining, private ferry boats and a super exclusive guest list of SV illuminati and celebs. Then the Bachmanity Insanity storyline began to air on the “Silicon Valley” TV show in May 2016. I don't know how far in advance the TV show taped versus aired, but the party being planned on the show was nearly identical in details. The onscreen fallout from the implosion of the party pretty much rained on the parade. The scary thing was, the parallel with the real party was perceived internally as pretty cool at first. What if they could pull it off, successfully put together the party that sank Bachman on SV? Cooler heads prevailed and (a few MONTHS later!) it was eventually scrapped and a “normal” party was planned. I believe it was at the former SF US Mint or some other venue that wasn't quite as stigmatized and as expensive, and luckily most of the prepaid costs were transferred to the new party. It was hilarious to watch all this play out, and the hubris involved. It was very close to actually happening. Definitely the most “Silicon Valley” thing I have ever seen. ",
            "date": "Answered July 24, 2018",
            "views": "119",
            "upvotes": " View 99 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tabitha Brown",
                    "user_href": "/profile/Tabitha-Brown-38"
                },
                {
                    "user_id": "Bill McDonald",
                    "user_href": "/profile/Bill-McDonald"
                },
                {
                    "user_id": "Jonathan Erikson",
                    "user_href": "/profile/Jonathan-Erikson"
                },
                {
                    "user_id": "Deyan Atanasov",
                    "user_href": "/profile/Deyan-Atanasov-3"
                },
                {
                    "user_id": "Cynthia Taylor",
                    "user_href": "/profile/Cynthia-Taylor-4"
                },
                {
                    "user_id": "Anh Nguyen",
                    "user_href": "/profile/Anh-Nguyen-1037"
                },
                {
                    "user_id": "Mohammad Lavaei",
                    "user_href": "/profile/Mohammad-Lavaei"
                },
                {
                    "user_id": "Jay Mishra",
                    "user_href": "/profile/Jay-Mishra"
                },
                {
                    "user_id": "Prashant Gonga",
                    "user_href": "/profile/Prashant-Gonga"
                },
                {
                    "user_id": "Natalie Brucker",
                    "user_href": "/profile/Natalie-Brucker"
                }
            ]
        }
    ]
}