{
    "title": "What is BCIL? - Quora",
    "tags": [
        "Liquor and Spirits",
        "One Word Definition",
        "Wine",
        "English Word Definitions, Terminology, and Jargon",
        "Acronyms",
        "Restaurants",
        "Websites",
        "Numbers (mathematics)",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "C. S. Sharma",
                "href": "/profile/C-S-Sharma-14"
            },
            "answer_text": "BCIL is the short for Biotech Consortium India Limited, New Delhi Biotech Consortium India Limited, New Delhi was incorporated as public limited company in 1990 under The Companies Act, 1956. Biotech Consortium India Limited (BCIL) is promoted by the Department of Biotechnology (DBT), Ministry of Science and Technology, Government of India and All India Financial Institutions for providing the necessary linkages among stakeholders and business support for facilitating accelerated commercialization of Biotechnology. The Board of Directors of BCIL consists of senior representatives of DBT, Council of Scientific and Industrial Research (CSIR), Indian Council of Agricultural Research (ICAR), leading all India financial institutions and the biotechnology industry. BCIL was inaugurated in 1990 by the then Prime Minister of India, Hon’ble Shri Chandra Shekhar, in presence of the Finance Minister, Shri. Yashwant Sinha and Dr. Manju Sharma, Secretary, Department of Biotechnology. BCIL's major functions include the development and transfer of technology for the commercialisation of biotechnology products, project consultancy, biosafety awareness and human resource development. BCIL has been actively involved in technology transfer, project consultancy, fund syndication, information dissemination, and manpower training & placement related to biotechnology over the last decade and half. It has assisted hundreds of clients including scientists, technologies, research institutions, universities, first entrepreneurs, the corporate sector, national and international organizations, central government, various state governments, banks and financial institutions. ",
            "date": "Answered May 5, 2019",
            "views": "243",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Subham Ghadge",
                "href": "/profile/Subham-Ghadge"
            },
            "answer_text": "BCIL was inaugurated in 1990 by the then Prime Minister of India, Hon’ble Shri Chandra Shekhar, in presence of the Finance Minister, Shri. Yashwant Sinha and Dr. Manju Sharma, Secretary, Department of Biotechnology. Biotech Consortium India Limited (BCIL) is a public limited company, promoted by the Department of Biotechnology (DBT), Ministry of Science and Technology, Government of India and All India Financial Institutions for providing the necessary linkages among stakeholders and business support for facilitating accelerated commercialization of Biotechnology. BCIL has been actively involved in technology transfer, project consultancy, fund syndication, information dissemination, and manpower training & placement related to biotechnology over the last decade and half. It has assisted hundreds of clients including scientists, technologies, research institutions, universities, first entrepreneurs, the corporate sector, national and international organizations, central government, various state governments, banks and financial institutions. ",
            "date": "Answered May 5, 2019",
            "views": "126",
            "upvotes": "0"
        }
    ]
}