{
    "title": "What are the greatest inventions that have been invented by a single individual? - Quora",
    "tags": [
        "Best of X"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rory Blake",
                "href": "/profile/Rory-Blake-1"
            },
            "answer_text": "The greatest invention created by a single individual ...is a product to stop the biological process of aging.   How long has mankind been searching for this?  The motivation was clear ...there were selfish reasons, of course.  The inventor was approaching the age of need.  However, all of the other researchers in this field was either on the wrong track, or charlatans, or worse.  To get done, every process had to be accomplished by a single individual.   These accomplishments include: development of the nutritional theory of aging, enumerating the specificity of function in the lymph system, proving the cause of biological aging, proving that aging is not triggered by DNA damage, proving gut bacteria decline in aging was caused by excess amino acids, rewriting outmoded amino acid theory, development of a successful treatment modality to halt aging, formulation of the actual product used to treat aging, patenting, sponsoring trials and endeavoring to spread the adoption of the first successful anti-aging therapy.   All of this was done by a single individual.   The findings: A lack of absorption of specific essential amino acids is shown to be responsible for physical aging in humans.  All 20 amino acids are needed at a precise time and in the exact sequence for the human body to make protein.  Absorbing only 19 of the 20 amino acids needed for human protein is enough to trigger the aging process. Aging and starvation are the same biological process.  The lack of absorption of any essential nutrient is exactly the same to the body as not receiving any nutrition at all.  Both will place the body into the metabolism mode that holds on to nutrient and expends as little energy, as is possible.  The effect of this process in aging is the typically seen decrease in muscle mass and gain in overall mass.  In aging the unusable nutrition is stored as fat while structure is broken down for the missing nutrition. In actual starvation -just the structure is broken down for it's nutritional value. The human body is able to compensate for lack of absorption by stealing from structure.  The first rule of biology is \"Use it or lose it.\"  Cells that are unused go into decline, but not for any genetic reason.  They are slated to be recycled for the missing amino acid content, specifically for the amino acids that become difficult to absorb in the process of aging.  That \"Use it or lose it\" still applies have been proven time and time again in testing over the past few years. A bioavailable formulation of the missing nutrition was developed.  As this was an entirely new product, no one had before calculated the dosing that would be therapeutically required to overcome the nutritional deficit.  Test of the early versions of the compound were successful at multiple concentrations.  We now have nutritional supplement product that was successfully used to halt the aging process. An actual product will be available in 2016. For review: Blake's theory states aging is a two part process.  The first part involves a lack of absorption while the second part involves the body replacing the unabsorbed amino acids by removing them from existing structure. That nutrition is the initial problem leading to aging is not unexpected. Clinicians who work with the elderly have long suspected a nutritional component to aging.  The lack of absorption of specific nutrition triggers the process of aging. Acquired GI damage or a loss of receptors for specific common amino acids is the primary cause of aging.  Biofilm formation blocking intestinal uptake receptors is one type of uptake flaw. The Bible warns us not to eat burnt offerings.  Receptor damage from eating burnt/overcooked protein is another possibility for a lack of intestinal absorption.   As having all amino acids in protein nutrition is necessary -the inability to absorb specific protein from the gut forces the lymph system to \"steal\" needed nutrition from structure.  This is the part two of the two part problem which we call aging. There are five of the twenty amino acids comprising protein in the body with known problems of absorption.  Biological aging begins with a lack of intestinal absorption of at least one, some, or all five of these amino acids.  Which or all of the amino acids becomes lacking changes the observed outcome in the function or structure of the body.  Often, these changes do not become readily apparent until late in the aging process. Facial wrinkles are usually the first sign of aging to be observed.  Wrinkles are caused by the loss of collagen from below the skin.  The missing collagen had been \"stolen\" by the body for it's amino acid content. The lymph system has an ability to reverse structure by breaking down muscle and collagen to gain amino acids for bodily production of new peptides. This part of the aging process is identical to the orderly decline seen in starvation. A uniquely human trait is the ability to live for up to 60 days without solid food -due to this recycling process.  From which structure the amino acid nutrition is taken, becomes another factor that differentiates the process in different individuals. ",
            "date": "Updated May 1, 2016",
            "views": "16",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hazel Gadbois",
                    "user_href": "/profile/Hazel-Gadbois"
                },
                {
                    "user_id": "Fernando Rocha Villas-Bôas",
                    "user_href": "/profile/Fernando-Rocha-Villas-Bôas"
                },
                {
                    "user_id": "Dhaval Shah",
                    "user_href": "/profile/Dhaval-Shah-110"
                },
                {
                    "user_id": "Sagar Aher",
                    "user_href": "/profile/Sagar-Aher"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravishankar Krishnan",
                "href": "/profile/Ravishankar-Krishnan-2"
            },
            "answer_text": "this is not true at all...individuals may have been credited but the greatest inventions are essentially done by team work.However teams rarely find mention only the team leader does. ",
            "date": "Answered October 15, 2014",
            "views": "163",
            "upvotes": "0"
        }
    ]
}