{
    "title": "What are some jobs related to the Java field? - Quora",
    "tags": [
        "Career Advice in Java Programming",
        "Java Developer Jobs and Careers",
        "Career Advice for Computer Programmers",
        "Jobs and Careers in Computer Programming",
        "Career Advice in Computer Science",
        "Java (programming language)",
        "List Question",
        "Computer Programming",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Menal More",
                "href": "/profile/Menal-More-1"
            },
            "answer_text": "Java, derived from C and C++, is an object-oriented programming language having a simple object model. Java has helped programmers in simplifying the coding and developing applications and installing them on cross-platform systems. We find Java applications on desktops, laptops, mobiles, tablets, embedded devices, cloud computing servers and also supercomputers. Today Java is the most widely used software platforms for developing applications, whether used client-side or server-side. WHY LEARN JAVA? Java is an open-source programming language.It is platform independent and also provides multi-platform support.It provides APIs (Application Programming Interface) that are very easy to access.Java has the provision for garbage collection, helping users to manage memory.Java provides robust online services support.Java helps you to build very dynamic web applications and also reusable codes.Java Programmers are highly in demand, earning good salaries in top MNCs.Java has a very strong community which is well-knit and very helpful.Java is used everywhere. It has become omnipresent – all devices, all platforms!It is a very flexible programming language, and very easy to learn for beginners.REMUNERATION: A fresher Java can earn upto 4-5 lakhs p.a. With experience and globally recognized certifications, Java Programmers can earn as high as 12-13 lakhs p.a. COMPANIES HIRING JAVA PROFESSIONALS: Most of the top MNCs as well as start-ups are hunting for Java Professionals. Whether it is Infosys, Accenture, IBM, TCS, demand for Java Professionals is on a rise! Google, Amazon, LinkedIn, Blogger, Ebay, Twitter, all use Java to build useful applications. JOB ROLES FOR JAVA DEVELOPERS: Software Developer – CProgrammer Analyst – CC ConsultantSoftware Engineer – C++Embedded Developer – OOPSModule Lead – Core JavaSr Developer – Core JavaSoftware Engineer – Core JavaCore Java DeveloperArchitect – Core JavaSoftware Engineer – JSPApplication Developer – JSPSoftware Engineer – ServletsUI Developer – JSIoT Software EngineerLead Developer – Angular JS",
            "date": "Updated September 10, 2018",
            "views": "76",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ramu Ulluri",
                    "user_href": "/profile/Ramu-Ulluri"
                },
                {
                    "user_id": "Ashutosh Singh",
                    "user_href": "/profile/Ashutosh-Singh-4124"
                },
                {
                    "user_id": "Sumaya Kumari",
                    "user_href": "/profile/Sumaya-Kumari"
                },
                {
                    "user_id": "Sudan Y",
                    "user_href": "/profile/Sudan-Y"
                },
                {
                    "user_id": "Saravanan N",
                    "user_href": "/profile/Saravanan-N-16"
                },
                {
                    "user_id": "Ashok Mallagunta",
                    "user_href": "/profile/Ashok-Mallagunta"
                },
                {
                    "user_id": "Mohammad Rahmat",
                    "user_href": "/profile/Mohammad-Rahmat-1"
                },
                {
                    "user_id": "Ahmed Faizan Siddiqui",
                    "user_href": "/profile/Ahmed-Faizan-Siddiqui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Kenneth Eng",
                "href": "/profile/Richard-Kenneth-Eng"
            },
            "answer_text": "Java has far more more job opportunities at Job Search | Indeed than any other programming language in the world. Data from December 25, 2017 for the entire United States: Java — 58,856Python — 45,622JavaScript — 36,190C++ — 30,290C# — 25,616Objective-C — 17,801Ruby — 17,624PHP — 13,589Perl — 13,344Groovy — 9,732I’m sure you can find something that you like, probably along the lines of enterprise business computing (eg, ERP, CRM), fintech, web development, mobile (Android) development, cloud computing, etc. ",
            "date": "Answered January 3, 2018",
            "views": "61",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wali Morris",
                    "user_href": "/profile/Wali-Morris-2"
                },
                {
                    "user_id": "TheShack InMaine",
                    "user_href": "/profile/TheShack-InMaine"
                },
                {
                    "user_id": "Kunal Vichare",
                    "user_href": "/profile/Kunal-Vichare"
                },
                {
                    "user_id": "Praveen Kumar Singh",
                    "user_href": "/profile/Praveen-Kumar-Singh-156"
                }
            ]
        }
    ]
}