{
    "title": "What should I do if my Verizon phone isn't sending texts? - Quora",
    "tags": [
        "Verizon",
        "Verizon Wireless",
        "Text Messaging"
    ],
    "response": [
        {
            "author_info": {
                "name": "Griffin hijt",
                "href": "/profile/Griffin-hijt"
            },
            "answer_text": "I had that problem with my son's phone, even changed phones, still he couldn't text unless via an app. Called Verizon, found out that when I used family base to restrict him due to grades it didn't resume all features when I lifted restriction. In my Verizon it showed there were no restrictions, but when I Finally called they showed the restriction was lifted by me, but never actually lifted, ugh, I felt awful cuz this was over a year my child used an app to text, it wasn't until I wanted him to use Uber and the text verification wouldn't work that I found out they had lifted all but text restrictions. Sounds silly, but maybe just call like I did and make em figure out why your texts aren't working. Apparently it's not just happening to you…it's a Verizon thing but Lord knows we need our Verizon, they make sure of that, lol. ",
            "date": "Answered May 23, 2018",
            "views": "83",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashley Mack",
                    "user_href": "/profile/Ashley-Mack-60"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evan Mainord",
                "href": "/profile/Evan-Mainord"
            },
            "answer_text": "1. Restart your phone. Should be done at least once a week anyway. 2. If you're receiving but not sending, check the settings in your phone. Especially if it's an iPhone. (Important settings in that one are under Settings > Messaging, and are iMessage and Send as SMS. Definitely recommend Send as SMS to be on at all times.) 3. Network settings reset. Not necessarily something you always have to jump to, but it fixes a LOT of problems. Make sure you know how to reconnect any WiFi and Bluetooth connections. 4. Call Customer Care from another phone (never from the one you're troubleshooting) or find the troubleshooting steps for your phone on vzw.com/support . Anything else to do will be detailed by either of those options. ",
            "date": "Answered September 26, 2017",
            "views": "235",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abdul Hyath",
                    "user_href": "/profile/Abdul-Hyath-3"
                },
                {
                    "user_id": "Lisa Beccia",
                    "user_href": "/profile/Lisa-Beccia"
                },
                {
                    "user_id": "Thomas Sundstrom",
                    "user_href": "/profile/Thomas-Sundstrom"
                }
            ]
        }
    ]
}