{
    "title": "What are the factors that make your city 'unique'? - Quora",
    "tags": [
        "Cities and Towns in India",
        "Cities and Metropolitan Areas"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ratnakar Sadasyula-రత్నాకర్ సదస్యుల",
                "href": "/profile/Ratnakar-Sadasyula-రత్నాకర్-సదస్యుల"
            },
            "answer_text": "I could go on and on about Biryani, Paradise, Charminar, Hi Tech City , but as a Hyderabadi, my love for the city, goes beyond the standard images associated with the city. If I had to give just one good reason why I love Hyderabad, I would say it is the very ethos of the city itself. Hyderabad is a city, that accommodates every thing, the old and the new, the modern and the traditional, the rich, the middle class and the poor. It is a city that has something for everyone, and where any one can feel at home. The well heeled yuppie working at Gachibowli is as much a part of the city, as is the middle class bank officer in Himayat Nagar, or the auto driver in one of the city's numerous bastis. It is a city, which boasts of snazzy multiplexes as well as the humble single screen theaters. If you are a movie lover, you have all options right from the latest Telugu, Hindi blockbuster to the latest Hollywood flick, and if your taste is a bit more esoteric, you have a choice of watching world cinema at one of the city's film clubs. And the same goes for eating out too, you have a choice of posh restaurants offering all kind of global cuisine- Thai, Vietnamese, Italian, Chinese, Mexican to the humble Irani cafes where you can hang in for a chai-biskoot-samosa to the roadside \"bandis\" offering hot dosas or puris right off the carts to the numerous tiffin joints, messes where you can drop in for a quick breakfast or lunch. And if you love books, you have the option of checking into some of the city's famous books stores, or hang out at the numerous 2nd hand book shops, which somehow manage to get you the book you want. It is a city that has a more reasonable cost of living compared to other metros, and offering all the amenities, facilities which you expect from a metro. And for a metro, has a very relaxed and laid-back lifestyle, though of late that is changing somewhat. You have a choice of weekend hangouts from the Hussain Sagar lake to the zoo to a whole lot of resorts which are just an hours drive. It is a city that loves to celebrate it's festivals. Be it Ganesh Puja, Diwali, Holi or Moharram, Eid or X'Mas, the city is in celebration mood, throughout the year, not to mention local festivals like Bonalu, Bathukamma. Hyderabad has from long been welcoming to people from all regions, communities, and that accounts for it's rather unique culture, that is a mix of all influences. It is city where the North meets the South, and where every one is welcomed with open arms, not many really care where you are from. Telugus, Tamils, Marathis, Kannadigas, Mallus, Bhaiyyas from UP, Bihar, Bongs every one is welcome here. A Kannadiga Shyam Benegal is as much a Hyderabadi, as is a Marathi Harsha Bhogle. We accepted a Bong Sarojini Naidu, as much as we did a Haryanvi Saina Nehwal. The fact is in Hyderabad, we really don't care where you are from, as long as you do well in life. And this to me, is what I really love about the city. ",
            "date": "Answered July 18, 2016",
            "views": "15",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dilip Sainathan (திலிப் சாய்நாதன்)",
                    "user_href": "/profile/Dilip-Sainathan-திலிப்-சாய்நாதன்"
                },
                {
                    "user_id": "Pavani Chagara",
                    "user_href": "/profile/Pavani-Chagara"
                },
                {
                    "user_id": "Anusha Vallabhaneni",
                    "user_href": "/profile/Anusha-Vallabhaneni-1"
                },
                {
                    "user_id": "Siva Tej",
                    "user_href": "/profile/Siva-Tej"
                },
                {
                    "user_id": "Suneel Reddy",
                    "user_href": "/profile/Suneel-Reddy-12"
                },
                {
                    "user_id": "Kommina Sivanand",
                    "user_href": "/profile/Kommina-Sivanand"
                },
                {
                    "user_id": "Vamsi Krishna",
                    "user_href": "/profile/Vamsi-Krishna-370"
                },
                {
                    "user_id": "Harishkumar Donthula",
                    "user_href": "/profile/Harishkumar-Donthula"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanjith Karthikeyan",
                "href": "/profile/Sanjith-Karthikeyan"
            },
            "answer_text": "Well I'm from Ranipet. You know why my city is unique?   Ranipet in Tamil Nadu, known for its tanneries and chemical treatment units, is the lone Indian city to make it to the top 10 dirtiest and polluted industrial cities in the world. The New York-based Blacksmith Institute (BI) which streamlines and scientifically identifies polluted cities in the world identified Chernobyl in Ukraine as the most polluted industrial town. “Living in a polluted town is like breathing death every moment. If immediate poisoning doesn’t affect, there is cancer, lung infections and mental retardation to give the people a slow death,” the report said. Located about 100 miles upstream from Chennai, Ranipet is the fourth largest urban area in India with a 3.5 million population.  Although Ranipet is a medium-sized town, its problems pose a potential risk to the population of the nearby Vellore city. A factory in Ranipet manufactures sodium chromate, chromium salts and basic chromium sulfate tanning powder used in the leather industry. According to a study by the Tamil Nadu Pollution Control Board, nearly 15 lakh tonne of solid wastes accumulated over two decades of plant operation are stacked in an open yard on the premises contaminating the groundwater. The contamination has affected the health, resources and livelihood of thousands, the BI report said. There is widespread fear that if the pollution level is left unchecked, the Palar basin, the main drinking water source in the region, could also be contaminated.  ",
            "date": "Answered July 15, 2016",
            "views": "856",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saravanan Malhotra",
                    "user_href": "/profile/Saravanan-Malhotra"
                },
                {
                    "user_id": "Venkata Ramanan",
                    "user_href": "/profile/Venkata-Ramanan-4"
                },
                {
                    "user_id": "Shashank Lamba",
                    "user_href": "/profile/Shashank-Lamba-1"
                },
                {
                    "user_id": "Abhigyan Majumdar",
                    "user_href": "/profile/Abhigyan-Majumdar"
                },
                {
                    "user_id": "Archita Dube",
                    "user_href": "/profile/Archita-Dube-1"
                }
            ]
        }
    ]
}