{
    "title": "What jobs will be NOT be wiped out by Artificial Intelligence? - Quora",
    "tags": [
        "Robotics",
        "Artificial General Intelligence",
        "Automation",
        "Artificial Intelligence",
        "Work"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Taylor",
                "href": "/profile/John-Taylor-368"
            },
            "answer_text": "Something difficult about adapting to technology that isn’t already here is predicting what the technology in question will be like. This is difficult because breakthroughs, which enable more advanced technology, are difficult to predict themselves. What jobs AI will take over and when depends heavily on its capabilities. However, some jobs do indeed appear more likely to be automated than others in the coming decades; for instance, while truck drivers and telemarketers’ jobs are in peril, and while lawyers and employees of financial firms may not be in much less danger, it currently appears somewhat unlikely that AI will replace the jobs of other professions relatively soon. For instance, while AI is ever-improving in the medical field, it will likely not replace all doctors and surgeons within the next several decades. But that’s a temporary fix to a profound issue, and it won’t work forever. Maybe it won’t be until the end of the century that most jobs are taken by AI, or maybe there will always be some jobs for humans, but that doesn’t mean there doesn’t need to be a solution. One idea, though a poor one, is using government to punish or hinder automation. This would put countries that implemented it at a severe disadvantage, and would, again, be a temporary fix. Another proposed idea is that of a Universal Basic Income, a government payout to everyone that covers basic living expenses (food, water, power, clothing, etc.). While it can be criticized as wealth redistributionism, which it is, it may be necessary to prevent wealth from accumulating exclusively in the hands of those who own the factories. Ultimately, in my opinion, to deal with automation, we must take a fundamentally different view of work, and perhaps of our motives for progress. Work doesn’t need to be the part of one’s life that gives meaning. Similarly, profit doesn’t need to be our motive for progress. ",
            "date": "Answered March 30, 2017",
            "views": "466",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Debayan Ghosh Dastidar",
                    "user_href": "/profile/Debayan-Ghosh-Dastidar"
                },
                {
                    "user_id": "Prasad Chitturi",
                    "user_href": "/profile/Prasad-Chitturi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "That depends on the level of AI you’re talking about. Eventually, when computers can be programmed to do everything we now do, there may not be “jobs”. You wake up in the morning, decide to learn geology, start studying it, get bored in a week and move on to something else. Or you don’t get bored, stick with it, and add “geologist” to your resume. People will be free to do what interests us, not what earns us the most money, because with computers doing everything, the economy will be totally different than anything we can imagine at this time. (Ask someone in 17th century Great Britain what jobs will not be wiped out if coal mining were to stop. First, he’d have a hard time imagining a world in which coal wasn’t mined. How do you power, heat or light anything without coal? Then he’d never imagine TV, the internet, computers, gasoline-driven cars, etc., etc. So how will AI affect things we can’t even imagine now, in the first quarter of the 21st century? We can’t even imagine.) ",
            "date": "Answered March 30, 2017",
            "views": "26",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Erian-4"
                },
                {
                    "user_id": "Jenin Jose",
                    "user_href": "/profile/Jenin-Jose-1"
                },
                {
                    "user_id": "Trinh H. Trieu",
                    "user_href": "/profile/Trinh-H-Trieu"
                },
                {
                    "user_id": "Debayan Ghosh Dastidar",
                    "user_href": "/profile/Debayan-Ghosh-Dastidar"
                },
                {
                    "user_id": "John Myrick",
                    "user_href": "/profile/John-Myrick-4"
                },
                {
                    "user_id": "Pranav Jangir",
                    "user_href": "/profile/Pranav-Jangir-1"
                },
                {
                    "user_id": "Christopher Marek",
                    "user_href": "/profile/Christopher-Marek-3"
                },
                {
                    "user_id": "Vaigyanik Atul Tripathi Uneako",
                    "user_href": "/profile/Vaigyanik-Atul-Tripathi-Uneako"
                }
            ]
        }
    ]
}