{
    "title": "What's the difference between iPhone 12 Max, iPhone 12 Pro and iPhone 12 Pro Max? - Quora",
    "tags": [
        "iPhone 12 Pro Max",
        "iPhone 12"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian Isanberg",
                "href": "/profile/Ian-Isanberg"
            },
            "answer_text": "First of all, there is no iPhone 12 Max. There are, however, four different iPhone 12 models with different sizes. From Smallest to Largest: iPhone 12 Mini - 2.53 x 0.29 in. (5.4 in screen)iPhone 12 - 5.78 x 2.82 x 0.29 in. (6.1 in screen)iPhone 12 Pro - 5.78 x 2.82 x 0.29 in. (6.1 in screen) - same size as standard iPhone 12iPhone 12 Pro Max - 6.33 x 3.07 x 0.29 in. (6.7 in screen)The non-pro models have two rear cameras and one front facing camera while the pro models have three rear cameras and front facing camera. The pro models also have a feature called a LIDAR scanner which uses infrared to map out areas around the user. While the exact battery sizes and RAM were not revealed by Apple, it is expected that the Pro Models will have more in both of those departments than the non-pro models. iPhone 12's four models compared: Differences between iPhone 12, Pro, Pro Max and Mini ",
            "date": "Answered October 15, 2020",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oleg Sergeykin",
                "href": "/profile/Oleg-Sergeykin"
            },
            "answer_text": "The basic iPhone is made from aircraft-grade aluminum, while the Pro variant is made from stainless steel. The amount of RAM is different - the iPhone 12 has only 4 GB of RAM, while the iPhone 12 Pro has 6 GB. A simple iPhone can be purchased with 64, 128, or 256 GB of flash memory. iPhone 12 Pro comes with 128GB, 256GB, or 512GB storage. Both the iPhone 12 and iPhone 12 Pro look pretty much the same, here is a comparison of these two models focused on its photography features:  The main difference is the cameras - iPhone 12 has a dual camera (wide-angle module and ultra-wide, both 12 megapixels), while the iPhone 12 Pro has a triple camera (wide, ultra-wide, and telephoto, all 12 megapixels) with a LiDAR sensor (laser rangefinder, useful for augmented reality applications). Here is a detailed overview of their feature from a professional photographer's point of view.: ",
            "date": "Answered October 31, 2020",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ovais Is Live",
                "href": "/profile/Ovais-Is-Live"
            },
            "answer_text": " Hello guys welcome back on TECH IN TUNES with a brand new article on iPhone 12 series I know that some of you guys are eagerly waiting for iPhone 12 and will provide you some good news from iPhone in this post so make sure you read this post completely so lets go straight towards the post. Well the Apple iPhone 12 models have been revealed in a brand new leak and I'll be sharing the details right after this. So we've plenty more leaks this week for the Apple iPhone 12 we've got all sizes revealed as well as brand new cases a better 5g modem than we expected more confirmation of displays and finally a new operating system before we get started though please share the post if you're a fan of Apple products and let me know in the comments what model of the iPhone 12 you're looking forward to the most but the first story of the day is the new 5g modem that could be included in the Apple iPhone 12 some of you may know that most phones used Qualcomm's X55 modem for 5g connectivity and it does do a great job according to a new leak through tsmc is going to start manufacturing the 5 nanometer A14 Bionic chip for Apple and it's also going to be manufacturing at the new X60 modem for Qualcomm the X60 is a 5g modem built on the 5 nanometer process which makes it more efficient than its processor the X60 can also aggregate data from both the millimeter wave and the sub 6 gigahertz bands at the same time and this helps to get the fastest download speed and the lowest latency possible is saw that the X60 modem could well be used in the iPhone 12 considering it they are being manufactured together but I need to be clear this is not confirmation but as soon as we hear more I'll update you guys straight away next we've got news of a new operating system app for the Apple iPhone 12. Click here to read more ",
            "date": "Answered July 26, 2020",
            "views": "143",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Huy Hoang",
                "href": "/profile/Huy-Hoang-155"
            },
            "answer_text": "Assuming the rumors are true, there will actually be 4 phones in Fall 2020. the iPhone 12 and iPhone 12 Max are your default mass market phones, the difference being screen size. The 2 Pro phones are more expensive and their difference is also screen size. There are a lot of Youtube videos going over all these in more detail. ",
            "date": "Answered May 22, 2020",
            "views": "156",
            "upvotes": " Answer requested by Jiang Hu",
            "upvoters": [
                {
                    "user_id": "Casey Linkugel",
                    "user_href": "/profile/Casey-Linkugel-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Schlackman",
                "href": "/profile/Steve-Schlackman-2"
            },
            "answer_text": "None of these phones exist so there is no difference between them. Just Google Mac Rumors if you want speculation. ",
            "date": "Answered May 22, 2020",
            "views": "82",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Travis Shaw",
                "href": "/profile/Travis-Shaw-23"
            },
            "answer_text": "The size of the phone the 12 is small the pro is a regular size and the pro max is the bigger one ",
            "date": "Answered May 12, 2020",
            "views": "86",
            "upvotes": " Answer requested by Jiang Hu"
        }
    ]
}