{
    "title": "What is green technology? - Quora",
    "tags": [
        "Green",
        "Very-Large-Scale Integration",
        "Embedded Systems",
        "Environmentalism",
        "Sustainable Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Hannent",
                "href": "/profile/Bob-Hannent"
            },
            "answer_text": "Green technology is the aim to reduce the environmental impact of products either in production, or consumption. It is also the general application of technology to help the environment. Green technology isn't just about energy usage, it is also about the impact of resources used in processes for production and the impact of the end of life of the product.  This is about sustainability. Examples: What chemicals or energy are required for production? How much is wasted and how is that waste handled? What is the environmental legacy of production?How much energy is used in production?What is the impact of the logistics needed to bring the product to market?How much energy does the product consume? Both in standby and in use?Can the product be reused or recycled?At the end of life of the product what happens to it? What waste legacy does it have?Energy production and recycling technologies are also an important part of green tech. ",
            "date": "Answered November 2, 2014",
            "views": "28",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yogesh M (யோகேஷ் ம)",
                    "user_href": "/profile/Yogesh-M-யோகேஷ்-ம"
                },
                {
                    "user_id": "Priyranjan Kumar",
                    "user_href": "/profile/Priyranjan-Kumar-7"
                },
                {
                    "user_id": "A D GUNA SEKAR",
                    "user_href": "/profile/A-D-GUNA-SEKAR"
                },
                {
                    "user_id": "Priyansh Dubey",
                    "user_href": "/profile/Priyansh-Dubey-4"
                },
                {
                    "user_id": "Ashutosh Singh Mudgal",
                    "user_href": "/profile/Ashutosh-Singh-Mudgal"
                },
                {
                    "user_id": "Louis Schoeman",
                    "user_href": "/profile/Louis-Schoeman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Walton",
                "href": "/profile/Daniel-Walton-42"
            },
            "answer_text": "Here I described about green technology and to know more visit this article. Definition Green Technology It can be defined as a set of methods that reduce the IT impact on the environment and even consider the recycling of many of the components used in these processes allowing other people to continue to benefit from these technologies. These technologies are designed to reduce costs.  Definition. The term Green Computing also known as Green IT or translated into Spanish as Green Technologies refers to the efficient use of computational resources minimizing environmental impact, maximizing their economic viability and ensuring social duties. The concept has evolved over time, adapting to changes in the technological needs of the countries of the South . In Canada, as in the rest of the countries of the North , the concept includes notions of cleanliness or recovery; correct mistakes or try to avoid negative repercussions on the environment. In countries that have not suffered the impacts of industrial pollution, green technologies represent above all an approach based on the manufacture of a commercial product, with a view not only economic, but also environmental, social and cultural.  Currently the green technological processes are formed by sympathizers, related and interested in the green industry and in computing in general, which are launching the political line of the green on issues of information society, technology and open knowledge . Green Computing. The manufacture of computers is a very polluting sector, so the time has come to begin to stop it. The construction of a single laptop consumes two tons of resources and the waste generated reaches 4% of the total in Europe. The computers, moreover, are full of toxic substances (dioxins, cadmium, lead) and all this garbage goes to the countries of the third world. ",
            "date": "Answered April 19, 2018",
            "views": "15",
            "upvotes": " View 43 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yogesh M (யோகேஷ் ம)",
                    "user_href": "/profile/Yogesh-M-யோகேஷ்-ம"
                },
                {
                    "user_id": "Aanand Baskar",
                    "user_href": "/profile/Aanand-Baskar"
                },
                {
                    "user_id": "Ayush Raj Pandey",
                    "user_href": "/profile/Ayush-Raj-Pandey"
                },
                {
                    "user_id": "Turza Barua",
                    "user_href": "/profile/Turza-Barua"
                },
                {
                    "user_id": "Sherrie Gilbert",
                    "user_href": "/profile/Sherrie-Gilbert-2"
                },
                {
                    "user_id": "Trina Baker",
                    "user_href": "/profile/Trina-Baker-11"
                },
                {
                    "user_id": "Peter Trujillo",
                    "user_href": "/profile/Peter-Trujillo-3"
                },
                {
                    "user_id": "Katelyn Faulkner",
                    "user_href": "/profile/Katelyn-Faulkner-1"
                },
                {
                    "user_id": "Hazel Rosales",
                    "user_href": "/profile/Hazel-Rosales-4"
                },
                {
                    "user_id": "Leigh Farrell",
                    "user_href": "/profile/Leigh-Farrell-2"
                }
            ]
        }
    ]
}