{
    "title": "What people want from technology? - Quora",
    "tags": [
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Randolph",
                "href": "/profile/Scott-Randolph-14"
            },
            "answer_text": "Because (young) people these days don’t want to get their hands dirty and they think the jobs where you have to are meaningless. Many years ago, a plumber was considered a blue collar loser. A mechanic was called a grease monkey. An electrician, not much better. A carpenter? A hammer-swinger. Now, our industries can write our own checks. Know why? Because nobody (younger generation) knows how to do anything with their hands. Not even change a tire. In fact, lots of newer cars are not even coming with spare tires. One youngster I spoke to, when asked what he would do if he got a flat tire, said that he would call his dad. His dad (a fairly young man), when asked what HE would do, said he would call Triple AAA (for his son). Of course, it’s the Baby Boomers’ generation fault, right? But nonetheless, it is what it is. One thing I can tell you about ‘tech’. The computer will tell you a) what it is, b) what’s wrong with it, c) what tools and parts you will need to fix it, d) where to get said parts and tools, e) HOW to fix it, but one thing it won’t do: is pick up a wrench and go fix it. We live in a new world of instant gratification, where pushing a button on a keyboard can get you virtually anything you want in a moment’s notice, anywhere in the world. Unfortunately, somebody, somewhere has to actually get up off the couch or from behind a screen and actually DO something to make that happen. Here’s to the Rugged Individualist Generation (I’m a RIG). Mine. A dying breed but one that will be hard missed. A lost art. Great question, BTW. Thank you! ",
            "date": "Answered August 18, 2018",
            "views": "204",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Armand Stephen",
                    "user_href": "/profile/Armand-Stephen"
                },
                {
                    "user_id": "Sally Ann",
                    "user_href": "/profile/Sally-Ann-83"
                },
                {
                    "user_id": "Bill Smith",
                    "user_href": "/profile/Bill-Smith-1198"
                },
                {
                    "user_id": "Alison Bocian",
                    "user_href": "/profile/Alison-Bocian"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Austin",
                "href": "/profile/David-Austin-8"
            },
            "answer_text": "It’s different for everyone. I was technically inclined, and I think it’s interesting. Money probably should be a bigger motivator for me, but it is not the reason I went into tech, nor is it a great reason to be in tech. Most people in tech fields do pretty good by today’s standards, and the stories of those who hit it big are the exceptions, not the rule. Stock options are not a big money for most people in tech. Those who do really well typically do so because of other non-techie skills, like sales, or soft-skills, or because of total dedication … things that generally will yield success in either a tech or non-tech career. A lot of resources will tell you the average wage per career and one of the things you’ll notice in those reports is that many if not most of the highest paid career choices are not tech-centric. Tech wages are a bit better than average, but tech jobs also don’t have a great track record for reliability. Especially in high-tech there tends to be a high turnover. ",
            "date": "Answered August 23, 2018",
            "views": "105",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alison Bocian",
                    "user_href": "/profile/Alison-Bocian"
                }
            ]
        }
    ]
}