{
    "title": "What are the best features of the OnePlus 9? - Quora",
    "tags": [
        "OnePlus 2 (product)",
        "OnePlus 5",
        "OnePlus Smartphones",
        "OnePlus (company)",
        "Features (products and services)",
        "OnePlus One (product)",
        "Android (operating system)",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Blogft.s",
                "href": "/profile/Blogft-s"
            },
            "answer_text": " OnePlus 9 launch could be in just six months, according to a new report. OnePlus 9 rumored specs It’s understandable that it’s quite early to start talking about OnePlus 9 because the OnePlus 8 series just got released a few days ago. The OnePlus 9 should not only fix the shortcomings of OnePlus 8 series but also bring massive upgrades in almost every aspect to keep up with the competition. Let’s have a quick look at some of the features that should come with it. Its display should have a minimum of 120Hz refresh rate.The screen size will likely be between 6.8-inch and 7.09-inch for its Pro variant.It should come with OxygenOS based on Android 11 out of the box. Also, it’ll likely come with the Qualcomm Snapdragon 865+ chipset.OnePlus 9 should come with a minimum storage of 256GB and 526GB for its Pro variant. The maximum storage could top 1TB. A bunch of competing devices including the Asus ROG Phone 2 already offer up to 1TB storage. Also, it’s RAM will likely come as 12GB.Its front camera will remain at 16MP. However, we should expect the rear camera to be 64MP+16Mp+12MP+8MP.OnePlus 9 will also maintain the notch selfie, but, it’ll likely be a hole-punch selfie.We should expect a battery life of 5000mAH, with a 40W fast charge.The device is still a long time away, but some concept creators have already started imagining what it could look like. Kindly Upvote :) Do like and Share ! ",
            "date": "Answered October 23, 2020",
            "views": "416",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pradeep Gund",
                    "user_href": "/profile/Pradeep-Gund-2"
                }
            ]
        }
    ]
}