{
    "title": "What are the surprise features of the OnePlus Nord? - Quora",
    "tags": [
        "OnePlus \"Z\"",
        "OnePlus Nord",
        "OnePlus X",
        "OnePlus Smartphones",
        "Features (products and services)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhinav Jain",
                "href": "/profile/Abhinav-Jain-880"
            },
            "answer_text": "So, OnePlus has confirmed that it will release a new smartphone named OnePlus Nord. It will be a mid-range smartphone and thus would be competing with the likes of iPhone SE, Google Pixel 3a, Samsung A series, and Realme X3 series. OnePlus has confirmed a few things like a redesigned box, flagship level camera with OIS support, and a budget friendly price tag.  Image Source: NDTV Gadgets. Looks awesome, doesn’t it? Now, here are some of the leaked specs: Display: The OnePlus Nord is expected to have a 6.55 inch display. It’s expected to have a resolution of 2280 x 1080 (Full HD+). The display type (OLED or LCD) is not known yet. As there is no fingerprint sensor on the back, there is a good chance that OnePlus would use an in-display fingerprint sensor. If that is the case, OnePlus would use an OLED display.If the fingerprint sensor is side-mounted, the display might be LCD. It is expected to be 90Hz enabled, as OnePlus, last year said that it would release all its smartphones with at least 90Hz starting from the OnePlus 7 Pro. Image Source: Gizmochina 2. Performance: It is expected to come with Snapdragon 765G coupled with 6GB RAM (or 8GB). The RAM and storage type are not known yet, but it is expected to have a LPDDR4x RAM and UFS 3.0 storage. One weapon OnePlus has in the arsenal is the OxygenOS.  Image Source: AnandTech It is clean ad simple, thus snappy. You can expect a solid performance from this smartphone. 3. Camera: The company has confirmed that this smartphone would have a flagship level camera with OIS support. The phone is expected come with quad camera setup and dual front camera.  Image Source: NDTV Gadgets The rear cameras include the main lens (48 MP), ultra wide lens (8 MP), macro lens (5MP) and a depth sensor (2 MP). The front cameras would be of the combination 32MP+8MP. OIS means Optical Image Stabilisation. This ensures that you get stable photos and your videos are steady as well. 4. Battery: It is expected to come with a 4300 mAh cell, which can get you through the day easily, and a 30W Warp Charger. Overall, you’re getting a long lasting battery life along with a super fast charger. So, this is the OnePlus Nord. It would be released on 21st July and OnePlus claims it to be the world’s first AR launch. To catch the event live, download the OnePlus Nord AR app from the Play Store or the App Store. ",
            "date": "Answered July 9, 2020",
            "views": "500",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Drz-Viper-GAMING"
                },
                {
                    "user_id": "Azza Singh",
                    "user_href": "/profile/Azza-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jai Mishra",
                "href": "/profile/Jai-Mishra-191"
            },
            "answer_text": "For me, the OnePlus Nord is a OnePlus phone however I look at it. From the box to the packaging of components inside, this phone has all the characteristics we are used to from OnePlus. Its design is no different. It has the same look and feel of the OnePlus 8 series, with one exception. The OnePlus Nord has its camera module a bit towards the left edge and not in the middle as with the other two phones launched recently. But despite this, there is a lot similar in even the camera module. These three phones clearly come from one design family, no DNA testing needed. The phone offers a firm grip and is about the same size as the OnePlus 8, though the latter seems to be slightly taller. The display has always been an area of focus for OnePlus, which keeps pushing what it can do on this front. With the OnePlus Nord, there is again a 90Hz display on offer. The 6.44-inch Fluid AMOLED springs to life as you unlock the screen, and pops in your eyes. However, using the phone under the bright Delhi sun, I got the impression that this was a less bright screen than the OnePlus 8 Pro. While the OnePlus Nord might look a lot like the OnePlus 8 series, it is a more affordable phone and hence sports the Qualcomm Snapdragon 765G processor and not the top of the line 855 chipset. The review unit I have offers 12GB RAM and 256GB storage, which is as good as it gets. If you care, this is a 5G phone. But then India is not (yet) a 5G country. Where it clearly has spent time is figuring out the camera configuration and experience that can floor the buyer. It was hard to miss the two lenses peeping at you in the corner of the display. Yes, the phone has a dual selfie camera set up — a 32MP main camera + 8MP wide angle combo. There is more at the rear, in fact four cameras — a 48MP main camera + 8MP + 5MP + 2MP — out of which one is the colour filter lens. In the app, you get an ultra wide 0.6x, main camera, and a 2x telephoto optical zoom. The selfie has two modes — regular and wide. The camera app offers all modes, including a Pro mode that lets you change all settings. There are also a lot of new colour filters, but the photochrom one is missing. There is also a macro mode like in the OnePlus 8 series. The OnePlus Nord sports a 4115mAh battery which should last a whole day and more on full charge. And with Warp charge you can juice-up in about 30 minutes. Hope, you find it useful!!! ",
            "date": "Answered July 22, 2020",
            "views": "205",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishu",
                    "user_href": "/profile/Vishu-188"
                },
                {
                    "user_id": "Samir Kumar Pradhan",
                    "user_href": "/profile/Samir-Kumar-Pradhan-17"
                }
            ]
        }
    ]
}