{
    "title": "What are some pros and cons of the Poco M2 Pro? - Quora",
    "tags": [
        "Xiaomi Poco M2 Pro",
        "Cameras",
        "Mobile Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sahastranshu Singh",
                "href": "/profile/Sahastranshu-Singh-3"
            },
            "answer_text": " Well, that is a very broad question. However I will try to answer it in as brief a manner as possible. Pros: Qualcomm Snapdragon 720G (most powerful processor under Rs. 20,000 except for SD 845 in Poco F1)Low Price (Base variant starts at Rs 14000 for 4GB of Ram and 64GB of storage, u can increase your budget just Rs 1000 and get the 15000 variant which comes with 6GB of Ram and 64GB of storage.)Huge Battery (5000 Man) - combined with the efficient 8nm processor, you can easily expect more than a day's battery life even with heavy usage and light users can will be able to get 2 days or may be even more).Fast Charging (33W) - It comes with 33W fast charger in the box which is nice and can get you from 0–50 % in just 30 minutes. It is the fastest charging available under Rs. 15000.Premium Look - Comes with Corning Gorilla Glass 5 for both front and back, which gives it a premium look and in-hand feel (though it also makes it slippery, use case).Cons: - Note that these are not strictly cons as none of the following is a deal-breaker or something because of which you absolutely cannot buy this smartphone. Security Concerns - It comes installed with a lot of unwanted apps some of which are already banned by the Indian government, for ex Helo. There are also other apps which take unecessary permissions and can access your personal information.The cons I am about to state now aren't exactly cons but just might not be agreeable to some people, depending upon their personal choice or preference. 2. Chinese Brand - Poco is owned by Xiaomi which is a Chinese company. I think it's up to the people to decide what they want to buy because it's their money, and not everyone can afford non Chinese smartphones. 3. 60hz LCD display - It comes with an IPS LCD Full HD+ display. Those wanting AMOLED display in this range should look at M series from Samsung. Also it doesn't have a high refresh rate display that is trending nowadays, and is offered by competitor such as Realme in the same price bracket. It's still a high resolution display with good colours. I personally don't feel like I am loosing out on much especially for the price. It offers a more efficient processsor than Realme 6 and a more powerful one than Samsung. I don't think the display is a con because you get much more all round package in this phone. Like I said earlier, the cons from here on is all dependent on your personal choice and preferences. 4. MIUI - it comes with MIUI, it can be both a con and a pro depending upon how you feel about it. This version of MIUI won't serve you ads but there is a lot of preinstalled unwanted apps that may send of spammy notifications and recommendations. On the other hand MIUI is feature rich and is highly customizable. It offers in built screen ",
            "date": "Updated August 5, 2020",
            "views": "41",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hari Hara",
                    "user_href": "/profile/Hari-Hara-34"
                },
                {
                    "user_id": "Shahnoor Ahmed",
                    "user_href": "/profile/Shahnoor-Ahmed-12"
                },
                {
                    "user_id": "Pratik Solanke",
                    "user_href": "/profile/Pratik-Solanke-16"
                },
                {
                    "user_id": "Rajat Singh",
                    "user_href": "/profile/Rajat-Singh-631"
                },
                {
                    "user_id": "Sukhomoy Bhattacharjee (সুখময় ভট্টাচার্য)",
                    "user_href": "/profile/Sukhomoy-Bhattacharjee-সুখময়-ভট্টাচার্য"
                },
                {
                    "user_id": "Mahendran Kumar",
                    "user_href": "/profile/Mahendran-Kumar-23"
                },
                {
                    "user_id": "Pebble J",
                    "user_href": "/profile/Pebble-J"
                },
                {
                    "user_id": "Amit",
                    "user_href": "/profile/Amit-अमित-2"
                },
                {
                    "user_id": "Ravi Kumar Sharma",
                    "user_href": "/profile/Ravi-Kumar-Sharma-114"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nishant Ghangale",
                "href": "/profile/Nishant-Ghangale"
            },
            "answer_text": "Pros Good build quality Sharp display Powerful processor Solid battery life Decent daylight camera performance cons A little bulky Weak low-light photo quality By this I think this will be a good buy. ",
            "date": "Answered July 20, 2020",
            "views": "18",
            "upvotes": " Answer requested by Uday Chatterjee"
        }
    ]
}