{
    "title": "What is a common feature in a car but most people don’t know what it’s used for? - Quora",
    "tags": [
        "BMW Cars",
        "Features (products and services)",
        "Car Care",
        "Knowledge",
        "Automotive Industry",
        "Technology",
        "Cars and Automobiles",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gautam Naib",
                "href": "/profile/Gautam-Naib"
            },
            "answer_text": "I’ll share some of the common/cool features of a BMW as I know them well. Some of these features may work with older generation BMWs, or be available on other vehicle manufacturers. I will be using my 2019 X5 (with iDrive ver. 7) as a demo in this post.   BMW Key features (will work on older BMWs)Press lock 3 times to start the car.Press lock 3 more times once the car is started to turn it off.Hold unlock to open all windows + sunroof.Hold lock to close windows/sunroof (this one is model dependent).The BMW display key (right) can perform lot of these features with two way interaction. Note: the 5 and 7 series do offer the remote park option on the display key. I have not seen any other models offer it.  BMW door handle features (comfort access)A part from un/locking the door, the door handle equipped with comfort access has another hidden feature. Pressing and holding the lock/unlock “ridge” for about 5 seconds (pictured below) will allow you to open or close the windows + sunroof without going back into the vehicle. This trick will work with almost any generation equipped with comfort access. Try it out. Leave the windows or sunroof open and walk outside of the car with the keys in your pocket and hold the ridge. Kick-open tail gateThis feature is not new. Kick your foot under the car and the trunk opens. But did you know it can also close the trunk? Kick once again to close and enjoy never touching your trunk again! This feature works across many manufacturers and older BMWs. I noticed that Mercedes, Audi, Infiniti, and Acura, for example, have the same feature.  Programmable memory buttonsYou’ll notice that the interior infotainment system always comes with buttons labelled 1 to 8. Most people store radio stations on them. But did you know you can actually save any setting/feature in the vehicle with these buttons? For example, say you want to go to a certain setting or feature such as Apple Carplay. You simply go there and hold down #1. Once you hear the ding, the setting will be saved within that button! Now, instead of finding a setting or feature, you simply push #1. This trick has been around for many generations of BMWs.  The “A” letter above a light on the stalkThis is the automatic high beams feature and most manufacturers or older BMWs have it. Rain sensing wipersIf you have rain sensing wipers, you always have to turn them on so that they auto-wipe when rain comes. It’s a pretty popular feature among many manufacturers. On BMWs, it means turning the wiper stalk so that the “Auto” lights up. And you can control the sensitivity on the left. Hidden storage compartmentThis may only be a feature on newer BMWs such as the X3/X5/X6. There is a hidden storage compartment to the left of the steering wheel. Control upper, right side passenger seatI have seen this feature on other luxury cars, as well as BMW. There is a button that will allow you to control the passengers seat for whatever reason once pushed. See image below. Activation pointsThis is a very cool feature I noticed on the newer BMWs. I believe you need iDrive 7 to use it. You can set an activation point so that anytime you arrive at a certain destination, the front camera will auto turn-on once the point has been reached. It’s a very neat feature to help with parking or to keep you hands on the steering wheel at all times. This feature does not work at higher speeds due to obvious reasons (I blurred out the house due to the address being on it).  Auto brake hold (Auto H)This features allows your vehicle to brake for you anytime your vehicle is stopped without putting your foot on the brake. Popular among many manufacturers. Hill descent controlMost people don’t know this, but the button with a vehicle going downhill is to help stabilize speed going down a hill, and is used by many manufacturers. Car wash modeA lot of new vehicles have a car wash mode to make entering the bay easier and give the best visibility. In BMWs, its located in the camera settings. I believe this is another iDrive 7 feature. Auto climate control seatsNewer BMWs allow you to choose an external temperature where seats will auto turn on the heat or cooled feature when the vehicle is started. It’s located in the climate settings. It’s a neat feature. Again, I think this one is just iDrive 7. Side mirrors tilt down in reverseYou can choose which side-view mirror tilts downward when in reverse by changing the mirror selection. DVD PlayerMost people don’t know this, but vehicles with a DVD/CD slot and HDD navigation can play DVDs when one is inserted in the slot. The vehicle has to be in park. I have tested this out on BMW, Mercedes, Nissan, Honda, Infiniti, etc… Newer cars don’t have CD slots but there are ways around this which I will speak about below.(image from my 2011 3 Series)  BMW CodingThere are many “codes” you can create with you vehicle that can unlock features that your car didn’t have. They can be USB installed or via a laptop and wire. I had coded my previous BMWs but have not done anything to my current one. Mercedes and Audi are two other popular manufacturers that can be coded similar to BMW.One of the most popular codes is unlocking DVD while driving and the USB media player. This will allow you to play movies or music videos via a USB and/or while driving. If you don’t have DVD in motion unlocked, then you need to be parked to view videos.Other popular codes are features such as turn signals in the HUD, changing startup animations, full text message display, etc… You can also code older cars to have newer car features. Edit 1: I thought of a few more. Heads up display (HUD) for mediaYou can scroll through songs in your current playlist or media source via the control wheel directly on the HUD (image is a little blurry as its hard to capture images on the HUD).  Customize gesture controlNewer BMWs brought the gesture control feature. It allows you to change volume, songs, or accept phone calls by waving your hand. What people may not know is that you can customize it to add more gestures. This is an iDrive 7 feature. More features of the display keyThis key can start the vehicle by hitting lock 3 times as mentioned before. It can also start the vehicle via pushing a virtual start button.There are more security features you can view by diving deeper into the options.   Edit 2: I remembered a few more as I was driving. Assisted driving (semi-autonomous)Many manufacturers have autonomous driving and the feature works great. One hidden feature I noticed within BMW is that if you signal while in the mode, it will change lanes for you! It doesn’t always work flawlessly, but if it does, you’ll notice an arrow popup on the dash.  (this image is not my vehicle as I did not want to record at high speeds).  Apple CarPlay and Google MapsApple CarPlay is available on almost any manufacturer nowadays. One cool thing I noticed was the attention to detail using Google Maps. If you change your vehicle icon in the phone app, it will show up in CarPlay. I have tested this on other vehicles and it works.Added note: I love BMW’s CarPlay because it takes up the whole screen. It is very clean. Smart Talk (conversational A.I.)Just as you can talk to Alexa or Siri, you can say “Hey BMW” and the car will react and bring up the BMW assistant.Mercedes has a feature where you say “Hey Mercedes” and it works similarly. Cargo coverThe cargo cover no longer needs to be taken out of the vehicle. It can be stored in the actual trunk! This is a neat feature so you don’t lose it. As well, there is ample extra storage due to no spare tire. 3D ViewI love the 3D view feature as it makes parking in hard areas a breeze. You can literally see a birds eye view of the vehicle at any angle. As well, you can use the touch screen to move the angle around the car or the gesture control. I am not sure what generation of BMWs introduced this feature but this one is quite advanced.Many manufacturers have introduced this in the last few years and have tweaked it to best suit their needs.  Back-up assistantI believe this is BMW and iDrive 7 exclusive. This is a handy feature if you have trouble taking vehicles out of tight spaces. The vehicle will remember how you got into any spot (up to 50m) and take the vehicle out for you using the onboard computer memory and sensors. As well, the steering wheel lights up to assist and provide you feedback.All you (the driver) simply do is press and de-press the brake pedal.  BMW laser lightsYou may have noticed a lot of new manufacturers advertising “laser lighting” as it’s the new trend. These lights are sold as brighter, efficient, and having a longer range. Any BMW that has laser lights will have a blue tinge in the actual lights. So if you’ve noticed this, it actually serves a purpose, as well, it looks good.Side note: In Europe, laser lights are allowed on low beam and high beam. In North America, laser lights are only allowed on the high beam.  Edit 3: Got another one! Swivelling camerasThere is a 360-degree camera like most cars. But the new BMWs now offer “swivel” cameras that turn with your wheel so you have a greater view of your surroundings.   ",
            "date": "Updated May 20, 2020",
            "views": "653",
            "upvotes": " View 300 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aniketh Anantha",
                    "user_href": "/profile/Aniketh-Anantha"
                },
                {
                    "user_id": "Jonathan Kline",
                    "user_href": "/profile/Jonathan-Kline-2"
                },
                {
                    "user_id": "Atul Ashish",
                    "user_href": "/profile/Atul-Ashish-3"
                },
                {
                    "user_id": "Jeff Orwell",
                    "user_href": "/profile/Jeff-Orwell"
                },
                {
                    "user_id": "Brian Van Bogart",
                    "user_href": "/profile/Brian-Van-Bogart"
                },
                {
                    "user_id": "Ashwin Bhat",
                    "user_href": "/profile/Ashwin-Bhat-8"
                },
                {
                    "user_id": "Syed Akbar Ali",
                    "user_href": "/profile/Syed-Akbar-Ali-20"
                },
                {
                    "user_id": "Sidharth Singh",
                    "user_href": "/profile/Sidharth-Singh-334"
                },
                {
                    "user_id": "Arshdeep Singh",
                    "user_href": "/profile/Arshdeep-Singh-1486"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta-494"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Andranik Moumjian",
                "href": "/profile/Anthony-Andranik-Moumjian"
            },
            "answer_text": "Newer cars are becoming battery powered everything. My car has a key that allows me to unlock and lock the door. If I have the key in my pocket, I can just put my hand on the door, and the car unlocks. However, this works the other way, too. If I get out of the car, I just press on the the indents placed on the door, and it will lock. I had this on my 2010 Toyota and I have it on my 2017, too. The car will actually remind you when your key battery is low. This is a super easy thing to fix, and it reminds you that you actually have a physical key, too. Even if your car is push to start. If you push on the latch on your key, you can remove a skinny key out of it. That same key can now be used to disjoint the plastic that keeps your key together. It is literally like a Lego, and you can purchase a pack of 3V lithium coin batteries for like 2 dollars to replace it. You can also use this physical key to lock the glove-box on some cars so you can valet your car knowing your things are safe.    The high beam versus the headlight. A large amount of people on the road drive with their high beams on. Your high beam light is the blue one on the dashboard. Your headlight is the green one. The difference is drastic, and it blinds other people on the road. The high beam is usually only for rural areas where it’s dark and there are no other cars on the road. Don’t confuse these two things.  This picture above is the side view mirror adjustment. You can adjust either the left or the right mirrors. Usually, this is a useless function. But imagine you are trying to parallel park in a busy area between two cars? You can actually lower the side that is going to be against the curb, on your passenger side. Now you can see how close your tire or wheel and bumper is to the curb to better correct yourself into the spot easier. Remember to re-adjust when you get out of the spot. You want to know what side of the car your gas cap is on? Almost every car has an arrow next to the gasoline gauge on your car. You don’t need to remember if you forgot. You don’t need to check outside the car if you are renting it or it isn’t yours. That arrow on the dash tells you exactly where it is. Is this light on? This is your tire pressure monitor system. This can sometimes mean your tire is slightly low, or it can mean that the sensor for the monitor system is acting up (if it is too cold or too hot, or if the temperature changes too drastically overnight). If you inspect the tires outside your car, and you find that none of them have a puncture, you can reset this light from inside your car. Check under your steering wheel for a TPMS reset button. With the car on, you usually just press and hold the button for about 5–10 seconds, and the light will flash for a while before disappearing. If it comes back on later, re-inspect your tire for any punctures or check the pressure. On newer cars, like my Prius, you can reset this light directly from the the dashboard navigation.Is your maintenance/oil change light on? You’ll see the wrench or “change oil soon” sign. This is an automatic thing that works on a clock. A lot of cars use synthetic oil today, and synthetic oil is good for 10,000 miles. Most cars still have the “maintenance soon” or “oil change soon” automatically every 5,000 miles. You can reset this, it’s different from car to car, but remember to check the car’s service manual and the manufacturer’s recommended mileage for an oil change or general service. Just because the car is showing a light doesn’t mean it needs work. Climate control. There are quite a few quirks with most cars that isn’t really written anywhere. If you don’t have “air re-circulation” pressed (the picture of the car with a looped arrow inside it), then the car will continue to operate by bringing in air from outside the vehicle. Now, you can actually heat that air, if you’d like, without turning on the climate control. Turn the climate control on, and then turn the temperature to your desired setting. Turn the climate control back off, but don’t turn on “air-re-circulation”. Now you get a bit of heating, or a lot of it, depending on whether you are driving fast or not. Also, most cars have a way to prioritize which vents feed air into the car. The side vents that allow you to shut them? That’s allowing more air to be pushed through the center. The center can be shut off? That means more air through the sides. In modern cars, you can actually turn the climate control to “driver priority” or “front passenger” priority.Do you want to hook up a phone to the car’s Bluetooth to listen to music? If you know you’re going to do this, you need to add the phone to the car before it is moving. A lot of newer cars will not allow you to add new phones to the car’s list when it is in motion. In my Toyota, this functionality is disabled, and I have to literally stop to do this. It’s for your safety, so do it beforehand.",
            "date": "Answered February 24, 2020",
            "views": "1013",
            "upvotes": " View 422 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Farihin Mohd Fitri",
                    "user_href": "/profile/Farihin-Mohd-Fitri"
                },
                {
                    "user_id": "Kim Wilcox",
                    "user_href": "/profile/Kim-Wilcox-11"
                },
                {
                    "user_id": "Christopher DesRochers",
                    "user_href": "/profile/Christopher-DesRochers-2"
                },
                {
                    "user_id": "Jonathan Kline",
                    "user_href": "/profile/Jonathan-Kline-2"
                },
                {
                    "user_id": "Anshul Saini |⋈|",
                    "user_href": "/profile/Anshul-Saini-65"
                },
                {
                    "user_id": "Terry Rogers",
                    "user_href": "/profile/Terry-Rogers-21"
                },
                {
                    "user_id": "Gerhard Fiedler",
                    "user_href": "/profile/Gerhard-Fiedler"
                },
                {
                    "user_id": "Julie Wong",
                    "user_href": "/profile/Julie-Wong-22"
                },
                {
                    "user_id": "Rob Simpson",
                    "user_href": "/profile/Rob-Simpson-36"
                },
                {
                    "user_id": "Jasper He",
                    "user_href": "/profile/Jasper-He-5"
                }
            ]
        }
    ]
}