{
    "title": "What can I do to inspire myself to be successful? - Quora",
    "tags": [
        "Success",
        "Inspiration"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mimita Biswas",
                "href": "/profile/Mimita-Biswas-1"
            },
            "answer_text": "You're asking this from others on Quora. That means, you really don't know what you want to do in your life. There can be two reasons, either you are confused of what you want to do, what's you passion or you have not decided anything yet. The simplest way, my friend, is to go through yourself first. Go and have some research on your life, on yourself. Find out what you want to become or what you are interested in. That’s the thing which will motivate you. Think now, in future, your dearest child gets kidnapped, the kidnappers are asking for huge bucks. The climax starts now, you must have the money to save your child because you really don't have enough time to call the police. If you don't give the money, your child will be killed (hope god will not do so). That's where you need money. Yet, money can't buy happiness, but I would rather cry in a Lamborghini than on a bus. This is my motivation because I belong to a not so well to do family. I must have enough money to make my future bright and so must you, everyone must. Also, all the efforts I put are not only just for myself, they are more for my parents. I know that my parents had struggled a lot to make me what I am today, to provide me all the facilities and happiness which I need, and they are still struggling. In my opinion, the best motivations are one's parents and one's dreams. I don't exactly know your dreams, but I know that everyone have some and to accomplish your goals, you must thrive in strenuous situations. When you want something as bad as you need to breath, you will be successful. I hope this helps. Regards: The musical girl:)  α ",
            "date": "Updated December 12, 2017",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pranjal Pandey",
                    "user_href": "/profile/Pranjal-Pandey-54"
                },
                {
                    "user_id": "Kaushik Majumdar",
                    "user_href": "/profile/Kaushik-Majumdar-9"
                },
                {
                    "user_id": "M. Zain Gohar",
                    "user_href": "/profile/M-Zain-Gohar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehak Garg",
                "href": "/profile/Mehak-Garg-93"
            },
            "answer_text": "If i talk about myself, i am the only one who can inspire myself to succeed in life. The very first step of success is to know your desire and passion. If you are not passionate within yourself then, sorry to say my dear friend you can’t succeed in your life. Motivation is the only source for success and nothing is better than self motivation. The secret of getting success is to getting ahead and the secret of getting ahead is to set your goals and achieve it regularly. Everyone has some goals in their lives and it is not wrong to say we have multiple goals at same time like relationship goals, financial goals, career goals, etc. Having so many goals at a time can divert a person very easily. Sometimes, if we are lacking in achieving goals we started feeling unmotivated. We feel like to give up on our goals and this is the main reason behind our unsuccessful life. We need something to keep us motivated. There are so many ways described by various people to keep ourselves motivated like nowadays inspirational lectures are conducted, there are so many motivational videos available on the internet, etc but they are not enough to get that motivation in us. I agree, after going through a motivational session we feel motivated but that motivation stays only for some time. It is only the self motivation which helps you in doing well and in achieving your goals in spite of so many obstacles and failure. ",
            "date": "Answered September 15, 2019",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaswanth Kocherla",
                    "user_href": "/profile/Jaswanth-Kocherla"
                },
                {
                    "user_id": "Rohan",
                    "user_href": "/profile/Rohan-1505"
                },
                {
                    "user_id": "Qayam Khan",
                    "user_href": "/profile/Qayam-Khan-1"
                },
                {
                    "user_id": "Pankaj Singh",
                    "user_href": "/profile/Pankaj-Singh-8"
                }
            ]
        }
    ]
}