{
    "title": "What is the disadvantage of gadgets? - Quora",
    "tags": [
        "Gadgets"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Smith",
                "href": "/profile/Robert-Smith-1662"
            },
            "answer_text": "The disadvantages of new technologies and gadgets are discussed below:   Online fraud :  Sometimes we use internet for online transactions, there is always a possibility of being a victim of online fraud. As an example, impostors may steal our credit card information and use them for their own monetary gain.  Dependency on gadgets :  People are becoming mechanical as they are getting more and dependent on gadgets. As we all know, by using gadgets our complicated life becomes simpler. It is because we always use gadgets to solve our complicated problems. As an example, students will always make a research about their assignment and just copy the point of the assignment without thinking. So, their lives become simpler because they do not have to think the content of the assignment and use less time to complete that task.  Integrating new technology :  It is often difficult to take a business-related decision about whether to buy the latest technology or wait for some new invention. Moreover, implementing new technology in a business can be quite expensive; therefore, we need to decide whether or not we actually need it. Above all, integrating a new technology in a business is a quite difficult task in itself.  Technology related to diseases :  Human beings are addicted to the new technologies and gadgets, especially internet and computers. Moreover, young people are getting more and more addicted to smartphones. Many Scientists believe that radiation from smartphones may cause blurring vision, headaches and earaches and may be the reason for cancer too. ",
            "date": "Answered November 16, 2017",
            "views": "142",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zainab Fatima",
                    "user_href": "/profile/Zainab-Fatima-256"
                },
                {
                    "user_id": "Jyoti Goyal",
                    "user_href": "/profile/Jyoti-Goyal-175"
                },
                {
                    "user_id": "Anand D",
                    "user_href": "/profile/Anand-D-73"
                },
                {
                    "user_id": "Jackson Hughes",
                    "user_href": "/profile/Jackson-Hughes-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arkady Vasiliev",
                "href": "/profile/Arkady-Vasiliev"
            },
            "answer_text": "Gadgets plays an important role in our day to day life. There are certain disadvantages of using gadgets. Students get addicted to gaming, texting, talking on phone. They show lazy attitude towards studying. Excess use of gadgets may create health problems. Because of the use of gadgets we give less important in communication between our near ones. Now a day's people are too lazy, they are unable to do the works without gadgets. Living without gadgets is like living without air. ",
            "date": "Answered September 4, 2018",
            "views": "133",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Senthilkumar P",
                    "user_href": "/profile/Senthilkumar-P-21"
                },
                {
                    "user_id": "Jay Kumar",
                    "user_href": "/profile/Jay-Kumar-1734"
                },
                {
                    "user_id": "Sonia Bhatia",
                    "user_href": "/profile/Sonia-Bhatia-109"
                },
                {
                    "user_id": "Amita Babel",
                    "user_href": "/profile/Amita-Babel"
                },
                {
                    "user_id": "Volisetty Simhachalam",
                    "user_href": "/profile/Volisetty-Simhachalam"
                },
                {
                    "user_id": "Shivmangal Chaturvedi",
                    "user_href": "/profile/Shivmangal-Chaturvedi"
                },
                {
                    "user_id": "Sagar Kumar",
                    "user_href": "/profile/Sagar-Kumar-433"
                },
                {
                    "user_id": "Sally Glass",
                    "user_href": "/profile/Sally-Glass"
                }
            ]
        }
    ]
}