{
    "title": "What technology is going to replace PDF? - Quora",
    "tags": [
        "PDF (file format)",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Gruszynski",
                "href": "/profile/Jeff-Gruszynski"
            },
            "answer_text": "As others have said, it’s very likely NOTHING “new” will replace it. Maybe a new version of PDF by any other name. PDF has a role far beyond encapsulating a few print documents on the web. PDF is the basis of Apple’s macOS display system which is why you can always “print” a PDF of ANY document on a Mac. If you can see it (is in an NSView object), it can be printed, and if it can be printed, it can be printed as PDF. PDF is also the central interchange document format for the entire publishing industry: all books, magazines and brochures that become paper are all transferred to the printing press using PDF. This is an area that most people do not know exists. So changing with just these installed bases alone makes a replacement very unlikely. “Well done, Adobe! You have a long-lasting monopoly!” :-) What will likely occur is new versions of PDF that do new things. BTW PDF has a direct predecessor: PostScript (also invented by Adobe). PDF is essential a page-oriented PostScript document with some added formatting and structures. This is why it’s easy to convert PostScript to PDF as well. PostScript:PDF = Whole Document Definition:Per-Page Document Definition. PostScript is itself a programming language so it’s very powerful and being Turing Complete, inherently more powerful than (most) any mark-up language. So you’d also have to come up with something of that level of capability. It would seem to be “baked in” to our world as much as Roman chariot wheel bases are: A Railroad Track is the Width of Two Horses. ",
            "date": "Answered February 8, 2017",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Filip Milosavljevic",
                    "user_href": "/profile/Filip-Milosavljevic-2"
                },
                {
                    "user_id": "Karan Mehta",
                    "user_href": "/profile/Karan-Mehta-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Burger",
                "href": "/profile/Alan-Burger-1"
            },
            "answer_text": "The problems with PDF’s start with paper itself! We have a problem with paper! Not for the typical reasons, most people offer up, which is a problem with the paper production process. People often tout environmental issues as a reason to stop using paper. Deforestation; carbon footprint; water usage are the usual culprits. The truth is that there is a lot of paper being produced using extremely sustainable methods that make most those gripes null and void. Another grumble often voiced is that paper is challenging and expensive to deal with in business processes. The solution is usually to create digitized, usually PDF, versions of those paper documents and introduce them into the workflow. Organizations will go to elaborate lengths to use OCR and even AI to extract the valuable data, but extensive manual work still exists to deal with exceptions.  Creating digital versions of paper documents is like putting a bandaid on a festering sore. It temporarily improves the situation but does nothing to treat the infection or underlying cause. Let's face it - the document format we still use today was made for humans at a time before computing devices entered the mainstream. In practically every digital domain, we do not engage with digital representations of the physical object anymore. When the first generation of iPhone's was released, we used skeuomorphic representations of real-world objects.  The music player looked like an old school tape deck; the news/book reader looked like a bookshelf. While this was initially useful and needed for us to make the transition from tape decks, newspapers, and books - the whole digital landscape quickly moved beyond skeuomorphic designs to more practical and useful designs. Now when you engage with a website or phone or tablet, it does not try to mimic the real-world. We have moved beyond that. Not so for paper documents. Digital paper documents, usually PDF, still look the same as they did in 1922. It is time for a new standard I would argue that we need to stop digitizing paper and move to an entirely new document format. A format that is born of the digital world. I believe the following should be attributes of a new digital document format:  Adapts and works seamlessly on all devices and easily allows people and systems to get to the embedded data. It should not be necessary to have to cut & paste text from documents to get the information we need. Export of data should be a native feature.Behave more like web pages in terms of features and functionality. Allow dynamic graphics; video; animation, hyperlinks, drill through; auto-completing forms and even voice query. Make it work more like the user interfaces with already deal with on our digital devices.Use AI to produce a document summary, sentiment analysis, voice query, and deep understanding of the content.An improved security and access model. PDF documents have simple outdated passwords or have to buried behind other more secure access methods.Allow for it to be printed but with better granular control of the output.﻿It is time to rethink digital documents. In many jobs, people spend over 50% of their time dealing with digitized paper versions of documents. Much of this time is not dealing with the content but time spent finding content and wrangling information and data from the document. It is time to reinvent the document standard. Productivity will dramatically improve, and every person will benefit. ",
            "date": "Answered October 26, 2019",
            "views": "728",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sean Filidis",
                "href": "/profile/Sean-Filidis-1"
            },
            "answer_text": "There are certain uses for PDFs — like saving a digital receipt when you buy a ticket — that I don’t think will change any time soon. But PDFs for public facing content — think of eBooks, brochures, annual reports, white papers, proposals, etcetera — are being phased out. The problem with PDF is that they are notoriously difficult to view on mobile devices. It requires lots of zooming and panning around. And, as we all know, mobile content consumption is steadily rising.  For this very reason, HTML5-based PDF replacements already exist, and are used by many big companies for public content. Foleon (disclaimer: I work here), for example, is a software tool that specifically positions itself as a PDF replacement for businesses. ",
            "date": "Answered March 29, 2019",
            "views": "483",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johnny May",
                    "user_href": "/profile/Johnny-May-22"
                },
                {
                    "user_id": "Dennis Looijenga",
                    "user_href": "/profile/Dennis-Looijenga"
                },
                {
                    "user_id": "Chiel De Leeuw",
                    "user_href": "/profile/Chiel-De-Leeuw-1"
                },
                {
                    "user_id": "Michiel Schouten",
                    "user_href": "/profile/Michiel-Schouten"
                },
                {
                    "user_id": "Conrad Hawk",
                    "user_href": "/profile/Conrad-Hawk-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Hawkins",
                "href": "/profile/David-Hawkins-28"
            },
            "answer_text": "Not much, as long as we have so many different ever-so-slightly-incompatible devices and applications. The lowly PDF is viewable on any device, and can be dumped to any printer, retaining its fonts, images, and format. It is generally a small file, so easily sent to/from almost any device, by many different methods. The next development I would like to see is the PDF that any application can open, edit, and resave, creating a truly universal format. However, different applications have different needs, from CAD files to XLS files to images. What impetus is there to replace the PDF? What shortcomings does the format have? ",
            "date": "Answered February 8, 2017",
            "views": "829",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raymond Dixon",
                    "user_href": "/profile/Raymond-Dixon-17"
                },
                {
                    "user_id": "Thomas Braxton",
                    "user_href": "/profile/Thomas-Braxton"
                },
                {
                    "user_id": "Yaaseen Bodhanya",
                    "user_href": "/profile/Yaaseen-Bodhanya"
                },
                {
                    "user_id": "Amanda Wilson",
                    "user_href": "/profile/Amanda-Wilson-157"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anwar Mahmood",
                "href": "/profile/Anwar-Mahmood-1"
            },
            "answer_text": "Nothing will replace PDFs; they are too ubiquitous and universal. Technically superior alternatives either exist, or are not difficult to imagine; either HTML5+CSS+JavaScript, or Kindle Format 8, or Open XML Paper Specification (.OXPS). In this context, technically superior means richer documents, not necessarily print fidelity. In practice, PDFs continue to dominate. ",
            "date": "Answered February 8, 2017",
            "views": "549",
            "upvotes": " Answer requested by Amanda Wilson",
            "upvoters": [
                {
                    "user_id": "Amanda Wilson",
                    "user_href": "/profile/Amanda-Wilson-157"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Bostock",
                "href": "/profile/Adam-Bostock"
            },
            "answer_text": "I would hope that HTML 5 and/or CSS might replace it. There are plans to make HTML a much more capable language. The one current draw back to HTML (web pages) is that when they are printed they don’t always turn out well, as typically there is no page structure represented in HTML. (Similarly, HTML 5 could make many Apps redundant already.) ",
            "date": "Answered April 13, 2017",
            "views": "707",
            "upvotes": " View 1 Upvoter "
        }
    ]
}