{
    "title": "What are the most interesting products and innovations that Avago Technologies is coming out with in 2016? - Quora",
    "tags": [
        "Avago Technologies Products and Services",
        "Avago Technologies (company)",
        "Products"
    ],
    "response": [
        {
            "author_info": {
                "name": "Smith Leo",
                "href": "/profile/Smith-Leo-8"
            },
            "answer_text": "The annual Consumer Electronics Show (CES) in Las Vegas is one of the most hotly awaited tech events of the year, providing a glimpse into what kind of new consumer gadgetry awaits us in the near future. And boy, this year had some doozies! But with 3,600 companies demonstrating their products over 2.4 million square feet of exhibition space over four full days, you might have missed some of the cooler showcases. Plus, it might be hard to tell what’s simply a prototype/demonstration and what’s actually going to be a product you can use. So let’s round up the cream of the crop from CES 2016, but focus on what we might actually see in stores this year. 1. HTC Vive Pre + Chaperone The biggest fear with virtual reality headsets like the Oculus Rift is slamming your knees into the coffee table while “running” in a game or knocking a lamp when you try to punch out a virtual opponent. HTC launched its own virtual reality headset, called the Vive Pre, and added a new technology called Chaperone. Put simply, when you come close to a wall or are in danger of knocking a physical object, Chaperone displays a virtual blueprint of the real world, using a front-facing camera. You can also activate this by tapping a menu button. From a consumer perspective, it makes such virtual reality helmets safer in the home, plus you won’t need to take off your glasses every time you want to grab a sip of your soda. Pre-orders for the Vive Pre start at the end of February, but HTC hasn’t announced a price yet. 2. Samsung Family Hub Smart Fridge A smart refrigerator is one of those gadgets that can truly change your home. Samsung, LG, and others have been working on these for some time, but the new Family Hub smart fridge from Samsung is really something to admire, and was even highlighted in the company’s CES keynote. 5 Amazing Home Appliances That'll Change Your Life 5 Amazing Home Appliances That'll Change Your LifeThere's no denying it, smart home appliances will save you time and money, enabling you to spend more time doing the things you love. Here are some of the best smart appliances available today.READ MORE The coolest bit involves cameras inside the fridge that take photos of the compartments, so you can see what you have in stock — or what you’re lacking — no matter where you are, even from the grocery store. Heck, you don’t even need to go to the grocery store because you can order stuff directly from the touchscreen. You can also listen to music, look up recipes, and do all the cool things that today’s best smart fridges can already do. 3 Best Smart Refrigerators You Can Buy Right Now 3 Best Smart Refrigerators You Can Buy Right NowThere is currently a set of new smart fridge models, as manufacturers attempt to give their next generation of products a new appeal. There are some great products on the market.READ MORE But the focus here is on “family”. A fridge is where you leave notes, hang up pictures and report cards, and so on. The Family Hub’s large touchscreen lets a family write notes, update and share calendars, post photos and artwork, and make it about the family again. At $5,000, it is crazy expensive though. Plus, Samsung hasn’t addressed security concerns after its earlier smart fridge got hacked. Samsung's Smart Fridge Just Got Pwned. How About The Rest Of Your Smart Home? Samsung's Smart Fridge Just Got Pwned. How About The Rest Of Your Smart Home?A vulnerability with Samsung's smart fridge was discovered by UK-based infosec firm Pen Test Parters. Samsung’s implementation of SSL encryption doesn’t check the validity of the certificates.READ MORE 3. Razer Blade Stealth + Core Can an ultrabook actually be good enough to be used as a laptop, while also giving you a high-end gaming PC that can be upgraded periodically? Are desktops always better?Gaming peripherals manufacturer Razer seems to have cracked the code with the Razer Blade Stealth and its Core addon box for GPUs. What's The Real Difference Between A Gaming Laptop And Desktop? What's The Real Difference Between A Gaming Laptop And Desktop?The fact that laptops are slower than desktops is common knowledge, but how much slower is hard to quantify, and gamers find themselves weighing the reduction in performance against the price tag and the portability.READ MORE The Stealth is a decked-out ultrabook with a 12.5-inch high-resolution touchscreen, Intel Core i7 6500 CPU, 8 GB of RAM, Intel HD Graphics 520, 128 to 512 GB SSD, and the works. If that graphics chip sounds low-powered, don’t worry, there’s a reason for it. Basically, you have to pair the Stealth with a Core graphics box, which is an external GPU (Graphics Processing Unit) that plugs into the laptop via Thunderbolt for high-speed data transmission. You can fit AMD or Nvidia graphics cards into the Core, and even upgrade them later if necessary. Yeah, that Core unit isn’t going to be something you can lug around, but this is a great example of a laptop that can be a gaming unit when you want to play games, while also giving you portability when you want to move around. The Razer Blade Stealth, up for preorders, starts at $999 and goes up to $1,599, and will start shipping at the end of January. Razer hasn’t yet said how much the Core will cost or when it goes on sale, but we can expect an announcement on this soon. 4. The Segway Robot Intel and Segway came together to show what is possibly the coolest robot at CES this year. Meet the Segway Robot. It’s partly a Segway, so you can zoom around without walking, but when you aren’t using it for transport, it turns in a cool little robot! And it has a fun, likable personality, not like the humanoid bots you’ll be scared of. 7 Real Humanoid Robots That Will Give You Nightmares 7 Real Humanoid Robots That Will Give You NightmaresRobots are starting to move, look, and speak like people. Unfortunately, as with any cutting edge venture, sometimes you fly a little too close to the sun.READ MORE Now this robot has “eyes” in the form of 3D depth-sensing cameras and a fisheye tracking camera, which let it navigate without needing input. This robot is also connected to the Internet, so you can move it around with your phone. And this robot has a camera of its own, so it’s kind of your personal photographer too, and it has voice controls. What’s nice is that it’s built using an open platform, so other developers can easily add “arms” and other attachments or applications to make it do even more than it already can. ",
            "date": "Answered April 21, 2019",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dilsia Martinez",
                "href": "/profile/Dilsia-Martinez-1"
            },
            "answer_text": "2016? I mean we are in 2019 ",
            "date": "Answered April 2, 2019",
            "views": "127",
            "upvotes": "0"
        }
    ]
}