{
    "title": "What minimum connection speeds are required to be labeled a 5G network? - Quora",
    "tags": [
        "5G (wireless communication)",
        "Wireless Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Haynie",
                "href": "/profile/Dave-Haynie"
            },
            "answer_text": "Well, if you’re AT&T, you probably cheat and just dub your LTE Advanced link as “5G”. In the 4G era, “4G” was actually a performance metric, and several technologies were vying for widespread adoption. The winner was LTE (Long Term Evolution). But in the 5G era, the next generation radio technology, currently dubbed 5G-NR, has already been created, approved, and rolled out in some areas. It’s a set of standards, including waveform, modulations, bandwidths, frequencies, radio access technologies… it’s a big fat pile of standards, many of which are complete and official. So that’s it — if you’re on a 5G-NR radio link, congrats! You’re on a 5G network. Some companies are rolling 5G as an overlay to 4G systems. This was part of the design of 5G, so it’s ok. Chance are, you won’t see much difference in speed, because at the same bandwidth, it’s not all that much faster. Of course, if one of those signals reaches you today and you have a compatible phone, it practice it might be much faster, simply because practically no one’s using it yet. Most “in-band” 5G-NR will run on 20MHz channels, much as LTE does, though some band will permit wider, and thus faster, bandwidths. Some 5G radios are going into the “millimeter” bands, much higher frequencies that will permit much, much faster connections. However, as you go to higher frequencies, you lose range. So unless you’re in a city, and the lucky part of that city, you probably have a wait. One of the idea for rolling out 5G in neighborhoods is put a microcell on every other street light or telephone pole. That’s a ton of radios. But they’re expecting this to get to 2Gb/s, at least under ideal conditions. Millimeter wave 5G can run channel bandwidths up to 400MHz. And 5G radios will run at super slow speeds, too. NB-IoT radios are designed to allow persistant narrowband internet connections to low powered, low bandwidth devices for Internet of Things, potentially as a replacement for WiFi, Zigbee, Z-Wave, 6-LoPan, and other IoT radios… eventually. It’ll be awhile before the prices drop to use this as an endpoint radio. It’s more likely to see use for IoT in industry, in places not already served by other wireless infrastructure. Read More https://www.edn.com/what-is-5g-nr/ ",
            "date": "Answered January 28, 2020",
            "views": "12",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manoj Maharaja",
                    "user_href": "/profile/Manoj-Maharaja"
                },
                {
                    "user_id": "Jordyn Smith",
                    "user_href": "/profile/Jordyn-Smith-114"
                },
                {
                    "user_id": "Matthieu Barthélemy",
                    "user_href": "/profile/Matthieu-Barthélemy"
                },
                {
                    "user_id": "Kadin Astfalck",
                    "user_href": "/profile/Kadin-Astfalck-1"
                },
                {
                    "user_id": "Prabhas Chongstitvatana",
                    "user_href": "/profile/Prabhas-Chongstitvatana"
                },
                {
                    "user_id": "Mihir Srivastava",
                    "user_href": "/profile/Mihir-Srivastava-32"
                },
                {
                    "user_id": "Chi Hang Chiu",
                    "user_href": "/profile/Chi-Hang-Chiu"
                },
                {
                    "user_id": "Steven Zhang",
                    "user_href": "/profile/Steven-Zhang-265"
                },
                {
                    "user_id": "Michael Sørensen",
                    "user_href": "/profile/Michael-Sørensen"
                },
                {
                    "user_id": "Drew Eckhardt",
                    "user_href": "/profile/Drew-Eckhardt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Mahon",
                "href": "/profile/Tom-Mahon-13"
            },
            "answer_text": "5G provides a connection speed . . . but connection speed does not define something as being 5G. The fifth generation of mobile data (5G) is a complex set of technical standards related to modulation, encoding, and RF. ",
            "date": "Answered January 16, 2020",
            "views": "43",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob Trammell",
                    "user_href": "/profile/Bob-Trammell-1"
                },
                {
                    "user_id": "Andrew Kiener",
                    "user_href": "/profile/Andrew-Kiener"
                },
                {
                    "user_id": "Robert Andrews",
                    "user_href": "/profile/Robert-Andrews-176"
                },
                {
                    "user_id": "Kurt Behnke",
                    "user_href": "/profile/Kurt-Behnke"
                },
                {
                    "user_id": "Kjell Lindberg",
                    "user_href": "/profile/Kjell-Lindberg"
                }
            ]
        }
    ]
}