{
    "title": "What’s new in Ubuntu 20.10 ‘Groovy Gorilla' and how can I download and install it? - Quora",
    "tags": [
        "Ubuntu 20.10",
        "Installation",
        "Ubuntu (operating system)",
        "Operating Systems"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlo Carrano",
                "href": "/profile/Carlo-Carrano-1"
            },
            "answer_text": "Just yesterday I received the email announcement directly from Brian Murray, which works on the Ubuntu release Team. You can subscribe directly to the email list for future announcements, which is publicly disclosed. The link is in the email. And here is the text of the email: Codenamed \"Groovy Gorilla\", 20.10 continues Ubuntu's proud tradition of integrating the latest and greatest open source technologies into a high-quality, easy-to-use Linux distribution. The team has been hard at work through this cycle, introducing new features and fixing bugs. The Ubuntu kernel has been updated to the 5.8 based Linux kernel, and our default toolchain has moved to gcc 10 with glibc 2.32. Additionally, there is now a desktop variant of the Raspberry Pi image for Raspberry Pi 4 4GB and 8GB. Ubuntu Desktop 20.10 introduces GNOME 3.38, the fastest release yet with significant performance improvements delivering a more responsive Experience. Additionally, the desktop installer includes the ability to connect to Active Directory domains. Ubuntu Server 20.10 integrates recent innovations from key virtualization and infrastructure projects like QEMU 5.0, libvirt 6.6 and OpenStack Victoria. Ubuntu Server now ships Telegraf, the metrics collecting agent that together with Prometheus and Grafana form the basis of a strong and reliable logging, monitoring and alerting solution that can be deployed on Ubuntu systems. The newest Ubuntu Budgie, Kubuntu, Lubuntu, Ubuntu Kylin, Ubuntu MATE, Ubuntu Studio, and Xubuntu are also being released today. More details can be found for these at their individual release notes under the Official Flavours section: Groovy Gorilla Release Notes Maintenance updates will be provided for 9 months for all flavours releasing with 20.10. To get Ubuntu 20.10 ------------------- In order to download Ubuntu 20.10, visit: Get Ubuntu | Download | Ubuntu Users of Ubuntu 20.04 LTS will be offered an automatic upgrade to 20.10 if they have selected to be notified of all releases rather than just LTS upgrades. For further information about upgrading, see: Upgrade Ubuntu desktop | Ubuntu As always, upgrades to the latest version of Ubuntu are entirely free of charge. We recommend that all users read the release notes, which document caveats, workarounds for known issues, as well as more in-depth notes on the release itself. They are available at: Groovy Gorilla Release Notes Find out what's new in this release with a graphical overview: Ubuntu PC operating system | Ubuntu Desktop features | Ubuntu If you have a question, or if you think you may have found a bug but aren't sure, you can try asking in any of the following places: #ubuntu on http://irc://irc.freenode.net ubuntu-users Info Page Ubuntu Forums Ask Ubuntu Help Shape Ubuntu ----------------- If you would like to help shape Ubuntu, take a look at the list of ways you can participate at: Contribute About Ubuntu ------------ Ubuntu is a full-featured Linux distribution for desktops, laptops, IoT, cloud, and servers, with a fast and easy installation and regular releases. A tightly-integrated selection of excellent applications is included, and an incredible variety of add-on software is just a few clicks away. Professional services including support are available from Canonical and hundreds of other companies around the world. For more information about support, visit: Support and management | Ubuntu More Information ---------------- You can learn more about Ubuntu and about this release on our website listed below: Enterprise Open Source and Linux | Ubuntu To sign up for future Ubuntu announcements, please subscribe to Ubuntu's very low volume announcement list at: ubuntu-announce Info Page On behalf of the Ubuntu Release Team, -- Brian Murray -- ubuntu-announce mailing list ubuntu-announce@lists.ubuntu.com Modify settings or unsubscribe at: ubuntu-announce Info Page ",
            "date": "Answered October 23, 2020",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Morvan Bliasby",
                "href": "/profile/Morvan-Bliasby"
            },
            "answer_text": "Each Ubuntu edition has an animal as a [ana]theme. Generally, with both capital letters of compound name, such Focal Fossa and now, Groovy Gorilla. You can download it directly from here. ",
            "date": "Answered October 22, 2020",
            "views": "12",
            "upvotes": "0"
        }
    ]
}