{
    "title": "What are the bottlenecks in implementing 5G? - Quora",
    "tags": [
        "5G (wireless communication)",
        "Wireless Technology",
        "Wi-Fi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julian Garrett",
                "href": "/profile/Julian-Garrett-1"
            },
            "answer_text": "5G is going to have a lot of problems to overcome, but it helps by taking a step back and asking what is 5G being developed for - then the problems will have a little more context, and wont have such abstract answers. First of all, what is the business case for 5G - two big ones - driving down cost of deployment for operators, and data throughput speeds for users. The first is a given - the cost of deployment has to come down over traditional tower sites and heavy infrastructure - with Huawei around, the basestation hardware cost is a lot lower, but the antenna line, and towers and antennas (as well as rigging costs) are as expensive as ever. If you consider the model of fewer macro sites (towers) and a lot more small cells, you need to get the deployment model for the small cells right for the business case to add up. The small cells need to be deployed on existing infrastructure (power/streetlight poles) where ever and when ever possible. Then you have the problem of adequate backhaul. Fiber is incredibly expensive - not so much the physical fiber cable as the pitting and piping of the cables through to the basestation. If you are using streetlights, generally you wont have fiber running to them, it’ll probably be in the vicinity, but splicing links on and getting it the last 50-100m say is going to kill your budget. Microwave doesn’t really cut it with the bandwidth requirements. For all the talk of 20Gbps links - the dishes are too big, the power to high for health and safety considerations - you are down to around sub 1Gbps in clean conditions for the size and power of the dish that you can use. And that assumes line of sight transmission. NLOS (Non-line-of-sight) transmission where you cant point to microwave dishes at each other exists, but is much slower. So the driving down the cost component of 5G deployment is a serious problem - not so much because of the hardware, but because of the network topology and its associated costs. Next - Data speeds, throughput and Quality of Service. We all just assume its going to be a lot faster. Problem here is A) as above, supplying sufficient backhaul capacity. You cant have a great 5G connection without it and B) Who is going to be using it, and for what purposes. If you try and replace traditional broadband you’ll collapse 5G, plain and simple, and thats not about to happen, but you’re likely to see much more home broadband offered as a service. As for offering more and more services over 5G (IoT, Data, Speech) we make the assumption that speeds will be sufficient - I think that’s an over simplification - you start trying to shoehorn more and more services in just because you think you have the bandwidth and you’ll quickly find your bandwidth running out. So thats just a couple of the problems I can see with 5G, I could probably think of a few more - optimisation could be one - it’s going to be quite different to traditional networks I am guessing, but small beer in the overall scheme of things - we’ll adapt. ",
            "date": "Answered May 1, 2017",
            "views": "109",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fan Fei",
                    "user_href": "/profile/Fan-Fei-57"
                },
                {
                    "user_id": "Nor Shazira",
                    "user_href": "/profile/Nor-Shazira"
                },
                {
                    "user_id": "Abhijeet Naik",
                    "user_href": "/profile/Abhijeet-Naik-2"
                },
                {
                    "user_id": "Shago Mendo",
                    "user_href": "/profile/Shago-Mendo"
                },
                {
                    "user_id": "Perry Chow",
                    "user_href": "/profile/Perry-Chow-1"
                },
                {
                    "user_id": "Magnus Leone",
                    "user_href": "/profile/Magnus-Leone"
                },
                {
                    "user_id": "Franz Applebaum",
                    "user_href": "/profile/Franz-Applebaum"
                },
                {
                    "user_id": "Bob Whitcombe",
                    "user_href": "/profile/Bob-Whitcombe"
                },
                {
                    "user_id": "Paul Bailey",
                    "user_href": "/profile/Paul-Bailey-212"
                },
                {
                    "user_id": "Zain Rey",
                    "user_href": "/profile/Zain-Rey-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "OKportal Technology",
                "href": "/profile/OKportal-Technology"
            },
            "answer_text": " Credit image: 5G 5G is the most discussed upcoming cellular mobile network communications. The speed limit of 5G is around 10 Gbps which is 100 times faster than 4G. There are some problems making it possible. Here are the major problems to make 5G real: Frequency BandsThough 4G LTE already operates on established frequency bands below 3.6 GHz, 5G requires frequencies 6 GHz. Some are better known as mm-Wave. Those bands can carry far more capacity and deliver ultra-fast speeds that deliver a 20-fold increase over LTE’s fastest theoretical throughput. Wireless carriers still need to bid for the higher spectrum bands as they build and roll out their respective 5G networks.Deployment and coverage 5G offering a significant increase in speed and bandwidth, its more limited range will require further infrastructure. Higher frequencies enable highly directional radio waves, meaning they can be targeted or aimed a practice called beamforming. The challenge is that 5G antenna while being able to handle more users and data, beam out over shorter distances.Cost to build, cost to buyBuilding a network is expensive, and carriers will raise the money to do it by increasing customer revenue. Much like LTE plans incurred a higher initial cost, 5G will probably follow a similar path. And it’s not just building a layer on top of an existing network, it’s laying the groundwork for something new altogether.Device supportThere’s plenty of talk about 5G-enabled smartphones and other devices, but their availability will hinge on how expensive they are for manufacturers to make, as well as how quickly ubiquitous the network becomes.Security and privacyThis would be a challenge with any data-driven technology, but the 5G rollout will have to contend with both standard and sophisticated cybersecurity threats. Though 5G falls under the Authentication and Key Agreement (AKA), a system designed to establish trust between networks, it would currently be possible to track people nearby using their phones. They could even eavesdrop on live phone calls. Hopefully, it helps your question! OKportal Technology ",
            "date": "Answered May 13, 2019",
            "views": "31",
            "upvotes": " View 40 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akshat Bisht",
                    "user_href": "/profile/Akshat-Bisht-2"
                },
                {
                    "user_id": "Rich K",
                    "user_href": "/profile/Rich-K-55"
                },
                {
                    "user_id": "Kundan Prasad",
                    "user_href": "/profile/Kundan-Prasad-68"
                },
                {
                    "user_id": "Ashish Prasad Joshi",
                    "user_href": "/profile/Ashish-Prasad-Joshi-1"
                },
                {
                    "user_id": "Malik Dawood Usama",
                    "user_href": "/profile/Malik-Dawood-Usama"
                },
                {
                    "user_id": "Atif Shahzad",
                    "user_href": "/profile/Atif-Shahzad-66"
                },
                {
                    "user_id": "Imran Malik",
                    "user_href": "/profile/Imran-Malik-505"
                },
                {
                    "user_id": "Imran Haneef",
                    "user_href": "/profile/Imran-Haneef-5"
                },
                {
                    "user_id": "Epiphany Professional",
                    "user_href": "/profile/Epiphany-Professional"
                },
                {
                    "user_id": "Sumaira Nazim",
                    "user_href": "/profile/Sumaira-Nazim"
                }
            ]
        }
    ]
}