{
    "title": "What is holography? Explain the construction of a hologram? - Quora",
    "tags": [
        "3D Holography",
        "Holographic Principle",
        "Holograms"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Brohinsky",
                "href": "/profile/William-Brohinsky"
            },
            "answer_text": "Holography refers to capturing the image field produced by illuminating an object with a laser beam. The field of light reflected contains a fine interference pattern which results between the 2D phase map of the reflected wavefront of light and a reference beam, which are mixed at he emulsion. There are three standard approaches for making a hologram, which differ on how the reference beam is derived, and whether mixing is between the two beams at the recording emulsion, off-axis, On-axis, and Single Beam. On-axis holography was invented by George Stokes in England long before it could actually be implemented. He was a scientist working on Electron Microscope technology. He realized that it should be possible to record an x-ray field created by the phase shifts in the x-ray field when it passed through a crystalline structure, by interfering the field with an unmodulated x-ray wave aimed from the other side. Once the recording was finished and made capable, he theorized, it should be able to reconstruct the wavefront with an optical wave at visible wavelength. The result of using a longer wavelength visual beam would vebmagnification on the order of the ratio of x-ray wavelength to visible wavelength. He was delayed in implementation by the fact that the coherent, polarized light source had not yet been invented.Single beam holography was invented by Yuri Denisyuk in Russia. He had been working in theoretical and practical optics and realized that while the human eye cannot see the wave vibrations of light, film would record both intensity and phase, if an unmodulated reference were made available at the same time, so the film could record the interference pattern, and that this would form a kind of Lippmann photograph. (The Lippmann photo system was the earliest form of true color photography. It recorded the colors of the scene by letting the incoming light pass through the emulsion, and reflect off a mirror surface, passing back through the emulsion. The resulting recording, once developed and mounted with a black background, would turn white light to color in each region where color was present, brcause the reflected light was the same wavelength, and the interference pattern would become a “deep grating” which selectively reflected a color at the same wavelength ratio to other colors in the recording, and with the proper reflecting geometry, and the black backing piece, the resulting image would be a faithful reproduction of colors with a bit or iridescence.) Denisyuk also lacked lasers, but realized that the Sulfur arc lamp was sufficiently monochromatic to allow recording the phase information and reconstructing it if the incoming beam passes through the emulsion (unmodulated, and therefore a reference beam), reflected from the object and returned through the emulsion to form a deep grating hologram. These are also provided a black background to reduce stray diffracted light. I have produced many of this type of hologram in my basement using a laser pointer as the illumination.Off axis holography was the invention of Leith andUpatnieks at the University of Michagin. They had worked on masers (which use microwaves) during WWII and were attempting to reproduce their successes. Their optical work came close on the heels of Theodore Maiman’s invention Of the solid state laser. Their initial work with nearly on-axis beams produced reconstructions with superimposed images of the object, so they increased the angle to move the second (“imaginary”) image out of the view. Once other problems were dealt with, they filed some fifty patents on various uses and approaches using the off-axis arrangement. These were originally called the Holosonics patents, but were sold into industry through a series of owners, ending in the hands of Atari, the video game manufacturers. Through an unfortunate set of actions attempting to milk any cow where the patent owners could show enough similarity to their filings, the successive owners managed to single-handedly grind development of artist- or industry- applications for holography. Eventually, Atari held the patents, and chose not to renew them, resulting in a sudden blooming of holograms as advertising, artistic, and identification applications.In addition to making spectacular images, holography enabled a very precise, accurate and versatile system for non-contacting test and measurement. Being a subwavelength recording of the phase of light as it would be visible from anywhere the reflected beam could be viewed meant that a reconstructed hologram recreated the exact field of light that the original beam did. If the object was removed from the scene, the reconstruction provided the appearance that the object was still there, being viewed through the “window” of the emulsion. If the object were left in place, any displacement of the object, out-of-plane, produced a different field which interferes with the original field. The interference produced alternating dark and bright “fringes” which formed a topographical map of out-of-plane displacements. In simpler terms, make a hologram, reconstruct it on the original object, lean a pen against the object, and a map apears in the reconstruction of how the weight of the pen against the surface has changed its shape. Vibrate the object, and at resonant frequencies, the mode shapes of vibration become visible. Various systems have been built to use interferometry, which is measurement using interferograms. Mostly, though, holography has been used to produce 3D images which lack the flat images arranged at different distance effect of stereoscopic images (think: ViewMaster) which were very popular in Victorian England, and have no one-dimensional limitation such as lenticular lens images (we used to get them in CrackerJacks!) by using multiple laser wavelengths, geometries which form deep gratings, or white light and very narrow filters and other techniques have produced full color holographic images. Various techniques have produced holographic moving pictures. Pulsed lasers have enabled a form of portrait holography, and the very clever Stephen Benton developed a way of taking multiple photographic images, recording them into successive slices of a hologram,then transferring their vertically segregated data to a transfer hologram which is white-light viewable and can even record a short sequence of movement within the scene. Holography is not used in modern 3D movies and videos, which use polarized lenses to present different views to each eye. This is a purely stereo graphic process. ",
            "date": "Answered January 22, 2019",
            "views": "719",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Keith Levkoff",
                "href": "/profile/Keith-Levkoff"
            },
            "answer_text": "I’m going to give everyone the REAL answer here…. A REAL hologram is a special sort of image or picture which stores TRUE 3D information about something. A real hologram acts like you’re looking at an actual object through a window. If your hologram shows two objects, and one is behind the other, you can move your head to the side to see the one in the back. And, if you were to cut the hologram in half, you would still be able to see the ENTIRE object through each half. (It would seem exactly like you were looking at the same whole object through a smaller windows.) There are several different types of REAL holograms. Most of them are generated by illuminating an actual object using a LASER beam and stored on photographic film. In theory, you could have a full 3D hologram, like the Holodeck on Star Trek, and you would be able to walk around objects in it. In practice, virtually all current hologram technology involves a piece of film, and a limited viewing angle. (With some, you’re looking through the film as if it was a window; with others, you are looking AT the film, and the object seems to come forward in front of the film.) A TRUE hologram uses only a single screen… it does NOT involve two separate images, one for each eye. True holograms also require a MASSIVE amount of data to store and view…. which is one reason why we don’t have a practical system for transmitting them yet. When you look at the film that stores a hologram what you see looks much like a dirty piece of glass… the film itself stores a light interference pattern (an image of the pattern produced when coherent light waves interact and cancel each other out). The image itself isn’t stored “on the glass”; the information stored on the glass CREATES the image when your eyes interpret it. Most current holograms are also monochrome. (Making holograms in color is very tricky.) NOW……. In our current culture, the term “hologram” is being used INCORRECTLY to describe all sorts of methods for creating “3D” and “stereoscopic” images. It is used to describe pretty much anything that delivers “a 3D image sort of like a real hologram”. In the past, there was jewelry available that contained a true hologram embedded in a glass frame. These were most often a round glass pendant, consisting of a flat plate about two inches in diameter, containing most commonly a color picture of a rose or the gears inside a watch. There ARE true holograms, and in color (they are apparently somewhat tricky to produce - but they work in color - with ordinary room light). I don’t know if they’re still being made. ",
            "date": "Answered March 6, 2018",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tony Coleman",
                    "user_href": "/profile/Tony-Coleman-12"
                }
            ]
        }
    ]
}