{
    "title": "What is the most disturbing image you saw before the internet? - Quora",
    "tags": [
        "Disturbing",
        "Disturbed",
        "Images",
        "Personal Experiences",
        "Photographs",
        "The Internet",
        "Technology",
        "Experiences in Life",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vasiliki Tzalachani",
                "href": "/profile/Vasiliki-Tzalachani"
            },
            "answer_text": "Well, my dad and I were going through some very old albums in his childhood home and we found a picture of my dad's grandpa as a young man dressed in a Nazi uniform and saluting the same way. My dad got so angry at the picture because his grandma was shot.and killed by a trigger happy Nazi while she was returning from church and she provided the soldier by asking him why he is killing his brothers and sisters. That event caused his mum, my grandma, years of unresolved psychological trauma, years of being abused, neglected and mistreated by her step mum and later in life makes similar mistakes with my dad…even to the point that my grandma didn't want him. That made him so furious that he left the house for almost a day when he returned he called for a family meeting and broke down crying as my mum held him. He told us he spent the day by his parents grave thinking about his upbring and asking questions no one could give him answers to. That day I realized how one's choice in life can have a ripple effect for generations to come and how one picture hurt my dad so deeply. I didn't see him cry when he was shot in the leg but this broke him for days! ",
            "date": "Answered July 5, 2019",
            "views": "852",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rebecca Douglas",
                    "user_href": "/profile/Rebecca-Douglas-67"
                },
                {
                    "user_id": "Jana Pruitt",
                    "user_href": "/profile/Jana-Pruitt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cranston Snord",
                "href": "/profile/Cranston-Snord-10"
            },
            "answer_text": " ",
            "date": "Answered July 5, 2019",
            "views": "38",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anurag Agarwal",
                    "user_href": "/profile/Anurag-Agarwal-165"
                },
                {
                    "user_id": "Nicola Carapellese",
                    "user_href": "/profile/Nicola-Carapellese"
                },
                {
                    "user_id": "Shazy Ali",
                    "user_href": "/profile/Shazy-Ali-3"
                }
            ]
        }
    ]
}