{
    "title": "What is use of technology in manufacturing? - Quora",
    "tags": [
        "Manufacturing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Verve Systems",
                "href": "/profile/Verve-Systems-1"
            },
            "answer_text": "Industry 4.0 also commonly known as the fourth industrial revolution is definitely transforming the manufacturing sector by integrating IT – technology throughout the product life cycle. As a result, manufacturers are benefiting from increased visibility into the day to day operations, processes and substantial cost savings. Faster production times and excellent customer support are also a part of technology integration in the manufacturing business.  Here are a few ways in which technology supports manufacturing business processes: IoT is the next big thing Within an existing infrastructure, the interconnection of unique devices results in better communication between various processes and results in increased efficiency, cost reduction, and more importantly product innovation. Predictive maintenance With technology integrated into the manufacturing processes, each equipment is monitored and logs are analyzed as a part of big data analysis. This result is the identification and prediction of device failures. Maintenance can be scheduled and replacements can be pre-booked. This reduces the downtime in any manufacturing process. This ultimately keeps the production on track – no more delays! ERP systems to streamline processes ERP systems offer accurate, real-time information and this helps reduce the operational costs and administrative tasks. Managers can proactively manage operations and prevent disruptions. AR and VR The relationship between man and machine has been changed forever with AR and VR. AR and VR continue to create mutually beneficial partnerships. Machine learning will help speed up processes and combat the repetition in daily processes that take up human time and energy. Well, manufacturing processes have definitely seen a change with technology integration. This is not limited to the actual process itself but also moves on to other support functions such as sales and support after the product has been manufactured. Product manufacturers find technology to be a catalyst in the progress. ",
            "date": "Answered June 16, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexandra Zhang",
                "href": "/profile/Alexandra-Zhang-19"
            },
            "answer_text": "Hey, thanks for your question. The pandemic has no doubt sped up several global trends, including the proliferation of technology regardless of industry. Being a legacy industry, manufacturing has evolved to adapt to the changing times. I’ll like to address the question in 2 angles: From the manufacturers → I share similar thoughts with the other answers - technology brings about cost savings and improvement in day to day operations. The rise of automation has eliminated manual tasks; and AI is used for intelligent maintenance and insights in manufacturing operations. Other applications may include analyzing images in real time to complete product quality inspections, which would help manufacturers stay compliant with regulations.From the hardware companies/makers → rapid prototyping is more crucial than ever, as we continuously drive new innovations. Technology can be used to eliminate non-engineering repetitive tasks (such as getting RFQs, sourcing for suitable suppliers, getting DFM feedback) so that teams can focus on their hardware innovations. My team and I wanted to bridge the gap between hardware innovators and quality manufacturers willing to do prototyping and customization, reducing unnecessary cost and time spent.We’re building a one stop custom manufacturing portal in Southeast Asia, helping makers make with ease. Hardware is hard, yet its incredibly rewarding and fun! If you’re in the SEA region like we are, feel free to reach out to us. Learn more. ",
            "date": "Answered June 26, 2020",
            "views": "126",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hardik Dobariya",
                    "user_href": "/profile/Hardik-Dobariya-9"
                },
                {
                    "user_id": "Som Dutt",
                    "user_href": "/profile/Som-Dutt-6"
                }
            ]
        }
    ]
}