{
    "title": "What is the difference between 3D printing and Additive Manufacturing? - Quora",
    "tags": [
        "3D Printers",
        "3D Printing",
        "3D Technology",
        "Printing",
        "Comparisons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stuart Ting",
                "href": "/profile/Stuart-Ting"
            },
            "answer_text": "Between the terms 3D printing and additive manufacturing, there is no difference. It is the equivalent of one saying automobile and car. 3D printing and additive manufacturing are synonyms for the same process. Both terms reference the process of building parts by joining material layer by layer from a CAD file. This is as opposed to a traditional manufacturing process, like CNC Machining , where a part is built by subtracting material from a block of material. 3D printing and additive manufacturing can be used regardless if the parts are fabricated in plastic, metal, or rubber. Based off our general perception, it seems as though people who work in an industrial or manufacturing setting prefer additive manufacturing since it sounds more formal. In comparison, the media and hobbyists prefer the term 3D printing. The term 3D printing has been used more ever since inexpensive desktop printers became more popular. People in the industry generally prefer additive manufacturing while the general public generally prefers 3D Printing. Defining a difference between the two is like splitting filament. The technology has made great advancements since its inception, and it will be exciting to see how it advances. The simple answer is that at a technological level, very little – the differentiation is bound up in both the application of the individual process and machine and the end result. ",
            "date": "Answered February 14, 2017",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pir Arkam Suharwardy",
                    "user_href": "/profile/Pir-Arkam-Suharwardy"
                },
                {
                    "user_id": "Sabína Ságová",
                    "user_href": "/profile/Sabína-Ságová"
                },
                {
                    "user_id": "Doug Dingus",
                    "user_href": "/profile/Doug-Dingus"
                },
                {
                    "user_id": "Suryanarayanan Radhakrishnan",
                    "user_href": "/profile/Suryanarayanan-Radhakrishnan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dorian Ferrari",
                "href": "/profile/Dorian-Ferrari"
            },
            "answer_text": "Short answer, nothing. Long answer regarding the history of terms. When SLA and SLA first began being marketed and sold, they were to major corporations to replace prototyping. Thus the term rapid prototyping came to be. This was the predominant name for all printing tech for some time. That is because for the first 10 to 15 years, it was really only good for prototyping. As things advanced, the paradigm began to change. Small scale manufacturing using the technologies, including the metal sintering tech gave way to the concept of additive manufacturing. Which really means “growing” your part vs the traditional removal of material via some type of machining operation. The professional world slowly adopted “additive Manufacturing” Next we come to the expiration of the FDM process. Since FDM is the most “consumer” friendly tech, the maker movement started to take hold with the very first machines, and these adopted the term 3D printer. It is still an additive manufacturing process, but what was once a point of entry that cost more than 99% of the cars available, it wasn’t consumer friendly. The maker movement brought additive manufacturing to the home workshop and office. Today 3D printing is what most of the population know of. Additive manufacturing is what you hear if you work with these technologies on a professional level. But at the end of the day, it’s all the same thing. ",
            "date": "Answered May 21, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "疆 夏",
                    "user_href": "/profile/疆-夏"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jasmine Thompson",
                "href": "/profile/Jasmine-Thompson-75"
            },
            "answer_text": "Any industry that is growing rapidly is going to attract more than its share of controversy. With a forecast growth rate of 28.5% between 2016 and 2022, according to MarketsandMarkets, the business of producing parts is no exception. One of the hottest issues at the moment is simply what do we call it – 3D printing or additive manufacturing? Or are both terms valid for different segments of the market? Or do they mean the same thing? What Are Industry Experts Saying About 3D Printing Versus Additive Manufacturing? 1.“They essentially mean the same thing. The only difference is that 3D printing is used more by maker communities while additive manufacturing is preferred in industry circles.” – Mark Allinson in Robotics and Automation News 2.“3D printing is a good simple cover-all term for newbies, non-engineers, consumers and makers. However, if you are selling a £500,000 machine that produces metal parts for industrial applications then you need to be talking manufacturing.” – Duncan Wood at TCT Magazine 3.“People in the industry generally prefer additive manufacturing while the general public generally prefers 3D printing. Defining a difference between the two is like splitting a filament“. – ITEC blog For more head over to Difference Between Additive Manufacturing and 3D Printing? ",
            "date": "Answered July 6, 2017",
            "views": "27",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Venkatasai Shaurie",
                    "user_href": "/profile/Venkatasai-Shaurie"
                },
                {
                    "user_id": "Pir Arkam Suharwardy",
                    "user_href": "/profile/Pir-Arkam-Suharwardy"
                },
                {
                    "user_id": "Sunil Mathpal",
                    "user_href": "/profile/Sunil-Mathpal"
                },
                {
                    "user_id": "Monarch Moolchandani",
                    "user_href": "/profile/Monarch-Moolchandani"
                },
                {
                    "user_id": "Doug Dingus",
                    "user_href": "/profile/Doug-Dingus"
                },
                {
                    "user_id": "Nishchay Edmund Paschal",
                    "user_href": "/profile/Nishchay-Edmund-Paschal"
                },
                {
                    "user_id": "Vinodh Raj",
                    "user_href": "/profile/Vinodh-Raj-3"
                },
                {
                    "user_id": "Syed Usman Shah",
                    "user_href": "/profile/Syed-Usman-Shah-3"
                },
                {
                    "user_id": "Suman Vedant",
                    "user_href": "/profile/Suman-Vedant"
                },
                {
                    "user_id": "Pragya Sharma",
                    "user_href": "/profile/Pragya-Sharma-322"
                },
                {
                    "user_id": "David Nguyen",
                    "user_href": "/profile/David-Nguyen-349"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raivat Luthra",
                "href": "/profile/Raivat-Luthra"
            },
            "answer_text": "The two are almost interchangeable, however do hold a slight difference when put into context. Manufacturing methods can essentially be grouped into the following three categories: Subtractive - Material is successively removed from a solid block until the desired shape is reachedMachining processes (turning, milling, drilling, etc.)Formative - Mechanical forces are applied to material to form it into the desired shapeShaping processes (bending, molding, pressing, etc.)Additive - Material is manipulated so that successive pieces of it combine to make the desired object3D-Printing processes (SLA, SLS, FDM, etc.)Where 3D-Printing is an Additive Manufacturing process. ",
            "date": "Updated May 22, 2016",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Norbert Rovira",
                    "user_href": "/profile/Norbert-Rovira"
                },
                {
                    "user_id": "Norbert Rovira",
                    "user_href": "/profile/Norbert-Rovira"
                },
                {
                    "user_id": "Matthew Laskaj",
                    "user_href": "/profile/Matthew-Laskaj"
                },
                {
                    "user_id": "Dhanush Dhundasi",
                    "user_href": "/profile/Dhanush-Dhundasi"
                },
                {
                    "user_id": "Troy Turner",
                    "user_href": "/profile/Troy-Turner"
                },
                {
                    "user_id": "Soma Sekhar Reddy",
                    "user_href": "/profile/Soma-Sekhar-Reddy-4"
                },
                {
                    "user_id": "Andrew Balitsky",
                    "user_href": "/profile/Andrew-Balitsky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stacey Clement",
                "href": "/profile/Stacey-Clement-3"
            },
            "answer_text": "This is actually a bit controversial in the analyst and influencer community. Here is an excerpt from a blog we posted on Fisher Unitech.com. on this exact topic. Mark Allinson in Robotics and Automation News: They essentially mean the same thing. The only difference is that 3D printing is used more by maker communities while additive manufacturing is preferred in industry circles. Duncan Wood at TCT Magazine: 3D printing is a good simple cover-all term for newbies, non-engineers, consumers and makers. However, if you are selling a £500,000 machine that produces metal parts for industrial applications then you need to be talking manufacturing. ITEC blog: People in the industry generally prefer additive manufacturing while the general public generally prefers 3D printing. Defining a difference between the two is like splitting a filament. Joris Peels at Luxexcel blog: Because the term 3D printing appeals to journalists it is used incorrectly to describe any and all 3D printing technologies as well as the industry as a whole. The correct term is actually additive manufacturing as defined by the ASTM 42 subcommittee on Additive Manufacturing. The Technology House blog: There is no difference between the terms 3D printing and additive manufacturing. But people who working in an industrial or manufacturing setting prefer additive manufacturing while the media and hobbyists prefer 3D printing. Todd Grimm at Engineering.com: 3D printing is the popular term when describing processes that make objects additively. There is no difference between 3D printing and additive manufacturing. ",
            "date": "Answered October 12, 2018",
            "views": "186",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James H. Kelly",
                "href": "/profile/James-H-Kelly"
            },
            "answer_text": "Essentially none. 3D printing is a type of additive manufacturing. I suppose it might be possible to come up with some process that isn't 3D printing, but is technically additive manufacturing, but it would be a stretch. You could make the argument that the word \"manufacturing\" in additive manufacturing makes AM more of an industrial term and 3D printing less so, but it's a very subtle distinction. ",
            "date": "Answered April 26, 2016",
            "views": "21",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "疆 夏",
                    "user_href": "/profile/疆-夏"
                },
                {
                    "user_id": "Lykle Schepers",
                    "user_href": "/profile/Lykle-Schepers"
                },
                {
                    "user_id": "Andrew Balitsky",
                    "user_href": "/profile/Andrew-Balitsky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scot Morgan",
                "href": "/profile/Scot-Morgan"
            },
            "answer_text": "3D Printing Vs Additive Manufacturing Vs Rapid Prototyping Basically there is no real difference, 3d printing is additive, but additive can encompass more than just 3d printing. its a bit differnt then 3d printing plastic, but is still an additive process. For instance, metal printing.  ",
            "date": "Answered May 22, 2017",
            "views": "628",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diva Kela",
                    "user_href": "/profile/Diva-Kela"
                },
                {
                    "user_id": "Kumar Tanmay",
                    "user_href": "/profile/Kumar-Tanmay-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Dingus",
                "href": "/profile/Doug-Dingus"
            },
            "answer_text": "3D Printing is a technology.  It is an additive technology. Additive Manufacturing is the process of using additive technology to make quantities of production parts.  Doing this may include more technologies in addition to 3D printing, such as milling, post processing, etc... ",
            "date": "Answered April 27, 2016",
            "views": "616",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Fildes",
                    "user_href": "/profile/Matt-Fildes"
                },
                {
                    "user_id": "Tsvetan Borisov",
                    "user_href": "/profile/Tsvetan-Borisov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhimanyu Chavan",
                "href": "/profile/Abhimanyu-Chavan-1"
            },
            "answer_text": "Greetings, There is no difference in both the terms. Just that the term Additive Manufacturing is used Industrial and academic circles. it is a more professional name for the technology. 3D printing is a simple term to understand the technology and is mostly used by new learners, enthusiasts, hobbyists, etc. It is more popular across the world than the term Additive Manufacturing. Best Regards, Manufactur3D | India's First Magazine on 3D Printing ",
            "date": "Answered April 28, 2018",
            "views": "189",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leela Kishan Jakkam",
                "href": "/profile/Leela-Kishan-Jakkam"
            },
            "answer_text": "previously 3d printing is as rapid prototyping which is used to manufacture prototypes which is a extra cost in production. so now a days no more prototypes are manufactured so it is called additive manufacturing. ",
            "date": "Answered January 30, 2017",
            "views": "240",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tina King",
                "href": "/profile/Tina-King-61"
            },
            "answer_text": "The academic name is additive manufacturing, 3D printing is a popular name, and 4D is also called additive manufacturing. 3D printing is a manifestation of additive manufacturing. Sometimes 3D printing is also called additive manufacturing.  ",
            "date": "Answered April 27, 2018",
            "views": "184",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dimitra Tsiovolou",
                "href": "/profile/Dimitra-Tsiovolou"
            },
            "answer_text": "Δε γνώριζα ",
            "date": "Answered May 2, 2018",
            "views": "94",
            "upvotes": "0"
        }
    ]
}