{
    "title": "What are some examples of primitive technology? - Quora",
    "tags": [
        "Primitive Society",
        "Primitive Technology",
        "Ancient Technology",
        "Prehistoric Humans",
        "Prehistory",
        "Ancient Civilizations",
        "Anthropology",
        "Ancient History",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rey Blanco",
                "href": "/profile/Rey-Blanco"
            },
            "answer_text": "How about the channel dial on tellusvisions? Nowadays, there are “remote control” devices and perhaps that can even become archaic. We might simply have to nod and blink to change channels if we are too lazy to get up or talk. If we can program the device, we might set it where if our mouth drops open it will detect it and comply. If we shrug our shoulders it might come up with a different channel. If we get really good at it, all we have to do is watch and let technology input our thoughts and it would simply change channels without having us do anything. As this technology spreads from AI to a SUPRA AI, the non local stupendous system of thinking machine(s) the presentations of the surrounding world would do a good job bouncing physical light through the holes in our head (eyes, ears) as well. The programming for mind control will become more sophisticated, allowing the system to gps your mental and physical whereabouts with such an uncanny attention to detail, we might as well just sit their in bliss and forget about it. Technological advancements can be interactive. That is, most already realize that the current trends for brain wash techniques include the electro magnetic sphere. The contents, like pellets of information, can trigger neural cell firing inside the bubble head chamber’s illusionary stage withing the few cubic centimeters of the skull for the soft stuff to absorb. However, imagine when the projections not only penetrate the holes in the head, but like a scan detect what we are thinking. Perhaps “original thinking” might become “primitive.” ",
            "date": "Answered August 20, 2019",
            "views": "612",
            "upvotes": "0"
        }
    ]
}