{
    "title": "What kind of futuristic weapon will be more destructive than nuclear weapons are today? - Quora",
    "tags": [
        "Weapons of Mass Destruction (WMD)",
        "Nuclear Proliferation",
        "Nuclear Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Pearman",
                "href": "/profile/Justin-Pearman"
            },
            "answer_text": "Just a couple to throw in there for kicks. ‘More destructive’ is relative. One of my favorites is weather warfare. Certainly not greater than, say, rocket boosters that propel planets towards their stars but.. still pretty ‘neat’. Conspiracy theorists suggest that we already have them, and use them regularly. I tend to agree with them. This goes beyond the ones that’re already well known. The ability to steer hurricanes, cause earthquakes, floods, droughts, etc is a fantastic capability! The ability to use EM (think giant microwave guns) to steer clouds, or, ‘better’, flashboil clouds so quickly that the resulting shockwave is releases the same energy as a nuke. …and, all from exploding water! But, again, the ability to steer hurricanes, and, to build them even by directing storms into each other, as well, directing hurricanes such that their power grows where it might otherwise dissipate.. ..hurricanes have thousands to millions of times the energy of our entire nuclear arsenal. Huge amounts of energy in them. Earthquakes too. The History Channel had a cool episode on it about a decade ago. It’s well worth the watch and it builds on itself, so it gets better the longer the episode goes on. ..but, it lacks a more-developed capability of these systems. They’re actually much more powerful and much more capable than what the show presents.. ..which, in & of itself, is pretty impressive.  But, my ‘favorite’ weapon is theoretically one that’s already been created. It was in a few episodes in Stargate. Time Dilation Fields Basically, super-heavy matter is created and a black hole forms instantly. Anything within its range is instantly ‘frozen in time’ until presumably being sucked into the black hole itself. A sci-fi technology, sure. But that we’ve already created ‘tiny’ black holes in the lab, this technology isn’t so far-fetched. Physicists have created a 'black hole' in the lab that could finally prove Hawking radiation exists Obviously there’s a lot to learn, and a helluva of energy required but, the thought that we could create ‘holes’ in our own space-time dimension(s) is pretty fascinating! …and, I said ‘could create’ incorrectly, that we’ve already created them! Scaled up? A ship? a city? a country? a continent? a planet? ..it’s all relative. Even the Death Star lacks imagination in comparison to that. A ‘big cannon’ basically vs a ‘time dilation bubble’?? or, an artificial black hole maker? Talk about presenting fear in your enemies by showing them Han frozen in carbonite! Take your enemies on a tour of an entire planet or solar system that you’ve ‘frozen’ all because they failed to pay you tribute. For ‘a very long time’, future evolutions could witness your wrath! ..or handiwork! ",
            "date": "Answered October 18, 2016",
            "views": "28",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kyle Wilson",
                    "user_href": "/profile/Kyle-Wilson-444"
                },
                {
                    "user_id": "Ricasso Emerson",
                    "user_href": "/profile/Ricasso-Emerson"
                },
                {
                    "user_id": "Conor Wright",
                    "user_href": "/profile/Conor-Wright-1"
                },
                {
                    "user_id": "Hải Trần",
                    "user_href": "/profile/Hải-Trần-75"
                },
                {
                    "user_id": "Andrew Holliday",
                    "user_href": "/profile/Andrew-Holliday-1"
                },
                {
                    "user_id": "Nathaniel Smith",
                    "user_href": "/profile/Nathaniel-Smith-51"
                },
                {
                    "user_id": "Joe Smith",
                    "user_href": "/profile/Joe-Smith-1350"
                },
                {
                    "user_id": "Jasmine Adamson",
                    "user_href": "/profile/Jasmine-Adamson"
                },
                {
                    "user_id": "Saikat Das",
                    "user_href": "/profile/Saikat-Das-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Ross",
                "href": "/profile/Andrew-Ross-52"
            },
            "answer_text": "Other answers are correct in stating that antimatter weapons are likely the most destructive explosive weapons - that is, a self-contained antimatter device is going to produce the biggest explosion. However, trying to bring about an apocalypse with one big bomb isn’t a terribly creative or effective way of doing things. I think there is a different kind of weapon which has the potential to be more destructive than nuclear weapons, though it isn’t as obvious as a nuclear apocalypse. Biological weapons - specifically, a genetically engineered “superbug” designed to be extremely virulent and extremely lethal - has the potential to wipe out most of humanity and bring about societal collapse. Whilst they can’t remove all traces of life on this planet (a bacterial weapons constitutes life in and of itself, after all), it is much more efficient than nuclear carpet bombing of the planet. It would take several thousand nukes to wipe out humanity - fifty or so specially engineered pathogens could accomplish the same job, though isolated tribes in Amazonia may survive. The obvious problem of using biological weapons is that not every case of a disease is fatal, and many people may have natural immunity - the recent Ebola outbreak in West Africa had a fatility rate of around 70% in hospitalized patients, and Ebola is pretty lethal. The Black Death, the epidemic of the bubonic plague in Europe in the 14th Century, killed about 40% of the European population, though many avoided infection in the first place. A genetically engineered pathogen could likely achieve higher death rates, but a single pathogen couldn’t wipe out the planet. However, using many different pathogens - fifty, for example - people could be exposed to so many different diseases that the chances of them surviving all of them are incredibly low - less than one in seven billion. Fortunately, such biological weapons are very difficult to develop, and the few people who might have both the inclination and resources to create such a weapon are the leaders of major nations and banned from making such weapons by international law. The risk that such a disease might spread to their own nation, and possibly kill them or their families, might also impact their decision not to develop them. ",
            "date": "Answered August 24, 2016",
            "views": "19",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tom Ensalada",
                    "user_href": "/profile/Tom-Ensalada"
                },
                {
                    "user_id": "William Harold Hinkson II",
                    "user_href": "/profile/William-Harold-Hinkson-II"
                },
                {
                    "user_id": "Sophia Dora Weiler",
                    "user_href": "/profile/Sophia-Dora-Weiler"
                },
                {
                    "user_id": "Samrat Dutta",
                    "user_href": "/profile/Samrat-Dutta-107"
                },
                {
                    "user_id": "Richard Vick",
                    "user_href": "/profile/Richard-Vick-3"
                },
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                }
            ]
        }
    ]
}