{
    "title": "What is a gateway? - Quora",
    "tags": [
        "Gate Ways",
        "Vocabulary of the English Language"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Lambert",
                "href": "/profile/Michael-Lambert-86"
            },
            "answer_text": "We can take an example. There is a boy, named Tom (Data). Tom lives in one room of an apartment. There are many friends in other rooms. Tom’s parents are the Gateway. If Tom want to play with one friend, he needs to shout friend’s name in the room. If his friend hears that, he will come and play with Tom. Tom’s parents (Gateway) don’t allow Tom go out of the room. Whatever Tom want to do, he need his parents’ help. For example. Tom wants to chat with Peter, but Peter lives at another apartment. Tom can’t shout Peter’s name and doesn’t know the telephone number of Peter. However, there is a telephone number list of all the classmates, at Tom’s teacher’s home. Then, Tom’s teacher is the DNS Server. So, there will be this dialogue: Tom: Mom, I want to ask my teacher for Peter’s telephone number. Mom: Ok. (Mom phoned the teacher and got the number.) Well, Peter’s telephone number is 211.99.99.99. Tom: Great! Mom, I want to chat with Peter. Can you help me? Mom: Ok (Mom sent a request to the telephone office. Peter’s parents (Gateway) got the request and they told the request to Peter.) At last, Tom can chat with Peter now. Figure1. How the Gateway work.  This answer is from an article. I think it’s easy to understand. Here is the article: What is the Gateway in Networking? ",
            "date": "Answered May 8, 2018",
            "views": "289",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amanda Grosskopf",
                    "user_href": "/profile/Amanda-Grosskopf"
                },
                {
                    "user_id": "Navnath Chinchore",
                    "user_href": "/profile/Navnath-Chinchore"
                },
                {
                    "user_id": "Doc Schenk",
                    "user_href": "/profile/Doc-Schenk"
                },
                {
                    "user_id": "Leland Jackson",
                    "user_href": "/profile/Leland-Jackson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "RS. Ganesh",
                "href": "/profile/RS-Ganesh-3"
            },
            "answer_text": "A gateway is a network node that connects two networks using different protocols together. While a bridge is used to join two similar types of networks, a gateway is used to join two dissimilar networks. The most common gateway is a router that connects a home or enterprise network to the internet. In most IP-based networks, the only traffic that doesn't go through at least one gateway is traffic flowing among nodes on the same local area network (LAN) segment -- for example, computers connected to the same switch. Gateways can take several forms and perform a variety of tasks: Web application firewall - filters traffic to and from a web server and look at application-layer dataCloud gateway - provides basic protocol translation and simple connectivity to allow the incompatible technologies to communicate transparentlyAPI, SOA or XML gateway - manages traffic flowing into and out of a service, microservices-oriented architecture or an XML-based web serviceIoT gateway - aggregates sensor data, translates between sensor protocols, processes sensor data before sending it onward and moreCloud storage gateway - translates storage requests with various cloud storage service API callsMedia gateway - converts data from the format required for one type of network to the format required for anotherAmazon API Gateway - allows a developer to connect non-AWS applications to AWS back-end resourcesVoIP trunk gateway - facilitates the use of plain old telephone service (POTS) equipment, such as landline phones and fax machines, with a voice over IP (VoIP) networkEmail security gateway - prevents the transmission of emails that break company policy or will transfer information with malicious intent",
            "date": "Answered April 22, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dennis Piehl",
                    "user_href": "/profile/Dennis-Piehl"
                },
                {
                    "user_id": "Hung Nguyen",
                    "user_href": "/profile/Hung-Nguyen-695"
                },
                {
                    "user_id": "Ashwin Joshi",
                    "user_href": "/profile/Ashwin-Joshi-83"
                }
            ]
        }
    ]
}