{
    "title": "What would be the immediate and long term effects of the internet permanently shutting down worldwide? - Quora",
    "tags": [
        "Internet Shutdowns",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cynthia Chan",
                "href": "/profile/Cynthia-Chan-10"
            },
            "answer_text": "So you want to know what will happen if the Internet packs up its bags and says “Sayonara” to us, right? Well, that will never happen because the Internet is made up of several networks. If one goes down, the others will still function. But if you want an Internet-free area, look no further than North Korea. Everything there is controlled, even the Internet. Movies have to be downloaded onto USB sticks, and then smuggled into the country for people to watch. You can see that the people there CAN live without the Internet; even though they have their own intranet, it’s censored to the hilt, and only the elite have access to computers. We’ve lived without the Internet, and we can do it again. ",
            "date": "Answered June 3, 2019",
            "views": "37",
            "upvotes": " Answer requested by Josie Hamilton",
            "upvoters": [
                {
                    "user_id": "Orem Frien",
                    "user_href": "/profile/Orem-Frien"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriel Bell",
                "href": "/profile/Gabriel-Bell-18"
            },
            "answer_text": "Death. Then more death. After that some more death. And just when you think there isn’t any more to be had - that’s right, you guessed it - more death. In short - a lot of people die. Even more people suffer, then die. And a lot more people suffer, go on suffering, and then die. So - all in all, it’s not good. ",
            "date": "Answered April 9, 2019",
            "views": "30",
            "upvotes": " View 1 Upvoter"
        }
    ]
}