{
    "title": "What are the best books to read for the OCP MySQL 5.7 Database Administrator exams? - Quora",
    "tags": [
        "Database Administrators",
        "Oracle Certifications",
        "Database Administration",
        "MySQL",
        "Database Systems",
        "Reading",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brenda Reeve",
                "href": "/profile/Brenda-Reeve-2"
            },
            "answer_text": "in my opinion, this book fits the category you are asking OCP MySQL 5.6 Database Administrator All-in-One Exam Guide The only Oracle Press exam guide for Oracle OCP MySQL certification OCP MySQL 5.6 Database Administrator Exam Guide covers all of the exam objectives on the OCP level exam for MySQL DBAs in detail. You can become MySQL certified by passing OCP Exam 1Z0-883. This book prepares you for this highly technical exam and focuses on practitioner-level skills, covering a broad set of topics, including security, backup, replication, and optimization. Ideal as both an exam guide and on-the-job reference, each chapter of this Oracle Press book includes examples, practice questions, lab questions, and a chapter summary. An Exam Readiness Checklist appears at the front of the book―you’re ready for the exam when all objectives on the list are checked off. Two-minute drills at the end of the chapter reinforce knowledge. Inside the Exam sections in each chapter highlight key exam topics covered. 150+ exam questions match the format, topics, and difficulty of the real exam. Covers the single exam required to achieve OCP certification for Oracle MySQL―Exam 1Z0-883Electronic content includes two interactive practice exams and a PDF copy of the bookThe electronic exams also feature an open-book mode with hints, references to the book, and detailed answers and explanations",
            "date": "Answered March 22, 2019",
            "views": "771",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Stokes",
                "href": "/profile/David-Stokes-9"
            },
            "answer_text": "Sadly there is no book for the 5.6 or 5.7 exam. The best you can do is to cover the list of subjects for the test in great detail before you take the exam. I used to be the MySQL Certification Manager and had written MySQL certification exams in the past but had moved on before the 5.6 and 5.7 exams were written. The 5.6 exam was very tough even with lots of knowledge and skill with the product so STUDY HARD! And good luck! ",
            "date": "Answered January 6, 2019",
            "views": "406",
            "upvotes": "0"
        }
    ]
}