{
    "title": "What is the difference between new media and old media? - Quora",
    "tags": [
        "Digital Media Industry",
        "New Media",
        "Mass Media",
        "Commercial Media",
        "Media",
        "Journalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael DelloRusso",
                "href": "/profile/Michael-DelloRusso-1"
            },
            "answer_text": "Traditional or Old media includes things like TV, print advertisements, radio, cold calling, and door to door sales. These methods were very effective in the early 2000’s and companies used these methods for years to motivate consumers to purchase their products. Up until very recently, these marketing and advertising styles were very effective and helped businesses make a profit. New Meida or Digital Media, includes SEO, PPC, Social Media, Email Marketing, and most importantly Big Data to serve you the advertisements that you are interested in. New Media has been gaining more prominence over the past 20 years and will soon override traditional media entirely. ",
            "date": "Answered September 9, 2020",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ghermae Ohomna",
                    "user_href": "/profile/Ghermae-Ohomna"
                },
                {
                    "user_id": "Johanna Sabellano",
                    "user_href": "/profile/Johanna-Sabellano-2"
                },
                {
                    "user_id": "James Foreman",
                    "user_href": "/profile/James-Foreman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Innerwork Solutions Pvt Ltd",
                "href": "/profile/Innerwork-Solutions-Pvt-Ltd"
            },
            "answer_text": "traditional media Traditional media refers to forms of mass media that focus on delivering news to the general public or a targeted group of the public. Traditional forms of media include print publications (newspapers and magazines), broadcast news (television and radio) and, in recent years, the digital version of those media outlets, such as digital newspapers and blogs. Traditional media tends to have a longer timeline than social media. Not only can press times slow you down, pieces for traditional media tend to take longer to put together Traditional media pieces are more final, where social media is dynamic. social media The term “social media” is used a lot these days to describe a variety of different digital platforms. For the purpose of this piece, social media refers to social networking sites like Facebook, Twitter, Instagram, Pinterest, YouTube, LinkedIn, etc. Social media on the other hand, gives PR pros the opportunity to really target their messages, selecting everything from the demographics and geography of an audience to the time of day the post will go live. Social media posts are generally shorter, usually meaning they take less time to put together, and can be published immediately. ",
            "date": "Answered October 14, 2020",
            "views": "246",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Afifa Najam",
                    "user_href": "/profile/Afifa-Najam"
                },
                {
                    "user_id": "Stephen Wright",
                    "user_href": "/profile/Stephen-Wright-114"
                },
                {
                    "user_id": "Robinson Perez",
                    "user_href": "/profile/Robinson-Perez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giovanni Baquerizo",
                "href": "/profile/Giovanni-Baquerizo-1"
            },
            "answer_text": "Very simple. Consider traditional media to be television, print, radio, OOHM (Out of Home Media) or billboards. However, in today’s fast moving and technologically advanced times, traditional has bled into digital as content is the most important element to galvanizing audiences. You can watch tv programs on mobile devices and you can see motion on Out Of Home Billboards. So traditional media content plays a big part in digital media. The distinction is basically the way we consume the media and it’s delivery mechanism. ",
            "date": "Answered August 12, 2019",
            "views": "253",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven N Czetli",
                "href": "/profile/Steven-N-Czetli"
            },
            "answer_text": "The difference is the delivery vehicle. Once it was a cumbersome and unwieldy armful of newsprint. Now you can hold the whole thing in the palm of one hand. The biggest change is that it has taken a once a day cycle for print news and opened it up to news as it happens. Story length is no longer constrained by cost realities of printing and distributing hard copies. The chief determinant of length now is reader attention span. ",
            "date": "Updated July 13, 2020",
            "views": "35",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richelle Ramos",
                    "user_href": "/profile/Richelle-Ramos-13"
                },
                {
                    "user_id": "Marc Suezna",
                    "user_href": "/profile/Marc-Suezna"
                },
                {
                    "user_id": "BIR MAN LIMBU",
                    "user_href": "/profile/BIR-MAN-LIMBU"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chiburu Matsuda",
                "href": "/profile/Chiburu-Matsuda"
            },
            "answer_text": "Traditional media basically refers to the older utensils used to create art, such as graphite, ink, clay, light-sensitive dye couplers, charcoal, oil, water and such. Anything that is not on the computer can be considered traditional media. New media is what the modern age has been bringing into the world, with pixels. Things such as Photoshop, digital cameras and 3D- and 2D-rendered graphics are all considered new media artwork. ",
            "date": "Answered November 24, 2017",
            "views": "49",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pawan Aggarwal",
                    "user_href": "/profile/Pawan-Aggarwal-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Hurlbut",
                "href": "/profile/Terry-Hurlbut"
            },
            "answer_text": "Old media includes all pre-Internet institutions, whether they use the Internet today or not. New media includes all institutions that began on the Internet. The distinction is important because the Internet initially had no barriers to entry. Sadly, too many editorial boards, old and new, are trying to erect such barriers today. ",
            "date": "Answered March 17, 2019",
            "views": "890",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bhavey Nagpal",
                "href": "/profile/Bhavey-Nagpal"
            },
            "answer_text": "In simple words, Old Media is the mainstream media we observe today like the radio, newspaper, television. While new media is the future of media industry. The concept of Mobile Journalism, Blogging, Web Journalism are the emerging new media in the world. ",
            "date": "Answered June 6, 2018",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yaksha",
                    "user_href": "/profile/Yaksha-6"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Adolfo-Usier"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Cresby",
                "href": "/profile/Alex-Cresby"
            },
            "answer_text": "Digital Media - 2 way conversation, Open system, Transparent, One on one marketing, About you, Brand and User generated content, Authentic content, Metric Engagement, Actors: Users/ Influencers, Community decision making, Unstructured communication, Real time creation, Bottom up strategy, Informal language, Active Involvement, Deep Analytics, Paid Owned Earned. Traditional Media - 1 way conversation, Closed system, Opaque, Mass marketing, About me, Professional content, Polished content, Metric: Reach/Frequency, Actors/Celebrities, Economic decision making, Controlled communication, Pre-produced/Scheduled, Top Down strategy, Formal language, Passive involvement, Poor analytics, Paid. ",
            "date": "Answered March 10, 2020",
            "views": "138",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Nick Yandell",
                "href": "/profile/Nick-Yandell"
            },
            "answer_text": "  Generally speaking, the difference between new and old media is the digital/analogue divide. Digital media forms have transformed the contemporary media landscape in ways that were unimaginagble 50 years ago, and their impact is still not really understood. ",
            "date": "Answered February 27, 2018",
            "views": "19",
            "upvotes": " Answer requested by Buyannemekh Altantsetseg"
        },
        {
            "author_info": {
                "name": "Tim Cato",
                "href": "/profile/Tim-Cato"
            },
            "answer_text": "The only thing that has changed about news media is the distribution model. What they report and why is the same. The media has always had an agenda depending on who was reporting it. In the past they were a little less overt in their opinions. ",
            "date": "Answered March 19, 2019",
            "views": "296",
            "upvotes": "0"
        }
    ]
}