{
    "title": "What will happen if the Internet goes down globally for 5 minutes or longer? - Quora",
    "tags": [
        "Docker Hub",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Thomason",
                "href": "/profile/Matt-Thomason-6"
            },
            "answer_text": "In the first couple of minutes, mild panic, as everyone tries to reach Facebook to ask if it’s down for anyone else. By T+3, when it’s clear Twitter is *also* included in the shutdown, mild panic turns to fear and dread. At T+5, emergency supplies of anxiety medication will have run out worldwide. By the time we reach the eighth minute, markets will have crashed to a level from which it’ll take weeks to recover, and governments worldwide will have activated their disaster management agencies. Law enforcement will be deployed to prevent the inevitable rioting. Ninth minute, Law enforcement joins in the rioting. In the tenth minute, humanity will have resorted to cannibalism, governments will have been overthrown, the dead will rise from the grave, cats and dogs will be living together, and the Brotherhood of Steel will be hoarding what little technology remains. Those who live to see the eleventh minute will head directly to Facebook and Twitter to post photographs of the apocalypse. ",
            "date": "Answered October 3, 2019",
            "views": "216",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Edwards",
                    "user_href": "/profile/Chris-Edwards-141"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Rome",
                "href": "/profile/Kevin-Rome-2"
            },
            "answer_text": "What will happen if the internet shuts down for 10 minutes globally? In the grand scheme of things, nothing. Services all over the internet go down all the time. People would probably just think, “Oh, my internet is down.” It would be no different than any other localized problem they’ve experienced in the past. People would see it as a local problem. They wouldn’t know it was global for a while. But 10 minutes isn’t likely to affect people since we lose service like that on occasion. People who support the services and networks would be working to figure out why their service went down. Depending on your hypothetical cause, they may or may not find the issue. But they wouldn’t know it was wide spread either. They just know that their company is down and would try to fix it. Ten minutes later, they’d ask “Hey, what did you do to fix it?” And they’d look around at each other in confusion. Or… somebody would say, “I rebooted this server.” Or “I rebooted this router.” And take credit. ;P ",
            "date": "Answered October 3, 2019",
            "views": "100",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Muhammad Adil",
                    "user_href": "/profile/Muhammad-Adil-97"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avi Kr Shome",
                "href": "/profile/Avi-Kr-Shome"
            },
            "answer_text": "Internet halt for even 5 minutes will set the world back in terms of productivity and economically. Large percentage of the world in now technology based. So things will stop. Everything will be back to old days of Addison and Tesla when just electricity was discovered. Yet lot of battery operating gadgets will work. Local Networking may work. You can say tye world will be unplugged for a moment and experience life outside. Which is quite necessary. I get the feeling that in future we might have to deal with this situation for some reason(s). May be solar Storms, may be politics involved, may be AI, may be virus…some situations are necessary. Everything takes a break. Eventually one day. But wish everything goes well. ",
            "date": "Answered September 29, 2020",
            "views": "5",
            "upvotes": " Answer requested by Atharv Telkar",
            "upvoters": [
                {
                    "user_id": "Alex Littleton",
                    "user_href": "/profile/Alex-Littleton-3"
                },
                {
                    "user_id": "Shaohua Huang",
                    "user_href": "/profile/Shaohua-Huang"
                },
                {
                    "user_id": "Oliver Ashmore",
                    "user_href": "/profile/Oliver-Ashmore-2"
                },
                {
                    "user_id": "Wayne Ruffner",
                    "user_href": "/profile/Wayne-Ruffner"
                },
                {
                    "user_id": "Thomas West",
                    "user_href": "/profile/Thomas-West-64"
                },
                {
                    "user_id": "Swaham Mohanty",
                    "user_href": "/profile/Swaham-Mohanty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Armstrong",
                "href": "/profile/Alan-Armstrong-21"
            },
            "answer_text": "It would probably mean there’s some planetary catastrophe on its way to incinerate you. The Internet isn’t a “thing” unless you’re talking about the physical cables and waves that carry its information (and lots of other stuff like phone calls, data and TV programmes) around the world. It’s millions of interconnected computers with no central control and bits of it are connecting and disconnecting all the time. Your own bit of it goes “down” when you shut down your computer. So when the particular connection you’re wanting is “down” you get the error message “404 Not Found.” The rest of the on-line world doesn’t know or care. ",
            "date": "Answered June 3, 2018",
            "views": "665",
            "upvotes": " View 6 Upvoters"
        },
        {
            "author_info": {
                "name": "Alexander Lehmann",
                "href": "/profile/Alexander-Lehmann"
            },
            "answer_text": "I don’t think much would happen, I am currently listening to a regular FM radio that will still work. Most people will think “hey Facebook is down, lets check Twitter to see why” then Twitter is down and you try to send a mail to a friend complaining and that doesn’t work either. I would probably unplug my router to restart it and if that doesn’t work, do something else during the time. ",
            "date": "Answered October 3, 2019",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vern Wall",
                "href": "/profile/Vern-Wall-1"
            },
            "answer_text": "My internet goes out once or twice a week and I have no way to know if it’s out for anybody else. It’s not a big deal. ",
            "date": "Answered October 3, 2019",
            "views": "5",
            "upvotes": "0"
        }
    ]
}