{
    "title": "What is the future of smartphones? - Futuristic Technology ✔ - Quora",
    "tags": [
        "Current Events in Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kumar Devesh",
                "href": "/profile/Kumar-Devesh-9"
            },
            "answer_text": "ANSWER CREDIT : Dinisuru Madawala The Smartphone is dying. With the introduction of iPhone X, the mobile industry is just booming. The technology they occupy is really impressive and it evolves time to time. Apple, Samsung, Google and other notable tech companies in the mobile market thrive to make their products more efficient and awesome.  However, some other technologies are being developed in the shadows. Most people would not notice this change due to the excessive use of smartphones. but Augmented reality (AR) is rising behind the curtains. I’m not talking about the technology, I'm explaining the possibility of wearable devices with AR technology which could replace Smartphones on a massive scale.  AR devices aren't much of a trend these days, but in the near future, AR devices will outnumber smartphones and create a new industry which will combine with a number of different fields such as entertainment, transport, telecommunication, education and so on. People like new things, it was the same when the first smartphone came out. Everyone who saw the product wanted one and it will be the same when a really advanced AR product is introduced. Google glasses sure was an innovative product, but comparing its capabilities with a smartphone, it is inferior.  When Graham-bell invented the Telephone, it was just lined communication, not much of a deal if you ask someone these days. That simple innovative product transformed the telecommunication sector, resulting advance devices that could do tasks which weren't even thought of back then. The same thing happened when Steve Jobs introduced the iPhone. This will be the same effect for AR. Google glasses could operate really well and it could be further developed to do tasks which weren't even thought of in the present era. Currently, a number of companies work on these devices. Smartphones are changing our lives, AR will revolutionize the world.  AR devices will be the next big thing. I’m not saying that smartphones would be completely dead when this happens, but with the evolution of the world, smart cities, artificial intelligence, driverless cars and all these new things, smartphones seem a bit outdated. The world's evolving. Let’s Embrace it # . . . . 👇👇 Here You Will Get All The Major Tech Revolutions Taking Place EveryDay . Futuristic Technology ✔ 👈👈 FOLLOW THIS SPACE ",
            "date": "October 22, 2020",
            "views": "204",
            "upvotes": " View Sharers "
        }
    ]
}