{
    "title": "What happens when Americans join the global Internet? - Quora",
    "tags": [
        "American Ethnicity and People",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Heidi Cool",
                "href": "/profile/Heidi-Cool"
            },
            "answer_text": "I’m not sure what you mean precisely. Most Americans have Internet access and have had it for some time. How we use it depends on the person. The Internet may have been invented in the U.S., but it is indeed global. We can use it to communicate with our next door neighbor or with people on different continents. Social media services, such as Quora and Twitter make it easy for us to meet and communicate with people around the world. Here on Quora I’ve chatted with people in Peru, Egypt, the UK, India and a wide assortment of other places. I enjoy that because it both shows me how much we humans have in common and it shows me how our different experiences can affect our perspectives. On the other hand I know people who are more likely to use Facebook than Twitter or Quora. They may not meet as many people around the world as they tend to friend people that they already know and then broaden out to friends of friends. As such their friends groups may be more oriented towards the U.S. I expect this is also true of many Facebook users in other countries. It may be that they too mostly connect with people they already know in their own region. The Internet gives us access to the world, but whether we connect with people from other countries or not depends on how we use it. This has been true for a long time. These days we typically spend most of our time on the Web or on email, each of which we can use to communicate on an international basis. Before the World Wide Web was created by the British scientist, Tim Berners-Lee, those of us who were online used other protocols such as Gopher (protocol) and Usenet. Usenet also allowed us to communicate with people from around the world. One would follow a specific Usenet group and have discussions with anyone else in the group. Groups were focused on specific topics ranging from computing to individual TV shows. When Americans join the Global Internet they may use it to connect with people from around the world or not. It all depends on their particular use scenario. Some choose to stay within their own familiar bubbles while others enjoy reaching out to connect with people they don’t yet know. I expect we could say this about Internet users in general, not just those of us who are from the U.S. ",
            "date": "Answered September 23, 2020",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas L. Johnson",
                    "user_href": "/profile/Thomas-L-Johnson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Clifford",
                "href": "/profile/Paul-Clifford-27"
            },
            "answer_text": "What happens when Americans join the global Internet? You should know, by asking a question on Quora you have just joined the global internet! People from all over the globe who can read English, are or will read your question! If you mean electronically, then it works similiar to your phone, Electrons flow from your computer to your modem, and ultimately link to a server (transponder) that redirects your electron sequence, through a global distribution of servers, until it reaches a destination server. Of course: it is a bit more complicated than that with protocols etc but that gives you the gist of what happens. It ain’t rocket science! ",
            "date": "Answered September 23, 2020",
            "views": "24",
            "upvotes": " Answer requested by Hamid Ali",
            "upvoters": [
                {
                    "user_id": "Allen Haddick",
                    "user_href": "/profile/Allen-Haddick"
                },
                {
                    "user_id": "Tom Battraw",
                    "user_href": "/profile/Tom-Battraw"
                },
                {
                    "user_id": "Michael Anderson",
                    "user_href": "/profile/Michael-Anderson-884"
                },
                {
                    "user_id": "Duncan Ferguson",
                    "user_href": "/profile/Duncan-Ferguson-20"
                },
                {
                    "user_id": "Jim Sims",
                    "user_href": "/profile/Jim-Sims-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Pickering",
                "href": "/profile/Matt-Pickering-3"
            },
            "answer_text": "Since Americans invented the thing, they are kind of the default membership of the Internet. Everyone else are latecomers to the game. ",
            "date": "Answered September 23, 2020",
            "views": "89",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "August Strube",
                    "user_href": "/profile/August-Strube"
                },
                {
                    "user_id": "Pradeep Sharma",
                    "user_href": "/profile/Pradeep-Sharma-380"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Handy",
                "href": "/profile/Tom-Handy-9"
            },
            "answer_text": "As Matt Pickering said, Americans invented the world wide web. Thus, the internet that almost all Americans have IS the global internet. There was a very early time in the 1990’s when many Americans had the early form of “America Online” which was not the whole global internet. But soon, almost all internet providers supplied the world wide web to all their American customers. Today, we mainly see limited internet in nations with oppressive regimes like China. And of course, schools, libraries and some other institutions may limit their internet feed to protect children. But in general, almost all Americans with internet service have had the full world wide web (global internet) since the 1990’s. ",
            "date": "Answered September 23, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Grupé",
                "href": "/profile/Jim-Grupé"
            },
            "answer_text": "What happens when Americans join the global Internet? Americans won’t “join”” the internet. The internet was started in American and expanded globally. For a very long time, there were few users outside of America. Gradually, more foreign users joined the internet. ",
            "date": "Answered September 23, 2020",
            "views": "21",
            "upvotes": " Answer requested by Hamid Ali"
        },
        {
            "author_info": {
                "name": "Mike Webster",
                "href": "/profile/Mike-Webster-22"
            },
            "answer_text": "No idea as to what you mean by “the global Internet.” The Internet originated at DARPA as the ARPANET so Americans were the first ones to “join” it. ",
            "date": "Answered September 25, 2020",
            "views": "27",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Salvatore Barrera",
                "href": "/profile/Salvatore-Barrera"
            },
            "answer_text": "The global internet comprises the World Wide Web, and therefore, it is still global, especially, too, in Quora. ",
            "date": "Answered September 23, 2020",
            "views": "3",
            "upvotes": " Answer requested by Hamid Ali"
        }
    ]
}