{
    "title": "What's the future of new energy vehicle? - Quora",
    "tags": [
        "Electric Vehicles",
        "Vehicles",
        "Sustainable Technology",
        "Alternative Energy",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "W. L. Miller",
                "href": "/profile/W-L-Miller"
            },
            "answer_text": "Where does 91% of your electricity come from? What did the Dems do when in office regarding these sources of electricity? Watch the youtube video “Tesla VS Nissan Leaf”. For a run up the Rocky Mountain pass and down, they barely make it. Run was under 200 miles. After they got back, both vehicles showed “More than 24 hours to recharge! No matter how you look at statistics, they are still powered by fossil and nuclear power. WHich the dems want to shut down. Then with 9% of the electric power, put everyone into EV’s? Anyone that thinks that will work, show me the math! ",
            "date": "Answered February 5, 2020",
            "views": "52",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Morris（柳兰涛）",
                    "user_href": "/profile/Morris-柳兰涛"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sundares Waran",
                "href": "/profile/Sundares-Waran-5"
            },
            "answer_text": "It should prove itself to be better than gasoline vehicle. Gasoline vehicle outperformed steam vehicle. same way another vehicle like Battery vehicle should outperform petrol vehicle in all aspects that people will naturally prefer electric vehicle. This CAN include government incentives. But in a fair game I will not prefer a penalty on a petrol vehicle with out sufficient reason; if it can reduce Emissions. The cattle release [with no implied offense to Go sewaks ] more methane, world wide. When Battery vehicle Becomes successful it will be very simple . I am looking forward to the day when that ideal Battery arrives. ",
            "date": "Answered February 5, 2020",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Morris（柳兰涛）",
                    "user_href": "/profile/Morris-柳兰涛"
                }
            ]
        }
    ]
}