{
    "title": "What was the first computer ever? How did it work? - Quora",
    "tags": [
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Crosley",
                "href": "/profile/Tom-Crosley-1"
            },
            "answer_text": "The is the Kenbak-1, designed by John Blankenbaker:  The Computer Museum in Boston was asked “What was the first PC?” in 1986, and held a contest to find the answer. Judges settled on Kenbak-1 as the first personal computer. Here’s a description of the contest: According to, \"The Computer Museum Report, Volume 17 — Fall 1986, advertisements went out worldwide from October 1985 to March 1986, designed to solicit old machines for the purpose of analyzing them and measuring them against pre-determined standards specifically developed to make such a determination. According to the report, the heading of the ad ran — \"Wanted: Old Thinker-toys\". Offers flooded them from 13 countries, vying for recognition. The report indicates that over 320 entries were received. A panel of judges prescribed the criteria needed to measure if an electronic computing device qualified as a Personal Computer. A total of 137 items were reportedly accepted. The judges were, according to the report, Stephen Wozniak, designer of the Apple II and co-founder of Apple Computer, David Bunnell, an early MITS employee, current publisher (1986) of PC World, and Oliver Strimpel. Only after searching worldwide did they make their decision that the Kenbak-1, designed, built and marketed by, John V. Blankenbaker in 1971, through his California based, Kenbak, Corporation, qualified as the \"world’s first personal computer\". Only 50 were built; about 14 still exist. I bought one from an ad in Scientific American in 1971 for $750, and sold it to a collector about 15 years ago for considerably more than I paid for it. The Kenbak-1 was a third generation computer (CPU made up of 7400-family logic chips, did not use a microprocessor). It was truly an 8-bit machine, not only did it have an 8-bit data path, but an 8-bit address as well, so it could only address 256 bytes of memory, which was implemented using two 1024-bit shift registers. What it did have going for it (and what appealed to me when I bought it) was a full set of addressing modes, including immediate, direct, indexed, indirect, and indirect-indexed. It had two accumulators (A and B), and an index register X, similar to the 6800 which would be my next CPU. See the eight pushbuttons on the left, four black and four white? That was the sole input mechanism. One would input a starting address, then input the contents for that location, then it would increment to the next address, and you would input data for that location also. The buttons (along with the little lights above them) were arranged in a pattern 2–3–3 because the documentation used octal notation, popular at the time. There was no assembler. Programs were written out and converted to machine code by hand. They provided a coding sheet to make this a little easier:  I got tired of entering programs by hand all the time, so I added an ASR-33 (Teletype) interface to it, so I could just enter a very short bootloader program and then read programs in off of a paper tape. Since the company included the schematics, and the CPU was made up of discrete ICs, I modified the computer to add an external interrupt facility. I made all the hardware changes using a separate perfboard, so it was easy to remove them before selling it. ",
            "date": "Answered June 27, 2019",
            "views": "618",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ron Baumback",
                    "user_href": "/profile/Ron-Baumback"
                },
                {
                    "user_id": "Divyanshu Raj",
                    "user_href": "/profile/Divyanshu-Raj-3"
                },
                {
                    "user_id": "Kaiya Mudge",
                    "user_href": "/profile/Kaiya-Mudge-2"
                },
                {
                    "user_id": "Alan Mellor",
                    "user_href": "/profile/Alan-Mellor"
                },
                {
                    "user_id": "Garry Taylor",
                    "user_href": "/profile/Garry-Taylor-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Berkun",
                "href": "/profile/Ken-Berkun"
            },
            "answer_text": "Michael Davey’s answer appears to be the only one (so far, sorry if I missed others) that actually attempts to answer this question (and does a good job of it). The others seem to address their own first computer or the first personal computer, but not “the first computer” or “how did it work”. Unfortunately there was no “first computer”. Like so many other complicated things it evolved. Davey addresses that quite well. But a little googling will teach you more fun things about how these evolved. “How it worked”, is a tough question because it depends on which machine you’re talking about. The Greek device that Davey hints at (the antikythera mechanism) was a bunch of gears in a very sophisticated arrangement, but closer to clockwork than anything we would consider a computer today. I lean towards the Zuse computers as being the first more or less modern computer (but this is debatable) used relays - relays are electrically controlled switches, which is exactly what transistors are, except mucho smaller. (Z3 (computer) - Wikipedia) Turing didn’t even use relays or tubes, just thought and relatively simple math and yet he was the one that formalized computing as we know it. Later early computers also used relays, then vacuum tubes (which worked as, surprise, switches!), then later, transistors as they do today. The other way of looking at “how they worked” is whether they were instructed (programmed) by hooking up wires (“patch cords”) or whether the program instructions were stored in the computer itself (programs as data). So what you may be asking is what is the first stored program computer (sort of resembling what we do today) and how did it work. My answer is the Zuse computers, but again, others may have different answers. The Zuse used relays to store both the program and the data. For more detail on how stored program computers work you’ll have to start googling - that’s more than I feel like writing right now, but there are plenty of resources on the web. ",
            "date": "Answered August 2, 2020",
            "views": "85",
            "upvotes": "0"
        }
    ]
}