{
    "title": "When was audio recording invented? - Quora",
    "tags": [
        "Audio Recording",
        "Audio"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nazar Fedorchuk",
                "href": "/profile/Nazar-Fedorchuk"
            },
            "answer_text": "Sound recording as we understand it now officially started in 1877 with the invention of phonograph cylinders by one Thomas Alva Edison. He patented the device called a cylinder phonograph a year later, on December 6, 1877, and it wasn't long before it became insanely popular.  A typical cylinder phonograph The invention was a side effect, in a way. Edison was working on recording phone messages, and he found that a metal cylinder wrapped in foil could be used to record sound vibrations. A recording needle would pass over the cylinder, and the vibrations would be punched into the cylinder in a pattern. Mass production of wax cylinders started in 1901. These were cheaper and much faster to manufacture. However, with time, it was getting harder and harder to compete with discs (cartridges for Emile Berliner's disc phonograph patented in 1887). The production of cylinders ceased in 1929, and by that time Edison had long ago moved on to gramophone discs. However, there is evidence of earlier sound recorders, which hadn't won recognition, and so the earliest recording dates back to 1860. ",
            "date": "Answered March 1, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve Lanzi",
                    "user_href": "/profile/Steve-Lanzi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Holmén",
                "href": "/profile/Robert-Holmén"
            },
            "answer_text": "The first audio recording we know of was in 1860 1860 'Phonautograph' Is Earliest Known Recording It is only recently that the recording could be played back, however. The first working audio recording device that was intended to have playback was Edison’s Phonograph in 1877. Phonograph Although it functioned it took several decades of refinement to make the process practical. Claims of audio recording before these devices are impossible to substantiate. ",
            "date": "Answered February 14, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rich Hladky",
                    "user_href": "/profile/Rich-Hladky"
                }
            ]
        }
    ]
}