{
    "title": "When a patient arrives in the ER unconscious, but without any visible trauma, what are the first considerations and actions emergency doctors and nurses take? - Quora",
    "tags": [
        "Emergency Room",
        "EMTs and Paramedics",
        "Emergency Medicine",
        "Emergencies",
        "Nurses",
        "Nursing",
        "Hospitals",
        "Doctors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Nolan",
                "href": "/profile/Kevin-Nolan-74"
            },
            "answer_text": "I am not an ER doctor, but as an anesthesiologist, I was sometimes involved in the resuscitation of patients in the ER. In the situation that you describe, my first concern would be a possible drug overdose. The emergency room staff would also be highly informed about the presence of infectious disease and the likelihood of drug overdose in the hospital neighbourhood. Depending on the age and the general habitus of the patient, I would then consider the diagnoses of a myocardial infarction, potentially fatal dysrhythmia, an intracerebral haemorrhage or a ruptured aortic aneurysm. What is less likely, might be an acute septic event such as meningococcal meningitis, complications of poorly managed diabetes mellitus such as hypoglycaemia or ketoacidosis, acute pulmonary embolism or complications of pregnancy. The patient is approached with a combined rapid diagnosis and management technique in a team management context. A leader is designated and specific tasks are assigned. The initial steps are performed by referring to the acronym ABC; A for airway, B for breathing, C for circulation. A brief Airway examination means an inspection of the mouth, face, neck and chest for bruises, swelling or lacerations. Breathing is quickly assessed by looking for or feeling for the presence of spontaneous respirations or by auscultation with a stethoscope over the nose or lips, the tracheal region in the neck and central lung fields. Examination of the Circulation would include quickly palpating a radial carotid or femoral pulse, examining the skin of the face for colour and warmth and by auscultation for heart sounds. Simultaneously, precise repeated measurements are made of the patient’s vital signs: blood pressure, heart rate, spontaneous breathing rate and pattern; the temperature, oxygen saturation and EKG rhythm are also immediately obtained and observed on an ongoing basis. The colour of and the possible presence of rashes, injection sites, lacerations on the skin or deformities of the patient's extremities and the torso are noted. At one point, the patient is carefully turned using neck stabilization to examine their back and sides. Intravenous access is obtained; a brief neurological exam is performed ( and periodically repeated) including pupillary response to bright light, the muscle tone of limbs, presence of spontaneous movement of face or limbs whether purposeful or disorganized, withdrawal of limbs to painful stimulation. Other possible immediate testing might include ultrasound examination of the abdomen ( looking for ruptured aorta, evidence of fluid or signs of pregnancy); bloodwork including haemoglobin, platelet and WBC count, electrolytes, glucose and arterial blood gases. Blood is sent for toxicological and bacteriological studies. A urinary catheter is inserted to assist in monitoring fluid balance status. Urine is promptly examined for the presence of blood, signs of infection or skeletal muscle injury (brown colour), signs of metabolic issues ( excess sugar or protein levels, pH level). Depending on the results ( both immediate and subsequent) of these various diagnostic tests, and the patient’s response to ongoing therapy, the ongoing management is being frequently reconsidered by the team leader; eliminating some possibilities and refining others using particularly strong pieces of evidence as it becomes available. Meanwhile, additional personnel are standing at the patient’s bedside, employing their own refined observation skills and familiar equipment; they are continuously observing the patient’s blood pressure, heart rate, breathing, and any response to speech or possible spontaneous movements. These staff are regularly communicating any changes in the patient’s status to the designated team leader. Inadequate respiratory function of the patient may lead to a decision to assist or control the patient's respirations. This intervention is considered in a balanced way because its goals may be achieved only with the use of sedation or airway devices which limit the patient’s ability to speak clearly A renewed, persistent effort is made by other personnel to obtain any useful information, from anyone who knows anything about recent events involving the patient. Additional specialist consultation is often obtained; again, directed by initial findings, response to therapy and ongoing information collected from investigations. The patient’s family members will be contacted (if it is practical to persist in doing so); they will be updated on the patient’s condition and may even be invited into the resuscitation area in the company of supportive, informed staff. The patient may require an emergency CT scan of the brain, vertebral column, thorax and abdomen. They may also require emergency transfer to the operating room for an exploratory procedure. ",
            "date": "Updated December 1, 2019",
            "views": "206",
            "upvotes": " View 92 Upvoters ",
            "upvoters": [
                {
                    "user_id": "LJ Palmer",
                    "user_href": "/profile/LJ-Palmer"
                },
                {
                    "user_id": "Katie Brown",
                    "user_href": "/profile/Katie-Brown-978"
                },
                {
                    "user_id": "Brook Kubik",
                    "user_href": "/profile/Brook-Kubik"
                },
                {
                    "user_id": "Erin Mandziuk",
                    "user_href": "/profile/Erin-Mandziuk"
                },
                {
                    "user_id": "Krystal Lambert",
                    "user_href": "/profile/Krystal-Lambert-5"
                },
                {
                    "user_id": "Renee Piraino",
                    "user_href": "/profile/Renee-Piraino"
                },
                {
                    "user_id": "Yvonne Vander Duim",
                    "user_href": "/profile/Yvonne-Vander-Duim"
                },
                {
                    "user_id": "Richard Einhorn",
                    "user_href": "/profile/Richard-Einhorn-5"
                },
                {
                    "user_id": "Leos Sil",
                    "user_href": "/profile/Leos-Sil"
                },
                {
                    "user_id": "Suzee Short",
                    "user_href": "/profile/Suzee-Short"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melissa Wingfield",
                "href": "/profile/Melissa-Wingfield-6"
            },
            "answer_text": "Thank you for the A2A. I can tell you this from personal experience. I was home and woke up from a nap. Within 5 minutes my legs and arms felt like lead and I could not walk, but could crawl … barely, and even then I had to crawl next to a wall so I wouldn’t tip over. The second I knew something wasn’t right, I grabbed the phone. Within the next minute, I could not talk. Idk why … it felt like my vocal chords just stopped working. So I called 911, and could barely get info to the person on the line. The ambulance was there within a couple of minutes, and I was off to the hospital. At this point, in the ambulance, I was in and out of consciousness, and every time the EMT asked what my name was I eventually couldn’t talk anymore, and arrived unconscious in the ER. But … I could still hear things and hear people talk, etc. Not 100%, but a lot of it. (And some of the nurses who knew me from the “old” days were such bitches from what they said … I’ll never forget one of them … speaking to me as if I was faking it all (still unconscious though) … “you want us to cut your shirt open, it’s a nice one”). I heard the ER DR say to put me in Room 4, the most critical room in the ER. They put a lot of heart monitors on me, but I don’t remember that part. I do remember hearing the heart monitor machine though and it was a steady beat the entire time. I remember them undressing me … one person at one end pulling my top off, and the other person at the other end, pulling my shorts off. Still no change in heart rate. Apparently the only reason they did this was because I was sweating so much they were trying to cool me down. Idk if I had a fever. At one point someone drew blood (I never had an IV), but I don’t remember the needle going in. I knew they drew blood because I could hear the DR asking what my blood sugar was (93), and for other things I don’t recall right now. All blood work was normal … and I knew they tested me for things that I could have potentially OD’d on as well, because later on when I got the Medicare summary, I looked at everything, and saw what they’d drawn … salicylic acid, acetaminophen, etc). The reason for this is because 22 years ago I OD’d more than once on these things, so that was their first guess when I got off of the ambulance … typical for the ER, even after 22 years of never being in the ER for any mental illness reason. (Once it is in your chart that you have a mental illness or anything related to a mental illness, that never goes away (fact), and you are treated much differently than other would be …. I have been through this many times). Anyway, I remember the ER DR looking in my eyes and yelling to the nurses to get a certain DR down to the ER STAT. Not sure what he saw, but I remember this so clearly … when he opened my eyelids, it was like I was looking right up at him; I could see him … yet my eyes didn’t look normal. Idk what he saw, but that was when he yelled for the other DR to get there. It was the strangest thing. Idk how long I was like that, but eventually my body started coming back to life, my eyes opening first, then little by little my arms and legs … then they put me in another room. First question after I was in the other room and when I was alert (I still could not walk at this point, but I could sit up if I slouched over) was by a nurse, who said, “So what did you take?” I said “Nothing.” Another nurse came in and her first question was “So what did you take?” and I replied the same way. Then a third one, same thing. Now, to a person who has never OD’d, the answer would most likely be “what do you mean?” But because I was so used to answering their questions (in the past … it was like it was all happening all over again), I said “Nothing. I didn’t take anything.” Then the DR came in and asked questions as to what happened, and I told him what happened that led me to the ER. He asked when the last time I saw my psychiatrist was, and I said a few hours ago, and I was fine when I saw him. The only DR who the ER called was my psychiatrist … after arriving at the ER, the immediate assumption was that it was a mental illness issue/OD. Nothing else. Nothing medical. My primary care DR was not called. My psychiatrist told the ER DR that I had a panic attack and that I was fine, that he just saw me. Do I think I had a panic attack? No, I don’t … I have had them before and they never made me lose consciousness at all. There was nothing for me to panic about either … I had just woken up from a nap (no nightmare), barely awake, when all the stuff started happening. No one ever knew what really caused what I went through to happen. So this is what happened when I arrived at the ER unconscious. I know everyone experiences different problems when they lose consciousness and arrive at the ER, but this is what happened to me. ",
            "date": "Answered February 3, 2019",
            "views": "237",
            "upvotes": " View 130 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob Denman",
                    "user_href": "/profile/Bob-Denman-2"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-86"
                },
                {
                    "user_id": "Libby Nusz",
                    "user_href": "/profile/Libby-Nusz"
                },
                {
                    "user_id": "Sandra Harrison",
                    "user_href": "/profile/Sandra-Harrison-86"
                },
                {
                    "user_id": "Aimee Robinson",
                    "user_href": "/profile/Aimee-Robinson-2"
                },
                {
                    "user_id": "Sarah Turnbull",
                    "user_href": "/profile/Sarah-Turnbull-26"
                },
                {
                    "user_id": "Amanda Cummings",
                    "user_href": "/profile/Amanda-Cummings-14"
                },
                {
                    "user_id": "Jacquelyn Kemp",
                    "user_href": "/profile/Jacquelyn-Kemp-2"
                },
                {
                    "user_id": "Shelley Kapach",
                    "user_href": "/profile/Shelley-Kapach-1"
                },
                {
                    "user_id": "Phil Seiden",
                    "user_href": "/profile/Phil-Seiden"
                }
            ]
        }
    ]
}