{
    "title": "When did dyscalculia (learning math disorder) become generally accepted as an authentic learning disability by education and medical professions? What assessment is used for IEP eligibility? - Quora",
    "tags": [
        "Dyslexia, Dyscalculia, Dysgraphia, Auditory Processing Deficit",
        "Dyscalculia",
        "Individualized Educational Program (IEPs)",
        "Learning Disorders",
        "Special Education",
        "Learning Disabilities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert M. Gross",
                "href": "/profile/Robert-M-Gross"
            },
            "answer_text": "Adding to the previous answers, there are a number of testing tools that measure both math fluency and comprehension against standard grade levels. If you aren’t familiar with those terms, math fluency is typically tested with numeric problems (e.g. 2+2=?) and math comprehension by forms of word questions. At early grade levels there are pictorial tests. One of the issues, not an easy one, is distinguishing actual dyscalculia from previous bad education. Our math department’s go to phrase was “What the hell are they teaching in Middle School?” When did dyscalculia (learning math disorder) become generally accepted as an authentic learning disability by education and medical professions? What assessment is used for IEP eligibility? ",
            "date": "Answered May 31, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karen McKearn",
                "href": "/profile/Karen-McKearn"
            },
            "answer_text": "Hi Robin, dyscalculia, or a math learning disability was around since the mid 1940s, but not really official until 1974 by the department of education. School psychologist and a diagnostic team of maybe another teacher/department head will do testing. They will go over their results. Then if the student does have the math disability, a parent-teacher meeting is held with the student present, so they understand what is going on, as well. If the parent agrees to services, and IEP is written to help the student. Math disability or dyscalculia, is not being able to understand, or manipulate using number, doing arithmetic operations or mathematical calculations. It’s a deficit in number sense. There is between 3 to 6% of the population that has this math disability, and of that population, 11% has ADHD. ",
            "date": "Answered May 26, 2020",
            "views": "96",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "Robert M. Gross",
                    "user_href": "/profile/Robert-M-Gross"
                },
                {
                    "user_id": "Anne Benzow",
                    "user_href": "/profile/Anne-Benzow"
                },
                {
                    "user_id": "Robin Harville",
                    "user_href": "/profile/Robin-Harville"
                }
            ]
        }
    ]
}