{
    "title": "When a Blu-Ray disc does not play, what is happening inside the player? - Quora",
    "tags": [
        "Sony Electronics",
        "DVD Players",
        "Blu-ray"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Sheppard",
                "href": "/profile/Bill-Sheppard"
            },
            "answer_text": "The \"grinding\" sound you hear is the laser pickup moving trying to read the disc.  If it's unable to read the disc it could be dirty, could be failing, could be poorly-aligned, or the disc could be dirty.  I'd suggest cleaning the disc first (radially from the center, not in a circle), and if that doesn't work you might consider blowing compressed air into the disc slot, or better yet taking the cover off the player (unplug it first) and blowing the air at the laser, which hopefully will be fairly obvious as the part which can move back and forth.  Otherwise the player may be failing; the good news is that you can probably replace a three-year old player with a much better one (more internet features) for less than half the price you paid originally. ",
            "date": "Answered November 15, 2011",
            "views": "96",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Healy",
                    "user_href": "/profile/Ryan-Healy-4"
                },
                {
                    "user_id": "Chris Thomson",
                    "user_href": "/profile/Chris-Thomson"
                },
                {
                    "user_id": "Harmon Bruno",
                    "user_href": "/profile/Harmon-Bruno"
                },
                {
                    "user_id": "Garrick Saito",
                    "user_href": "/profile/Garrick-Saito"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rodney Greene",
                "href": "/profile/Rodney-Greene"
            },
            "answer_text": "If your player is a blu ray player then it could be a couple of reasons why it play at times. It could be that you need to update the firmware or you need a laser lens cleaner ",
            "date": "Answered May 16, 2014",
            "views": "15",
            "upvotes": "0"
        }
    ]
}