{
    "title": "When was Bluetooth technology invented? - Quora",
    "tags": [
        "Bluetooth Devices",
        "Bluetooth",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Avnish Agarwal",
                "href": "/profile/Avnish-Agarwal-5"
            },
            "answer_text": "A major sociopolitical figure from 10th century Scandinavia reverberates today in the name of a communications company that has developed a single communications standard for connecting our complex world of mobile computing devices. On May 12th, the National Inventors Hall of Fame will induct Jaap C. Haartsen as the inventor of Bluetooth wireless technology. Although not the only innovator to have a hand in the development of the wireless communications standard, Haartsen was responsible for some important Bluetooth advances and is the sole inventor listed on the patent protecting basic Bluetooth communications. Between 958 and 970 AD, the kingdom of Denmark was ruled by Harald Blåtand, also known as Harald Bluetooth. Some of the major events of Harald’s reign include his conversion to Christianity in 960 and expansion of the Danish kingdom into lands which are part of present-day Norway. Converting the Danes to a single religion and engineering a series of public works for the Danish people helped Bluetooth unify many Danish tribes into a single country which still exists with us today. If our readers have ever wondered what the sharp, angular Bluetooth symbol stood for, they might be interested to know that it is a combination of the Danish runes for H and B. Fast-forwarding about one millennium to the mid-1990s brings us to the earliest days of the modern Bluetooth that we know today. In 1993, Jaap Haartsen was working as a wireless communications engineer for Swedish digital communications firm Ericsson when he was tasked to develop a short-range radio connection that would enable new functionalities for mobile phones. In 1995, Haartsen was joined by Sven Mattisson, another engineer of wireless communication technologies, and the pair were able to develop multi-communicator, or MC, links. Linking two Bluetooth-enabled devices creates an ad-hoc, short-range wireless network known as a “piconet.” These piconets, which operate in an unlicensed industrial, scientific and medical (ISM) band ranging from 2.4 gigahertz (GHz) to 2.485 GHz, are dynamically created whenever Bluetooth devices are within ten meters of each other. Eight devices can connect to the same piconet at once and multiple piconets can operate on the same device at the same time. When connected to the piconet, one device that has been designated as a master can transmit data to one or more slave devices. Each piconet can handle digital communications involving voice, data, printing, faxes and more, and the ability to operate multiple piconets at the same time enables Bluetooth to provide an incredible amount of short-range telecommunications functionality. Haartsen’s work would focus on piconet networks over the coming years and he would leave Ericsson to play a role in the founding of the Bluetooth Special Interest Group (SIG) in 1998. Between 1998 and 2000, Haartsen served as the chairman of the SIG air protocol certifications group, helping to standardize the Bluetooth radio communications protocol. ",
            "date": "Answered November 7, 2017",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vinnu Hai",
                    "user_href": "/profile/Vinnu-Hai-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sunny Govind",
                "href": "/profile/Sunny-Govind"
            },
            "answer_text": "Bluetooth technology was invented in 1994 by a electrical engineer Dr. Jaap Haartsen while he was working for Ericsson.  Father of Bluetooth Dr. Jaap Haartsen. He was nominated as Inventor of the Year by European Patent Office Ericsson is the world's leading provider of communications technology and services and dates back its existence as old as 1800’s. ",
            "date": "Answered August 5, 2018",
            "views": "44",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dominic Zhang",
                    "user_href": "/profile/Dominic-Zhang-9"
                },
                {
                    "user_id": "John Oyeniyi",
                    "user_href": "/profile/John-Oyeniyi-1"
                },
                {
                    "user_id": "Jayant",
                    "user_href": "/profile/Jayant-42"
                }
            ]
        }
    ]
}