{
    "title": "When was fiber optics invented? What was the impact of this invention? - Quora",
    "tags": [
        "Optical Fiber",
        "Inventors",
        "Optics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charlie Hubbard",
                "href": "/profile/Charlie-Hubbard-2"
            },
            "answer_text": "In reality no one person created fiber optics. There were lots of small discoveries and ideas that led to eventual creation of what we understand as fiber optics in a commercial sense, but people had been writing about aspects of it all the way back to 1840s. The idea of using light combined with telecommunications happened very early with Alexander Graham Bell so telecom was thinking about this idea very early on, but couldn’t make it practical until the 1970s. It was researches Robert D. Maurer, Donald Keck, Peter C. Schultz, and Frank Zimar working for Corning in 1970 that created the practical process for creating fiber optic cables. In 1970 they demonstrated a 17db/km fiber optic cable. A few years after that they produced a 4db/km cable and that is what jumped started the fiber optic industry. In 1981 General Electric produced the first fused quartz ingots that could be drawn into strands 40 km (25 miles) long. This made building the internet much cheaper because light doesn’t attenuate as much as electronic signals going through wires. This meant fewer repeaters were necessary to boost signals over long distances. In order to span the globe we needed long cables that could send signals very quickly (ehem at the speed of light) over great distances without loosing the information. If we did this with copper wires it would require more boxes to boost the signal along its way. This in turn requires more power to boost those signals. With fiber optics the signal it doesn’t require near the power per km. That’s what that db/km measurement is up top is about. There are many other advantages as well: can’t be wire tapped, no electromagnetic inference, no ground loops, etc. Originally fiber optics was all about voice so making international telephone calls could be clearer and faster to deliver, etc. Latter it became about data in the 1990s when the big telecoms told Congress they could rewire America’s 100 year old copper based infrastructure with fiber optics if they could charge its customers extra money for it. Some of that happened, but a lot of it was abandoned and the money was wasted. They mainly update THEIR infrastructure on our dime, and left the last mile (ie to our homes) unsolved. The last mile problem was constantly the topic of conversation in the 90s and 2000s in telecom circles. Still is, but most have given up trying to make it practical (well Google hasn’t god bless em). $200 Billion Broadband Scandal Fiber optic was a wonderful invention that without it wouldn’t allow us to have our internet we have today, but because it was so promising and such an improvement grandiose promises made to halfwits (ie Congress people) who don’t know when someone is over promising allowed it to be abused for fraud and greed. ",
            "date": "Answered August 16, 2016",
            "views": "944",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dr-E-Stan-Miller"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anita Tan",
                "href": "/profile/Anita-Tan-9"
            },
            "answer_text": "Fiber optic cable is one of the most important inventions of this century. Fiber-optic cables use glass as a medium instead of copper, making a hair-thin fiber that transmits as much information as a large copper \"line\". It has completely changed the mode of human communication, laying the foundation for the current information highway, making the fantasy of \"sending a movie with a telephone line\" a reality. Invented the fiber-optic cable, which is known as the \"father of fiber optics\" Chinese scientist Gao Song. Gao Song was born in Shanghai in 1933. ",
            "date": "Answered September 30, 2018",
            "views": "588",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sam V",
                    "user_href": "/profile/Sam-V-43"
                }
            ]
        }
    ]
}