{
    "title": "When was the computer invented? Why? - Quora",
    "tags": [
        "Inventors",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ernest W. Adams",
                "href": "/profile/Ernest-W-Adams"
            },
            "answer_text": "The computer we know today is properly called the Von Neumann stored-program general purpose binary digital computer. It was the mathematician John Von Neumann who had the idea of storing the software in the same memory where the data was kept, and Vannevar Bush who realized that it was easiest to represent numbers in binary. But there were many other kinds of computers and calculating machines before the current kind. There were adding machines that represented numbers with rotating gears, and analog computers that computed values with changing voltages, or different distances along a sliding stick or wheel. The slide rule could multiply, divide, extract square and cube roots, and compute trigonometric functions—all via marks etched into ivory. Lots of early computers had specialized, single-purpose functions. The Norden bombsight determined when to drop bombs by computing using the speed and altitude of the aircraft. Colossus was a special-purpose machine for decrypting German ciphers in World War II. Back around 100 BC the ancient Greeks even had a bronze mechanical computer for predicting astronomical events. It's the earliest calculating machine ever known. It worked with gear ratios. The first computer of today's kind, with programmable functions, was invented by the Englishman Charles Babbage in the early 1800s. It was supposed to be made with brass gears, and programmed with punched cards. But he never got enough money to actually build it. His friend Ada Lovelace wrote a program for it, though, the first software ever. ",
            "date": "Answered September 27, 2019",
            "views": "25",
            "upvotes": " View 64 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rich Whitsell",
                    "user_href": "/profile/Rich-Whitsell"
                },
                {
                    "user_id": "Jason De Donno",
                    "user_href": "/profile/Jason-De-Donno"
                },
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "Chetan",
                    "user_href": "/profile/Chetan-233"
                },
                {
                    "user_id": "Adam Forrester",
                    "user_href": "/profile/Adam-Forrester-8"
                },
                {
                    "user_id": "Pete Trott",
                    "user_href": "/profile/Pete-Trott"
                },
                {
                    "user_id": "Pasha Aulia Muhammad",
                    "user_href": "/profile/Pasha-Aulia-Muhammad"
                },
                {
                    "user_id": "Raymond Russ Kroll",
                    "user_href": "/profile/Raymond-Russ-Kroll"
                },
                {
                    "user_id": "Jerry Mc Kenna",
                    "user_href": "/profile/Jerry-Mc-Kenna"
                },
                {
                    "user_id": "Pete Laberge",
                    "user_href": "/profile/Pete-Laberge"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Colt",
                "href": "/profile/Kevin-Colt-3"
            },
            "answer_text": "in addition to the answers above I submit this… a mechanical computer was discovered in africa about 40 years ago. it was determined to be approximately 700 years old. it consisted of 50 or more wooden boxes with springs attached to pulleys inside of them. it used ropes pulled by an elephant to activate it. according to an article i read in scientific american, an operator would pull various knotted ropes arranged on a horizontal board with an input program. this would set the springs in various positions acting as boolean logic gates. when the elephant pulled the bundle of ropes, the logic gates would release the tension on the knotted input ropes and the answer could then be read from the operators position. it was quite ingenious according to the people that analysed the site. i would have loved to see it in action. I don’t remember the issue of scientific american i read this in but it was fascinating. ",
            "date": "Answered November 26, 2019",
            "views": "100",
            "upvotes": "0"
        }
    ]
}