{
    "title": "When will technological development slow down? - Quora",
    "tags": [
        "Technological Development",
        "The Future",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Vargic",
                "href": "/profile/Martin-Vargic-1"
            },
            "answer_text": "It has likely already started to slow down roughly 1–2 decades ago. Moore's law, used as a main argument by many people who believe in accelerating technological progress (and has been already broken) describes only a single kind of technology - integrated circuits. That is probably the area of technology where the most progress has been made for the last few decades - and I posit that is just because there the real research money is. Amount of researchers and engineers working on developing new, better and cheaper integrated circuits is astounding - other technologies don't get even nearly so much focus. For the last century or so, most progress has always been done in the fields where the most money was invested - the lightning-fast technological advancements in weaponry and nuclear science during the WWII, or the rocketry and telecommunications during the Space Race were possible only because the government allocated much more funding to research and development than usual. Concentrating a large amount of engineers and scientists to work together on a same project will almost every time produce more net advancement compared to if every member worked alone. Nowadays, a growing share of research and development is financed by investors, who want to see as high returns as possible - and the integrated circuits are a highly competetive market where a slight improvement in computational power, efficiency or price gives a major edge compared to the competitors. I any other field of science and engineering, technological progress is both less quantifiable and visibly less significant than in integrated circuits, as potential improvements are not seen as profitable enough to warrant as much research and funding. Most charts that describe the acceleration of technological progress suspiciously correlate with the population growth charts. That actually makes sense - a higher population usually results in a higher net amount of scientists and engineers, and a higher amount of scientists and engineers usually results in more technological progress. As the population growth rates are slowing down throughout the world - and in countries that are the most developed the population is even declining, I think the amount of scientists and the rate of technological progress is going to mirror it in the coming decades (save for some exceptional periods of time such as wars or something like a new space race)    The chart above is the most significant, if we posit thas an accelerating growth rate of the population of researchers results in accelerating rate of technological progress. If we assume that it takes a person roughly 30 years from birth to become involved in the field of research and development, the growth rate of the population of researches hit its peak in the 1990s/2000s - since then, it is decelerating. It is very possible that the rate of technological progress is already decelerating since then. ",
            "date": "Answered October 30, 2016",
            "views": "39",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Àaron Smith",
                    "user_href": "/profile/Àaron-Smith"
                },
                {
                    "user_id": "Suchen Luo",
                    "user_href": "/profile/Suchen-Luo"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-5837"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcin Krol",
                "href": "/profile/Marcin-Krol-3"
            },
            "answer_text": "It's already slowing down, unfortunately: Page on mait.camins.cat Reasons, according to my totally unscientific feeling \"by seat of pants\": 1. Most of \"low hanging fruits\" have already been harvested It's stil possible to innovate, but innovation has to be increasingly sophisticated, with ever greater amounts of bright thinking, funding, right ideas, right environment. Since this requires \"all cylinders\" firing to make the innovation happen, and most governments and people and lawmakers and businessmen are not smart enough to provide all of the key aspects working, only some of them, innovation slows down. 2. Unwillingness to actually spend money on innovation. I used to work at the company that was proud of itself on innovation. I observed an unfortunate principle in practice, though: the willingness to do and fund actual innovation has been inversely proportional to the amount of talking about it. The more everyone was excited about it, the more conservative and counter-innovative approach they took in daily practice. ",
            "date": "Answered June 12, 2014",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Phil Jones (He / Him)",
                    "user_href": "/profile/Phil-Jones-He-Him"
                }
            ]
        }
    ]
}