{
    "title": "When will we have futuristic cities? - Quora",
    "tags": [
        "Futurists",
        "Futurism"
    ],
    "response": [
        {
            "author_info": {
                "name": "John McAllister",
                "href": "/profile/John-McAllister-37"
            },
            "answer_text": "“When will we have futuristic cities?” That depends on what era of “futuristic cities” you mean. The 1970s “Logan’s Run” type? Never. The whole domed city, peaceful paradise, and Greek clothing stuff was our dreams of a better world. The 1980s saw an end to those dreams. The War on Drugs, among other things, sent us down a different path. The 70s were Utopian fantasies. Now, it’s Dystopian. Cities are cesspools of violence and crime. And, it gets worse with democrats trying to ban firearms and make their utopian ideas come true while making all Americans criminals (War on Drugs while they themselves use them) and make things worse with communistic views. All it does is prime us for cults and criminals. Ever notice that most cults are socialist/communist in nature? And how they tend to end like Jim Jones? That’s the communist idea of paradise. Most of us call it Hell. So, thanks to the Republicans and Democrats, we traded this  for  The police went from possibly being  to  Because crime got WORSE, not better. Who needs  When you have traitors in the government who attack the people instead of helping them? ",
            "date": "Answered March 5, 2020",
            "views": "141",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kaustubh Sivalenka",
                    "user_href": "/profile/Kaustubh-Sivalenka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Corbin",
                "href": "/profile/Bill-Corbin-9"
            },
            "answer_text": "I can walk into a coffee shop , place my tablet onto their charger and hook up to wifi and find news and weather info for anywhere in the world , I can also see from my phone what sales are going on at the grocery store and the price of gasoline at every station wthin 5 miles , and when I get to one of those stations I can pay at the pump with my debit card … Think about trying to do. That back in the 70′ s ",
            "date": "Answered March 5, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexander Serdyukov",
                    "user_href": "/profile/Alexander-Serdyukov-1"
                }
            ]
        }
    ]
}