{
    "title": "When USA was creating the internet what were the Chinese doing? - Quora",
    "tags": [
        "Chinese Ethnicity and People",
        "The Internet",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Lat",
                "href": "/profile/Dave-Lat-1"
            },
            "answer_text": "In terms of a national achievement, the Internet was created by DARPA, an agency of the US Defense Department. The Concorde and Bullet trains were also projects of national significance for the British, French and Japanese. The main achievement of the Chinese at this time was their support for the Viet-Cong in the Kháng chiến chống Mỹ which means the “Resistance War Against America”. At the time, the United States was directly engaged in a controversial war to prop up the corrupt and unpopular South Vietnamese regime. It is not clear how much military, material and humanitarian support was provided by China, but it is unquestioned that China’s contribution was vast and essential. 1968 was the turning point in this unjust war, where the American military suffered a devastating defeat under the Tet Offensive. Vietnam continued to suffer as the US attempted to save face, by taking years to retreat from Vietnam and causing millions more to suffer through carpet bombing and chemical warfare. Unlike the US, China did not engage in such gross violations of the rule of war. In terms of world history, the most important event of 1969 was unquestionably the American military defeat. The defeat demonstrated that if the cause is just, human determination can overcome extreme levels of technical advantage. We should spare a moment of sympathy for the over 1000 Chinese families (estimated), who lost a son or daughter to this senseless war. ",
            "date": "Answered July 1, 2017",
            "views": "978",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Haoming Xia",
                    "user_href": "/profile/Haoming-Xia"
                },
                {
                    "user_id": "Wing Wong",
                    "user_href": "/profile/Wing-Wong-32"
                },
                {
                    "user_id": "Vincent Lim",
                    "user_href": "/profile/Vincent-Lim-56"
                },
                {
                    "user_id": "Ahmad Zulizham Mohd Sham",
                    "user_href": "/profile/Ahmad-Zulizham-Mohd-Sham"
                },
                {
                    "user_id": "Annie Young",
                    "user_href": "/profile/Annie-Young-17"
                },
                {
                    "user_id": "Jace Wu",
                    "user_href": "/profile/Jace-Wu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Parry Sun",
                "href": "/profile/Parry-Sun"
            },
            "answer_text": "1970s China saw the last of a series of severe human disaster and the beginning of a rational government with focused growth strategies. Early 70s was a dark time. Chaos, persecutions, famine. Marked by death of Mao things changed rapidly and positively. Despite some highly controversial acts such as the mandatory “birth planning” policy known as “one child policy” in the west, most of the strategies and guild lines formed by the end of 70s evolved into fundamental state policies that are still in place to shape and guild China today. 1980s China was “crossing the river by feeling the stones”, economically and inevitably, politically. The initial economic growth was encouraging. However in an environment controlled by a highly authoritarian government with minimum transparency, “free market” in China turned into a breeding ground of crony capitalism: administrative power was for sale to friends, family and high bidders. Mild social economic gaps due to widespread poverty rapidly turned into extreme disparity and mad inflation. The brewing outrage of Chinese citizens finally manifested into an outcry of “End Corruption; End Bureaucratic Profiteering” in 1989.  Regarding 1989, the handling of the affair remains in the black box and frankly is probably going down the history as a very dark page in the history of the current Chinese government. However the protest was not about “democracy” until a few young and egotistic people in the center of the storm was interviewed and interpreted by western media. What the initial protesters asked for were extremely specific: an efficient, transparent government to enforce law and provide a well-regulated free market;proper channels for constructive criticism; andan end to systemic corruption.None of which could be delivered over night, or in weeks even months, no matter how sophisticated the protesters are or how sympathetic (some people in) the central government was. After a fateful series of events, the country moved on. 1990s was when citizens of China as well as the rest of the world were introduced to personal computers. Politically, after a short debate in early 1990s within the central government regarding whether China should continue on the path of its pursuit of economic prosperity despite the risk of loosing control (USSR), Chinese government decided a “prosper, democratic, culturally advanced and modernized socialist state” is what it is going to be. In essence during 90s, the Chinese government began working toward what it refused to promise to the first of student protesters on Tian An Men square: a sound legal system, a transparent government, a systematic war on corruption, a regulated free market, which all translates into a shot to a better life for hard working people from all tiers of society. With internet in its infantry, China or elsewhere, 90s was the golden age for TV and paper media in China. Apart from the mouthpieces directly run by the government, a few liberal media and programs began moderate and focused political discussions. “Focus report” (焦点访谈) a TV program, “Southern Metropolis Daily” (南方都市报) a newspaper, and many of their kinds began in mid 90s, which signified an end to a thousands-year-long tradition of attempting political and social modifications by starting an “uprise” or “revolution”. Word on the internet, roughly 40% of Chinese urban families had computers by the year 2000. Considering China being largely undeveloped in rural areas, it means very few families had computers and even less of them are connected to Internet. However by 90s, available technology in China had began catching up with the rest of the world, or specifically, the highly industrialized counties in the world. By late 90s, both technology and the market place in China were mature enough to see the birth of what is known as BAT: “copy to China” at the time yet world class internet tycoon today. I will revisit this issue later. (“B” stands for “Baidu”, founded in January 2000; “A” is “Alibaba” founded in 1999; “T” is “Tencent” founded in 1998.) From 2000 to 2009 China had almost fully synchronized with the industrialized nations regarding information technology. Chinese people embraced the internet and discovered they can easily have what had always been denied by the authorities: a channel to communicate, group, express, and eventually, influence. “Deng Yujiao incident” in 2009 was probably the first time Chinese netizens knowingly applied power of opinion, in this case, to help a young women in disadvantaged situation by preventing the legal system from siding with the powerful. (Working a shady job in a shady hotel, she refused to provide sexual service to a group of highly ranked local government employees. When their advances became violent, she fought back with a peeling knife left on a nearby table. One of her attackers later bled to death from piercing wounds in the neck and another wounded. She was originally facing severe manslaughter charges until netizens and civil rights lawyers intervened. She was convicted of unjustifiable self defense and received probation.) Fast forward to 2016 when I left China, it was a dynamic market place run by an industrial and transparent government like never before. It was partly because the government has been wanting to do a good job, partly because there is very few dark hiding places in the age of smart phones and social media for corruption and omission. Being caught on camera picking up a kid from school with the government vehicle have gotten people fired. To address a few specifics raised by question detail. China is the largest manufacturer of the high speed trains today. China at the year 2015 has 60% of the world’s high speed railways covering 29 of 36 provinces. Considering construction of China high speed railway started in early 2000, despite prices being paid in sense of money expenses and human casualty, the pace of its development in my option can be discribed as shocking. I know little about airplanes. Google and Wikipedia should be able to do a better job. Thanks for the invite. This is a very long answer and I hope someone has the patient to read this much in the year of 2017. ",
            "date": "Answered July 1, 2017",
            "views": "46",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Haoming Xia",
                    "user_href": "/profile/Haoming-Xia"
                },
                {
                    "user_id": "Alex Szeto",
                    "user_href": "/profile/Alex-Szeto-2"
                },
                {
                    "user_id": "Lewis",
                    "user_href": "/profile/Lewis-52"
                },
                {
                    "user_id": "Don Bennett",
                    "user_href": "/profile/Don-Bennett-3"
                },
                {
                    "user_id": "Kiswa",
                    "user_href": "/profile/Kiswa-1"
                },
                {
                    "user_id": "Le Qibin",
                    "user_href": "/profile/Le-Qibin"
                },
                {
                    "user_id": "Samuel Liu",
                    "user_href": "/profile/Samuel-Liu-7"
                },
                {
                    "user_id": "Kris Lim",
                    "user_href": "/profile/Kris-Lim-4"
                },
                {
                    "user_id": "Liu Sichen",
                    "user_href": "/profile/Liu-Sichen-3"
                },
                {
                    "user_id": "Shan'an Ruan (阮繕安)",
                    "user_href": "/profile/Shanan-Ruan-阮繕安"
                }
            ]
        }
    ]
}