{
    "title": "When 5G is available, who needs the internet? - Quora",
    "tags": [
        "5G (wireless communication)",
        "Wireless Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "James DeOliveira",
                "href": "/profile/James-DeOliveira-2"
            },
            "answer_text": "It seems to me that what you are asking is why someone would need an Internet connection at home or the office when a 5G connection may be sufficient. For many people, a 5G connection may make the need for a home Internet connection no longer a necessity. To be clear, the Internet and your connection to it are two separate things. 5G refers to the fifth generation of cellular service. There are a series of different service levels which may be referred to as 5G so not all 5G is the same. The Internet is a collection of servers (computers that “serve” by delivering information) that are connected together using a series of protocols (TCP/IP, HTTP, FTP. etc.). Having a 5G connection is useful so that someone can call and send other messages to other people but it does not make the Internet any less valuable. Actually, the Internet becomes more and more useful as more machines are able to connect to it. One reason why you may need an Internet connection for the foreseeable future is that 5G will be available at different levels of service and in different areas over time. Even if you have a 5G phone, the network that allows you to connect by way of 5G may not be available where you are. Much of what 5G will become requires communications infrastructure to be installed, tested and made available. This is both difficult to do and expensive. One of the main purposes for 5G is not for person to person communication but for machine to machine communication. 5G will make the so-called Internet of Things (IoT) a possibility. ",
            "date": "Answered September 20, 2020",
            "views": "133",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Nixon",
                    "user_href": "/profile/Mike-Nixon-19"
                },
                {
                    "user_id": "Isaiah Omobogie",
                    "user_href": "/profile/Isaiah-Omobogie-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Johnson",
                "href": "/profile/Jeremy-Johnson-318"
            },
            "answer_text": "So first and foremost 5g is not the same thing as the internet, nor does WiFi = the internet. WiFi and 5G = a means to connect a device wirelessly to a network to send data. This is essentially a substitution for an ethernet cable. Internet = a connection between your network (or your cariers) to all the other networks … like Google's network with all their web servers, or amazons network, or Netflix's movie servers on their network, etc. The internet to data is like how every road and freeway connects your home to every business and home on your continent. Hence the expression “the internet super-highway” 5G would be useless without the internet, you would be connected to the cell tower, and the cell tower would be connected to basically nothing. It would be as useful as a paved driveway that leads to empty dessert or a grass field. WiFi without internet could only connect to the rest of your devices on that same WiFi network. 5G (only in large cities) could be a replacement for your home ISP, however you would still need WiFi (unless you want to pay verizon for a 5g data plan for EVERY individual computer, smart tv, and other gadget in your home, With that said, 5G has a VERY sharp drop in real world performance (vs cable or fiber which is 80-110%). It will also ALWAYS be inferior to wired connectiobs in ping/latency. So for my home at leash, I will still stuck to my cable connection for a real world superior internet connection. For rural, 5G is a pipe dream that is never going to happen. If the carriers cant get 4G with a range of a few miles deployed there, 5G with a range of a few hundred feet is out of the question So in short, 5G is an upgrade (with large limitations in range) over 4G for your mobile, but it is never going to put the ISPs out of business. ",
            "date": "Answered September 20, 2020",
            "views": "133",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Janis Baumanis",
                    "user_href": "/profile/Janis-Baumanis"
                }
            ]
        }
    ]
}