{
    "title": "When will Tesla launch their self-driving cars? - Quora",
    "tags": [
        "Self-Driving Cars",
        "Waymo Self-Driving Cars",
        "Autonomous Driving",
        "Tesla (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donald Champ",
                "href": "/profile/Donald-Champ-4"
            },
            "answer_text": "Today Tesla does have self-drivng cars. They are human assisted and have many flaws. When will Tesla’s be about to self drive without human intervention? I think it could happen but it will be a gradual thing that comes after many iterations. Assuming improvements in each iteration the capabilities will eventually be better (in a safer way) than human drivers. These iterations will be software but the hardware may need to change as well as the issues are better known. The speed this happens is dependent on how well they can adapt their learning algorithms to process real world scenarios. A rewrite of the Tesla driving software is happening that should be released by the end of this year. We may see a jump in capabilities when this comes out. Someday, some region or area is going let Tesla (or some other implementer) drive it’s autonomous cars drive on public roads without driver assistance. When this will happen we don’t know. It could be in a couple years or 10 years from now or more. If this ever does happen and the incidents show a decline it will make sense for the rest of the world to adopt. ",
            "date": "Answered August 16, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shresth Sonkar",
                "href": "/profile/Shresth-Sonkar"
            },
            "answer_text": "They have already done so, although a more accurate way of saying self driving will be by specifying the exact level of autonomy the car has  Teslas are to a high degree level 3, and on highways, level 4 autonomous. It’s called AutoPilot. Secondly; if by, launch you mean in India, it’s not possible because autonomous cars are so far not allowed to ply on Indian roads. That’s a law. Though shalt not let your car drive you; Only thou drivest the car.[1] Tesla can however sell their cars without autopilot in India, like they do elsewhere. It’s an option which can be purchased. (All cars already have the hardware to drive, the only thing you unlock by payment is the software that runs it)That being said, the government may amend the laws later but when, that cannot be predicted. Ask an astrologer for that. Also, the lack of proper speed signs, traffic lights, zebra crossings, lane markings etc can be troublesome for the AI to drive. It essentially detects the lane markings and speed limits to drive. In absence of that, I don’t think autopilot can work correctly, or in all cases. Footnotes[1] Opinion: The Future of Autonomous Vehicles in India - Steering the Legal Issues - ET Auto",
            "date": "Answered August 16, 2020",
            "views": "51",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Donald Champ",
                    "user_href": "/profile/Donald-Champ-4"
                }
            ]
        }
    ]
}