{
    "title": "Where did the idea for a DVD come from? - Quora",
    "tags": [
        "DVD Players",
        "DVD",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Asela Giganage",
                "href": "/profile/Asela-Giganage"
            },
            "answer_text": "There have been a number of codecs developed for recording video on optical discs sooner than the DVD. Optical recording know-how was invented by David Paul Gregg and James Russell in 1963 and initially patented in 1968. A person optical disc records layout often Laserdisc was developed with the United States, and initially got here to market in Atlanta, Georgia in Dec 1978. It used a lot bigger discs than the later formats. resulting from the tall rate of gamers and discs, person adoption of Laserdisc was very low in each North the USA and Europe, and was not broadly used any place out of doors Nihon and the extra prosperity areas of Southeast Asia, akin to Hong Kong, Singapore, Malaysia and Taiwan. Released in 1987, CD Video used analog video encoding on optical discs matching the established same old 120 mm (4.7 in) measurement of audio CDs. Video CD (VCD) turned some of the initially codecs for distributing digitally encoded movies on this format, in 1993.[13] In the identical year, two new optical disc storage codecs had been being developed. One was the Multimedia bunched Disc (MMCD), backed by Philips and Sony (developers of the CD and CD-i), and the opposite was the large Density (SD) disc, supported by Toshiba, Time Warner, Matsushita Electric, Hitachi, Mitsubishi Electric, Pioneer, Thomson, and JVC. by the point of the click launches for each codec in Jan 1995, the MMCD nomenclature had been dropped, and Philips and Sony have been relating to their layout as Digital Video Disc (DVD).[14][15] The tremendous Density emblem would later be reused in steady Digital. Representatives from the SD camp requested IBM for recommendation on the file scheme to make use of for his or her disc and sought to toughen for his or her layout for storing laptop data. Alan E. Bell, a researcher from IBM's Almaden examine Centre, got that request, and as well as discovering the MMCD pattern project. cautious of being caught in a repeat of the pricey videotape layout war between VHS and Betamax with the 1980s, he convened a bunch of pc trade experts with representatives from Apple, Microsoft, Sun Microsystems, Dell, and lots of others. This community was often called the Technical Working Group, or TWG. On August 14, 1995, an ad hoc community shaped from 5 pc firms (IBM, Apple, Compaq, Hewlett-Packard, and Microsoft) issued a statement pointing out that they'd most effectively settle for a single format.[16] The TWG voted to boycott each codec until the 2 camps agreed on a single, converged standard. They recruited Lou Gerstner, president of IBM, to strain the executives of the warring factions. in a single meaningful compromise, the MMCD and SD teams agreed to undertake initiative SD 9, which specified that each layer of the dual-layered disc be found out about from the identical side—instead of suggestion SD 10, which might hold created a two-sided disc that customers would revolve over.[17] As a result, the DVD specification equipped a storage capability of 4.7 GB for a single-layered, single-sided disc and 8.5 GB for a dual-layered, single-sided disc.[17] The DVD specification ended up akin to Toshiba and Matsushita's large Density Disc, excluding for the dual-layer choice (MMCD was single-sided and optionally dual-layer, whereas SD was two half-thickness, single-layer discs which have been pressed one by one after which glued collectively to appearance a double-sided disc[15]) and EFMPlus modulation designed by Kees Schouhamer Immink. Philips and Sony determined that it was of their absolute pursuits to finish the layout war, and agreed to consolidate with firms backing the large Density Disc to liberate a single format, with applied sciences from both. wards different compromises between MMCD and SD, the pc corporations via TWG won the day, and a single structure was agreed upon. The TWG as well as collaborated with the Optical Storage know-how organization (OSTA) on the usage of their implementation of the ISO-13346 file method (known as common Disk Format) to be used on the brand new DVDs. In September 1995, Samsung introduced it might begin mass-producing DVDs by September 1996.[18] The layout launched on Nov 1, 1996, in Japan, mainly handiest with tune video releases. the primary important releases from Warner dwelling Video arrived on Dec 20, 1996, with 4 titles being available.  ",
            "date": "Answered July 16, 2020",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anders Rehnberg",
                "href": "/profile/Anders-Rehnberg"
            },
            "answer_text": "The Video disk (Laser disk) was invented in 1970 and shot to fame in Japan as a Karaoke must-have. A decade later the CD Audio format was launched by Philips and Sony. Philips NV in Holland had around 400 people working in R&D for Optical Storage, I was a Product Manager for CD Rom and Erasable Optical Discs at Philips & DuPont Optical (PDO), and one of my tasks was to stop our scientists from talking about all the future technologies we had in the lab, including Erasable CD Rom, Erasable video disks, and the prototypes of DVD-like media. It would sow confusion when we tried to sell EXISTING products. By the time DVD was launched in the mid-90’s it was a collaboration with Philips, Sony, Toshiba and others. Seen from the inside, the technology for DVD was there in the early 1980’s but to build a marketplace and to avoid destroying other markets it was launched 15 years later. This is not unusual, most ‘new’ technology was invented 10, 15 or even 20 years before being released to consumers. Internet developed in 1962, CDs in 1960, mobile phones 1956, video phones 1960’s, (space) rockets 1920’s, RFID 1970’s, micro wave ovens 1950’s, etc. ",
            "date": "Answered July 16, 2020",
            "views": "61",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ger-Fakename"
                }
            ]
        }
    ]
}