{
    "title": "Where is art being pushed to its boundaries in 2020? - Quora",
    "tags": [
        "Boundaries",
        "Modern Art",
        "Artwork",
        "Creativity",
        "The Arts",
        "Fine Art"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "Art is facing some metaphysical questions having to do with the commitment to the design mentality, then the crème-d-la-crème of design, Virtual Reality, building up then not panning out. At this point most artists know they’re either superficial or not the top of the block at thinking like a genius. They may feel this emotionally even if they don’t know it intellectually. There are cutting edge artists—sort of—but this leads me to the metaphysical questions. Artists did not pursue metaphysics to it’s ultimate—this placed some limitations on art, and metaphysics was more the domain of Meta Theory, which itself partly did not pan out. Maybe there are secret artists that pursue metaphysics seriously, but this is seeming less and less likely. Rather, a proportion of art still remains trash or at least requires an excessive imbalance of taste towards particular fetishes like motorcycles or cats. There is an angle from which contemporary art is too much kitsch, even at most legitimate galleries. Although art was not being metaphysical, it was not being practical either. It is not an age of crafts-related revelations and it is not an age of a rising middle class of craftspeople. Yet, in an age of science, art WOULD benefit from a mixture of practicality and meta-significance, and it is getting to the point of needing something concrete to represent SIGNIFICANT PRACTICALITY. During the 1950’s the space race represented a kind of meta-significance, then in the 1960’s and 1970’s political struggle and drugs represented meta-significance. In the 1980’s meta-significance was literal, represented by books, and developing into early notions of virtual reality. But since the 1980’s the struggle for meta-significance has gone in the direction of the conclusion that art is superficial or an intellectual hyperbole, without the practical definition that would make the meta-significance seem real like science. The answer I am offering is the idea that both art and philosophy are becoming more literal and less abstract. Although they must be radical to push the boundary, they must now also meet up with requirements for tangibility which are an unrecognized need of the internet age. Let me describe how real working perpetual motion provides points to fulfill criteria for radical art in the contemporary era: Perpetual motion even in partial form fulfills a desire for practical fulfillment which is a halmark of the technology age. It is a real discovery.Perpetual motion is something that can be built with solid and modern materials like metal and plastic, making it seem more real in the eyes of technological citizens.Art now must meet a certain level of material worth, which may be represented by solid materials.Art goers desire someething luxurious but not without purpose. Art has become something which must be at least unconsciously a luxury, the more so if it has a technological purpose.Perpetual motion crosses the boundary between technology and art.Magically, perpetual motion does not require interaction, yet can be interactive if need be. It can be used to make environments more interactive.Perpetual motion has a kind of magical aura, yet it is not merely mysticism. It fulfills a kind of practical affirmation of miracles, which are a requirement for religion.Perpetual motion is practical, yet has an element of mystery. In the modern age, we might benefit by creating somthing which has more mystique.Perpetual motion is hands-on, and can be completed using an instruction book. It unifies all classes of people, and levels of intelligence.Perpetual motion is not just practical like a hammer, it is practical for creating energy, which is a resource which can almost provide for all human needs by itself.Meanwhile something which is important for all these things could be made into sometihng to muse and ponder on, as an art object.Perpetual motion is symbolic of the universe, survival, and immortality, things that humans desire and struggle for.Perpetual motion is a philosophical object, because of it’s sense of symbolic priority, and it’s legendary status as the ultimate aim of a foolish quest like climbing to the sun or transforming lead into gold.Perpetual motion is also practical, meaning it is one of the first examples of practical philosophy, which is rather profound to think about.This object, which has so much importance and legendariness, can be a PHYSICAL THING in someone’s room. This is something to get emotional about.There is something especially magical about possessing something with such legendary status, even if it turns out to work rather predictably. It is like a magic sword, or one of Marie Antoinette’s treasure eggs. It is profound.Now, if we compare this to the other things offered by the art world, we can see this is a transition towards more immortality. That itself may be one of the biggest art statements ever made.It is art which can almost exist in the abstract, yet upon which the physical world could be run mechanically.",
            "date": "Answered July 24, 2020",
            "views": "89",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gabe Mestas",
                    "user_href": "/profile/Gabe-Mestas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Segboer",
                "href": "/profile/Karen-Segboer-1"
            },
            "answer_text": "2020 will be a year very different from others in the very recent past. Maybe, to get a better idea of how this might play out, look to the years of the last flu epidemic over a hundred years ago - what was happening then? Or look farther back to the Middle Ages and the plague years. What were artists of all kinds doing then? I remember reading that Shakespeare quarantined himself outside of London during a plague outbreak in Britain and wrote some of his best work there. In other words, situations like we’re in now push the creative person to reach beyond what he/she thought could be possible. Maybe we’ll see that now, too. ",
            "date": "Answered July 24, 2020",
            "views": "63",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabe Mestas",
                    "user_href": "/profile/Gabe-Mestas"
                },
                {
                    "user_id": "E. Huett",
                    "user_href": "/profile/E-Huett"
                }
            ]
        }
    ]
}