{
    "title": "Where are fireworks designed and made? - Quora",
    "tags": [
        "Who Is Responsible for X?",
        "Who Designed X?",
        "Pyrotechnics",
        "Fireworks",
        "How Things Work",
        "Product Design of Physical Goods"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Hand",
                "href": "/profile/Peter-Hand-4"
            },
            "answer_text": "At the present time, the vast majority of the world's fireworks are made in China. This is relatively recent. Up until the middle of the 20th Century there were numerous firework manufacturers in the West. There were half a dozen in Britain, some (like Brock) established for centuries. Italian firms were well represented, there were many manufacturers in the United States, and the old family firm Hand's Fireworks (est. 1876) in Canada. Over the past few decades this entire industry has been practically wiped out by a combination of health and safety restrictions, encroaching housing development that forces the factories to move or close, and above all by competition from cheap Chinese goods, which can be imported for less than the cost of raw materials in the West. There are some survivors. Kimbolton Fireworks, A&M Pyro, Rugierri and a few others here and there still make their own stars and assemble their own devices. There's a strong firework industry in India, where (to judge from some photos I've seen) they are not troubled by health and safety concerns. In the US there are many amateur pyrotechnic guilds and associations, where some truly spectacular fireworks are designed and made that you will never see in commercial shows. This is what American amateurs can do -   In Japan, fireworks are a national preoccupation, mostly practiced by individual craftsmen. There are a lot of videos on You Tube showing some of the more exotic Japanese competition shells, like this one -   ",
            "date": "Answered January 3, 2015",
            "views": "375",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clark Witherspoon",
                "href": "/profile/Clark-Witherspoon"
            },
            "answer_text": "While most fireworks are made in factories in China, there are many people who make their own fireworks at home ! Believe it or not, by following simple step-by-step guides and carefully combining ingredients you can make some really cool effects. List of How To Guides - Learn how to make fireworks at home You'll want to check your local firework laws first though, and be careful! ",
            "date": "Answered March 13, 2015",
            "views": "156",
            "upvotes": "0"
        }
    ]
}