{
    "title": "Where can I find the latest tech news for my blog? - Quora",
    "tags": [
        "Tech Blogs and Websites",
        "Tech News and Journalism",
        "Latest Technology",
        "Blogs",
        "Blogging"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ajeet Kumar",
                "href": "/profile/Ajeet-Kumar-1131"
            },
            "answer_text": "Technological blogs are progressing because the digital industry boom is overwhelming. Unsurprisingly, just think of how customers are increasingly fascinated by new technologies, awesome applications, or the development of Web applications in general. These techies are looking for places with hot news from the world of technology every day. Latest tech news for blogging are: TechnewsWorldLatest tech newsTechmemeTechcrunchBBC News TechnologyTechnology News | The new York Times",
            "date": "Answered May 10, 2018",
            "views": "202",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jitesh Gupta",
                    "user_href": "/profile/Jitesh-Gupta-13"
                },
                {
                    "user_id": "Nagraj",
                    "user_href": "/profile/Nagraj-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshay Bhardwaj",
                "href": "/profile/Akshay-Bhardwaj-43"
            },
            "answer_text": "If you are starting a tech website or planning to start one, then finding news shouldn't be a big problem as there is abundance of news spread all over the internet. Technology is a trending topic and almost all major news/media websites cover latest tech news. Even in your Google feed there should be enough tech news to provide you content to write for your blog. But I'll also name some specific sources that I use as I also have a website KNine Vox which covers latest tech news. Techcrunch ( one of best ranked tech website) - TechCrunchAndroid authority (frequent tech news on every article) - Android AuthorityKNineVox (A growing website and writes only on valuable tech news) - KNine VoxTheVerge (tech news from cars to smartphones) - The VergeAndroid Police (Android related every news)",
            "date": "Answered June 20, 2018",
            "views": "162",
            "upvotes": "0"
        }
    ]
}