{
    "title": "Where can I learn Blockchain technology? - Quora",
    "tags": [
        "Blockchain (database)",
        "Bitcoin"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarang Sahani",
                "href": "/profile/Sarang-Sahani"
            },
            "answer_text": "There are several aspects to learn blockchain. Since it is still relatively new, there are lots of opportunities for all of us to explore and innovate. It is fast catching-up with industries and already there are many products and solutions available to fit into the ecosystem of Blockchain and there are scope for many more before it becomes another commodity. You will find a lots of courses and also free materials available online. I have listed few of them below. And the reason I have listed all the courses from Udemy is that, apart from being completely hands-on courses, they are also very cost effective and 30 days refund policy (if you can’t align with the course) makes them very attractive to go for before you make big investments into your learning. Investment is a subjective word here :). Getting straight to the business → Platform development (private/ public Blockchain platforms): For this you need to understand the fundamentals of Blockchain, complex/large system design principles, strong programming abilities. Among the many courses available in the E-Learning sites, I found Blockchain A-Z™: Learn How To Build Your First Blockchain from Udemy to be the most useful one for me. In this course, you will learn Blockchain, build a small representational Blockchain, build your own crypto-coin, learn truffle EVM and a bit of Solidity.Application development → Build applications over a Blockchain platform. You need solid understanding of application design principles and also programming abilities to excel in this area.Ethereum (used mostly for B2C use-cases): The most popular among the available public Blockchain platforms. And to learn this, I found Ethereum and Solidity: The Complete Developer's Guide from Udemy to be the most useful one for me. This course very comprehensively explains Blockchain, Ethereum, Smart contracts, Solidity, Web3 and application development using Node.js, ReactJs. It provides a crash course of ReactJs which is very useful. You will learn to develop a multi-page application on Ethereum in this course.Hyperledger Fabric (used mostly for B2B use-cases): The most popular and accepted DLT platform for industries. You will find courses on Linux Foundation and IBM sites. I found Blockchain Development on Hyperledger Fabric using Composer again from Udemy :) to be the most useful one. The trainer very patiently covers the concepts of DLT, Hyperledger, Fabric, Composer, setup of development environment and implementation through example application.Hope this information will help you and the followers of this thread a bit in their endeavor to learn Blockchain. Happy learning :) ",
            "date": "Answered September 25, 2018",
            "views": "23",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Margaret Addie Baughman",
                    "user_href": "/profile/Margaret-Addie-Baughman"
                },
                {
                    "user_id": "Rout Chaitanya",
                    "user_href": "/profile/Rout-Chaitanya"
                },
                {
                    "user_id": "Purnima Singh",
                    "user_href": "/profile/Purnima-Singh-26"
                },
                {
                    "user_id": "Shailesh Dayani",
                    "user_href": "/profile/Shailesh-Dayani-2"
                },
                {
                    "user_id": "Kratika Sharma",
                    "user_href": "/profile/Kratika-Sharma-13"
                },
                {
                    "user_id": "Rohit Gupta",
                    "user_href": "/profile/Rohit-Gupta-415"
                },
                {
                    "user_id": "Kavya Gudimetla",
                    "user_href": "/profile/Kavya-Gudimetla"
                },
                {
                    "user_id": "Saurabh Bakshi",
                    "user_href": "/profile/Saurabh-Bakshi"
                },
                {
                    "user_id": "Pawan Nath",
                    "user_href": "/profile/Pawan-Nath"
                },
                {
                    "user_id": "Anurag Ratna",
                    "user_href": "/profile/Anurag-Ratna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mayank Kumar",
                "href": "/profile/Mayank-Kumar-1090"
            },
            "answer_text": "Hello, It's good to see your interest in the field of blockchain technology. I am one of the co-founders of upGrad and will be glad to help you with the answer. At upGad we have d we have a PG certification course in blockchain technology which is for a period of six months. We expect that the learners of this program at least invest around ten to fourteen hours every week. You will earn how to create a blockchain from scratch, build smart contracts and chain codes along with being a blockchain developer in this program. One-third of the companies in the world have adopted blockchain and in the information technology sector, the importance of blockchain is growing fast and there is going to be an increase in the demand with time. It's great to see your interest in blockchain. A bachelor's degree in science or mathematics (B.E., B.Tech, BSC, BCA/MCA)is the minimum eligibility for this program. Some of the benefits of the program are - 360 Degree Career Support services, Personalised Mentorship from Industry Experts, Hands-on Projects & Hackathons, Peer Networking opportunities & a whole lot more to help you master Blockchain. Some of the important features of this program are - 200 plus hours of content, dedicated student mentor Support from industry mentors, passionate career coach, content access for 3 years, personalized resume building sessions, mock interviews, IIIT-B Alumni Status, Various projects/Case Studies and much more. If you are one of the following then the program is best suited for you - IT professionals, software developers, analysts, Technical Leads, and engineers. On successful completion of the program, the job opportunities will be available in the following roles - Solidity Developer, Hyperledger Developer. Node Js Blockchain Developer, Javascript Developer, etc. Our students work in multinational companies such as - IBM, Salesforce, TCS, Tech Mahindra, Honeywell to name a few. The skills that you will learn from the program are Ethereum, Hyperledger, smart contracts, Fabric, Composer, Advance JavaScript, NodeJS to name a few. Let's now directly look at a few of the reviews from our learners   For more details on the program along with its specialisations, you can visit our website - [1] Wishing you the best of luck :) Footnotes[1] Online Courses & Education Programs for Professionals | upGrad",
            "date": "Answered October 28, 2020",
            "views": "55",
            "upvotes": "0"
        }
    ]
}