{
    "title": "Where do I get professional VoIP phone systems? - Quora",
    "tags": [
        "Mobile VoIP",
        "VoIP Software and Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jahmal Abbott",
                "href": "/profile/Jahmal-Abbott"
            },
            "answer_text": "Business have several channels available to get a professional VoIP system. Here’s a small list of options to consider: Direct from a VoIP provider (including cloud and communication service providers)Through an original equipment manufacturerPartner / Reseller / Consultant The path chosen to get a VoIP system depends on your comfort and level of confidence. With so many choices available today, it can be pretty easy to get lost in jargon, what’s current or what’s in transition. Fortunately for consumers, the competition has forced the market to provide the absolute best solution for the price. Especially when dial tone from a VoIP system is a basic function. For anyone reading this answer today, I highly recommend that you work with someone that you can trust. You really don’t want to spend a lot of time figuring this out on your own. There are many variables at play when it comes to choosing a VoIP system. Consider if this is your first VoIP system, can your internal network keep up with this? Do you have the expertise in house to handle any changes or issues that come up? Or will you depend upon your IT tech or VoIP provider to iron out any issues? Once again, work with someone that you can trust! Don’t let a sales person talk you into buy a VoIP system without truly understanding if this will meet your needs today and in the future for your organization. What I’ve done is to compile some of the common questions that I’ve come across surrounding this topic and organized it into a simple guide (with pictures!) that provides answers. There’s no hooks, tricks, spam or sign ups. Just pure information to get you on the right path to solve this challenge: The Jahmal Abbott Show: Guide to Find The Phone System Hope this answer and this guide helps in getting you closer to a solution you can count on for many years to come. ",
            "date": "Answered July 18, 2020",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Subash",
                "href": "/profile/Subash-193"
            },
            "answer_text": " 9 Easy Steps for Selecting a VoIP phone Don't let buzz words and technology acronyms get in your way. Selecting phones for your VoIP calling needs can be fast and easy. All you have to do is follow these 9 straight forward steps. Step One - What phone system or VoIP service provider are you currently using? What good is an IP phone if it is not compatible with the phone system or service provider that you are using? With the advent of open source phone systems, SIP and BYOD service providers it's easy to think that every IP phone works with every phone system or service. Unfortunately this is not the case so make sure you know what protocols and codec's are supported by your VoIP phone system and VoIP provider. Step Two - Who will be using these IP Phones? Depending on the job function (or position) of the person using the IP Phone, there will be a different set of needs and each person will be looking for something different in the VoIP Phone. Use the suggestions above if you can't speak to each user personally. Step Three - What features and functionality does that person/position need? Most people want the standard features in a phone such as Call Waiting, Call Transfer, Call Parking, Conference, etc. What you need to look for are needs such as a speakerphone, a large display and sidecar capability for extra extensions. Use the suggestions above if you can't speak to each user personally. Step Four - How many incoming calls will the person/position receive at a time? This is an important question because it will determine how many line appearances IP phone should have. While the average office worker will probably be okay with 3 to 5 line appearances, operators, administrators and receptionists will typically need more than 10 line appearances. Step Five - How often will the IP phone be used? If a person is on the phone all day every day they probably deserve a higher quality phone. Even if they do not deserve to be using a higher quality phone, a high quality phone will last longer under frequent use than a lower quality phone. In many respects you get what you pay for, so make sure you buy the higher quality IP Phone for those that need it. Step Six - Do you need an IP phone with routing capabilities? There is many an office where there is only one Ethernet run per workstation. If this is the case both the desktop computer and the IP phone will need to share a single Ethernet connection. In this situation you will need an IP phone with dual RJ45 Ethernet ports. If your office already has a Voice LAN (separate voice network) set-up, then you should have an Ethernet drop run to the desktop just for the IP phone. This will allow you to use an IP phone that has a single RJ45 Ethernet port (and save on the cost of the IP phone). Step Seven - Will you be utilizing a Power over Ethernet with this deployment? If you are currently (or plan on) using Power over Ethernet you will need an IP phone that supports Power over Ethernet. If you are not using Power over Ethernet and simply using AC power make sure you have an extra outlet at each work station to power the IP Phone. Step Eight - What protocol and codec does your service provider/IP PBX support? Most of the IP phones on the market support SIP and all of the major voice codec's such as G.711, G.729, etc. Often times, however, your provider or phone system might only support a H.323, MGCP or SCCP compatible IP Phone or an IP Phone that supports the GSM codec. Don't get stuck with an IP Phone that is not compatible with your phone system and or your voice service. Step Nine - What's your budget? Believe it or not, IP phones can range from $40 to over $400 a piece. While price should never be the most important factor in selecting an IP Phone it is important that you have a budget set for your IP phones, since you don't want to overspend. A budget will also force you to take a hard look at what features and functions are most important to you. ",
            "date": "Answered September 3, 2020",
            "views": "7",
            "upvotes": "0"
        }
    ]
}