{
    "title": "Where can I get cheap Apple products online? - Quora",
    "tags": [
        "Apple (company)",
        "Online Shopping",
        "Apple Products and Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Birchall",
                "href": "/profile/Daniel-J-Birchall-1"
            },
            "answer_text": "Two places come to mind: Apple’s own store website has a “Refurbished and Clearance” section offering discounted prices on models that are being discontinued, or units that have been returned by their original purchasers and refurbished to “like new” condition by Apple. 1-year warranty is standard, you can buy AppleCare to extend that to three years.Other World Computing, in addition to selling all kinds of accessories and upgrades for Macs, also refurbishes and sells used Macs, often going back six years or more, with a 90-day warranty. If you’re on a seriously limited budget and don’t need the latest and greatest, you can probably find something on their site for half what you’d pay for a newer one on Apple’s site.As an example, right now: The basic 21.5-inch iMac since 2017 (HD, not 4K) with a 2.3GHz dual-core i5, 8GB RAM and 1TB fusion drive is $1,099 brand-new.In Apple’s refurbs section, the same configuration is $1,019.OWC has a 2015-revision 21.5-inch iMac 4K with a 3.1GHz quad-core i5, 16GB RAM and 1TB 5400rpm HDD for $929.OWC has a 2013-revision 21.5-inch iMac (HD, not 4K) with a 2.7GHz quad-core i5, 16GB RAM and 1TB 5400rpm HDD for $549.That’s a pretty broad price spread. And any of those models will run the current version of OS X, although I’m unsure how many future versions the 2013 will run. ",
            "date": "Answered July 10, 2019",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sydney Sopher",
                    "user_href": "/profile/Sydney-Sopher"
                },
                {
                    "user_id": "David B. Martin",
                    "user_href": "/profile/David-B-Martin-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yu-Lin Yang",
                "href": "/profile/Yu-Lin-Yang"
            },
            "answer_text": "This depends on what kind of Apple products you’re looking for. If you’re looking for new Apple products: Apple education discount if you have an .edu email.eBay often has dealers that sell brand new Apple products for cheaper than retail.Amazon sometimes has sales and offers on new products.If you’re looking for used or refurbished Apple products: Apple Refurbished Store is the most reliable since it comes straight from Apple and includes their warranty.eBay once again has many individual sellers that want to get rid of their old machines and will sell them for cheap.Craigslist (my favorite) is dependent on your location but often have people selling the cheapest Apple Products you can find anywhere.Whether you’re planning on getting new or used products, make sure the seller is reputable and that the product is legitimate and not stolen by checking its serial number on Apple’s coverage site. ",
            "date": "Answered January 2, 2017",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "YC Yang",
                    "user_href": "/profile/YC-Yang-7"
                },
                {
                    "user_id": "Lucas Fugmann",
                    "user_href": "/profile/Lucas-Fugmann"
                }
            ]
        }
    ]
}