{
    "title": "Where was the internet first used? - Quora",
    "tags": [
        "History of the Internet",
        "History of Technology",
        "World Wide Web",
        "The Internet",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roger Jones",
                "href": "/profile/Roger-Jones-142"
            },
            "answer_text": "1969 while I was at the U S Air Force Academy the military had developed ARPAnet,, but the first message was not sent successfully until after I graduated, sometime that fall while I was in Pilot Training, I heard about it. The WWW didn’t come about for 12 years. The two (ARPAnet & WWW) protocols was a slave to wiring in its WAN setup at that time and to telephone receivers being placed in cradles (the same as for early faxes (QWIP). The two leading protocols were ftp & later http. The other alternative was BBS (Bulletin Boards that could be logged on to by telephone. (They were housed by few entrepreneurs who already found out the value of porn.) The final ingredient to mix all of these together was the modem originally running 14.5 (increasing over a few years to 56 kps) and dial-up services. I ran a dozen websites with dual-dial-up in the 1990’s. [It took between 2 hours and 2 days to download a song.] We moved from an assortment of wires, cables and glass to wireless. {PoorPeopleInternet} Now we have the WWW which makes up 30+ % of the data, Onion Services at about 65% and several other at 2,2, & 1 percent. You can get a Brief History at Wikipedia. ",
            "date": "Answered January 5, 2020",
            "views": "90",
            "upvotes": " Answer requested by Marcus Reeves",
            "upvoters": [
                {
                    "user_id": "Dan Greenberg",
                    "user_href": "/profile/Dan-Greenberg-2"
                },
                {
                    "user_id": "Tony Li",
                    "user_href": "/profile/Tony-Li-19"
                },
                {
                    "user_id": "Roni Patterson",
                    "user_href": "/profile/Roni-Patterson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Wessel",
                "href": "/profile/Robert-Wessel"
            },
            "answer_text": "In December of 1969, there were four nodes online to ARPAnet, which eventually became the internet as we know it. As you can see three of the IMPs (“interface message processors” - the “routers” of the day) and attached hosts were in California (UC Los Angeles and Santa Barbera, Stanford Research Institute), and one at the University of Utah. The first pair of IMPs (UCLA and SRI) first exchanged messages in October of 1969. So sometime in the last quarter of 1969.  ",
            "date": "Answered January 5, 2020",
            "views": "196",
            "upvotes": " View 3 Upvoters"
        }
    ]
}