{
    "title": "Where is the battery in the ring of a doorbell? - Quora",
    "tags": [
        "Doorbells"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Oo",
                "href": "/profile/Paul-Oo-2"
            },
            "answer_text": "The older ones that I have seen in North America all had a 28VAC transformer. The door bell itself had two solenoids. The front door rang when it pulled in and released hitting a resonant metal bar. The back door solenoid rang only when it pulled in and had a pad on the other end when it released. This way the back door had a very different sound and you knew right away which door was being run. In the last twenty years there have been all sorts of new electronic doorbells which probably still work off a 24 or 28VAC transformer secondary but I can't say for certain. Now a lot of new models are wireless that probably operate off batteries. Doorbells traditionally had a 28VAC transformer while furnaces used 24VAC. Now I assume most will run off either transformer so you don't need a separate transformer. And yes these transformers were often hidden in an attic, crawl space or furnace room and were often hard to find. One trick I used to find them was to shut off the breaker that fed them to know what other things were turned off such as a front or rear door porch light and then look on the back of those junction boxes. ",
            "date": "Answered October 1, 2019",
            "views": "184",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Jeanes",
                "href": "/profile/Robert-Jeanes-1"
            },
            "answer_text": "It used to be that there was a low voltage transformer in the attic powered by the main current. It depends upon the age of the house/equipment. Of late, anyone’s guess, each manufacturer has its own unique structure. ",
            "date": "Answered September 30, 2019",
            "views": "45",
            "upvotes": "0"
        }
    ]
}