{
    "title": "Which one is better between Android tablet vs iPad? - Quora",
    "tags": [
        "Android Tablets",
        "Tablet Devices",
        "iPad"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Scinto",
                "href": "/profile/Adam-Scinto"
            },
            "answer_text": "I'm an iPad user and I jumped into Android in 2012 with the first Nvidia nexus 7, then again with the Asus nexus 7 2013 which is still my favorite android tablet. I too love the access to the file system and the ability to run different builds of Android on it ( that's a big reason I still use it ). But the problems I've found are: Officially, it was unsupported after two years- 6.0.1 is the last version released for it. Even Apple still releases security updates for older ipads. Android has much, much less available for tablets than the iPad. I don't understand why, but there seems to be a hundred times more useful software for phones than tablets in the play store. Of course you can still use the apps, but the experience suffers for it, trying to display apps meant for a small screen on the larger tablet display. But it really comes down to price and taste - until the current $329 iPad it was hard to recommend the iPad because it was around $500/starting price vs $300 Android tablets. But now at the new starting price you’re getting a super fast & super well made tablet that's got everything going for it - Apps, Support, Quality- and IMHO is going to give you a better experience than Android. There's a reason Apple has such a good reputation. EDIT: I’m adding I bought the 6th gen iPad myself this last summer. It's been fantastic and the Augmented Reality is a heck of a lot more fun on the big screen. I'm coming from a mini 2, so it's super fast at doing everything to me. I got a nice logitech bluetooth keyboard/case on a deal at micro center called the Folio if I remember right. It’s not written on the case at all, which is nice I guess - And the case material feels great too when carrying it around. This Logitech keyboard case works just as well as Apple’s keyboard case in my opinion - the bluetooth connection's instantaneous when opened & you place the iPad on the keyboard slot, and it’s been powered for over six months on a coin battery & still going strong. Plus of course it’s a nice typing keyboard with good key feel. ",
            "date": "Updated November 29, 2019",
            "views": "155",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Subin John",
                    "user_href": "/profile/Subin-John"
                },
                {
                    "user_id": "Xavier Smith",
                    "user_href": "/profile/Xavier-Smith-135"
                },
                {
                    "user_id": "Dawn Garrett",
                    "user_href": "/profile/Dawn-Garrett-46"
                },
                {
                    "user_id": "Stewart Chung",
                    "user_href": "/profile/Stewart-Chung-3"
                },
                {
                    "user_id": "Mirudhu Roshini",
                    "user_href": "/profile/Mirudhu-Roshini"
                },
                {
                    "user_id": "Aditya Arya",
                    "user_href": "/profile/Aditya-Arya-66"
                },
                {
                    "user_id": "Sharu",
                    "user_href": "/profile/Sharu-36"
                },
                {
                    "user_id": "Alakananda Choudhury",
                    "user_href": "/profile/Alakananda-Choudhury-2"
                },
                {
                    "user_id": "Khant Lin Htay",
                    "user_href": "/profile/Khant-Lin-Htay"
                },
                {
                    "user_id": "Madel Lim",
                    "user_href": "/profile/Madel-Lim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Sivan",
                "href": "/profile/Justin-Sivan"
            },
            "answer_text": "Dear, I can tell you the difference between android and ios. Here is a buying guide Source: How Do I Choose the Right Tablet ? Neither an oversized smartphone nor a shrunken laptop, a tablet is a new class on its own. Owing to its extreme portability, easy to use interfaces and many other functions, the tablet has become increasingly popular. In many ways, the best tablets can almost replace a laptop for someone on the go. Also, it is a better choice over a cellphone, for it's all so much better on a bigger screen. No matter where you go, you'll never have an excuse for boredom with a tablet.  Shortly after Apple's release of the iPad, which has changed the way people view computing. Google honed its Android platform for use on tablets, and many manufacturers have since released capable Android tablets. However, Microsoft has entered the tablet field as well, and although its entry was late. There are also a few others that run heavily modified versions of Android. Here's a brief look at the difference between the platforms. iOS Apple's biggest strength lies in its ecosystem. The past years has seen this company dedicated itself to building the App and iTunes Stores, as well as its cloud storage service, allowing users to seamlessly back up their devices to Apple's data centers. Just by logging in with an Apple ID, users can seamlessly sync their data among all their devices. Therefore, if you own other Apple devices, or enjoy services like iTunes, the iPad may be a good option for you. If you don't, well, it may still be the best option for you. The user interface is accessible and very slick, but it doesn't allow for much in the way of customization.  Still, many hold the opinion that they tried using the iPad for a bit but couldn't see its value as a productivity tool. I have to admit it was a bit of an effort getting used to the iPad and finding the right apps for productivity, but the apps are definitely there and many are quite powerful. In a word, it is still the tablet to beat in light of quality and it has the most impressive selection of apps and accessories. Apple ipad (2018) The new iPad 2018 packs the powerful A10 Fusion processor and supports the Apple Pencil. Most importantly, it is the cheapest tablet in Apple's range. \"The entry-level iPad doesn't add much, but it makes an already excellent tablet a better buy than ever.\" (quoted from CNET)  Android OS I wouldn't say Android is \"inferior\" but it is certainly not as polished. I like the Android when it makes you truly multitask and I prefer just about everything else in iOS. I wouldn't say one is truly better than the other, it's a matter of personal preference. Yet in my mind, iOS is for sure more polished, less cluttered and far more stable.  On the one hand, the openness of Android is one of the key reasons Google was able to scale the platform to mass market share quickly. On the other hand, it also laid the foundation for fragmentation: the overwhelming diversity of Android devices and OS versions can often cause problems regarding interoperability within the Android ecosystem. Besides, Android Tablet version is just a blown-up smartphone app, third-party builds of Android are limited as well, which cannot offer optimal experience to users. Moreover, the tablet's market is endangered by its older, smaller cousin, such as Xiaomi Max series, as they have quietly started doing all of the tablet's jobs—and in some cases, the smartphone has better performance. All in all, with so-so performance with ecosystem and hardware, my Android-based tablets are only left for watching audio. Yet there are still some worthy tablets in terms of specifications and pricing: Xiaomi Mi Pad 4 Plus Good news for users who prefer a larger screen and a longer battery life that can provide a more enjoyable experience! Xiaomi has just launched its Mi Pad 4 Plus tablet which sports a 10.1-inch FHD IPS display, Snapdragon 660 processor, 4GB RAM, up to 128GB of built-in storage and LTE connectivity as standard.  Mi Pad 4 Plus is the company's first 10-inch tablet and the 10.1-inch LCD screen has 16:10 aspect ratio and 224 PPI. As far as I'm concerned, the Xiaomi Mi Pad series of affordable tablets has always provided great value in terms of specifications and pricing.  Teclast M20 Teclast is a Chinese brand mainly known for manufacturing affordable Android and Windows tablets and this Teclast M20 tablet first-ever 4G tablet from the company.  The Teclast M20 tablet comes witg a 10.1-inch IPS, OGS screen display with a resolution of 2560 pixels by 1600 pixels with 298.9 pixels per inch, also the minimum standard resolution for every tablet out there in order to eliminate the horrible HD resolution many models feature. Besides, hardware is now powerful enough to handle that kind of resolution: it has the deca-core 2.3GHz MediaTek Helio X20 processor coupled with Mali-T880 MP4 GPU and 4GB of RAM. There is 64GB onboard storage with support for microSD cards in case if you want more space. The 4G network is also supported on both SIMs and the M20 can also be used as a phone in emergency situations as it allows phone calls too. Windows OS There are a number of solid reasons to explain why Windows has enjoyed a long reign as king of the workplace and Windows tablets can be thought of as a Windows Laptop turned into a tablet. As such, all the things that makes windows so popular are already there and these reasons contribute to making Windows tablets the choice to take to work. As a touchscreen tablet experience, Windows is still weaker than Android or iOS. Part of the problem is that it still feels like a hybrid between the old, familiar PC platform and the new tablet one. The app choice is also comparatively limited, pricey, and not as high quality.  By now, the Windows tablet market is pretty crowded: Microsoft Surface Pro+Surface Go Microsoft's Surface lineup of touchscreen computers was introduced in 2012.Currently, the company has four diverse product lines that aim to address different user needs: hybrid tablets, 2–in–1s, all–in–one convertible desktops, and more traditional clamshell laptops. The Surface Pro has improved performance over its predecessor, the Surface Pro 4. It comes with better thermal design, longer battery life, and also an enhanced and more expensive typing pen. All in all, it's a fine detachable tablet but clearly not a good performance/value ratio, as newer convertible 2-in-1s are leaving it behind. Microsoft followed up on the Surface Pro with the smaller and less expensive Surface Go that's aimed squarely at Apple's iPad tablet.  VOYO VBook i7 Plus VOYO is a very popular Chinese electronics manufacturer and their launch of VOYO VBook I7 Plus 2-in-1 Tablet PC features some very powerful hardware along with original Windows 10 Home inbuilt. The Core i7 CPU, 8GB of RAM, and Intel HD 620 Graphics are really more than enough to take the device through all the daily tasks that anyone would normally do. Besides, being a 2-in-1 device running on the latest Windows operating system, you can enjoy all the Windows features that are customized for both laptops and tablets in this single device.  Huawei MateBook E Huawei jumps into the Windows 10 pool with MateBook E, a 12-inch Windows tablet with a keyboard cover and the MatePen – an active stylus. With its full aluminum body which is just 6.9 millimeters thin, the 2-in-1 solution feels very elegant and is just nice to look at. I've been very impressed that its IPS screen packs with a resolution of 2160 x 1440 pixels. This is a large and beautiful display if you plan to watch video on it, offering up 216 pixels-per-inch. The foldable keyboard is reminiscent of the Microsoft Surface Pro 4. In my mind, it is so much more superior than the Surface Pro.  Summary: There are a ton of differently sized tablets on the market with a varying set of capabilities. Just figure out what matters most to you and determine what model you buy. I'm confident that after reading this article, you will know how to make the decision.  Hope this helps! See more product reviews at Value Q. ",
            "date": "Answered August 26, 2018",
            "views": "189",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vanshika Srivastava",
                    "user_href": "/profile/Vanshika-Srivastava-34"
                },
                {
                    "user_id": "Nidakhanum Lodi",
                    "user_href": "/profile/Nidakhanum-Lodi-2"
                },
                {
                    "user_id": "Chandan Patil",
                    "user_href": "/profile/Chandan-Patil-5"
                },
                {
                    "user_id": "Ruban Goyal",
                    "user_href": "/profile/Ruban-Goyal"
                },
                {
                    "user_id": "Manjunath Bidarolli",
                    "user_href": "/profile/Manjunath-Bidarolli"
                },
                {
                    "user_id": "Doyel Hansda",
                    "user_href": "/profile/Doyel-Hansda"
                },
                {
                    "user_id": "Charanjeet Kaur Sethi",
                    "user_href": "/profile/Charanjeet-Kaur-Sethi"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Buhbyeangel"
                },
                {
                    "user_id": "Shinto Thomas",
                    "user_href": "/profile/Shinto-Thomas-20"
                },
                {
                    "user_id": "Atul Jayakrishnan",
                    "user_href": "/profile/Atul-Jayakrishnan"
                }
            ]
        }
    ]
}