{
    "title": "Which technology is used as a demarcation point for fiber optics? - Quora",
    "tags": [
        "Fiber Networks",
        "Optical Fiber",
        "Optics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jee Mon",
                "href": "/profile/Jee-Mon"
            },
            "answer_text": "In telephony, the demarcation point is the point at which the public switched telephone network ends and connects with the customer's on-premises wiring. It is the dividing line that determines who is responsible for the installation and maintenance of wiring and equipment—customer/subscriber, or telephone company/provider. The demarcation point varies between countries and has changed over time. The demarcation point is sometimes abbreviated as demarc, DMARC, or similar. The term MPOE (minimum or main point of entry) is synonymous, with the added implication that it occurs as soon as possible upon entering the customer premises. A network interface device often serves as the demarcation point. Prior to Federal Communications Commission (FCC) regulations separating the ownership of customer premises telecommunication equipment from the telephone network, there was no need for a public standard governing the interconnection of customer premises equipment (CPE) to the United States' telephone network, since both the devices and the “local loop” wiring to the central office were owned and maintained by the local telephone company. Concurrent with the transfer of existing \"embedded\" CPE to the customer (customers could buy new telephones at retail or could continue to lease their existing equipment from the company), it was necessary to provide a standardized way to connect equipment, and also provide a way to test the phone company’s service separately from the customer’s equipment. The ability of customers to buy and maintain their CPE and attach it to the network was stimulated by lawsuits by equipment manufacturers, such as the Hush-a-Phone v. FCC suit. Additionally, computer companies’ ability to offer enhanced services to customers was likewise constrained by the telephone companies’ control of all devices connected to the network. As the Bell telephone companies were themselves restricted from offering such enhanced services, there was little momentum to advance the state of the art. The newly developed equipment-network separation was codified in Part 68 of the Code of Federal Regulations in the United States and later in comparable regulatory standards in other countries. The physical and electrical interconnection is called the demarcation point, or Demarc, which includes one or more customer-accessible jack interfaces; previously, the interface was typically hard-wired and often in a telephone company-owned locked enclosure. The premises-vs.-network separation in the United States, insofar as it affected the former Bell System, was independent of AT&T’s divestiture of the local telephone companies on January 1, 1984. However, CPE interconnection and Bell System divestiture were part of a larger restructuring of the domestic telecommunications industry that took place during the 1980s and is common, if inaccurately, seen as one event. The historical Bell System domination of the United States telecommunications industry was also the de facto standard for other telephone companies such as GTE and other “independent” telephone companies. ",
            "date": "Answered September 23, 2020",
            "views": "395",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marie Jufriyanto",
                "href": "/profile/Marie-Jufriyanto"
            },
            "answer_text": "Instead of using a modem a fiber network will have at the demarcation point a device called an optical network terminator (ONT). This device converts data from the fiber network protocols to those that are used by standard twisted pair copper networks. ",
            "date": "Answered September 18, 2020",
            "views": "11",
            "upvotes": "0"
        }
    ]
}