{
    "title": "Which type of broadband connection do I use if I have a Cat5 cable coming to my house? Is it DSL, cable, or any other? - Quora",
    "tags": [
        "DSL",
        "Broadband",
        "Internet Service Providers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott King Walker",
                "href": "/profile/Scott-King-Walker"
            },
            "answer_text": "CAT5 is an out of date spec for Ethernet, but it makes really good phone wire. In new homes here, it is common to run CAT6 everywhere, and you can patch it to either the phone panel or the Ethernet switch, to select which jacks have what. So, it could be DSL, since DSL runs over phone lines, and DSL/phone could be running over CAT5 cable. It could also be something completely different. In my area, it is common to run CAT5E/CAT6 out to a box that has a modem/transmitter/antenna for either the local Fixed Wireless Provider or for LTE internet. So, the answer could be “Fixed Wireless”, or “Cellular LTE”. If you had Starlink (currently in Beta) you would know it, but Starlink will also work this way. You will run one CAT6 cable out to the Starlink antenna, which will handle both the internet connection and power the antenna. Another person mentioned that their provider that they think uses fiber runs CAT5/6 cable out to a transition box that is outside their house. Any type of provider COULD do this, but a Cable TV company would NOT. (They want the Coax to come into the house so that they can sell you a Television package, whether you want it or not.) So, it is possible that it is just about anything. Where does the CAT5 go? Who do you pay for service? ",
            "date": "Answered August 15, 2020",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dennis Eichenlaub",
                "href": "/profile/Dennis-Eichenlaub"
            },
            "answer_text": "Broadband connections do not enter your house through Ethernet cable. Ethernet cable has to be 100 meters long or less. It simply isn’t suitable for sending signals that originate in the service provider’s switch building to your house. If service is DSL, it comes in through the phone wires. If the service is cable, it come in through coax cable. If it is fiber, the fiber goes to an optical receiver. The optical receiver converts the signal to either coax or Ethernet to send it on to your router. Edit: Paul Olaru points out that the optical receiver can be on a pole outside the house, and sends the converted signal in by Ethernet cable. That would work, as long as the 100 meter limit is honored. In any event, you have placed the cart in front of the horse. Contact service providers in your area. They will have different speeds at different prices. Often they package plans with TV, premium TV, phone service, and anything else they can think of. Sort all that out and decide which service you want. They will get their service connected to your house. If you lease a router, they will help you get the router connected. Then you can think about what that Cat5 cable does, and whether you can make it useful. ",
            "date": "Answered August 15, 2020",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Olaru",
                    "user_href": "/profile/Paul-Olaru"
                }
            ]
        }
    ]
}