{
    "title": "Which 3D printer is best for printing shoes? - Quora",
    "tags": [
        "3D Printers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Valerio Cietto",
                "href": "/profile/Valerio-Cietto"
            },
            "answer_text": "You need a printer which has the following requisites: All metal nozzle. TPU is very flexible and require higher temperature than what PEEK nozzles can withstand routinely.Direct extrusion nozzle, for 1.75mm filament. 3mm flexible filament is very hard to print.Build chamber 30x40x15cm or better. You will probably want to print two shoes together, right? Cartesian printers are easier to find with this kind of volume.Heatbed 110°, or heated chamber. Flexible filament retracts a lot more compared to other filaments when cooling.Welcomed features: Open Hardware. That means you can repair it with cheap parts.Active community. This helps a lot when starting.What doesn't matter: Multiple extruders. It is already a nightmare to print well with one.Speed. You will print at 20–60mm/s anyway.Noise. You won't want it running near your bed anyway. Flexible ABS makes smelly fumes when printing and printing a pair of shoes easily takes a full day at medium resolution.Resolution. Too small nozzle and it doesn't print, too small layers and it takes weeks. You will need some hand polishing.",
            "date": "Answered January 28, 2018",
            "views": "720",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johnny Oscar",
                    "user_href": "/profile/Johnny-Oscar-1"
                },
                {
                    "user_id": "Blake Horner",
                    "user_href": "/profile/Blake-Horner-3"
                },
                {
                    "user_id": "John P Benfield",
                    "user_href": "/profile/John-P-Benfield"
                },
                {
                    "user_id": "Kobus Van Der Walt",
                    "user_href": "/profile/Kobus-Van-Der-Walt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandra Carol",
                "href": "/profile/Sandra-Carol-3"
            },
            "answer_text": "Those with broad information about the complexities of footwear generation have utilized a cellphone allegory to portray the childish phases of 3D printing's application for use in making outlines that are both bleeding edge and financially capable – expressing that the methods and feel of 2016's plans are like the block cellphone of yesteryear which was difficult and bulky. Like with any bit of development, creators need to begin some place, and you better trust that the race is as of now being controlled by real shoe organizations like Nike, adidas, New Balance and Under Armor who all need to assert some authority as the lord of 3D printing. The training is seen as a commonly valuable undertaking for both brand and buyer. For the previous, it can drastically eliminate squander and can likewise significantly assist the plan procedure. For the last mentioned, specificity to one's needs – regarding size, fit and athletic train – can be considerably more tailor-made. In any case, who is winning in 2016 and maybe more imperatively, who will claim 2017? NikeadidasNew BalanceUnder Armor",
            "date": "Answered January 29, 2018",
            "views": "347",
            "upvotes": "0"
        }
    ]
}