{
    "title": "Which are internet broadband service providers available in VijayNagar, Indore and how is their service? - Quora",
    "tags": [
        "Indore, Madhya Pradesh, India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kunal Ujjainkar (कुणाल उज्जैनकर)",
                "href": "/profile/Kunal-Ujjainkar-कुणाल-उज्जैनकर"
            },
            "answer_text": "I dont live nearby vijaynagar so I asked one of my friend about it, so writing on his behalf and some of my experience..  Good broadband providers are BSNL and AIRTEL in vijaynagar area AIRTEL-in terms of speed and customer service airtel is best but its plans are bit costly and come with limited data and speed restriction after consumption of some data. BSNL- my friend using BSNL broadband unlimited plan(with speed bar on data usage), and its working fine, no connection drop and quite responsive service in that area in contrast with bsnl image :P so its a reasonable option. Now about tikona, as per my experience sometime it sucks, and service is poor.. My friend also gave same review for tikona. Also in airtel and bsnl there are landline cum broadband plans, see them also. ",
            "date": "Answered May 24, 2016",
            "views": "62",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashu Saluja",
                    "user_href": "/profile/Ashu-Saluja-5"
                },
                {
                    "user_id": "Vishal Thawrani",
                    "user_href": "/profile/Vishal-Thawrani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Jangid",
                "href": "/profile/Rohit-Jangid-16"
            },
            "answer_text": "Actually in Vijay nagar mostly all broadband services are available. Airtel -airtel Broadband Fiber Connection Plans Reliance -http://www.rcom.co.in/Rcom/personal/internet/wired_postpaidplans.html BSNLnewconnection Tikona (I will not recommended this to any one)http://www.tikona.in/book-now Hathway (New and best broadband in indore )Hathway Broadband Plans|unlimited broadband in india, fibre broadband packages, High Speed Internet In my opinion you should go for HATHWAY, it's local operator who is giving upto 50 mbps speed in very low rates. Thank you. ",
            "date": "Answered July 8, 2016",
            "views": "61",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sudha Rao",
                    "user_href": "/profile/Sudha-Rao-44"
                },
                {
                    "user_id": "Mayank Sanghvi",
                    "user_href": "/profile/Mayank-Sanghvi-3"
                },
                {
                    "user_id": "Dhiraj Jain",
                    "user_href": "/profile/Dhiraj-Jain-56"
                }
            ]
        }
    ]
}