{
    "title": "Which processor is best for a laptop, a quad core or dual core? - Quora",
    "tags": [
        "Central Processing Units",
        "Processors",
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vinaya",
                "href": "/profile/Vinaya-15"
            },
            "answer_text": "Depends, What u want to do with it.. If you want the laptop for multimedia purpose, Dual core will be Good as because it will give more battery juice and also it will generate less heat. But if you are onto something serious, Like Browsing Internet also Using to Play Mvoies, Then also with another monitor you want to run antivirus scan.. Its better to buy Quad core. Personal Experience: I am a Heavy user.. I have a i7 4720HQ 3.60GHZ quad core processor.. It helps me a lot.. Especially when i do run Adobe After effect to make videos, also i use to brows internet at the same time.. 4720HQ is a High End Mobile processor which generate Heat Like a Furnace but do its job quite well. ",
            "date": "Answered June 12, 2018",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashwin Dollar",
                "href": "/profile/Ashwin-Dollar"
            },
            "answer_text": "It really depends on how heavy a laptop you're willing to carry around. A quad core processor will be significantly faster but you mostly find them in 15″ and larger laptops and the few 14″ models that offer them generally get very hot. Most laptops come with dual core processors because they draw significantly less power, low enough in the case of the Core m that many models are completely fanless. You'll benefit from a quad core processor if you run applications that are very CPU intensive or you heavily multitask but most people generally don't do either with their laptops. ",
            "date": "Answered July 30, 2017",
            "views": "4",
            "upvotes": "0"
        }
    ]
}