{
    "title": "Which one is older, Star Trek or Star Wars? - Quora",
    "tags": [
        "Star Trek (creative franchise)",
        "Science Fiction (genre)"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Orwell",
                "href": "/profile/George-Orwell-39"
            },
            "answer_text": "Older might be a slippery term. But from proposal to actual production, it’s Star Trek. Gene Roddenberry came up with his “Wagon Train To The Stars” in the early Sixties and created the first pilot in early 1965. It was too cerebral (“The Menagerie”, an excellent episode that was turned into The Original Series only two-parter and a Hugo Award winner) and an unprecedented second pilot was ordered, “Where No Man Has Gone Before”. The first episode, “The Man Trap”, was launched on September 6th, 1966. From an article about George Lucas: “Emboldened by his early success with Graffiti, Lucas was determined to follow through on an idea for a “space opera” he and his partner, Gary Kurtz, had been noodling around since 1971. The story was based on outer-space adventures like those of Flash Gordon and Buck Rogers—stories Lucas adored as a young boy growing up on his family’s walnut farm. “ So from the timeline, Star Trek was envisioned whole in 1964, if you take into account the production requirements to start up the pilot. Lucas’ vision of Star Wars was around 1971. Yet like most great ideas, they had been stirring for a long time. Gene Roddenberry was a Hollywood screen writer and his work on shows such as “Have Gun Will Travel” had been fermenting the idea of a Horatio Horblower captain in outer space had been working on him for a while. Likewise, the story of Luke Skywalker is the classic hero’s journey, written about by Jung and repeated many times. So it comes down to where you think all great ideas start. By the calendar, it’s Star Trek. ",
            "date": "Answered September 13, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Terence McQuillan",
                    "user_href": "/profile/Terence-McQuillan"
                }
            ]
        }
    ]
}