{
    "title": "Which university is better for computer science, FAST or COMSATS in 2019? - Quora",
    "tags": [
        "COMSATS Institute Of Information Technology, Islamabad",
        "COMSATS Institute of Information Technology",
        "National University of Computer and Emerging Sciences",
        "Computer Science Education",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ali Qumail",
                "href": "/profile/Ali-Qumail-2"
            },
            "answer_text": "it depends on you to be honest .I don’t know much about comsats but i can tell you about Fast yeah its true that is Fast is not a good choice if you are looking for GPA or a enjoyable time though i believe that taking gpa in fast might be difficult compared to other universities but it not impossible .Students here get 3+ GPA with little more effort but the majority lies about 2–2.5 . Secondly , your coding skills will improve rapidly . Even though my coding isn’t that good but whenever a friend of mine from other universities gives me some sort of coding problem to solve i do it with ease . ",
            "date": "Answered January 17, 2020",
            "views": "126",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zain ul Abdin",
                "href": "/profile/Zain-ul-Abdin-60"
            },
            "answer_text": "Ok So Lets Decide Comsats Vs Fast right? I am currently studying in Comsats Islamabad in BSCS program. When applying for universities I did the research too which you are doing now. I don’t know much about FAST but I can surely tell you much about Comsats. (1) As Comsats is a public university and currently semi govt it enjoins the favours of HEC which includes higher ranking. (2) Comsats surely has some great faculty for CS but that doesn’t matter much as wherever you go the faculty will just teach you basic concepts and the rest depends on you. I have heard that FAST has a bad reputation for torturing their students for assignments etc. Don’t think much just join any one of them and learn. Because in the end you will only regret the chances you didn’t take. Enjoy!!! Need any help regarding Comsats you can contact me on FB. https://www.facebook.com/zain.laghari.10 ",
            "date": "Answered May 16, 2019",
            "views": "336",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Farid Khan",
                    "user_href": "/profile/Farid-Khan-87"
                }
            ]
        }
    ]
}