{
    "title": "Which is the better option, staying in a company for a longer period like 8-10 yrs or changing jobs every 1-2 yrs? Which option gives a better salary? - Quora",
    "tags": [
        "Salary and Wages Advice",
        "Career Choices",
        "Job Searches",
        "Companies",
        "Salaries and Wages",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anirudh Garg",
                "href": "/profile/Anirudh-Garg-36"
            },
            "answer_text": "Thanks for A2A. I am writing this answer assuming you work in the IT/Software industry. After working for 2 MNC’s for almost 3 years in each, I could pretty much say that it’s not a great idea to stick to any company for as long as 8–10 years. There are broadly 2 types of IT companies that you would be working for; Product-based and Service-based. Both the type of companies provide a different kind of pay and perks. In the former one, you get a higher starting pay, good hikes (considering you are an above-average performer), equity options, better health insurance for self and dependants, LTA, annual bonus, loyalty cards, company transportation and many more. Whereas in the latter one you will be working on a salary which is as per the market’s standards, which in general are quite low. Based on my experience of working for 2 service-based MNC’s, I have seen the annual hikes are just to beat the inflations for the above-average candidates. In general, the hikes are somewhere in between 5–9%. There are no equity options for entry to mid-senior level jobs. In case you get to work on onsite projects, that will certainly give a boost to your salary but will again be beaten by the salary you would be earning by switching to another company at that location in long run. One of the benefits you can expect (no guarantee) in Service-based companies is that you get to work at onsite based on your client’s location, which is quite rare in any product based company for obvious reasons. Coming back to your first question of staying with a company for as long as 8 - 10 years, doesn't resonate in any case. Until you get to work on different projects, technologies, teams, job locations, and annual hike of at least 20% per annum. Especially when we are in the initial stage of our career, we should always keep exploring options as there is no such company that has been the “Best place to work” continuously for 8–10 years. Even if it has, that doesn’t guarantee employee's growth equally. I am a strong believer that the people who switch often i.e. after spending a substantial amount of time which could be at least 1 - 1.5 years, would be earning a better salary, compared to those who have spent a decade in the same company. ",
            "date": "Answered January 30, 2020",
            "views": "125",
            "upvotes": " View 54 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rajni Sadashiv",
                    "user_href": "/profile/Rajni-Sadashiv"
                },
                {
                    "user_id": "John Carpenter",
                    "user_href": "/profile/John-Carpenter-120"
                },
                {
                    "user_id": "Kirti Sharma",
                    "user_href": "/profile/Kirti-Sharma-87"
                },
                {
                    "user_id": "Narendra Mahadev",
                    "user_href": "/profile/Narendra-Mahadev"
                },
                {
                    "user_id": "Arun Mohan",
                    "user_href": "/profile/Arun-Mohan-280"
                },
                {
                    "user_id": "Ameya Borkar",
                    "user_href": "/profile/Ameya-Borkar-2"
                },
                {
                    "user_id": "Er Gaurav Rawat",
                    "user_href": "/profile/Er-Gaurav-Rawat"
                },
                {
                    "user_id": "Ishant Mehta",
                    "user_href": "/profile/Ishant-Mehta-3"
                },
                {
                    "user_id": "Ganesh S",
                    "user_href": "/profile/Ganesh-S-7"
                },
                {
                    "user_id": "Shankar Lingam",
                    "user_href": "/profile/Shankar-Lingam-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anand Vaishampayan",
                "href": "/profile/Anand-Vaishampayan-आनंद-वैशंपायन"
            },
            "answer_text": "If you have average skills then it doesn’t matter whether you change jobs every two years or whether you stay in the same company - Your employer is smart enough to know that you are average and hence they pay you an average salary over the years which brings you back to normal. Changing jobs gives an illusion that your pay is being hiked but how long can you continue to do that? Your manager or supervisor or HR will ensure that you get pay hikes in sync with your performance and skill level. Hence, at one point the law of averages will catch up with you. For highly skilled people it doesn’t matter whether they change job every two years or whether they stay in the same company - They make good salary anyway. It is because their employer values their skill level and wants to retain them or hire them irrespective of the cost. Until, they reach a threshold. What is this threshold? Cost threshold is the point at which the employer believes that you are a good valuable resource but still they cannot retain you. Why? Because your cost/ salary has peaked to a point where it is not giving your employer any profit margins. Plus now they have found another resource of the same skill level but who is of comparatively lesser cost. Before reaching this point, you either need to re-skill/ up-skill or take additional responsibility. One more option is to move to an Onsite location/ different country. In my opinion, finding a change every 3-4 years is a good strategy but the change must not be limited only to job change, it has to be a change in the role/ responsibility/ skill level etc. Just changing jobs every 1-2 years for the sake of salary is a recipe for failure in the long run. Before you sign off see this special video on the factors impacting salary…  ",
            "date": "Updated March 7, 2020",
            "views": "785",
            "upvotes": " View 374 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashish Sharma",
                    "user_href": "/profile/Ashish-Sharma-529"
                },
                {
                    "user_id": "Yash Wanth",
                    "user_href": "/profile/Yash-Wanth-7"
                },
                {
                    "user_id": "Unniraja James",
                    "user_href": "/profile/Unniraja-James"
                },
                {
                    "user_id": "Murali Mohan",
                    "user_href": "/profile/Murali-Mohan-622"
                },
                {
                    "user_id": "Sumanth Chinthi",
                    "user_href": "/profile/Sumanth-Chinthi"
                },
                {
                    "user_id": "Kartik Rao",
                    "user_href": "/profile/Kartik-Rao-35"
                },
                {
                    "user_id": "Manas Chaudhary",
                    "user_href": "/profile/Manas-Chaudhary-7"
                },
                {
                    "user_id": "Kaushik Singh",
                    "user_href": "/profile/Kaushik-Singh-11"
                },
                {
                    "user_id": "Sushant Lukke",
                    "user_href": "/profile/Sushant-Lukke"
                },
                {
                    "user_id": "Amshuda Malikayil",
                    "user_href": "/profile/Amshuda-Malikayil"
                }
            ]
        }
    ]
}