{
    "title": "Which technologies will become obsolete by 2020? - Quora",
    "tags": [
        "Obsolete Technologies",
        "2020 (year)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shravan",
                "href": "/profile/Shravan-72"
            },
            "answer_text": " Just five years ago the world was a very different place. In 2010, the iPad had just made its debut, Kickstarter was introducing a new form of venture capitalism that would change the face of fundraising and Square was letting vendors of any size accept payment with a swipe of a card on a mobile device. And we haven’t looked back. The next five years will no doubt unleash products and services that we have yet to imagine. But as we progress, what will we leave behind? Here are a handful of things we use today that likely will either be gone completely or on their last breath, disrupted by new innovations, technology and methods. Cash, checkbooks, credit cards and ATMs: What’s in your digital wallet? Today, Square lets any business accept debit or credit cards. Venmo lets you split your dinner bill with a friend through a money transfer via text message. Soon, you will have all your banking done through any mobile device — even your vehicle. Across the U.S., check use fell 57 percent from 2000 to 2012, according to the Federal Reserve. Ninety-four percent of consumers under 35-years-old bank online, and more than one-fifth of them have never written a physical check to pay a bill, according to First Data’s report, The Unbanked Generation. In Europe, if you try to write a check, they look at you as if you are crazy. Rent may be the last great bastion of using checks, but even that is well on the decline as property managers switch to electronic payments, and mobile payments become so easy. One more thing: In the more distant future, there will be no cash. No cash means no cash machines — bye, bye ATMs. USB sticks: How much longer for physical media? By 2020, 70 percent of the world will be using a smartphone, according to Ericsson’s mobility report. Mobile data networks will cover 90 percent of the population. With cloud services like Apple, Box, Dropbox, Google and Microsoft offering near-unlimited storage at near-free prices, there’ll be little need for storage devices taking up room in your pocket. Not to mention the increase in standard storage for mobile devices in the next five years. Event organizers around the world will need to come up with new swag to reward attendees at their conferences as USBs will be a token of the analog past. Easier, more secure access: Passwords, keys be gone This is a hard one because passwords are used so broadly today. The average person is said to have 19 passwords — and nearly half admit to using unsafe, weak passwords. But even if you’re adamant about using only strong passwords — guess what — those can be cracked too. Consider getting a head start on cleaning out the old-tech clutter you have in your life. Biometrics are already becoming mainstream, especially on mobile devices, which are now the main access point for many of our online activities. Fingerprints, voice and facial recognition will replace your first dog’s name and your wedding anniversary as the way you access your secure accounts. These will have their own security risks, but the character password will be no more. Similarly, soon you will not have physical keys to lose. Your key will be any of the smart devices you carry, which will be linked to you biometrically so that only you can operate them. No one will miss this: The remote control No more scrambling around your house tossing the cushions of your couch in the air looking for the elusive remote control (or 10 of them, depending on the complexity of your in-home audio and video setup). The research firm Strategy Analytics forecasts that emerging categories in the Internet of Things (IoT), smart home and wearables will connect an additional 17.6 billion devices by 2020. Even today, devices such as the Amazon Echo are taking voice search and commands to a new level. With so many new devices connected to the Internet by 2020, building separate hardware for a remote control will just no longer make any sense. Static documents and paper agreements Paper-based signatures and paper-based processing — physically needing to print, fax, scan or overnight documents for reviews, approvals, decisions and/or signatures to complete a transaction — are fast-becoming archaic in today’s digital world. In the future, we will rely on “cloud agreements” to actively manage any transaction. Cloud agreements will be: actively connected to the identities of the involved parties (forever), able to mete out payments as contract objectives are met and actively contact actors in the transaction when the time is right. Real estate, financial services, insurance, high-tech and healthcare companies — even budget-strapped governments — are adopting cloud-computing models to increase efficiency, reduce costs and drive a better end-user experience. Soon, contract management will never be the same. When you’re making a list of resolutions for the New Year, consider getting a head start on cleaning out the old-tech clutter you have in your life to make way for a digital New Year. Sure, you have some time. But with all of the exciting technology disruptions taking place right now, why wait? ",
            "date": "Answered July 29, 2017",
            "views": "51",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrew Vanessa",
                    "user_href": "/profile/Andrew-Vanessa-2"
                },
                {
                    "user_id": "David F. Prenatt Jr.",
                    "user_href": "/profile/David-F-Prenatt-Jr"
                },
                {
                    "user_id": "Christian Ferrari",
                    "user_href": "/profile/Christian-Ferrari"
                },
                {
                    "user_id": "Mahesh Mundel",
                    "user_href": "/profile/Mahesh-Mundel-1"
                },
                {
                    "user_id": "Praveen Pulicharla",
                    "user_href": "/profile/Praveen-Pulicharla-2"
                },
                {
                    "user_id": "Suhas Gokhale",
                    "user_href": "/profile/Suhas-Gokhale-1"
                },
                {
                    "user_id": "Arjun",
                    "user_href": "/profile/Arjun-129"
                },
                {
                    "user_id": "Pavan Jangid",
                    "user_href": "/profile/Pavan-Jangid-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tushar Kotiyal",
                "href": "/profile/Tushar-Kotiyal-1"
            },
            "answer_text": "Hello Sanket, The world today is very dynamic and very hard to say that which technology will persist and which will be just overthrown by a new one. Thanks to the internet and all the high end connectivity we have today. This link I came across almost covers all the things 9 Types of Technology That Are Becoming Obsolete Adding on to this Normal(keypad button) cell phones.CRT TV(traditional big tube ones)Radio Transistors(I haven’t seen them since a ling time).Traditional internet (it will be replaced by Optical Fiber)",
            "date": "Answered August 1, 2017",
            "views": "119",
            "upvotes": "0"
        }
    ]
}