{
    "title": "Which Technology is used in ham radio or amateur radio? - Quora",
    "tags": [
        "Amateur Radio ",
        "Radio Stations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ganesh Subramaniam",
                "href": "/profile/Ganesh-Subramaniam-2"
            },
            "answer_text": "The technology used by HAMS - or Amateur Radio Operators - is wireless communication technology. We use a variety of modes of communications - like code, voice, text, image, and digital/data communications. Radio amateurs are basically experimenters. RADIO started with Morse-code communications - using continuous-waves in the beginning of the 20th century. Guglielmo Marconi (1834-1937) the Italian inventor sent a message over a wireless telegraph back in 1898 and the first voice transmission was made by Reginald Fessenden (1866-1932) in 1900. The rest is history. HAMS worldwide are permitted to use frequencies between 1.80MHz band (160 meters) right up to 10 GHz band (3 Cm). My station can go up to 450 MHz (70 Cm) band. Now, amateurs in some countries are experimenting with medium wave bands also. (The latest record is a contact between New Zealand and England on 630 meters (medium wave corresponding to frequencies between 470 and 490 KHz! Even a half wave dipole will be around 315 meters long, and everyone thinks medium waves are only for local broadcasting). Until recently amateurs all over the world were required pass a test in Morse Code communications; but now many countries have done away with this requirement. In the olden days, radio amateurs were looked upon as a \"second line of defence\" in case of war or natural calamities when the telephone lines would be down and Morse code communications was considered the easiest and the most efficient during emergencies - but nowadays with satellite communications and various other modes available, the authorities probably feel that they do not need Morse Code anymore. I personally think it is still very useful in times of emergencies. The modes used: Continuous Wave (CW), used for Morse code communications* Voice - Amplitude modulation (AM)*, Single Sideband (SSB)* Frequency modulation (FM)* Amateur Television (ATV), also known as Fast Scan television Slow-Scan Television (SSTV)* Text and data digital modes. transmitted by inserting an audio signal into the microphone input of a radio and using an analog scheme, such as a single-sideband modulation (SSB)* Radio Tele Type (RTTY)* Digital Smart Technology for Amateur Radio D-STAR Echolink - to connect amateur radio station to the Internet* Hellschreiber, also referred to as either Feld-Hell, or Hell Multiple Frequency-Shift Keying (MFSK) modes such as FSK441, JT6M, JT65*, (very weak signal communications) OSCAR* (Orbital Satellite Carrying Amateur Radio) Packet radio (AX.25) - now used mostly for contact with ISS Automatic Packet Reporting System (APRS)* PACTOR PHASE SHIFT KEYING consisting of: 31 baud binary phase shift keying: PSK31* 31 baud quadrature phase shift keying: QPSK31* 63 baud binary phase shift keying: PSK63* 63 baud quadrature phase shift keying: QPSK63* Spread spectrum (SS) I have only listed the popular modes that amateurs use; there are several other modes that some very serious amateurs are experimenting with. The best part is - there is no special qualifications required to obtain a licence! The age limit is 12 in most countries! (* indicates the modes available at my station) * ",
            "date": "Updated October 22, 2016",
            "views": "648",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dave Nelson",
                    "user_href": "/profile/Dave-Nelson-89"
                },
                {
                    "user_id": "Ashton Ellsworth",
                    "user_href": "/profile/Ashton-Ellsworth-1"
                },
                {
                    "user_id": "Malhar Mulmulay",
                    "user_href": "/profile/Malhar-Mulmulay-1"
                },
                {
                    "user_id": "Christine Axsmith",
                    "user_href": "/profile/Christine-Axsmith"
                },
                {
                    "user_id": "Orb Thompson",
                    "user_href": "/profile/Orb-Thompson"
                },
                {
                    "user_id": "John Merritt",
                    "user_href": "/profile/John-Merritt-20"
                },
                {
                    "user_id": "Darryl Wagoner",
                    "user_href": "/profile/Darryl-Wagoner"
                },
                {
                    "user_id": "Parvesh Taneja",
                    "user_href": "/profile/Parvesh-Taneja"
                },
                {
                    "user_id": "Ajay Krishna J S",
                    "user_href": "/profile/Ajay-Krishna-J-S-2"
                },
                {
                    "user_id": "Shrishail Talukar",
                    "user_href": "/profile/Shrishail-Talukar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter G Adely Sr",
                "href": "/profile/Peter-G-Adely-Sr"
            },
            "answer_text": "Ham radio has many technologies. AM. FM. Sub. Newer digital transmissions. Your license grade determines which frequencies you may use. Within that you can operate legally within license limitations. Newest digital is developing now. Constantly improving. It requires specialized receivers and decoders to bring it to plain language. Aprs digital reporting system. System Fusion and D star are up and coming digital communications. Police have been switching to select frequencies and digital technology. This brings privacy to the 2way transmission. Lots more as technology moves forward. ",
            "date": "Answered October 2, 2017",
            "views": "139",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashton Ellsworth",
                    "user_href": "/profile/Ashton-Ellsworth-1"
                },
                {
                    "user_id": "Malhar Mulmulay",
                    "user_href": "/profile/Malhar-Mulmulay-1"
                }
            ]
        }
    ]
}