{
    "title": "Which is better, micro USB or USB-C? - Quora",
    "tags": [
        "Micro USB",
        "USB Powered Devices",
        "USB Type-C"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siddharth Sinha",
                "href": "/profile/Siddharth-Sinha-84"
            },
            "answer_text": "Well there are a lot of factors which makes usb type C better than USB B’s and here are some of those -  (Source - Google) Durability - This is a point which is very essential to those who mistakenly try to force plug the USB-B with wrong sides, C as being reversible type that’s not a matter of concern. For me its not a thing because in my usage I have never faced this problem and Last time I broke a cable because of this was about 3 years back when I was 12, but it can be a thing for people.Built for speed - Usb C is built to be fast, it’s designed to run speed of usb 3 gen 2 which is about 10 gbps, in technical term and about 2.6 GB per second, which is blazing fast.Not just speed - Usb, as a standard was not only built to transfer data as fast speeds but also a good amount of power through it at the same time. Usb C takes it to a new level, not only send data at very fast speed but also send as much as 100 watts through it.God of thunder - Thunderbolt 3 is a standered which embraced USB type c, its an addition which increases the ability and usage of this usb a lot, when I say a lot, that means about 40 gbps data transfer speed + running 4k monitor at 60hz + sending 100 watts of power+ extending PCIe connections and using External GPU’s, all at the same time , yeah all at the same time which opens a lot of things which we could do. Mr.B definitely can’t do this.TL;DR - USB C is a next gen usb standard and it is supposed to be better at everything that its predecessors are meant to do. Keep Reading, written by Siddharth Sinha :) ",
            "date": "Answered August 2, 2018",
            "views": "33",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "A Anand",
                    "user_href": "/profile/A-Anand-69"
                },
                {
                    "user_id": "Nikhil Agrawal",
                    "user_href": "/profile/Nikhil-Agrawal-356"
                },
                {
                    "user_id": "Anaam Banjara",
                    "user_href": "/profile/Anaam-Banjara"
                },
                {
                    "user_id": "Emmanuel Eyob",
                    "user_href": "/profile/Emmanuel-Eyob"
                }
            ]
        }
    ]
}