{
    "title": "Which is better, Huawei or Samsung? - Quora",
    "tags": [
        "Huawei Community",
        "Huawei Devices",
        "Samsung Mobile"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gregg Thomas",
                "href": "/profile/Gregg-Thomas-1"
            },
            "answer_text": "I've have owned several of Samsung's flagship phones (and several HTC's). But for a change I've just bought my first Huawei (mate 10 pro). Here are my thoughts - Samsung phones are overpriced with a better reputation than they deserve. They are in no way bad phones, but they have always come across as average in my opinion, (particularly with the user interface). They appear far more glitchy than other premium manufacturers and seem to suffer some slow down at an earlier point. I've also found that their phones look like they're 2 years old after 6 months. They certainly don't age very well and need to be handled with care. (HTC on the other hand are the complete opposite) Now then, I've had my Huawei mate 10 pro for about a month. And it's a very impressive phone and probably more practical in everyday use compared to Samsung's. It also has a trick up it's sleeve that prevents slow down that happens over a period of time. And as for the battery life, it blows Samsung out of the water. Camera set up is a major plus for Huawei as they team up with Leica to give you a photography experience that's more like a dedicated digital camera compared to other smartphone manufacturers. Huawei phones are also priced more reasonably than Samsung's. So as you see, in my opinion Huawei is the better choice. They're tougher phones that seem to work better in everyday use - along with better customer support and better pricing, I'd be picking Huawei over Samsung all day long !! UPDATE - Replaced my Mate 10 Pro (in October 2019) with a Mate 20 pro. What a fantastic upgrade and a brilliant phone with no weaknesses or shortcomings. This has confirmed to me that Huawei are currently the best manufacturer at present. ",
            "date": "Updated March 6, 2020",
            "views": "3295",
            "upvotes": " View 961 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikita Saraev",
                    "user_href": "/profile/Nikita-Saraev-3"
                },
                {
                    "user_id": "Yalun Cheng",
                    "user_href": "/profile/Yalun-Cheng"
                },
                {
                    "user_id": "Dmitry Rybin",
                    "user_href": "/profile/Dmitry-Rybin-4"
                },
                {
                    "user_id": "Shravan Subba",
                    "user_href": "/profile/Shravan-Subba-1"
                },
                {
                    "user_id": "Bo Brcue",
                    "user_href": "/profile/Bo-Brcue"
                },
                {
                    "user_id": "Noor Shahid",
                    "user_href": "/profile/Noor-Shahid-27"
                },
                {
                    "user_id": "Christian Chu",
                    "user_href": "/profile/Christian-Chu-3"
                },
                {
                    "user_id": "Help Needed",
                    "user_href": "/profile/Help-Needed-33"
                },
                {
                    "user_id": "Kate Russell",
                    "user_href": "/profile/Kate-Russell-77"
                },
                {
                    "user_id": "Robo Frog",
                    "user_href": "/profile/Robo-Frog"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Raj Chaudhary",
                "href": "/profile/Yash-Raj-Chaudhary"
            },
            "answer_text": "It is one of the toughest question I have ever face in Quora but I interested to answer this questions. Firstly discuss about Samsung. Samsung is world largest manufacturer company with the market sharing is 21% in Q1 2019 but Q1 of 2018 is 22% it means it market sharing goes down even Samsung launch his Samsung Galaxy S10 Plus.Now we talk about shipment it also goes down in this photo(by Counterpoint report) we see Q1 of 2018 is 78.2 million unit but in Q1 of 2019 is 72 million unit .This data clear how Samsung company goes down while he launch his best flagship series phone Samsung Galaxy S10 Plus.  Now we discussed about Huawei:- If we learned 2016,how much people know Huawei mobile but present how many not know about Huawei.Huawei share increase day by day. Huawei make phone in every 36.5 second.Now we see Huawei market share increase in huge number,if we see Q1 of 2018 Huawei market share is lower than iPhone it market share is 11% but in Q1 is of 2019 market share is 17% it's huge increase it 6% while company market sharing is not 6%.After we see shipment,it's shipment is lower than iPhone in Q1 of 2018 it shipment is 30.3 million unit but Q1 of 2019 it's increase and reach 59.1 million unit it means it's shipment increase 50% it's is disasters for any company. This data clearly shows how Huawei is getting better and better per year,may it's happen next year Huawei us leading Smartphone world. SAMSUNG VS HUAWEI (in phone) Only Samsung and Huawei launch Android flagship phone in many country.I share my experience with HUAWEI P30 Pro and Samsung Galaxy S10 Plus I used both phone more than half hour.Firstly we talk about both phones design , Huawei P30 Pro have curved display as well as Samsung Galaxy S10 plus also while Huawei phone carry water drop notch while Samsung Galaxy S10 plus have punch hole display.Both phone have Super AMOLED display but Samsung display support HDR10+ both phones have in display fingerprint and unlock speed have same but Huawei P30 Pro have optical indisplay fingerprint while Samsung Galaxy S10 plus have ultra Sonic fingerprint.If we talk about face unlock then Samsung Galaxy S10 plus us totally dull while Huawei P30 Pro have secured.Now I shared best experience both phones camera.Huawei P30 Pro is best in the world it's night mode is better than Pixel series its 50X zoom just like it dream we see so far object clearly our phone I have no word describe about Huawei camera it's unbelievable it is a pure photography phone while Samsung have great camera but it never compete with Huawei P30 Pro camera.Both phone performance is same. Now we talk about battery performance,I used phone both phones half hour Huawei P30 Pro battery goes down 4% while Samsung Galaxy S10 plus down 6%.Huawei P30 Pro comes with 40W Super fast charger while Samsung Galaxy S10 have 27W charger. Conclusion:- If we see report by Counterpoint Huawei easily beat Samsung in both topic(shipment and market share). If I share my experience Samsung phone display have decent but I not said Huawei is not good Huawei also better.After display no any place Samsung beat Huawei if we talked about camera, battery and many more.If we talk about price Huawei phone provide great feature in price of 65k to 70k but Samsung provide sane feature in 80k to 85k while it's camera and battery not like Huawei. At last I say Huawei is only brand that can beat Samsung and reach number 1 brand.I say Huawei is better brand than Samsung. Telegram- Equal Leaks For leaks, launch date, launch video and more.  ",
            "date": "Updated October 9, 2019",
            "views": "46",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ekaete Ntiaidem",
                    "user_href": "/profile/Ekaete-Ntiaidem"
                },
                {
                    "user_id": "Jaydin Herrings",
                    "user_href": "/profile/Jaydin-Herrings"
                },
                {
                    "user_id": "Daniel Huang",
                    "user_href": "/profile/Daniel-Huang-102"
                },
                {
                    "user_id": "Vitaly Vitaly",
                    "user_href": "/profile/Vitaly-Vitaly-6"
                },
                {
                    "user_id": "Tim Leahm",
                    "user_href": "/profile/Tim-Leahm"
                },
                {
                    "user_id": "Phillipa Philpot",
                    "user_href": "/profile/Phillipa-Philpot"
                },
                {
                    "user_id": "Carole Hughes",
                    "user_href": "/profile/Carole-Hughes-16"
                },
                {
                    "user_id": "Kevin Randolf",
                    "user_href": "/profile/Kevin-Randolf"
                },
                {
                    "user_id": "CoolBo Shi",
                    "user_href": "/profile/CoolBo-Shi"
                },
                {
                    "user_id": "Erwin Sudiro",
                    "user_href": "/profile/Erwin-Sudiro"
                }
            ]
        }
    ]
}