{
    "title": "Which is the best smart TV, LG or Philips? - Quora",
    "tags": [
        "LG (company)",
        "Smart TVs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gregg Thomas",
                "href": "/profile/Gregg-Thomas-1"
            },
            "answer_text": "Straight forward this one !! After owning several Phillips TV's and 2 LG's, I can fully confirm that LG are a bag of dog Sh*t !! The last LG I had in my possession was of a 'premium’ nature and it was terrible. It made movie special effects look like a computer game. After spending £80 in phone calls to LG to try and improve the picture quality, I gave up !! I returned the LG and exchanged it for a Phillips. This was the second time this has happened in the last 4 years !! I currently own a Phillips 4k fifty inch that I bought for under £500. And it's great. If you're looking at a Phillips, check out the models with 'Ambi-light'. You'll get a very immersive experience whilst watching movies. Please please please stay away from LG. GOOD LUCK !! ",
            "date": "Updated August 4, 2019",
            "views": "221",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryan Grice",
                    "user_href": "/profile/Bryan-Grice-5"
                },
                {
                    "user_id": "Best Ernest",
                    "user_href": "/profile/Best-Ernest-1"
                },
                {
                    "user_id": "Bernie Weakley",
                    "user_href": "/profile/Bernie-Weakley"
                },
                {
                    "user_id": "Aruna Po-Ching",
                    "user_href": "/profile/Aruna-Po-Ching"
                },
                {
                    "user_id": "Merv Tso",
                    "user_href": "/profile/Merv-Tso"
                },
                {
                    "user_id": "Muhammad Jawwad",
                    "user_href": "/profile/Muhammad-Jawwad-51"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yashwanth Yash",
                "href": "/profile/Yashwanth-Yash-176"
            },
            "answer_text": "Planning for the smart TV. LG and PHILIPS both are good in one or the other way but coming to the features and specifications of any smart TV we expect a lot in it and RIDAEX TV’s are the one which can fulfill all of your requirements. There you go, the all-new RIDAEX NUKE SERIES which is just ruling the market where lots of brands do exist in the market. It all comes with the latest technologies and specifications which are needed in any of the smart Tv’s. And here are some extraordinary features I am Listing : Built-in Android OS having Android UI and Especially comes with an Upgradable feature.2 GB RAM and 16 GB ROM, which boosts up the speed and lots of space for memory storage.Dolby Audio Engine and speakers for a greater and better Audibility.4K Ultra HD and also comes with the highest number of nits providing the best picture and visual quality.These all come with a very affordable price. I recommend highly to go for RIDAEX NUKE SERIES which comes in 32″,43″,50″ and 55″ and lots more to come. Hoping this will help you to opt and but the best. Thanks ",
            "date": "Answered October 5, 2018",
            "views": "116",
            "upvotes": "0"
        }
    ]
}