{
    "title": "Which is latest technology you like the most? And why? - Quora",
    "tags": [
        "New Technologies",
        "Latest Technology",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yaswanth Sai Palaghat",
                "href": "/profile/Yaswanth-Sai-Palaghat"
            },
            "answer_text": "In present IT,it is very difficult to determine one particular technology as the best among others,because everyday is a evolution in computing and every single paves a way for a new technology. But,according to the present job scenario and stack overflow popularity,the below technologies have good growing opportunities: 1.Artificial Intelligence  It covers technologies that are used for prediction purpose.The technology stack of AI constitutes Machine LearningDeep LearningComputer VisionHuman Computer InteractionRobotics2.Data Science Data Science is all about cleaning,analyzing,organizing,preparing and visualizing the data.  It requires the following things to be included: StatisticsMachine LearningData miningData Analytics3.Big Data and Cloud Computing  These are another boom areas to be considered as the trending technologies in the present IT sector . It is because of the importance of data in the life of every individual and consistent improvement in social networks and ecommerce traffic. 4.Full Stack Development using MERN/MEAN With the advent of javascript evolution in the web world,things have been vibrantly changed as it is coming up with number of frameworks every day.  M-MONGODBA-ANGULARR-REACTE-EXPRESS.JSN-NODE.JS 5.ANDROID DEVELOPMENT  As the internet users are more comfortable with using android apps than websites,the demand of android development becomes very high.The two popular ways of building android apps are through: JavaKotlin6.Business Intelligence and Data Visualization  For every business,there is a lot to deal with data.Data visualization becomes essential on every business and there is large demand in this area. The popular tools of BI and Data Visualization are: TableauPowerBI7.Automation  As the role of manual monitoring and surveilance is no more interested by the enterprises, everyone is now looking for the automation processes which automates the task of handling various operations in the enterprise. Robotic Process Automation is one such popular technology to look out for.The popular RPA tools are: UIPATHBLUEPRISM8.Devops  Devops is the combination of Development and operations team in a software organization,which is advanced version to agile development. 9.MicroServices  It is the way of modularizing the services of a software product into independent modules.Microservices enables to complete the software product quickly without depending on other services. 10.Blockchain  Blockchain technology is the decentralized computing environment ,where distributed computing plays an important role here.Cryptocurrency is the major element that profounces the importance of blockchain. ",
            "date": "Answered February 6, 2019",
            "views": "13",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Feath Lorriane De Lara",
                    "user_href": "/profile/Feath-Lorriane-De-Lara"
                },
                {
                    "user_id": "Bharat Kumar",
                    "user_href": "/profile/Bharat-Kumar-2345"
                },
                {
                    "user_id": "Aravind Chakra",
                    "user_href": "/profile/Aravind-Chakra"
                },
                {
                    "user_id": "Sachin Arora",
                    "user_href": "/profile/Sachin-Arora-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Burgett",
                "href": "/profile/Ken-Burgett"
            },
            "answer_text": "Distributed ledgers and SSDs. SSD: It should be obvious, they are faster than a hard disk, simpler to install, and don’t get as hot, so they don’t require as much cooling. What is not to like? Distributed ledgers (BlockChain)First, a disclaimer, I am NOT referring to anything about BitCoin. If you want that, stop reading here. The world’s business runs on making transactions between buyer and seller. The explicit transaction contract has ACID properties, meaning that a transaction can be undone so that it never existed. No partial results hang around. If the buyer accepts the goods, the seller is guaranteed payment, it is a done deal. In modern commerce, there may be many partners within the scope of a traditional transaction, the jobber, the shipper, the warehousing company, ... it is not easy to roll back a transaction, when the shipper did his job and the warehousing company did theirs, but there is a dispute over the goods delivered between the original buyer and seller. There needs to be a better solution, and a lot of people think that is the BlockChain or distributed ledger. It is a complicated mechanism, involving non-changeable data protected by encryption mechanisms, and beyond what I would attempt to describe here. But it is of high interest to the heavy-hitters in global commerce, so it is something to watch. ",
            "date": "Answered July 8, 2019",
            "views": "606",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sachin Arora",
                    "user_href": "/profile/Sachin-Arora-25"
                }
            ]
        }
    ]
}