{
    "title": "Which CRM should a growing enterprise SaaS startup use? - Quora",
    "tags": [
        "Startup Marketing Advice",
        "Enterprise Software",
        "Software-as-a-Service",
        "Entrepreneur Advice",
        "Startup Founders and Entrepreneurs",
        "Marketing",
        "Entrepreneurship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jocelyn Tan",
                "href": "/profile/Jocelyn-Tan-46"
            },
            "answer_text": "I recommend Salesflare – an intuitive, intelligent sales CRM system built to automate most of your sales funnel and workflow. It’s become quite a hit among startups for its user-friendly interface that thinks and works for its user, rather than the other way around. It’s close to Pipedrive: easy to use and easy to set up, with a similar pipeline view. And also focused on sales, communication, and follow-up for sales teams. The difference is in the effort you need to keep it up to date: everything you’d have to manually input in Pipedrive, is fully automated in Salesflare. Here’s what is encompassed in Salesflare’s software: Intelligent, automated sales CRM: It’s a zero-input sales pipeline tool that automatically populates your address book with the data it acquires from your phone, calendar, company database, email signatures, and social media sources.Leads tracker and logbook: It gathers information for all interactions of leads towards you, handed to you on a silver platter in an automated customer timeline: Communication management: It lets you get hold of team insights and its communication history. The intuitive features of the software ensure that the team’s communication is in sync, so that each member is aware of everything about its leads.Goals management and revenue insights: You can set and record goals with the quota management tool, and track the stages of your revenue pipeline.Automatic to-do lists and reminders: From the data it obtains, it sends out to-do reminders on specific leads, so you no longer have to worry about any more potential deals falling through the cracks.It works wherever you work: Be it desktop, mobile, or from the convenience of your Gmail, where you have everything you need from an integrated sidebar.Multi-app compatibility: It works seamlessly with over 700 apps via Zapier. Maximize the usability of the platform with popular integrations include Slack, Stripe, Mailchimp and Trello.Competitive pricing: Single enterprise pricing plan from $30 per user per month – a good bang for the buck considering the integrative smart features that Pipedrive lacks, which are being offered at a much heftier price at Salesforce.Ultimately, you get to sell more with less work with Salesflare. ",
            "date": "Answered June 15, 2017",
            "views": "721",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Najam Us Saqib",
                    "user_href": "/profile/Najam-Us-Saqib"
                },
                {
                    "user_id": "Rutger Van der Auwera",
                    "user_href": "/profile/Rutger-Van-der-Auwera"
                },
                {
                    "user_id": "Gilles De Clerck",
                    "user_href": "/profile/Gilles-De-Clerck"
                },
                {
                    "user_id": "Patrick Tan",
                    "user_href": "/profile/Patrick-Tan-123"
                },
                {
                    "user_id": "Kevin De Clerck",
                    "user_href": "/profile/Kevin-De-Clerck"
                },
                {
                    "user_id": "Jeroen Corthout",
                    "user_href": "/profile/Jeroen-Corthout"
                },
                {
                    "user_id": "Adri Van Houdt",
                    "user_href": "/profile/Adri-Van-Houdt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ross Simmonds",
                "href": "/profile/Ross-Simmonds"
            },
            "answer_text": "No one ever got fired for buying Salesforce. That's a consistent story across most industries which is why Salesforce is at the top of the list for CRM software. At the same time, that might not make it the best in the market. I mean, they do have CRM as their NYSE symbol which is an indicator that they're the market leader but Salesforce also isn't cheap. Especially when you start to look at integrating it with other services and some of their add-ons. A few that I often recommend my clients check out include: Close.io: This is one of the better CRM services out there and is ESPECIALLY good for companies with a designated sales team. Starts at $65 but everything is unlimited for usage. The thing I like about Close is their SMS functionality - A lot of people underestimate the power of SMS for sales. Hubspot CRM: It's changed a bit since I first started using it but it's still a great service. You can import 1M leads and easily track, manage and organize your sales pipeline. The full CRM + Sales feature is the more ideal IMO but that's $50/mos. It comes with document tracking for 1000 docs + sequences (gold). Streak: I fell in love with Streak many moons ago. It's a pretty lean and agile CRM service that integrates directly into gmail. For anyone just getting started with sales, this is a good place to test the waters. You get 200 Tracked Emails / month for free. I'm sure there are tons of other CRM tools out there. It's one of the most competitive space. If I was in your shoes, I'd double down on finding a service that meets my budget needs and has a reputation for delivering great service. All of the above fit the service bill. ",
            "date": "Answered May 21, 2017",
            "views": "366",
            "upvotes": "0"
        }
    ]
}