{
    "title": "Which has more devastating weapons, Star Wars or Star Trek? - Quora",
    "tags": [
        "Star Trek (weapons)",
        "Star Trek (creative franchise)",
        "Science Fiction (genre)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harry Kim",
                "href": "/profile/Harry-Kim-60"
            },
            "answer_text": "Well let's chop this up into categories,just to give Star Wars (from now on SW) a chance vs Star trek(now ST). Number One. Medicine. Why medicine as one? Well cause I feel like it. Both sides have medical tech beyond your capacity to produce,but I'd have to give this one to ST,but it's close. The reason is mainly superior genetic engineering,better AI doctors,and much better scanning equipment,as a tricorder can show you pretty much anything you need to know about the sick person. ST has also worked with much more than chopped off limbs and other,related injuries,meaning they are better prepared for a multitude of problems. Meanwhile in SW we have seen three forms of cure: a big Band-Aid,A dump in magic bacteria, or mechanical limbs(lots, and lots, of mechanical limbs.) Now unless magic bacteria cures all diseases then we are left scratching our heads as to what Luke Skywalker does when he gets a cold. Second, FOOOOOOD. Seriously,how can we forget food? We(and many other species) Need to ingest food to survive on a daily basis. So how hard is it to produce,ship,and store food in each universe? Well in ST food is instant, literally made out of thin air. Which is kind of impossible to beat really. While SW might be better at transporting large quantities of food, when you don't even need to transport food, then you are definitely superior. Three, Ground Combat. ST loses in an instant. Seriously we would be slaughtered by YOU if we invaded by land. With no orbital bombardment or anything like that. The SW though, it's a bit tricky,until you factor in spamming sheer numbers and yep, you are screwed. Four, Space travel. I give this up to a Tie.  Why? Because while hyperdrive is infinitely superior to warp for long distances, when it comes to moving within a solar system,whether for combat or just moving people around, warp is the way to go,as it can be on for sustained periods of time, and lower settings allow you to go very fast, but not so fast as to fly off into another half of the galaxy. In addition even without warp ST has faster and more maneuverable ships,but this may be do to reduced size. Five,Space Combat. Again ST wins, totally not biased, it is perfectly reasonable. Number One, as I pointed out earlier, individual ships can last a lot longer without a planet to resupply them. Number two, ST weapons, while possibly weaker, do have better range, and can adjust themselves against specific targets, a feature SW weapons lack. Finally Warp drive allows the Federation to just swoop in at ftl speeds, fire some shots, then leave, at speeds much greater than Windows Weapons Targeting, Version Five, can accommodate. EDIT: adding a category I forgot.I Six, Computers/AI Yes this means droids.  Unfortunately it's an utter wipeout for SW, as most droids only have basic, humanlike intelligence. Super computers that help control Starships on the other hand have less power than modern supercomputers. Meanwhile in ST you have droids(Android) Who have superintelligence,and emotions(which are generally limited for SW droids) and the Starships computer is centuries ahead. And those aren't even the smartest ones. ",
            "date": "Updated July 10, 2018",
            "views": "2",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "TheonlyJesusduck .",
                    "user_href": "/profile/TheonlyJesusduck"
                },
                {
                    "user_id": "Sebastian Sullivan",
                    "user_href": "/profile/Sebastian-Sullivan-3"
                },
                {
                    "user_id": "Kairui Cheng",
                    "user_href": "/profile/Kairui-Cheng"
                },
                {
                    "user_id": "Clark Strange",
                    "user_href": "/profile/Clark-Strange"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/No-One-5203"
                },
                {
                    "user_id": "James Wylf",
                    "user_href": "/profile/James-Wylf"
                },
                {
                    "user_id": "Ben Heathorn",
                    "user_href": "/profile/Ben-Heathorn"
                },
                {
                    "user_id": "Bhbb Hjnj",
                    "user_href": "/profile/Bhbb-Hjnj"
                },
                {
                    "user_id": "Brian Borean",
                    "user_href": "/profile/Brian-Borean-1"
                },
                {
                    "user_id": "Matthew Beasley",
                    "user_href": "/profile/Matthew-Beasley-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laura Kocsis",
                "href": "/profile/Laura-Kocsis-2"
            },
            "answer_text": "Star Trek, Star Wars constantly bring up BDZ and information from non canon ICS books to claim high firepower, however on screen examples of SW firepower is pitiful. Even in SW Rebels when Thrawn is bombarding a planet it only blackens it unlike ST Die is Cast, DS9 episode where in only one salvo the fleet destroy 30% of the planet. Plus in TNG episode Legacy the enterprise melts a Mile (star destroyers length) of Rock in seconds. The closest thing in SW is the asteroid scene in TESB but even then a ISD gets destroyed by an asteroid. so ship to ship Star Trek wins. in WMDs Star Trek still wins since SWs only blows up planets, in ST VOY Year of Hell they are fighting a Time machine Death Star that doesn’t destroy planets it erases them from history. In ST ENT season 5 (I think) they fight a Death Star that’s far smaller than the one in SW, in ST Wrath of Khan they are trying to recover the Genesis device. ",
            "date": "Answered August 31, 2020",
            "views": "56",
            "upvotes": "0"
        }
    ]
}