{
    "title": "Which laptop I should buy: Dell, Lenovo, or HP? - Quora",
    "tags": [
        "Lenovo Laptops",
        "Laptop Recommendations",
        "Dell Laptops",
        "HP Laptops",
        "Comparisons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nimish Nitin Gujarathi",
                "href": "/profile/Nimish-Nitin-Gujarathi"
            },
            "answer_text": "If you are stuck between choosing company instead of specs I would say Dell, anytime Dell. Even if it may cost about 5K INR more or less depending on specifications. My experience of comparison between these three tells me:  1) Dell is more flexible with qualities like cross compatibility between batteries of different models (like Latitude and Inspiron have same battery), standard charger port so you can share charger of same electrical specifications. HP and Lenovo have their own custom shaped port.  Analogy: Android with micro-USB which majority had and iPhone 5s with lightning connector which was rare in 2013. 2) Dell is more robust. Drop your HP and Lenovo and they will break like ceramic. I have seen both Dell and Lenovo fall. Screen connector of Lenovo broke and the person was forced to to painstakingly use the crippled laptop for another year somehow due to financial issues, as service center could not help and asked for a large sum to change body. Dell survived without a scratch. 3) It is fairly obvious that HP is overpricing their products & accessories (HP battery costs about 6-7K INR, Dell battery costs around 2-3K INR) and with the reliability being not commensurate to the price. Dell is reasonably priced and gives most punch for the price. 4) Dell Support is simply amazing. The person sitting behind that toll free help number knows almost everything and gets you out of any situation. 5) Almost all Dell laptops can be customized. I myself could upgrade from 4GB to 8GB RAM.  6) The performance is simply amazing. I run heavy softwares like MATLAB and Xilinx as well as high-end games like Battlefield 3 and Mafia II smoothly (Core i7 3632qm coupled with 2GB AMD Radeon HD 7730). The Full HD screen is beautiful & sharp and brings out the best quality that the media has to offer. 7) If you want to force me in telling you issues with Dell I would only speak about battery life. It has reduced from 2.5-3 hours to 1-1.5 hours in 3 years of use. Happens to all laptops though. UPDATE: A lot has changed since I wrote this answer and I made sure some points were updated as of Jan 2016. Dell however, still stays the best! ",
            "date": "Updated January 20, 2016",
            "views": "3879",
            "upvotes": " View 575 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sreenikethan I",
                    "user_href": "/profile/Sreenikethan-I"
                },
                {
                    "user_id": "Praveen Kashapogula",
                    "user_href": "/profile/Praveen-Kashapogula"
                },
                {
                    "user_id": "Tanish Varmani",
                    "user_href": "/profile/Tanish-Varmani"
                },
                {
                    "user_id": "Harish Velavali",
                    "user_href": "/profile/Harish-Velavali-3"
                },
                {
                    "user_id": "Saptarshi Koley",
                    "user_href": "/profile/Saptarshi-Koley-1"
                },
                {
                    "user_id": "Anurag Kubade",
                    "user_href": "/profile/Anurag-Kubade-2"
                },
                {
                    "user_id": "Amol Bhosale",
                    "user_href": "/profile/Amol-Bhosale-33"
                },
                {
                    "user_id": "Mike Sarmiento",
                    "user_href": "/profile/Mike-Sarmiento-6"
                },
                {
                    "user_id": "Arora Saakshi",
                    "user_href": "/profile/Arora-Saakshi"
                },
                {
                    "user_id": "Rohit Chatterjee",
                    "user_href": "/profile/Rohit-Chatterjee-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Herb Martin",
                "href": "/profile/Herb-Martin"
            },
            "answer_text": "Which laptop brand is better, HP, Dell or Lenovo?I have been using a laptop, every day, all day, most of my waking hours, for about 21 years (a portable before that for a couple.) We’ve also purchased quite a few for my wife, and a couple of employees. Between Dell and HP I don’t find a lot of quality difference and usually buy the one I can get with the most features at the lowest price THAT YEAR. Right now (last few years) I have been buying HP Envy ‘s for me (large screen, big drives) and Dell’s for my wife — light usage. UPDATE: Last purchase was a high end Dell from a year or so back and I’m delighted with it. Several employers have issued me Lenovo’s over the years and I would NOT buy one of those for half the price — never cared for a single one of them. UPDATE: They gave me a new one and I’m doing my best to use it remotely because it is so awful. Terrible keyboard. Who moves the generally standard positions of keys around gratuitiously? I also like Sony. By the way, the main problem I’ve had with such heavy uses of my laptops is breaking the hinges and losing the video due to that. One of the main annoyances is bad keyboard layouts. Some idiot at HP thought it would be fun to make the Function keys into Hardware keys BY DEFAULT — every time there’s a BIOS upgrade it requires entering the BIOS settings and changing it back to the normal Function keys we’ve had for 30+ years. Another idiot at Dell thought multi-media keys made more sense on the top of the numeric pad than the usual page up/down, home end. That requires using AutoHotKey to fix (most easily.) To put a point on Lenova, the main problem is they swapped the BlueFunction and Control keys which as a touch typist ruins my work rhythm. UPDATE: I can fix the Dell, HP, and Sony problems with AutoHotKey macros but the BlueFunction keys is hardware and cannot be scripted so I built my own customer keyboard and touchpad for the stupid new work computer. Both are really irritating to find on your new PC when it arrives. (I buy most from Amazon or eBay.) ",
            "date": "Updated October 21, 2020",
            "views": "102",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aijaz Siddique",
                    "user_href": "/profile/Aijaz-Siddique"
                },
                {
                    "user_id": "Susan Samuel",
                    "user_href": "/profile/Susan-Samuel"
                }
            ]
        }
    ]
}