{
    "title": "Which limitations do you have when you are deaf from one ear? - Quora",
    "tags": [
        "Limitations",
        "Hearing Loss",
        "Deafness (physiological condition)",
        "Ears",
        "Hearing"
    ],
    "response": [
        {
            "author_info": {
                "name": "JoAnne Kelly",
                "href": "/profile/JoAnne-Kelly-24"
            },
            "answer_text": "I am partially deaf in one ear from the mucus membranes in my eustachian tube chronically being swollen. When it first occurred, I was dizzy, my balance was off. As I became accustomed to that, I also experienced tinnitus. This also is chronic but some days I can hardly hear it and other days it is quite loud. The worst part of this is being able to determine the location of noise. I have to turn my head to find the location. I live in a country where traffic is very chaotic and people rarely follow what few driving rules there are. So, it can be dangerous. Sometimes I can’t tell if a vehicle is coming towards me or driving away from me so I need to constantly be looking both ahead and behind me when walking on the road or driving on the roads. Also, leopards live in the forest up behind me, so at night I need to be acutely aware of the location of animal sounds. Outside of that I am grateful that I do still hear in that ear, and hearing tests I’ve taken report that I still have very good hearing. ",
            "date": "Answered December 5, 2019",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Julio C Castro",
                    "user_href": "/profile/Julio-C-Castro-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Dudley",
                "href": "/profile/Paul-Dudley-9"
            },
            "answer_text": "You have more difficulty in locating the source of sounds. You have difficulty hearing quiet sounds close to the deafer ear. You may have more difficulty separating speech from the “background” noises you don’t want to hear. You can’t get a commercial pilot’s licence or (where I live at least) join the police force or the army. You don’t have to be altogether deaf in one ear, just a bit will do, to experience these limitations. Be wary of being talked into wearing a hearing aid. Unless you have a particular need to hear from your deafer ear - a taxi driver, say - one good ear will get you by, and a hearing aid will just annoy you. ",
            "date": "Answered December 8, 2019",
            "views": "21",
            "upvotes": "0"
        }
    ]
}