{
    "title": "Which is the best general purpose OS for Raspberry Pi? Ubuntu Mate or Raspbian? - Quora",
    "tags": [
        "Raspbian",
        "Debian (GNU/Linux)",
        "Raspberry Pi",
        "Ubuntu (operating system)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Bailey",
                "href": "/profile/Chris-Bailey-364"
            },
            "answer_text": "I’m sorry, but I have to disagree with both former answer. Since obviously, NONE of you three get the point. First of all, both are Linux distributions. Raspbian is based on Debian. Funny thing: Ubuntu is actually a derivative of Debian. So, what’s the point? The point of Linux is actually, that there is no “general purpose”. The idea of Linux is, to customize it to your own needs. The reason for the different distributions is actually, the packages that come with it. The basic configuration and purpose. That’s the whole point. Aside from different package management. The main difference between the distributions is different package sets for different purposes!!! Also I think, the “community” in this case is no valid point. Just look at the Ubuntu community and support pages. And you think, that’s on the same level as Debian or Debian adjusted for ARM chipsets called Raspbian is? I doubt it. Actually, I’d bet there are barely any differences. Both use the same package management. And both need to adjust the packages for ARM. The DEFAULT packages. LINUX … Basically, you choose between LXDE and Mate. And both are available for both! Also, did any of you actually go into the background of the mentioned distributions? For years Google used Ubuntu as default Linux distribution for their employees and supported development and now switched to it’s parent, Debian. Next to that, Google is a partner of the Raspberry vendors at this point! Just food for thought. Granted, one point you could hold against Ubuntu is, they are tilting towards commercial drive vs. community drive for debian. Which has both, advantages and disadvantages. Just like everything else in life. For example, Ubuntu clearly has the better hardware support than Debian. So, first of all, which one is “better” depends on your own skills and experience and your needs. I for example used SuSE 20 years ago (of course not on a Pi) and at the beginning of my Linux path. Which at that time made sense to me. A few years back I tested more than 20 distributions. I decided to use Ubuntu. Because it’s a GREAT general purpose distribution and gives you all the options to go from beginner to advanced and do your thing. The reason why Debian, despite being the more experienced and predecessor (plus community driven, which I basically support), failed that test was, because it failed to even recognize my displays. On both, my notebook AND my PC. That’s really stupid! Same goes for bad network support and accordingly, bad documentation to get my Internet connection up. A problem even Linus Torvalds has pointed out. In my tests, Ubuntu clearly won the race before all. Not even getting the basics right, is a really bad sign for an experienced distributions like Debian. So, there is no suprise. Ubuntu did it all. And MATE I might add. Because Unity gave me grief too. The performance was there, the documentation, the options and packages, suitable for the daily routine, as well as going deeper … On the other hand, is it really a surprising, that for a low cost development board, a community driven free distribution is used as default, instead of one with a slightly more commercial tendency? Again: a COMMUNITY DRIVEN distribution for a DEVELOPMENT board? Feel free to think nerds here. Does not exactly sound like a coincidence, huh? Now, are you a Linux nerd? Given the question, one might assume, it doesn’t look like it. But as I continued to grow and learn, I actually went on to Arch Linux. Although I still have Ubuntu on 2 of my devices and sometimes use it on my PC, this is the one I use most today. Meaning, I also use Arch on my 7 active headless Raspberry servers, as well as 2 headless Banana servers and my media player. And here is another hint for you: whatever you call general purpose, the Raspberry Pi is NOT A full-featured desktop COMPUTER. It’s a development board. Heck, with 1GB it has less RAM than many cell phones and tablets today. That might be an important hint. Because it seem, people are often mixing that up and think it’s a media center and what not. In fact, the same rules that were true for computers before, hold true for those devices too. Graphics and media need a lot of processing power. Processing power that most certainly is NOT in these devices and the idea of them. So, you put your Ubuntu or Debian on it. Basic stuff. A more or less complex Desktop environment. Now suddenly, 200 or 300 Megs or RAM are gone, next to like 256 or 320MB of memory reserved for graphics and your Videos and you think, next to it you just open your Chromium and Youtube and give it a go? Think again. Because your Raspberry did already quit half way through. And while the right choice of distribution and WINDOW MANAGER might help you out partly here, the problem is not your distribution choice at all. It’s your way of thinking. Or would it be possible to just recompile most applications for ARM, given you know how to do it? So, how much load does some default desktop environment like Mate or some modified LXDE put on the device? Does that really make sense? What’s your purpose? Or would it make sense to take a few steps back. To use something basic and give it something resource friendly like Openbox. Maybe along with Tint2? And here we are … starting a real LINUX conversation. If you want the “best” for YOUR PURPOSE … take your time and start testing. That’s actually the whole point of the board! I would give you a hint. But I can’t. Because it’s all personal and opinion. The first question is … what’s your purpose? As I said before: before I decided for a distribution, I tested more than 20 of them. To find out which one I like. Which one performs the way I want. Which one offers the support I need. Which one comes with the packages I need. And just to have said it: there are different statements in regards to the number of packages available for the different Linux distributions. But I think it’s save to say, no matter if you choose Ubuntu, Debian or Arch, you will have more than 25,000 packages available in the according repos. Not counting software that is available and compatible, but not in the official repos. Maybe not for ARM architecture. But what difference does it make, if you choose Ubuntu or Debian? Architecture is the same. Package management is the same. So, dealer’s choice, really ;) Again: the choice is yours. I don’t use mainstream. And for me, everything is working great with Arch. IRC server, DNS server, cloud server, media player, you name it. Is Arch for you? Well, that’s for you to decide. Same for Ubuntu. Same for Raspbian (Debian). P.S.: Wolf Donat, did you ever find out, what distro Mint is based on? Funny thing, really. You might wanna check that. Oh and, I also urge you to read in the page you’ve given the very link to. The page actually says, what distribution SolydXK is derived from. And it does not say Mint. You can also find the information on DistroWatch and WikiPedia. But the confusion is not suprising. Given, we are back to the beginning of this answer. ",
            "date": "Updated October 31, 2020",
            "views": "244",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deepa Prasad",
                    "user_href": "/profile/Deepa-Prasad-34"
                },
                {
                    "user_id": "Will Smith",
                    "user_href": "/profile/Will-Smith-2124"
                },
                {
                    "user_id": "Mukund Rajamannar",
                    "user_href": "/profile/Mukund-Rajamannar"
                },
                {
                    "user_id": "Elfat Esati",
                    "user_href": "/profile/Elfat-Esati-1"
                },
                {
                    "user_id": "Henrique Martins",
                    "user_href": "/profile/Henrique-Martins-68"
                },
                {
                    "user_id": "Pranav Mittal",
                    "user_href": "/profile/Pranav-Mittal-7"
                },
                {
                    "user_id": "Pravin Gondhale",
                    "user_href": "/profile/Pravin-Gondhale"
                },
                {
                    "user_id": "Sudipta Ghosh",
                    "user_href": "/profile/Sudipta-Ghosh-230"
                },
                {
                    "user_id": "Jose Aviles",
                    "user_href": "/profile/Jose-Aviles-7"
                },
                {
                    "user_id": "Karthick S",
                    "user_href": "/profile/Karthick-S-153"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andre Casado",
                "href": "/profile/Andre-Casado"
            },
            "answer_text": "“Best General Purpose” is subjective. General purpose could mean a lot of things. IoT for example? Best general purpose OS for IoT would be perhaps be Ubuntu Core due to the sheer amount of Ubuntu relevant data on the internet to help anyone trying to get started. Best general purpose linux desktop distro would be Raspbian for the sheer fact that it is the most actively supported by the community and makers of Raspberries. A second best for the desktop experience would be custom Ubuntu Mate for Raspberry. Reason it is second best is because it isn’t as actively supported by the Raspberry community. Its performance won’t be as good as Raspbian’s. As far as I know, Mint doesn’t work on Raspberries. ",
            "date": "Answered May 11, 2018",
            "views": "101",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrea Prencisvalle",
                    "user_href": "/profile/Andrea-Prencisvalle"
                },
                {
                    "user_id": "Michael Li",
                    "user_href": "/profile/Michael-Li-1"
                }
            ]
        }
    ]
}