{
    "title": "Which is better, using a credit card or using a debit card? - Quora",
    "tags": [
        "Debit Cards"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pankaj Yadav",
                "href": "/profile/Pankaj-Yadav-453"
            },
            "answer_text": "You probably have at least one credit card and one debit card in your wallet. The convenience and protection that they offer are hard to beat in many instances, but they have important differences that could substantially impact your pocketbook. Here's how to choose which one to use when you need to swipe the plastic. They Look Alike, But They're Different Credit and debit cards typically look almost identical, with 16-digit card numbers,expiration dates and PIN codes. But that's where the similarity ends. Debit Card allow bank customers to spend money by drawing on funds that they deposited with the card provider. Credit Card allow consumers to borrow money from the card Issuer up to a certain limit in order to purchase items or withdraw cash. Each card type has four main categories: Credit cards are issued as either standard cards, which simply extend a line of credit to their users; rewards card, which offer cash back, travel points or other benefits to customers; secured credit cards, which require an initial cash deposit that is held by the issuer as collateral; and charge cards, which have no preset spending limit but often do not allow unpaid balances to carry over from month to month. Credit cards generally work with your signature. Not so for debit cards. Some debit cards require using a PIN for every transaction, while others allow the customer to use a signature instead. There are also two types of debit cards that do not require the customer to have a checking or saving account. Electronic benefit transfer are issued by state and federal agencies to allow qualifying users to use their benefits to make purchases. Prepaid debit cards give non-bank customers a way to make electronic purchases up to the amount that was paid in. There are many reasons why it makes sense to use one type of card over the other. Advantage: Debit Cards Fees. Frugal consumers prefer to use debit cards because they usually have few or no fees of any kind, unless users spend more than they have in their account and incur an overdraft fee. A 2006 report by TNS Financial Services Consumer Credit Card Program revealed that about three-fifths of consumers who used debit cards did so because it felt more like using “real money.” The no-fee advantage doesn't hold for prepaid debit cards, which frequently charge activation and usage fees, among other costs. By contrast, credit cards generally charge annual fees, over-limit fees, late-payment fees and a plethora of other fees and penalties, in addition to monthly interest on the card's outstanding balance. Controlling spending. A debit card draws on money the user already has. Compulsive spenders would do well to use debit cards and avoid the temptation of credit; retailers know people usually spend more using credit cards than if they were paying cash. Interest and other charges paid by those who don't pay off their balances fund many of the user benefits people get from credit card companies (see below). Advantage: Credit Cards Rewards. Credit card users can reap cash, discounts, travel points and many other perks unavailable to debit card holders by using rewards cards. Smart consumers who can pay off their cards in full and on time every month can profit substantially by running their monthly purchases and bills through them. Credit Scores. Credit card use is also reflected on the customer’s credit report, which allows responsible spenders to raise their scores with a history of timely payments. Warranties. Credit cards can also provide additional warranties or insurance for items purchased that may exceed those of the retailer. If an item bought with a credit card becomes defective after the manufacturer’s warranty has expired, for example, it's worth checking with the card company to see if it will provide coverage. Legal protection. These are also notably different, with credit cards offering more security. Liability for lost or stolen cards. Credit cards still offer much greater protection in most cases for those whose cards are lost or stolen. As long as the customer reports the loss or theft in a timely manner, his/her maximum liability for purchases made after the card disappeared is $50. The Electronic Funds Transfer Act gives debit card customers the same protection from loss or theft – but only if the customer reports it within 48 hours of discovery. After 48 hours, the customer’s liability rises to $500; after 60 days there is no limit. Disputing transactions. The Fair Credit Billing Act allows credit card users to dispute unauthorized purchases or purchases of goods that are damaged or lost during shipping. But if the item was bought with a debit card, it cannot be reversed unless the merchant is willing to do so. What's more, debit card victims don't get their refund until due process has been completed. Credit card holders, on the other hand, are not assessed the fraudulent charges made in their names. While some credit and debit card providers offer zero-liability protection to their customers, the law is much more forgiving for credit card holders. Car rentals. If you need to rent a car, most credit cards provide some sort of waiver for collisions. Even if you want to use a debit card, many car rental agencies require customers to provide credit card information as a backup. The only way out for a customer may be allowing the rental agency to put a hold of perhaps a few hundred dollars on his or her bank-account debit card as a form of Surety deposit. Thanks ",
            "date": "Answered July 24, 2017",
            "views": "14",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aakash Kumar",
                    "user_href": "/profile/Aakash-Kumar-1154"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Koletsky",
                "href": "/profile/Barry-Koletsky"
            },
            "answer_text": "Full disclosure… this is BARRY'S PERSONAL OPINION and not that of my employer. Really, I'd have to say that the best thing is that which is best for your personal circumstances and preferences. Also, a factor may be your geographic location and/or personal financial situation. Credit is not available to all people, nor is it desirable in all cases versus debit. Many factors can be ni play when determining whether one is better than the other. I used to prefer debit. I liked the idea of having no additional financial responsibilities for those purchases made via my debit card. But over time my personal preference has changed, particularly with the promise of rewards for using my credit card rather than my debit card. I currently have a particular Mastercard credit card that offers me 2% cash back for ALL of my purchases. So now, ALMOST EVERY purchase we make is put on this particular card. Monthly bills, restaurant meals, gasoline/petrol, auto and home owners insurance, groceries, medical expenses, travel, whatever we can get away with…. I carry very little cash anymore, VERY LITTLE. The only two things that never go on the credit card are 1) charitable donations to our church because I want 100% of the funds to go to the church, without card processing fees, 2) yearly ad valorem property taxes for our home, because our taxing authority charges us a hefty fee (over US $300.00) for the privelage, as opposed to a negligible $1.50 convenience fee for paying online via our checking/demand account. Needless to say, we rack up some substantial credit card rewards from our card issuer for simply spending money we would have spent anyway. Getting paid to spend is a good deal in my opinion! And, extended warranty benefits from our card issuer apply to our purchases, as well as additional insurance benefits when renting a vehicle. I am a very disciplined person and so is my wife. We spend responsibly and we do pay off our card every month. So in a sense, we still behave with our credit card the same way as we did with or debit card…. Only spend it if you have it (unless an urgent need arises, like medical bills, family needs, new video game system + the top 20 games + all accessories under the sun :-) OK those last few are a joke….right? ) So the better one is the one that fits your lifestyle, makes you happy/comfortable and is readily available and usable in your day to day living. Remember, whether debit or credit, Mastercard is priceless! ",
            "date": "Answered December 2, 2018",
            "views": "787",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Mills",
                    "user_href": "/profile/Sarah-Mills-189"
                }
            ]
        }
    ]
}