{
    "title": "Which are the best smartphones between 10k to 15k? - Quora",
    "tags": [
        "Mobile Phones",
        "Economics of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Somya Tiwari",
                "href": "/profile/Somya-Tiwari-3"
            },
            "answer_text": "The best smartphone in the range of 10,000 INR to 15,000 INR is a tough question to answer as we cannot find the best one in this price range and each one have its own sets of flaws. Let me help you with some of the best smartphones in this price range LeEco Le 2: this is one of the best handset which we can find in this price range, I have personally used the smartphone and it is a really good daily driver, the phone doesn’t have heating issues like the Xiaomi’s RN3 and phones around this price range.CREO Mark 1: this is another great handset that we can find in this price range currently as it is having some offer of around 6000 INR off which makes the price of the phone top 13,999 INR from 19,999 INR. The phone is the cheepest QHD smartphone that you can get, the phone does have occasional in-UI Lag but overall the phone is a rocking piece. [Offer was valid while writing the answer. Date: 7/7/16]Moto G4 Plus: the moto G4 is another handset that we can find in this price range, the phone is a bang for the buck from a reputed company and the phone does have a really good in hand feel and a great camera, but does lacks in gaming performance from the above two smartphones but you will have to sacrifice something for getting a Brand name.Above smartphones are the phones that i found to be great b/w the price range of 10,000 to 15,000 so do have a look at other’s answer too if you can get a better option there !! :) Note:- Kindly use Google for searching for Specifications and the best site for the best specifications are GSM phone reviews, news, opinions, votes, manuals and more...If you liked my Answer then i would appreciate if you can give me a Upvote, it won’t harm you in any manner.You can follow my website STJS Gadgets to get the latest from around the Tech World.",
            "date": "Answered July 6, 2016",
            "views": "198",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Salman Siddiqui",
                "href": "/profile/Salman-Siddiqui-327"
            },
            "answer_text": "Top smartphone brands like Samsung, Vivo, OPPO and Xiaomi have released smartphones with advanced features at affordable prices. The competition between smartphone brands is only getting more intense, and to capture a larger market share, the smartphone manufacturing companies have come out with models that are affordable, look good and have top-of-the-line features. Our top 5 picks for the best smartphones under 15,000 INR include: Xiaomi Redmi Note 8 Priced at Rs. 11,999, this model manufactured by Xiaomi is one of the best smartphones under 15,000 INR. It has a 48+8+2+2MP quad-rear camera setup, with a 13MP dual front camera. The phone’s performance has been rated as excellent by critics, and those who purchased the smartphone. 2. Samsung Galaxy M21  The Samsung Galaxy M21 smartphone has an octa-core processor along with a super AMOLED display. Costing just Rs. 13,999, the phone comes with a long battery life and 48+8+5MP triple-rear camera setup. 3. Realme 6  Priced moderately at Rs. 13,999, this phone has turned heads, and has been a massive hit with the younger audience due to its features. It has a 64+8+2+2MP quad-rear camera setup, along with a 16MP front camera. The phone also has a good battery life, making it the perfect gaming device. 4. Vivo Z1 Pro  The key specifications for this model include the Octa core processor running on Snapdragon 712 SoC, offering the consumers an impressive performance. It is priced at Rs. 13,990, and comes with a long battery life. 5. OPPO A31  This smartphone runs on the new MediaTek Helio P35 with a 4GB RAM. It was released earlier this year, and has taken the market by storm. The phone sports a 12+2+2MP triple-rear camera setup, and a 8MP front camera for taking those perfect selfies. So these are some of the best smartphones between 10k to 15k. You can buy some of these best smartphone under 15000. These are the some of the best phones under this price segment. All these above phones are nice in their price range. So go ahead and shop for your favorite phone. ",
            "date": "Answered June 26, 2020",
            "views": "115",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pranav Singh",
                    "user_href": "/profile/Pranav-Singh-704"
                },
                {
                    "user_id": "John Peter",
                    "user_href": "/profile/John-Peter-173"
                }
            ]
        }
    ]
}