{
    "title": "Which is the best place for spiritual awareness in India? - Quora",
    "tags": [
        "Spiritual Teachers",
        "Spirituality of Everyday Life",
        "Enlightenment (spiritual)",
        "Self-Awareness",
        "Meditation",
        "Visiting and Travel in India",
        "Spirituality",
        "Visiting and Travel",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nirguru Nirvanam",
                "href": "/profile/Nirguru-Nirvanam"
            },
            "answer_text": "Can you tell one place in the world where you cannot make money, where you cannot become rich? You will find there are Indians who went to Africa and became rich! There are rich guys even in Somalia! People strike Oil in dry lifeless Deserts and become the billionaire Arab Sheiks! If you cannot Tie Materialism to a place, why are you tying Spirituality to a Place? There is only one place - that busy, noisy, polluted city you are in, and that too, in your room, and in your body, inside your self, deep in your soul. Don’t go anywhere else to search it, you will finally find it right where you are right now in the end, any travelling will simply kill more of your time. I Am Enlightened. Questions and Curses are welcome. Luv. ",
            "date": "Answered October 13, 2019",
            "views": "169",
            "upvotes": " Answer requested by Kamal Dev",
            "upvoters": [
                {
                    "user_id": "Saurav Kumar",
                    "user_href": "/profile/Saurav-Kumar-1094"
                },
                {
                    "user_id": "Vaibhav Singh",
                    "user_href": "/profile/Vaibhav-Singh-48"
                },
                {
                    "user_id": "Mohd Azaz",
                    "user_href": "/profile/Mohd-Azaz-3"
                },
                {
                    "user_id": "Mukesh Nirala",
                    "user_href": "/profile/Mukesh-Nirala-5"
                },
                {
                    "user_id": "Kewal Singh",
                    "user_href": "/profile/Kewal-Singh-10"
                },
                {
                    "user_id": "Aaditya Narayan",
                    "user_href": "/profile/Aaditya-Narayan-1"
                },
                {
                    "user_id": "Kumar Kk",
                    "user_href": "/profile/Kumar-Kk-29"
                },
                {
                    "user_id": "Anoushka Jain",
                    "user_href": "/profile/Anoushka-Jain-4"
                },
                {
                    "user_id": "Arti Ahuja",
                    "user_href": "/profile/Arti-Ahuja-6"
                },
                {
                    "user_id": "Hiba Khan",
                    "user_href": "/profile/Hiba-Khan-186"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keshav Mehrotra",
                "href": "/profile/केशव-मेहरोत्रा-Keshav-Mehrotra-1"
            },
            "answer_text": "There is only one I know about, and that is PrashantAdvait Foundation (Acharya Prashant). The reason I am telling this as 'genuine' because it is the only organization where you will never be sold ugliness in the name of Truth or Spirituality. Here, no one will give you any talism or omen stating that it will give you liberation. No such ugliness in the name of Spirituality! Here, you will be served with nothing less than Truth. And you will also be scolded if you try to opt for ugliness. And that is the highest form of Love you can ever get. And to accept such Love requires a lot of courage! This is for people who want really the Truth and nothing else. Do you have the courage? Explore more: आचार्य प्रशान्त - Acharya PrashantAcharya PrashantPreviously answered: Keshav Mehrotra (केशव मेहरोत्रा)'s answer to Which are the genuine spiritual organisations in India? ",
            "date": "Answered December 26, 2019",
            "views": "93",
            "upvotes": " View 14 Upvoters"
        }
    ]
}