{
    "title": "Which is a more worthwhile field to learn, digital marketing or programming? - Quora",
    "tags": [
        "Learning Digital Marketing",
        "Beginning Computer Programming Advice",
        "Digital Marketing",
        "Learning New Things",
        "Learning",
        "Learning to Program",
        "Marketing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Baron Boyscout",
                "href": "/profile/Baron-Boyscout"
            },
            "answer_text": "I must say this is a very good question and suggests that you are a very smart and forward thinking young person. In response to your question, they are both worthwhile fields, and you should pursue them both. By learning both you can gain the knowledge of building websites, apps, or other programs, and then have the knowledge of how to market them most effectively. Since most businesses require both skills these days, the decision to pursue both is a solid decision. Having said that, if I had to choose one over the other, I would choose digital marketing. I say that because digital marketing is the life's blood of many companies. You can have a great website or app as I have had but if you don't have a solid marketing system, your website or app will flounder and eventually decline in popularity into useless code even though it looks good, functions well, and provides great content. Whatever your decision, stay focused, disciplined, and persist until the goal has been achieved. ",
            "date": "Answered July 14, 2020",
            "views": "11",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Another World",
                    "user_href": "/profile/Another-World-38"
                },
                {
                    "user_id": "Thota Yeshwant",
                    "user_href": "/profile/Thota-Yeshwant"
                },
                {
                    "user_id": "Stanley Shetty",
                    "user_href": "/profile/Stanley-Shetty"
                },
                {
                    "user_id": "Siam Ahmed",
                    "user_href": "/profile/Siam-Ahmed-78"
                },
                {
                    "user_id": "Mohammed Fawaz Nawaz",
                    "user_href": "/profile/Mohammed-Fawaz-Nawaz"
                },
                {
                    "user_id": "Dilshod Rizayev",
                    "user_href": "/profile/Dilshod-Rizayev"
                },
                {
                    "user_id": "Shruti Bhandari",
                    "user_href": "/profile/Shruti-Bhandari-51"
                }
            ]
        },
        {
            "author_info": {
                "name": "June M. Archer",
                "href": "/profile/June-M-Archer"
            },
            "answer_text": "Before you choose, it would be beneficial for you to understand where YOUR interests lie. What kind of work interests you? What are your skills - good and under developed. Take some personality and skills typing tests to uncover where you as a person will be more fulfilled and satisfied. Do not let a course of study dictate your future. Next, think about what a job search would look like considering the following: What kind of companies do you get excited about? What industries are they in and how are they structured? Are they marketing/product, consumer or service driven? This will help you figure out what kind of company to look for that suits your interests and skills. These are some steps to consider when looking for a position: You need a killer resume, LinkedIn profile, good social media profiles and a well constructed \"30 second commercial\" for yourself. These are some of the tools you need to interact with people about your opportunity. Create a PLAN including... Make a list of people and tell everyone you are looking for ad internships and/or jobs. Share with professors, business contacts(if you have), friends, and family.Tap into your school's career services - how might they help you.Make a list of all of the companies you are interested in.Contact people you know or introduce yourself to people you do not know. Research contacts on LinkedIn and Google. This is where you use your 30 SECOND COMMERCIAL. DO NOT ASK FOR A JOB. Tell them about yourself, compliment them as a knowledgeable source and ask if you can get their perspective on what it is like to work at XYZ company. Tell them that you are exploring jobs and internships and you would appreciate their insights.Join industry associations and organizations.Go to conferences and events to meet people, make connections and elevate your profile as an industry newcomer.Post your resume on sites such as search firms, job boards, and industry association boards.Subscribe to industry newsletters and forums to stay abreast of news and openings.The best search strategy is first making a plan for your search. Then, interacting with PEOPLE about what you want to do as often as possible. Making a plan will keep you on track and help you see your progress. This is answer asks you to think ahead and consider the implications of your choice. Have Fun and Good Luck! ",
            "date": "Answered April 19, 2018",
            "views": "23",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Murthy Tejaswini",
                    "user_href": "/profile/Murthy-Tejaswini"
                },
                {
                    "user_id": "Gernot Jemens",
                    "user_href": "/profile/Gernot-Jemens"
                }
            ]
        }
    ]
}