{
    "title": "Which Android version is best? - Androids - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Niaa Neil",
                "href": "/profile/Niaa-Neil"
            },
            "answer_text": "If I am talking about the Which android version then Android 10 is the best version Nowadays, But Android 11 is the upcoming version with the so many feathers so, must upgrade it. I explain to you what are the feathers upcoming for the latest Android version 11. #1:Message bubbles and 'priority' conversations #2:Redesigned notifications #3:New Power Menu with smart home controls #4:New Media playback widget #5:Resizable picture-in-picture window #6:Screen recording #7:Smart apps suggestion #8:Voice access - controlling your phone with your voice #9:Dark mode scheduling So, there are so many other features also and I suggested you always update your mobile phone with the new features It helps you to for security purposes and always your cellphone lives longer and smoother. ",
            "date": "October 13, 2020",
            "views": "63",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Subhasis Dutta Roy",
                    "user_href": "/profile/Subhasis-Dutta-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samir Shukla",
                "href": "/profile/Samir-Shukla-43"
            },
            "answer_text": "Android 10 is the best version of of Android because this is very clear and more functions of other Android versions so you can use Android 10 in new smartphone because now all apps are heavy and and Android 10 is running smoothly and clearly so you can upgrade your Android version in Android 10 I hope you are satisfied with this answer please support this answer and share with your friends and follow us on quera ",
            "date": "October 31, 2020",
            "views": "4",
            "upvotes": " ",
            "upvoters": [
                {
                    "user_id": "Subhasis Dutta Roy",
                    "user_href": "/profile/Subhasis-Dutta-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mb Devada",
                "href": "/profile/Mb-Devada"
            },
            "answer_text": "Android 9,10 is enough for now ",
            "date": "September 26, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter "
        }
    ]
}