{
    "title": "Which politician would you like to have as your class teacher? - Quora",
    "tags": [
        "Teachers",
        "Politicians and Government Leaders",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samavedula Venkata Rama Sastry",
                "href": "/profile/Samavedula-Venkata-Rama-Sastry"
            },
            "answer_text": "So One fine day my father joined me in a school. I am totally a confused person.The School is said to have a long history and probably established in 1885 and named as INC school. When I entered the assembly is going on and a pledge is being taken. I could only hear the last sentence “So I solemnly pledge to support the family in any circumstance and make the dynasty in power for the next century” So my first period is English. Shashi Tharoor sir came and introduced himself and started class.  He explained about complex words in English ranging from 20 to 26 letters. Being a boy of 12 years I could not understand. And suddenly he stopped English class and explaining the future of India if certain party comes to power.He said that all fundamental rights will wiped out and a dictator ship emerges. I am the person who could not control my tongue.Immediately I rose and said. “that means emergency situation will prevail as in 1975–77.” I do not know why he got so much angry on me and meanwhile the bell rang and he gone away. My bench mate who is sitting beside me murmured. “he will teach about HIndu Pakistan tomorrow”. So next class is mathematics. MMS sir came and introduced. He explained how 5% in 2004 to 2014 it bigger than 7 to 8% after 2104.  He made some calculations and used the words inflation and economic growth etc. Due to my tender age I could not understand the meaning of it. Mostly i was dozing in the class. Meanwhile the Principal of the school sneaked in.He is young person of about 50 and wanted to know whether all are happily living in this country. In unison all have said in one word that we do. I do not know why he Kept his in angry mood and swiftly walked away. Next class is Telugu, our second language.  A bearded old man taken the class and introduced himself as CBN and told that he belongs to another school and came hear to take class on temporary basis. So he told how he developed the school and made it one of the best, even though the management has not provided funds. My curiosity taken over me and I immediately asked”Sir. How to develop a school without funds. Because I want to develop my house but I have no funds”. I do not know why he got so angry and he left in the middle of the class. My bench mate again whispered”you are lucky.Had you taken Bengali as second language, the teacher would have killed you” Next class is history.He is Randeep sir. His surname some what resembles ‘surgewala” or some thing. He kept saying that one family is responsible for independence and growth of the nation. In the rule of other than the family, all the bad things have happened in this country.Again my curiosity overtaken me “But sir. according to statistics, more bad things happened during the family rule” he said that the books were written wrongly. I was confused which books are correct and Which books are wrong. Again the school principal sneaked in and asked to be careful about the “Watchman” of the school as he is having habit of stealing. Again my curiosity has overtaken me. “Sir, our present watchman is good. But police has taken away our previous two watch men on theft charges. You are talking about whom” Again the principal got angry and left the room. So next we have cricket coaching class. A sardarji arrived and instead of teaching cricket he started teaching international politics and how our nation is starting war while neighbor country is asking for peace. Again damn my curiosity”Sir, the neighbor is always starting war” then he got angry and reported the matter to principal, who already having anger against me given TC and sent me out of school. I was happy but more confused than my entry period and requested my father to search for another school. So the answer to the question is no politician should be class teachers. O.K. that is the end of my first high school experience. Oh.I forgot to tell my name. My name is I.V. (Indian Voter) JAI HIND ",
            "date": "Answered March 17, 2019",
            "views": "16",
            "upvotes": " View 285 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gali Niranjan Rao",
                    "user_href": "/profile/Gali-Niranjan-Rao"
                },
                {
                    "user_id": "Raja Pattanur",
                    "user_href": "/profile/Raja-Pattanur"
                },
                {
                    "user_id": "Praveen",
                    "user_href": "/profile/Praveen-898"
                },
                {
                    "user_id": "Parut KN",
                    "user_href": "/profile/Parut-KN"
                },
                {
                    "user_id": "Satyendra Kumar Yadav (सत्येन्र्द कुमार यादव)",
                    "user_href": "/profile/Satyendra-Kumar-Yadav-सत्येन्र्द-कुमार-यादव"
                },
                {
                    "user_id": "Dimple Chauhan",
                    "user_href": "/profile/Dimple-Chauhan-10"
                },
                {
                    "user_id": "Kalaveni Sridhar",
                    "user_href": "/profile/Kalaveni-Sridhar"
                },
                {
                    "user_id": "Rameshchandra Patnaik",
                    "user_href": "/profile/Rameshchandra-Patnaik"
                },
                {
                    "user_id": "Sai Kushal Setty",
                    "user_href": "/profile/Sai-Kushal-Setty"
                },
                {
                    "user_id": "Sunil Shastry",
                    "user_href": "/profile/Sunil-Shastry-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kandalam Ravitheja",
                "href": "/profile/Kandalam-Ravitheja"
            },
            "answer_text": "Good question. I don't like the idea of class teacher or one particular subject in general since every subject is beautiful in its own way. I would like to have these politicians I am going to mention as my teachers in school to increase my knowledge in their respective subjects. 1) Mr. Undavalli Aruna Kumar for teaching me political science . 2) Dr. Jayaprakash Narayan,IAS for world history (No one knows better than him) or else the same man to teach me biology. 3)Mr. KTR (TELANGANA IT MINISTER) or else Mr. Shashi Taroor to teach me English. 4)Dr. Chidambaram or else Dr. Manmohan Singh for Economics. 5)Mr. P.V. Narsimha Rao( Ex- PM ) for any language .He can speak around 10 languages. 6)Mr. Venkayya Naidu (Vice president of India and Chair person of Rajya Sabha)to teach me orating skills and general knowledge. 7)Dr. A. P. J Abdul Kalam for teaching me physics with emphasis on applications of Classical mechanics in rocket science and heat and mass transfer. 8) Sachin Tendulkar as my cricket coach or PET ( he was a member of Rajya Sabha,so I included him) To coordinate all these teachers, I would like to have Mr. Chandra Babu Naidu( chief minister of Andhrapradesh) or else Mr. Piyush Goyal as principal of school. ",
            "date": "Answered March 16, 2019",
            "views": "265",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mithu Rawat",
                    "user_href": "/profile/Mithu-Rawat"
                },
                {
                    "user_id": "Priya Prishni",
                    "user_href": "/profile/Priya-Prishni"
                }
            ]
        }
    ]
}