{
    "title": "Which earlier inventions made the iPhone possible, and how? - Quora",
    "tags": [
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Merchant",
                "href": "/profile/Brian-Merchant"
            },
            "answer_text": "So, this will be a quick and very incomplete list, but just to get the ball rolling: -Multitouch, the touchscreen technology that had been incubating for over two decades, at places as diverse as CERN, the University of Toronto, and a startup bent on helping those with hand disabilities use computers, by the time the iPhone began development. -The ARM processor, the low-energy, efficient, and powerful chip architecture that provides the iPhone with its brain. Formerly the Acorn RISC Machine, its first iteration was developed in the UK by Sophie Wilson and Steve Furber, and it has gone on to become the most ubiquitous chip in the world. -Core Animation, a technology largely only known amongst developers, is the software that allows those developers to deploy fluid, top tier animations with their apps, and its why the early animations on the iPhone look so good. -Sensors! To name a few: Accelerometers, gyroscopes, and proximity sensors all are necessary to allow the iPhone to understand its physical location and relationship to the user. -Lithium ion batteries. The iPhone wouldn’t be much good without a charge, and a slender, long-lasting battery makes that possible. Fun fact: The first one was invented at a lab run by Exxon, the oil giant, which at the time, was trying to diversify its portfolio. -Gorilla Glass. The iPhone needed scratchproof glass, and there was nothing on the market at the time that could deliver. Enter Corning, and its half-a-century-old Project Muscle, which had yielded super strong glass no one could figure out a use for in its hey day. Apple gladly took it off their hands. -GPS. Maybe an obvious one, but you can’t have Google Maps or location services without it. And this is really just scratching the surface, too! Love this question, though—it’s largely what the book is all about. ",
            "date": "Answered July 28, 2017",
            "views": "2",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jes Conradsen",
                    "user_href": "/profile/Jes-Conradsen"
                },
                {
                    "user_id": "V",
                    "user_href": "/profile/V-661"
                },
                {
                    "user_id": "Noble Obodum",
                    "user_href": "/profile/Noble-Obodum"
                },
                {
                    "user_id": "TyRa Cruz",
                    "user_href": "/profile/TyRa-Cruz"
                },
                {
                    "user_id": "Atul Parida",
                    "user_href": "/profile/Atul-Parida-1"
                },
                {
                    "user_id": "Tami Rosen",
                    "user_href": "/profile/Tami-Rosen"
                },
                {
                    "user_id": "Tsvetan Borisov",
                    "user_href": "/profile/Tsvetan-Borisov"
                },
                {
                    "user_id": "Alecia Li Morgan",
                    "user_href": "/profile/Alecia-Li-Morgan"
                },
                {
                    "user_id": "Said Nini",
                    "user_href": "/profile/Said-Nini"
                },
                {
                    "user_id": "Love Kumar",
                    "user_href": "/profile/Love-Kumar-97"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Harvey",
                "href": "/profile/Robert-Harvey-41"
            },
            "answer_text": "Huge numbers The discovery of Bronze led to the science of metalurgy, eventually. Maybe 3000 years later. Radio, Batteries, Semiconductors, from the early 19th to the late 20th century, a steady march of invention. The Loudspeaker and Microphone were the earliest bit of telephony, all from the late 19th. Integrated circuits date from the 1960s, but the necessary photolithography from at least a century before, and ion deposition can be traced back to the alchemists colouring steel with gold and sliver colours. What about glass? Probably older than metalworking The springs that hold the connectors in. Roman Legionaries had springs to stop the sword bouncing out the the scabard. There were springs on the back of bronze age broaches. ",
            "date": "Answered July 25, 2017",
            "views": "145",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jacob Glaister",
                    "user_href": "/profile/Jacob-Glaister-1"
                }
            ]
        }
    ]
}