{
    "title": "Which is better, to buy a power bank or a new battery for replacement? - Quora",
    "tags": [
        "Power Banks",
        "Electronic Batteries",
        "Batteries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allen He",
                "href": "/profile/Allen-He-20"
            },
            "answer_text": "Let  me describe the advantages and disadvantages of both for you: Applicability: 1. The equipment original battery is only suitable for the use of original equipment, mobile power simply convert the connector will be able to charge a variety of digital devices or power supply and charging, but is not limited to the brand and model. 2. Power bank 5000mah can be widely used in USB On-the-Go (USB-OTG) portable device (USB lights, fans, massage and medical equipment, etc.), involving a wide range. 3. Some digital products (such as tape recorders, video machines, cd, old-fashioned DC) can be used with the disposable batteries (5 or 7) or the small rechargeable battery (5 or 7) and portable mobile power can completely replace these batteries products, to achieve the same convenient mobile use. 4. Some models of mobile power can be coupled with an appropriate connector to become a “universal charger”, and it can charge for a variety of digital devices.  Usability: 1. Mobile power capacity is usually several times more than the original battery, and it can even reach more than 8 times or 8 times depending on the size, which can achieve many charge times or power supply for a long time. 2. Some digital devices (PSP, digital camera, etc.) must be stopped to replace the original battery in use, while mobile power can power the device without affecting the device, which is the embodiment of the user-friendly design. 3. Some portable external battery charger design is precision, which is even easier to carry, easier to use than the original battery. Economy: 1. is usually added with the equipped original battery is expensive, rather than the original battery quality cannot be guaranteed, and good quality mobile power capacity is several times of the original battery, but the price may be little difference with the original battery, and some or even lower. 2. The wide applicability of mobile power, so as not to be equipped with a variety of battery because they have a variety of digital devices. Increase with the original battery may be wasted due to the digital update or negligence lost mobile phones and other digital devices. 3. high-capacity mobile power has a wide range of application, which is suitable for family or group of people, even meet the need of friend who is in need of emergency help. 4. Mobile power can charge small batteries (disposable or rechargeable) to power digital devices, to achieve the same mobile use, makes the use of cost reduction, but also environmentally friendly. 5. mobile power has long service life, which is usually designed for 70-80% of the electricity capacity remains in charge and discharge more than 500 times, according to the average 2 times a week full charge and discharge, you can use more than 5 years. You may also need this:  Read This Before You Buy A Power Bank Part 1  Read This Before You Buy A Power Bank Part 2  ",
            "date": "Answered February 22, 2016",
            "views": "55",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ovge Ozturk",
                    "user_href": "/profile/Ovge-Ozturk"
                },
                {
                    "user_id": "Rashish Vaibhaw",
                    "user_href": "/profile/Rashish-Vaibhaw"
                },
                {
                    "user_id": "Kris Lau",
                    "user_href": "/profile/Kris-Lau-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishwas Navada B",
                "href": "/profile/Vishwas-Navada-B"
            },
            "answer_text": "It's always better to replace your battery with original one. Because using the power bank to recharge your phone is not at all a good option compared to replacing the battery. Power banks are designed to charge your phone in the case of emergency as a backup power supply. Power banks should not be used to charge your phone daily, as power banks charge your phone with either 1A or 2A maximum current. But your phone may need 1.5A etc. Low quality power banks use low quality or recycled Li-ion batteries which lasts for few days. The charging circuit in some of the low quality power banks are not able to provide even 1A current. This damages the battery as our phone needs high current when the battery is too low. You can check this by installing an app called ampere which shows the current consumption in real-time. The current is an entity decided by the load resistance. If the current required is high and supply is low it may damage the supplier such as charger or power bank. In summery I suggest you to replace the battery and use the power bank only in emergency conditions where you don't get ac power ports. ",
            "date": "Answered July 12, 2017",
            "views": "41",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Romica Ciocan",
                    "user_href": "/profile/Romica-Ciocan"
                },
                {
                    "user_id": "Kevin Sheu",
                    "user_href": "/profile/Kevin-Sheu-2"
                },
                {
                    "user_id": "Pradeep Upadhya",
                    "user_href": "/profile/Pradeep-Upadhya"
                },
                {
                    "user_id": "Sreehari S",
                    "user_href": "/profile/Sreehari-S-10"
                },
                {
                    "user_id": "Vishwas S Hegde",
                    "user_href": "/profile/Vishwas-S-Hegde"
                },
                {
                    "user_id": "Sireesha K",
                    "user_href": "/profile/Sireesha-K-7"
                },
                {
                    "user_id": "Vasanth Hegde",
                    "user_href": "/profile/Vasanth-Hegde"
                },
                {
                    "user_id": "Sachin S M",
                    "user_href": "/profile/Sachin-S-M"
                },
                {
                    "user_id": "Vasishtha Bhat",
                    "user_href": "/profile/Vasishtha-Bhat"
                },
                {
                    "user_id": "Narendra Hegade",
                    "user_href": "/profile/Narendra-Hegade-1"
                }
            ]
        }
    ]
}