{
    "title": "Which companies offer cloud computing in India? - Quora",
    "tags": [
        "Company Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krishna Srinivasan",
                "href": "/profile/Krishna-Srinivasan-6"
            },
            "answer_text": "Well, you have decided to take off to the cloud! However, it may be a tough decision when you think of many alternatives that you can find in India. For what? Cloud computing service providers! So, you need to have the right alternatives in your hand to help you deal effectively with the demands of cloud transformation for your business. Here are some of the cloud computing companies in India which can be of help to you! 1. Octal IT Solution Octal IT Solution is a global cloud computing service provider with notable services for outsourcing. The company has a strong presence in many countries such as Singapore, UK, USA, and India. The expertise of the organization in development has been a prominent factor that has established its functionality in the cloud computing domain. With around 20% of its services focused on cloud computing and a major upper hand in development tasks, you can be able to get reliable outcomes for your cloud transformation journey. 2. Easy Deploy Easy Deploy is another organization which has entered into the domain of cloud computing five years ago. The company specializes in container services, public and private cloud managed services, and consulting provider. The company has introduced a flexible option for customers to save costs through the development of applications, infrastructure, and processes on its own platform EasyDeployCloud. The development expertise of the professionals in this organization is commended for promising benefits that are topped with expert support round the clock. 3. Navtech Navtech is a US-based mobile app development company with its location in Hyderabad, India. The company has entered the cloud computing domain recently with a vision to achieve scalable, cost-effective, and secure solutions in public, private, and hybrid cloud services. The company has formidable expertise in different cloud platforms such as AWS and Azure. The wide range of services in cloud computing provided by the company include platform development, cloud governance, and best practices consulting services. Navtech also ensures the development of strong customer relationships, use of sophisticated and developed technology stack, measurement with analytics, and punctual delivery of projects. 4. Tudip Technologies Tudip Technologies is a Pune-based company in India which is committed to delivering cloud computing services with the values of integrity, innovation, and serenity. The company’s services in the two distinct and popular cloud computing platforms Google Cloud and Amazon Web Services (AWS) makes it a reliable choice for cloud transformation. Tudip technologies help in the guidance of clients through the cloud transformation journey by providing end-to-end infrastructure management, planning, and risk identification services. The company’s experienced professionals can also help you in the development of mobile and web applications for the cloud landscape using AWS services. 5. ALTEN Calsoft Labs ALTEN Calsoft Labs is also a reliable option for businesses looking to move towards the cloud with their effective services in operations and technology consulting. The Agile advisory services of ALTEN Calsoft Labs are specifically tailored for ensuring cloud project portfolio management and ensuring enterprise-wide agile transformation. The operations consulting services of this company are directed towards identifying the needs of clients, operational challenges for an enterprise, and reducing the gap between strategy and deployment of cloud technologies. The technology consulting services of this company are tailored for customers to gain the maximum ROI on their technology investments by identifying the suitable IT strategic approach, architecture design, enterprise system readiness, and portfolio analysis. 6. Tvisha Technologies Tvisha is another cloud computing company in India, which you can trust for your application development services. The different benefits with the services of cloud computing with Tvisha include higher scalability, better storage options, low-cost maintenance, and disaster recovery. Businesses could be able to gain the most from analytics in the aspects of security and credibility. Also, Tvisha assures accelerated delivery of content, APIs, and high-powered cloud computing solutions for solving the problems of clients. So, these are some of the companies known for their cloud computing services and solutions. To choose the one, you can set your requirements and check which one could fulfills them at best. If you have any queries, feel free to drop a message in my inbox. I’ll be happy to resolve them. Related Topics: https://www.quora.com/Which-is-a-good-AWS-consultant-partner-in-India-for-cloud-services/answer/Krishna-Srinivasan-6https://www.quora.com/What-are-some-companies-that-provide-end-to-end-AWS-cloud-consulting-services/answer/Krishna-Srinivasan-6https://www.quora.com/Who-are-the-best-cloud-consultants-in-India/answer/Krishna-Srinivasan-6",
            "date": "Answered August 1, 2019",
            "views": "58",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ronak Dudhawat",
                    "user_href": "/profile/Ronak-Dudhawat"
                },
                {
                    "user_id": "Anirudh Garg",
                    "user_href": "/profile/Anirudh-Garg-11"
                },
                {
                    "user_id": "Siranjeevi R",
                    "user_href": "/profile/Siranjeevi-R-1"
                },
                {
                    "user_id": "Vishok Ranjan",
                    "user_href": "/profile/Vishok-Ranjan-1"
                },
                {
                    "user_id": "Dilpreet Bharaj",
                    "user_href": "/profile/Dilpreet-Bharaj-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chintan Tyagi",
                "href": "/profile/Chintan-Tyagi"
            },
            "answer_text": "The question should be more specific. What aspects of cloud computing are you asking about. If you are looking at IaaS then there are quite a few Data Centers which are offering public cloud based services. Check our Netmagic, Ctrl S, Reliance Data Centers. If you are interested in building a cloud based application then you should look at the PaaS players. These are companies like Microsoft, Amazon, Google and also some local players. On the SaaS stack there are quite a few Indian companies including ours which are providing Software as a Service. ",
            "date": "Answered April 4, 2012",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ash Brener",
                    "user_href": "/profile/Ash-Brener"
                }
            ]
        }
    ]
}