{
    "title": "Which politician is an example of “education doesn't decide your future”? - Quora",
    "tags": [
        "Politicians and Government Leaders",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Deshpande",
                "href": "/profile/Abhishek-Deshpande-1"
            },
            "answer_text": "I’ll answer this on the basis of the attribute that the, “Career you choose needn’t be necessarily depending on the formal education you take.”  Mr. Kapil Sibbal  Shri Ravishankar Prasad  Late Shri Arun Jaitley  Shri Jairam Ramesh All these veteran politicians and more alike, have a stupendous educational record if you check it online. Still they chose the field of coming in politics. It is not always such that education must help you gain a streamlined success. Education makes oneself cultured. That is the essence of it. People who have made it large even without having any formal education take good care that their progeny gets a handsome educational facilities if any. It is a quite a negative virtue to constantly hunt for people who’ve earned certain amount of success without having to tread for any education and make them poster boys/girls for downsizing the importance of education. This especially happens in the fields where public contact is largely involved. Go knows when will this constant urge for having inspirations being made out of less to no formally educated people. ",
            "date": "Answered September 28, 2020",
            "views": "57",
            "upvotes": " Answer requested by Abhijeet Satogiya",
            "upvoters": [
                {
                    "user_id": "Harshit Gupta",
                    "user_href": "/profile/Harshit-Gupta-844"
                },
                {
                    "user_id": "Herdeep Singh",
                    "user_href": "/profile/Herdeep-Singh-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sagar Shrivastav",
                "href": "/profile/Sagar-Shrivastav-20"
            },
            "answer_text": "These two politicians are best example of education doesn't decide your future.  Even to become peon in any office you need to be UG/graduate atleast but these two leaders are holding top posts in Indian government without having any genuine degree. They know how to take advantage of public sentiment and use it for their own political milage. They keep on trying to hide their qualifications by giving silly excuses. Its a well known fact that indian respect knowledge and education, and we as a country even respect people without any formal education but to hide your educational qualifications and claims to have degree from yale which is just a mere participation certificate is absurd and silly. We have so many examples in our own country who doesn't have any formal degrees but are master in their own field like sachin tendulkar, virat kholi, dhoni and aamir khan but they never lied about their education, qualifications or degree. Thanks Images: Google images ",
            "date": "Answered July 29, 2020",
            "views": "153",
            "upvotes": " View 2 Upvoters"
        }
    ]
}