{
    "title": "Which Japanese companies make robots? - Quora",
    "tags": [
        "Tech Companies in Japan",
        "Companies in Japan",
        "Robots",
        "Robotics",
        "Japan",
        "Artificial Intelligence",
        "Mechanical Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shaleen Rawat",
                "href": "/profile/Shaleen-Rawat"
            },
            "answer_text": "The Robotics industry is more important in Japan than any other country in the world. Japan employs over a quarter of a million industrial robot workers. In the next 15 years, Japan estimates that number to jump to over one million and they expect revenue for robotics to be near $70 billion by 2025.Robots made by them are:Human Robots[edit] ASIMO, manufactured by HondaQRIO, by SonyHOAP(*1) Robot Series (Humanoid for Open Architecture Platform), Manufactured by Fujitsu [2]Toyota Partner Robot, manufactured by Toyota.[3]EMIEW, by HitachiAndroids[edit]Androids are robots designed to strongly resemble humans. Actroid, a realistic female robot demonstrated most prominently at Expo 2005 in JapanHanako, a humanoid robot designed for dentist training[4]HRP-4C, a humanoid robot with a realistic head and the average figure of a young Japanese female [5]Animal (four legged) robots[edit] AIBO is a commercial robotic dog manufactured by Sony Electronics.Social robots[edit] PaPeRoParo, a robot baby seal intended for therapeutic purposesWakamaruGuard robots[edit] Guardrobo D1 is manufactured by Sohgo Security Services.Banryu, manufactured by Sanyo and TMSUK.[6]Domestic robots[edit] SmartPal V, manufactured by Yaskawa Electric Corporation.[7]TWENDY-ONE, developed by Waseda University.[8]TPR-ROBINA, manufactured by Toyota.[9]Mobility robot[edit] WL-16RIII, developed by Waseda University and TMSUK.[10]i-foot, developed by Toyota.[11]i-REAL, developed by Toyota.[12]Murata Boy and Murata Girl, a bicycle-riding and a unicycle-riding robot developed by Murata Manufacturing.[13]Rescue robots[edit] T-53 Enryu, manufactured by TMSUK.[14]Industrial humanoid robotics[edit] HRP-3 PROMET Mk-II, manufactured by Kawada Industries, designed by Yutaka Izubuchi.[15]HRP-4Astronaut robots[edit] Kirobo is Japan's first robot astronaut, arrived on the ISS on August 10, 2013",
            "date": "Answered December 26, 2014",
            "views": "374",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tanish Garg",
                    "user_href": "/profile/Tanish-Garg-5"
                },
                {
                    "user_id": "Marie Isabelle",
                    "user_href": "/profile/Marie-Isabelle"
                }
            ]
        }
    ]
}