{
    "title": "Which piece of fiction has the most realistic technology, Star Trek or Star Wars? - Quora",
    "tags": [
        "Science Fiction Movies",
        "Star Trek (creative franchise)",
        "Science Fiction (genre)",
        "Star Wars (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saberian Dream",
                "href": "/profile/Saberian-Dream"
            },
            "answer_text": "Ignoring the knee-jerk reaction of ‘HURR DURR, FICTION AIN’T REAL,” here’s my take on it. Star Wars is well-known, naturally, as the biggest science-fiction franchise of all time. Is it, however? Some would claim it’s more space opera, which is about the rise and fall of empires, exceptional individuals with unique physical or magical powers, and similar concepts, which would seem to fit the bill. Some posters that have answered already agree they think it qualifies as more “space fantasy.” I can’t entirely disagree, although I would offer the distinction that it straddles the thin line, that compromise between science-fiction and fantasy as part of the speculative fiction genre, which was always when it was at its peak, what made the story so great. And given the reaction to the prequels and sequels, you can go too far in either direction. The presence of concepts like hyperspace we know cannot exist in “the real world,” or technologies, or inaccurate depictions of physics in some cases, and showing aliens running about, would seem to suggest to most it is about fantasy, or “don’t think about this too much.” Let it be said, however, that for as much Star Wars has no pretensions about being beholden to “the real world,” Star Trek is hardly the “hard” science-fiction casuals or those with a limited experience with the franchise believe that it is. Think about it. You got what amounts to basically demon possession updated for the modern era, which science has concisely proven is an impossibility, over and over. Only materialists will believe that is possible, but it is entirely probably, and in fact very likely we live in an immaterial universe. The idea of a warp bubble, their method of FTL travel, works in theory, based on real-world principles, but in practice hasn’t been put to the test. And there’s way more. Q. The presence of many godlike beings who function like the Old Testament creator are not part of this world and never have been. Time travel, many of which is often not consistent, like the presence of stable time loops, but then, you also got parallel timelines, or instances where you change the past, and then people vanish, two in DS9. I mean, that is just not real science at all. Planets that have exotic minerals which could make them blow up, while perhaps theoretically possible, have still not been proven, at all. And honestly, such volatile compounds would doom such a planet long ago. The more you know about science, the more you begin to see how much pseudo-scientific bullshit Trek relies on just to appeal to casuals and get you to the next part of the story beat in a clever plot. With one episode of Voyager, this Dr. Oppenheimer allegory came in to say that his subspace weapon, whatever it is, causes the victim’s molecules to undergo fission, in light elements, no less, which is about as far removed from “hard science” as you can get. Star Wars, meanwhile, has had plenty of times in its long history where it had more grounded physics concepts but is far more honest about its approach. Such as gravity weapons. The old EU was chock full of them all the time. The Mass Shadow Generator, Centerpoint Station, and Yuuzhan Vong tactics all revolved around that idea. It shows the people writing for it had a passing grasp with the real physics, and adhered to it, in some ways more intelligently than Trek has. While Star Wars has always been about space adventures and an engaging morality play to mainstream audiences, the old EU authors tended to follow in George’s footsteps in the classic science-fiction or pulpy superhero literature he was inspired by for creating the original trilogy. An author like Matthew Stover, for example, is plainly an ardent follower for other geek hobbies like Warhammer 40,000, and perhaps even Babylon 5, you could just feel it dripping in his every word. Not so much since 2008 onwards, but then, that is the price you pay with an aging franchise, as Trek can attest to. And something like hyperspace, the alternate dimension through which ships are able to travel at faster-than-light speeds until Rian Johnson came along and threw that out the window, is not as scientifically farfetched as a casual might assume since such a dimension would primarily be composed of, I’d imagine, exotic subatomic particles like tachyons, where they concentrate together, a theorized particle that could travel faster-than-light. But it’s only my speculation. In conclusion, among casuals, which this question seems to be about, Star Trek is better concealed as a “hard science-fiction” story while Star Wars is better presented as “space fantasy,” even if neither answer is particularly nuanced. Because no work of fiction is reality, though if it inspires innovators to design better tools to help people in reality, so much the better, to quote Khan. Besides, I think Stargate accomplishes what both fail to do. ",
            "date": "Answered June 20, 2020",
            "views": "378",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-847"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Hughes",
                "href": "/profile/Ken-Hughes-10"
            },
            "answer_text": "Would you believe Star Wars is more realistic? Star Trek pays a lot more attention to its technology. It’s done any number of great and not-so-great stories about the implications of one of its bits of science. But because it has so much tech and puts it in the center of so many stories, it’s created many more inconsistencies than Star Wars does. In contrast… Star Wars technology is a weird mix of bits of futurism with a whole lot of limits that make it often weaker than the technology we have today. No surprise, since it’s rooted in the 70s, and in Flash Gordon-style 30s serials before that. Star Wars has produced a few whoppers of odd technology, but it only takes so many assumptions before we can explain most of how a universe like that might come about: A hyperdrive design that’s cheap and doesn’t use much power, so even X-wings can carry it.Breakthroughs in lightweight building material or limited antigravity, plus mass construction, so that huge ships are feasible to make.At the same time, power generation technology is not as advanced as most SF universe; Star Wars ships are just lighter.Because of that, even ship blasters aren’t nearly as strong as they should be. (And they must have discovered blaster tech so early they never got very far into gunpowder… okay, that’s a stretch.)The Death Star and Starkiller are only powerful because they use crude but colossal power sources, combined with hyperdrive tech to get them or the blast to a planet.Lightsabers… well, there has to be a Force skill for restructuring their crystals so perfectly that they can focus energy that way, and only a blaster-deflecting wielder can use them well. Sure they’d be miracles as cutting torches, but the Jedi and Sith don’t share them.Droids that are so programmed to obey humans they never become a threat or more than comic relief. Star Wars programmers must have been afraid of creating Cylons from the beginning, so the restraints go that deep.You only have to make so many worldbuilding rules before Star Wars tech makes a stunted kind of sense. (Unlike its military practices.) But Star Trek tech is far more advanced (um, transporters?) and varied, and used in many more ways in its stories. It’s produced vastly more good science and good science-based plots, but if we’re counting cracks in the logic it also has waaaaaaaaay more than Star Wars’s limited tech. ",
            "date": "Answered September 29, 2018",
            "views": "336",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Olga Rose",
                    "user_href": "/profile/Olga-Rose-3"
                }
            ]
        }
    ]
}