{
    "title": "Which display is better, POLED or AMOLED? - Quora",
    "tags": [
        "Super AMOLED",
        "AMOLED (active matrix OLED)"
    ],
    "response": [
        {
            "author_info": {
                "name": "László Keresztény",
                "href": "/profile/László-Keresztény"
            },
            "answer_text": "They are the same technology. OLED panels. The answer is dependable on what exact panels we compare. Usually I would say AMOLED (Samsung’s implementation on OLED) against POLED (LG’s way of the same thing), as Samsung has done this for almost a decade (Samsung Galaxy S.. the first one already used AMOLED) LG only tried it recently (LG V30, and I think they did the panels for iPhone X too). There were issues with these. They might perfect the solution later on. But Samsung panels as of right now are a safer bet (that’s why all the other phones use it, like Xiaomi or Oneplus) Generally though, it’s the same thing. Depends on the actual implementation, and not on the technology. Compare brightness, resolution, color correctness, view angles, color depth of the panels of the phones you want to buy. In case of TV’s (but I assue we’re talking about phones, as there are no amoled TV’s) only LG makes OLED panels. The future of display technology is called microLED though. It has all the advantages of OLED, without the majos disadvantages (pixel burnout) ",
            "date": "Answered June 12, 2018",
            "views": "171",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ekemini Udonte",
                    "user_href": "/profile/Ekemini-Udonte"
                },
                {
                    "user_id": "P. Cosmore",
                    "user_href": "/profile/P-Cosmore"
                },
                {
                    "user_id": "Ashik Jonathan",
                    "user_href": "/profile/Ashik-Jonathan"
                },
                {
                    "user_id": "Sachin Somra",
                    "user_href": "/profile/Sachin-Somra"
                },
                {
                    "user_id": "Roshan Saravanan(ரோஷன் சரவணன்)",
                    "user_href": "/profile/Roshan-Saravanan-ரோஷன்-சரவணன்"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Hawkins",
                "href": "/profile/Eric-Hawkins-32"
            },
            "answer_text": "POLED stands for passive and AOLED stands for active. Active displays do not refresh, they are on or off 100% of the time, that is no duty cycle and these provide a sharper image than POLEDs. POLEDs are less expensive. ",
            "date": "Answered September 10, 2018",
            "views": "3",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "PRITAM DEY",
                    "user_href": "/profile/PRITAM-DEY-37"
                }
            ]
        }
    ]
}