{
    "title": "Which are the best digital forensic companies in India? - Quora",
    "tags": [
        "Certified Forensic Accounting Professional",
        "Forensic Accounting",
        "Digital Forensics",
        "Forensic Science",
        "Companies in India"
    ],
    "response": [
        {
            "author_info": {
                "name": "CA Mayur Joshi",
                "href": "/profile/CA-Mayur-Joshi"
            },
            "answer_text": "There are many companies in the digital forensic space in India. Typically the digital forensic work is done when there is a need to retrieve the evidence from the electronic devices such as computers, dvds, pen drives or mobile phones. There are two dominant players in this space though there are many other local companies in the different parts of India. ForensicGuru is the company based in New Delhi and are associated with AccessData software. They have other products under their umbrella which helps them to work with the companies looking for services. Lab Systems on the other hand is Mumbai based dominant player in Digital forensics in India. They have been working in this domain since last 2 decades. They are associated with investigations of many hi-profile cases in India. They are associated with the Encase software company of USA. ",
            "date": "Answered June 28, 2019",
            "views": "43",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samir Datt",
                    "user_href": "/profile/Samir-Datt"
                },
                {
                    "user_id": "Pranav Shastri",
                    "user_href": "/profile/Pranav-Shastri-7"
                },
                {
                    "user_id": "Manoj K Shah",
                    "user_href": "/profile/Manoj-K-Shah-2"
                },
                {
                    "user_id": "CA Ashok Rao",
                    "user_href": "/profile/CA-Ashok-Rao"
                },
                {
                    "user_id": "Sarvesh Prabhukhanolkar",
                    "user_href": "/profile/Sarvesh-Prabhukhanolkar"
                },
                {
                    "user_id": "Rashmi Raj",
                    "user_href": "/profile/Rashmi-Raj-163"
                },
                {
                    "user_id": "Rishikesh Gogate",
                    "user_href": "/profile/Rishikesh-Gogate"
                },
                {
                    "user_id": "Prasad Bapat",
                    "user_href": "/profile/Prasad-Bapat-18"
                },
                {
                    "user_id": "Nabhishek Singh",
                    "user_href": "/profile/Nabhishek-Singh"
                },
                {
                    "user_id": "Shaukat Khan",
                    "user_href": "/profile/Shaukat-Khan-199"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyanshu Dubey",
                "href": "/profile/Priyanshu-Dubey-62"
            },
            "answer_text": "Hi, i would suggest you to go to the 3rd eye techno solution pvt. ltd. #REASON- they are very professional in their fieldproviding best digital forensic investigationthey have latest tool and technologies.they have several clients in Government sector like as - MHA, CBI, IB, MAHARASHTRA POLICE, HARYANA POLICE, DIAL100 etc.they also serve in private sector as well such as - PWC, KPMG etcalso provide incident response, ediscovery, data recovery and much more . so, i will definitely suggest you to go the 3rd eye techno solution pvt ltd located in okhla industrial area, Delhi. Thanks ",
            "date": "Answered March 3, 2020",
            "views": "300",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Neeraj Kumar",
                    "user_href": "/profile/Neeraj-Kumar-640"
                }
            ]
        }
    ]
}