{
    "title": "Which bachelor's degree does an interior designer need? - Quora",
    "tags": [
        "Interior Decoration",
        "Interior Designers",
        "Bachelor Degrees",
        "Interior Design"
    ],
    "response": [
        {
            "author_info": {
                "name": "Antoana Petkova",
                "href": "/profile/Antoana-Petkova"
            },
            "answer_text": "In the UK, BA and/or MA in Interior Design. You can easily do architecture too and then specialise in Interior Design while working (and you can’t do the other way around - so if you’re torn between the two, perhaps consider architecture). That might be useful if you want to do commercial or bigger projects too. Saying that, I know people with fashion degree (like Lee Broom whom I used to work for), art degrees or no degrees at all that have successful interior design careers. After the first 2 years in the industry, no one has ever asked me about a degree, but the degree might give you the skills, confidence, connections and platform to launch your career - it did for me. Hope this helps! ",
            "date": "Answered July 8, 2019",
            "views": "128",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Hadijha Khaliq",
                    "user_href": "/profile/Hadijha-Khaliq"
                }
            ]
        },
        {
            "author_info": {
                "name": "Besten Hamwiinde",
                "href": "/profile/Besten-Hamwiinde"
            },
            "answer_text": "For Interior designer education requirements usually consist of a bachelor's degree, but interior designer education is available at the associate's, bachelor's, and master's degree levels. There are also a variety of different kinds of construction classes. Frame Construction (ISO Class I, IBC Type V)Joisted Masonry (ISO Class 2, IBC Type III, IBC Type IV)Light Noncombustible (ISO Class 3, IBC Type IIB)Masonry Noncombustible (ISO Class 4, IBC Type IIA)Modified Fire Resistive (ISO Class 5, IBC Type IB)Fire Resistive (ISO Class 6, IBC Type IA).An appropriate bachelor's degree is usually required for interior designer. ",
            "date": "Answered August 20, 2019",
            "views": "57",
            "upvotes": "0"
        }
    ]
}