{
    "title": "Which credit card companies provide the best credit cards? - Quora",
    "tags": [
        "Best Credit Card",
        "Credit Card Companies",
        "Credit",
        "Credit Cards"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Regnery",
                "href": "/profile/George-Regnery"
            },
            "answer_text": "It depends on your personal situation a bit. However, I’d strongly caution you to pay off the balance each month, and not run up balances, even at lower interest rates. Don’t spend, or if you must, use a line of credit. For credit cards, my favorites are: Fidelity: they have several cards that offer 2% back, and the money goes to 529 accounts or your brokerage account (but you can withdraw it). 2% on all purchases, not bad.American Express Cash Builder: 1% on all purchases refunded. 3% at gas stations and department stores. 6% at grocery stores (up to $6,000 per year). Use this one only at gas stations, department stores or grocery stores.Chase Freedom: 5% rebates on a few categories each quarter. It can be restaurants, gas stations, department stores, Amazon, Walmart, etc. There’s usually two or three categories per quarter. Useful only for the categories, otherwise you get 1%.Now, while I travel some for business, I go to places where I can’t always take the same airline. So frequent flyer miles or Starwood points aren’t that useful for me. I’d rather have the cash back. But if you live in Atlanta and fly a lot for business, might make sense to get a Delta Skymiles Visa card (or whatever it’s called). The miles might be better than cash back for you. Sometimes there are Visa or Mastercards tied to a single merchant where you get 3% back at that store. I don’t bother because it’s not really worth the effort to remember to pay it because I use those so infrequently. I get 2% minimum with the fidelity card, so that 1% on $150 purchased a year just isn’t worth the effort. But if you shop at that store a lot, might be worth it. For a while, car companies offered x% back for a new car purchase. If you knew you were going to buy one of those cars (and a new car), might be worth it. I don’t work for a credit card company, and never have. This is just based on my use of the cards. Biggest thing to remember: don’t carry a balance. ",
            "date": "Answered November 30, 2017",
            "views": "204",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Divya Kapoor",
                "href": "/profile/Divya-Kapoor-145"
            },
            "answer_text": "The credit card company that offers a card that suits your personality and fulfills your requirements is the best one for you. In India, there are a plethora of credit card companies that offer amazing rewards and offers. Here are some of the popular credit cards that you can select according to your requirement and financial status: American Express Membership Rewards® Credit Card: It can be a great option for those who want to get rewarded every time they make any transaction. You have to pay an annual fee of Rs. 1,000 + GST and a renewal fee of Rs. 4,500 + GST. Moreover, you will get a welcome gift of 4,000 bonus Membership Reward Points. Citi PremierMiles Credit Card: If you do not have any budget issue and want to enjoy exclusive travel benefits such as lounge access, air miles on every transaction and other discounts then consider getting Citi PremierMiles Credit Card. You need to pay Rs. 3,000 + GST as the annual fee and the same amount for the renewal fee. Every time you renew your card, you will receive additional 3,000 Miles. HSBC Platinum Credit Card: It is one of the best cards that you can get today as it charges zero annual fees and offers a plethora of benefits. You can get a Cleartrip voucher worth Rs. 2,000 on making your first transaction. For the first 12 months, you can earn 3X rewards on telecom hotel and dining expenses. In addition to that, you also get two reward points per Rs 150 spent. Standard Chartered Manhattan Platinum Credit Card: If you dine-out frequently and also loves shopping, then this is a suitable card as it offers amazing rewards and discounts. You need to pay an annual fee of Rs. 999 + GST and the same amount for the renewal fee. ",
            "date": "Answered November 28, 2019",
            "views": "133",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kenneth Hardy",
                "href": "/profile/Kenneth-Hardy-1"
            },
            "answer_text": "Credit card companies are the financial institutions (in most cases, banks) that issue credit cards to consumers and service their accounts. American Express is also known for being the world’s largest issuer of charge cards and for targeting its products to high-income individuals with strong credit scores. As a result, Amex is a great source of lucrative rewards credit cards, but is not heavily involved in the credit improvement space. It is interesting to note, however, that Amex has in recent years partnered with Walmart to introduce the Bluebird Prepaid Card, the company’s first foray into the growing prepaid card market and seemingly an attempt to expand its consumer reach. Bank of America is not only one of the largest financial institutions in the world, but one of the largest companies as well. Headquartered in Charlotte, NC, the banking behemoth now has nearly 300,000 full-time employees and does $100+ billion in annual revenue. Barclaycard, the payment card business of London-based banking giant Barclays, was the first UK credit card program when it was introduced in 1966. Barclaycard US was established in 2004, when Barclays purchased U.S.-based Juniper Financial Corporation. Capital One is the 5th largest U.S. credit card company in terms of both outstanding balances and purchase volume. The company, established in 1995, is based in McLean, VA and has around 1,000 branch locations in the District of Columbia, Louisiana, Maryland, New York, New Jersey, Texas, and Virginia. In addition to credit cards, Capital One is known for offering everyday banking products, personal loans, and auto loans. As we have numerous companies who offers credit cards with different rewards program as well as with cash back offers some time we get confused like which credit cards is best for us, to know this, firstly we have to decide our credit score like we have bad credit score, excellent credit score or no credit history. Second thing which card is beneficial for us why we need like for travel points, student or a business purpose. For this you also get online site which helps you to get the best credit card, but I recommend Lowcards Which will compare credit cards and also suggest you the best credit card according to your credit score and need. ",
            "date": "Answered May 15, 2016",
            "views": "807",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakim Mohamed",
                    "user_href": "/profile/Rakim-Mohamed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nancy Ahuja",
                "href": "/profile/Nancy-Ahuja-21"
            },
            "answer_text": "Since the suitability of a credit card depends on the individuals’ spending habits and type of credit card, it is difficult to pick any particular credit card or its issuer as the best. Nevertheless, most leading financial institutions like Bajaj Finserv that extend credit cards with these features are deemed to be a preferable choice among users – Simple eligibility criteriaMost popular financial institutions require applicants between the age of 25 years and 65 years with a CIBIL score of a minimum of 750. Also, a stable source of income and a clear credit history comes in handy. Easy application and documentation processUsually allows individuals to initiate the application process both online and offline. Also, the documentation process is quite simple and can be completed easily by submitting KYC documents, income proof, etc. Facility to convert high-value purchases into EMIsUsers are allowed to convert their expensive buys into affordable EMIs to facilitate timely payment and minimizing the risk of default. Facility to avail a personal loan on the cash limitSuch a feature helps meet any unforeseen situations with greater ease and allows meeting financial requirements effectively. Other than these, companies which extend a galore of rewards and exclusive offers and allow cash withdrawal facility with an interest-free period are relatively more popular than others. ",
            "date": "Answered March 16, 2020",
            "views": "530",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nitin Gautam",
                    "user_href": "/profile/Nitin-Gautam-220"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Lambridis",
                "href": "/profile/James-Lambridis"
            },
            "answer_text": "The best credit card for you depends on your spending and lifestyle, and how much you want to spend on annual fees. If you are a frequent traveler, you might want to look into American Express Gold / Platinum and Chase Sapphire, as well as special airline credit cards including the American Airlines and United cards. These cards can carry high annual fees but also offer travel credits and higher points on travel and spending. AmEx Blue Cash offers great return for groceries and Visa Amazon Prime for Amazon / Whole Foods spenders. Other cards, such as the Citi Double Cash offers 2x the points for general purchases and more benefits for Mets fans. ",
            "date": "Answered May 21, 2019",
            "views": "174",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rengarajan",
                "href": "/profile/Rengarajan-7"
            },
            "answer_text": "Credit card companies have multiple credit card products. We cannot generalize a single card / company as Best or Worst. It entirely depends on your usage / requirement. For example,If you are a avid traveler, then you have to choose a travel card based on your requirement. I hold multiple card for the same reason. Some cards are good for travel. Some cards are good for shopping. ",
            "date": "Answered September 21, 2018",
            "views": "199",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Viswanathan Srinivasan",
                    "user_href": "/profile/Viswanathan-Srinivasan-9"
                },
                {
                    "user_id": "Ryan Patton",
                    "user_href": "/profile/Ryan-Patton-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leon F Benjamin",
                "href": "/profile/Leon-F-Benjamin"
            },
            "answer_text": "You do not necessarily need a credit card to build credit. Credit is actually “lines of credit” and payments made over a period of time. Therefore, it is simply your management of debt and how well you can manage your finances according to pre-defined rules. You can begin by going to a bank and establishing a bank account if you have not already done so. Once completed, ask to open a secured line of credit, which is simply a credit card, issues from the funds in your actual bank account. Since the banks are establishing a credit line, they are required to report this information, as well as because they make a profit from this. You can do this as many times as you want. Rule of thumb, use only 10% or less of the balance on the card per month. So if you have a phone bill of $50, you will need $500 in credit to keep things at a 10% maximum use. Do this with 4–7 cards and in 2 years you will have close to an 800 score or possibly even go over the 800 mark which is excellent credit. This is provided that you are not behind on other obligations like loans, etc. You can also get loans that you pay off over time, like a deferred payment plan on laptops, furniture, etc. The reason I suggest your own line of credit is also the fact that it’s your money so if you spend it all, there’s no debt to repay. You simply have nothing left in your account. Good luck. ",
            "date": "Answered December 4, 2018",
            "views": "392",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashley Elder",
                "href": "/profile/Ashley-Elder-1"
            },
            "answer_text": "The Capital One Quicksilver card offers 1.5% back on every purchase. Several friends recommended it to me, and I enjoy it so far. It's very simple to use and understand, so it's a great card for students and those who are building credit.  The mobile app also allows you to make payments online and track your credit score. ",
            "date": "Answered March 7, 2015",
            "views": "557",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "William Jackson",
                    "user_href": "/profile/William-Jackson-277"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Cheshire",
                "href": "/profile/Don-Cheshire"
            },
            "answer_text": "If you have a good credit history I would shop around and see if there are some offering zero percent for the first year or so or a low rate along with a balance transfer. I never bought into the 2% cash back or gimmick cards like that. Look at the interest rate first… what good is if you are paying 19% and get 2% back on purchases.. that’s 17% or close right? Lots of people just go from card to card using the balance transfer low rate period. Stay away from cash advances …those are usually hit with many fees. Good luck… ",
            "date": "Answered November 3, 2018",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Venkat",
                "href": "/profile/Venkat-494"
            },
            "answer_text": "My view is on Chase. There ultimate rewards offered by their line of products such as Chase Freedom, Unlimited, Sapphire Reserve, Preferred and ink are all linked together. This gives the maximum benefits while redeeming their rewards combined. With all these cards combined will score maximum rewards which can benefit a lot while redeeming for travel. You can apply in any of these products here. Chase Freedom Unlimited- Chase Credit Card Application Chase Freedom Chase Credit Card Application Chase Sapphire Reserve Chase Credit Card Application ",
            "date": "Answered December 6, 2017",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Krishnendu Bhadra",
                "href": "/profile/Krishnendu-Bhadra"
            },
            "answer_text": "The term 'Best' is relative. In this aspect also it is same. You need to determine what kind of features and offers you want from the Card Company. So according to your needs you can go for those things. Out of the lot ICICI,HDFC,AXIS,SBI CARDS these are good with offers and services is also good. ",
            "date": "Answered November 30, 2017",
            "views": "125",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wildon Kahen",
                "href": "/profile/Wildon-Kahen"
            },
            "answer_text": " Hi Them have VCC card for amazon prime and work 100% or you want anything else, you can ask them, maybe them also have. contact in sky pe: nwiburn0501 ",
            "date": "Answered April 29, 2019",
            "views": "86",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zonnya Clubb",
                    "user_href": "/profile/Zonnya-Clubb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Wheeler",
                "href": "/profile/Michael-Wheeler-21"
            },
            "answer_text": "The one that offers the best cash back amounts. Check Citi Corp & Capital one just came out with a new one, Quick Silver I think. JUST MAKE SURE THAT YOU PAY OFF EACH MONTH. AMEX has the best customer service, just STAY AWAY FROM MELLON BANK, their customer service is terrible ",
            "date": "Answered August 22, 2014",
            "views": "334",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Wangenheim",
                "href": "/profile/Brian-Wangenheim"
            },
            "answer_text": "HSBC has a great card offer right now. If you get a card with them and spend $500 within 3 months, they will give you $150 cashback. ",
            "date": "Answered December 1, 2017",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brandon Weitz",
                "href": "/profile/Brandon-Weitz"
            },
            "answer_text": "The best company if you are a small business owner would be square. They have no fees, it is as simple as that!! - Brandon Weitz ",
            "date": "Answered November 30, 2017",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexis Sheehan",
                "href": "/profile/Alexis-Sheehan-1"
            },
            "answer_text": "I think Chase has some of the best cards on the market right now. ",
            "date": "Answered September 19, 2016",
            "views": "190",
            "upvotes": "0"
        }
    ]
}