{
    "title": "Which obsolete device or technology do you miss the most? Is it capable of something that you can no longer do? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Heather Jedrus",
                "href": "/profile/Heather-Jedrus"
            },
            "answer_text": "My answer is about software, not hardware. I really miss WordPerfect. I used to do all of my professional paperwork on it, and I loved it. I had so much control over formatting and was able to make my documents look exactly how I wanted them to look. Then my employer switched us all to Microsoft Word, and it was a huge step down. Suddenly I had a lot less control over the little details. Maybe it was easier for some people to use, but I really hated it. For example, I used to put tables in reports that I wrote. In WordPerfect, I was able to easily make custom tables from scratch. I could set it up in a way that made sense for the data that I had. In Word, there were a bunch of table templates to choose from, but I couldn’t customize them. I had to pick the one that was most similar to what I wanted and just live with it. I had no ability to tweak it to my specific needs. This happened some 20 years ago. I have more or less gotten over it, and I really don’t need to put tables in anything that I write now. And I suppose there’s better software out there now for professional writers and publishers. But this was my experience with getting something that was new but not better. ",
            "date": "Answered June 1, 2018",
            "views": "21",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Franz",
                    "user_href": "/profile/Jim-Franz"
                },
                {
                    "user_id": "Abhishek Kumar Amal",
                    "user_href": "/profile/Abhishek-Kumar-Amal-1"
                },
                {
                    "user_id": "Jenny Rofe-Radcliffe",
                    "user_href": "/profile/Jenny-Rofe-Radcliffe"
                },
                {
                    "user_id": "Tina Müller",
                    "user_href": "/profile/Tina-Müller-1"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Megan O'Malley",
                    "user_href": "/profile/Megan-OMalley-3"
                },
                {
                    "user_id": "Karishma Kankaria",
                    "user_href": "/profile/Karishma-Kankaria"
                },
                {
                    "user_id": "Eivind Kjørstad",
                    "user_href": "/profile/Eivind-Kjørstad"
                },
                {
                    "user_id": "Thomas Knowles",
                    "user_href": "/profile/Thomas-Knowles-6"
                },
                {
                    "user_id": "Dan Haggarty",
                    "user_href": "/profile/Dan-Haggarty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyanshu Pandey",
                "href": "/profile/Priyanshu-Pandey-7"
            },
            "answer_text": "I really miss those reel cameras in which one has to devlop the negative in order to see them The whole process of taking a photograph and developing it took days before one could see them.  . But as the technology progressed the value of photos decreased. There were days when one use to call the photographer or unbox the camera themselves to capture the moment.  . I still remember the way all the people came together to catch a glimpse of their memories.  Real emotions flowed out. One paid less heed to the Megapixel and clarity of the picture and more on capturing the humanity of the moment. Alas we all moved ahead and technology took over and photography became the blur in the background and photoshop.Back then one did not care about the pose or filters (popularly used on social media).We moved so fast towards perfection that the beauty lost it's charm and we left the reality behind.  In no means I disregard the advancement and the benefits of the modern day photography. But I want to live in the times where clicking a picture bought excitement and all gathered ifor an event little imperfect little exicited but natural in there own way. ",
            "date": "Answered January 5, 2018",
            "views": "294",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Norton Karp",
                    "user_href": "/profile/Norton-Karp-1"
                },
                {
                    "user_id": "Akash Sinha",
                    "user_href": "/profile/Akash-Sinha-219"
                },
                {
                    "user_id": "Keith Vincent Tucker",
                    "user_href": "/profile/Keith-Vincent-Tucker"
                },
                {
                    "user_id": "Rakshit Baliyan",
                    "user_href": "/profile/Rakshit-Baliyan"
                },
                {
                    "user_id": "Tharun Pasam",
                    "user_href": "/profile/Tharun-Pasam-1"
                },
                {
                    "user_id": "Nahid Fatima",
                    "user_href": "/profile/Nahid-Fatima-11"
                },
                {
                    "user_id": "Raunak Agarwal",
                    "user_href": "/profile/Raunak-Agarwal-34"
                },
                {
                    "user_id": "Ashish Thawani",
                    "user_href": "/profile/Ashish-Thawani-2"
                }
            ]
        }
    ]
}