{
    "title": "Which is the most charitable organization? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Francesca Braddock",
                "href": "/profile/Francesca-Braddock"
            },
            "answer_text": "There are a number of ways you could answer this. If you look at charitable donations and break them down into category you’ll find that religion receives 30% of charitable giving from individuals. So it is my belief that more money goes to either the Catholic or Christian Churches then anywhere else. The different churches then forward that money to the causes they support, a lot of which happen to be other charities. Sometimes their own, such as Catholic Charities USA which is the 11th highest grossing 501c3 organization in the US, in 2017. Grossing $3.733 Billion. From that $895 Million was given by individuals directly to the charity. The rest was donated by other organizations, chiefly the Catholic Church. Catholic Charities USA does have a 92% fundraising efficiency. The largest charitable foundation is the Bill and Melinda Gates Foundation with 40.3 Billion. As far as the biggest 501c3 organizations are concerned the largest in the US are: 1. United Way Worldwide. They made $3.92B last year and are 100% donor dependent. They have a 91% fundraising efficiency and 86% charitable commitment. That is important to know as United Way World Wide is a NPO that mainly gets donations from individuals through paycheck deduction donations. The job of UW is to fundraise more efficiently for other charities. They are among the first charities in the US and they have over 1300 chapters. They allow donors in the workplace to choose their favorite charity and then make donations through UW to that chosen charity. Due to the fact that UW has established itself as a wonderful and more efficient way to donate it makes it so that the smaller charity organizations do not have to pay larger overhead on fundraising with a smaller resultant revenue. Therefore all the money that comes in to UW is then forwarded to other Charities minus UW’s fee to cover their own overhead. 2. Task Force for Global Health - They raised $2.704B last year with $2.668B coming from individuals. Their fundraising efficiency is reported at 100% as well as their charitable commitment. The Task Force for Global Health is able to keep their efficiency high due to the fact that as of 2016 they grossed $3.17B but only had a paid staff of 130. Their fundraising expenses was less then $358 thousand. Their over head including payroll was $4.63 Million. It is noted that their mission deals with vaccinating needed areas. Promoting and acting as an advocacy for vaccines and there fore in 2016 over $3.126 B was donated in the form of pharmaceutics as opposed to cash. 3. Feeding America. Their total revenue was $2.437 Billion of which $2.376B was from individual donations. They are 99% donor dependent and their fundraising efficiency and Charitable commitment are both at 99%. 4. Salvation Army. They raised a total of $1.883B in donations from individuals and had an overall revenue of $3.737B. Their fundraising efficiency is at 87% and their Charitable commitment is 82%. They are reported as 94% donor dependent. 5. St Jude Children’s Research Hospital. They grossed $1.98B in 2017 with $1.369B donated by individuals. They are only 49% donor dependent and have a fundraising efficiency rate of 85% and charitable commitment of 71%. This is presumably due to the fact that only 50% of their donations come from donors and the rest is generated through research, grants etc. Some great sources for the amount of revenue and the financials of charities can be found here: The 100 Largest U.S. Charities BBB Wise Giving Alliance Giving USA 2017 | Giving USA Charity Navigator - Your Guide To Intelligent Giving | Home Charity Ratings | America's Most Independent, Assertive Charity Watchdog | CharityWatch These are great sources to see if charities are donating the money to the causes, how much is spent on the charitable programs and how much is going to the overhead, payroll etc. ",
            "date": "Answered June 19, 2018",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anna Zauhar",
                    "user_href": "/profile/Anna-Zauhar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Augustus Yuan",
                "href": "/profile/Augustus-Yuan"
            },
            "answer_text": "This is a terrible question. All charity organizations are working toward their own cause and you really cannot compare them... It's not like we should all be donating to the best charity organization or something. It's not like an organization such as Heifer International which helps feed people in Africa is \"better\" than the local food bank which helps feed people homeless people in the area or vice versa.  Each organization works to address a problem they see and I don't think it's fair to say one problem is more important than another. ",
            "date": "Answered May 14, 2014",
            "views": "502",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Donna Quiroz",
                    "user_href": "/profile/Donna-Quiroz-4"
                }
            ]
        }
    ]
}