{
    "title": "Which internet browser is easiest to use? - Quora",
    "tags": [
        "Web Browser Recommendations",
        "Internet Explorer",
        "Mozilla Firefox",
        "World Wide Web",
        "Google Chrome",
        "Web Browsers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Sutherlin",
                "href": "/profile/Mike-Sutherlin"
            },
            "answer_text": "I hate to say it. It isn’t something I like to admit. I don’t approve of some of the things it does. But…  Google Chrome is considered by most tech people, at least most published tech people, to be the easiest and most convenient browser to use with Windows. Google has stolen the show when it comes to integrated features. It’s an endless list of something for everybody built-in features that aren’t matched by other browsers. And integrated features go hand in hand with ease of use. Of course, it’s a little like selling your soul to Google. You give up any semblance of privacy you have left, which isn't much. They say you can control what Google tracks and logs. That you can limit the information Google gathers about you. That your privacy is their main concern. Believe what you will. I don’t believe it at all. Google has grown too big and powerful to be told what personal data it can and can’t gather and store. Gather and sell. No one but Google knows what it’s doing completely. The government wants Google to continue. Somebody has to do the work. The government has limited resources and can’t spy on everyone and gather all our data at the same time. Here are a couple of links to lists with the easiest and best browsers. They explain the features that Google does best and why. The last link is from right here in Quora. Chrome is a fantastic browser, but is is still the best among new competitors? Best Web Browsers to use in 2019 - INFOCONTEMPORARY ​What's the best Windows 10 web browser? The benchmarks are in | ZDNet Which internet browser is easiest to use? I avoid Chrome and all Google products as much as I can. My personal rebellion against a monopoly that's not a monopoly. It doesn't help much, it’s really too late, Google still knows too much about me. I use the best, at least to me, browser I have ever come across. It's fast to load, jumps speedily around the internet and blocks all ads and trackers that it can, and that's quite a few. It’s the Brave browser, and it will save you hours of time in the long run while helping you keep your digital breadcrumb trail as small as possible.  Good luck and happy browsing. EDIT: I POSTED A LINK TO WHAT I THOUGHT WAS AN ANSWER, BUT IT WAS A LINK RIGHT BACK TO THIS QUESTION. GOOGLE AND QUORA SEEM TO BE PLAYING WELL TOGETHER. ",
            "date": "Answered December 1, 2019",
            "views": "404",
            "upvotes": " Answer requested by Wendi Woody"
        },
        {
            "author_info": {
                "name": "Irné Barnard",
                "href": "/profile/Irné-Barnard"
            },
            "answer_text": "“Easiest” to use? You mean to actually browse web pages? They are all 100% the same thing for every single web page. The differences are in special tasks around web pages. Normal web browsing is the exact same in all of them. For normal web browsing there is hardly anything to say of any difference between any decent web browser, definitely not from a usability perspective. At least these days where they “finally” started implementing some form of standard. Previously it wasn’t uncommon to see a web page work well in IE and fail completely in Firefox, or a Java script to run fine in chrome but not so great in Opera, etc. etc. etc. For the past 5 to 10 years though I’ve not really encountered any “weirdness” for these types of things. Where things start to differ is stuff like settings, appearance, sync, multi-page, etc. And even there, most perform the same tasks in the same (or at least similar) methods - from the user’s perspective. Where there is trully a difference is in extra features and addons. E.g. things like Chrome work absolutely perfectly for online functions with Google’s cloud services. Things like managing videos you upload to youtube - these integrate wonderfully in Chrome from a functionality standpoint. It’s not impossible to use something like Firefox instead, just slightly less integrated into the browser. In some instances the fact that some things happen through an addon is rather evident, while another browser may seem more seamless. E.g. create a new login to some forum site where they suggest using your gmail account. Chrome’s going to make life a lot simpler, while Brave requires you to login to your gmail in a separate tab first - Chrome keeps you logged in and integrates gmail throughout. The things where a huge difference can be seen is in security aspects. In some browsers certain web pages may not even load up. E.g. Firefox by default just says “NO!” to any web site trying to use Flash. Some other browsers also moved over to the more secure - just ignore these pieces of junk, but there are a handful which out the box still do allow Flash. Then again, some browsers come with built-in blacklists to stop you from browsing sites which were found to harbour malware. Even the old Internet Explorer had this sort of idea. Other browsers may integrate with stuff such as an anti-virus enabling the same sort of thing. This could mean they “feel” both easier and more difficult - depending what you’re trying to do. Probably the biggest “difference” is the integration with your operating system. If that browser wasn’t specifically designed for your particular operating system, then it’s likely going to look a bit weird and/or have some “alien” like features. E.g. the Linux variant of Firefox uses the GTK graphics library and thus look, feel and integrate well on desktops using the Gnome environment, but run it on a KDE Plasma desktop and the menu doesn’t work in the global menu, the colours of the titlebar and buttons don’t match the OS settings, etc. If you really want to know for sure which one works best for you, nearly every single browser in history is free to install. You can try them out as much as you want. Fiddle around and see which of them is “easiest” for your specific needs. Make up your mind about which you like best. And then uninstall the others you didn’t like so much. ",
            "date": "Answered February 25, 2020",
            "views": "50",
            "upvotes": " Answer requested by Wendi Woody"
        }
    ]
}