{
    "title": "Which one is better? IMac 2019 or iMac Pro? - Quora",
    "tags": [
        "Mac (computer)",
        "Apple (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Sandiford",
                "href": "/profile/Philip-Sandiford"
            },
            "answer_text": "I had to address this same question for five Final Cut Pro/Premier edit systems. There is a ton of difference between these two systems. What I needed to address first was what my use would be. In my case it was easy, since the use was right in the title of the procurement request: Five YouTube video edit systems. No browsing, no word processing, no analog audio mixers. The iMac Pro has more high speed Thunderbolt 3 (Tb3) I/O available, a better video card, error checking RAM with more capacity. It costs much more. It will likely be supported a year or two longer for OS updates… maybe. The iMac has one Tb3 port and a hand full of other I/O, a pretty good video card, enough RAM. It costs less. On the balance, we don’t need the Pro for YouTube videos. Take a look at what you want to do and be brutal on your needs v. wallet. Both will be obsolete about the same time. ",
            "date": "Answered January 5, 2020",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lorrn Edmonds",
                "href": "/profile/Lorrn-Edmonds"
            },
            "answer_text": "I saw a guy at Starbucks with a iMac. He made a point about how portable it was. I used to have a Mac plus I carried around. I would get the iMac. Unless I had to travel. More bang for the dollar. Take a look at the Mac mini also. ",
            "date": "Answered October 5, 2019",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Philip Sandiford",
                    "user_href": "/profile/Philip-Sandiford"
                }
            ]
        }
    ]
}