{
    "title": "Which is the best broadband service in Kerala? - Quora",
    "tags": [
        "Mobile Broadband",
        "Broadband",
        "Kerala, India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samrith RS",
                "href": "/profile/Samrith-RS"
            },
            "answer_text": "Well its 2019 and the comments that I see here are pretty old. So, I would like to add my opinion in this year of 2019 on best broadband service in Kerala. I have used Asianet Broadband here in Trivadrum and they are providing broadband plans with decent speed and UL data plans but guess what, the employees ruin it. The customer service(as they call it) is absolutely pathetic. Rude staffs will make you hang up and throw your mobiles away. Then I switched to Keralavision cable network and from them I started receiving 20Mbps UL FTTH service, but the ISP was KingsBroadband and its was excellent. The customer service made me not even to call them but just WhatsApp to get things done ASAP. They send WhatsApp messages if there is any Fibre cut issues beforehand. After few months my cable operator replaced it with KeralaVision 20Mbps UL plan (edit:21/9/2019- my plan got upgraded to 30 Mbps With same rate) and so far its same as the KingsBroadband(maybe they are the same guys in customer care). When I moved back to India from UK, where I had the experience of 100Mbps UL by Virgin, I doubted that my internet usage is going to be hell but thankfully it is way better here when it comes the amount we pay and quality in services. So to conclude and to answer the query Go for Keralavision cable FTTH service Peace✌ ",
            "date": "Updated November 19, 2019",
            "views": "462",
            "upvotes": " View 81 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alana",
                    "user_href": "/profile/Alana-128"
                },
                {
                    "user_id": "Jobin Philip Varghese",
                    "user_href": "/profile/Jobin-Philip-Varghese-1"
                },
                {
                    "user_id": "Gamin Prince",
                    "user_href": "/profile/Gamin-Prince"
                },
                {
                    "user_id": "Jishnu Prasad",
                    "user_href": "/profile/Jishnu-Prasad-5"
                },
                {
                    "user_id": "Raj S",
                    "user_href": "/profile/Raj-S-119"
                },
                {
                    "user_id": "Aravind Ghosh",
                    "user_href": "/profile/Aravind-Ghosh-1"
                },
                {
                    "user_id": "Manikantan Nair N",
                    "user_href": "/profile/Manikantan-Nair-N"
                },
                {
                    "user_id": "Gladwin James V",
                    "user_href": "/profile/Gladwin-James-V"
                },
                {
                    "user_id": "Renin Justin",
                    "user_href": "/profile/Renin-Justin"
                },
                {
                    "user_id": "Sreeram R",
                    "user_href": "/profile/Sreeram-R-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jit Bin",
                "href": "/profile/Jit-Bin-1"
            },
            "answer_text": "Kerala Vision is the best one in Kerala. It’s cheap and you get the speed that you were promised. I have a 30 mbps plan and I always get 29–30 Mbps always and it’s rarely down. Very Reliable, Can pay bill online , check usage etc. and the customer service is very efficient. I have had experiences of complaining at night 8:00 and getting it resolved by a technician in an hour. The Upload and download speeds are always stable. Over all I would give 10/10 for Kerala Vision Broadband. and incase you are using cable tv. Kerala Vision is very very cheap. I have used Asianet and BSNL, but I personally feel that Kerala Vision in the best Broadband Internet provider in Kerala ",
            "date": "Answered September 9, 2019",
            "views": "217",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jayaraman Etaikkoth Mallisseri",
                    "user_href": "/profile/Jayaraman-Etaikkoth-Mallisseri"
                },
                {
                    "user_id": "Aravind Ghosh",
                    "user_href": "/profile/Aravind-Ghosh-1"
                },
                {
                    "user_id": "Jasan Peter",
                    "user_href": "/profile/Jasan-Peter"
                },
                {
                    "user_id": "Jakson McLane",
                    "user_href": "/profile/Jakson-McLane"
                },
                {
                    "user_id": "Johann Binny Kuruvilla",
                    "user_href": "/profile/Johann-Binny-Kuruvilla"
                },
                {
                    "user_id": "Human",
                    "user_href": "/profile/Human-252"
                },
                {
                    "user_id": "Vinod Babu",
                    "user_href": "/profile/Vinod-Babu-190"
                },
                {
                    "user_id": "DK",
                    "user_href": "/profile/DK-762"
                },
                {
                    "user_id": "Alan Kurian",
                    "user_href": "/profile/Alan-Kurian-13"
                },
                {
                    "user_id": "Jijo Bs",
                    "user_href": "/profile/Jijo-Bs"
                }
            ]
        }
    ]
}