{
    "title": "Which is the first electronic car? - Quora",
    "tags": [
        "Automotive Industry",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anjan Merkap",
                "href": "/profile/Anjan-Merkap"
            },
            "answer_text": "There are multiple electronics systems in each car and all were developed separately in separate eras. The development of semiconductors after WWII really accelerated its growth in vehicles. the most demanding electronic part of an automobile is the engine control unit (ECU). The first use of electronics in a car was by Volkswagen in 1968 for EFI (electronic fuel injection) for engine control. It was called the ECU computer, or the Engine Control Unit and was copied by all other auto manufactures. This started an electronic war to develop the car with the most advanced electronics which rages on even today in the areas of fuel efficiency, safety, assisted and autonomous driving. ",
            "date": "Answered November 10, 2019",
            "views": "39",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bruce A McIntyre",
                    "user_href": "/profile/Bruce-A-McIntyre"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arpit Agarwal",
                "href": "/profile/Arpit-Agarwal-604"
            },
            "answer_text": "Flocken Elektrowagen But Around 1832, Robert Anderson develops the first crude electric vehicle, but it isn't until the 1870′s or later that electric cars become practical. Later German inventor Andreas Flocken in 1888 made Flocken Elektrowagen was invented and counted as first electric car in the world but it is not accepted by the society at that time because of there battery risk. ",
            "date": "Answered November 11, 2019",
            "views": "25",
            "upvotes": " Answer requested by Faiz Zariwala"
        }
    ]
}