{
    "title": "Which smartphone has the best camera in 2020? - Quora",
    "tags": [
        "Smartphone Cameras",
        "Cameras",
        "2020 (year)",
        "Mobile Technology",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vansh Mahindra",
                "href": "/profile/Vansh-Mahindra"
            },
            "answer_text": "Samsung Galaxy S20 Ultra 5G Big-sensor main cam gathers a lot of light, unique 9-to-1 binning helps with noise and HDRThe biggest sensor in a telephoto cam, and it's a 4x zoom periscope at that8K video recording.Xiaomi Mi Note 10 Very versatile 5-cam setup with 2 telephotosThe main camera has a big, high-res sensor, similar to the Galaxy S20 UltraUltra-wide cam has AFMost cameras for the moneyApple iPhone 11 Pro Some of the most advanced auto-HDRBest video capture on the marketOnePlus 7T Pro 3x tele offers more reach than the mainstream 2xAF on the ultra-wide camRelatively affordable in the current landscapeThe OnePlus 8 Pro may be out, but it costs a bunch more than the 7T Pro and we're not convinced it's worth it if the camera, in particular, is your top priority. So we're still sticking with the OnePlus 7T for an all-round solid camera experience at a reasonable price. Huawei P30 Pro 5x periscope tele remains among the longest aroundAF on the ultra-wide camAbout half the price of the recent P40 ProHas Google Mobile Services support, unlike recent P40 ProGoogle Pixel 4 XL Photos have that 'pixel look'Then there's the Pixel 4. Usually, a straight-up recommendation when it comes to taking photos on the phone, this year's model comes underequipped - it's missing an ultra-wide camera altogether, and its telephoto is sort of 2x, which is still less than what a P30 Pro or an OnePlus 7T Pro will get you. On top of that, Google's trump card of computational photography which made the Pixel unique is no longer exclusive - everyone does image stacking and night modes now. Huawei P40 Pro All-round great performance from all cameras across most conditions5x periscope get closer to the action than even the Galaxy S20 Ultra'sTop-class selfies, properly good selfie portraits to thanks to ToF moduleGreat video quality at 30fps across the board, excellent stabilizationRealme 6 Pro Versatile triple focal length setup on the backTwo selfie cameras, ultra-wide one is particularly hard to findThere's the occasional phone that punches above its weight in one area or another and when it comes to cameras, the Realme 6 Pro is one such example. It packs a full-featured triple focal length system on its back with a high-res 64MP primary unit, an 8MP ultra-wide, and a 12MP telephoto (plus a 2MP 'macro' we debated even mentioning). It's not quite up there with the flagships in low light, but the main cam fares well, and daytime shots with all three cams are great. But there's more - the Realme 6 Pro has not one but two front-facing cameras. Next to the main 16MP shooter, there's a wider 8MP unit for group shots or to lend more context to your selfies. Where's the wide selfie cam of the Galaxy S20 Ultra or the Huawei P40 Pro, we ask? ",
            "date": "Answered June 19, 2020",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reeti Sharma",
                    "user_href": "/profile/Reeti-Sharma-23"
                },
                {
                    "user_id": "Vivek",
                    "user_href": "/profile/Vivek-857"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Wells",
                "href": "/profile/Robin-Wells-65"
            },
            "answer_text": "There is no best camera and no best lens. Period. It depends on what you want to do. Vacation? Family photos? Studio portraiture? Weddings? Night clubs or theatre events? Walk around snapshots? Birds? Wildlife? Sports? Landscape? Astrophotography? And on.. and on.. Each is unique in some way and each requires specific aspects of lens or camera to be the best. Generally one will compromise in some areas simply because their budget can not afford the best. In almost every case the larger the sensor the better the camera will perform due to physics - dynamic range, color depth and low light performance are all negatively impacted as pixel size in sensor gets smaller and higher resolution will always mean smaller pixels as will smaller sensor size with same resolution. Hence in almost all of the areas listed above larger sensor size is going to provide the best performance. In a lens generally one with wide apertures allowing it to provide incredible depth of field and/or operate in low light is the very best. However those lenses are larger and heavier and more costly. So.. ultimately many will compromise and get smaller and lighter gear as the best is often not necessary in the end. Many like mirrorless, due to weight and size.. at least initially. However unless you drop sensor size in a mirrorless the lenses will be the same physical size and weight for similar performance levels - so in areas like bird photography they offer limited value and some negative performance problems as well. Due to this many areas DSLRs are still the preferred choice. However, for weddings the silent mirrorless shutter is amazing and long heavy lenses are not required. For vacations the smaller lighter camera of the mirrorless format is a bonus. Even more so, look at the micro four-thirds camera - with a smaller sensor it can use smaller and lighter lenses. And performance wise it is not as good - low light performance in a full frame sensor is going to provide same performance in 1/4 the light levels! So yes in dim light they are not nearly as good. Having said the micro four-thirds is over 5 times as good as an iPhone sensor in the same low light levels. So it depends on what you need and what you want and what you can afford. There is no single and no easy answer. ",
            "date": "Answered January 26, 2020",
            "views": "1",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swaroop Bommidi",
                    "user_href": "/profile/Swaroop-Bommidi"
                },
                {
                    "user_id": "Rae Koray",
                    "user_href": "/profile/Rae-Koray"
                },
                {
                    "user_id": "Charles Haacker",
                    "user_href": "/profile/Charles-Haacker"
                }
            ]
        }
    ]
}