{
    "title": "Which brand in mobile category is better between Samsung and OnePlus? - Quora",
    "tags": [
        "Samsung Devices",
        "OnePlus Smartphones",
        "Smartphone Comparisons",
        "OnePlus (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ravinader Giri",
                "href": "/profile/Ravinader-Giri"
            },
            "answer_text": "OnePlus 8 T VS Samsung Full specifications. See who win. Introduction You will be told about this OnePlus 8 T and Samsung smartphones in this blog. We have nothing wrong about any smartphone. So, I have told. All of thing. About OnePlus and Samsung smartphone in it. So, let's see. Who's like. About the OnePlus 8 T and Samsung  Today, we look at the latest and greatest from OnePlus 8 T VS Samsung. It's not actually the greatest per se. Because the Pro still exists. But it is. At least the latest. All over the box is ultra. And we have no idea why. So, this is actually. There viewers' packaging. It's not quite. What you would get if you were to purchase this phone yourself. I don't know if they were trying to take a jab at Samsung, maybe. There's nothing else about this phone that they advertise as ultra. It's not the OnePlus 8T Ultra. It's just the OnePlus 8 T. Now this is pretty fancy packaging. It's like soft-touch everything group. Full disclosure. I did actually open this before. Ooh, reviewer's guide. Good think there's a knife right here. You're not allowed to use the knife. No knives. You have to use a pen. A pen? What are the odds, I can open this with a light bulb? Inside the phone. This is the OnePlus 8T. No, it's a book. - No, this is a book. I guess these are the important things about this phone. A, 120 hertz screen. B, warp charge 65. Video done. Oh man, this is just like, mm. OnePlus is really happy with themselves. So, again. This is the reviewers' packaging. So we do have a few things. That you will not receive unless you. Samsung smartphones is also a good Smartphone. OnePlus 8 T VS Samsung They got their fancy warp- Hargreaves specific case. Here, we have the sandstone bumper case in cyan. Ooh, it's actually, it feels nice. Let's get to the phone. That's what you people are here for, anyways. Wow, that's box for a smartphone. It's almost like a watch box. OnePlus. Got a quick-start guide. Then see SIM card removal tool. But what is under here. The OnePlus 8T is more than a phone. It's a challenge. I think we'll leave it at that. I don't know what this is. What's that SAR value? Apparently the SAR values are only collected by the FCC to make sure that cell phones do not exceed the FCC's maximum permissible exposure levels. So it's a highest SAR value. Safety information.  There is nothing in here we need. We not got some stickers. And here is the phone. Okay. So there's definitely some differences here, right off the bat. We'll get into those in a sec. What else is in the box here? You got the typical OnePlus cable. So this is actually a special cable, sort of. It's got to support what is in this box down here. The warp charge 65 brick. And this is really the important part of the OnePlus 8 T. At least according to OnePlus. This charger supposedly can charge the OnePlus 8T to 58% in just 15 minutes. And 100% in 39 minutes. If you really hate your battery, would not recommend using this all the time. 10 volts at 6.5 amps, that's their 65-watt warp charging. That's a lot of both. I would be concerned that this phone would get pretty, pretty freaking hot. Maybe we'll plug it in to see. OnePlus 8 T. But before we get into the phone. So right off the bat, of course, the 120 hertz, buttery smooth. It's like its predecessor, the OnePlus 8. This is still a 6.5-inch OLED. We actually have a little bit lower screen-to-body ratio. I think, 'cause the side bezels are a little bit more pronounced. We have less of a top bezel this time. It feels more balanced. It looks like it's framed nicely because of the bezels. And we still have that same pinhole camera. For the 8T in either colour. This is their aquamarine green. There's also lunar silver with 12 gigs of Ram and 256 gigs of storage. You're looking at 749 U.S. That's pretty pricey for a phone. That's pretty cheap, actually. For a flagship phone, I think, you're spending a thousand bucks, usually. So I guess it is under that. On the outside, aside from the screen, having slightly different bezel layout, it's mostly the same on the front. We have the same buttons on the side. You've got the mute switch. You got your same power button and volume on the other side. The only big change. In OnePlus 8 T VS Samsung. We're going to see here is the cameras. Now on previous OnePlus phones. You'd see the cameras sort of in the middle, which it's kind of a dated look, but finally they've switched over to a more modern status quo, left-justified camera. There is some changes to the camera this time. We actually have laser auto focus. As for the sensors in the camera. We're still using the same Sony 48-mega pixel main shooter. We have a 16-megapixel ultra wide. that's actually a few degrees wider, which is nice. For the macro lens. We've gone from two megapixels to five, and they've actually included a monochrome sensor.  Which I think is just OnePlus 8 T nomenclature for depth sensor. In terms of feel, this phone like feels really nice in the hand. It's weighted beautifully, maybe a little bit top bias, which is fine. nobody saw that. One thing I didn't mention actually is the front camera. We get our macro, and then ultra wide. I find that ultra wide camera's always look so weird. Yeah, the distortion fixing is never that great. If you can move. Back to the internals of the phone, this time, we have the same Snapdragon 865 processor. The same RAM layout. You can either get 8 or 12 gigs. For storage, depending on region availability, you're looking at 128 or 256. Although this time it's UFS 3.1 rather than 3.0. So maybe that'd be a little bit faster. We of course have the warp charge 65. That I mentioned earlier. And there's some changes to the battery to accommodate that sort of charging. So rather than a traditional single cell battery. like you'd see in most. Oneplus 8 T and Samsung smartphones. This one actually has two discrete cells. A and supposedly they can each handle 30 watts of charging at the same time. Which is pretty impressive. Now to keep this thing from blowing up. Unlike the Note 7 Samsung, maybe that's a dead meme at this point. We should probably stop eating that corpse. They've actually integrated 12 discrete temperature sensors throughout the phone. I don't know how many temperature sensors a usual phone has. I'm guessing that's probably at least a couple. So maybe they've added a few more, but they say it should be good. And with the new heat dissipation system that. They've integrated, supposedly it should stay cool even while you're using it and charging with warp charge 65. So I think I should actually plug it in and try that. I wonder if we can watch this go up again. This battery will not last very long if you keep using this. Let's try the fingerprint sensor here. It's really hard.- It's so similar. I'm going to say maybe the One Plus one a little bit. But when you're getting this fast anyways, like it doesn't even matter. At a fraction of the cost. Yeah, a fraction of the cost. It's like probably 40%cheaper than that phone. Now there's one thing. I wanted to check inside the settings here. This is the first OnePlus 8 T phone to have an always-on ambient display. This is pretty slow to the party. This feature will be disabled below 5%. Okay. I locked the phone. Look at that. One thing we didn't mention is like other One Plus phones, same with the OnePlus 8t and the OnePlus 8 Pro, there's no expandable storage. But I think if you're getting the 256, that's probably plenty for most people. If you're a power user, you're probably going for amore expensive phone anyways. So I guess leave that up to you guys. One plus 8 T and Samsung going to plug the phone back in just to see if it actually gets hot. Cause we wanted to try that. We've got our warp charge going, 76%. For speakers, it looks like we do have an earpiece speaker here. Hopefully that works as stereotypes. And then on the bottom. It's not front facing, but it's downward firing, and hopefully they work together. And the brand new X box Series X. Yes, my friends. Okay,. So, it's. Definitely using both speakers for stereo audio. Sounds kind of tangy. I mean we are listening to Linus's voice. For the price difference here, I think they're both pretty good. You're not going to be stressing about the speakers on this phone. They're pretty good. So, We've been warped charging for five minutes. Probably. At least now. It doesn't even feel warm at all. If you told me this was charging, like you handed me two phones, and one was charging and one was not, and told me to pick which one it was. I probably wouldn't be able to tell you.  OnePlus 8 T VS Samsung. I plugged the Note 20 Ultra in right now. It would get hot, like immediately. Okay. Let's leave it for a minute, two, a minute or two here and see what happens. We'll have to for a few more minutes. It's now at 88%. It's like ice cold, dude. If I told you this phone was charging at 65 watts, would you believe me? - No, it's not charging. It's off. - It's literally. It just feels like it's doing its thing. - It's not doing anything. It's like cold. Like it's actually. It's not cold. But it's. I mean, the ambient temperature in here is like 18 degrees or whatever, it. Your hand will probably warm it up faster. - Well, that's why I tried to leave it for a bit. Is it starting to feel warm. And I was pretty sure it was my hand. That's crazy. So, I guess if charging. While staying completely. Ambient temperature is on your list of things for a phone. The OnePlus 8 T VS Samsung. You're probably gonna want to wait for the next generation. I always feel like the T series devices from OnePlus are kind of a tease. You never get the same software support as the previous gen. Like they're going to treat this like a OnePlus 8 in terms of updates, probably. It's nice. The screen feels good. It's fast. So, I guess. If you like the latest and greatest from OnePlus, this could be the phone for you. Upvote, if found helpful Thanks to see my blog. ",
            "date": "Answered October 21, 2020",
            "views": "829",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Titus Cherian",
                    "user_href": "/profile/Titus-Cherian-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramakrishna",
                "href": "/profile/Ramakrishna-158"
            },
            "answer_text": "No doubt it's Samsung. I am not going to talk about cameras or any other fancy user interfaces. There are some features which makes Samsung a unique mobile phone brand. Samsung DeX: You can connect your Galaxy mobile to computer screen and access some of the mobile apps in big screen through cable. It is like desktop mode for mobile. Samsung Pay: No need to carry any credit/debit card. It supports both contactless payment using NFC and magnetic stripe transaction. MST is Samsung's patented technology. Through MST, merchants can accept payments on regular card machines which makes Samsung Pay the most widely accepted mobile payment service. You can authenticate the card before payment using Iris, Fingerprint, PIN. Samsung Pay works everywhere you can swipe or tap your card, making shopping or dining easier and more convenient than ever. Samsung Pay also supports BHIM payment or UPI payment, you can send money through samsung pay. Bill payments also available. Samsung Pay partnered with almost major banks in India. Samsung Pay accepted worldwide. Google Pay, PayTm never works in payment terminals( POS terminals). Only Samsung pay supports terminal payments. These is no alternative to Samsung Pay( Apple pay , LG pay doesn't work in India) . If you are using Windows 10 laptop , you can syncronise your Galaxy mobile with laptop using Windows phone connect app. You can make/recieve calls, send sms, view your gallery photos, get notifications ( these features are available in all android phones also) directly from laptop. But more interestingly you can access some of your applications which are installed in mobile phone through Laptop screen. No cable required just wifi connection is enough, when you turn on your laptop, it automatically connects and synchronises everything. Microsoft has partnered with Samsung. These are the unique features which One Plus doesn't offer. And after sale service, customer service is best in Samsung. Chinese brands mobile are famous only for Camera, screen, more powerful professors, high specs for less price. For more details see below links: DeX Mode | Device Multitasking | Samsung US Samsung Pay - Mobile Payment Service & Offers | Samsung India Sync Your Phone to Computer: Your Companion App | Microsoft ",
            "date": "Answered October 1, 2020",
            "views": "38",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bindu Shree",
                    "user_href": "/profile/Bindu-Shree-190"
                },
                {
                    "user_id": "Leonard Selvaraja",
                    "user_href": "/profile/Leonard-Selvaraja"
                },
                {
                    "user_id": "Bunty Mir",
                    "user_href": "/profile/Bunty-Mir-1"
                }
            ]
        }
    ]
}