{
    "title": "Which are the most prisoner-friendly prisons in the world? - Quora",
    "tags": [
        "Specific Prisons in the United States",
        "Jails",
        "Inmates",
        "Criminal Justice",
        "Prisoners",
        "Prisons and Prison Life",
        "Crime"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ronnie Greeb",
                "href": "/profile/Ronnie-Greeb"
            },
            "answer_text": "My guess off the top of my head would be Switzerland, or Norway. It turn out to be Halden Prison in Norway. Below is some research I did that lists the top ten humane prisons in the world. ” Let's face it, being sentenced to time behind bars is no joke. There is a grim picture in all of our heads when we think of the slammer. We think of a dark and damp atmosphere, a constant fear of safety and an overall misery of being confined to a tight space with sometimes no end in sight. Perhaps all of the prison shows we see on television paint that awful picture in our heads. With every Law & Order episode, the last place we all are reminded we don't want to end up is in a yard gang war, an isolation room or even worse - the showers!” ”According to BBC News, there is roughly 9 million people incarcerated worldwide to date. With such a large population of people locked up, the areas of imprisonment have changed over time. Technology has advanced, morality has changed and voices have spoken. This has created a difference in the way prisoners are treated and spend their time behind bars. Whether you are Joe Blow or a powerful politician, justice does get served and sometimes it is with a silver spoon! Take a look at the following 10 humane prisons from around the world...” Inside Halden Prison, The Most Humane Prison In The World By All That's Interesting Published July 28, 2011 Updated February 3, 2019 A fascinating look inside what's been called the most humane prison in the world: Halden Prison in Norway, featuring cells with flat screen televisions. When one thinks of prisons and prison life, thoughts often drift to depictions found in Oz or the Wire: full of hard living and sexual, physical, and emotional abuse. However, there is one prison is Norway that has been called the most humane prison in the world: Halden Prison.  Halden Prison opened early in 2010 with a capacity of 252 prisoners. The prisoner cells include flat-screen televisions, which officials say are necessary so that prisoners have less room for drugs and contraband. Designer furniture, mini-fridges, and en suite bathrooms complete the prison cells.    Half of the guards are females, and guns are not usually carried because they create “unnecessary intimidation and social distance.” During the day, inmates can shoot hoops, climb the indoor rock wall, go jogging or make use of the soccer field. The philosophy behind this is that an occupied prisoner is less a violent prisoner, and thus is less likely to lash out at guards or other inmates.Though the statistics are calculated differently in each country, only 20% of Norwegian prisoners return to jail within 2 years, compared to 50-60% in the US. Prisoner governor Are Hoidal was quoted as saying: “In the Norwegian prison system, there’s a focus on human rights and respect. We don’t see any of this as unusual.” SAN PEDRO PRISON, BOLIVIA when digging up some more research I found this to be fascinating. Via Around This World - Round-the-world travel, photos, and tips. Behind these walls, you would think you have just entered a vibrant and flushing market with men, women and children bustling by. In La Paz, Bolivia, this prison has created an entire flourishing community for itself. Each prisoner must pay for his own cell, therefore creating a strive to make money. Each cell goes for a different price, the more luxurious cells range from $1000 to $1500 USD for the entire sentence. One must work to make money, therefore within these walls, establishments were created in order to employ those needing to pay. Within the community there are restaurants, salons and a hotel. This has created jobs such as hairdresser, repairmen and laundry attendants for the imprisoned. The concept of working for your stay allows for the prisoners to maintain a sense of hard work for a goal. As Sam Ewing once said, \"Hard work spotlights the character of some people, some turn up their sleeves, some turn up their noses, and some don't turn up at all.\" Another interesting concept to a challenging situation and reaching a goal of rehabilitation was this Prison below. OTAGO CORRECTIONS FACILITY, NEW ZEALAND Via http://cctv-africa.com This facility takes the cake when supplying the best future for its inmates. Otago has helped ready inmates for actual booming careers in the outside world as well as at home remedies for everyday well balancing. In terms of careers, Otaga has incorporated certification within their walls to allow inmates a chance at carpentry, engineering, dairy farming and cooking! Not only have they provided great trades for the inmates to carry on a 'normal' job but have introduced tomato farming as well. Over 30,000 tomato plants have been distributed thus far that were grown by inmates themselves. Gardening has helped inmates feel a concept of contribution within society as well as practice patience as it takes several months to bloom fully. This time of solitude and reflection while gardening continues on after their release a lot of the time. Seems like the tomatoes were not the only thing growing... I know what some people are thinking are these prisons also hose multiple murderers, rapists etc… highly doubtful. JUSTICE CENTER, AUSTRIA Via Mieke Vullings Architect Josef Hohensing designed this spacious prison to house 205 inmates. This stunning layout was finalized in 2005, emitting nothing but respect. Justice Center houses non-violent crime inmates and is decked out in floor-to-ceiling windows. It is a piece of artwork, yet an establishment providing justice to those in need. Upon the walls a message: \"All persons deprived of their liberty shall be treated with humanity and respect for the inherent dignity of the human person.\" This building provides a balcony for each inmate, as well as a private bathroom, kitchenette, television, basketball court and weight room. It is easy to forget that inmates are humans after the damage has been done. Penalties should always been given, but to this glamorous extent, we might question \"is this really jail?\" Perhaps there is more respect for a non-violent crime versus a gruesome multiple murder, therefore allowing the 'petty' criminals to be housed in such a dignified manner. They don’t house violent offenders. if you want to read the 7 or so left from the top ten here is the website I used. You can research each individual prison and look up statistics such as repeat offenders and more detailed statistics. Therichest.com and allthat’s interesting.com/humane-prison ",
            "date": "Answered October 28, 2019",
            "views": "52",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephen M. Herbert",
                    "user_href": "/profile/Stephen-M-Herbert"
                },
                {
                    "user_id": "Donald G. Boudreau",
                    "user_href": "/profile/Donald-G-Boudreau"
                },
                {
                    "user_id": "Ethan Johnston",
                    "user_href": "/profile/Ethan-Johnston-26"
                },
                {
                    "user_id": "Jack Meng",
                    "user_href": "/profile/Jack-Meng-28"
                },
                {
                    "user_id": "Jonas Lillelid",
                    "user_href": "/profile/Jonas-Lillelid"
                },
                {
                    "user_id": "Geneva Ashdene",
                    "user_href": "/profile/Geneva-Ashdene"
                },
                {
                    "user_id": "Erk Lai",
                    "user_href": "/profile/Erk-Lai"
                },
                {
                    "user_id": "Fergus Hunter",
                    "user_href": "/profile/Fergus-Hunter-1"
                },
                {
                    "user_id": "Ian Hinkle",
                    "user_href": "/profile/Ian-Hinkle-2"
                },
                {
                    "user_id": "Hunter Brown",
                    "user_href": "/profile/Hunter-Brown-29"
                }
            ]
        }
    ]
}