{
    "title": "Which one is more important in today's society: Internet or electricity? - Quora",
    "tags": [
        "Social Dynamics",
        "Society",
        "The Internet",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alessandro Bracci",
                "href": "/profile/Alessandro-Bracci"
            },
            "answer_text": "Well it's a really good question indeed electricity, at least in most advanced countries, is a very common utility for consumers while internet in these countries is not wherever and whenever available, i mean mobile internet connections, or is not available at maximum possible speed. I think some rural areas in countries such as Italy or France where instead electricity is generally available 24 hours for day.  Anyway I think that electricity is more important tha internet because a lot of services depends on it, such as air conditioning, fridges, personal computers and lighting. Yes in some rural areas of Africa people can use mobile phones and partially internet but they need always electricity for charging these phones. Another proof of the bigger importance of electricity is the current diffusion in some countries of Africa of small stand alone power generator used for charging mobile phones. Finally I can say that currently electricity can be considered not only a service but an essential thing. ",
            "date": "Answered May 19, 2015",
            "views": "632",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aboozar Zamani",
                    "user_href": "/profile/Aboozar-Zamani-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepak Karunakaran",
                "href": "/profile/Deepak-Karunakaran-2"
            },
            "answer_text": "I think even though there are large parts in the world without electricity, for most part electricity is a given. And I am sure that in future electricity will be readily and reliably available throughout the world with more powerful and efficient batteries to rescue in case of failures. Electricity is needed in hospitals.  Given that, internet is of course important too, but its less inconveneint to live without it. We need data and for considerable amount of time we can buffer data in our local systems to keep us engaged when internet is down. At the moment internet is mostly for entertainments. ",
            "date": "Answered August 5, 2015",
            "views": "307",
            "upvotes": "0"
        }
    ]
}