{
    "title": "Which laptop should you prefer between Dell and HP? - Quora",
    "tags": [
        "Dell Laptops",
        "Dell (company)",
        "Hewlett-Packard (company)",
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Exedor Montag",
                "href": "/profile/Exedor-Montag"
            },
            "answer_text": " These other answers are pretty bad. Basically people saying “I have one and it’s fine” and “I refuse to believe I bought garbage”. Fact is HP as a brand makes the LEAST reliable laptops. As someone who has made a living repairing computers for over 20 years I can tell you unequivocally that it’s far worse than even these stats reveal. This simple bar graph doesn’t reveal the types of failures. With HP it’s largely motherboard failures. This is about the worst thing to have happen to your laptop as it is almost never worth it to pay what it costs to replace the motherboard, and even if it did the replacement would still be the same exact model of failure-prone motherboard. Acer, for example, looks almost as bad but their failures tend to be largely things like broken plastic hinge covers and key caps coming off, not cool, but the computer is still usable. Though they do seem to have a lot of motherboard failures as well. Now Dell, they look pretty middle of the road, but they are actually the best mix of price-performance-reliability-repairability. So if we start by dismissing every brand to the right of Dell as less reliable, I’ll explain why every brand to the left is disqualified as well. Apple: Double to triple the price for the same specs, difficult to impossible to repair, doesn’t come with the most popular OS. Less than 1% more reliable than Dell. Sony: Well they quit the industry and no longer make computers so forget them. Toshiba: Two things, these stats were release before Toshiba entered the low end market, if they were updated they would look much worse. But more importantly Toshiba literally cripples the performance of every laptop they sell by drowning it in “Toshiba Crap” so if you buy a 3ghz i7 it’s gonna feel like a 2.3ghz. Now all the makers install their junk but Toshiba installs way way more of it and it’s more difficult to remove. Dozens and dozens of Toshiba and third party junk bogging down your brand new computer. Some of which you cant just uninstall because you’ll get errors every time you boot up. You basically need to reformat your brand new computer soon as you buy it if you want it to perform up to it’s specs. Also their customer service and warranty resolution is worse than Dell or HP. Asus: They built their business supplying their super reliable motherboards to other companies, first and foremost Dell. Their laptops tend to be reliable, as the graph indicates. The problem comes in when you do have a problem. Trying to get them to honor a warranty is like pulling teeth, their company is not set up for dealing with retail customers and it shows every time you have to interact with them. For one hilarious example consider the fact that they don’t even have a spare parts department in their company! Dell: Their customer service and warranty support is “barely tolerable” which is far better than all the rest except Apple. And their out-of-warranty repairs are actually even sometimes cost effective. They’re generally among the easiest to disassemble and reassemble so out of pocket repairs are cheaper, the parts are readily available and their motherboards last for 10+ years in most cases. So Dell wins. Not because they are super fantastic, no one “builds them like they used to” but because literally everyone else is either worse, or double to triple the price for slightly better. I could go on and on with far more details and reasons for each of these points but I think you get the idea. ",
            "date": "Answered July 4, 2017",
            "views": "4831",
            "upvotes": " View 1.5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Norton Karp",
                    "user_href": "/profile/Norton-Karp-1"
                },
                {
                    "user_id": "Shiva Charan C",
                    "user_href": "/profile/Shiva-Charan-C"
                },
                {
                    "user_id": "Daniel Brown",
                    "user_href": "/profile/Daniel-Brown-161"
                },
                {
                    "user_id": "Naveen Prakash",
                    "user_href": "/profile/Naveen-Prakash-188"
                },
                {
                    "user_id": "Anmol Sandhu",
                    "user_href": "/profile/Anmol-Sandhu-5"
                },
                {
                    "user_id": "Upmanyu Kumar",
                    "user_href": "/profile/Upmanyu-Kumar"
                },
                {
                    "user_id": "Abhimanyu Shaw",
                    "user_href": "/profile/Abhimanyu-Shaw-2"
                },
                {
                    "user_id": "Srishti Shrivastava",
                    "user_href": "/profile/Srishti-Shrivastava-11"
                },
                {
                    "user_id": "Dhruba Ojah",
                    "user_href": "/profile/Dhruba-Ojah"
                },
                {
                    "user_id": "ARUN SAHETYA",
                    "user_href": "/profile/ARUN-SAHETYA"
                }
            ]
        },
        {
            "author_info": {
                "name": "J Marsh",
                "href": "/profile/J-Marsh-3"
            },
            "answer_text": "Dell. In my opinion HP should be making steak sauce instead of laptops. That way when you notice a bottle has gone bad it's not a big deal to replace it. Unfortunately they are one of the companies who think this is ok. I think they would rather their customers buy a new one every year, because honestly that is about how much time SOME of their laptops last. .I recycle computers. I rebuild them when I can, strip them down to nothing when I can't. It's interesting to see how people express their emotions with their laptop computers. They throw them, they smash them or and actually most of all they rip the screens off. The best laptop for me to find is one with simply a broken screen. they at simple to replace and you know that when that screen broke somebody was using the laptop so there probably isn't anything else wrong with it. That is not how I normally get HPs 's they're very nice looking ,they're beautiful, most of them look brand new. And they don't work. They have some unrepairable defect ( that would be the motherboard) and they just don't work. Of the hundred or so laptops I've been through this year I've had 8 HP G60's or G61's. They have the same issues. Unfortunately because this seems to be a cost cutting result they sold many many laptops and a) seemingly did noting to help the majority of their customers who had to replace a machine affected by a manufacturer defect. And b) just kept on selling them to more people. They even came out with further models and did not seem to address this issue. Dell, they don't do that. Their customer service is helpful to the point of being a bit pestering. Their mistakes they seem to address, they are more trustworthy for one thing. theyb I keep some of the laptops I fix - I can't help it, I have my favourites. Every Dell that comes through is a favorite. I don't know why but they are. I do not get dells that are unfixable unless a) someone has opened it and tried to FIX it… or they have been loved to death. The laptops I don't keep ( and often the ones I do) basically get sold for the cost of the ram and the hdds ( replacement cost, I'm shy of both and half the time they are not in what I find) or I guess I basicly let them get stolen from me. I can say that because I've had more stolen than I've sold. By three times more. I look at it this way, they must have needed it to cook up something like that to get it. I like it when they keep them and use them, after all that's kind of why I'm doing this. No one steals the HPs cause they don't work. They do look brand new though. They are. Set that thing on your bed once and the heat, because they have used the cheapest heat sinks and fans they could, destroys that laptop like a torch with a marshmallow. The motherboards overheat, components fail on the mainboard and they are never the same again. I've actually never had a Dell do that. So. When I get a whole bunch of computers in that have been “retired” and a lot of them are HPs , and none of them are fixable.. that's how I feel. All the dells get stolen. … My answer is Dell because they try, that and HP makes some poor quality low end laptops and some very high quality high end ones. Which are much better because they don't cheap out on the parts. That's not nice. I don't care what you make, if your using something you know is sub par in your product your hearts not in it and I don't want one. Oh, but if you do have a G60 I found out that if it is still alive you can replace the heat sink and the fan, and best of all even if you don't, you can scrape the chewing gum off the processor and video card and put much better quality heat transfer compound on for just a couple bucks ( whole tube - 100 applications for less than 10.00) and that will most likely save your laptop. ",
            "date": "Answered September 2, 2018",
            "views": "681",
            "upvotes": " View 65 Upvoters",
            "upvoters": [
                {
                    "user_id": "Soundarya Naskar",
                    "user_href": "/profile/Soundarya-Naskar"
                },
                {
                    "user_id": "Celine Abraham",
                    "user_href": "/profile/Celine-Abraham-3"
                },
                {
                    "user_id": "Marjorie Cragin",
                    "user_href": "/profile/Marjorie-Cragin"
                },
                {
                    "user_id": "Sylesh Kumar",
                    "user_href": "/profile/Sylesh-Kumar"
                },
                {
                    "user_id": "Anaturuchi Iroapali",
                    "user_href": "/profile/Anaturuchi-Iroapali"
                },
                {
                    "user_id": "Jeffin Jose",
                    "user_href": "/profile/Jeffin-Jose-5"
                },
                {
                    "user_id": "Erick Kieti",
                    "user_href": "/profile/Erick-Kieti"
                },
                {
                    "user_id": "Clayton D",
                    "user_href": "/profile/Clayton-D-5"
                },
                {
                    "user_id": "Gee Fageer",
                    "user_href": "/profile/Gee-Fageer"
                },
                {
                    "user_id": "Annie Stone",
                    "user_href": "/profile/Annie-Stone-16"
                }
            ]
        }
    ]
}