{
    "title": "Which are the best and cheap laptops for daily use? - Quora",
    "tags": [
        "Daily Use",
        "Laptop Shopping",
        "Laptop Advice",
        "Daily Life",
        "Best of X",
        "Laptops",
        "Shopping",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Leone",
                "href": "/profile/Rob-Leone-4"
            },
            "answer_text": "Which are the best and cheap laptops for daily use?  To me a value laptop has to have an AMD processor. Although some Intel laptops have come down in price. It is AMD who has your best interests at heart. It took a long time. But, AMD has finally been able to make milestone victories over Intel. What this means? This means soon you will see value laptops out there with a decent processor. Not that Pentium/Celeron crap. Intel has gouged you for the last time. You will find i5 processors cheaper now, but they lack in parallel GPU computing, so unless you want one with a discreet GPU, this means the GPU is an entity of it's own and soldered into the main board (motherboard) this will cost a lot more. They will start to surface even more now. Right now at Hewlett-Packard you can get a hell of a awesome processor in a custom laptop that will far exceed anything Intel puts out. Their on board GPU technology far surpassed anything Intel has to date. These are called APU's they are a hybrid CPU/GPU on same chips, or a dedicated chip. Ryzen/Vega! See bottom for deals - Athough, single thread processes seem to be still in Intel's corner. However, think of it like this, how often on your computer are you doing 1 thing? Never. Most people have multiple processes running at the same time, most are hidden. Don't fall for this bait. Benchmarks for testing parts are skewed. Not to mention when you turn your new computer 0n for the first time it's already running multiple processes. That's enough of squashing Intel. On to the rest. Now, you can get a crazy good laptop for a fraction of the price. Intel has dropped their prices because AMD. You can now get a Intel for cheaper. However, now.. GPU's are running parallel processes. So, now it's important to know that they can work together to do more than just gaming. These computers AMD are making are in a class all their own. Things to look for in a computer. You need an SSD. This is flash memory in the fact that it has no mechanism inside to break. These days their price has dropped significantly. The newest technology is NVMe M.2 this is a SSD that is now running off of the PCIexpress bus. What this means is more faster! At the very least you want an SSD. A regular mechanical drive will not cut it anymore HDD. This have been the so called “bottle neck” of computers for a long long time. If you must get a mechanical drive, make sure it's not the main drive you count on for running your OS off of. OS = operating system. What you can do is save or archive your information on these. But, when working on a file, bring that file onto the SSD, and you will enjoy speeds that will blow your mind. When looking for RAM in a laptop. Watch what you get, this is an areas that has been severely gouged for upgrades. Depending on what you are doing most laptops already have what is needed, unless you have a computer for something such as video editing, I wouldn't worry too much about RAM. 8–16gb of ram at the DDR4 level will suffice. DDR3 is old tech. Try to stay away if you can. I would not worry about RAM too much anymore, unless like I said, you are doing hard core processing of large data chunks, such as video editing. It's not to say these budget computers AMD makes can't do those types of processes, it just there are better ones for such. However, Hewlett-Packard has a deal where you get extra RAM while still being the lowest priced laptop that doesn't have a Pentium in it. (For real Intel, a Pentium/Celeron?). Sorry… Even Acer has a very low budget computer that has a mediatek quad core in it that was usually made for phones, however this wonderful company has started to make laptop, usually they are hybrid computers that can be a tablet and a laptop with a keyboard. They are very good computers for someone who just wants to browse the internet and do very light processing. These laptops are up against the crap Intel tosses out at the 200+ range. On occasion they can be cheaper. Screen capabilities will cost you. A standard 700x1200 or 1080x1920 will suffice. The upgrades will be 2k and 4k. If this is something you want, by all means however you won't see these in a value laptop. To me these days most people need are a nice Chromebook. Most all the programs are free. Just like on an Android phone. Google makes these and they don't need all these extra bells and whistles I am talking about. However, you have to decide what works for you as far as operating system. Windows is a little more expensive and also you have to pay for the good programs, although this is leaps and bounds cheaper then APPLE computers. Chromebooks are on the same level for security as an apple. And now Chromebooks are becoming even more powerful. Adobes launch of apps for Android have been greatly appreciated. A computer that does everything a MAC can do is by far so much cheaper on every level it is pathetic. But, if apple is what your kids wants, sucks for you! Lol So, what you really need to decide is how much you will spend. My suggestion of you have the money is to spend around 500$ on a windows PC or around 300–400 on a Chromebook. Spending a little extra here can make your computer last many years longer. With spending a little more you get a whole lot more. Especially from Hewlett-Packard. Start to build a custom PC of your choice shell, and pick of few of the innermost parts and get some real satisfaction out of it. You will be happy you did so. Dell makes wonderful computers at a slightly higher price point. Their XPS computers are great for Multimedia applications and medium weighted gaming. Gaming is a whole knew can of worms but with AMDs APU technology this is a reality for lower price points now. So this is my 2 cents. Enjoy. I highly recommend this computer. You can even customize it further. Not many laptops give you the option of different colors. No other computer at this price point has 16gb of RAM. $509.99 AMD Ryzen™ 5 3500U (2.1 GHz, up to 3.7GHz, 6 MB cache, 4 cores)+AMD Radeon™ Vega 8 Graphics 16 GB DDR4-2400 SDRAM (2x8GB) 15.6\" diagonal HD SVA BrightView micro-edge WLED-backlit touch screen (1366 x 768) 256 GB PCIe® NVMe™ M.2 Link below https://store.hp.com/us/en/ConfigureView?catEntryId=3074457345619203818&catalogId=10051&jumpid=ma_weekly-deals_product-tile_laptops_2_5mu54av-1_hp-pavilion-laptop--&langId=-1&quantity=1&storeId=10151&urlLangId= ",
            "date": "Answered August 21, 2019",
            "views": "35",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lava Kuriti",
                    "user_href": "/profile/Lava-Kuriti"
                },
                {
                    "user_id": "Móhâñ Sai Ram",
                    "user_href": "/profile/Móhâñ-Sai-Ram"
                },
                {
                    "user_id": "Stassi Sands",
                    "user_href": "/profile/Stassi-Sands"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shailendra Kumar",
                "href": "/profile/शैलेंद्र-कुमार-Shailendra-Kumar"
            },
            "answer_text": "Buying the best and cheap laptops these days is quite easy because of the digital revolution. Smartphones are more than capable of handling most tasks, but a full keyboard with powerful specs will ensure you get more work done in less time.  The Lenovo laptop is an ideal pick but make sure you look for some basic features such as full HD display, lots of connectivity ports and a reasonable price tag. Some of the major manufacturers do offer affordable solutions in India. You can easily buy an HP laptop or a Dell laptop for less than 30k. I have listed some of the best laptop models that satisfy the necessities and are an amazing pick for daily use. • HP 14-inch laptop with 7th gen i3 processor and 1TB storage • Dell Inspiron 3567 15.6-inch laptop with i3 processor, Windows 10 and MS Office • Acer Aspire 3 Intel Celeron 15.6-inch model with 500GB storage • Lenovo Ideapad 330 Intel i3 processor with 1TB storage • HP 250 G6 Intel Celeron Dual Core processor 15.6-inch laptop • Dell Vostro 3478 i3 processor 14-inch laptop You can pick the one that best suits your requirements. Be it a 30k laptop or an expensive 60k laptop; there is an option to own them without breaking your wallet. Visit the showroom or a retail store that sells laptops where you can avail EMIs. With easy monthly instalments provided by companies like Bajaj Finance, you can easily own expensive products such as Asus laptop or Lenovo laptop immediately. Just pick the one that provides the best value for money with additional features like SSD and better sound combined with a powerful processor. Once you have selected the model, be it HP laptop or Dell laptop, you can choose to either pay in full or opt for EMIs which should ease off your financial burden. ",
            "date": "Answered May 30, 2019",
            "views": "33",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Naina Kapoor",
                    "user_href": "/profile/Naina-Kapoor-33"
                },
                {
                    "user_id": "Amit Kumar",
                    "user_href": "/profile/Amit-Kumar-123-1"
                }
            ]
        }
    ]
}