{
    "title": "Which is better for gaming, a wired or a wireless mouse? - Quora",
    "tags": [
        "Computer Peripherals",
        "Computer Mice",
        "Wireless Technology",
        "PC Gaming "
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Tran",
                "href": "/profile/Jonathan-Tran-9"
            },
            "answer_text": "Uh, the proper response is wired. That’s what most serious gamers would tell you. I used to be the same, but eventually I got really sick of the cable constantly dragging around on my desk (I didn’t get a mouse bungee for a reason I’ll explain later, but mouse bungees are basically these little stands that you clip your mouse cable into so it kind of “manages” the cable) and the cable occasionally even getting tangled in stuff on my messy desk. So I decided to just buy a wireless mouse, and haven’t had any reason to regret my decision since. It works well for gaming (I play mostly FPS and RPG, and I do a hell of a lot of graphic design) and I’m constantly out and about anyway. A wired mouse with a long cable just doesn’t look right when you’re using it on the go. It’s much more convenient to have a wireless mouse in this scenario. Wireless mice have become so advanced that there’s virtually no delay compared to a wired one. I believe there was an official study conducted of this, and it found that although wired mice were faster, 99% of gamers would never notice the difference. Additionally, wireless mice have become a lot better at managing battery power. If my mouse does happen to die, I’m happy taking one in-game death every 8 months (the approximate battery life of my mouse) due to my mouse dying. I can live with that. So, it’s wireless mice for me! Bonus note: There are some very expensive wireless mice that actually wirelessly charge on top of their mouse pad, and the mouse pad is wired. Yes, you still technically have a wire in your setup, but it ensures that your wireless mouse will never die and the cord won’t be dragging around all the time. TLDR: Wireless, it’s more convenient and suits my needs better ",
            "date": "Answered November 15, 2018",
            "views": "182",
            "upvotes": " View 61 Upvoters",
            "upvoters": [
                {
                    "user_id": "Giridhar Kl",
                    "user_href": "/profile/Giridhar-Kl"
                },
                {
                    "user_id": "Muhd Nazhan",
                    "user_href": "/profile/Muhd-Nazhan"
                },
                {
                    "user_id": "Gourab Chattopadhyay",
                    "user_href": "/profile/Gourab-Chattopadhyay-1"
                },
                {
                    "user_id": "Gopal Krish",
                    "user_href": "/profile/Gopal-Krish-70"
                },
                {
                    "user_id": "Sanyam Chawla",
                    "user_href": "/profile/Sanyam-Chawla-4"
                },
                {
                    "user_id": "Thecunningslytherin",
                    "user_href": "/profile/Thecunningslytherin"
                },
                {
                    "user_id": "Daniel Barcasnegras",
                    "user_href": "/profile/Daniel-Barcasnegras"
                },
                {
                    "user_id": "Joshua Lopez",
                    "user_href": "/profile/Joshua-Lopez-26"
                },
                {
                    "user_id": "Pratik Roy",
                    "user_href": "/profile/Pratik-Roy-45"
                },
                {
                    "user_id": "Nicholas Wee",
                    "user_href": "/profile/Nicholas-Wee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Dough",
                "href": "/profile/Bill-Dough-1"
            },
            "answer_text": "There are pros and cons on using a wired or Wireless Game Buzzer mouse: Aesthetics Everyone enjoys having an awesome battle station. When considering aesthetics and aesthetic appeal, people tend to lean more towards wireless peripherals because they don’t appreciate the look of cables running across the desk. Movement For gamers who want the option to be able to move around, have their keyboard on their lap, or game from somewhere other than their desk, wireless products are a good fit. Generally speaking, wireless peripherals with Bluetooth or 2.4GHz wireless technology which is standard can work up to approximately 30 feet away. While a wireless keyboard using 2.4GHz does use a USB port, wireless peripherals using bluetooth technology do not. This means a wireless keyboard with Bluetooth could, in theory, be moved around the room and still played with. Connection and Battery Life When you game with wired peripherals, there is no need to worry about battery life or connectivity. Because they are plugged in, wired peripherals don’t run out of battery in the same way wireless products do. In fact, having a wireless product could be expensive if someone games a lot as they might have to consistently replace their batteries. Battery life and connectivity are also important in terms of gameplay. Gameplay In terms of gameplay, wired mice tend to have a higher DPI than wireless mice. DPI is also known as Dots Per Inch and the higher it is, the more sensitive the mouse is. A mouse with higher DPI will react to smaller movements and the cursor will move more across the screen. ",
            "date": "Answered September 28, 2017",
            "views": "71",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gopal Krish",
                    "user_href": "/profile/Gopal-Krish-70"
                },
                {
                    "user_id": "Sanyam Chawla",
                    "user_href": "/profile/Sanyam-Chawla-4"
                },
                {
                    "user_id": "Sagar Shekhar",
                    "user_href": "/profile/Sagar-Shekhar-6"
                },
                {
                    "user_id": "Jake Seraphin",
                    "user_href": "/profile/Jake-Seraphin"
                }
            ]
        }
    ]
}