{
    "title": "Which are the modern technologies in water treatment? - Quora",
    "tags": [
        "Modern Technology",
        "Water Treatment",
        "Water"
    ],
    "response": [
        {
            "author_info": {
                "name": "Courtney Mclaren",
                "href": "/profile/Courtney-Mclaren-2"
            },
            "answer_text": " Here is a new technology that enables communities to produce their own water filters using biomass nanofibers, making clean water more accessible and affordable. Click here to watch this water Purification Breakthrough Technology. The world's population is projected to increase by 2-3 billion over the next 40 years. Already, more than three quarters of a billion people lack access to clean drinking water and 85 percent live in the driest areas of the planet. Those statistics are inspiring chemist Ben Hsiao and his team at Stony Brook University. With support from the National Science Foundation (NSF), the team is hard at work designing nanometer-scale water filters that could soon make clean drinking water available and affordable for even the poorest of the poor. Traditional water filters are made of polymer membranes with tiny pores to filter out bacteria and viruses. Hsiao's filters are made of fibers that are all tangled up, and the pores are the natural gaps between the strands. The team's first success at making the new nanofilters uses a technique called electrospinning to produce nanofibers under an electrical field. Hsaio's team is also looking to cut costs even further by using \"biomass\" nanofibers extracted from trees, grasses, shrubs -- even old paper. Hsiao says it will be a few years yet before the environmentally friendly biomass filters are ready for widespread use in developing countries, but the filters will eliminate the need to build polymer plants in developing areas. Ultimately, those filters could be produced locally with native biomass or biowaste. ",
            "date": "Answered November 2, 2018",
            "views": "214",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carlos Belo Nunes",
                    "user_href": "/profile/Carlos-Belo-Nunes"
                }
            ]
        }
    ]
}