{
    "title": "Which is the best laptop manufacturer? - Quora",
    "tags": [
        "Manufacturing",
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Imran Khan",
                "href": "/profile/Imran-Khan-199"
            },
            "answer_text": "There is nothing there as best laptop brand. All laptops are same with varied specs. The brands just assemble various chips onto thier laptop and brand it as thier own. Typically, what you should be looking from the brand is Warranty, Service and Support till the machine ceases(I mean ages!!!). According to me, Lenovo has been making perfectly Balanced Hardwares, unlike other brands. Thier Hardware compatibility and low failure rates. I only serviced two Lenovo lappy in my 7 years of service, that too damaged by mishandling. Dell has been providing Onsite Warranty. means you get Technician at your house to service. HP has service centres in every streets of India. ASUS has stormed into Portable computing segment and been providing better competition in every price segment. ",
            "date": "Answered June 25, 2016",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chandrahas Aroori",
                    "user_href": "/profile/Chandrahas-Aroori"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debajit Rajput",
                "href": "/profile/Debajit-Rajput-1"
            },
            "answer_text": "If you want Battery Backup and Fast charging 45 minutes full chrge go for HP. if you want premium and have lot of money then go for Apple Lenovo is waste.Battery pickup very bad and keybord key get damages. Dell is OLD Now. If you want for simple work then 4GB ram I3 processor of HP is very Good. If want game then GO for extra 2GB NVDIA grafics.IT will COST you 35000/- Happy . ",
            "date": "Answered July 8, 2017",
            "views": "298",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Samin Abedin",
                    "user_href": "/profile/Samin-Abedin-1"
                }
            ]
        }
    ]
}