{
    "title": "Which country has the biggest nuclear weapons and which ones are they? - Quora",
    "tags": [
        "Weapons and Warfare",
        "Warfare and Nuclear Weapons",
        "Nuclear Proliferation",
        "Country Comparisons",
        "Nuclear Weapons",
        "Weapons",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Ori Taichman",
                "href": "/profile/Ori-Taichman"
            },
            "answer_text": "This may be surprising, but the answer is …China. However, this is not necessarily answer the (assumed) intention behind your question. First, I’ll say that weapons of the past are no longer relevant; the largest operational American and Soviet bombs ever built (operational weapons, not test devices) were each with a yield of 25 megatons (25 MT) - the same energy as 25 million tons of TNT. those are no longer in service. The current largest American bomb is 1.2 MT (plane-dropped; largest missile warhead is 0.475 MT), and the largest Russian is around 1 MT. therefore, the largest operational nuclear weapon in service today is a Chinese 5 MT missile warhead. However, I will assume you wish to know what is the most destructive nuclear weapon. this changes the answer a bit: Modern ICBMs or submarine launched ballistic missiles have several warheads (up to 8 according to agreements, although even 16 is possible sometimes). Several small warheads, if you spread them over a target will cause much more damage than one large warhead. The Chinese 5 MT warhead is the only one the missile carries. 8 warheads of 0.475 MT will cause much, much more damage to most targets, so American missiles are more destructive than Chinese missiles, even tough they carry smaller bombs(and even a smaller total yield- 8*0.475<5). This is also the reason the present bombs are so small, and you no longer see such large bombs as were present in the 60’s for example: it is better to have 8 warheads of 1 MT each than one warhead of 20 MT, so stronger bombs, that are much larger, are inferior and are no longer necessary. So, in total: the largest present nuclear bomb is Chinese. but American and Russian missiles can deliver more damage to the target and can be considered as more powerful or destructive. ",
            "date": "Answered July 20, 2019",
            "views": "150",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Markus Mencke",
                    "user_href": "/profile/Markus-Mencke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Fowler",
                "href": "/profile/Joshua-Fowler-9"
            },
            "answer_text": "Big isn't a big deal anymore. USSR detonated the Tsar Bombe back in the 50's that was 50 megatons, meant to be 100. That would vaporize half of New Jersey. Now, everyone has Multiple Independent Re-entry Vehicles, a bunch of medium-sized nukes on one warhead with very good accuracy. So if the Russian Sarmat has 18 separate 5 megaton bombs, with accuracy around 30 feet, there's no need for one 50 megaton bomb. The Russians still like to talk big though, they claimed they have a submarine-affixed 100 megaton bomb that could create a tsunami, but at that point, who cares…  ",
            "date": "Answered July 28, 2019",
            "views": "41",
            "upvotes": "0"
        }
    ]
}