{
    "title": "Which branch of the US military will undergo the most drastic change over the next 10 years? Why? - Quora",
    "tags": [
        "Military Branches",
        "Change and Changing",
        "U.S. Marine Corps",
        "U.S. Army",
        "Trends",
        "Technology Trends",
        "United States Armed Forces",
        "Military",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jesse Diaz",
                "href": "/profile/Jesse-Diaz-42"
            },
            "answer_text": "That’s a good question. There are only two responses I can give: Army or Marine Corps. The Army, because I think they have start changing to a more Marine Corps way of fighting battles. Their unit sizes don’t allow for quick reaction and adapting to unconventional warfare. They are a superior power to any other conventional army, but these aren’t conventional times. Which brings me to the second answer, The Marine Corps, because no other branch is as well equipped to adapt to any warfare. They can cut you with a scalpel or blow you to oblivion, just as easily. But you can never count any branch of service out, because adapting is a way of life in any military. ",
            "date": "Answered January 27, 2019",
            "views": "75",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Boyd Mercer",
                "href": "/profile/David-Boyd-Mercer"
            },
            "answer_text": "The Space Force, I would imagine. After that, the Army, which, having recolored everything (equipment, uniforms, etc.) to shades of yellow and brown for use in arid environments, will now have to recolor everything back to olive drab and woodland camouflage so we can go fight a new war in Venezuela. Worst off will be the individual soldiers who, having gone 15 years in tan suede boots, will have to return to shining black leather boots every day. ",
            "date": "Answered January 26, 2019",
            "views": "101",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jerry Flores",
                    "user_href": "/profile/Jerry-Flores-51"
                },
                {
                    "user_id": "Bill Friedrich",
                    "user_href": "/profile/Bill-Friedrich-1"
                }
            ]
        }
    ]
}