{
    "title": "Which giant, established tech company is the most innovative and why? - Quora",
    "tags": [
        "Innovative Companies",
        "Technology Companies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hamza Saleem Ahmed",
                "href": "/profile/Hamza-Saleem-Ahmed"
            },
            "answer_text": "I guess, if you only want a comparison among the top companies, it has to be Google. Most, if not all, major corporations focus their attention on what they have already achieved and continuing to improve that, but Google goes so far as to give their employees 20% office time for their personal projects. Great products likes Gmail have come out of it. Google is all over web technologies now, search, email, videos, documents, storage, voice, calling and is still expanding. A few projects like Answers, Notebook, Wave, Buzz might have failed, and some like Plus might not have worked out as well as planned, but they still continue to innovate and invest in newer products. They have expanded to providing high speed internet and free wifi in some locations. But the whole point is, they haven't stopped at just one thing. Apple releases great innovations once every few years, then newer models with little upgrades. Cisco is focused on just networking. Microsoft is still mostly about just operating systems, even if they have expanded to nearly all platforms. IBM is about computer machines. Qualcomm is mostly microprocessors. Oracle databases. But Google, its onto everything.  Its even scary in a way. ",
            "date": "Answered December 1, 2012",
            "views": "673",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shubhendra Singh",
                    "user_href": "/profile/Shubhendra-Singh"
                },
                {
                    "user_id": "Joe Geronimo Martinez",
                    "user_href": "/profile/Joe-Geronimo-Martinez"
                },
                {
                    "user_id": "Charles Johnson",
                    "user_href": "/profile/Charles-Johnson-6"
                },
                {
                    "user_id": "Terrence Yang",
                    "user_href": "/profile/Terrence-Yang-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peichen Chang",
                "href": "/profile/Peichen-Chang"
            },
            "answer_text": "In addition to technology innovation, we should also consider business model innovation. Google - figured out how to make money on search results and videosCisco - spin-in investment and acquisitionsAmazon - forced API's within the company which led to AWS - enterprise cloud for everyoneSalesforce.com - popularized subscription software as a service for enterprisesWikipedia - made donation based service sustainableExamples of Cisco spin-in (I'm sure there are others): Andiamo Systems - Produced Cisco's MDS line of switch products.  Now #2 in SAN switching market share, albeit a distant #2 behind Brocade.Nuova Systems - Produced Cisco's line of server and data center switching products.  Now #3 in WW server sales with over $2B in revenue.Insieme - Software Defined networkingThere is probably some time aspect as well.  Folks like eBay were very innovative in the early days but has languished as of late. ",
            "date": "Answered December 3, 2012",
            "views": "514",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Urvesh Devani",
                    "user_href": "/profile/Urvesh-Devani"
                },
                {
                    "user_id": "Hamza Saleem Ahmed",
                    "user_href": "/profile/Hamza-Saleem-Ahmed"
                }
            ]
        }
    ]
}