{
    "title": "Which is best University in India for Cloud Computing? - Quora",
    "tags": [
        "Cloud Services",
        "Cloud Computing",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Naman Parashar",
                "href": "/profile/Naman-Parashar-32"
            },
            "answer_text": "THE APEX Institute of Technology, an integrated part of Chandigarh University, is a world-class institution providing exceptionally trained human resources in contemporary areas of Management & Technology.AIT adopts a focused approach to develop human & intellectual capital in the latest areas of technology & management impacting economies of the 21st Century. Cloud Computing technologies offer ‘on-demand’ solutions for the IT needs of companies. The solutions span across IT infrastructure, applications, SAAS models, service support and maintenance. In this program, students learn about technologies of Cloud Computing and Virtualization, their principles, modeling, analysis, design, deployment, and industry-oriented applications. All major solution architectures and enabling technologies are covered under this program. Students are prepared for technical careers in developing applications and providing services that run on a distributed network using virtualized resources and enables customers to access computing resources as needed. Objectives of the Program To explore the principles of Cloud computing both from a theoretical perspective and apply the principles and skills acquired using a major public cloud provider. To Compare and Contrast the various cloud service models with a focus on gaining a skill set such as Decision strategy, Design process, Development, Security, Deployment, Analysis, Maintenance, Roles and Boundaries related to the cloud. Demonstrate how various cloud providers such as AWS, Google Compute, and Microsoft Azure implement and offer IaaS, PaaS and SaaS services. Most importantly, hands-on experience to develop, deploy, manage and scale applications running in platforms such as Java, Python Platform. Scope of program After passing this program, the student can opt for the following specializations: Cloud System Administrator: Configure and maintain the systems that comprise the underlying cloud platform, troubleshoot problems, and plan for future cloud capacity. Cloud Architect: Leads the creation and deployment of cloud-based systems that are scalable, secure, and aligned with company-wide business and IT objectives. Cloud Engineer: Plan and perform tasks related to the implementation and maintenance of internal, enterprise-shared virtualization infrastructure. Cloud Security Manager: Serve as SME for a Cloud Security and Attack and Penetration Services Cloud Application Developer: Implement scalable, high performance hosting solutions using Cloud Technologies. Identify business requirements and corresponding cloud-based solutions. The program shall develop the following Skill Set in the participants Strong logical and reasoning abilities Understanding and application of concepts of Cloud Technologies and Platforms Application of Advance Probability and Statistics methods Migrating existing applications into the cloud, by navigating through phases such as the creation of a private cloud; attaching, in a secure fashion, the private cloud to the public cloud Provisioning and maintaining resources in the public cloud. Dealing with non-trivial issues like load balancing, caching, distributed transactions, identity and authorization management, and data encryption. Familiarity with the most important APIs used in the Amazon, Microsoft, IBM and Google clouds. Prominent Industries that deploy Cloud Technologies Information Technology Automotive & Aviation Manufacturing Banking and Financial Services Education & Online Learning Supply Chain Management Fashion & Retail E-Commerce & Online Shopping ",
            "date": "Answered April 6, 2020",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chandni Krish",
                "href": "/profile/Chandni-Krish"
            },
            "answer_text": "Cloud computing field offers many job opportunities in a variety of roles ranging from IT systems, management, and user support, development in the application, as a business analyst, web developer and even in the field of net security, According to the recent reports Cloud computing in India to see over 1 million job roles by 2022. Taking about this course there are many few universities which offers this specialization course as its a new technology, I would recommend studying this course at Chandigarh University because of following reasons-: 1 NAAC A+ universities gets good grants for research, it helps university to get collaborated with top international institutions – CU has got tie up with 200 Plus universities in the world. 2 CU will help you to learn essential technical skills- Guaranteed placement during the 4 years of course study. 3 Another thing which i would like to highlight that the dedication of the faculty members working here towards the student,more number of practicals sessions are being taken ,teaching with new pedagogy methods like Peer learning ,flip classrooms,special tutorials and doubt sessions You can read about the placements offers at Chandigarh University by different students.  ",
            "date": "Answered April 20, 2020",
            "views": "45",
            "upvotes": "0"
        }
    ]
}