{
    "title": "Which country has the most advanced agriculture technology and why? - Quora",
    "tags": [
        "Agriculture Technology",
        "Farming",
        "Agriculture",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Ma",
                "href": "/profile/Justin-Ma"
            },
            "answer_text": "On scale and with the major grains, it’s the US. Historically it’s been a center of capital and technology, farms are large, and labor costs are high. Europe, which otherwise might be competitive, but favors many traditional methods (and this is reinforced by both consumer preferences and regulation). Farming as rocket science But there are plenty of exceptions. It’s not that simple of an answer. The Netherlands probably wins in horticulture (look up their robotic greenhouses). Israel’s known for their irrigation. Some of the best research in agricultural genetics comes out of Australia and Germany. The US is way behind on using drones (I’ve heard more out of France and China). Canada and the US are very closely aligned and for Canada’s small population, it has had some outsized contributions in some areas and at times. Smallholder agriculture also has value, and the US is probably not a leader there. That requires very localized technology. ",
            "date": "Answered August 23, 2017",
            "views": "134",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marutinandan Singh",
                    "user_href": "/profile/Marutinandan-Singh"
                },
                {
                    "user_id": "Luca Fornari",
                    "user_href": "/profile/Luca-Fornari"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Turbo-Neo-ធីបូ"
                },
                {
                    "user_id": "Sanjay Suda",
                    "user_href": "/profile/Sanjay-Suda"
                },
                {
                    "user_id": "Sisira Loha",
                    "user_href": "/profile/Sisira-Loha"
                },
                {
                    "user_id": "Adib Sakhiron",
                    "user_href": "/profile/Adib-Sakhiron-1"
                },
                {
                    "user_id": "Muhammad Aziz Muslim",
                    "user_href": "/profile/Muhammad-Aziz-Muslim-1"
                },
                {
                    "user_id": "Khurram Rukhsar",
                    "user_href": "/profile/Khurram-Rukhsar"
                },
                {
                    "user_id": "R Thomas",
                    "user_href": "/profile/R-Thomas-49"
                },
                {
                    "user_id": "Valerie Niosi",
                    "user_href": "/profile/Valerie-Niosi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kurtis Main",
                "href": "/profile/Kurtis-Main-3"
            },
            "answer_text": "America. We have tractors that drive themselves. The only reason you need a driver is to turn around. What's the driver supposed to do? Play tic tac toe with himself? Jerk off? Who knows. We have pivots that you can turn on and off with an app. We have combines that have 36 row heads, and tractors big enough to pull those same size implements to plant crops. We have fertilizer, herbicides, and pesticides being dropped from planes. If you don't want to do that you can just get a normal sprayer. Trust me, America is the most advanced when it comes to Agriculture. ",
            "date": "Answered August 22, 2017",
            "views": "4",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Valerie Niosi",
                    "user_href": "/profile/Valerie-Niosi-1"
                },
                {
                    "user_id": "Vikas Rao",
                    "user_href": "/profile/Vikas-Rao-45"
                },
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                },
                {
                    "user_id": "Haroon Basharat Khan",
                    "user_href": "/profile/Haroon-Basharat-Khan"
                }
            ]
        }
    ]
}