{
    "title": "Which technologies are used in telephone exchange? - Quora",
    "tags": [
        "Telephony",
        "Telephone Service",
        "Student Exchanges",
        "Telephones",
        "Telecommunications",
        "Cellular Service Providers",
        "Technology Trends",
        "Technology",
        "Web Development"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Newberry",
                "href": "/profile/David-Newberry-8"
            },
            "answer_text": "Hi… This is kinda old school…but all the exchanges I’ve ever been around for AT&T, which is pretty much what's used in the US, all all digital…The electromechanical stuff that supported the original “rotary” stuff, were phased out in the 1980’s, if I remember correctly… Most of the switches were basically of 2 types the NORTEL DMS-100 supernode, or a DMS-200 for trunk switching, and the ATT 5-ESS. NORTEL went out of business years ago, but was deemed too Big to Fail…so the “Fiber Optic” end of the business went to Ciena and the Switching end of the business went to Genband and Ericsson, if I understand this correctly. NORTEL, a Canadian based company, sold switched services and fiber muxes all over the world…The bankruptcy was quite the surprise, and probably put in jeopardy service, repair and maintenance issues for businesses and governments all over the globe. To me, it all still looks and works the same to me…A lot of the fiber equipment I worked with, in the way of install, test and turn-up, looked and worked the same, it just the the name plate of Ciena on the outside. But there is a lot of fiber muxes, switched, inner connected equipment to support, things like DSL, VOIP Fiber to the curb and fiber to the home, and the cellular network, which interfaces with 4G and 5G cell service. AS I remember my Switchman support, I used to provide…my DMS-100 switch “high water mark” as it was called was about 100K calles processed per hour. The DMS switch, is kinda like a large computer. It has at its heart 2 CPU’s. I always thought of them as left brain, and right brain…one side was always working and the other was a hot standby…The last single card I replaced (CPU) had a a cost of 450,000 dollars, if I remember the billing correctly….Maybe why they went out of business. Just 3 removable cards, which were about 11x17 cost the company about 1.5 million, and we are still in the CPU section of the DMS-100 switch….go figure… So, switch spare cards were very expensive, and was kept under lock and key…Problem is, I can’t remember where I put the key…Oops My Bad…. Anyway, it's all a large digital switch system, interlaced with fiber muxes to support the various App’s you enjoy with your phone service… PS…I almost forgot all the copper T-1 and T-3 interfaces still processing various services to the field… Good Luck (My head kinda hurts trying to remember all this stuff)…. Dave ",
            "date": "Answered October 24, 2020",
            "views": "105",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}