{
    "title": "Which is correct English, computer mice or computer mouses? - Quora",
    "tags": [
        "Computer Peripherals",
        "Computer Mice",
        "Diction and Word Usage",
        "Writing Advice",
        "Vocabulary of the English Language",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Chapman",
                "href": "/profile/Richard-Chapman-3"
            },
            "answer_text": "I think we are almost settled on computer mice now, though some will still object. It has been (or is still) in flux because when a word is used with a secondary, metaphorical meaning it is usually given a regular ‘s’ plural even when it originally had an irregular one. If you want to talk about some cloverleaf junctions for example, it seems more natural to call them the cloverleafs rather than cloverleaves. However, this doesn’t seem to have fully happened with computer mice. I can think of three reasons that have probably all contributed to that: In the first place, it’s rare enough to refer to them in the plural. Except in very unusual situations, no one has to use more than one at a time. (The sector where it did come up a lot was computer retail. I remember an advert in a British magazine around about 2000 avoiding the issue by listing these accessories as ‘rodents’!)Even now that they are often tailless and come in a variety of shapes and colours, we haven’t forgotten what they originally looked like. So in our minds they are still very much (toy) mice.‘Mouses’ sounds comically childish.",
            "date": "Answered May 15, 2020",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anthony Atkielski",
                "href": "/profile/Anthony-Atkielski"
            },
            "answer_text": "In the specific context of computers, mouses has gained some currency, but there is still much hesitation, and either will do. In other contexts, it’s always mice. ",
            "date": "Answered May 14, 2020",
            "views": "33",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Autry-Snowden"
                },
                {
                    "user_id": "William Cousert",
                    "user_href": "/profile/William-Cousert"
                }
            ]
        }
    ]
}