{
    "title": "Which laptop brands are the best and worst? Why? - Quora",
    "tags": [
        "Laptop Brands",
        "Laptop Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Xitong Zou",
                "href": "/profile/Xitong-Zou-1"
            },
            "answer_text": "So, qualification for myself, I collect computers and laptops especially:  My favorite laptop brands: -ThinkPads. I own like 4 of them. Seriously they are awesome, the older Lenovos and IBMs tend to be better though. The ThinkPad X61 is my personal fav. The ThinkPad 25 which i also own below is my daily driver:  -Dell Latitude. Similar to ThinkPads, but the new ones come with the nifty InfinityEdge display and tons of Thunderbolt 3 ports. Haven’t had an issue with any of them yet.  -Alienware. Yeah, I used to think they were overpriced, but surprisingly they are well made. They use aluminum and magnesium for their builds which is better quality than the Asus ROG / MSI / Acer Predator ones which use plastic usually. I’ve been using the same Alienware for almost 2 years, everyday its been left on, for VR / gaming etc and had no issues  -Apple. Yeah, I’m not a big fan of Apple in general, but I don’t doubt their Macbooks are well built and look really clean and stylish. The new Macbook Pros I do not recommend for professionals (go for a Dell XPS or ThinkPad X1 instead) but they make great consumer laptops (I know, it’s “Pro” but its actually an upgraded Mac Air)  -Microsoft. Their Surface Pros and SurfaceBooks are excellent. They are taking design cues from Apple and some like the SurfaceBook are just straight up innovative. I used to use the X1 Yoga as my convertible but the SurfaceBook 2 is now my main convertible. detachable, convertible, dedicated graphics, 3:2 display with high ppi (in my ranking its the third best screen I ever had right behind the MacBook Pro and X1 Yoga with OLED), stylish, and portable.  ",
            "date": "Answered September 25, 2018",
            "views": "81",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sudhakar Palakkarai",
                    "user_href": "/profile/Sudhakar-Palakkarai"
                },
                {
                    "user_id": "Nathan Patterson",
                    "user_href": "/profile/Nathan-Patterson-12"
                },
                {
                    "user_id": "Ansh Grover",
                    "user_href": "/profile/Ansh-Grover-21"
                },
                {
                    "user_id": "Vignesh Leo Ronaldo",
                    "user_href": "/profile/Vignesh-Leo-Ronaldo"
                },
                {
                    "user_id": "Swamynadh Gandhi R",
                    "user_href": "/profile/Swamynadh-Gandhi-R"
                },
                {
                    "user_id": "Neelesh K Singathia",
                    "user_href": "/profile/Neelesh-K-Singathia"
                },
                {
                    "user_id": "Soham Verma",
                    "user_href": "/profile/Soham-Verma-7"
                },
                {
                    "user_id": "Parth Aggarwal",
                    "user_href": "/profile/Parth-Aggarwal-38"
                },
                {
                    "user_id": "Josip Marčić",
                    "user_href": "/profile/Josip-Marčić-1"
                },
                {
                    "user_id": "Tahitoa Toefuata",
                    "user_href": "/profile/Tahitoa-Toefuata"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Abubakar",
                "href": "/profile/Muhammad-Abubakar-122"
            },
            "answer_text": "The best laptop brand i used is Apple everything is perfect from packaging to finishing and battery timing Dell is good but XPS series is not good at all it has heat up issues Lenovo laptops are solid thinkpad series are the best windows laptops i used so far no issues faced And the worst brand is HP the build quality of notebook series are pathetic body is made up of plastic and after a month you will get cracks as the hinges are tight of the laptop and after sometime you realize that laptop bottom is felling and you turn it around and got to know wow there are only 3 screws in your bottom that are also lose and one of the stupid issue is when you buy this machine new and get battery draining within 2 months worst issue of HP not only with me my cousin have hp pro book he also have the same issue of battery draining not only us my 2 of class mates use hp one of them have elite book and other have pro book i guess both have to use while pluging the charger or they use their laptop without battery for direct power supply Iam not gonna buy hp again ",
            "date": "Answered September 25, 2018",
            "views": "39",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sakura Saku",
                    "user_href": "/profile/Sakura-Saku-7"
                },
                {
                    "user_id": "Steven Philip",
                    "user_href": "/profile/Steven-Philip-9"
                },
                {
                    "user_id": "Adams Baker",
                    "user_href": "/profile/Adams-Baker-1"
                },
                {
                    "user_id": "Pramod Kumar B",
                    "user_href": "/profile/Pramod-Kumar-B-1"
                },
                {
                    "user_id": "Marc Friemelt",
                    "user_href": "/profile/Marc-Friemelt"
                },
                {
                    "user_id": "Nathan Lim",
                    "user_href": "/profile/Nathan-Lim-24"
                }
            ]
        }
    ]
}