{
    "title": "Which is the best technology of communication today? - Quora",
    "tags": [
        "Best of X",
        "Communication",
        "Information Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nitish Bhardwaj",
                "href": "/profile/Nitish-Bhardwaj-584"
            },
            "answer_text": "The Internet is the best technology of communication today. Since the mid-1990s, the Internet has had a revolutionary impact on communication, including the rise of near-instant email communications, instant messaging, VoIP (VoIP) phone calls, two-way interactive video calls, discussion forums. , blogs and social networks.The Internet has made communication easier and faster, allowing us to be in contact with people, regardless of time and place. This has accelerated the pace of business and expanded opportunities within the company. This allowed people to find their voices and express themselves on social media, YouTube, and memes. The Internet has connected and divided us like never before.Every year Ericsson has published a very good report on mobility and this year they predict that LTE subscribers will continue to grow until 2021 and that 5G will be a real problem until then. LTE has a lot of juice and new peripheral technologies like IoT and ML will give LTE a boost until 2021. So don't throw this book on LTE right away.",
            "date": "Answered July 13, 2020",
            "views": "495",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarath Ravichandran",
                "href": "/profile/Sarath-Ravichandran"
            },
            "answer_text": "There are lot of emerging technologies which can create you goosebumps, Let me list in the order that really amazed me. Tracking WiFi signals to passively see through walls using NI USRP and LabVIEW: With dedication and a creative approach, University College London (UCL) research is helping to address the world's most urgent problems. Whether designing healthier cities or grappling with issues such as global health and climate change, the challenges of daily life inspire UCL students and academics. Based at UCL, our team of electrical engineering researchers is investigating passive radar technologies that can see through walls using WiFi radio waves. Near field communication (NFC): Latest shockwave of the technological invasion: Near field communication (NFC) is one emerging technology and ecosystem that promises to become an enabler of a big change in the industry, at both a technological and economic level. Many applications we use daily – such as credit cards, car keys, tickets, health cards and hotel room access cards – could cease to exist as NFC-enabled mobile phones can provide all these functionalities. At the same time, a wide range of applications in health, education, and entertainment will be generated using smart posters - the most common usage area of NFC technology. Internet of things: The internet of things (IoT) is the network of physical devices, vehicles, buildings and other items—embedded with electronics, software, sensors, actuators, and network connectivity that enable these objects to collect and exchange data. In 2013 the Global Standards Initiative on Internet of Things (IoT-GSI) defined the IoT as \"the infrastructure of the information society.\" The IoT allows objects to be sensed and controlled remotely across existing network infrastructure, creating opportunities for more direct integration of the physical world into computer-based systems, and resulting in improved efficiency, accuracy and economic benefit; when IoT is augmented with sensors and actuators, the technology becomes an instance of the more general class of cyber-physical systems, which also encompasses technologies such as smart grids,smart homes, intelligent transportation and smart cities. Each thing is uniquely identifiable through its embedded computing system but is able to inter operate within the existing Internet infrastructure. Experts estimate that the IOT will consist of almost 50 billion objects by 2020. Artificial brain: Artificial brain (or artificial mind) is a term commonly used in the media to describe research that aims to develop software and hardware with cognitive abilities similar to those of the animal or human brain. Research investigating \"artificial brains\" and brain emulation plays three important roles in science: An ongoing attempt by neuroscientists to understand how the human brain works, known as cognitive neuroscience.A thought experiment in the philosophy of artificial intelligence, demonstrating that it is possible, at least in theory, to create a machine that has all the capabilities of a human being.A long term project to create machines exhibiting behavior comparable to those of animals with complex central nervous system such as mammals and most particularlyhumans. The ultimate goal of creating a machine exhibiting human-like behavior or intelligence is sometimes called strong AI.An example of the first objective is the project reported by Aston University in Birmingham, England where researchers are using biological cells to create \"neurospheres\" (small clusters of neurons) in order to develop new treatments for diseases including Alzheimer's, Motor Neurone and Parkinson's Disease. Cryptocurrency: A cryptocurrency (or crypto currency) is a medium of exchange using cryptography to secure the transactions and to control the creation of new units. Cryptocurrencies are a subset of alternative currencies, or specifically of digital currencies. Bitcoin became the first decentralized cryptocurrency in 2009. Since then, numerous cryptocurrencies have been created. These are frequently called altcoins, as a blend of bitcoin alternative. Cryptocurrencies use decentralized control as opposed to centralized electronic money/centralized banking systems. The decentralized control is related to the use of bitcoin's block chain transaction database in the role of a distributed ledger. ",
            "date": "Answered July 3, 2016",
            "views": "76",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Budelis",
                    "user_href": "/profile/Joe-Budelis"
                },
                {
                    "user_id": "Wahyu Subri",
                    "user_href": "/profile/Wahyu-Subri"
                },
                {
                    "user_id": "Sylvia Atef",
                    "user_href": "/profile/Sylvia-Atef-1"
                },
                {
                    "user_id": "Ankit Raj Goyal",
                    "user_href": "/profile/Ankit-Raj-Goyal-1"
                },
                {
                    "user_id": "Megha Valishetra",
                    "user_href": "/profile/Megha-Valishetra"
                },
                {
                    "user_id": "Hemant Rao",
                    "user_href": "/profile/Hemant-Rao-23"
                },
                {
                    "user_id": "Hareesh Kumar",
                    "user_href": "/profile/Hareesh-Kumar-68"
                }
            ]
        }
    ]
}