{
    "title": "Which is the difference in Redmi Note 9 Pro vs Redmi Note 9? - Quora",
    "tags": [
        "MIUI 9",
        "Redmi Series",
        "Xiaomi Redmi Note 5/5 Plus",
        "Xiaomi Redmi Note 4",
        "Smartphone Comparisons",
        "Smartphones Recommendations",
        "Redmi Note Series",
        "Xiaomi Mobile Phones",
        "Xiaomi (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhavin Rajput",
                "href": "/profile/Bhavin-Rajput-6"
            },
            "answer_text": "Redmi Note 9 Pro may be referred to as the elder sibling of the Redmi Note 9 smartphone but this was launched way back in 2020 while Redmi Note 9 has been launched a few weeks ago. And if you are looking for the better option between the two, there are two aspects and you need to choose the better option on the basis of the features of the smartphone. As far as the display is concerned, Redmi Note 9 Pro has a slightly bigger screen but the display resolution and Corning Gorilla Glass protection in both the smartphones is same, so there’s hardly any difference in the display. However, the most prominent difference between the smartphones lies in their processor section and performance. Redmi Note 9 is powered by Mediatek Helio G85 gaming processor which is octa-core in nature and is clocked at 2GHz, the Redmi Note 9 Pro smartphone has Snapdragon 720G processor which is also octa-core in nature and clocked at 2.3GHz.  However, if you talk about the gaming performance, Redmi Note 9 has much better performance than Redmi Note 9 Pro and thus, if you need better gaming, I think you should go for Redmi Note 9. This is one of the aspects that I talked about the smartphone earlier. However, if you need a better camera section, I think you should go for Redmi Note 9 Pro because it has 64MP quad rear camera with a 16MP front camera against Redmi Note 9 which has 48MP quad rear camera and a 13MP front camera. The battery section on both the smartphone is highly similar which is 5020mAH but Redmi Note 9 has 18W fast charging support with 9W reverse charging support and Redmi Note 9 Pro has only 30W fast charging support. Besides, we should not forget that Redmi Note 9 Pro costs much higher than Redmi Note 9 smartphone. Therefore, at the cost, I think both the smartphones are good for their features. ",
            "date": "Answered August 13, 2020",
            "views": "1",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aditya Mishra",
                    "user_href": "/profile/Aditya-Mishra-733"
                },
                {
                    "user_id": "Tushar Sharma",
                    "user_href": "/profile/Tushar-Sharma-1522"
                },
                {
                    "user_id": "Danish Pandey",
                    "user_href": "/profile/Danish-Pandey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dhruv Batra",
                "href": "/profile/Dhruv-Batra-36"
            },
            "answer_text": "Xiaomi launched the Redmi Note 9 a few months earlier. The new Note 9 has joined its predecessor, the Redmi Note 9 Pro, both of which have a similar design and the same 5,020mAh battery supporting 18W fast charging, but with differences in some of the functioning areas. The Note 9 comes with a hole-punch design in which the camera is placed on the top left of the screen. For the rear of the phone there is a regular quad camera setup, and a fingerprint scanner. The Note 9 comes in two storage variants of 3GB+64GB and 4GB+128GB. The first variant is priced roughly at Rs. 15,100 and the second one at Rs. 18,900. The Redmi Note 9 pro on the other hand, is priced at Rs. 12,999 for the 4GB + 64GB storage variant and at Rs. 15,999 for the 6GB + 128GB variant. The Note 9 is available in the colour options of Forest Green, Midnight Grey, and Polar White colour, the Note 9 Pro comes in Aurora Blue, Glacier White, and Interstellar Black colour options. Both phones are dual-SIM (Nano) compatible and run MIUI 11, based on Android 10, on top. The Redmi Note 9 comes with a 6.53-inch full-HD+ IPS display with an aspect ratio of 19.5:9 and Corning Gorilla Glass 5 protection. While the recently launched Redmi Note 9 is powered by a MediaTek Helio G85 octa-core processor with up to 4GB of RAM, the previously launched Redmi Note 9 Pro is equipped with an octa-core Qualcomm Snapdragon 720G SoC with up to 6GB of RAM. The new Redmi Note 9 sports a 48-megapixel Samsung GM1 primary sensor with an f/1.79 lens accompanied by an 8-megapixel secondary sensor with an ultra-wide-angle f/2.2 lens, another 2-megapixel sensor with an f/2.4 macro lens, and a 2-megapixel depth sensor with an f/2.4 lens. On the front, there’s a 13-megapixel selfie shooter. In contrast, the Note 9 Pro boasts of a 48-megapixel Samsung ISOCELL GM2 primary sensor with an f/1.79 lens. The secondary 8-megapixel sensor has an ultra-wide-angle lens, the third shooter packs a 5-megapixel sensor with a macro lens, and the final one houses a 2-megapixel depth sensor. A 16-megapixel front camera makes up for the selfies. ",
            "date": "Updated August 13, 2020",
            "views": "513",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gurkiran Singh",
                    "user_href": "/profile/Gurkiran-Singh-10"
                },
                {
                    "user_id": "Patrick Morison",
                    "user_href": "/profile/Patrick-Morison"
                }
            ]
        }
    ]
}