{
    "title": "Which members of CSK are positive? - Quora",
    "tags": [
        "Chennai Super Kings (IPL franchise)",
        "Optimism",
        "Indian Premier League (IPL)",
        "Cricket Players",
        "Indian National Cricket Team",
        "Cricket in India",
        "Cricket (sport)",
        "Politics of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prabal Rai",
                "href": "/profile/Prabal-Rai-18"
            },
            "answer_text": "IPL 2020: Multiple CSK members including current India bowler test positive for COVID-19 which is Deepak Chahar . The Chennai-based Indian Premier League (IPL) franchise were scheduled to start training from Friday, but it is learnt that following the latest development, the team has deferred it until September 1. Those who have tested positive will self-isolate for 14 days outside the bio-bubble. The IPL quarantine protocol for Covid positive individuals says: “This will follow the Government policy and is currently 14 days. During the 14-day quarantine, the individual will be tested on Day 10, Day 13 and Day 14.”  ",
            "date": "Answered August 30, 2020",
            "views": "293",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Srishti Ray",
                    "user_href": "/profile/Srishti-Ray-16"
                },
                {
                    "user_id": "Adv. Ajay Kumar",
                    "user_href": "/profile/Adv-Ajay-Kumar-1"
                },
                {
                    "user_id": "Anila Bharti",
                    "user_href": "/profile/Anila-Bharti"
                },
                {
                    "user_id": "Pallavi Ray",
                    "user_href": "/profile/Pallavi-Ray-28"
                },
                {
                    "user_id": "Nikhil Singhal",
                    "user_href": "/profile/Nikhil-Singhal-13"
                },
                {
                    "user_id": "Pallavi Ray",
                    "user_href": "/profile/Pallavi-Ray-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naren Ayinala",
                "href": "/profile/Naren-Ayinala"
            },
            "answer_text": "BCCI and CSK have decided to keep the infected patients name private to keep their security and remove media attention from them and stress them out which is actually great. However, in the press release, CSK and BCCI only told out of the infected patient the is an India medium-fast bowlers. CSK has 3 of them KM Asif, Deepak Chahar, and Shardul Takur. Out of these 3, Deepak Chahar was the one who was not seen since the bio-bubble beginning and many people are saying Deepak Chahar. It is safe to say it is Deepak Chahar although it is not confirmed he is the most certain one. We have to wait for the player recovery for the team and BCCI to officially announce. Also, the player and remaining infected were reportedly got it in the Chennai camp. And the second player who tested positive the team refused to release any info on them. Thank you! ",
            "date": "Answered August 30, 2020",
            "views": "68",
            "upvotes": " Answer requested by Sayyam Jain"
        }
    ]
}