{
    "title": "Which has more contribution in science and technology, Americans or Spaniards? - Quora",
    "tags": [
        "Spanish Ethnicity and People",
        "Spain",
        "American Ethnicity and People",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sergio Saavedra",
                "href": "/profile/Sergio-Saavedra-8"
            },
            "answer_text": "Synchronically or diachronically? Synchronically, the U.S. is the superpower, and advances in science and technology require money, so the answer is clear. Also, scientists complain that Spanish governments never earmark enough funds to science. Even so, Spain is the 10th country in the world in scientific productivity. Diachronically, Spain has the advantage of having a very long history. The Caliphate of Cordoba was the most advanced culture of the world, with the possible exception of the Eastern Roman Empire (aka Byzantine Empire). After the Caliphate, the Catholic kindgoms in Spain (particularly Castile) spread Muslim advances in science and culture in general among European countries. The translation of hundreds and thousands of works transmitted a lot of knowledge about astronomy, medicine, chemistry, mathematics, etc.  Arabic numerals is perhaps the most important contribution to Western science, along with the concept of number zero. However, in this specific case, Spain was only a transmitter of culture, since the origin is in India. The introduction of paper in Europe was also through Spain. Spanish contributions -probably original- in that period: windmills, tide mills, fulling mills, perfected astrolabes, ether, irrigation techniques, etc., etc. Also, new naval technologies to navigate the Atlantic ocean.  A Spanish expedition lead by an Italian revealed the existence of a continent thus far unknown to Europeans. (In Spanish, “America” is one continent made up of two sub-continents: North America and South America. So, when English speakers use the word “America” referring to “the United States of America”, it may be a little confusing to us.) This discovery lead to dozens of expeditions that improved our knowledge about geography, botanics, zoology, etc. as well as cartography techniques. The first journey around the world let scientist know the real size of the Earth.  Also in Spain the first grammars of modern languages were created, and its contacts with native American cultures drove advances in linguistics. These contacts also allowed Spain to act as a catalyst for an agrarian revolution both in Europe and in the Americas (introduction of sugar cane, wheat and grape vine in the Americas, and of maize, some kinds of beans, potatoe, pepper and tomatoe in Europe). And let’s not forget chocolate! It was not only introduced by Spain, but adapted by adding sugar. Other fields in which Spain was at the vanguard were naval and military engineering, anathomy, surgery, metallurgy, etc. For example, the difference between arterial blood and venous blood and the way it circulates between heart and lungs. Also a precendent of the steam machine and air conditioning, the first mental hospitals,  Although the political situation in the 19th century made Spain to fall behind (in spite of what Spain contributed for instance an improved calculator), the beginning of the 20th century saw a rebirth, with the invention of the electrically powered torpedo submarine, the first helicopter (autogiro), the first space suit, the structure of the nervous system and brain cells, the epidural, the cable car, a portable X-ray machine, etc. In later years, Spain contributed important discoveries about DNA and RNA, synthetic petroleum, a precedent of the e-book, the articulated train, etc. In any case, other countries may make similar lists with important contributions. This is just information, not a competition. But Spanish people like to joke about how our most important innovations consist of adding a stick to something: the mop, lollipops, and the invention we are most proud of, table football.  ",
            "date": "Answered September 16, 2020",
            "views": "243",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lloyd Stewart",
                    "user_href": "/profile/Lloyd-Stewart-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Holthaus",
                "href": "/profile/Peter-Holthaus"
            },
            "answer_text": "That’s easy if you look far enough back. In 1492 a guy named Christoph Columbus sailed westwards, promising the Queen who gave him serious cash for it, a faster way to India.Because that’s where all the nice spices and tea and whatnot the Brits had came from. Alas, he didn’t find India but rather America, or to be more precise: Islands in the Spanish Gulf. What he did find there was a whole continent and a pretty large one at that. A lot of Europeans swarmed over to escape poverty, religious prosecution, legal troubles, family troubles, poverty, hunger and the likes.They all wanted to start anew and make a better future for their kids. So, now, back to the original question:Most inventions in science and technology are made by people that are immigrants into the new world. Europeans, Africans (most against their will), even some Russians and Chinese and Japanese.And even the whole concept of the western world is rooted in the circumstances “back home”.And a good deal of that back home is Spain. ",
            "date": "Answered September 16, 2020",
            "views": "62",
            "upvotes": "0"
        }
    ]
}