{
    "title": "Which is better, 1.6 GHz dual core processor or 1.4 GHz octa-core processor? - Quora",
    "tags": [
        "Central Processing Units",
        "Comparisons",
        "Processors",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Garrett",
                "href": "/profile/Robert-Garrett-36"
            },
            "answer_text": "It depends. What kind(s) of workload(s) will be running on it? For compute intensive loads ( scientific calculations, games with realistic physic engines, etc.) raw processor speed is more important than the number of cores. For high levels of multitasking, you'll get better throughput with more cores (up to a point, depending on which operating system is running) because although each individual unit of work will be slower (due to the slower processor speed) the overall time required to complete “everything” will be less because of higher parallelism. I said “up to a point” with regard to OS and multicore because there is a point where the overhead incurred by the OS in having to manage and dispatch work across multiple processors is greater than the benefit of having them. The amount of overhead involved is highly dependent on the internal design of the OS. In my world, we call this the “large system effect”. ",
            "date": "Answered October 22, 2017",
            "views": "51",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rajib Ghosal",
                    "user_href": "/profile/Rajib-Ghosal-3"
                },
                {
                    "user_id": "Lucky Molhotra",
                    "user_href": "/profile/Lucky-Molhotra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinod Shahi",
                "href": "/profile/vinod-shahi-bishane-tiger-shahi-Vinod-Shahi"
            },
            "answer_text": "Here is some important lines about processor’s properties. No of Cores and clock speed (Ghertz) are not the only thing that determine a processor property.. There is many thing need to comapre like as ,cpu architechure, instructions set, memory type(bandwith and channels), L1 & L2 cache memory, threads, power consumption,size etc. The way how processors are made is also makes a processor good. Other combination needs to make a processor better is bus speed,bus width,OS copatibility etc.  ",
            "date": "Answered September 3, 2017",
            "views": "47",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Antonio Isaza",
                    "user_href": "/profile/Antonio-Isaza-1"
                }
            ]
        }
    ]
}