{
    "title": "Which technology is used to create videos automatically from images ? - Quora",
    "tags": [
        "Videos",
        "Software and Applications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Joshi",
                "href": "/profile/Rahul-Joshi-222"
            },
            "answer_text": "There are multiple ways to do so but one method which I have worked on with my team in one of our projects was using the FFMPEG library. You can use this library with server side technologies like PHP or C#. There are even some code samples given on their official website on how to create videos from images: Create a video slideshow from imagesUsing ffmpeg to convert a set of images into a videoIn addition, if you want to go to the next level where you can embed content in videos on the fly, then you can check this tutorial here- Interactive Video Part 2: Developing the Player with the new AS3 API It is for AS3 language but would help you gain an idea on how it happens. ",
            "date": "Answered September 14, 2016",
            "views": "482",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Miriam John",
                    "user_href": "/profile/Miriam-John-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Szabi Kisded",
                "href": "/profile/Szabi-Kisded"
            },
            "answer_text": "I just finished working on a WordPress plugin that does this. It is able to create videos from images and mp3 files embedded in posts that are published on your blog. It will automatically embed the videos in the published post’s content. It is based on the ffmpeg library, so you will need to have it installed on your server to make this plugin work. Preview video:  ",
            "date": "Answered August 28, 2019",
            "views": "143",
            "upvotes": "0"
        }
    ]
}