{
    "title": "Which crops can grow in mountain soil? - Quora",
    "tags": [
        "Mountain Soil",
        "Crops",
        "Farming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rex Trulove",
                "href": "/profile/Rex-Trulove"
            },
            "answer_text": "Which crops can grow in mountain soil? Nearly any crops can grow in mountain soil. Mountain soil tends to be rich. I currently live in the Rocky Mountains. I previously lived in the Cascade Mountains. In both cases, I’ve grown crops such as peas, beans, corn, squash, pumpkin, watermelon, cantaloupe, cucumbers, carrots, beets, chard, lettuce, potatoes, tomatoes, eggplants, peppers, various herbs, cabbages, cauliflower, broccoli, kohlrabi, kale, and a few that I’m probably forgetting. Apples, pears, plums, cherries, peaches, apricots, blueberries, raspberries, and blackberries grow in profusion in both mountain ranges. In the case of mountains, the soil isn’t the limiting factor for growing crops. Climate is far more important. ",
            "date": "Answered January 6, 2018",
            "views": "85",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shashwata Koley",
                    "user_href": "/profile/Shashwata-Koley-2"
                },
                {
                    "user_id": "Nexus Pris",
                    "user_href": "/profile/Nexus-Pris"
                },
                {
                    "user_id": "Chandrima Choudhury",
                    "user_href": "/profile/Chandrima-Choudhury-1"
                },
                {
                    "user_id": "Vibhu Gupta",
                    "user_href": "/profile/Vibhu-Gupta-40"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SHERRI-L-Michalovic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brad Mitchell",
                "href": "/profile/Brad-Mitchell-35"
            },
            "answer_text": "So, different mountains have different soils. Some mountains are fairly barren, others have rich soil. Not all of earth’s mountains were created the same way, or at the same time. So it’s kind of hard to answer your question fully. Also, keep in mind that altitude, length of season, precipitation, temperature range, etc. In the Andes, I believe potato is the staple crop. In the higher elevations of the Himalaya, it’s millet. ",
            "date": "Answered May 23, 2018",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarita Rao",
                    "user_href": "/profile/Sarita-Rao-49"
                },
                {
                    "user_id": "Donald Berger",
                    "user_href": "/profile/Donald-Berger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Azhar Bhatti",
                "href": "/profile/Azhar-Bhatti-3"
            },
            "answer_text": "Soils near mountain are very fertile and if water available then rice , wheat , corn, potatoes and all types of vegetables and fruits are grown. Example is northern parts of Pakistan and India. ",
            "date": "Answered May 25, 2018",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ravi Verma",
                "href": "/profile/Ravi-Verma-1156"
            },
            "answer_text": "Tea ",
            "date": "Answered May 24, 2018",
            "views": "11",
            "upvotes": "0"
        }
    ]
}