{
    "title": "Who is Donald Trump's base? Why is he popular? Why are people voting for him? Why do people like and support him? - Quora",
    "tags": [
        "2016 US Presidential Campaign and Election",
        "US Presidential Elections",
        "Fame and Mass Popularity",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Beuke",
                "href": "/profile/Greg-Beuke"
            },
            "answer_text": "It’s funny to watch the pundits struggle with this question. I recently heard it phrased like this: Is Trump an aberration, or a symptom of something deeply wrong with the American people? Or you can just read the other answers to this question. Trump’s base is racist and stupid, right? Wrong. The fundamental reason people support Trump is this: Trump’s base sees him as someone who became President not with the blessings of the powerful, as every other president has, but by flouting the powerful. They see him as beholden only to himself and the American people. The Donald Trump phenomenon is probably the most interesting and surprising development in the history of American politics. I’m not a fan of Trump, but here’s one thing I did like: for the first time in modern political history, the kingmakers didn’t get their king. The game did not go how it was supposed to go. The big money played the game. Hard. And the big money lost. Trump won with half as much money as Clinton raised  “Clinton and her allies, including her joint committees with the Democratic Party and the super PACs supporting her, raised more than $1.2 billion for the full cycle, according to the last reports filed Thursday with the Federal Election Commission. Trump and his allies collected about $600 million.” If you are one of the millions who can't stand Trump, there is something you should know about how his base views you. They believe that you uncritically swallow everything that the media feeds you. They believe that you are all but unaware of the obvious media bias against Trump. They have never in their lifetimes seen the media so ferociously attack a major party nominee or a president. They don’t like everything about the guy. Who likes extramarital affairs and hush money payments? But they are aware of economic and foreign policy successes that any other president, especially a Democrat, would be rightfully lauded for. See Greg Beuke's answer to Based on his promises during the 2016 election, how much of what President Trump promised has he actually been able to deliver on so far? and Greg Beuke's answer to Is the USA more respected now (with Trump) than when Obama was president? for examples. In their view, there are two explanations for this treatment: 1) The media is controlled by only 6 powerful corporations. These 6 Corporations Control 90% Of The Media In America. And the powerful did not want Trump. And they are not happy about getting Trump. 2) The Media Bubble Is Real — And Worse Than You Think. From Politico: “As of 2013, only 7 percent of [journalists] identified as Republicans,” Silver wrote in March, chiding the press for its political homogeneity”. . . The results read like a revelation. . .Concentrated heavily along the coasts, the bubble is both geographic and political. If you’re a working journalist, odds aren’t just that you work in a pro-Clinton county—odds are that you reside in one of the nation’s most pro-Clinton counties.” And despite what the media tells us about its objectivity and neutrality, Trump’s base stubbornly insists that the media is made up of human beings, and their human tendencies will naturally lead to story selection bias, and biased coverage overall. And they think you are either too dumb or too political and stubborn to see it. But hey, things could be worse. At least they’re not saying you’re a bunch of racist assholes.  That is why Trump’s base still supports him, despite the fact that you only hear about the “horrible” things that he does and says, and never hear anything good about him. But let’s go back to the first part of the question—who is Trump’s base? They can be divided into two groups: 1) Conservatives/Republicans and 2) those who uniquely like and support Trump. I believe that the bigger part of Trump’s base just likes him because he is a Republican, and has enacted conservative policies. He cut taxes, cut regulations, and has appointed conservative judges, including two Supreme Court justices. They probably don’t like a lot of Trump’s behavior or rhetoric, but they like his results. Are these people racists? I’m sure some of them are. But there’s no reason to believe that most of them are. They’re just conservatives supporting a Republican president in a time of relative peace and prosperity. Ok, so what about the other group? What is the appeal of Trump specifically? How did so many Republicans vote for him that he won the nomination? What’s unique about Trump is that his focus is on what he believes will benefit the American worker. What are the two issues Trump is most known for? Trade and immigration. Everyone agrees he is a nationalist, as opposed to a globalist. He would tell you the same, and he doesn’t make any apologies for it. He told the leaders of the world at his speech to the UN that they should be nationalists for their own countries, too. Many agree with that sentiment. I am one of them. He is also called a protectionist when it comes to trade, and a nativist when it comes to immigration. I am not going to say he is not. This is especially interesting as a Republican. Most Republicans tend to take the side of business owners, especially when it comes to multinational organizations. Trump complains about American companies shutting down their US factories, opening foreign plants, and then sending their products back to us. And those manufacturing jobs, which provide good middle-class livings for people without college degrees, are never replaced. Did you ever hear George W. Bush, Mitt Romney, Ted Cruz, or any Republican even acknowledge that people are hurting because of this? Democrats aren’t much better. NAFTA was brought to us by Bill Clinton. Obama complained about NAFTA in 2008. But 8 years later, he had not even tried to do anything about it. You may have heard about Trump speaking to leaders of companies that planned on shutting down a U.S. plant. The media described it as highly unusual for a U.S. president to involve himself in such things. A U.S. president caring enough to personally fight for the jobs of American workers? Highly unusual, indeed. The second issue is immigration. I personally think Trump is wrong and shortsighted when it comes to immigration. It’s a large part of the reason why I am not a fan of his. But at the same time, I get it. While I don’t believe this is true empirically speaking, the perception among Trump’s base is that illegal immigrants, and even legal immigrants and temporary workers take jobs from Americans and lower their wages. Once again, Trump’s position is at odds with that of business owners, who stand to gain by liberal immigration policies. The business owners want foreign labor, and they want lower wages. It’s natural. Trump doesn’t blame them. He is one of them. I remember him talking openly about it one of the Republican primary debates. He said something along the lines of this: look, I know H-1b. I know H-2b. I know more about immigration law than anybody. I know how to hire people I shouldn’t be allowed to hire. I used the system to my advantage. Many of you are now thinking, “aha! He is a hypocrite! Why would his base still support him?!” Because they understand that when he was running his businesses, his goal was to maximize profits. Maximizing shareholder returns is actually what businesses are required to focus on. The goal of a president is to serve the American people. Trump’s base believes that his experience as a business owner gives him a unique perspective on how government policies affect business decisions. And he uses that to initiate policies that make it easier for businesses to grow the economy, while also attempting to limit some of the “tricks” business owners can use regarding immigration and trade. Please note that none of these reasons to support Trump, or even to oppose immigration, have anything to do with race or racism. Are there some people who support Trump because they oppose immigration, and they oppose immigration due to racism? I have no doubt that there are some. But neither I, nor you, have any empirical reason to believe that racists compose the majority of even this second part of Trump’s base. In fact, shockingly, not everyone who voted for Trump is even white, let alone a white racist! Trump did better with Blacks and Hispanics than Romney in 2012. “Trump claimed 29 percent of the Hispanic vote on Tuesday compared to Romney’s 27 percent in 2012. With blacks, exit polls show Trump claimed 8 percent of the vote to the previous Republican nominee’s 6 percent.” The bottom line is that there is no way to know exactly what percentage of any President’s supporters are racist. So in the absence of such data, it’s really not fair to just assume that the only viable explanation for such support is racism. There are other reasons why people might support him. I have provided some of these reasons in this answer. One more thing: please be aware that as much as you may hate Trump’s brash style, there are some who love it. People who seem to just say whatever the hell they feel like have a certain, undeniable appeal. It’s just that we tend to love these people when we mainly agree with them, and hate them when we mainly disagree with them. The perception among Trump’s base is that the media and his political opponents relentlessly bash him. But he does a pretty good job of bashing them right back. He goaded Elizabeth Warren into taking a DNA test and publicly releasing the results. He destroyed Jeb Bush by giving him a nickname. Trump’s opponents think he is appalling. His base thinks he is hilarious.  Maybe they’re both right. In the end, Trump’s base consists mainly of conservative Republicans. They support him mainly because he is a conservative Republican. Or at least he (mostly) governs like one. There are others who support him due to the unique aspects of his presidency, or at least their perceptions of it, which I have described above. Mystery solved, people. You’re welcome. Relaxed. Researched. Respectful. - War Elephant ",
            "date": "Updated October 10, 2020",
            "views": "2873",
            "upvotes": " View 5.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gary Kleiman",
                    "user_href": "/profile/Gary-Kleiman-5"
                },
                {
                    "user_id": "Angel Murphy",
                    "user_href": "/profile/Angel-Murphy-60"
                },
                {
                    "user_id": "Robert Clemons",
                    "user_href": "/profile/Robert-Clemons-10"
                },
                {
                    "user_id": "Sharon Meijland",
                    "user_href": "/profile/Sharon-Meijland"
                },
                {
                    "user_id": "Rich Grost",
                    "user_href": "/profile/Rich-Grost"
                },
                {
                    "user_id": "Peter Hedelund",
                    "user_href": "/profile/Peter-Hedelund"
                },
                {
                    "user_id": "Traci Stamper",
                    "user_href": "/profile/Traci-Stamper-1"
                },
                {
                    "user_id": "Zachary Tucker",
                    "user_href": "/profile/Zachary-Tucker"
                },
                {
                    "user_id": "Melody Cooper",
                    "user_href": "/profile/Melody-Cooper-23"
                },
                {
                    "user_id": "Nilay Parikh",
                    "user_href": "/profile/Nilay-Parikh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Johnston",
                "href": "/profile/Alex-Johnston-39"
            },
            "answer_text": "This question has been answered a kajillion times. But I have a brief answer which I think throws a little illumination on the matter. I may be wrong, but I think this answer may throw some light not just on Trump’s appeal to some people, but also on why some people are so fervently behind him, and so unshakable in their support; and what this says about certain aspects of American culture, and American masculinity.  In order to answer this, I have to talk briefly about a certain major movie star of the mid-20th century. Gary Cooper.  Gary Cooper was a Republican, but he died in 1961, when JFK was president and when the most recent Republican president was Dwight D. Eisenhower, so he was a Republican at a time when it meant something very different from what it means now. Pre-Trump, pre-Bush I and II, pre-Reagan—hell, pre-Nixon. Gary Cooper was a wonderful star, but he did tend to appear in some rather simple-minded movies. His most famous films are probably High Noon and The Fountainhead, but I have a rather guilty fondness for Howard Hawks’ Sergeant York. He was actually good at comedy (e.g. Ball of Fire) but he preferred to be cast as granite-jawed heroes. At least, until late in his career, when a sense of doubt began to creep into his performances, which sometimes made them more interesting. Cooper wasn’t exactly tremendously intellectual, and he liked to be guided by other people as to what he should do. This made him notoriously prone to having extra-marital affairs with female co-stars: he was shy, soft-spoken and handsome, and women found him very attractive, and at the first hint of willingness he would tumble into the sack. Eventually reports of these affairs got out, and Cooper’s wholesome family-man image was tarnished. A bit. There is a point to all this detail about Gary Cooper. Please bear with me. Anyway, the film critic David Thomson wrote a brief monograph about Cooper, in which he told a fascinating story. At one point in his career, Cooper was under contract to Goldwyn Studios. While he was there, he befriended a story editor named Niven Busch. Busch and Cooper had similar taste in sports, but Busch, a Princeton graduate, was rather more literate. One day, Cooper called in on Busch to see how work was going on his latest picture. Busch confessed that he had a story problem which he couldn’t solve. Cooper’s reply was extremely interesting, in terms of how he understood his own cinematic and therefore cultural persona: Well, Niven, seems to me if you make me the hero it usually comes out right. At first, Busch thought Cooper was joking. But then he realised that Cooper was simply telling the truth, as he saw it. Cooper’s charisma was such that all you had to do was cast him as the hero, and his character could have plenty of failings, but he would still be seen as the hero. If Gary Cooper was starring in a movie, no matter what he did, he was the good guy. The public couldn’t see him as a bad guy. They adored his lean, laconic manliness. It’s true that he never accepted a role as a villain, but then he wasn’t offered one. Gary Cooper’s perceived virtues made it so that whatever character he played, he’d be the good guy. Other stars liked to play with their persona. Henry Fonda spent a career playing careworn heroes, then was brilliant as the bad guy in Once Upon A Time In The West. Gregory Peck was a shining hero of righteousness, then was mad Ahab in Moby-Dick. Cary Grant’s genius was that he could be simultaneously sympathetic and unsympathetic: he was fascinating, but he was also intriguingly three-dimensional and ambiguous. He could keep you guessing. Cooper, not so much. If Gary Cooper had played Ahab, he would have come across not as a maniac, but as a good guy driven to awful desperation by a mean whale.  Donald Trump is a beneficiary of the Gary Cooper Effect. His diehard supporters see him as a hero. That’s why it doesn’t matter what he actually does. He can lie, cheat, abuse, betray his friends and colleagues, slander war veterans and their families, even bargain with a foreign power for his own gain. None of that matters if you consider him a star, and feel that he’s the hero. He can be forgiven, endlessly, because on some level, he appeals to them in the basic, gut-level way that Gary Cooper’s laconic, frontiersman ruggedness appealed to film audiences then and, occasionally, now. (My rational brain knows that Sergeant York is bollocks, but it still works on me.) In real life, Gary Cooper was a philanderer and a bad family man. Onscreen, he was a hero. And so with Trump. His screen persona is far more gnarly and less noble and more blustering and resentful, but whaaaat? I’m president here! Gary Cooper would never have boasted of grabbing women by the pussy, or mocked a disabled journalist. He was far too decent and well-intentioned. But while the surface features change, the underlying role of the anti-social hero is still there. Trump’s persona is more like a 70s, New Hollywood version of the Hollywood hero: think Al Pacino in …And Justice for All, or Eastwood in Dirty Harry. And why not even Mel Gibson in Lethal Weapon? He’s not afraid to get his hands dirty! So he cuts corners! So he has to break a few rules! If you already believe that he is the hero, basically all of American popular culture since the 60s has been telling you that he’s more trustworthy than the nameless guys in suits. Seems to me if you make me the hero it usually comes out right. Trump’s diehard supporters have made him the hero. They may not think of him as, exactly, a ‘hero’, but what other word is there for someone whose flaws you’re totally aware of, yet you still trust him to do the right thing? They agree with him anyway, but he is playing the role of the hero in a great drama, with more conviction than any of his opponents are. (Except perhaps Elizabeth Warren, depending on who you ask.) And you don’t abandon the hero just because things got tough. How we got to this situation is, of course, a quite different matter, outside the scope of this answer.  I leave you with these lines from a play written by a German writer during, and in the immediate aftermath of, WW2. —Unhappy the land that has no heroes. —No. Unhappy the land that needs heroes. Bertolt Brecht, Life of Galileo ",
            "date": "Answered January 27, 2020",
            "views": "797",
            "upvotes": " View 2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christy Martinez de Escobar",
                    "user_href": "/profile/Christy-Martinez-de-Escobar"
                },
                {
                    "user_id": "Robert Clemons",
                    "user_href": "/profile/Robert-Clemons-10"
                },
                {
                    "user_id": "Edward H. Wahl",
                    "user_href": "/profile/Edward-H-Wahl"
                },
                {
                    "user_id": "Thomas Salo",
                    "user_href": "/profile/Thomas-Salo"
                },
                {
                    "user_id": "Elliott Mason",
                    "user_href": "/profile/Elliott-Mason-1"
                },
                {
                    "user_id": "Jan Ramsey",
                    "user_href": "/profile/Jan-Ramsey-1"
                },
                {
                    "user_id": "Greg Madson",
                    "user_href": "/profile/Greg-Madson"
                },
                {
                    "user_id": "Unko BillyG aka Billy Gomban",
                    "user_href": "/profile/Unko-BillyG-aka-Billy-Gomban"
                },
                {
                    "user_id": "Izzy Straus",
                    "user_href": "/profile/Izzy-Straus"
                },
                {
                    "user_id": "Ilya Zhitomirskiy",
                    "user_href": "/profile/Ilya-Zhitomirskiy-2"
                }
            ]
        }
    ]
}