{
    "title": "Who sells more smartphones, Apple or Samsung? - Quora",
    "tags": [
        "Samsung (conglomerate)",
        "Samsung Galaxy Phones",
        "Apple (company)",
        "iPhones (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "P S",
                "href": "/profile/P-S-1935"
            },
            "answer_text": "Samsung Samsung once again tops the table with 20% market share globally. The South Korean tech giant shipped 59 million phones in Q1 2020. Huawei At No. 2 position is Chinese mobile giant Huawei with 17% market share. Huawei shipped 49 million smartphones during the quarter of 2020. Apple iPhone maker stands at No. 3 with 40 million iPhone shipments across the world in the first quarter of 2020 Cupertino giant’s market share stands at 14%. Xiaomi At fourth spot is Xiaomi. The Chinese smartphone brand holds 10% market share with 29.7 million units shipped in the first quarter of 2020. Oppo Oppo gets fifth position in the list with 22.3 million smartphone shipments in Q1 2020. Vivo Vivo follows sibling Oppo at No. 6. The BBK group company shipped 21.6 million units in Q1 2020. Realme The 7th position goes to a BBK group company, Realme. One of the fastest-growing smartphone brands globally, Realme shipped 7.2 million units during the quarter. Lenovo Group In eighth spot is Lenovo Group, including both Lenovo and Moto phones. The Chinese company shipped 5 million smartphones during the first quarter of 2020. LG LG stands at No. 9. The South Korean tech giant shipped 6.9 million smartphones globally during the quarter. Tecno Tecno rounds up the top 10 list of smartphone brands in the world for the first quarter of 2020. It shipped 4.7 million smartphones ",
            "date": "Updated October 18, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prince Wadhwa",
                "href": "/profile/Prince-Wadhwa-8"
            },
            "answer_text": "Apple has sold more phones than Samsung, but I just thought of sharing an interesting trivia here (I read it around the launch of the IPhoneX). According to analyst firm Counterpoint, Apple is expected to sell 130 million iPhone X over the next two years, which would give Samsung close to $14 billion in additional revenue (because Samsung makes the screen and related components). For what it's worth, Samsung is only estimated to make $10 billion in profits from its own Galaxy S8 devices over that same span. This means the iPhone X is bringing Samsung more money than the company's own flagship. ",
            "date": "Answered December 19, 2017",
            "views": "322",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Valerie Curtis",
                    "user_href": "/profile/Valerie-Curtis-1"
                },
                {
                    "user_id": "Hemanth",
                    "user_href": "/profile/Hemanth-390"
                },
                {
                    "user_id": "Akila Gnanaraj",
                    "user_href": "/profile/Akila-Gnanaraj"
                },
                {
                    "user_id": "Daanya Ahmed",
                    "user_href": "/profile/Daanya-Ahmed"
                },
                {
                    "user_id": "Michael Drummond",
                    "user_href": "/profile/Michael-Drummond-27"
                },
                {
                    "user_id": "Benbeghdad Brahim",
                    "user_href": "/profile/Benbeghdad-Brahim"
                },
                {
                    "user_id": "Deepak Singh",
                    "user_href": "/profile/Deepak-Singh-3886"
                },
                {
                    "user_id": "Dmitry R",
                    "user_href": "/profile/Dmitry-R"
                },
                {
                    "user_id": "Calvin Chan",
                    "user_href": "/profile/Calvin-Chan-149"
                },
                {
                    "user_id": "Cindy Dixon",
                    "user_href": "/profile/Cindy-Dixon-1"
                }
            ]
        }
    ]
}