{
    "title": "Who are the top 10 company founders of all time? - Quora",
    "tags": [
        "Best of X",
        "Startup Founders and Entrepreneurs",
        "Entrepreneurship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rauf Ahmed",
                "href": "/profile/Rauf-Ahmed-29"
            },
            "answer_text": "According to me when one is working on to finding a company the core ingredients which has to be carried in the mind of the founder is positive attitude to face challenges in the journey,Determination to succeed,dedication to solve the biggest of problems and devotion to give 100 % effort when finding a company. Over the years we have heard about the stories of billion dollar company founders like Steve Jobs , Jack Maa , Mark Zuckerberg and more. So today I WILL Talk about the STARTUPS STARTED BY A LADY WITH JUST TWO LAKH Rupees and a LAPTOP. Just a quick look into her inspiring story of ENTREPRENEURSHIP. Hire Indians , Bollywood Kart and Ek Koshish Foundation  Sujata Arora (37 Years) Founder of Hire Indians,Bollywood Kart , Ek Koshish All the three organisations are founded by Sujata Arora who belongs from Chandigarh.Her first company which was founded in 2009 is Hire Indians which provides developers , designers , testers and project Manager to companies around many industries.Then She founded Bollywood Kart out of her passion for fashion in 2017 .And finally Ek Koshish Foundation which provides food and medicines to children who are from disadvantaged backgrounds (Non Profit Organization).Today Sujata Arora has her offices in countries like United States , United Kingdom , United Arab Emirates and Switzerland and last but not the least Australia.To know more check out her company links Attached below :https://hireindians.com https://www.bollywoodkart.com/ Koshish Foundation | Homepage Hope this story gives reader the inspiration to Just Start ! ",
            "date": "Answered July 31, 2019",
            "views": "455",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deborah Sweeney",
                "href": "/profile/Deborah-Sweeney-15"
            },
            "answer_text": "There are so many entrepreneurs to choose from for this answer! I love the story behind how Brian Chesky and Joe Gebbia founded Airbnb. The startup is extremely successful as a company and business model, and has worked its way into our pop culture lexicon. ",
            "date": "Answered October 24, 2018",
            "views": "40",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gail-173"
                }
            ]
        }
    ]
}