{
    "title": "Who would you talk to if you had the technology to enable an 8K movie of theatrical level quality on a blue ray disc capable of High Dynamic Range 12 that could be distributed over the internet with encrypted delivery? - Quora",
    "tags": [
        "Blu-ray"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Hannent",
                "href": "/profile/Bob-Hannent"
            },
            "answer_text": "You've confused technology It's either Bluray or it's over the Internet, which is it? We can already deliver theatre quality 8k over the Internet in an encrypted way and importantly in a standard way. Standards are really important, having technology is largely irrelevant if it isn't supported by anyone. That might seem like a chicken and egg problem, but playback doesn't usually happen in CPUs, it happens in GPUs. The cost of compute in encoding and the efficency of that coding is important. If you truly have something that's better than 15% more efficient than AV1 with the same picture quality and a reasonable CPU then you could do worse than blogging about it first. Do SSIM, VMAF and other quality measurements, especially those recommended by MSU. Then you can provide data to back-up your claims. Your greatest chance of getting things accepted is to go down the route of implementing your code in LC-EVC form because then it comes in a standardised framework. Worried about having your intellectual property stolen? Firstly, don't worry as much, most people aren't interested in stealing ideas, it's too much like hard work and they have enough to do already. Are you absolutely sure you haven't used a technique that someone else has already patented? You need to check all the patents from MPEG-LA and Helios, as well as the techniques from AV1, Dirac and others. If you have done what hundreds of people from around the world who have spent decades studying haven't been able to do? Then get a patent. Patents are relatively expensive and hard to write, but it is the best way to protect unique intellectual property. But you need to be absolutely sure your technique is unique in this case because your IPR could potentially be easily defeated by one of the thousands of standing examples of prior art. If you publish a paper on the subject, at least you have prior art in any future discussions. And you can do that without a patent. If it really is ground breaking then someone like Google or Netflix could give you a high paid job, thats probably worth more than the risk of a patent search and filing. ",
            "date": "Answered October 22, 2020",
            "views": "289",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Siddhant Jain",
                    "user_href": "/profile/Siddhant-Jain-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Bowerman",
                "href": "/profile/Ian-Bowerman-1"
            },
            "answer_text": "Would it surprise you to find out that most films shown at the cinema aren’t even in 4K? Even a basic Blu-ray played on a decent cinema projector will have a quality that’s nearly indistinguishable from the cinema’s DCP standard. However, a 90minute film with extras on blu ray still has to fit on a disc that’s around 8gb whereas a 2k 2d 90minute DCP will be around 90-120gb It differs when it comes to the blockbusters, or action films that require the images to be better defined, but for a simple period drama, the excessive file sizes that come with 4K or 8k presentations are simply not required. ",
            "date": "Answered October 25, 2020",
            "views": "232",
            "upvotes": "0"
        }
    ]
}