{
    "title": "Who am I? What we are? Why we born in this planet called Earth? Who made us to be here and for what purpose? - Quora",
    "tags": [
        "Purpose",
        "Earth (planet)",
        "Planetary Science",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Cass",
                "href": "/profile/Stephen-Cass-7"
            },
            "answer_text": "Depends on what side of the argument or debate…if u think we magically evolved from nothingness to this wonderful planet called earth…weĺl then there is no rhyme reason or purpose to why…we just are…some say that we are just a bunch of molecules that followed the laws of thermodynamics and viola…here we are…I on the other hand am a believer in God. I think we were created for the creators pleasure. We initially were here to enjoy all that God had created in the universe but because man wanted to be God and not worship and listen to him. We ate the forbidden fruit and what is known as sin came to be, along with all the other horrible things like jealousy, hatred and murder to name a few. Now because of sin or disobedience God distanced himself from us. So many years after the initial sin took place, God took upon flesh and we now know him as Jesus who is called the Christ. He became a blood sacrifice for all of us and then rose from the dead. If you choose to accept that he will let you be with him when u die for all eternity. Sounds incredible but its true.. On the other hand if u decide u want to be ur own God and thats that. Well, he will punish u along with everyone else in a place of torment. I am not saying that this place of torment is better or worse than u imagine but I do not plan on going there myself. I am good with worshipping something bigger and better than myself. I will mot worship the created but I do and will worship the creator. There is an old saying which is u have been weighed in the balances and are found wanting..U do not want to be found wanting as in general it means you are an evil person and must be punished accordingly. Generally this is used for the people that have not known Christ and did not have the chnace to accept or reject his sacrifice. Read my other posts for more information…but more importantly read the bible and learn about God thru people, books or websites u trust. ",
            "date": "Answered July 21, 2017",
            "views": "283",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Roseen",
                "href": "/profile/Joseph-Roseen"
            },
            "answer_text": "You are you, an entity that has asked this question. We are a race called humans, bipedal intelligences. There is no real reason for us being here, we just are, what is is here is just here. We were born of this earth of a complex collection of chemical reactions in a universe of origins unknown. We have no real purpose except what we make of ourselves, that is what makes us human, that is what makes us great. ",
            "date": "Answered July 21, 2017",
            "views": "89",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Katie Louise",
                    "user_href": "/profile/Katie-Louise-321"
                }
            ]
        }
    ]
}