{
    "title": "Who will inherit the Earth? - Quora",
    "tags": [
        "Expanding Earth Hypothesis",
        "Inheritance",
        "Earth Science",
        "Earth (planet)",
        "Planetary Science",
        "Astronomy",
        "Christianity",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "John O’Gara",
                "href": "/profile/John-O’Gara"
            },
            "answer_text": "I believe what the Bible teaches. Here’s some of what it teaches on the subject. “But the meek will possess the earth, And they will find exquisite delight in the abundance of peace” Psalms 37:11 NWT “The righteous will possess the earth, And they will live forever on it.” Psalm 37:29 NWT “Blessed are the meek: for they shall inherit the earth.” Matthew 5:3 KJV So, meek people who are righteous, from God’s point of view, will inherit the earth. Haughty, arrogant people will not. “…God opposes the haughty ones, but he gives undeserved kindness to the humble ones.” 1 Peter 5:5 NWT “…Anyone with haughty eyes and an arrogant heart, I will not tolerate.” Psalm 101:5 NWT The onus is on each one of us to do an honest self-examination of ourselves and determine if we need improvement. Use the Bible as a guide. Remember it’s the way God views us, not we think of ourselves or what others think of us. “… For the way man sees is not the way God sees, because mere man sees what appears to the eyes, but Jehovah sees into the heart.” 1 Samuel 16:7 NWT For a self-paced free online Bible study click this link Online Bible Study Lessons ",
            "date": "Answered August 30, 2020",
            "views": "84",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pamela Cooper",
                    "user_href": "/profile/Pamela-Cooper-34"
                },
                {
                    "user_id": "Steve Martin",
                    "user_href": "/profile/Steve-Martin-325"
                }
            ]
        },
        {
            "author_info": {
                "name": "Milan Woodson",
                "href": "/profile/Milan-Woodson"
            },
            "answer_text": "Here are the kind of people who practice and possess certain noble qualities that will inherit the earth. It is not a single attribute that will move God to preserve them for life on earth but a combination of these to an acceptable degree in harmony with the will of God. Those who will inherit the earth are... The righteous The loving The upright The mild-tempered The meek The mild The humble The modest The moderate The respectful The obedient The just The divinely wise The godly compassionate The godly affectionate The godly devoted These developed traits must be practiced along with the doing of the will of God. Just having these traits, even to a substantial degree, will not be what will move God to allow one to inherit the earth. A person must do the will of God, which mainly involves love for and the salvation of one's fellow man. ",
            "date": "Updated September 20, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Brett Hedges",
                    "user_href": "/profile/Brett-Hedges-2"
                }
            ]
        }
    ]
}