{
    "title": "Who are the key UK edtech startups? - Quora",
    "tags": [
        "Educational Technology",
        "E-learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabriel Chu",
                "href": "/profile/Gabriel-Chu-4"
            },
            "answer_text": "As of May 2020 these are the 6 most valued UK edtech startups according to Tech Nation’s database: Immersive LabsValuation: 160-240 million USDLaunch date: 2017Founders: James HadleyLocation: BristolFunding to date: 43.8 million USDConcept: They claim to be the “world’s first fully interactive, gamified and on-demand cyber skills platform.” It basically allows companies to manage and expand their cybersecurity capabilities by training their employees. Its main value propositions are:Visibility over cybersecurity training and progressOn-demand training that reflects current risks for the organisationFast bite-sized training with new content consistently updated as new threats are identified in the webA Cloud GuruValuation: 132-198 million USDLaunch date: 2013Founders: Ryan Kroonenburg, Sam KroonenburgLocation: LondonFunding to date: 36.4 million USDConcept: They claim to be the “leaders in cloud learning” and provide an online platform for learning cloud computing. It trains students to be proficient with the main cloud service providers out there: Amazon Web Services, Google Cloud Platform, and Microsoft Azure. It’s main value propositions are:For business: attract and retain talent through trainingFor individuals: advancing their careers by learning by doingMacatValuation: 120-180 million USDLaunch date: 2017Founders: Hassan Abdou, Salah KhalilLocation: LondonFunding to date: 27.3 million USDConcept: Macat claims to be a “world leader in critical thinking solutions that transform the way people learn, work and live.” Its aim is to develop foundations on critical thinking to help students more easily learn other skills on top of this. It accomplishes this through assessments, classes and an online library.Future LearnValuation: 100 million USDFounded: 2017Founders: The Open University, SEEK Ltd.Location: LondonFunding: 50 million USDConcept: Future Learn offers various online courses from leading universities from around the world. These can be accessed via tablet, computer or phone and have a focus on social learning, allowing students to discuss among each other to make the learning experience more enjoyable and productive. They have offerings for individuals and businesses. Its key value propositions are:Modern learning through storytelling and online discussionsFlexible self-paced learningAccessible learning (free courses)Kano ComputingValuation: 112-168 million USDFounded: 2013Founders: Alex Klein, Saul Klein, Yonatan Raz-FridmanLocation: LondonFunding: 40.5 million USDConcept: Recognized by Fast Company in 2019 as the 2nd most innovative company in consumer electronics, Kano teaches coding and design to kids by allowing them to write code to play and interact with their products. The latest one lets kids build Harry Potter wands and make magic!Fuse UniversalValuation: 80-120 million USDFounded: 2008Founders: Steve DineenLocation: LondonFunding: 27.3 million USDConcept: Fuse claims to be the “first learning ecosystem that’s not built around courses”. It helps organizations develop a learning culture by designing learning that helps achieve business outcomes. It’s key value propositions are:Agile learning: bite-sized, on-demand learning which is practice-focusedFacilitating mentoring by helping people share resources between each other————————————————————————————————————— I’m about to start a deep dive into Edtech in the UK and Europe. If you have any questions you’d like answered let me know! :) ",
            "date": "Answered May 9, 2020",
            "views": "157",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Sage",
                "href": "/profile/Scott-Sage"
            },
            "answer_text": "One of the largest edtech companies in the world is British, the Pearson Group, who owns Pearson Education (and currently the FT). Also, Promethean Ltd. sell Promethean Boards into school districts (and corporations). As far as startups go, there are several from very early stage (prototyping) to early stage (have paying customers but have not yet scaled). These include:  Arbor Education - adaptive teaching platformBusuu - language learning network/appLanguagenut - language learning for K-12Zondle - games based learningKnodium - open learning networkQuipper - mobile learningMediaCore - video learning (disclaimer: I'm an advisor and they are HQ'd in BC, Canada)BlikBook - Professor/student learning collaboration platformWordia - games based learning platform for grammarMangaHigh - games based learning for mathsMindshapes - Interactive learning companyRealSmart - learning platformFlooved - educational content and collaboration platformClassDojo - behavioural management (founders are British and based in SV)General Assembly - offline teaching off knowledge economy skills (HQ in NYC)There are many other edtech companies focusing on earlier K-12 products but the question asked about later K-12 and high-ed. There are also dozens of high-growth European start-ups in this space that I have not included. ",
            "date": "Answered January 7, 2013",
            "views": "31",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adam Williams",
                    "user_href": "/profile/Adam-Williams-189"
                },
                {
                    "user_id": "Audrey Jarre",
                    "user_href": "/profile/Audrey-Jarre-1"
                },
                {
                    "user_id": "Ayrton Cable",
                    "user_href": "/profile/Ayrton-Cable"
                },
                {
                    "user_id": "Jake Vago",
                    "user_href": "/profile/Jake-Vago"
                },
                {
                    "user_id": "Bernhard Niesner",
                    "user_href": "/profile/Bernhard-Niesner"
                },
                {
                    "user_id": "Martin Saunders",
                    "user_href": "/profile/Martin-Saunders-1"
                },
                {
                    "user_id": "Nicolas Philippe",
                    "user_href": "/profile/Nicolas-Philippe-1"
                },
                {
                    "user_id": "Rahul Keerthi",
                    "user_href": "/profile/Rahul-Keerthi"
                },
                {
                    "user_id": "Sabah Hussain",
                    "user_href": "/profile/Sabah-Hussain"
                },
                {
                    "user_id": "Barry Whiteside",
                    "user_href": "/profile/Barry-Whiteside"
                }
            ]
        }
    ]
}