{
    "title": "Who invented Star Trek's Prime Directive? - Quora",
    "tags": [
        "Prime Directive",
        "Starfleet",
        "Star Trek (TV Series)",
        "Star Trek: The Next Generation (TV series)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Hooper",
                "href": "/profile/Steve-Hooper-6"
            },
            "answer_text": "Prime Directive In the fictional universe of Star Trek, the Prime Directive (also known as \"Starfleet General Order 1\", \"General Order 1\", and the \"non-interference directive\") is a guiding principle of Starfleet, prohibiting its members from interfering with the internal and natural development of alien civilizations.[1] The Prime Directive applies particularly to civilizations which are below a certain threshold of technological, scientific and cultural development; preventing starship crews from using their superior technology to impose their own values or ideals on them.[2] Since its introduction in the first season of the original Star Trek series, it has served as the plot focus of numerous episodes of the various Star Trek series. The Prime Directive prohibits Starfleet personnel and spacecraft from interfering in the normal development of any society, and mandates that any Starfleet vessel or crew member is expendable to prevent violation of this rule and, As the right of each sentient species to live in accordance with its normal cultural evolution is considered sacred, no Starfleet personnel may interfere with the normal and healthy development of alien life and culture. Such interference includes introducing superior knowledge, strength, or technology to a world whose society is incapable of handling such advantages wisely. Starfleet personnel may not violate this Prime Directive, even to save their lives and/or their ship, unless they are acting to right an earlier violation or an accidental contamination of said culture. This directive takes precedence over any and all other considerations, and carries with it the highest moral obligation. Creation and evolution Creation of the Prime Directive is generally credited to original-series producer Gene L. Coon. The Prime Directive reflected a contemporary political view that US involvement in the Vietnam War was an example of a superpower interfering in the natural development of southeast Asian society; the creation of the Prime Directive was perceived as a repudiation of that involvement. ",
            "date": "Answered November 11, 2019",
            "views": "171",
            "upvotes": " Answer requested by Daniel Guerra",
            "upvoters": [
                {
                    "user_id": "Neel Desai",
                    "user_href": "/profile/Neel-Desai-15"
                },
                {
                    "user_id": "Finnella Flanagan",
                    "user_href": "/profile/Finnella-Flanagan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Grilz",
                "href": "/profile/Andy-Grilz"
            },
            "answer_text": "As mentioned, Gene Coon created the Prime Directive as part of the original series ‘bible’. In the Star Trek universe, the premise may have come from Johnathan Archer, Captain of the Enterprise NX01 and the first President of the United Federation of Planets. To quote, “Some day, my people are gonna come up with some sort of a doctrine, something that says what we can and can't do out here, should and shouldn't do. But until someone tells me that they've drafted that directive, I'm gonna have to remind myself every day that we didn't come out here to play God.\" It’s an ironic statement from a man who nettled against the Vulcan’s resistance to giving Earth warp technology until they felt mankind was sufficiently advanced to use it responsibly. ",
            "date": "Answered March 16, 2020",
            "views": "117",
            "upvotes": " View 2 Upvoters"
        }
    ]
}