{
    "title": "Who invented CRISPR? - Quora",
    "tags": [
        "CRISPR Patent Battle (December 2015)",
        "History of Biology",
        "CRISPR",
        "History of Science",
        "Intellectual Property Law",
        "Inventors",
        "Biotechnology",
        "Molecular Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher VanLang",
                "href": "/profile/Christopher-VanLang"
            },
            "answer_text": "There are actually two questions behind this question. Let's start with the first question. Who discovered CRISPR? In 1987, Yoshizumi Ishino at Osaka University was studying the E. coli gene iap. During their sequencing efforts (remember, this was 1987), they found this odd 29 nucleotide repeat sequence with a 32 nucleotide spacing. The final sentence of the paper [1] So far, no sequence homologous to these have been found elsewhere in procaryote, and the biological significance of these sequences is not known. In the post sequencing era in 2000, Francisco Mojica and Guadalupe Juez's team at the University of Alicante did a quick comparative analysis of prokaryote genomes and identified a series of Short Regularly Spaced Repeats (SRSRs) that were common among multiple species. At the time, there were speculated if it had any functional aspect or was simply an ancestral byproduct of evolution. [2] In 2002, Ruud Jansen of Utrecht University again found a 21-37 bp repeat and citing the Ishino and Mojica work, recognized that these interspaced short sequence repeats have a distinct spacing which varies by organism. In their cited examples, Salmonella typhimurium was 21 bp where as Streptococcus pyogenes was 37 bp. Notably, they found that CRISPRs were unique to certain prokaryotes and not viruses nor eukaryotes. Most notably, they identified a common sequence, GTT/AAC at the ends of the ends. Upstream of the CRISPR loci, there was a long homologous sequence without an open reading frame indicative of a conserved ncRNA segment. Nearby, there were able to identify homologous genes which would become cas1 to cas4. Working with Mojica, they came up with the name Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR) [3] It was then realized that Ishino happened to discover the first CRISPR loci. Which then really made things get interesting and started several searches. What was the point of these CRISPRs? In 2006, Eugene Koonin began hearing that several groups were finding viral DNA between the CRISPR repeats. The original hypothesis was that the CRISPR were associated with DNA repair. However, from bioinformatics searches, the huge presence of foreign DNA in spacers that were regularly getting turned over was indicative of a mechanism akin to RNAi. [4] Koonin proposed that CRISPR was a defense mechanism that enabled immunological memory. Some microbiologists were crazy enough to listen. Rodolphe Barrangou and Philippe Horvath were working at Danisco, a yogurt company, and they were curious about strategies to help their yogurt cultures survive viral infections. They started infecting their bacteria with viruses and looked for viral DNA in the CRISPR spacers. Sure enough, the viral DNA was contained in the immune cells. When the DNA sequences were removed from the spacers, immunity was lost. In 2007, there was mechanistic proof that CRISPR served as a mechanism to defend against viruses using a completely novel mechanism of action. [5] By 2010, the world of CRISPR molecular biology was exploding. It would be determined that the CRISPR system would behave in a certain pattern. Foreign DNA would incorporated into the CRISPR loci as a spacer via CRISPR adaption.The CRISPR cluster would be expressed as the pre-crRNA. The pre-crRNA would then be processed by Cas6/CasE/Csy4. The mature crRNA is bound to the Cascade complex to generate a guide RNA.At that point, CRISPR interference occurs and the Cascade complex cuts the foriegn mRNA and DNA using Cas3. [6]2005-2012 was this incredibly exciting time for CRISPR biology. It was this fascinating completely unexplored field of ncRNAs and with the right set of experiments, you could quickly open huge doors with an easy Nature paper and groups were tripping over each other to prevent getting scooped. It was one of the most exciting areas for basic research in molecular biology. I would also say that no one was quite ready for what was going to happen next. Which brings us to the real questionWho invented the CRISPR/CAS9 system? Jennifer Doudna was famous not for CRISPR, but for solving one of the most challenging crystal structures, the Tetrahymena Group I ribozyme in 1991, the 2nd RNA solved structure since tRNA. Until recently, she has largely specialized on solving RNA structures. At this point, if Doudna never made CRISPR, she would have already had a respectable career probably getting into the National Academy of Science on top of a whole array of prizes that she already won before going into CRISPR research. Because of their expertise in RNA-protein biochemistry, her group started studying RNAses like Argonaute, Dicer, and the CRISPR endonucleases. Shortly after Barrangou's discovery of the role of CRISPR, a new postdoc Blake Wiedenheft and later Martin Jinek decided that it would be neat to try to crystallize various CRISPR proteins. Very quickly, the Doudna group was able to generate structures of the multiunit CRISRP Cascade and from those structures identified the key enzymes related to cleavage.[6] In 2009, they identified Cas1 as a DNA-specific endonuclease [7] and in 2010, identified Cys4 as the Cas6 protein responsible for pre-crRNA processing. [8] With a clear insight of the mechanism of the CRISPR/Cascade, it became clear that these Cas proteins were endonucleases that had the ability to cleave any DNA strand in a mechanism very similar to that of RNAi. Rather than relying on using all 6 Cas proteins of the Cascade, they tried identifying a smaller system. Emmanuelle Charpentier was a new Professor who was studying trans acting genetic elements in microbes and established herself as an expert on regulatory ncRNAs. From studying Streptoccus pyogenes, her group identified an abundance of trans-activating CRISPR RNAs (tracrRNA) that would help process the CRISPR RNA using a combination of the Cas9 (at the time called the Csn1 protein) and RNase III via the type II CRISPR/Cas system. [9] Shortly after that work in 2011, Charpentier and Doudna meet at a conference and from that meeting they decided to start a collaboration to fully understand the mechanism of the Cas9 protein. The collaboration was were strengthened by two Polish postdocs, Martin Jinek and Krzysztof Chylinski, who were excited about the opportunity to communicate with their fellow countrymen thousands of miles away. This team isolated the Cas9 protein and identified the Cas9 protein as a DNA endonuclease guided by two RNAs, the tracrRNA and the processed crRNA in a sequence specific manner contained in the crRNA. As a result, the tracrRNA not only serves a role in crRNA processing but also plays a role with the Cas9 activity itself. The double stranded RNA as well as the PAM sequence is required for Cas9 recognition of the crRNA. [10] Through biochemical mutations in the Cas9 protein, they isolated the active sites and recognized that cleavage occurs in two domains, the HNH domain cleaves the complementary strand where as the RuvC domain cleaves the noncomplementary strand.[10] The really key experiment was an examination of the crRNA and tracrRNA secondary structure. Recognizing the structure, a single guide RNA could be created to create a system that would be able to trigger the Cas9 endonuclease to induce double strand breaks.[10]  In that pivotal study, Doudna and Charpentier recognized through a very careful set of experiments that the Cas9 endonuclease was able to generate double strand breaks, a key finding that would allow scientists to carefully cut DNA in specific locations and trigger double strand break repair. That ability allows anyone to insert a DNA fragment of choice. [10][11] It was June 2012. With the mechanism solved and the proof of concept demonstrated, it lead to a massive footrace to demonstrate the same in humans. Feng Zhang was already famous because of his work in developing Optogenetics. By inserting a gene into a neuron cell, they could activate specific neuron cells simply by shining light into the position. With that ability, a scientists would be able to control the actions of a monkey purely with the switch of the light. In turn, Feng help launch an entire field of neuroscience and until 2012, was probably the breakthrough of the decade. Already at a young career, Feng was in a good spot to share a several awards with Karl Deisseroth and Edward Boyden for that body of work. However, the huge challenge with the system was readily producing neurons with the integrated gene. As a postdoc with George Church, Feng was exploring methods on using the TALE system to rapidly and easily target DNA sequences in mammalian genomes. With the early realizations of the Cas9 endonuclease system, it was just a matter of time before a way to make it work in humans was possible. Coming from George Church's group, a group that was already well positioned to manipulate genes, Zhang was able to quickly commercialize the technique. In January 2013, 4 sets of papers were published: Cong and Zhang 3JAN13 Multiplex Genome Engineering Using CRISPR/Cas Systems [12]Mali and Church 3JAN13 RNA-Guided Human Genome Engineering via Cas9 [13]Jinek and Doudna 29JAN13 RNA-programmed genome editing in human cells [14]Cho and Kim 29JAN13 Targeted genome engineering in human cells with the Cas9 RNA-guided endonuclease. [15]Which is where things get really complicated. Due to their experience with IP and tech transfer, Zhang was able to get the earliest and broadest patent on the CRISPR/Cas9 technology and has been able to develop the streamlined system and software that most users of the CRISPR/Cas9 technology generally use. Doudna has her own set of patents but her claims have been hampered by the existence of Zhang's patents. Not to be outdone by each other, each group have also elucidated the crystal structures: Jinek and Doudna: 6Feb14 2.6 and 2.2 angstrom structures [16]Nureki and Zhang 13Feb14 2.5 angstrom structures [17]Anders and Jinek: 27July14 2.6 angstrom structures. [18]I would strongly suggest looking at this article from Quanta Magazine which seems to have done the most research on the topic. Breakthrough DNA Editor Borne of Bacteria | Quanta Magazine. HHMI's article from 2011 is also a good read When Worlds Collide. In conclusion CRISPR is a brand new field of biology that has multiple key discoverers. Yoshizumi Ishino is credited for originally finding the CRISPR gene.Ruud Jansen is the one who came up with the name.Eugene Koonin is the one who proposed the purpose.Rodolphe Barrangou is the one who proved the role of CRISPR.Emmanuelle Charpentier is credited with identifying the importance of Cas9 and the tracrRNA.Jennifer Doudna is credited with doing the biochemistry to determine the mechanism and to create the CRISPR/Cas9 system.Feng Zhang is credited with the humanization and commercialization of the technique.[1] Nucleotide sequence of the iap gene, responsible for alkaline phosphatase isozyme conversion in Escherichia coli, and identification of the gene pr... - PubMed - NCBI[2] Biological significance of a family of regularly spaced repeats in the genomes of Archaea, Bacteria and mitochondria[3] Identification of genes that are associated with DNA repeats in prokaryotes[4] A putative RNA-interference-based immune system in prokaryotes: computational analysis of the predicted enzymatic machinery, functional analogies with eukaryotic RNAi, and hypothetical mechanisms of action[5] CRISPR Provides Acquired Resistance Against Viruses in Prokaryotes[6] Structural basis for CRISPR RNA-guided DNA recognition by Cascade.[7] Structural basis for DNase activity of a conserved protein implicated in CRISPR-mediated genome defense.[8] Sequence- and structure-specific RNA processing by a CRISPR endonuclease.[9] CRISPR RNA maturation by trans-encoded small RNA and host factor RNase III.[10] A programmable dual-RNA-guided DNA endonuclease in adaptive bacterial immunity.[11] Programmable DNA Scissors Found for Bacterial Immune System | Berkeley Lab[12] Multiplex Genome Engineering Using CRISPR/Cas Systems[13] RNA-Guided Human Genome Engineering via Cas9[14] RNA-programmed genome editing in human cells[15] Targeted genome engineering in human cells with the Cas9 RNA-guided endonuclease.[16] Structures of Cas9 endonucleases reveal RNA-mediated conformational activation.[17] Crystal structure of Cas9 in complex with guide RNA and target DNA.[18] Structural basis of PAM-dependent target DNA recognition by the Cas9 endonuclease. ",
            "date": "Updated December 1, 2018",
            "views": "535",
            "upvotes": " View 277 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John D. Gagnon",
                    "user_href": "/profile/John-D-Gagnon"
                },
                {
                    "user_id": "Drew Hammond",
                    "user_href": "/profile/Drew-Hammond-4"
                },
                {
                    "user_id": "Justin Smith",
                    "user_href": "/profile/Justin-Smith-18"
                },
                {
                    "user_id": "Giselle Gomes",
                    "user_href": "/profile/Giselle-Gomes-2"
                },
                {
                    "user_id": "Aditya Basrur",
                    "user_href": "/profile/Aditya-Basrur"
                },
                {
                    "user_id": "Pooja Yadav",
                    "user_href": "/profile/Pooja-Yadav-157"
                },
                {
                    "user_id": "Milind Athawale",
                    "user_href": "/profile/Milind-Athawale"
                },
                {
                    "user_id": "Abd Adebowale",
                    "user_href": "/profile/Abd-Adebowale"
                },
                {
                    "user_id": "Nondo Kayula",
                    "user_href": "/profile/Nondo-Kayula"
                },
                {
                    "user_id": "Smindler Mindler",
                    "user_href": "/profile/Smindler-Mindler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Reilly",
                "href": "/profile/Patrick-Reilly"
            },
            "answer_text": "CRISPRs (the actual repeat regions) were known prior to Jennifer Doudna and Emmanuelle Charpentier's work, but Doudna and Charpentier figured out the mechanisms behind the Type II CRISPR/Cas9 system, and got it working in human cell lines (iirc). Feng Zhang, George Church, and J. Keith Joung (among others) have been major leaders in pushing CRISPR/Cas9 genome editing into many different organisms, and making it easily accessible to researchers (e.g. the Zhang lab submitted MANY plasmids for CRISPR/Cas9 to AddGene and developed the Cas9 effector methods, George Church pushed CRISPR/Cas9 into yeast, zebrafish, etc.). ",
            "date": "Answered December 5, 2015",
            "views": "78",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahesh Jethalia",
                    "user_href": "/profile/महेश-जेथलिया-Mahesh-Jethalia"
                },
                {
                    "user_id": "Jaime Fuhrman",
                    "user_href": "/profile/Jaime-Fuhrman"
                },
                {
                    "user_id": "Luis Arredondo",
                    "user_href": "/profile/Luis-Arredondo-3"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                }
            ]
        }
    ]
}