{
    "title": "Who inspired Bill Gates? - Quora",
    "tags": [
        "Bill Gates",
        "Billionaires",
        "Inspiration"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sisir Kshetrimayum",
                "href": "/profile/Sisir-Kshetrimayum"
            },
            "answer_text": "Bill gates is a programmer and age 11 he started programming,luckily born in an educated well family his inspiration to be in computer science comes from the 1969 Nasa 's mission on moon to me. I don't know and not sure ,nor qualified to answer his inspiration but somewhere I read that the use of computer of moon's mission was one of the main factor for to become a computer nerd . So his family schooled bill gates in a school with a computer which is a rare thing during those days. There he met Paul Allen ,a senior in school who have same interests on computer. There were times they parted during childhood days ,Paul being a senior in school was the problem but there interest brings them together. Age 20 ,bill and Paul started Microsoft against the will of the family. As bill family wanted to continue his university career at Harvard. There parents even threatened bill gates if he stop getting in Harvard university,the money they save for him will be donated to charity but bill gates doesn't care ,from earlier days bill gates wants a programming not to be used by everyone cos it should be patented .Her mother being a close friend of IBM executive bill had an advantage from IBM for his OS system and the rest is history. Bill now the richest man,a philanthropist who donated billions of dollars on bill and Melinda foundation ,pledge a half inspired Melinda by a book written by Swedish about donating by selling there big house and settled on a new house which is half the costs of the sale ,other half goes into charity for African tribes , the main point is if you are not rich you don't have to donate like them but all of us have atleast some which we can donate like some buys more shirts,shocks,shoes etc etc you can donate it too to make a better world. Warren buffet a friend of bill gates for 25 years will also donate 99% of his wealth after his death to bill and Melinda foundation, So far it is estimated about 50 million people's lives have been save by foundation.Bill gates ,becomes the richest man not from Microsoft only about 1 third of his wealth comes from Microsoft others is managed by Charlie munger, Vice chairman of Berkshire Hathaway a friend of warren buffet. He managed bill's wealth and that's how he becomes the richest man on earth. According to a warren buffet,bill gates is going to donate 1 billion dollars every year and he also said bill read 25 books in a month which he said it ll be tougher for him ,warren who spent 80% of his time reading and Richard munger too . What's common to them is they can't get enough of reading ,sadly 99% of our world won't agree that :) ",
            "date": "Answered October 8, 2017",
            "views": "47",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "TongSui Bowl",
                    "user_href": "/profile/TongSui-Bowl"
                },
                {
                    "user_id": "Vivek Patel",
                    "user_href": "/profile/Vivek-Patel-234"
                },
                {
                    "user_id": "Suraj Rane",
                    "user_href": "/profile/Suraj-Rane-8"
                },
                {
                    "user_id": "Narendra Vaghela",
                    "user_href": "/profile/Narendra-Vaghela-4"
                },
                {
                    "user_id": "Samuel Rowe",
                    "user_href": "/profile/Samuel-Rowe-9"
                },
                {
                    "user_id": "Dilisha Jain",
                    "user_href": "/profile/Dilisha-Jain"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tinka Singh",
                "href": "/profile/Tinka-Singh-2"
            },
            "answer_text": "Dr. Henry Edward Roberts, a developer of an early personal computer, inspired Bill Gates to found Microsoft. Roberts, whose build-it-yourself kit concentrated thousands of dollars worth of computer capability in an affordable package, inspired Bill Gates and his childhood friend Paul Allen to come up with Microsoft in 1975 after they saw an article about the MITS Altair 8800 in Popular Electronics. He (Roberts) was an ex-military man, later went on to careers as a farmer and a physician, but continued to keep up with computer advances. Source : The Telegraph ",
            "date": "Answered October 6, 2017",
            "views": "15",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saurabh Sharma",
                    "user_href": "/profile/Saurabh-Sharma-2005"
                },
                {
                    "user_id": "Ankit Jain",
                    "user_href": "/profile/Ankit-Jain-2215"
                },
                {
                    "user_id": "M Sudheera Varma",
                    "user_href": "/profile/M-Sudheera-Varma"
                },
                {
                    "user_id": "Mithun",
                    "user_href": "/profile/Mithun-113"
                },
                {
                    "user_id": "Narain",
                    "user_href": "/profile/Narain-3"
                },
                {
                    "user_id": "Himesh Sarkar",
                    "user_href": "/profile/Himesh-Sarkar"
                },
                {
                    "user_id": "Samuel Rowe",
                    "user_href": "/profile/Samuel-Rowe-9"
                }
            ]
        }
    ]
}