{
    "title": "Who is in charge of the Internet? - Quora",
    "tags": [
        "Internet Governance"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kalam Ray",
                "href": "/profile/Kalam-Ray"
            },
            "answer_text": "If you asked a ton of people “Which country controls the internet?”, what would the answer be? Most people, I am guessing, would first balk at the question but then probably say United States. 🇺🇸!🇺🇸!🇺🇸! There’s a bunch of reasons to think that way. On the surface, most companies that people associate with “Internet” are concentrated to a tiny, earthquake-prone region in the US. It’s not that Tim Cook is dying to do Trump’s bidding, but there’s some truth to the idea that if Uncle Sam really flexed his muscles, say by sending some people with guns over to Silicon Valley, he could get all those folks to cooperate. My co-host Ranjan thinks this is a bit extreme, but then, I am Turkish and he’s not. But there’s also some technical realities too. For example, ICANN, the non-profit that controls the DNS scheme is based in California. To gloss over a ton of technical details, that gives ICANN the ability to own the relationship between human-readable addresses (like typing in your browser) and the IP addresses, that refer to the servers. Now, ICANN has a tumultuous relationship, to say the least, with the US government and every few years, there are calls to make ICANN’s authority be moved to an international body. To this day, though, the organization remains in sunny Southern California, only occasionally being thrusted to headlines when it tries to raise some revenues by introducing questionable Top-Level Domains, like .amazon. “I come from Cyberspace” Yet, there’s also the globally shared sensation that internet is somewhat above the regular, day-to-day, international drama. It’s all digital, global, connected, and you know, good. It was designed to be supranational, in some sense, rather than international. It rises above those pesky, arbitrary notions of land borders, regional disputes, sectarian differences. Internet is just there, encompassing us all, like the air we breathe. Not my words! Take it from John Perry Barlow. The iconic figure once penned a fiery manifesto at a World Economic Forum, after being struck by the arrogance and the dismissal of the world leaders of the incoming cyber revolution. He even called it, provocatively ",
            "date": "Answered October 29, 2019",
            "views": "43",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sulaiman Alhasawi",
                    "user_href": "/profile/Sulaiman-Alhasawi"
                },
                {
                    "user_id": "Raju SS",
                    "user_href": "/profile/Raju-SS-9"
                },
                {
                    "user_id": "Navroop Sandhu",
                    "user_href": "/profile/Navroop-Sandhu-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "Well… nobody, and lots of people. Let me explain. “The Internet” is not a single network. Rather, it is a term used to describe the set of networks that can communicate with each other using the Internet Protocol suite. That suite of protocols started out being developed by the Advanced Research Projects Administration of the US government, and the first network to move to using IP was their network, the ARPAnet. Other networks followed suit, including the National Science Foundation Network (NSFnet), and commercial networks started to either convert to IP networking, or to create IP “gateways”, which allowed users on their networks to communicate with people on other networks via IP. Since the research was done by the US government, and the US government does not claim copyright in its works, the IP suite was free for anyone to use, without having to pay any sort of royalties or needing a license. It was therefore quickly adopted into Unix, which was popular in academic and research environments. That led to new protocols being developed which sat atop the existing IP suite, such as HTTP, the protocol that the World Wide Web uses. Email and the Web were the early “killer applications” of networking — especially the latter. Microsoft chose to add an IP “stack” to Windows, then created their own web server, IIS, and suddenly, pretty much every company had the necessary tools to get on the Internet and create a web site — all they had to do was get a connection from an Internet provider. By this point, ARPA was no longer keeping up the IP suite. Instead, they had spun off an independent body, the Internet Engineering Task Force. In 1991, the IETF was moved from the US government to a newly-founded international organization, the Internet Society. Today, the Internet Society is the group “in charge of” the Internet standards: they maintain standards, review proposals for new standards, publish standards. A separate body, the Internet Corporation for Assigned Names and Numbers (ICANN) is in charge of administering the global Domain Name Service and assigning IP address blocks. It has parceled out these functions to regional registries, including RIPE in Europe, APNIC for Asia and the Pacific, and ARIN for North and South America. Until 2016, ICANN was under contract to the US Department of Commerce to provide these services, but in 2016, they were freed of US government oversight, and are now an independent body. So… the IS maintains the standards for the protocols, ICANN assigns IP addresses and oversees the main DNS servers. However, since the Internet was designed to be a distributed network that could survive partitions, the actual “grunt work” is distributed across many, many different organizations, some for-profit and some non-profit. Each is responsible for part of the Internet, but no single body is in charge of all of the Internet. ",
            "date": "Answered March 26, 2019",
            "views": "665",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kebe Eyong",
                    "user_href": "/profile/Kebe-Eyong-1"
                },
                {
                    "user_id": "Gauthier Michel",
                    "user_href": "/profile/Gauthier-Michel-2"
                }
            ]
        }
    ]
}