{
    "title": "Who would assist Taiwan if China invaded? - Quora",
    "tags": [
        "Cross-Strait Relations (Mainland China and Taiwan)",
        "Taiwan",
        "China",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zhang Zongyun",
                "href": "/profile/Zhang-Zongyun"
            },
            "answer_text": "No one. In order for your hypothetical situation to become real life, it has to somehow bypass these terms: 1. China will never invade Taiwan. Yes, I repeat, never. Now this may seem very odd to some of you foreigners, or even to other Chinese readers. There are two reasons: a. Taiwan already is China. No, don't downvote this just yet, ignorant reader, please follow my point; Taiwan is considered part of the nation of China. That would be the equivalent of saying, “The US should send troops to invade Alaska.” You just won't do that. Alaska is part of America. Well, you might say there is a difference. That is true. In terms of Alaska, it only belongs to the US in legal terms, as America purchased Alaska from Russia 150 years ago. However, Alaskans share no cultural or traditional similarity from the rest of America. North Athabaskans, Alaskan indigenous peoples, are completely different races from caucasian/black Americans. Same goes to Hawaii. In Taiwan’s case, it is not only legally part of China, Taiwanese people are also culturally the same from the mainland. The KMT inhabited/ invaded the island 70 years ago. They speak the same language, share the same culture, etc. There are considered Chinese. Why would mainland China want to invade the same people that belongs to the same nation? b. Taiwan is not considered a country. It was kicked out of UN in 1971. With PRC being one of the permanent five members of the UN(all five must come to unanimous agreement to accept a new UN member), it most likely will never be back in the UN. Currently, it is an autonomous region of the PRC, meaning it is a province that self governs itself, but it still belongs to China. A bit like US’s organized unincorporated territory. 2. Taiwan at its current state is economically perfect for China. Since it is self governing, that means China does not have to serve its duty of providing materialistic/human aid to Taiwan when it needs help, or even in daily life. Imagine an irresponsible dad that has 35 children(34 province-level administrative units plus Taiwan), and he is in financial debt. Suddenly, one of his sons says, “Dad, I think I am mature enough to take care of myself now. I don’t want you to take care of me anymore. I can live independently by myself.” With the money-hungry dad that has to spend billions per year on every child, what do you think he would reply with? “Nah, I know I’m broke, but I still want to waste billions on you a year despite you can live on your own?” That is absurd. Of course the dad would let his son go. Here’s the catch though. The son did not just stop there. He continued with “Dad, thanks for letting me go. Now I will go to Uncle America’s house and be his son, and talk trash about how I lived my horrible life with you. His 50 sons look so much more interesting and rich in comparison to my siblings. Bye!” At this point, do you still think the dad would agree to let the child go free? Not completely free. The dad’s optimal solution would be to keep the son under his name, but let him enjoy his life and earn his own money to live. 3. Invading Taiwan brings no benefit to China. Not political, diplomatic (definitely not), economic, nor advantageous. Let’s just assume China did it so mainland can get the drug-like high feeling of “Ha! These Taiwanese people are inferior and have bent their knees down to us!” Still, that will not happen. If this was a true scenario, this would only create more hatred between mainland China and Taiwanese China. How did every large military-conquered empire fail? They held the territory, but they couldn’t hold the people. If China decided to invade Taiwan, it would only make the Taiwanese Independentists more radical, and more patriotic. If every last soldier of Taiwan died, the people would still not surrender deep down inside, despite the legality part of the situation. Alright, at this point let’s just assume China invaded Taiwan, despite the points above. Who will aid Taiwan? Still nobody. A few answers below mentioned America. Really, my fellow Quorans. Really. You think America would risk war with China just because China was housekeeping its own province? America isn’t Jesus. He isn’t a Buddha. All nations are selfish. I don’t need that propaganda talk about “Justice and Liberty to the World!” That doesn’t exist in real life. America knows its pros and cons to everything it does, and risking total warfare with the second most powerful nation in the world is not something on America’s to-do list any time soon. Please don’t bring me back to the pointless hypothetical scenarios of “America vs China military comparison” articles. That just won’t happen in real life. ",
            "date": "Answered October 14, 2017",
            "views": "28",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "XiaopIng Gong",
                    "user_href": "/profile/XiaopIng-Gong"
                },
                {
                    "user_id": "Tony Kwok",
                    "user_href": "/profile/Tony-Kwok-8"
                },
                {
                    "user_id": "Graham Haxell",
                    "user_href": "/profile/Graham-Haxell"
                },
                {
                    "user_id": "Charles Chan",
                    "user_href": "/profile/Charles-Chan-74"
                },
                {
                    "user_id": "Andrew Hantke",
                    "user_href": "/profile/Andrew-Hantke-2"
                },
                {
                    "user_id": "Franklin Lukas",
                    "user_href": "/profile/Franklin-Lukas"
                },
                {
                    "user_id": "Lingjie Yi",
                    "user_href": "/profile/Lingjie-Yi"
                },
                {
                    "user_id": "Tommy Chan",
                    "user_href": "/profile/Tommy-Chan-73"
                },
                {
                    "user_id": "Alex Ronny",
                    "user_href": "/profile/Alex-Ronny-1"
                },
                {
                    "user_id": "Joe Li",
                    "user_href": "/profile/Joe-Li-135"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Castle",
                "href": "/profile/Chris-Castle-58"
            },
            "answer_text": "The US is still obligated to assist Taiwan under the Taiwan relations act. It’s only obligated to assist if Taiwan does not change the status quo. Taiwan would not risk to declare formal independence unless there was significant political instability in China. Taiwan is also strategically significant for the US. It is part of the “first island chain” that forms a perimeter around China. This is part of Washington’s policy of containment. There are many hawks in Washington who would like to see a limited engagement with the People’s Liberation army, as well as some industry and labor advocates who would like to see less cheap imports from China coming into the US and flooding the market. Taiwan is also important to the global consumer electronics supply chain. For this reason, it’s extremely unlikely any war would break out between China and Taiwan. Apple, the world’s richest company, contracts a Taiwanese company to produce its products in China. You also have to consider other countries. Japan is still very anti-China, a close US ally, and Taiwan was once a Japanese colony. The current administration in Japan is currently trying to revise the constitution to allow its military to come to the assistance of allies whom are attacked. The EU would probably be split on the matter, with some taking issue that a large authoritarian country invaded a small democratic one, while others who sell arms to China (like Germany) would be more interested in maintaining the global economic system. South Korea would probably protest, but it wouldn’t want to risk China’s old ally North Korea invading by joining a war in Taiwan. Again, as others have stated, war is extremely unlikely in the Taiwan straight as global manufacturing supply lines are so tightly integrated, conflict in the region would destabilize the global economy. Right now, China’s strategy is to isolate Taiwan internationally and apply increasing economic pressure, so the domestic Taiwanese population will become increasingly displeased with the current administration and elect a more China-friendly one. Taiwan’s strategy is to reduce its economic reliance on China by increasing trade with other countries, and improving its international image as a modern, friendly, democratic country. This will prove to be difficult as most large Taiwanese companies base their manufacturing operations in China, and the general populations of most countries (especially the US) do not care about politics in small countries. ",
            "date": "Answered January 31, 2018",
            "views": "22",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Graham Haxell",
                    "user_href": "/profile/Graham-Haxell"
                },
                {
                    "user_id": "Rocky Bindhamer",
                    "user_href": "/profile/Rocky-Bindhamer"
                },
                {
                    "user_id": "Mimi Chan",
                    "user_href": "/profile/Mimi-Chan-52"
                },
                {
                    "user_id": "George Moore",
                    "user_href": "/profile/George-Moore-101"
                },
                {
                    "user_id": "Michael Jow",
                    "user_href": "/profile/Michael-Jow"
                },
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                },
                {
                    "user_id": "Philip Wang",
                    "user_href": "/profile/Philip-Wang-50"
                },
                {
                    "user_id": "Michael Buckley",
                    "user_href": "/profile/Michael-Buckley-76"
                },
                {
                    "user_id": "Jag Dhanoa",
                    "user_href": "/profile/Jag-Dhanoa"
                },
                {
                    "user_id": "Jerry Su",
                    "user_href": "/profile/Jerry-Su-17"
                }
            ]
        }
    ]
}