{
    "title": "Who agrees that the Tesla Cybertruck is the first ugly Tesla? - Quora",
    "tags": [
        "Auto Design",
        "Tesla Cybertruck",
        "Battery Electric Vehicles (BEV)",
        "Electric Vehicles",
        "Electric Cars",
        "Tesla (company)",
        "Automotive Industry",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lance Pickup",
                "href": "/profile/Lance-Pickup"
            },
            "answer_text": "I’m not a fan of the Cybertruck styling, but I’m not a fan of ANY pickup truck or SUV styling (maybe it has something to do with my name :) I prefer small vehicles with smooth lines, not highly angular, boxy vehicles. But here’s the interesting thing. When I was growing up in the late 70’s and 80’s and starting to pay more attention to cars, all the cars were boxy!    I remember seeing the first cars in the 80’s with rounded edges and sloped back roofs and thought how strange and ugly they looked. And now I drive one!  I can’t say for sure what I would have thought (in the 80’s) that the Model 3 was off-putting, but now I think it is beautiful! I also can’t say for sure whether the look of the Tesla Cybertruck will ever grow on me (or at least others who don’t think ALL trucks look ugly), but I will say this: Pickup trucks and large SUVs, the way they are shaped today, are horribly aerodynamically inefficient. Truck owners basically will have 4 choices going forward: Continue to use gas & diesel to fuel their transportation in their traditional vehicles, although this option will continue to get more and more expensive as others opt for more efficient means of transportation and volumes of internal combustion vehicles declinePut up with relatively short ranges in their electric trucks (100–150 miles). This will probably be a reasonable option for many who only need their trucks to get them around town.Pay exorbitant prices for traditionally shaped, but long range electric trucks.Submit to the idea that a more aerodynamic shape is needed (not necessarily saying Cybertruck shaped) for decent cost & functionality (range) of their trucks and acknowledge that as long as it can get the job done, that an nontraditional looking truck might be the better solution.Given how cost conscious and wrapped up with “range” most people are, I think the number of people opting for #1–3 are going to decline in the future. ",
            "date": "Answered November 23, 2019",
            "views": "23",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edgar Allen",
                    "user_href": "/profile/Edgar-Allen-1"
                },
                {
                    "user_id": "Titi Celina",
                    "user_href": "/profile/Titi-Celina"
                },
                {
                    "user_id": "Alex Melnik",
                    "user_href": "/profile/Alex-Melnik-17"
                },
                {
                    "user_id": "Muja Harahap",
                    "user_href": "/profile/Muja-Harahap"
                },
                {
                    "user_id": "Sayan Roy",
                    "user_href": "/profile/Sayan-Roy-42"
                },
                {
                    "user_id": "Alex Tang",
                    "user_href": "/profile/Alex-Tang-194"
                },
                {
                    "user_id": "Sakshi Shingote",
                    "user_href": "/profile/Sakshi-Shingote-1"
                },
                {
                    "user_id": "Navin Niish",
                    "user_href": "/profile/Navin-Niish"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ali",
                "href": "/profile/Ali-2220"
            },
            "answer_text": "It is perhaps. But the most important part of it is that everyone will talk about it, think about it and know about it because it is different. It's gonna be like a classic in the future. Like wolksvagen beetle (was it the name?) I don't know about cars much but I damn know about that cute little thing because it has never been seen before in that time so it became that famous. Doesn't matter if it looks good or bad to you to me to anyone. It is some classic and you know it. So my point is even if that truck is a bad looking science fiction thing it's still unique and everyone will know it wheter they are interested in cars or not. if someone wanted me to draw a picture of it well I'm terrible at painting thought but still I could probably draw that triangular truck. Just imagine that :) (it was something out of topic sry but really wanted to say it) ",
            "date": "Answered November 24, 2019",
            "views": "583",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Alex-10201"
                }
            ]
        }
    ]
}