{
    "title": "Why are iPhones so costly in India? - Quora",
    "tags": [
        "Costs in India",
        "iPhones (product)",
        "Costs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shubham Kumar Shaw",
                "href": "/profile/Shubham-Kumar-Shaw-3"
            },
            "answer_text": "Iphone is not only costly in india it is costly every where…as apple spend alot on research and development. As in india the taxes i. e. GST and all make it more costly if compared to some countries.. I n India, iPhone 8 will cost Rs 64,000 for the 64GB storage variant and Rs 77,000 for 256GB storage. The iPhone 8 Plus on the other hand will cost Rs 73,000 for 64GB storage and Rs 86,000 for 256GB. Both iPhone 8 and iPhone 8 Plus will be offered in two storage options; 64GB and 256GB. Apple is also asking a lot of money to get the iPhone X, which starts at Rs 89,000 for the base version and goes up to Rs 102,000 for the top-end model. There are reasons why it is costly every where because it worths that much. The x reasons r explained below 1. Better Hardware and Software Integration The iPhone 8 and X introduce a new feature that Huawei S Mate already had before 6S. The 3D Touch displaywhich is much bigger than we can imagine and also smart enough to sense pressure, allowing you to take quick actions from the home screen just by long pressing on an app icon. Or you could peek at that email just by lightly tapping on it in your inbox. Sure, Android phones have offered haptic feedback for ages, but the Taptic engine in the new iPhones promises to be super efficient. Only Apple ties hardware and software together like this. 2. Great Cameras Dual OIS cameras With the latest iPhone X, Apple added the dual optical image stabilization (OIS) in its rear cameras. However, Samsung Galaxy Note 8 too has optical image stabilization (OIS) on both its rear cameras. Technically, Samsung beat Apple by rolling out the feature first in the market. For a consumer, it’s definitely a good news as the inclusion of OIS on both rear cameras should result in more stable and sharper shots, videos. The iPhone consistently produces pleasing photos with accurate color - generation after generation. And the iPhoneX and 8 Plus up the ante with a sharper 12-MP dual camara setup with 4K video capture. 3. Unlocking phone using face. The iPhone X arrived with something called ‘Face ID’, Apple’s new biometric unlocking mechanism. Face ID is seen as a replacement of Touch ID, as it claims to be more secure and accurate to unlock the phone. I’m ready to buy Apple’s claims, despite the company’s failure to demonstrate the function properly during the iPhone X presentation earlier this week. 4. OS Updates When You Want Them This is going to hurt a little, Android fanbois. As of June 1, Android Lollipop (the latest version of Google's software) was installed on a whopping 12 percent of devices. So just a little over 1 in 10 droid owners are taking advantage of features like the slicker Material design and Priority mode for letting only the most important notifications get through. Contrast that with the 83 percent of iPhones running the latest iOS 8 software as of early June. The problem is this: with the exception of pure Android phones like the Nexus, the Samsungs, LGs and HTCs of the world have to jump through more hoops to bring you the latest version of Google's OS, including carrier certification. Plus, phone makers typically drag their feet on updating older phones, so as to encourage folks to upgrade. All iPhone owners can update to the latest version of iOS on day 1 (or close to, depending on Apple's servers). This dynamic isn't going to change anytime soon. 5. The Best Apps First Now that both iOS and Android have well over 1 million apps in their stores, the arms race is over, right? Not really. The iPhone is still favored by developers as the launch platform of choice for the hottest new apps. The Google Play store is like the Netflix of app stores; it gets the hits, but usually after they see their first run on iOS. For instance, it took two years for Instagram to debut on Android after it launched for the iPhone. Other apps have taken only months to jump for iOS to Android, such as the Meerkat and Periscope video streaming apps and the highly rated Vainglory game. But the message is clear. If you don't want to be treated like a second-class app citizen, the iPhone is still the king. 6. No Bloatware! It's not a good sign for prospective Android phone buyers that some of the most popular articles we do are bloatware-removal guides. Samsung and others have gotten better at minimizing the pain for users by lumping all carrier bloatware into a single folder, but it's still just crap taking up space on your phone. You won't find a single piece of carrier software pre-loaded on an iPhone, making for a clean out-of-box experience. Now, Apple does include some apps you might not want or need, like Apple Watch, but it has much more restraint than other manufacturers when it comes to bundling its own stuff. 7. Works beautifully with Macs If you haven't tried a Mac in a while, you might be surprised to know just how well iPhones work with them. For instance, with the Continuity feature in OS X, you can use your MacBook to send and receive text messages and even receive and place calls. All you have to do is keep your iPhone nearby. I find the Handoff feature a little less useful, but some may like that they can do things such as start an email on their Mac and then pick up where they left off on their iPhone - or vice versa. Thanks to iCloud keeping everything in sync, you'll also have easy access to the photos you take on your iPhone from your Mac, as well as any notes or documents you create. 8. Apple Pay Between the upcoming Android Pay and Samsung Pay services, Apple has plenty of rivals, but right now Apple Pay is most prevalent method for making mobile payments. It’s also dead-simple to use. All you have to do to use Apple Pay is bring your iPhone close to the supported payment terminal at the checkout counter, then press your finger on your phone's Touch ID sensor. Apple Pay is getting better with iOS 9, too, which will add reward cards from the likes of Dunkin' Donuts, Panera and Walgreens. Store-issued credit card support is coming, too, with BJ’s Wholesale Club, Kohl’s and JCPenney on board so far. All of the above will be stored in the new Apple Wallet app. X. Best Support and Help When you have a problem with your Android phone, you can try online forums or calling your carrier. But with the iPhone, you can tap into a vast database of useful help articles on Apple's website, get help via live chat, or you can schedule an appointment at an Apple Store Genius Bar. Google doesn't have this kind of direct relationship with its customers. With Android, you're on your own Yes it is absolutely worth buying I don't u noticed it or not after 8 there is directly X as apple has also done…. So thank you for the great attention for reading this too long answer… And don't forget to upvote if it is helpful….. ",
            "date": "Answered September 18, 2017",
            "views": "38",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonty Rodes",
                    "user_href": "/profile/Jonty-Rodes-9"
                },
                {
                    "user_id": "Shivraj Mahadevan",
                    "user_href": "/profile/Shivraj-Mahadevan"
                },
                {
                    "user_id": "Lalmonlen Singson",
                    "user_href": "/profile/Lalmonlen-Singson"
                },
                {
                    "user_id": "Krishnandu Dey",
                    "user_href": "/profile/Krishnandu-Dey"
                },
                {
                    "user_id": "Sarada Maheswari Sahoo",
                    "user_href": "/profile/Sarada-Maheswari-Sahoo"
                },
                {
                    "user_id": "Nilanjan Gharami",
                    "user_href": "/profile/Nilanjan-Gharami"
                },
                {
                    "user_id": "Shrinath Shelke",
                    "user_href": "/profile/Shrinath-Shelke"
                },
                {
                    "user_id": "Aashish Kumar Sharma",
                    "user_href": "/profile/Aashish-Kumar-Sharma-2"
                },
                {
                    "user_id": "Arkajyoti Pal",
                    "user_href": "/profile/Arkajyoti-Pal-1"
                },
                {
                    "user_id": "Insha Kausar",
                    "user_href": "/profile/Insha-Kausar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashutosh Singh Chandel",
                "href": "/profile/Ashutosh-Singh-Chandel"
            },
            "answer_text": "As most of us already know that I Phone X is not manufactured in India. Though apple went for putting a subcontracted Manufacturing facility in Peenya, Bangalore, the facility was currently churning out old generation I Phones. Prior to GST, there was 10% Counter Veiling Duty(CVD) on on Mobile Phone Imports, while those Manufactured in India attracted only 2% Excise duty. When CVD got subsumed in to GST, and GST for Mobile Handsets was kept at 12%; government decide to put 10% Basic Customs Duty on Import of Mobile Handsets. Government imposes 10% customs duty on imported mobile phones So essentially a total of 23.2% tax is paid on any mobile handset sold in India, which is not manufactured in India. And this same tax rate applicable for even the most basic handset retailing at <1000 Rs. (15 USD). USD 999 Price quoted for I Phone X 64 GB in USA is exc. Taxes. Taxes alone take the price of I Phone X in India to 1230 USD or Rs. 80K. Now coming to the other overheads such as Manpower, Distribution and Marketing. Marketing costs for I Phone in India, through Small on absolute basis get allocated to a few thousand devices sold every month (Supply constraints, as well as demand of premium devices being low), compared to tens of Millions of units sold in developed economies in a month. Additionally if Apple has to earn some profits in India, they have to come from latest flagship as they don’t earn much profits from last generations sold at huge discounts. Considering all these factors apple is just putting 10% premium (US Price + Taxes = 80K, + 10% Premium), which is not quite huge. The bottom line remains the I Phone X is the most expensive Apple device ever made, while apple may not keep much of that price to itself (Margins) as all the bells and whistles put in the device took the component costs to a completely different level. The $1,000 iPhone X could have been even more expensive ",
            "date": "Answered November 5, 2017",
            "views": "6",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manas Acharekar",
                    "user_href": "/profile/Manas-Acharekar"
                },
                {
                    "user_id": "Atchutha Raman",
                    "user_href": "/profile/Atchutha-Raman"
                },
                {
                    "user_id": "Hemant Kumar Rawat",
                    "user_href": "/profile/Hemant-Kumar-Rawat"
                },
                {
                    "user_id": "Arunava Mondal",
                    "user_href": "/profile/Arunava-Mondal-1"
                },
                {
                    "user_id": "Manoj Dubey",
                    "user_href": "/profile/Manoj-Dubey"
                },
                {
                    "user_id": "Reena Venkataraman",
                    "user_href": "/profile/Reena-Venkataraman"
                },
                {
                    "user_id": "Arghya Chell",
                    "user_href": "/profile/Arghya-Chell"
                },
                {
                    "user_id": "Vaibhav Jain",
                    "user_href": "/profile/Vaibhav-Jain-297"
                },
                {
                    "user_id": "Raj Ranju",
                    "user_href": "/profile/Raj-Ranju"
                },
                {
                    "user_id": "Priya Narayan",
                    "user_href": "/profile/Priya-Narayan-16"
                }
            ]
        }
    ]
}