{
    "title": "Why is the ex-CEO Steve Jobs more popular than the genius behind Apple Tech? - Quora",
    "tags": [
        "Death of Steve Jobs (October 5, 2011)",
        "Steve Jobs",
        "Genius and Geniuses",
        "Chief Executive Officers",
        "Startup Founders and Entrepreneurs",
        "Apple (company)",
        "Fame and Mass Popularity",
        "Apple Products and Services",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Blache",
                "href": "/profile/David-Blache"
            },
            "answer_text": "You could say the same thing about any innovative company. The answer is that it is commonplace that the executive officers of most companies are generally more well known than the company’s individual contributors. Generally, inventions created by employees of a company are considered property of the company, and the CEO and other executive officers are the ones who typically publicize such innovations in their products to customers. So it’s only natural that CEOs are usually more popular. BTW, this question seems like an accidental admission that Apple is indeed a highly innovative company, contrary to the claims from Apple-hating trolls that Apple “doesn’t innovate”. Good work! 🙂👍🏼 ",
            "date": "Answered October 24, 2020",
            "views": "205",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roberto Santocho",
                    "user_href": "/profile/Roberto-Santocho"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Carswell",
                "href": "/profile/Matthew-Carswell"
            },
            "answer_text": "Is he? I think - the last tally I saw, there are about 700,000 iPhones sold, every, single, day. That’s around 500 iPhones every second. If Apple was a sovereign nation - their revenue would put them around 40th in the world on a list of countries by GDP. So Apple alone sells more goods and services than say… Finland, Egypt, Greece and New Zealand. Seems like Apple’s tech is pretty popular. Laying down $800 for an IPhone is a pretty solid endorsement and it’s happened around 20,000 times while you’ve been reading this answer. Jobs? Yeah he’s revered, sure. He was one of the all time great innovators - and sales people - all packed into one guy. But I don’t think anyone would care about him if Apple’s tech wasn’t the most popular thing on the planet. ",
            "date": "Answered October 23, 2020",
            "views": "291",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Blache",
                    "user_href": "/profile/David-Blache"
                }
            ]
        }
    ]
}