{
    "title": "Why are new iPhones becoming very costly in the Indian market? - Quora",
    "tags": [
        "Stock Markets in India",
        "The Economy of India",
        "Apple (company)",
        "iPhones (product)",
        "Costs",
        "Apple Products and Services",
        "Indian Ethnicity and People",
        "Technology",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ranvijay Raj",
                "href": "/profile/Ranvijay-Raj-1"
            },
            "answer_text": "Explained: Why iPhones Cost Lot More in India Indian customers have to pay almost 40 percent more for the iPhone 12 compared to US prices. Cyrus John Published: 19 Oct 2020, 7:37 PM IST Price difference between certain iPhone models can go up to Rs 50,000. | (Photo: The Quint)  Tech News Apple’s iPhones are one of the most sought-after smartphones in the market and they carry a hefty price tag. On top of that, you have to pay almost 40 percent extra for an iPhone in India compared to the US. But why ? The dollar to rupee conversion in the table is as per current dollar value in India.  No Local Manufacturing & Retail Apple does not have a local manufacturing unit in India. They gave contracts for assembly (not manufacturing) of its iPhone 7 and iPhone SE smartphones to Foxconn and Wistron. Since they are assembled here, these devices are relatively cheaper. Components and PCBAs (printed circuit board assemblies) for these phones are still imported. Most of iPhone flagships are imported, and drives the cost up. Also, as per the Indian Foreign Direct Investment policy, for a company to set up a manufacturing unit in the country, it has to source 30 percent of components locally, which is impossible for something like the iPhone. Also, Apple sells its smartphones and other products in India via its vast third-party retail network. Though it has recently introduced its official online store for India, even that it is dependent on third-party vendors for distribution. These vendors, distributors, transport agents and other middlemen take a hefty cut. Also read: iPhone 12, 12 Mini, 12 Pro and 12 Pro Max Models Launched With 5G Taxes & Custom Duty It was in April this year that Apple hiked the prices of its iPhone 11 series as the Indian government hiked the goods and services tax (GST) from 12 percent to 18 percent. This resulted in a hike of 5 percent in the prices of iPhones in India. The government also increased the net import duty in the last Budget by 2 percent by withdrawing the exemption on social welfare surcharge which was earlier available on basic customs duty on mobile phones. The government also increased the import duty on PCBA (printed circuit board assembly) from 10 percent to 20 percent and for chargers from 15 percent to 20 percent which is also carried forward on the retail price. All these taxes levied on the iPhone have to be borne by its customers. Also Read: Apple iPhone Prices Increase In India After Import Duty Hike Brand Value & Currency Apple today is a premium tech brand and owning an iPhone is a style statement. Apple does offer a unique ecosystem and security that few can breach, but for Indian buyers, even that seems not enough for what they pay. Apple also keeps considerable profit margins for its smartphones, which many industry experts have said to be somewhere around 500 percent! Currency depreciation is another major factor why the iPhone is expensive in India and relatively cheaper in countries like Japan and Dubai. Get this, the starting variant of the iPhone 12 retails at $699 in the US which translates to Rs 51,287 (current exchange rate). The retail price of the iPhone 12 in India is Rs 69,900 which is Rs 18,620 more than the US price. That’s almost 37 percent more! Despite the above caveats, people will keep buying and upgrading to Apple’s latest iPhone because it’s more than a smartphone; It’s a brand. ",
            "date": "Answered October 22, 2020",
            "views": "82",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Balasubramanian Ganesan",
                    "user_href": "/profile/Balasubramanian-Ganesan-14"
                },
                {
                    "user_id": "Manjunath Naik",
                    "user_href": "/profile/Manjunath-Naik-6"
                },
                {
                    "user_id": "Jatin Agrawal",
                    "user_href": "/profile/Jatin-Agrawal-54"
                },
                {
                    "user_id": "Sahil Chawla",
                    "user_href": "/profile/Sahil-Chawla-79"
                },
                {
                    "user_id": "Vedant Dev",
                    "user_href": "/profile/Vedant-Dev-2"
                },
                {
                    "user_id": "Bismay Behura",
                    "user_href": "/profile/Bismay-Behura"
                },
                {
                    "user_id": "Tillu Aggarwal",
                    "user_href": "/profile/Tillu-Aggarwal"
                },
                {
                    "user_id": "Suraj Kurande",
                    "user_href": "/profile/Suraj-Kurande"
                },
                {
                    "user_id": "Prathvi Raghuram",
                    "user_href": "/profile/Prathvi-Raghuram"
                },
                {
                    "user_id": "Prince Golakiya",
                    "user_href": "/profile/Prince-Golakiya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prateek Chaturvedi",
                "href": "/profile/Prateek-Chaturvedi-56"
            },
            "answer_text": "Iphones are costly in india because High tax rate:GST on phones were increased from 12 to 18% recently.No local manufacturing in india.Generally latest models of iphones are directy imported and not manufactured and assembled locally on india.Btw i bought iphone 11 recently and was happy to see that it is made in india.Import Custom Duties.Currency conversion factor. You can see almost 8000 on tax for iphone 11.  Edit Also apple knows its customer base.Who wants to buy iphone will not buy android at any cost.Apple has its own fan base and apple monetize that by iphone prices. I am also in favour that it is unfair to set prices too high in india as compared to other countries. Once foxconn set up its manufacturing unit in india we hope to see some price relief. ",
            "date": "Answered October 24, 2020",
            "views": "323",
            "upvotes": " View 86 Upvoters "
        }
    ]
}