{
    "title": "Why are Tesla cars so poorly constructed (panel gaps, leaky roof, uneven gaps between doors) and so unreliable for such high cost and supposedly less moving parts? - Quora",
    "tags": [
        "Tesla (company)",
        "Automotive Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "I googled the question and there is a lot of agreement with the OP’s contention. Tesla has serious build problems. One of the best ways to understand how great or awful a car is, is to tear it apart, piece by piece, and examine how it was designed and assembled. If you take apart a Tesla Model 3, as engineering experts Munro & Associates have done, you come away with an appreciation of why Tesla scares the pants off every other automaker. But you also understand why Silicon Valley's automotive newbie is struggling to produce cars profitably. Where Tesla excels is in the Model 3's skateboard-like, lithium-ion battery pack and related power electronics. \"We are shocked by the advanced integration and advanced manufacturing techniques\" used in the electronic control center, Chief Executive Sandy Munro told members of the Automotive Press Association on Wednesday. \"This is the brilliance of the Tesla Model 3.\" Yet Munro was dumbfounded by other aspects of the vehicle, particularly the mostly steel skeleton, known as a body-in-white, which was sloppily joined together using a potpourri of robotic welding techniques, helping to explain the Model 3's ill-fitting body panels. \"If the fixture is wrong, the fit-and-finish is bad,\" said Munro. Poor fit-and-finish -- like uneven gaps between panels or improper alignment of parts -- is not just unsightly. It's often the cause of annoying squeaks and rattles or more serious quality problems. The fact that Tesla can simultaneously demonstrate brilliance and incompetence in the same vehicle is not surprising, considering it is a high-tech software company trying to master complex manufacturing processes that took established automakers more than 100 years to perfect. Munro, whose Auburn Hills, Mich.-based consulting firm makes money selling its benchmarking studies to automakers, says his analysis is not complete so it's too early to draw any conclusions about how the Model 3 stacks up to other electric cars it has studied like the BMW i3 or Chevrolet Bolt EV. \"Everything that's below the floor pan is amazing. Everything above it is what it is,\" he said. But the \"dinosaur\" stuff, like basic manufacturing techniques, can be fixed with the proper resources and investment, he added. Munro purchased the Model 3 in early December for $72,000 from another buyer but he had no information about when the car was manufactured. The car was never driven prior to Munro taking possession in late January, but \"it was held back by Tesla for two extra weeks due to an undisclosed quality issue.\" The firm has since purchased a second Model 3, Munro said. \"It's better, but not much better.\" A Tesla spokesperson said the primary car evaluated by Munro was built in 2017, adding: \"We have significantly refined our production processes since then, and while there’s always room for improvement, our data already shows that Model 3 quality is rapidly getting better.” For example, Tesla said the standard deviation of Model 3 gaps has improved by nearly 40 percent, with especially visible improvements in the area of the trunk, rear lamps and rear quarter panel. \"Today, Model 3 panel gaps are competitive with Audi, BMW, and Mercedes models, but in the spirit of relentless improvement, we are working to make them even tighter.” Tesla Chief Executive Elon Musk boasts that the Model 3 was designed for easy assembly, using fewer parts, and Munro's team found several examples of this. The accelerator pedal, for example, snaps into its housing using a tab and slot, then locks in place with a single screw, where traditionally there would be at least three fasteners. The aluminum cross-car beam, which supports the dashboard, has plastic parts that are \"over-molded\" through injection molding rather than attached using traditional fasteners. There are other components that appear to the untrained eye to be jerry-rigged, leaving even Munro experts guessing about their purpose. A damper weight on a suspension control arm, for example, was secured using glue and industrial-strength zip ties. That said, the engineers said the Model 3 had \"phenomenal\" handling before they tore it apart, suggesting Tesla got the car's suspension just right. Most confounding to Munro and his team was the body construction of the Model 3. \"This car is the heaviest body-in-white I've ever seen,\" he said, calling the construction \"ridiculous\" and highlighting areas where Tesla needlessly added weight with things like excess metal flanges and overlapping layers of steel. \"This adds weight without value,\" he said. He was also puzzled by Tesla's unconventional use of multiple welding techniques in close proximity to one another. \"I don't get it,\" he said. \"There's a lot of technology [used] here, but what we don't understand is why they used the technology they did.\" Other signs of waste: the wheel wells are constructed of 9 different pieces of metal instead of one, as in most vehicles. And because they are symmetrically opposed to the wheel wells on the opposite side of the car, extra tooling is required, which drives up costs. A Tesla spokesperson acknowledged room for improvement on the car's mass and complexity but said the Model 3 was designed for safety, noting that electric cars have unique safety requirements to prevent intrusion into the battery. There's no doubt Tesla rivals will be poring over Munro's $87,000 benchmarking study of this early production vehicle when it is completed in a couple of months. But with Musk vowing to work his way out of production hell to finally achieve a steady production rate of 5,000 vehicles per week by the end of June, Munro would be wise to buy another car and start working on a sequel. Tesla's Simultaneous Brilliance And Incompetence Revealed In Teardown Of Model 3 Why is Tesla's Quality Control Still So Poor? Teardown Guru Finds Good, Bad in Tesla Model 3 Construction  A consumer speaks out ",
            "date": "Answered December 21, 2018",
            "views": "94",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lloyd Uto",
                    "user_href": "/profile/Lloyd-Uto"
                },
                {
                    "user_id": "John Zee",
                    "user_href": "/profile/John-Zee-33"
                },
                {
                    "user_id": "Jules Dingle",
                    "user_href": "/profile/Jules-Dingle"
                },
                {
                    "user_id": "Mushom Albert",
                    "user_href": "/profile/Mushom-Albert"
                },
                {
                    "user_id": "Zachary Abelardo",
                    "user_href": "/profile/Zachary-Abelardo"
                },
                {
                    "user_id": "Jim-Elaine Stack",
                    "user_href": "/profile/Jim-Elaine-Stack"
                },
                {
                    "user_id": "Kunal Lagwankar",
                    "user_href": "/profile/Kunal-Lagwankar"
                },
                {
                    "user_id": "Chaitany Goyal",
                    "user_href": "/profile/Chaitany-Goyal"
                },
                {
                    "user_id": "Jack Shepherd",
                    "user_href": "/profile/Jack-Shepherd-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Gutman",
                "href": "/profile/Bruce-Gutman-2"
            },
            "answer_text": "Firstly, these issues are exceptions and overblown by Oil funded media. They pick up or make up all these issues and they are paid to do it. Every car manufacturing plant needs to tune its processes to get the quality up, Tesla had too much pressure, high demand and less money to do it in short time. The Model S has no such issues now and Model 3 quality is getting consistent. I have done over 40,000 miles and other than Tire rotation never took the car to service station. My Corolla (which is a great car) had 5 services, 1 major at this mileage. The gasoline car as just more parts, subsystems to maintain and it is not going to change. Tesla owners have very high satisfaction rating, that being said media will cherry pick data from the few unfortunate folks and make it look like all Tesla’s are bad. At this point, no other car manufacturer has anything that competes Tesla for its technology, features, performance and Super Charger network. Few like Jaguar are coming up, but basically no competition for another year or two for sure. ",
            "date": "Answered December 27, 2018",
            "views": "414",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Colestock",
                    "user_href": "/profile/Dan-Colestock"
                },
                {
                    "user_id": "Krishna Mohan",
                    "user_href": "/profile/Krishna-Mohan-17"
                },
                {
                    "user_id": "Pat Murphy",
                    "user_href": "/profile/Pat-Murphy-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hugo Gunnarsen",
                "href": "/profile/Hugo-Gunnarsen"
            },
            "answer_text": "This is a good question. I would have assumed that Tesla hired a lot of engineers from other successful car companies that know how to do this, but it might be that they have taken a total different route here, inventing everything from scratch. It’s actually hard to do proper panel gaps (to allow some flexing without rubbing parts), joining parts together (welding, gluing, bolting, riveting) and do this all to ensure it all is quiet, last, looks good and are easy to fix. Most mfg goes through a lot of trials before they get it right (and there are still issues as they introduce new technologies), and since Tesla only have had one iteration its reasonable that they have lot of these issues (i.e. the first sets in Tesla S was horrible, they are still bad, but better now), they might have focused on what make them different (EV, computer, AI) and less on what’s similar (interior, quality, longevity) to get to market fast enough (before $ runs out). Give them 15+ years and they would/could be on par, assuming they are refining existing models instead of re-inventing new ones. ",
            "date": "Answered December 22, 2018",
            "views": "478",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jack Shepherd",
                    "user_href": "/profile/Jack-Shepherd-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Albertson",
                "href": "/profile/Christopher-Albertson-3"
            },
            "answer_text": "These questions are usually asked by some one who has never seen an actual Tesla car up close. Yes, if you look on-line you can see “dozens” of problem cars but the company built hundreds of thousands of cars and we don’t see 100,000 defective cars, more like one in twenty thousand has a problem. Also note when this question was asked. The situation has improved in recent years. ",
            "date": "Answered October 2, 2020",
            "views": "16",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bengt Björck",
                    "user_href": "/profile/Bengt-Björck"
                }
            ]
        },
        {
            "author_info": {
                "name": "Douglas Tobin",
                "href": "/profile/Douglas-Tobin-3"
            },
            "answer_text": "Early on the S had problems but I am not aware Teslas have any unusually high levels of problems currently. 3’s have teething problems but with the best after sales service anywhere they too will be sorted before long Questions like this show a bias against Tesla, I too question why one would argue from such a position of ignorance? ",
            "date": "Answered December 22, 2018",
            "views": "91",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gene Stallons",
                "href": "/profile/Gene-Stallons"
            },
            "answer_text": "Hmmmmm. They must be junk . You should get a job in QC .BTW , how many Tesla vehicles have you been around ? ",
            "date": "Answered December 20, 2018",
            "views": "99",
            "upvotes": "0"
        }
    ]
}