{
    "title": "Why do I need so many TV set-top boxes? Why didn't the media companies arrange to have one set- top box I can use to pay to view each company’s content? - Quora",
    "tags": [
        "Cable TV Companies",
        "Set-Top Boxes",
        "Cable TV",
        "TV Channels",
        "Commercial Media",
        "Television Business",
        "Television",
        "Companies",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael O'Leary",
                "href": "/profile/Michael-OLeary-171"
            },
            "answer_text": "Well first off you shouldn’t have any more than two boxes to get everything… 1 - A Cable/Dish box to receive those services 2 - A streaming Box (or Dongle if you don’t like boxes) for all the app based services that are available. As to the question why don’t they put it all in one box? Well they really don’t want you to watch those other services they prefer you watch theirs. But if you really want to reduce the number of boxes connected to your TV there is a way to do it if you have a good provider. Many Cable and Dish services offer apps that can get most if not all of the channels you subscribe to. These are available for most of the streaming boxes out there (Android especially). So you could get away without a cable/dish tuner and do everything on your streaming box. That way everything would be on the one box. ",
            "date": "Answered October 24, 2020",
            "views": "11",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Antonio Tela",
                    "user_href": "/profile/Antonio-Tela"
                },
                {
                    "user_id": "Nandkishor Ingavale",
                    "user_href": "/profile/Nandkishor-Ingavale"
                },
                {
                    "user_id": "Jeff Gerckens",
                    "user_href": "/profile/Jeff-Gerckens"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Black Perley",
                "href": "/profile/Benjamin-Black-Perley"
            },
            "answer_text": "To answer your question simply. You need those devices because all of the manufacturers are competitors. To the extent that they cooperate, you can get a lot of over the top services likr Netflix or Amazon via apps on a single device like Apple TV or Amazon fire stick. It’s really the traditional cable companies that aren’t playing ball. ",
            "date": "Answered October 26, 2020",
            "views": "908",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Antonio Tela",
                    "user_href": "/profile/Antonio-Tela"
                }
            ]
        }
    ]
}