{
    "title": "Why are Chinese Smartphones brand winning? - Quora",
    "tags": [
        "Chinese Brands",
        "Smartphones Recommendations",
        "Huawei (company)",
        "Mobile Phone Recommendations",
        "Xiaomi (company)",
        "Brands and Branding",
        "China",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Smith",
                "href": "/profile/John-Smith-29577"
            },
            "answer_text": "As every knows, no good cheap goods. And one reason of so-called good quality and low price is at the expense of the health of the buyer. For example, the power of its radio is harmfully amazing high on some key stage. I use HUAWEI phone before, but after an accidental discovery, decide never use any phone with base-band and radio made in China any more. Let me tell you the whole story. Coincidentally, I accidentally left my HUAWEI Honor-8 phone on the HDMI cable, and coincidentally a call came in after a while. From a few seconds before the bell rings, my monitor start to show blurred and black screen, the image constantly changing and horrible shaking until I pick up and answer the phone. So I hurry to try more experiments to find out the routine. I tried several times on HUAWEI phones, the problem remains. As a contrast, test iphone6s instead in the very same situation. The screen is completely free of even a little bit of anomalies. At last, I search out several reports said the HUAWEI’s phone has absolutely highest radio power than others’, higher than other Chinese phone like OPPO and VIVO which is based on Qualcomm platform. And please note, these official tests are only implemented in the standby status of phone. There are many reports and friends around me said that feel discomfort like eyes and brains after long use of HUAWEI. Because there is no other cell phone at hand, please join me helping to collect more evidences, such as using Samsung or Qualcomm platforms, to supplement this special experiment. ",
            "date": "Answered January 17, 2019",
            "views": "481",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Salaman Shaik",
                "href": "/profile/Salaman-Shaik"
            },
            "answer_text": "Low cost, with good quality, takes your attention to new upcoming brands like xiaomi win the hearts. Also the features, it offers bundled enough to try new brand models. High configs hardware for reasonable price enough to break the space performance barriers ",
            "date": "Answered January 17, 2019",
            "views": "28",
            "upvotes": "0"
        }
    ]
}