{
    "title": "Why is everyone so excited about Micromax’s upcoming smart phones? - Quora",
    "tags": [
        "Micromax Mobile",
        "Micromax",
        "Technology Trends",
        "Mobile Technology",
        "Android (operating system)",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tushar Sharma",
                "href": "/profile/Tushar-Sharma-1522"
            },
            "answer_text": "Due to the ongoing sentiment of using only the Indian products in India, Micromax is getting a lot of attention these days. This is one of the Indian brands that was highly popular a few years ago, but the market went down with time due to competition. However, Micromax is making a comeback in the Indian market with some really interesting devices and you can expect MediaTek gaming processors in them. According to the sources, the MediaTek Helio G35 and MediaTek Helio G85 processors are almost confirmed in the device and besides, there can be some high-end smartphones as well. No doubt, the smartphones from Micromax seem to be really exciting and they could pose a lot of competition to the others in the budget segment.  ",
            "date": "Answered October 23, 2020",
            "views": "178",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ramandeep Singh",
                    "user_href": "/profile/Ramandeep-Singh-662"
                },
                {
                    "user_id": "Ankit Gupta",
                    "user_href": "/profile/Ankit-Gupta-2840"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pallav Mohan",
                "href": "/profile/Pallav-Mohan-1"
            },
            "answer_text": "Micromax is an Indian smartphone brand which is making a comeback in the country with its IN series in the budget to mid-range market.  The excitement about Micromax’s upcoming smartphone is because these will be solely made and manufactured in India and will serve as the right alternative to the Chinese smartphones that are so popular among the people because of their affordability. ",
            "date": "Answered October 23, 2020",
            "views": "54",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aarav Agarwal",
                    "user_href": "/profile/Aarav-Agarwal-25"
                },
                {
                    "user_id": "Arjun Agarwal",
                    "user_href": "/profile/Arjun-Agarwal-123"
                },
                {
                    "user_id": "Pravin Kumar",
                    "user_href": "/profile/Pravin-Kumar-3850"
                }
            ]
        }
    ]
}