{
    "title": "Why are Xiaomi phones the worst? - Quora",
    "tags": [
        "Xiaomi Mobile Phones",
        "Xiaomi (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christoffer Aasted",
                "href": "/profile/Christoffer-Aasted"
            },
            "answer_text": "I can tell you why. When Pocophone F1 launched they had a touch issue that affected the vast majority of the shipped devices. They tried to hide this fact for as many people as possible claiming a software update was all it took to fix it (from the very first mentions of the touch issue). An official statement came a whole year after official release in July 2019 (release August 2018) claiming they were still working on this issue (It was more or less repeated the whole year). Meanwhile people were waiting patiently, putting their trust in this company and since time had passed it would invalidate most peoples phone for repairs. Which left people with an unbearable touch screen outside their return period, where they now have to struggle with lengthy process of returning. I tried within the return period and they straight out denied the issue, even though it was very easily reproducible and I wrote a thorough description of the issue and how to be sure to reproduce it (Typing characters fast on the edge of the screen and see it swap first entered letters with the second wave). This problem was so obviously a hardware problem, because the first 2–3 ROM updates only implemented a “guessing”-algorithm when horrible input lag was detected, that guessed which letter came first on the touch keyboard (yes, the keyboard LITERALLY guessed which CHARACTER you typed first, due to massive input lag and unresponsiveness mainly in the edges of the screen). Overall the touchscreen was utter garbage. It felt really, really weird to type on, it was the slowest of all smartphones I’ve had in terms of productivity. Ghost-touch and extreme sensitivity (You only had to hold your finger hovering over the digitizer to initiate a touch, and touching headphone wires also triggered the digitizer) They kept on stringing their customers, for a whole year. I was glad I returned it within the return period, or I would have been left with a phone with great specs, but absolutely nerve-wrecking flaw on the most important aspect of a phone the digitizer/display assembly, your only choice of input. This made the phone feel “cheap”, “rushed”, “catfished”. The “Tianma” display and input lag is well known all across the Poco F1 community, it’s one of the most well-known discussed issues on reddit and is still discussed to this day. Many fanboys tried to talk around the issue claiming a custom ROM would fix the issue. I don’t believe they ever were capable of detecting the issue, because a later post with a guy from reddit that assembled all device IDs and regions would reveal it was more or less every phone on the market affected with this issue. (I can’t find the link to this post right now)  The official Twitter statement a whole year later in July, would be denying of the issue as well, as it had been for a whole year prior up to this, yet they still mention it albeit not acknowledging it entirely. “We will need to collect some devices to further test”? Excuse me wtf? It’s been a YEAR, you have had literally the whole community talking about this issue everywhere? YouTube, Reddit, MIUI forums, xda-developers - the vast majority of the discussion on this phone is on this issue alone, and yet they refuse to acknowledge it. Because they knew they cheaped out on the displays. How on earth can you ship so many devices and have almost 100% affected devices without it failing quality control?  Do you experience latency on the edges of the touchscreen ? And still claiming a year later it will be fixed by next update, as promised a year prior. Poco F1 software update 10.3.6.0 promises to fix touch issues  There you have it. This is why I don’t trust Xiaomi with a phone another time (I’m glad I got out, and didn’t have the headaches of daily use this guy had a year later..). Bargain or not, you won’t see me defending a company hiding their obvious hardware defects by completely denying it and postponing the issue with false hopes for people who spent a large sum of money for a device where the main input to the device (screen assembly, digitizer) is broken as shipped. Pocophone F1 from launch to history a year later was a massive failure hidden behind a success of sales. I have heard good things about their electric scooter tho ¯\\_(ツ)_/¯ ",
            "date": "Updated January 30, 2020",
            "views": "36",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Theodore Dervenis",
                    "user_href": "/profile/Theodore-Dervenis"
                },
                {
                    "user_id": "Ehzan",
                    "user_href": "/profile/Ehzan"
                },
                {
                    "user_id": "Ankit Sharma",
                    "user_href": "/profile/Ankit-Sharma-1328"
                },
                {
                    "user_id": "Loko Bous",
                    "user_href": "/profile/Loko-Bous"
                },
                {
                    "user_id": "Swastik Nag",
                    "user_href": "/profile/Swastik-Nag-2"
                },
                {
                    "user_id": "Timothy Atwood",
                    "user_href": "/profile/Timothy-Atwood-4"
                },
                {
                    "user_id": "Abiral Regmi",
                    "user_href": "/profile/Abiral-Regmi-1"
                },
                {
                    "user_id": "Brett Wright",
                    "user_href": "/profile/Brett-Wright-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yadunath K Rajendra",
                "href": "/profile/Yadunath-K-Rajendra"
            },
            "answer_text": "I have used Lenovo, Karbonn, Samsung , Nokia , Asus and 3 Xiaomi devices , so I think I'm able to answer this. My answer is that they are the best in the segment and most durable & specification rich smartphones in the market for the price point in India. I had a Redmi note 4 from 2017 , it fell into water 1 time , fell into the ground twice , rooted the phone and installed every custom rom available in the websites , installed every custom kernels in the market available to boost battery life and performance. Installed Dolby Atmos for Redmi note 4 , enabled Camera2api and installed google camera took DSLR like pics and what not, Did everything possible with that phone. The phone never heated while playing PUBG for 1–2hours . I even used the phone while charging still no heating ( i won't recommend this on any smartphone , don't do it). Still it survived everything without any issues. I never went to service centre when i used Redmi note 4 for 1 & half years.Then i thought for some upgrades so i exchanged Redmi note 4 with Xiaomi Poco F1 (i can't tell you the amount of Hype it created that time for the specifications it gave for that price) the cheapest flagship killer of that time with snapdragon 845 in 2018. It is a complete beast can run any games or apps , battery life is commentable i charged in the morning it lasts for nearly 1 day with gaming and Youtube videos ( I'm a sort of heavy user , i used to edit videos too ) . The phone charged in just 1 and half hour (Qc 3.0 ). Although i faced some issues with Poco that it had decent amount of heating while playing Pubg at HDR. A issue reported by customers was Screen bleeding , light emitting from below. I also faced it to an extend but not entirely visible unlike as seen in pictures (i replaced it twice from flipkart).Xiaomi also provides mi PROTECT(for accidental damage and liquid protection) an insurance named ONE assist provided the claims ( They are the most pathetic insurance company in the world , they will reject the claims many times without any reason , you may have to raise many complaints or even have to go consumer court for repairing the device after accidental damage )Overall my experiences with xiaomi is quite good when compared with Nokia and Asus ( Asus has one of the worst services in the world don't ever buy it, they would ask you to change motherboards for any issues even if the phone is softbricked ). Edit:- some Xiaomi service centres also advice for motherboard change without checking the device which may be softbricked. Hope this helps . ",
            "date": "Updated April 6, 2020",
            "views": "79",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-14116"
                },
                {
                    "user_id": "Ehzan",
                    "user_href": "/profile/Ehzan"
                },
                {
                    "user_id": "Swastik Nag",
                    "user_href": "/profile/Swastik-Nag-2"
                },
                {
                    "user_id": "Ahmad Shahzad",
                    "user_href": "/profile/Ahmad-Shahzad-158"
                },
                {
                    "user_id": "Abhishek Pandey",
                    "user_href": "/profile/Abhishek-Pandey-1858"
                },
                {
                    "user_id": "Melvin John",
                    "user_href": "/profile/Melvin-John-40"
                },
                {
                    "user_id": "Bruce Banner",
                    "user_href": "/profile/Bruce-Banner-183"
                },
                {
                    "user_id": "Vishnu D",
                    "user_href": "/profile/Vishnu-D-37"
                },
                {
                    "user_id": "Vicky Sharma",
                    "user_href": "/profile/Vicky-Sharma-550"
                },
                {
                    "user_id": "Rishabh Dwivedi",
                    "user_href": "/profile/Rishabh-Dwivedi-95"
                },
                {
                    "user_id": "Yu Maynard",
                    "user_href": "/profile/Yu-Maynard"
                },
                {
                    "user_id": "Arneesh D",
                    "user_href": "/profile/Arneesh-D"
                },
                {
                    "user_id": "Ibrahim Munoz",
                    "user_href": "/profile/Ibrahim-Munoz"
                },
                {
                    "user_id": "Ian Emery",
                    "user_href": "/profile/Ian-Emery-12"
                },
                {
                    "user_id": "Mayank Verma",
                    "user_href": "/profile/Mayank-Verma-508"
                },
                {
                    "user_id": "Aryan Sawhney",
                    "user_href": "/profile/Aryan-Sawhney-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amir Alavi",
                "href": "/profile/Amir-Alavi-4"
            },
            "answer_text": "I own a Xiaomi Mi9 and I’m extremely disappointed. Build quality is extremely poor. I used to own an old Huawei G8 and the Xiaomi phone feels like a cheap phone when you keep both of them in hand. In addition, software experience is totally horrendous. With each software update, they fix one issue and then a new one pops up. Additionally, MIUI itself is full of bloatware which occupy a space in your phone’s storage and slow it down. Xiaomi fanboys always suggest using a custom ROM instead of MIUI, but to be honest, using custom ROMs and tampering with phone’s stock software is not something for the average consumer. Xiaomi phones tend to have lots of fans and fanboys, but it’s to a great extent related to their cheap prices. However, I’d personally pay a bit more to get a phone with a nicer build quality and better software experience. ",
            "date": "Answered May 13, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Swastik Nag",
                    "user_href": "/profile/Swastik-Nag-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prateek Tiwari",
                "href": "/profile/Prateek-Tiwari"
            },
            "answer_text": "Well played Samsung/ RealMe/ Oppo :) <To prevent flagging> It is a loosely framed question. You need to explain why do YOU think it is worst. e.g. If I say you are the worst person I ever met, you can not justify or explain anything until I explain the details.Let me still try to answer: Just do 5-minute research by reading Amazon/FK reviews for any Xiaomi device and compare with any competitor in same as well as +20% price bracket. Note that Xiaomi is globally known for its world-class products at ~5% profit margin at the hardware level. A little googling never hurts. ",
            "date": "Answered June 10, 2019",
            "views": "23",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sc Baluni",
                    "user_href": "/profile/Sc-Baluni-2"
                },
                {
                    "user_id": "Vishnu D",
                    "user_href": "/profile/Vishnu-D-37"
                },
                {
                    "user_id": "Akash Jaiswal",
                    "user_href": "/profile/Akash-Jaiswal-98"
                },
                {
                    "user_id": "Si Liang Zhou",
                    "user_href": "/profile/Si-Liang-Zhou"
                },
                {
                    "user_id": "Vignesh Srinivasan",
                    "user_href": "/profile/Vignesh-Srinivasan-37"
                },
                {
                    "user_id": "Sachin Bajpai",
                    "user_href": "/profile/Sachin-Bajpai-24"
                },
                {
                    "user_id": "Kratu Nandan",
                    "user_href": "/profile/Kratu-Nandan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumit Banskota",
                "href": "/profile/Sumit-Banskota"
            },
            "answer_text": "Xiaomi’s Phone are not bad at all . It depends on the individual perception. The good side of Xiaomi Most of devices have Qualcomm processor which the most powerful these daysYou can have equally good phone on half cost of the branded oneThey have good ecosystem, you can sync data all over your Xiaomi devices using mi cloudSome of the variants ship with android one which ensures regular software updatesThey have customised android to MIUI which is simple with less bloatwaresBad side Their software MIUI has lots of customisation which delay them to push the new software updateHigh end phones camera is still below parChinese variant might ship without google play services",
            "date": "Answered May 28, 2019",
            "views": "44",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swastik Nag",
                    "user_href": "/profile/Swastik-Nag-2"
                },
                {
                    "user_id": "Melvin John",
                    "user_href": "/profile/Melvin-John-40"
                },
                {
                    "user_id": "Mirshad Ali",
                    "user_href": "/profile/Mirshad-Ali-4"
                },
                {
                    "user_id": "Zhan HuG",
                    "user_href": "/profile/Zhan-HuG"
                },
                {
                    "user_id": "Mirza",
                    "user_href": "/profile/Mirza-74"
                },
                {
                    "user_id": "Sergey Khodakovski",
                    "user_href": "/profile/Sergey-Khodakovski"
                },
                {
                    "user_id": "Ian Emery",
                    "user_href": "/profile/Ian-Emery-12"
                },
                {
                    "user_id": "Sai Chaitanya Nallamala",
                    "user_href": "/profile/Sai-Chaitanya-Nallamala"
                },
                {
                    "user_id": "Andika Yudhistitra",
                    "user_href": "/profile/Andika-Yudhistitra"
                },
                {
                    "user_id": "Riham Xpiria SL",
                    "user_href": "/profile/Riham-Xpiria-SL"
                },
                {
                    "user_id": "Maria Genesis M. Hiso-An",
                    "user_href": "/profile/Maria-Genesis-M-Hiso-An"
                },
                {
                    "user_id": "Michael Vincent",
                    "user_href": "/profile/Michael-Vincent-137"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Emery",
                "href": "/profile/Ian-Emery-12"
            },
            "answer_text": "In the last 7 years I have bought and used 4 Xiaomi Note phones (I killed one by drowning and my daughter killed another). All of them have been excellent phones, far better than anything else on the market at double the price point; and Xiaomi have kept pushing updates for 4+ years on even the oldest (might be longer, my daughter finally killed it last year). My Xiaomi Note 3SE cost £120 and rang rings around my wifes £600 Samsung Note 3; although TBF, the Sammy had a better camera. I will run my Note4X for another year or so then buy another Xiaomi Note - probably the Note 8 by then. ",
            "date": "Answered September 9, 2019",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yudix Bollz",
                    "user_href": "/profile/Yudix-Bollz"
                },
                {
                    "user_id": "Loko Bous",
                    "user_href": "/profile/Loko-Bous"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prateek Verma",
                "href": "/profile/Prateek-Verma-299"
            },
            "answer_text": "Xiaomi phones are not bad at all. Instead, they are the best phones you can get in a very low price. But as Xiaomi is a Chinese company many people do not trust it. If u see Xiaomi phones have the highest specs than any other phone in the same price. They give Qualcomm Snapdragon processors, Long-lasting Battery, Best Camera, and many more. Some people have reported the issue that their xiaomi phones become hot while charging. But , xiaomi has removed this disadvantage it had and the latest phones of xiaomi like Redmi Note 7 pro do not become hot at extreme levels. Xiaomi due to these reasons still remains THE NO. 1 SMARTPHONE BRAND IN INDIA.  ",
            "date": "Answered June 4, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vishnu D",
                    "user_href": "/profile/Vishnu-D-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kuldeep Bisht",
                "href": "/profile/Kuldeep-Bisht-7"
            },
            "answer_text": "Who says Xiaomi phones are bad, Xiaomi is one of the popular brands in India that provide good Facility to their users. Here are the points that help you understand why Xiaomi is Good: Great SpecsHigh tech cameraNo heating issue* (most of the cases)Timely update up to 2 years, (One of my best)Specs perfectly match the price point.But, I don’t like the annoying ads on Xiaomi, maybe they will remove it in the Future. Thanks. ",
            "date": "Answered March 18, 2020",
            "views": "790",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Fearn",
                "href": "/profile/Paul-Fearn-5"
            },
            "answer_text": "I have had two Xiaomi mobiles and both were terrible with reception. I only managed 3G 4 bars and only 4G in towns. With my Samsung Galaxy I receive full 4G. I found them very slow and loads of crashes. I wouldn't have one given. ",
            "date": "Answered May 29, 2019",
            "views": "434",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ehzan",
                    "user_href": "/profile/Ehzan"
                },
                {
                    "user_id": "Dimitri Ajazi",
                    "user_href": "/profile/Dimitri-Ajazi"
                },
                {
                    "user_id": "Amir Alavi",
                    "user_href": "/profile/Amir-Alavi-4"
                },
                {
                    "user_id": "Michael Vincent",
                    "user_href": "/profile/Michael-Vincent-137"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Snow",
                "href": "/profile/Jon-Snow-1118"
            },
            "answer_text": "According to a report which covers mobile device repairs, Xiaomi Redmi 4 was the worst-performing Android phone in Q4 2017 whereas Samsung topped the list of Android manufacturers with the highest failure rate. ",
            "date": "Answered February 8, 2019",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "CHELU Marius",
                    "user_href": "/profile/CHELU-Marius-1"
                },
                {
                    "user_id": "Dimitri Ajazi",
                    "user_href": "/profile/Dimitri-Ajazi"
                },
                {
                    "user_id": "Amir Alavi",
                    "user_href": "/profile/Amir-Alavi-4"
                },
                {
                    "user_id": "Ritu Bhanot",
                    "user_href": "/profile/Ritu-Bhanot-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arnav Mittal",
                "href": "/profile/Arnav-Mittal-1"
            },
            "answer_text": "Use Mi A2 or Redmi Note 6 Pro in the budget segment or Poco F1 in the mid range segment or Mi 8 in flagship segment and then ask me this question again. ",
            "date": "Answered February 8, 2019",
            "views": "399",
            "upvotes": "0"
        }
    ]
}