{
    "title": "Why are computers more intelligent than humans? - Quora",
    "tags": [
        "Intelligence",
        "Artificial Intelligence",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Deakin",
                "href": "/profile/Nick-Deakin-4"
            },
            "answer_text": "They are not. They can perform some (limited tasks) better then a human, which is currently limited to image tagging and playing computer games. Ask them to undertake a mundane task like tie a shoelace they can’t do it. They will become better at many more tasks (driving and so on). Whether all these different skills can be but together is not known. Nor is instructing a machine to perform a useful general task known, (but things like Alexa hint it may be), Robot tidy my room, Robot make me an omelette, Robot buy a present for X and take it around. I think this is likely in the next twenty five years. Whether they will ever be able to better theorise the laws of the Universe and inventive things is not known. Here is what an AI called deep dream painted, it looks slightly deranged to me. What do you think? A dog’s dinner, literally. People pay money for these prints, maybe machines are more intelligent than us.  ",
            "date": "Answered January 22, 2019",
            "views": "497",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Herschel Peeler",
                "href": "/profile/Herschel-Peeler"
            },
            "answer_text": "Than which humans? More intelligent than the designers? No. More intelligent than the inexperienced and uneducated user? Yes. I depend a lot on my spell checker. It is often smarter than I am. The calculator gives me trig answers to calculations I could not otherwise resolve. My ORCAD electronics package is smarter in many ways than I am. My Excel I use for my inventory of parts has a far better memory than I do. Do those things count? ",
            "date": "Answered October 17, 2018",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Brant",
                "href": "/profile/Mike-Brant-5"
            },
            "answer_text": "In highly specialized ways, yes. In other ways, no. Also, keep in mind that a human brain uses only 15 watts of power, and a computer uses many, many times that. ",
            "date": "Answered October 17, 2018",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nick Deakin",
                    "user_href": "/profile/Nick-Deakin-4"
                }
            ]
        }
    ]
}