{
    "title": "Why are more blades on a razor a bad thing? - Quora",
    "tags": [
        "Razors",
        "Blades"
    ],
    "response": [
        {
            "author_info": {
                "name": "Indigo Arya",
                "href": "/profile/Indigo-Arya"
            },
            "answer_text": "If you take up straight razor shaving you will very quickly learn that the more shallow the angle you can hold the razor at relative to the flat face of your skin the more delicate the shaving process is. The problem with multi blade throw away designs is multifaceted The attempt to add more blades means there is less space between blades for hairs to slip into.Less space to put blades into means less shallow angles have to be used.Acute angles simply do not slice through standing hairs, they grind hairs against the skin and hope it cuts through pressure. (causing more irritation)More acute angles means less cutting efficiency in exchange for (in theory) longer lasting edges.I will still use a mach 3 blade to trim up anything I missed but I will stick to my straight razor for my primary shave. It’s more blade maintenance in exchange for a smoother, more luxurious shave with less irritation and a dash of manly pride to flatter the ego. ",
            "date": "Answered June 20, 2019",
            "views": "110",
            "upvotes": " Answer requested by Ben Sailors",
            "upvoters": [
                {
                    "user_id": "Jackie Sweeney",
                    "user_href": "/profile/Jackie-Sweeney-3"
                },
                {
                    "user_id": "Mike Rommel",
                    "user_href": "/profile/Mike-Rommel"
                },
                {
                    "user_id": "Micheal Anderson",
                    "user_href": "/profile/Micheal-Anderson-31"
                },
                {
                    "user_id": "Gavin Christopher Patterson",
                    "user_href": "/profile/Gavin-Christopher-Patterson"
                },
                {
                    "user_id": "Debbie Harrington",
                    "user_href": "/profile/Debbie-Harrington-19"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Stephen Clothier",
                    "user_href": "/profile/Stephen-Clothier-2"
                },
                {
                    "user_id": "William Ho",
                    "user_href": "/profile/William-Ho-62"
                },
                {
                    "user_id": "Anne Benzow",
                    "user_href": "/profile/Anne-Benzow"
                },
                {
                    "user_id": "Anne Harris Wyckoff",
                    "user_href": "/profile/Anne-Harris-Wyckoff"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Salm",
                "href": "/profile/Adrian-Salm"
            },
            "answer_text": "To be honest, I have no idea how more blades make a razor less effective. There must be a scientific reason for this though. I used to use Gillette Sensor in the early days. Then Gillette started added more blades and it seemed to reduce the closeness of the shave. I now use a safety razor and I would never go back to using disposables. I bought a Merkur safety razor for around £25. It's probably the only one I'll need to buy in my lifetime. I now have extremely close shaves with zero razor rash. I always use shaving soap with a brush. This makes a big difference too. A good shaving soap turns shaving into a pleasure. I strongly recommend ditching disposable razors and investing in a proper double edge one. It really makes a difference. ",
            "date": "Answered June 11, 2019",
            "views": "228",
            "upvotes": " View 14 Upvoters"
        }
    ]
}