{
    "title": "Why did human 'technology' stay the same for nearly 700,000 years (1.2 million years ago)? What caused this prolonged period of stasis? - Quora",
    "tags": [
        "Culture (anthropology)",
        "History of Technology",
        "Human Evolution",
        "Science of Everyday Life",
        "The Human Race and Condition",
        "Science",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Conner Steacy",
                "href": "/profile/Conner-Steacy"
            },
            "answer_text": "It should surprise us far more that the human species made it this far. There is evidence our species may have been reduced to about 10,000 individuals, near extinction. Most agree that a volcano in Sumatra 70,000 years ago was the cause. Nevertheless, one has to imagine a time with no knowledge of technology, not even fire. It’s easy to assume that all one has to do use flint rocks or rub sticks together to achieve fire. Fair enough, but who figured that out? And even then the technology may have been discovered and forgotten multiple times. A scene from the 1981 movie Quest For Fire imagines how fire may have been replicated without a natural cause, and subsequently, the technology being shared with an alien tribe.  Even then fire is just the beginning. How does one accidentally notice that two different rocks (tin and copper) in the fire combine, under intense heat to form a stronger metal (bronze) that has far better uses than either of the two original rocks alone. And would the discovery of agriculture had to have occurred before we even got to metal alloys? Again I am in awe that we got here at all. 700,000 years seems reasonable. What is no surprise is how fast, once certain milestones were achieved, technologies advanced. The timeline from stone age to bronze is vast, hundreds of thousands of years. From bronze to iron is within a millennia. This has continued exponentially. A computer from the 40’s and 50’s filled a warehouse I now have one in my pocket. ",
            "date": "Answered October 24, 2020",
            "views": "143",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Dennis",
                    "user_href": "/profile/David-Dennis-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Bross",
                "href": "/profile/Michael-Bross-3"
            },
            "answer_text": "Up to about 8,000 years ago the most pressing issue for humans was survival. This was more or less what took up virtually all of their waking time, their lives basically centred around having enough food and shelter on an almost daily basis. Thomas Hobbes quote describing the natural state of mankind applies here in full force, in that life was: “poor, nasty, brutish, and short\". Then, too, since the appearance of the species Homo about 2.5 million years ago, most of this time span was spend in the stone age which ended about 8,000 years ago. The ‘hi-tech’ of that time were stone axes, spears and the like, but the most important technology bequeathed from the stone age that set the stage for further developments was the control of fire. Aside from allowing the chemistry of cooking, It set the stage for later advances in the forging of elements like copper, bronze and iron. Also the wheel appears around the end of the stone age and, shortly after, the potters wheel. These technologies will be more fully exploited in the next stages, the bronze age (ca 3, 000 to 1,000 years BC), and the following iron age (ca 1,100 BC to about 500 CE). Not coincidentally, the bronze age also coincided with the invention of writing, a technology that will enable humans to ‘externalize’ memory and pass on valuable (and other) ideas to future generations. We might say that the road to modern technology started there. Given the relatively short history of modern humans, an argument can be made that based on historical time modern technology evolved rather quickly. Another, critical ‘technology’ emerging towards the end of the stone age but being drastically improved in the bronze age is the ‘invention’ of agriculture and domestication of animals. It was not until the arrival of agriculture and the production of surplus that that magic ingredient we call leisure time arrived, it will be the key ingredient for future developments.. Agricultural surplus will be the key ingredient for all other cultural endeavours, technology included, take it away and humanity would quickly regress to earlier modes of existence. It provided the impetus and extra time to think (and an impetus perhaps born out of curiosity as much as necessity) about how to do things more effectively. In particular the optimization of field use with plows — perhaps one technology that dramatically increased surplus food production — and leading to an advanced agricultural industry, allowed for an economic basis to support endeavours not related directly to the production of life’s necessities. While much of this new ‘inventiveness’ was directed at improving weaponry and other related military improvements (see Heraclitus, ca 500 BC: “War is the father of all things”, there are also many excellent post on Quora on this subject) it also provided room for thinkers and tinkers. While much has been made of the Baghdad battery and the Antikythera mechanism, let's take an other example of a technology invented by Hero (Heron) of Alexandria around 50 CE, steam power (you can easily make you own).  In hindsight it seems obvious that this invention should have inspired practical applications (also his construction on a wind powered organ), but a curious flaw in human nature intervenes: inertia, as long as you had lots of cheap labour — much of it slave labour — there was no pressing need to apply it. It had to wait 1,700 years to be ‘reinvented’ by James Watt. Before Watts the only type of mechanical power in use was wind and water power, but with the arrival steam engine the stage is set for the industrial revolution. An extra offshoot from the steam engine: it started the quest on how to measure the energy produced by steam kettles, and a generation later Nicolas Carnot will provide the foundation to the field known as thermodynamics.Carnot's theorem (thermodynamics) - Wikipedia. The industrial revolution also benefited from two other technological inventions preceding it by centuries, clocks and the printing press. Mechanical clocks were invented in the 14th century and they became the wonder of the day, giving for the first time precise measurement of time and also provided a model for other uses using the underlying mechanical principles like calculating machines and music boxes small and large laying the foundations for changes in time consciousness that would accelerate scientific thinking.   BTW, Blaise Pascal, constructed the first mechanical calculator (1642) at age 19(!) was horrified that it (above) was able to provide actions previously thought reserved for human thinking, as it: \"...produces effects which approach nearer to thought than all the actions of animals\". The invention of the printing press by Johannes Gutenberg, ca 1440, did much more than accelerate the production of books. Movable type on wood existed before him, what he solved was the question of how to do it quickly with interchangeable metal letters in a mold. This was essentially a new manufacturing process and is the prototype of (much) later assembly lines. The truly first modern piece of technology that replaced/displaced human labour was the invention of the automated weaving loom by Joseph Jacquard in 1790, quickly refined into long interconnected punch cards, that produced linen with patterns. Not surprisingly, the first programs for computers were written on punch cards.  The one ingredient still missing was a reliable and relatively small power source to do away with bulky steam and wind power, or the need to wind mechanical devices. This will be solved from two directions, one electrical the other based on combustion of oil. Michael Faraday demonstrated in 1821 that electric current could produce rotary motion, and William Sturgeon produced in 1832 the first electric motor capable of turning machinery, Nikola Tesla in 1887 will invent the first electric induction motor. Concerning mechanical engines, Nicolas Otto along with his brother built the first internal, liquid fuelled combustion engine e and applied for a patent for it in January 1861 and Benz will build the first automobile using the Otto motor in 1885. Given all this, the rest is very recent history where technology has become so central to our existence that a severe loss of it would break our economy and style of life completely. It has invaded everyday live to such an extent that we can't imagine a life without it, indeed we’re so dependent on it that there are cases where the become an extension of one’s identity. Two years ago there was a report that a 16 year old girl committed suicide when her mother took away her smartphone. One could make a case that this is an example of extreme cathexis (hello Freud), but if Goethe were alive he might write a novella titled “The Sorrows of a Young Maiden” as a lament to this reliance and dependence on technology. ",
            "date": "Answered October 26, 2020",
            "views": "220",
            "upvotes": "0"
        }
    ]
}