{
    "title": "Why did smartphones become popular after the launch of the iPhone? - Quora",
    "tags": [
        "iOS",
        "Mobile Technology",
        "Apple (company)",
        "Fame and Mass Popularity",
        "iPhones (product)",
        "Apple Products and Services",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daryl Larsen",
                "href": "/profile/Daryl-Larsen-1"
            },
            "answer_text": "There were several factors that came together that led to the iPhone kicking the smartphone into high gear, including some smart moves by Apple. As mentioned, there were already smartphones prior to the iPhone but they were mainly targeted at business, there were multiple OSes and multiple form factors. Though they had touchscreens, most of them required a stylus or a hardware keyboard to use. Two of the factors were developments outside of Apple. Continued improvements in touchscreen technology and the beginnings of Twitter, Facebook and YouTube in the mid 2000’s, in other words, social media as we know it today. What Apple did was design a phone and operating system that took advantage of these developments and instead of targeting the business market, they targeted the consumer market. They chose the “chocolate bar” form factor and filled the entire front with a touchscreen. Thanks to the improved touchscreen technology, they were able to design the OS so that everything could be done with just fingers with no stylus or hardware keyboard needed. Essentially, it was a combination of right time, right place, some prescient moves by Apple and a good dose of luck. When it was launched, the iPhone was laughed at by many in the industry because as mentioned, up to that point, smartphones were used mainly by business. But it wasn’t business that embraced it, it was the ordinary consumer. And there are far more of them than there are businesses. And, as they say, the rest is history. ",
            "date": "Answered October 22, 2020",
            "views": "264",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Miller",
                    "user_href": "/profile/Robert-Miller-231"
                },
                {
                    "user_id": "Kuang Huang",
                    "user_href": "/profile/Kuang-Huang-7"
                },
                {
                    "user_id": "Praveen",
                    "user_href": "/profile/Praveen-403"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Summers",
                "href": "/profile/Chris-Summers-22"
            },
            "answer_text": "They had been popular just with the tech community because of what they could do for the person when out in the field. Once the iPhone came it introduced a device that could be a phone, an iPod, and an internet connected device all in one. It couldn't do what a smartphone could at the time but it was enough features and presented in the right way to draw the attention of the masses. Apple does that very well with their devices, bring technology to the masses and make them easy to use. It is what the original Macintosh was all about and a driving philosophy in Apple ever since. Android came the next year with the HTC G1 or Dream depending on what market you were from. It offered a similar experience as the iPhone. Since then a few models captured the masses attention that set everything in motion like the iPhone 3G and then the iPhone 4 as well as the Motorola Droid made a big impact for android devices and the HTC HD2. From then on the snowball just kept getting bigger and bigger as it rolled down the hill. ",
            "date": "Answered October 22, 2020",
            "views": "252",
            "upvotes": " Answer requested by Kuang Huang"
        }
    ]
}