{
    "title": "Will video game consoles be obsolete within 10 years? - Quora",
    "tags": [
        "Nintendo Wii (video game console)",
        "Xbox 360 Games",
        "Xbox 360",
        "PlayStation (video game console)",
        "Video Game Consoles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Kurz",
                "href": "/profile/Mike-Kurz"
            },
            "answer_text": "Consoles may very well still be around in ten years, but they won't be the same as what you see today.  At CES this year, LG showed off a TV that ran the Gaiki streaming service (similar to OnLive) as an app. The service was built right into the TV - just connect a controller, and play. That's a sign of things to come right there - if the software can be launched from right within the TV, the need for a dedicated gaming box will decrease as the functionality of streaming services increases.  Now look at what MS and Sony have done with their consoles over the past couple of years. Both companies have been adding various apps and services that extend out past the realm of gaming. Netflix, Hulu, Facebook, and other services have found a great home on gaming consoles, making them multimedia devices.  The future of the console is likely one in which digital downloads and streaming games reign supreme. Chances are we'll see a bigger move to apps, and I'd bet that all the console manufacturers will offer a streaming service on the generation of consoles that comes after the next. The concept of the video game console won't become obsolete - it will just adapt and evolve into something different. ",
            "date": "Answered January 28, 2012",
            "views": "889",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gary Stinson",
                    "user_href": "/profile/Gary-Stinson-6"
                },
                {
                    "user_id": "Pedro Motta",
                    "user_href": "/profile/Pedro-Motta-8"
                },
                {
                    "user_id": "Peter Recson",
                    "user_href": "/profile/Peter-Recson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Krystofolski",
                "href": "/profile/Anthony-Krystofolski"
            },
            "answer_text": "I wouldn’t so much say it’ll be obsolete or even archaic considering it’s become such a big sensation and addiction for millions although there won’t really be nearly that much “masterpieces” after a while considering every awesome idea or advancement will have been used and expanded to death where it gets super stale after a while. ",
            "date": "Answered March 28, 2017",
            "views": "75",
            "upvotes": "0"
        }
    ]
}