{
    "title": "Will the Redmi Note 5 Pro last for at least 2-3 years? - Quora",
    "tags": [
        "Xiaomi Redmi Note 5/5 Plus",
        "Redmi Note Series",
        "Xiaomi (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saddam Ansari",
                "href": "/profile/Saddam-Ansari-170"
            },
            "answer_text": "If you are asking that Redmi note 5 pro will last for 2-3 years with the same performance, the answer is both yes or no. It depends on the manufacturers to optimise the phone. If xiaomi offers regular software & OS updates, then yes it will last for 2-3 years without losing much performance. The bad thing is xiaomi takes too much time to provide OS upgrade to their smartphones. The reason is xiaomi phones run on heavily customised MIUI android based ROM that's why xiaomi users receive android upgrades quite late. However, Xiaomi regularly sends software updates to fix bugs and for system optimization through OTA. So use it for next 3 years without worry as Redmi note 5 pro has already powerful enough hardware to give you a smooth performance. Some tech bloggers and YouTubers who review mobiles might have different opinions, but don't just buy or sell your phone frequently just a tech youtube tells you to upgrade your phone with new one. Every day a new phone launch with a few new features, and hardware upgradation. Buying a new smartphone just for some new features is not worth unless you really need that features in your phone. Anything can last long as long as you keep and use them carefully just like a mother care for her babies. ",
            "date": "Updated August 2, 2018",
            "views": "973",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandeep Kumar",
                    "user_href": "/profile/Sandeep-Kumar-18981"
                },
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Tiwari",
                "href": "/profile/Akash-Tiwari-547"
            },
            "answer_text": "1.Redmi note 5 pro has latest snapdragon 636 processor so you will be able to use it for 2 to 3 years without lots of bugs, heating issue or hanging issues. 2. As you know that redmi note 3 was launched in 2016 but still it is receiving all miui updates and still has one of the best performances so you can easily say that redmi note 5 pro (which is just launched in 2018) will receive all updates Upto at least 2020. 3. Redmi note 5 pro basic varient have 64 gb storage and 4 gb ram so you don't have to worry about trash memory developing inside it. 4. Redmi note 5 pro comes with metallic back and corning gorilla glass in front so it is well protected. But if your handling capacity is not good then you should use the basic case provided in the box of redmi note 5 pro. It actually depends on you. Some people even need a double protective case and extra tempror glass. 5. All cameras, speakers,headphone jack and microphone have very high quality so it will last for 2 to 3 years. Overall redmi note 5 pro is very trust worthy ",
            "date": "Answered July 30, 2018",
            "views": "13",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sandeep Kumar",
                    "user_href": "/profile/Sandeep-Kumar-18981"
                },
                {
                    "user_id": "Anand Annamalai Thiyagarajan",
                    "user_href": "/profile/Anand-Annamalai-Thiyagarajan"
                },
                {
                    "user_id": "Daniel Huamán Babilón",
                    "user_href": "/profile/Daniel-Huamán-Babilón"
                },
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                },
                {
                    "user_id": "Subin Babu",
                    "user_href": "/profile/Subin-Babu-37"
                },
                {
                    "user_id": "Ashraf Kasmani",
                    "user_href": "/profile/Ashraf-Kasmani-2"
                }
            ]
        }
    ]
}