{
    "title": "Will you buy a foldable phone from Apple? - Quora",
    "tags": [
        "Mobile Devices",
        "Smartphone Shopping",
        "Technology Trends",
        "Mobile Technology",
        "Apple (company)",
        "iPhones (product)",
        "Apple Products and Services",
        "Shopping",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Seidel",
                "href": "/profile/Steve-Seidel-2"
            },
            "answer_text": "Probably not. I say that, but without having seen a design from Apple, I can’t say for sure. From Apple’s patent portfolio, it’s clear that they’ve been looking into foldable phones probably longer than anyone. They haven’t shipped them to market for a couple of really good reasons… Durability is problem with the current batch.Cost is an issue with the current foldable phones.I’m intrigued by the concept of a foldable phone but I’ve yet to see an implementation of that concept that makes me want to get one. Presumably, having a foldable phone might negate the need for a tablet. Yet, when I look at what I use my iPad for, it’s highly unlikely I’d want to give that up for a foldable phone. Right now, it’s an interesting concept that doesn’t actually solve a real need. ",
            "date": "Answered June 21, 2020",
            "views": "55",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mihir Srivastava",
                    "user_href": "/profile/Mihir-Srivastava-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Hee",
                "href": "/profile/Joshua-Hee-2"
            },
            "answer_text": "No I won’t. It will surely be very expensive and getting a foldable phone has no benefits. What’s the point of getting a foldable phone though? If it is because of portability then a person should get a smaller device, along with another tablet and the accumulated cost will definitely not be more expensive than one foldable device. ",
            "date": "Answered June 21, 2020",
            "views": "62",
            "upvotes": "0"
        }
    ]
}