{
    "title": "Will you purchase Apple's AirPods Pro? - Quora",
    "tags": [
        "AirPods",
        "Earphones",
        "MacBook Pro (product)",
        "Headphones",
        "Audio Equipment",
        "Technology Trends",
        "Apple (company)",
        "iPhones (product)",
        "Apple Products and Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Martinson",
                "href": "/profile/Jeff-Martinson"
            },
            "answer_text": "Will you purchase Apple's AirPods Pro? If you’d asked me a few months ago, then I would have said no. Well, a few months ago the question would’t have made sense because they didn’t exist, but you get my point. I’ve been using a pair of Sony WH-CH700N noise canceling headphones for almost a year now, and they are fantastic. They are comfortable, and clear, and the noise canceling is wonderful. The problem is that they are quite big. Now, this is good in some ways, because the battery seems to last forever, but they don’t do very well in the wind, because all I can hear is the wind whistling around them. And I’m always worried about using them when it’s raining, because I don’t want them to get wet and stop working. I have a pair of Apple Lighting Earbuds in my jacket that I use when I can’t use the big Sony’s, such as when it’s raining. They work, but they’re not great. The seal with my ears is poor, and they do a terrible job at noise isolation, and have no noise cancelation at all. So I need to find something that’s small enough to wear when it’s raining, but that also has the comfort and noise cancelation of the Sony’s. I was never too keen on the idea of the AirPods. I was sure that they would not be a comfortable fit in my ears, and they just looked to fiddly, and prone to falling out and getting lost. If I was going to be spending that sort of money then I would at least want something that had noise cancelation. But the AirPods Pro look to be the perfect solution to my problem. They are small, they are wireless, they have noise canceling, and they look like they’d be a good fit in my ears. I have a big trip coming up in a few months, and I’m almost certain that I’ll treat myself to some AirPods Pro for that. From I’ve read about them they seem to fare particularly well on flights, so it should be a good test for them. ",
            "date": "Answered December 20, 2019",
            "views": "327",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mourad Sadik",
                    "user_href": "/profile/Mourad-Sadik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Lee",
                "href": "/profile/Alexander-Lee-梅治-新太"
            },
            "answer_text": "Considering that almost all ANC wireless earbuds are in the $200-$300 price range, the AirPods Pro is priced perfectly. Its feature set is certainly very competitive, too. Now, as with many Apple products, you can certainly get ANC wireless earbuds for cheaper, but in this case, it’s not actually that much of a difference. The Sony WF-1000XM3 (terrible name, I know) has objectively better sound, better ANC, better battery life, and IMHO a sexier design, but it’s still $230— that’s only $20 cheaper than the AirPods Pro. Plus, the AirPods Pro case is a lot smaller and therefore more pocketable than Sony’s giant-as-fuck case, so if portability is important to you, spending that extra $20 might not be that big of a deal. ",
            "date": "Answered November 5, 2019",
            "views": "11",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Boris Flanko",
                    "user_href": "/profile/Boris-Flanko"
                },
                {
                    "user_id": "Balsam Almarkhi",
                    "user_href": "/profile/Balsam-Almarkhi"
                },
                {
                    "user_id": "Kadin Astfalck",
                    "user_href": "/profile/Kadin-Astfalck-1"
                },
                {
                    "user_id": "Dragan Evgen Grasic",
                    "user_href": "/profile/Dragan-Evgen-Grasic"
                },
                {
                    "user_id": "Frederick Manson",
                    "user_href": "/profile/Frederick-Manson-1"
                },
                {
                    "user_id": "Hari Baskar",
                    "user_href": "/profile/Hari-Baskar-158"
                },
                {
                    "user_id": "Ruslan Babura",
                    "user_href": "/profile/Ruslan-Babura"
                },
                {
                    "user_id": "Vishal Gadday",
                    "user_href": "/profile/Vishal-Gadday"
                },
                {
                    "user_id": "David Blache",
                    "user_href": "/profile/David-Blache"
                },
                {
                    "user_id": "Lorrn Edmonds",
                    "user_href": "/profile/Lorrn-Edmonds"
                }
            ]
        }
    ]
}