{
    "title": "Will robots take over agriculture industry? - Quora",
    "tags": [
        "Robots",
        "Robotics",
        "Agriculture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Gold",
                "href": "/profile/Michael-Gold-9"
            },
            "answer_text": "First of all, automation’s “take over” in agriculture happened in the 1800s. So if you mean a new agricultural revolution, well, we are seeing the beginnings of what it might look like. And something has to happen I’m told over and over, because the population of farmers is aging and young people don’t want to be farmers… …But. I’ve been watching agro-robot progress for some years and what I see is a) whatever can be automated economically is being automated but b) most stuff isn’t close to being automated economically so it’s basically impossible for there to be a total revolution in 10 years, probably not 20, not the kind of “take over” you seem to mean. There aren’t enough success stories to drive the investment and we’re not really close. Farming is a lot of things—it’s not just 10 distinct operations you can automate. More like 10,000. We hardly have any robots that are good at even 2 things as opposed to 1. One thing the robo-cheerleaders should try to answer: How come most farmers haven’t chosen to invest in autonomous tractors? The technology has been available for years. Trimble Autopilot first became available well over 10 years ago—of course they’ve updated it many times since then. From vendor AgLeader:  Here’s Trimble white paper dated 2006. I think Trimble’s product may have been first released in 2001. Other options appeared over the years including factory-installed options from John Deere. The entire precision-agriculture market is under 5% of the agricultural equipment market. The supposed “take over” is happening in very slow motion. ",
            "date": "Answered December 27, 2016",
            "views": "418",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Justin Ma",
                    "user_href": "/profile/Justin-Ma"
                }
            ]
        },
        {
            "author_info": {
                "name": "David VomLehn",
                "href": "/profile/David-VomLehn"
            },
            "answer_text": "Yes, they will. It is probably going to be the most shocking take over of an industry by robotics. And, because they will be replacing low-paid, low-status people, almost nobody will notice. I’m a computer engineer. I, too, will eventually be replaceable by a robot, although my profession will be among the last. So, here’s the question: where do we stop the process? Or, do we stop the process? Part of my things that human/machine integration will happen and it is this hybrid that will go bravely on to the future. This is certainly possible, but it will only happen if we make it happen. The default is that robots will replace everyone. Which I will find sad as I am fond of the human species. ",
            "date": "Answered December 27, 2016",
            "views": "237",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ravindra Bagali",
                    "user_href": "/profile/Ravindra-Bagali"
                }
            ]
        }
    ]
}