{
    "title": "Will an external monitor work with a laptop with a broken screen? - Quora",
    "tags": [
        "Computer Monitors and Screens",
        "Laptops",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darren Forster",
                "href": "/profile/Darren-Forster-5"
            },
            "answer_text": "Yes it will work fine - it’s actually one of the good ways to test if it’s a monitor or computer that has failed. If you plug the laptop into an external screen and you see the screen then you know the laptop is working fine and you can continue to use it in that way - in fact some high end laptops like the HP Elitebook range even have docking stations available so you can have a docking station with a monitor connected, bring your laptop in and just drop it on the docking station and use it on the monitor similar to a desktop PC but then remove it and you have a mobile solution. I had a friend who managed to run over his laptop with his car - totally cracked the screen and the screen couldn’t be replaced because the casing had got so bent and out of shape so we just arranged for him to use it plugged up to the TV - it was fine for him to retrieve his data off, he did battle with it for a few months before giving up on it as running over it with a car had also damaged the cooling system as well so it repeatedly overheated - but had the cooling system not been damaged as well the laptop would have worked like that for years. Laptops do have different outputs so you might have to get the right cable - some have the old D-SUB port - this is an analogue port and can only be used going into a D-SUB port on the TV (normally the D-SUB port is either blue or black and has three lines of holes for pins to go into), then some also have a DVI-D port this is usually a white port with a few pin holes on one side and a + shape on the other side, there is also HDMI - this is just a standard TV connector and pretty much all modern TVs will have this on, and finally some of the high-end laptops also have DisplayPort adapter - this looks similar to a HDMI port but is a bit more squarer and has a corner cut off - and usually has the DisplayPort symbol near it. DVI-D, HDMI and DisplayPort are all digital and so the connectors can be switched from one to the other with the right cable, D-SUB is analogue and can usually only work on a D-SUB connector - there are some cables that convert between D-SUB and HDMI, many are fakes as the only real way to do this is to have a analogue to digital converter box in the equation and these cost a bit more and are generally externally powered boxes. ",
            "date": "Answered January 23, 2020",
            "views": "235",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dimitrius Ostrovskius",
                    "user_href": "/profile/Dimitrius-Ostrovskius"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mouad Alsahel",
                "href": "/profile/Mouad-Alsahel"
            },
            "answer_text": "My laptop is broken screen , and i was using it in my external monitor with Windows 10 OS, And i wanted to format the OS due to system errors, after format, I can’t see anything on the screen, I tried shortcuts to access to the display options and selected the external monitor but nothing appeared! Solutions i tried but didn’t work: Disconnect the display from the laptop so the bios can launch directly the screen to the external monitor Booting to linux system Trying different adapters My pc is work just fine because i use narrator to go between monitor option on windows8.1 How can i fix this? Thanks ",
            "date": "Answered May 28, 2020",
            "views": "91",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amit Mishra",
                "href": "/profile/Amit-Mishra-825"
            },
            "answer_text": "Yes it will work just connect monitor to your laptop uaing either VGA or HDMI cable and it will work. ",
            "date": "Answered January 23, 2020",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ronald Crabtree",
                "href": "/profile/Ronald-Crabtree-1"
            },
            "answer_text": "Yes ",
            "date": "Answered May 28, 2020",
            "views": "40",
            "upvotes": "0"
        }
    ]
}