{
    "title": "Will there be more data science and machine learning jobs in the future? I’m wondering if it is a good career choice. - Quora",
    "tags": [
        "Learning Data Science",
        "Jobs and Careers in Data Science",
        "Data Science",
        "Machine Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Nelson",
                "href": "/profile/Jeff-Nelson-32"
            },
            "answer_text": "Yes and no. Right now and for the next approximately two decades, we will continue to see a major need for machine learning and data science specialists to help apply machine learning technologies to application areas where they aren't applied today. Many businesses simply aren't aware of how machine learning could help them increase profits, and they will need the expertise to help them identify opportunities. However, there's a tendency in the software industry to view every new technology as a checkbox or a silver bullet. For example, many companies may have deployed a Hadoop infrastructure, because they read in the technical media that was the technology of the future. Deployment of such technologies for the sake of deploying the technology isn't going to make any gains for your business, which was the experience of numerous businesses who rushed head first to replace their existing data stores with Hadoop or who rush into data science without a business strategy that bridges how these technologies can be used effectively for business. There will be a demand for professionals who can help bridge the gap between business needs and technological capabilities. In the very long term, though, machine learning will almost certainly become just another core technology API. Some even speculate we will eventually experience what's been called the NLP singularity, in which computers are so good at interpreting the intent of humans that software engineers themselves can be replaced by NLP-fronted machine learning. I feel it's unlikely that will happen before I retire, and probably won't happen for several more decades. ",
            "date": "Answered October 15, 2016",
            "views": "30",
            "upvotes": " View 176 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Divyansh Agarwal",
                    "user_href": "/profile/Divyansh-Agarwal-4"
                },
                {
                    "user_id": "Divyansh Agarwal",
                    "user_href": "/profile/Divyansh-Agarwal-4"
                },
                {
                    "user_id": "Abhinav Maurya",
                    "user_href": "/profile/Abhinav-Maurya"
                },
                {
                    "user_id": "Philippe Bouaziz (Data Scientist/PhD)",
                    "user_href": "/profile/Philippe-Bouaziz-Data-Scientist-PhD"
                },
                {
                    "user_id": "Vladimir Novakovski",
                    "user_href": "/profile/Vladimir-Novakovski"
                },
                {
                    "user_id": "Zeeshan Zia",
                    "user_href": "/profile/Zeeshan-Zia-1"
                },
                {
                    "user_id": "Hamza Bin Khalid",
                    "user_href": "/profile/Hamza-Bin-Khalid"
                },
                {
                    "user_id": "Tushar Kalal",
                    "user_href": "/profile/Tushar-Kalal-1"
                },
                {
                    "user_id": "Saeed Alghabra",
                    "user_href": "/profile/Saeed-Alghabra"
                },
                {
                    "user_id": "Seongyong Jo",
                    "user_href": "/profile/Seongyong-Jo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roman Trusov",
                "href": "/profile/Roman-Trusov"
            },
            "answer_text": "They won’t be as hot as they are now, but the demand will grow. Data has become a new resource and people will seek to utilize it even if they don’t know exactly how. Machine learning will become a usual part of programmer’s resume, data scientists will be as common as accountants. What about the pay level? There’s a huge difference between an R monkey and a guy who chose “knowing what’s up” as his profession. Data scientist who earns big bucks is a guy who always has answers. Why does that happen, what should we do now, all those things. That’s what people pay for. Same for machine learning. ML engineer is not someone who can run standard stuff from sklearn. It’s someone who can write an effective parallel algorithm from scratch and use it for the right job. The demand for these people will always be crazy high - on par with the salaries. ",
            "date": "Answered October 16, 2016",
            "views": "16",
            "upvotes": " View 93 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashwin Vijay",
                    "user_href": "/profile/Ashwin-Vijay-36"
                },
                {
                    "user_id": "Vlad Yevtushenko",
                    "user_href": "/profile/Vlad-Yevtushenko-1"
                },
                {
                    "user_id": "Ankesh Bhowmick",
                    "user_href": "/profile/Ankesh-Bhowmick"
                },
                {
                    "user_id": "Rajavel KS",
                    "user_href": "/profile/Rajavel-KS"
                },
                {
                    "user_id": "Umesha Kevala",
                    "user_href": "/profile/Umesha-Kevala-1"
                },
                {
                    "user_id": "Vahid Saadat",
                    "user_href": "/profile/Vahid-Saadat-1"
                },
                {
                    "user_id": "Sai Mallikarjuna",
                    "user_href": "/profile/Sai-Mallikarjuna"
                },
                {
                    "user_id": "Sudeep Narkar",
                    "user_href": "/profile/Sudeep-Narkar"
                },
                {
                    "user_id": "Fahimeh Pouryani",
                    "user_href": "/profile/Fahimeh-Pouryani"
                },
                {
                    "user_id": "Jalal M. Asif",
                    "user_href": "/profile/Jalal-M-Asif"
                }
            ]
        }
    ]
}