{
    "title": "Will the iPhone 11 come with AirPods? - Quora",
    "tags": [
        "AirPods",
        "iPhones (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stéphane Ruscher",
                "href": "/profile/Stéphane-Ruscher"
            },
            "answer_text": "Thanks for the A2A. And I guess that the question is now about the iPhone 12. And the answer is obviously : NO. Apple just released their quarterly results, and besides the fact that iPhone sales are picking up again thanks, probably, to the iPhone 11, the biggest jump is the wearables category, which includes all headphones (AirPods, AirPods Pro and the Beats products) and the Apple Watch. But basically, the clear message is that the AirPods sold like hotcakes. So, really, including them in the box would kill their most profitable business right now, it doesn’t make much sense. Now, eventually, I wouldn’t be surprised they did end up being the standard earbuds. And you may think that now that they have the AirPods Pro, the standard ones would eventually become default. Look what happened to the Mac : around 2009, the wireless keyboard and mouse became the built in option. I believe it’s too early though. It’s making them far too much money, even the standard ones (especially the standard ones, I would even say). ",
            "date": "Answered January 29, 2020",
            "views": "29",
            "upvotes": " Answer requested by Michael Ireland",
            "upvoters": [
                {
                    "user_id": "Ruslan Babura",
                    "user_href": "/profile/Ruslan-Babura"
                },
                {
                    "user_id": "Thomas Wilkonson",
                    "user_href": "/profile/Thomas-Wilkonson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walt French",
                "href": "/profile/Walt-French"
            },
            "answer_text": "No. I just bought a pair of Etymotic earbuds; they’re GREAT wired earbuds—very high fidelity, very little noise getting in. (They replace a previous set of Etymotic earbuds that disappeared while flying to London.) Why would I then buy an iPhone 11 and pay extra to have AirPods? Yes, my iPhone X is 2 years old; I might like a new one. (I don’t; my X works great.) But if I *DID* want a new iPhone for its great camera, or whatever, why would I pay extra to have AirPods included, since I don’t care for the AirPods enough to pay for them? Conversely, why would Apple give them away at no extra cost? They might, if the iPhone 11 was selling poorly and needed a “sweetener” but I don’t see evidence of that. Nor that Apple customers generally value AirPod-quality and -convenience that they’d pay up So, again: no. I have a hard time trying to imagine the scenario people have in mind to even ask questions like this. ",
            "date": "Answered November 16, 2019",
            "views": "101",
            "upvotes": " View 2 Upvoters "
        }
    ]
}