{
    "title": "Will streaming eventually make cable obsolete? - Quora",
    "tags": [
        "Obsolescence",
        "Cable TV",
        "Streaming Content",
        "Technology Trends",
        "Streaming Video Content"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Paul",
                "href": "/profile/Bill-Paul-10"
            },
            "answer_text": "I have answered something like this before I think, but anyway. The best answer is maybe, but not soon. Currently most streaming services don't offer news, sports, or weather. There's not much of the specialty channel type of programming available on Cable, and no local news and programming. Adding any of that would of course cause streaming prices to rise, and their currently lower subscription price is one of their biggest selling points. I'm familiar with two of these services - Netflix and Amazon's Prime Video. I have just recently done the thirty day trial on Prime, and my impression isn't great. Most of the newer movies seemed to be the type of Chick Flick Rom-coms that can be found on many of the channels on basic cable. They do offer some original programming, but most of it was in the form of series, and I didn't have time to follow any of that on my short trial period. Netflix is better, but also more expensive than Prime. They've been in the business longer and do offer some really good original programming as well as (in my opinion) a better selection of movies. Even still, the shortcomings listed in my opening paragraph do apply to this service also. Streaming does have the advantage of portability - you can access your subscription anywhere you can get wi-fi, and watch it on any type of internet connectable device. The 27 years I spent in the Cable TV business taught me that customer perception is that there is always some better programming they are missing, and that no matter how many channels you offer, there will still be complaints that there is nothing to watch. I think that after the shine of lower prices wears off, streaming services will find themselves facing the same complaints. ",
            "date": "Updated March 30, 2019",
            "views": "393",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Luke Olson",
                    "user_href": "/profile/Luke-Olson-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Hannent",
                "href": "/profile/Bob-Hannent"
            },
            "answer_text": "The advantage of broadcasting is that you can deliver to everyone at a fixed cost, as you add more subscribers you get better value for money. In streaming as you add more customers your cost of delivery increases but at least you can apply some economy of scale elsewhere and if you have few or no viewers then your costs are substantially reduced. The thing about Netflix is that it is a video on demand provider, and a large portion of viewing is still live TV. Sports is a massive market and other live entertainment such as reality TV still drives massive audiences. For cable TV there will need to be some changes to the way they do business, but fundamentally they will have a business in being a pipe for media because they can offer competitive broadband offerings with the same infrastructure. Some cable companies are already planning on changing the delivery of their channels from the current technology to an IP delivery model. Satellite delivery is slightly different because they don't have a return path for internet traffic but also the economy of scale is greater because a single satellite can hit a very wide area with one footprint, no digging or running cables. Satellites can reach areas that are uneconomical for cable or phone providers so they will remain the choice for people who are unable to get decent Internet connectivity. The market size of people who are under served by internet providers will shrink over time so there could be a slow decline for satellite operators but probably with enough time for the smart ones to adapt. ",
            "date": "Answered July 27, 2017",
            "views": "18",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris Keath",
                    "user_href": "/profile/Chris-Keath"
                },
                {
                    "user_id": "Roy Delaney",
                    "user_href": "/profile/Roy-Delaney-3"
                },
                {
                    "user_id": "Chang Liu",
                    "user_href": "/profile/Chang-Liu-362"
                },
                {
                    "user_id": "Mark Allen",
                    "user_href": "/profile/Mark-Allen-15"
                },
                {
                    "user_id": "Scott Helms",
                    "user_href": "/profile/Scott-Helms-8"
                },
                {
                    "user_id": "Nick du Plessis",
                    "user_href": "/profile/Nick-du-Plessis"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                }
            ]
        }
    ]
}