{
    "title": "Will the internet replace libraries? - Quora",
    "tags": [
        "Libraries and Librarianship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nancy Ashmore",
                "href": "/profile/Nancy-Ashmore"
            },
            "answer_text": "Although they may seem on the surface to serve the same purpose, the internet as it is will not replace libraries. There are many physical items that are not yet on the internet, although there may come a time when they are. What the internet cannot provide is a place for people to be, programs for people to attend, people who can help evaluate information and locate exactly the information needed, and a connection to the internet for those who have none. So many assumptions are made by those who think the internet is a replacement for a library. Not everyone has access to the internet, and not all the information on the internet is real/valid/complete. In addition, many sources of really good information are behind paywalls, and libraries often have subscriptions to those so that patrons can use them for free. One other major issue is that not everyone has a comfortable place to hang out and learn/study or just relax. There are places you can do that, but most of them require that you at least buy a cup of coffee. The library is free. We are the “third place” that someone can be for free when they are not at work/school and not at home. ",
            "date": "Answered January 18, 2018",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devika Ahlawat",
                    "user_href": "/profile/Devika-Ahlawat"
                },
                {
                    "user_id": "Ellen Whitherways",
                    "user_href": "/profile/Ellen-Whitherways"
                },
                {
                    "user_id": "Melinda Rodriguez",
                    "user_href": "/profile/Melinda-Rodriguez-15"
                },
                {
                    "user_id": "Simone Hindin",
                    "user_href": "/profile/Simone-Hindin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kerry Hamlett Fountain",
                "href": "/profile/Kerry-Hamlett-Fountain"
            },
            "answer_text": "If the rest of the world is like my small communities, then no the internet will never replace actual libraries. People come into our libraries for far more than just viewing or reading material. They come in for suggestions, for programs, for computers, wifi and for social interactions with others. Plus I have many people who absolutely love actual books- they are sure that ebooks will never replace actual books for them. Add in- how often have you gone and searched for something only to get information overload. We can help with that! ",
            "date": "Answered July 24, 2017",
            "views": "990",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Monica Brown",
                    "user_href": "/profile/Monica-Brown-58"
                }
            ]
        }
    ]
}