{
    "title": "Will the future wars be fought by robotic soldiers? Is it truly possible? - Quora",
    "tags": [
        "Robotics",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Bedu",
                "href": "/profile/Alex-Bedu"
            },
            "answer_text": "i think so, but small wars and secret operations. since it is economically not beneficial to disrupt and destroy your enemy poweful country, this will have sound side effect to anyone including you (golbal economy is here). large wars will be (and already are) in other space, by strategy and orchestration in: ideology, lies and opinion manipulation using mass media,targeting and influencing of especially young people world picture,cultural and arts exchange, non-commercial organizations activities,buying, bribing, intimidation and threatening of local elites and powers,lobby, capital transfer, loans, sanctions, diplomacy efforts, etc,at last, leader change by secret operation.",
            "date": "Answered June 17, 2018",
            "views": "205",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abhishek Oza",
                    "user_href": "/profile/Abhishek-Oza-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Traviors Harris",
                "href": "/profile/Traviors-Harris"
            },
            "answer_text": "This will not happen for quite a while, if and when it does they computer will still be controlled by humans. Computers are set up to react to a written code. In time of war, most things will be unpredictable. Bad guys will need to be interrogated. Distinguishing civilians from “bad guys” would be almost impossible in 3rd world countries with no uniforms. So it won't completely take humans away from the battlefield. IMO ",
            "date": "Answered April 13, 2017",
            "views": "168",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Soumyadipta Majumder",
                    "user_href": "/profile/Soumyadipta-Majumder"
                }
            ]
        }
    ]
}