{
    "title": "Will technology save humans from climate change? - Quora",
    "tags": [
        "Climatology",
        "Climate Change",
        "The Environment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Svilen Fal",
                "href": "/profile/Svilen-Fal"
            },
            "answer_text": "Let’s walk down the path a bit. Climate Change is how the Earth’s climate systems are changing from human impacts. It is the results of the advances of human technology. The burning of fuel and its byproducts, the ways we change how the land is. Both of these have increased by large amounts over roughly the last 50–300 years. Humans of some sort have been around for a few million years, but ones like us only for a few tens of thousands of years. Most of both of those has been during climatic conditions colder than now. But the major strides in human advancement have taken place though only over about the last 12,000 years, during the Holocene, where the climate has been pretty much like it is now; around 14–15 degrees Celsius. The stability of this interglacial has allowed many things to happen. Our history goes back about 5,000 years with the rise of writing, but it’s only been since the 1700s, more so since the 1800s, and even more so since the mid 1900s, that the bulk of the technological advances have occurred. The negative aspects of a changing climate (regardless of what tenths or few degrees that is, and regardless of exactly how much is due only to us) are many, depending on if the change is up or down, the time frame and the aspect. But of course not every aspect is negative or negative to everyone. And many of the impacts are not to humans, but to other life both animal and vegetable, many of which we certainly rely upon. Other of the impacts are to the planet itself, which on their own are immaterial (it is not alive or feeling) but the results of which many times have an effect upon the living things upon it. So, the rapid changes to the environment since the 1850s and especially since the 1970s, are the results of science, knowledge, learning, technology. We’re smart enough to create the things that can be damaging and likewise to recognize the damage, it’s difficult to do one without noticing the other. It would seem we’re also smart enough to be able to figure out ways to either adapt to or mitigate the damage. The advance of technology is not stagnant, it grows, it improves, it becomes more efficient and faster and less expensive and cleaner. Not perfectly, not without cost, not as quickly as some imagine it should. The world in 2018 isn’t like the one in 1968. The world in 2068 won’t be like the one now. The question is, what would lead us to believe that technology won’t solve the same problems it created? There is awareness, work being done on all sorts of areas that can solve various problems, research and development continues. The answer is that more than likely technology will solve the issues that exist, but just remember; scientists provide knowledge and information, it’s the people implementing policy (in both government and business) and the general populace though a variety of methods, that will make it work. If that’s true or not, only time will tell. But again, what would make us think things won’t continue to get better? ",
            "date": "Answered November 25, 2018",
            "views": "266",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kachalla Maina",
                    "user_href": "/profile/Kachalla-Maina"
                },
                {
                    "user_id": "Theodore Hildebrandt",
                    "user_href": "/profile/Theodore-Hildebrandt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Wheatley",
                "href": "/profile/Dave-Wheatley-4"
            },
            "answer_text": "Probably not, but it’ll make a few people an enormous amount of money. Climate Change isn’t a problem to be solved; it’s been going on for 4.5 billion years, and life deals with it. “None so outraged as a Vested Interest masquerading as a Moral Principle.” By making it a problem, it now allows the Vested Interests to create solutions that will make them money/ gain them power. Remember, all the ‘problems’ of climate change are models; the actual weather isn’t bad, and weather events - hurricanes, droughts, floods, tornadoes and etc - are less extreme than they’ve been in the recent past. The Antarctic isn’t melting; Greenland’s edges might be, but it’s interior has waaaaay thicker ice. The solution is trees by the billion, not ‘schemes’. The IPCC/governments/Vested Interests want $100 Trillion to be spent by 2100. Currently we are spending $1 Billion PER DAY to try and ‘solve the climate change problem.’ If we spent a few million $s a day only doing research into technologies that could help, we’d save trillions of $s and only spend the money on solutions that work. (Moore’s Law will bring the cost of any technological fix plummetting in only 2–3 decades.) In the meantime, plant trees. (And fire 99% of the activists/politicians/civil servants/’scientists’ who are too vested in climate change to ever tell the truth/do the right thing.) ",
            "date": "Answered November 17, 2018",
            "views": "333",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jaime Rosario",
                    "user_href": "/profile/Jaime-Rosario-6"
                }
            ]
        }
    ]
}