{
    "title": "Will computer skills be in demand in the next 5 years? - Quora",
    "tags": [
        "Computer Skills",
        "Skill Set",
        "Job and Career Skills",
        "Technology Trends",
        "Skills",
        "Computers",
        "Technology",
        "Computer Programming",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Juan Orozco Villalobos",
                "href": "/profile/Juan-Orozco-Villalobos"
            },
            "answer_text": "Yepp. Computers aren’t going anywhere, if anything, they will be in more demand than they are today. This doesn’t only apply to people in the IT field, but to almost every worker. Take my dad as an example: He’s a school principal who worked most of his life as an elementary school teacher. We bought our first computer in 2003, where he started the tortuous procedure of learning how to use a computer. In the beginning, he did stuff like printing a page, correcting it with liquid paper, scanning it and working on the digitized version. After a while, he learned how to use image edition tools and saved lots of time. The thing is, after a couple of years, he became pretty good at using the computer, and now he can do almost anything he needs with it. At the time it didn’t look like such an important thing, as most of the education system still used paper documents for most tasks, but in the last years they digitized everything, and now using a computer is a must. Currently, half of the teacher population can use the computer, but the other half is still in need of gaining computer literacy. This leaves you with half of the teachers who are not adapted to work properly on the current system, and that’s a huge issue in many schools. So, that’s the current situation of teachers in a small Central American nation, if you extrapolate the example for other areas in the following decades you can get an idea of how important computer literacy will be. Learn computer skills, my dad is very happy he did it on time. ",
            "date": "Answered September 26, 2019",
            "views": "103",
            "upvotes": " Answer requested by Jimmie Perry III",
            "upvoters": [
                {
                    "user_id": "Doug Wilson",
                    "user_href": "/profile/Doug-Wilson-20"
                },
                {
                    "user_id": "Jimmy Kuo",
                    "user_href": "/profile/Jimmy-Kuo-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "F Allen Morgan",
                "href": "/profile/F-Allen-Morgan"
            },
            "answer_text": "No one knows for sure, but if they are in demand now, then its a reasonable indication that they will be in demand in the near term. However, if your looking at this only to get a well paying job, I’d suggest you first look into yourself. Do you really want to be a techy? It can be boring and tedious, may have lots of meetings, not everyone is cut for it, deadlines, crunch times, hours/weeks staring at a monitor, trying to figure out why your code doesn’t do what you think it should…just to find out that your code is wrong, one of your steps in code is wrong, your approach is wrong…or the framework your using doesn’t support that feature! ARGH!!!! And you ask about 5 years time, what about 30 years…40 years. Don’t pick a career because some idiot like me, said it should be a good career. Remember, using a baseball analogy, your swinging the bat at a pitch that may be a curve ball, make your swing count! ",
            "date": "Answered September 19, 2019",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Trudy Grill",
                "href": "/profile/Trudy-Grill"
            },
            "answer_text": "Most everything will be computerized including Robots. So I don't see computer professionals going away. Some jobs such as The Medical field in Stem cell research, Energy Consultants, Memory Surgeons, Veterinarians, Dentists, Pharmacists, Pile-Drivers, Cost estimaters, Brick masions, Stone masions are just a few I see for future demands. Especially as people age n retire. ",
            "date": "Answered September 19, 2019",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dennis Gorelik",
                "href": "/profile/Dennis-Gorelik-1"
            },
            "answer_text": "Yes, computer skills will definitely be in demand in the next 5 years and beyond. However basic computer skills may become part of “basic requirements” (like ability to read). So it may be hard to get any job without basic computer skills. ",
            "date": "Answered September 19, 2019",
            "views": "26",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Thomas Pollak",
                "href": "/profile/Thomas-Pollak-1"
            },
            "answer_text": "Computer skills are now immutable. Primary among these is logical thinking. Computers are as necessary as water. Take them away and what have you got? ",
            "date": "Answered September 19, 2019",
            "views": "3",
            "upvotes": " Answer requested by Jimmie Perry III"
        },
        {
            "author_info": {
                "name": "Federico Navarrete",
                "href": "/profile/Federico-Navarrete-1"
            },
            "answer_text": "Yes, they would, this is not going to stop so soon in the next 10 or 30 years, but I'll check some Low-Code Platforms too to have wider options. ",
            "date": "Answered September 19, 2019",
            "views": "13",
            "upvotes": " Answer requested by Jimmie Perry III"
        },
        {
            "author_info": {
                "name": "Cody Jackson",
                "href": "/profile/Cody-Jackson-13"
            },
            "answer_text": "A2A Programming, AI/ML, cyber security (especially for operational technology), data analysis, and project management ",
            "date": "Answered September 19, 2019",
            "views": "17",
            "upvotes": " Answer requested by Jimmie Perry III"
        }
    ]
}