{
    "title": "With our current technology, could humans end all life on Earth? - Quora",
    "tags": [
        "Earth (planet)",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Barry",
                "href": "/profile/Jeff-Barry-11"
            },
            "answer_text": "RE: Can humans destroy the Earth with current technology? Yes, we can destroy the entire Earth with current technology. The deployment of said technology would be massive and suicidal, and achieving the “goal” would take a while, but, in the end, we could do it. How? By altering the course of a large asteroid to put it into a highly elliptical orbit so that the asteroid would impact the Earth on its way in towards the sun. It was a 6 mile wide asteroid which wiped out the dinosaurs. Just think what a 100 mile wide asteroid could do. Try the asteroid “16 Psyche” on for size. At 120 miles wide and being highly metallic it has about 1% of the mass of the entire asteroid belt, so if you could alter its orbit to cross that of Earth, well, bye bye Earth. After all, it would be AT LEAST 8000 times more massive than the dino destructor and probably be moving faster because of its higher-than-usual asteroid apogee. BOOM! How does one change the orbit of an asteroid? By using massive amounts of nuclear power to apply thrust over a long period of time. You would use something like a super-sized Gravity tractor, Ion Beam Shepherd, or Mass driver to slowly push on on the asteroid in just the right way to maneuver it properly so as to satisfy our self-destructive urges. I’m not sure that even “16 Psyche” would blow the Earth apart, but surely that 8000 times more massive bit would kill every thing on Earth and leave our planet a smoking wreck. BUT, if you insist on obliterating the Earth you can use similar technologies to slow the Earth so it would fall into the sun itself. I hope that would count as destroying the Earth. All of the technologies noted above already exist. Future “improvements” to this dooms-day technology would just make our suicide happen faster and more easily.  If destroying all life on Earth is your goal is your goal then you could try: Engineering and deploying a robust killer virus or toxin which works on all living things in all environments (except maybe for the rock-eating bacteria which live miles down in the crust of the Earth).Create Artificial Intelligence to design and build weapons of mass destruction, and then hand over control of those weapons to the AI monstrosities. (I have no doubt AI will happen. The military of various nations will want it to use as a super weapon, so it WILL happen.)Build hundreds of thousands or millions of thermonuclear “dirty bombs”, distribute them around, and set them all of at once, preferably during a supervolcano eruption. Yellowstone looks like its next eruption is set to happen in 100,000 years or less, so perhaps simultaneously detonating several thousand high-yield H-bombs buried in the existing caldera would get Yellowstone to go super today. The resulting volcanic winter and nuclear fallout will make it very hard for life.Personally speaking, I would appreciate it if any mad man would want to try to set up any of the above would go live on Mars. You can have Mars. Really. I would not try to stop you from migrating to Mars.  Another “answer” to this question states (with [corrections]): Yes. Only small amount of nuclear [substance] will [be sufficient] [to destroy the Earth,] like uranium. This statement is spectacularly wrong. Aside from the bad spelling and grammar, it should also be noted that all of those “nuclear substances” are already there and have been there since the earth was formed, but yet the Earth is not yet destroyed. In fact it is just the opposite. Were there no uranium, thorium and potassium 40 then the earth would have cooled MUCH faster so there would be no convection current in Earth’s mantle so there would be no dry land let along continents, so the early oceans would have completely covered the Earth. (Mantle convection) There would also be no hydrothermal vents where life formed so there would be no life. (Abiogenesis) And there would be no magnetic field around the Earth so the solar wind would have eventually removed the atmosphere and water (which has been the fate of Atmosphere of Mars). So without radioactive decay the earth would be a dead, barren rock. But lets consider that he meant destruction of all life on Earth, not destruction of the Earth itself. Even so he is dead wrong. He completely ignores the fact that these materials he complains about have always been in our soil and rocks, and in the ocean. It is no “small amount” which is already there and has been there forever, for example the 4.5 billion metric tons of naturally occurring uranium in the oceans or the 63 billion metric tons of naturally occurring, biologically absorbable, radioactive Potassium-40 in the oceans. It’s been there forever. So life started in spite of that “small amount” of “nuclear substance”, and evolution has provided various ways of adapting to said “nuclear substance” (and UV radiation from the sun). Here is a simple way to consider the ACTUAL effects of natural and man-made radiation, Banana equivalent dose, rather than the ignorance (or maybe lies) in said “answer”. ",
            "date": "Answered September 14, 2017",
            "views": "21",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faniel M. Soneira",
                    "user_href": "/profile/Faniel-M-Soneira"
                },
                {
                    "user_id": "Mihai Valentin Geamanu",
                    "user_href": "/profile/Mihai-Valentin-Geamanu"
                },
                {
                    "user_id": "Debdutta Paul",
                    "user_href": "/profile/Debdutta-Paul-দেবদত্ত-পাল"
                },
                {
                    "user_id": "Oli Henderson",
                    "user_href": "/profile/Oli-Henderson-2"
                },
                {
                    "user_id": "Suraj Badrayan",
                    "user_href": "/profile/Suraj-Badrayan"
                },
                {
                    "user_id": "Reena Venkataraman",
                    "user_href": "/profile/Reena-Venkataraman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Sah",
                "href": "/profile/Ashish-Sah-58"
            },
            "answer_text": "Yes. Only small amount of nuclear subtance will suficient for it like uranium. A person can be exposed to uranium (or its radioactive daughters, such as radon) by inhaling dust in air or by ingesting contaminated water and food. The amount of uranium in air is usually very small; however, people who work in factories that process phosphatefertilizers, live near government facilities that made or tested nuclear weapons, live or work near a modern battlefield where depleted uranium weapons have been used, or live or work near a coal-fired power plant, facilities that mine or process uranium ore, or enrich uranium for reactor fuel, may have increased exposure to uranium. Houses or structures that are over uranium deposits (either natural or man-made slag deposits) may have an increased incidence of exposure to radon gas. The Occupational Safety and Health Administration (OSHA) has set the permissible exposure limit for uranium exposure in the workplace as 0.25 mg/m 3 over an 8-hour workday. The National Institute for Occupational Safety and Health (NIOSH) has set a recommended exposure limit (REL) of 0.2 mg/m 3 over an 8-hour workday and a short-term limit of 0.6 mg/m 3 . At levels of 10 mg/m 3 , uranium is immediately dangerous to life and health. Most ingested uranium is excreted during digestion. Only 0.5% is absorbed when insoluble forms of uranium, such as its oxide, are ingested, whereas absorption of the more soluble uranylion can be up to 5%. However, soluble uranium compounds tend to quickly pass through the body, whereas insoluble uranium compounds, especially when inhaled by way of dust into the lungs, pose a more serious exposure hazard. After entering the bloodstream, the absorbed uranium tends to bioaccumulate and stay for many years in bone tissue because of uranium's affinity for phosphates. Uranium is not absorbed through the skin, and alpha particles released by uranium cannot penetrate the skin. Incorporated uranium becomes uranylions, which accumulate in bone, liver, kidney, and reproductive tissues. Uranium can be decontaminated from steel surfaces and aquifers. ",
            "date": "Answered September 13, 2017",
            "views": "217",
            "upvotes": "0"
        }
    ]
}