{
    "title": "With our current technology, how long would it take us to get to Mars? - Quora",
    "tags": [
        "Mars (planet)",
        "Space Travel",
        "Space Exploration",
        "Outer Space"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Albertson",
                "href": "/profile/Christopher-Albertson-3"
            },
            "answer_text": "About 9 months. Here is how to calculate this in your head. Impress your friends with you ability to compute the time to Jupiter or one of Saturn’s moons The lowest cost route no matter what technology you have will always be the Hohmann transfer orbit. This is an elliptical orbit around the sun at the highest point you are at the orbit of Mars and at the lowest point you are closer to the sun at Earth’s orbit. As you orbit the sun your distance from the sun varies between the of Earth and that of Mars. Once in this orbit, you will continue almost forever with not more fuel. Just like the way the Earth (and Mars) orbit the sun with no need for fuel. So in effect, the Hohmann transfer orbit is intermediate between the earth and Mars. Now here is how to very roughly calculate the trip length: The Earth orbits the Sun in 12 months. Mars takes roughly about twice as long or 24 months. So an intermediate orbit takes about the average of the two or about 18 months. So that is 18 months to fly to Mars and return without stopping or 9 months for half a round trip. Warning: no not use this crude estimate to plan an actual trip to Mars. But it is close enough and this method allows anyone to quickly use mental math to estimate trips anywhere in the solar system assuming you can remember the length of a year at the place you are going to. One more bit of detail. If you launch from Earth you want to go to Mars, not just intersect mar’s orbit. So you have to plan the timing so that mars will be there the same time as you. This means you can only launch about once every two years. Same with coming home to Earth. You have to wait to launch the return trip so that Earth will be there when you are. Summary: to get from Planet A to Planet B, say you want to fly from Mars to Jupiter, take an average of the two planet’s year and divide by two. That is very roughly about the time for a Hohmann route. There are faster routes but they use much more fuel or for a fixed amount of fuel they take a much smaller payload. Hohmann will be the best way if cost matters more than time. Also, there are faster routes using gravity assist fly-bys. but these are complex and only apply to the plants farther than Mars. For all practical purposes travel between Earth and Mars will use Hohmann until we invent fusion power plants that can work in deep space in maybe the 22nd century. With foreseeable rockets in the future maybe the travel can be 6 months using a more eccentric Hohmann transfer orbit. But the payload size is always reduced. I think in the far future humans will take the faster route and cargo will take the slower Hohmann route. But that is not until many decades from now. In summary, travel in the solar system ALWAYS means the spacecraft is in orbit around the sun such that the spacecraft’s orbit intersects both the origin and destination plants. The time to complete an orbit is determined by the average distance from the Sun. You have to fly about 1/2 of this orbit to get from one planet to another. ",
            "date": "Updated July 25, 2019",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Onur Yılmaz",
                    "user_href": "/profile/Onur-Yılmaz-18"
                },
                {
                    "user_id": "Andrew Mitte",
                    "user_href": "/profile/Andrew-Mitte"
                },
                {
                    "user_id": "Lisa Jain Thompson",
                    "user_href": "/profile/Lisa-Jain-Thompson"
                },
                {
                    "user_id": "Rey Dalsie",
                    "user_href": "/profile/Rey-Dalsie"
                },
                {
                    "user_id": "Simon Kepp Nielsen",
                    "user_href": "/profile/Simon-Kepp-Nielsen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Courtney Seligman",
                "href": "/profile/Courtney-Seligman-1"
            },
            "answer_text": "No rocket currently exists that can send anyone to Mars. Period. However, if there were such a rocket, it would take a few months (at most seven) to get there, depending on the trajectory chosen. A long transit time uses less fuel per pound of payload, but requires more pounds of payload to keep the crew alive long enough to get there. A short transit time reduces the supplies required, but takes far more power per pound of payload, so there is (1) a much lower likelihood of any imminent launch succeeding, and (2) a pretty high chance that when the trip can be made, the transit time will be just a few months, instead of the least-energy-orbit value of 7 months. ",
            "date": "Answered July 20, 2019",
            "views": "265",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Andrew Mitte",
                    "user_href": "/profile/Andrew-Mitte"
                }
            ]
        }
    ]
}