{
    "title": "Would it be possible to quantify the energy produced by all of the tiny 'junk' device solar panels in the world (for example, a solar powered garden ornament)? - Quora",
    "tags": [
        "Photovoltaics",
        "Solar Panels",
        "Solar Energy",
        "Sustainable Technology",
        "Alternative Energy",
        "Energy (physics)",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glen McMillian",
                "href": "/profile/Glen-McMillian-2"
            },
            "answer_text": "The key piece of information would be to have a good estimate of how many such devices are sold per year, and how long they last, on average. Somebody who is seriously into following the solar panel markets as an analyst could probably come up with this data, within say a range of twenty percent either way. It might be possible to get a much more accurate estimate. After that it would be simple straight arithmetic to come up with an estimate. You take into account hours working per day, average out put, average life expectancy, etc. ",
            "date": "Answered October 23, 2020",
            "views": "444",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Piggott",
                    "user_href": "/profile/David-Piggott"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Irelan",
                "href": "/profile/Bob-Irelan"
            },
            "answer_text": "Q: Would it be possible to quantify the energy produced by all of the tiny \"junk\" device solar panels in the world (for example, a solar powered garden ornament)?A: Perhaps if one had access to the annual small solar cell production volume in watts and then call a couple years the average life span, times 20% effective capacity times the number of hours in the year. Good luck on finding the first term in the calculation ",
            "date": "Answered October 21, 2020",
            "views": "518",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Kes",
                    "user_href": "/profile/John-Kes"
                }
            ]
        }
    ]
}