{
    "title": "Would it be possible to get internet access on the moon from a satellite orbiting Earth? - Quora",
    "tags": [
        "Internet Access",
        "Satellite Communications",
        "Orbital Mechanics",
        "Satellites",
        "Outer Space",
        "Earth (planet)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Schwertfeger",
                "href": "/profile/Eric-Schwertfeger"
            },
            "answer_text": "If the satellite were designed to provide for it, yes, but without that, then not likely. The first issue is the directionality of the transmission. Internet satellites try very hard to focus their transmission and reception on the Earth, often a specific part of the Earth, and the Moon is not in the right direction unless it’s actually behind the Earth, resulting in the Earth blocking the transmission. The second issue would be receiver sensitivity on both ends. The Moon is almost ten times farther away than the Earth, which means that the receivers would be seeing about 1% of the signal from the Moon as from the Earth. The third issue would be that the round trip packet time might be too long to the moon, since it’s far away enough to add about two seconds to the round trip time just due to speed of light limitations. Now, I think most satellite internet protocols could cope with that much latency, but I don’t know for sure, so this is only maybe an issue. All in all, I don’t think you’d be tapping into satellite internet that’s intended to service the surface of the Earth from the Moon. ",
            "date": "Answered June 22, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Holl",
                "href": "/profile/Richard-Holl-2"
            },
            "answer_text": "Would it be possible to get internet access on the moon? On the near side? Absolutely but why bother with a satellite? If it was orbital it would be masked by the earth for 30 to 40 minutes every 90 minutes. GEO you get half a day and communicating from earth gives you 8 hours a day unless you talk to NASA into using their DSN. That gives you 24 hours. Just use Sband and dedicated modulation and really big high gain antennas. The lag will be a pain in the ass but streaming will work fine. It won't be ultra HD unless you buffer it for a few days. I assume you have pretty deep pockets or you wouldn't even consider it. I suggest just staying here on earth if you plan on using the web but to each his own. ",
            "date": "Answered June 22, 2020",
            "views": "48",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "Amos Cartell",
                    "user_href": "/profile/Amos-Cartell"
                },
                {
                    "user_id": "Wayne Boyd",
                    "user_href": "/profile/Wayne-Boyd-2"
                }
            ]
        }
    ]
}