{
    "title": "Would it be possible to replace WiFi with radio waves to get the internet, and how do you do it? - Quora",
    "tags": [
        "Radio Waves",
        "Radio",
        "Waves (physics)",
        "Wi-Fi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Westley Julio",
                "href": "/profile/Westley-Julio-1"
            },
            "answer_text": "I assume you mean “radio” in the colloquial sense of AM/FM transmissions and that ‘data’ is computer network data. These towers are generally massive and reach extreme distances from a single place. Sounds like a good way to transmit data right? It is technically possible. As long as a transmitter is setup to send messages in a way that the receiver can understand them, you can have data sent across just about any radio wave. At the technical level, while AM/FM frequencies travel very far, it’s due to massive (tall) infrastructure and a bit of power. While the receivers would all be able to “hear” the tower, they’re going to have a MUCH harder time trying to send messages back. At the logistical level, the FCC (or comparable government entity outside the US) allocates certain frequencies for certain uses. This wouldn’t be a permissible use. If it were permissible it wouldn’t it be a good idea as interference may be a problem; data requires much more signal integrity to be usable. If you didn’t hear a piece of data from the tower, the receiver wouldn’t be able to ‘tell’ the tower its missing something. So instead of all that headache, you would use cell towers instead of “radio” towers (Both use radio waves, just of different frequencies, powers and communication standards). They have less range per tower, but more of them. This allows the clients to also send data TO the tower and the tower able to ‘hear.’ The FCC already allows the frequencies for data purposes and is optimized for it and not subject to undue interference. You could, however, use AM/FM frequencies to send data to clients, but for data from the clients to the network, use a different wireless or wired technology. This would solve most of the issues with the idea. However, also unnecessarily complex when there are better solutions already in use. It would be a great thing to experiment with at home however. ",
            "date": "Answered April 20, 2017",
            "views": "59",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nikolaj Plotek",
                    "user_href": "/profile/Nikolaj-Plotek"
                },
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "Rodrigo Mendes",
                    "user_href": "/profile/Rodrigo-Mendes-40"
                },
                {
                    "user_id": "Arjoon Timsina",
                    "user_href": "/profile/Arjoon-Timsina"
                },
                {
                    "user_id": "Kenneth Lundgren",
                    "user_href": "/profile/Kenneth-Lundgren"
                },
                {
                    "user_id": "Nik Mish",
                    "user_href": "/profile/Nik-Mish"
                },
                {
                    "user_id": "Ablfzl Rashid",
                    "user_href": "/profile/Ablfzl-Rashid"
                },
                {
                    "user_id": "Amr Abdelrahman Badawy",
                    "user_href": "/profile/Amr-Abdelrahman-Badawy"
                },
                {
                    "user_id": "Jock McTavish",
                    "user_href": "/profile/Jock-McTavish"
                },
                {
                    "user_id": "Samed Sarı",
                    "user_href": "/profile/Samed-Sarı"
                }
            ]
        },
        {
            "author_info": {
                "name": "John McDermott",
                "href": "/profile/John-McDermott-2"
            },
            "answer_text": "The question is very incomplete, even including that it is fundamentally flawed. To ask if X new technology can replace Y old technology for Z application is all well and good. The answer will either be yes or no. But that's not the point. We also need to know what problem is trying to be addressed. What is wrong with Y such that a new technology X is needed? Y (WiFi) clearly works and is an economic solution in a wide variety of cases. So what problem exists that Y is inadequate and a new X is needed? If the problem isn't defined, then inventing X is probably doomed because no-one will use it. So, in this case we can also say WiFi is wireless radio waves, that's what the wi bit in the name means. And there are many other wireless methods to access the Internet available. They each solve particular problems for certain groups. eg microwave links provide site to site high bandwidth where fibre optic is not available. WiFi is cheap and ubiquitous, so replacing it for the majority of purposes is unlikely to be successful. If few people consider WiFi flawed they won't adopt any alternative. Q: “Would it be possible to replace WiFi with radio waves to get the internet, and how do you do it?” ",
            "date": "Answered April 9, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bob Hannent",
                    "user_href": "/profile/Bob-Hannent"
                }
            ]
        }
    ]
}