{
    "title": "Would a smartphone have been able to operate without internet 200 years ago? - Quora",
    "tags": [
        "Mobile Phones",
        "Android Devices",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Burke",
                "href": "/profile/Christopher-Burke-3"
            },
            "answer_text": "Smart phones are \"cell phones\", and such phones don't call each other directly. The voice signal passes through a cellular radio network, which is a different kind of network than the internet. 200 years ago, who would you call? Suppose, though, that you went back in time 200 years with a pair of smart phones, you'd also need to take either a microcell or a wifi network, along with any necessary power and switching equipment, to be able to make calls. When the phone powered up, you might get a message that the SIM can't register with the network. This might disable some functions. Any apps on the phone that run without internet connectivity would still run, as long as you had power. ",
            "date": "Answered April 12, 2015",
            "views": "407",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chandra Shekhar Bhardwaj",
                    "user_href": "/profile/Chandra-Shekhar-Bhardwaj"
                },
                {
                    "user_id": "Shane Tennent",
                    "user_href": "/profile/Shane-Tennent"
                },
                {
                    "user_id": "William Emmanuel Yu",
                    "user_href": "/profile/William-Emmanuel-Yu"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Emmanuel Yu",
                "href": "/profile/William-Emmanuel-Yu"
            },
            "answer_text": "Depends on your definition of work.  1. Can it make a call and send an SMS? No. No network to connect to. No body else with the same technology. 2. Can it use the Internet? No. No network to connect to. No body else with the same technology. 3. Can it connect to any network? No. Networks today that are in use were not invented and deployed at that time. Not even plain old GSM. 4. Can it be charged? No. Power adapters and the charging interface hasn't been invented yet. You run out of juice then you end up with a brick.  But, you can wow your fellow men at that time period by showing your impressive memory (can take down a lot of notes), encyclopedia knowledge (you have a dictionary, a few books and the entire Wikipedia locally stored) and excellent orienteering skills (with the built in sensors). ",
            "date": "Answered April 12, 2015",
            "views": "483",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deepak Gautam",
                    "user_href": "/profile/Deepak-Gautam-26"
                },
                {
                    "user_id": "Bob Hannent",
                    "user_href": "/profile/Bob-Hannent"
                },
                {
                    "user_id": "Tony Li",
                    "user_href": "/profile/Tony-Li-19"
                }
            ]
        }
    ]
}