{
    "title": "Would you buy Samsung M series smartphone over Xiaomi? - Quora",
    "tags": [
        "Samsung Mobile",
        "Xiaomi Mobile Phones",
        "Xiaomi (company)",
        "Samsung (conglomerate)",
        "Samsung Galaxy Phones",
        "Smartphones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kashyap K Mehta",
                "href": "/profile/Kashyap-K-Mehta"
            },
            "answer_text": "NO. I have used both companies product and from experience, I can say that xiaomi devices easily outperform any samsung devices for the same price range. Samsung M series is the first series from Samsung to fulfill desires of Mid range buyers. But why should not prefer Samsung over Xiomi Price decreases over years:This is the main reason why you should not buy samsung product not only compare to Xiomi but also any other brand. Samsung phone prices decreases every three months after launch. Even samsung flagships launched at 70K can sold at 45k after 1.5 years. While Xiomi products not only comes at low cost but reselled at higher price than competitive models. Practical example is Moto G5s priced at 17k and Redmi note 4 at 13k. When you exchange your device than Moto G5s gives 4k discount while Redmi note 4 can cut price by 5k. Low price but high return on xiomi part. Samsung is also behaving same like Moto products at the time of reselling.Battery: It looks like samsung has large battery of 5000 mah for M series compare to Xiaomi products 4000 mah battery. But truth is Samsung uses low quality Lithium ion batteries and Xiaomi uses high quality lithium polymer batteries. After a year Samsung M phones are running out of battery and required two times charging a day because Samsung batteries sucks. I have three Samsung phones at home and nobody wants to use it because battery will die in 2 hours. While Xiomi products has at least 80% capacity of battery even after one year of use regardless of heavy use of device.Updates: Samsung sucks at updates. They either not give update or give update that sucks the user experience. Remember Premium S5 which starts to hang after first update and even 15k devices run smoother than that S5 50k flagship device. Xiomi gives update late but updates are surely provided after optimization. I have redmi note 4 that does not get the android oreo update but similar miui 10 update that can cover most features of oreo. As a tech enthusiastic, I know that oreo will not work best on device and some feature of oreo create problems.Performance: Xiaomi uses Snapdragon processors which is best in mobile market and proven to be best in every aspect of mobile phone performance. Most optimized processors from snapdragon. Samsung uses Exynos (The home made processors), which is made by samsung and sucks at many thing. Also galaxy M contains older Exynos chips. That will not support different new android versions. Exynos is also optimized by software of samsung in phones and after few months problem will start with processors.Display: Why samsung is using TFT display, that is most old technology for display. Xiomi and other OEMS uses LCD display. Also remember that samsung TFT display make much harm to eyes than lcd ever can.Features: MIUI has most features that any android device have. Samsung has sluggiest UI which sucks after six months with much less features.Component Replacement: Imagine you buys two devices. One is Samsung M and second is Xiaomi redmi. Now after two years of use, you replaces some parts of both phones like batteries,charging port and samsung parts will cost you 25% more compare to Xiomi parts.",
            "date": "Answered February 8, 2019",
            "views": "22",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Harsh Shinde",
                    "user_href": "/profile/Harsh-Shinde-9"
                },
                {
                    "user_id": "Masud Reza",
                    "user_href": "/profile/Masud-Reza-28"
                },
                {
                    "user_id": "Rohit Agarwal",
                    "user_href": "/profile/Rohit-Agarwal-897"
                },
                {
                    "user_id": "NAVNEET SAHOO",
                    "user_href": "/profile/NAVNEET-SAHOO"
                },
                {
                    "user_id": "Animesh Nath",
                    "user_href": "/profile/Animesh-Nath-14"
                },
                {
                    "user_id": "Jashanbir Singh",
                    "user_href": "/profile/Jashanbir-Singh-4"
                },
                {
                    "user_id": "T.Praveen Prabhu",
                    "user_href": "/profile/T-Praveen-Prabhu"
                },
                {
                    "user_id": "Sakthivel Veeraiyan",
                    "user_href": "/profile/Sakthivel-Veeraiyan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saurabh Kumar Singh",
                "href": "/profile/Saurabh-Kumar-Singh-58"
            },
            "answer_text": "Flagship Smartphone's from Samsung are great but mid range and entry level Smartphone's from Samsung really sucks , it's quality is poor , I am having a 10 year old Samsung flagship Smartphone it's still working like a charm , but the Samsung Smartphone's that were mid range or entry level they become useless and are really stressful to use it after 1–2 years due to bloatware and many other reasons. While Xiaomi is Providing good quality Smartphone's and really better optimized Smartphone. Anyway Samsung M series has been launched by Samsung to retain it's lost market in entry level Smartphone's , but we shouldn't rush and get M series wait for sometime, and we shouldn't forget blunder done by Samsung in a flagship Smartphone ”Note 7″ and still I personally feel there would be lot of heating issues in M series as it's battery capacity is too high. 5000mAh , even flagship Smartphone are not having this kind of battery just have a look at OnePlus 6 Smartphone only 3300 mAh battery but it lasts longer than most Smartphone having 4000mAh battery. So we shouldn't hurry and get Samsung M series Just wait for real reviews to come out form long term users. ",
            "date": "Answered February 8, 2019",
            "views": "698",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gauraw Singh",
                    "user_href": "/profile/Gauraw-Singh-12"
                },
                {
                    "user_id": "Raghav Singh",
                    "user_href": "/profile/Raghav-Singh-472"
                },
                {
                    "user_id": "Arpana Singh",
                    "user_href": "/profile/Arpana-Singh-129"
                },
                {
                    "user_id": "Amulya Kolusu",
                    "user_href": "/profile/Amulya-Kolusu"
                },
                {
                    "user_id": "SKR Singh",
                    "user_href": "/profile/SKR-Singh-1"
                }
            ]
        }
    ]
}