{
    "title": "Would you rather live in the 1980s or 1990s? - Quora",
    "tags": [
        "1980s",
        "1990s"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Vincent Tucker",
                "href": "/profile/Keith-Vincent-Tucker"
            },
            "answer_text": "Ah, nostalgia is a funny thing. I was born in the mid 70s, so I lived through both. My childhood and early teens in the 80s and my late teens and early adulthood in the 90s. If I had to go back to where I was then, I would choose the 90s. I had a lot of firsts in the 90s. First car, first kiss, first sexual encounter. ( the second two were both in said first car). I met and married my wife. I started the career path that I am still on and doing well at. All of those things, however, were not because it was the 90s, but rather because I was a the right age to do them. If, on the other hand, I had to go back to one as I am now, I would choose the 80s. While it is completely subjective, I feel certain things, like music and fashion, were so much better in the 80s. I would love to see some of the hard rock and metal bands of the time live, when they were still in their peak. Sure, lots of those bands have had a resurgence over the past decade, but they are older and it is not the same as it would have been then. I would love to see girls in tight jeans and crop tops rather than the baggy, frumpy, grunge fashion of the 90s. Still, I like where I am now, with my wife, my children, and my career. I wouldn’t trade it for the world. ",
            "date": "Answered May 3, 2018",
            "views": "377",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Marta Karamuz",
                    "user_href": "/profile/Marta-Karamuz"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Barton",
                "href": "/profile/David-Barton-70"
            },
            "answer_text": "I was born in 1970, so I was a teenager in the 80’s and in my 20’s in the 90’s. Of the two decades I would choose the 1990’s every time. The 1980’s were a grim time, especially in the early part of the decade. There was a pervading sense that the world was going to end - someone might push the button and '…we could all die any day' as a small chap from Minneapolis with a fetish for purple once sang.  Songs about Armageddon were in the charts in the 1980’s ( Songs about nuclear war) in a way they simply were not in the 1990’s. (It's surprising how useful a cultural barometer pop music can be!) When the Berlin Wall came down that existential worry mostly evaporated. The 1990’s felt more optimistic for that reason alone. Even if we did have a brush with WWIII in 1995 (Norwegian rocket incident). …And we had environmental concerns to fret about instead. ",
            "date": "Answered May 3, 2018",
            "views": "319",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Guillard",
                    "user_href": "/profile/Andrew-Guillard"
                }
            ]
        }
    ]
}