{
    "title": "You just created an advanced robot that can do anything. What would you do? - Quora",
    "tags": [
        "Robots",
        "Robotics",
        "Artificial General Intelligence",
        "Artificial Intelligence",
        "Mechanical Engineering",
        "Technology",
        "Engineering",
        "Computer Programming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Marr",
                "href": "/profile/Peter-Marr-1"
            },
            "answer_text": "1 build a law into it’s control that says no matter what I am it’s master. 2 get it to build 1000 of itself. 3 get them to rid the world of all the things I don’t like :- Greed poverty famine hunger criminals unfairness cauliflower Brussel sprouts and French food 4 send a bunch of them to help Mr Musk develop his ideas . 5 get them to work on all the world’s problems by Pareto using resources from the problem creating sources to overcome the problems population control needs to be addressed as well 6 start looking for an heir to my self who would carry on the good works past my timeline who agrees that the way I am going 7 after maybe 20 years cull the planet of the excess of humans humanely if necessary 8 ensure man keeps looking to the stars to move on and survive by being a benevolent force 9 have the round up all the women I think are very desirable and cater a great dinner and weekend retreat once per month 10 I am not a big fan of snakes so I will have to get back to you about their continued existence ! Yes I want to rule the world ! ",
            "date": "Answered October 24, 2020",
            "views": "218",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gaspar Baburyan",
                    "user_href": "/profile/Gaspar-Baburyan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Song",
                "href": "/profile/Jerry-Song-53"
            },
            "answer_text": "I’m assuming by “can do anything”, you mean “can do anything human can do”. I would invite every family members, relatives, friends, and anyone that I know to party, show them what I’ve created - the new form of human (I mean human and not robot). Then, I would go for eternal sleep.  ",
            "date": "Answered October 24, 2020",
            "views": "232",
            "upvotes": "0"
        }
    ]
}