{
    "title": "After how he handled the Coronavirus pandemic, do you still trust Trump’s judgement? - Quora",
    "tags": [
        "Judgment",
        "Trump Presidency (2017-21)",
        "Epidemiology",
        "Pandemics",
        "Infectious Diseases",
        "Presidents of the United States of America",
        "Trump-Pence 2016",
        "COVID-19 (2019-2020)",
        "Donald Trump (politician, business person)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Ru",
                "href": "/profile/Joe-Ru-2"
            },
            "answer_text": "Absolutely, while Democrats were still upset with the failure of an impeachment Trump shut down travel from China. He was called racist and xenophobic. He shut travel from Europe, he was mocked for overreacting… Now the same Democrats who mocked and criticized his every action to minimize the effects of this alleged pandemic are claiming he didn't do enough soon enough. When Trump announced certain existing medications have been having a positive outcome in treating the Wuhan virus he was mocked as providing false hope, when Democrats like Cuomo touted the same exact medications he was praised. Trump can do no good in the Democrats or media's eyes. I wouldn't want anyone else running the country in these trying times. Democrats have criticized Trump as dictator like, yet he hasn't done anything dictator like. Democrats are now upset that he isn't acting more like a dictator. There is no pleasing you people. You have all wished something like this on us to crash the economy to make Trump look bad. ",
            "date": "Answered April 3, 2020",
            "views": "39",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abraham J John",
                    "user_href": "/profile/Abraham-Jebaze-John"
                },
                {
                    "user_id": "Bobby Rupe",
                    "user_href": "/profile/Bobby-Rupe-1"
                },
                {
                    "user_id": "Justin Stressman",
                    "user_href": "/profile/Justin-Stressman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marian Hubbard",
                "href": "/profile/Marian-Hubbard-1"
            },
            "answer_text": "Yes, in fact Trump has impressed me greatly in the last few months. Trump’s handling of the corona virus crisis has encouraged me to believe that he has the ability to take on anything the Presidency of the United States could hand him, including an actual shooting war. He has made the hard calls, such as shutting down flights from China, quickly and with no apparent dithering. He has listened to experts and changed his mind, as when he wanted the country to reopen for Easter and then decided that the end of April was safer. And he has appointed good people to do difficult jobs, and then supported them — Drs. Fauci and Dirx and Rear Admiral John Polowczyk are examples. There are hundreds of other examples of excellent leadership that the country has witnessed over the last few months. Trump has built up a lot of credibility among even Democratic governors for his willingness to work to keep the American people safe, no matter what their political leanings. Despite the cavils of the liberal media, President Trump has done an excellent job of handling the response to the COVID-19 pandemic, and I, among others, have noticed. ",
            "date": "Answered April 3, 2020",
            "views": "159",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mack Hampton",
                    "user_href": "/profile/Mack-Hampton-1"
                },
                {
                    "user_id": "Bruce Blay",
                    "user_href": "/profile/Bruce-F-Blay"
                },
                {
                    "user_id": "Kaydi Rogers",
                    "user_href": "/profile/Kaydi-Rogers"
                },
                {
                    "user_id": "Ernest Pendergraft",
                    "user_href": "/profile/Ernest-Pendergraft"
                },
                {
                    "user_id": "Richard Morgan",
                    "user_href": "/profile/Richard-Morgan-108"
                },
                {
                    "user_id": "Robert Cook",
                    "user_href": "/profile/Robert-Cook-2"
                },
                {
                    "user_id": "William Oblasney",
                    "user_href": "/profile/William-Oblasney"
                },
                {
                    "user_id": "Judy Parker",
                    "user_href": "/profile/Judy-Parker-61"
                },
                {
                    "user_id": "Rich Bartholomay",
                    "user_href": "/profile/Rich-Bartholomay"
                },
                {
                    "user_id": "Keni Bates",
                    "user_href": "/profile/Keni-Bates"
                },
                {
                    "user_id": "Bobby Rupe",
                    "user_href": "/profile/Bobby-Rupe-1"
                },
                {
                    "user_id": "Justin Stressman",
                    "user_href": "/profile/Justin-Stressman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard George",
                "href": "/profile/Richard-George-96"
            },
            "answer_text": "Why would anyone trust this boisterous buffoon anyway? He lost a fotrune in business and even in his scams (Trump U, Airlines, Casino, etc). Trump is and always has been an incompetent, functionally illiterate bullshitter who would have been \"on the street\" if it hadn't been for his father's loot. If this country had any balls, they'd have physically removed him from office before thousands had to die and lose their livelihood. A bad game show host isn't a sure bet to lead a nation. ",
            "date": "Answered April 5, 2020",
            "views": "18",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tony Holden",
                    "user_href": "/profile/Tony-Ho-177"
                },
                {
                    "user_id": "Lindsay Livingston",
                    "user_href": "/profile/Lindsay-Livingston-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Stressman",
                "href": "/profile/Justin-Stressman"
            },
            "answer_text": "Yes. He initially tried to keep people calm while they assessed the situation and organized their response. He has then kept people informed every step of the way while trying to balance the larger issues of our long term economic stability with the shorter term goals of slowing the spread of the virus and saving as many lives as possible. Failure to balance all those interests would cost far more lives in the long term and threaten the fundamental well being of our nation and way of life going forward. As a mere human being, he has done an exceptional job of putting together a team of experts and maintaining that careful balance while keeping the American people well informed and reassured going forward. ",
            "date": "Answered April 3, 2020",
            "views": "74",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bobby Rupe",
                    "user_href": "/profile/Bobby-Rupe-1"
                },
                {
                    "user_id": "Steve Andreas",
                    "user_href": "/profile/Steve-Andreas-4"
                },
                {
                    "user_id": "Nana Sandiego",
                    "user_href": "/profile/Nana-Sandiego"
                },
                {
                    "user_id": "John McCormick",
                    "user_href": "/profile/John-McCormick-165"
                },
                {
                    "user_id": "Sasank Samudrala",
                    "user_href": "/profile/Sasank-Samudrala"
                },
                {
                    "user_id": "Victor Copp",
                    "user_href": "/profile/Victor-Copp"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Lee",
                "href": "/profile/Jeff-Lee-354"
            },
            "answer_text": "I NEVER have. And with his behavior since firing the pandemic response team two years ago because they had been organized by Obama, I’m not about to start trusting him now. He’a nothing but an ignorant, unschooled, lying, corrupt little schoolyard bully with a fifth grade reading, writing, speaking and spelling level, who lives to please Putin and the rich. That hasn’t — and NEVER WILL — change. He and his supporters, enablers and protectors are a massive shit stain on the flag of this once great country. And as a people, we deserve a HELL of a lot better. ",
            "date": "Answered April 3, 2020",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Holden",
                    "user_href": "/profile/Tony-Ho-177"
                },
                {
                    "user_id": "Claire DeHart",
                    "user_href": "/profile/Claire-DeHart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Uglum",
                "href": "/profile/Richard-Uglum"
            },
            "answer_text": "Yes, President Trump has shown outstanding judgement and leadership during this crises, as he has during his term as President. As this is uncharted territory, there will undoubtedly be things that should have been done differently or better, but hind sight will reveal them so if this happens again, the lessons will be there for the next President to learn from. ",
            "date": "Answered April 3, 2020",
            "views": "111",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Racki",
                    "user_href": "/profile/John-Racki"
                },
                {
                    "user_id": "James Boyd",
                    "user_href": "/profile/James-Boyd-113"
                },
                {
                    "user_id": "Bobby Rupe",
                    "user_href": "/profile/Bobby-Rupe-1"
                },
                {
                    "user_id": "Nana Sandiego",
                    "user_href": "/profile/Nana-Sandiego"
                },
                {
                    "user_id": "John McCormick",
                    "user_href": "/profile/John-McCormick-165"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barclay Smith",
                "href": "/profile/Barclay-Smith-6"
            },
            "answer_text": "I didn’t trust his judgement before the Pandemic and now that I’ve seen him do virtually everything in his power to insure that more Americans will die than needed to with his denials, his false statements, his dithering when bold action is required, his insults to the medical professionals risking their lives and his absurd request that the Governors “be nice to him” if they want supplies - I don’t trust him now! ",
            "date": "Answered April 3, 2020",
            "views": "15",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ingolf Grueni",
                    "user_href": "/profile/Ingolf-Grueni"
                },
                {
                    "user_id": "Holly Herring",
                    "user_href": "/profile/Holly-Herring-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mack Hampton",
                "href": "/profile/Mack-Hampton-1"
            },
            "answer_text": "Of course. He handled it extremely well. There were over 1,000 Americans dead, including 100 babies from Swine Flu/H1N1 before Obama declared a National Emergency and mobilized the Federal government. Trump hasn’t been perfect, but he’s done a good job in my opinion. ",
            "date": "Answered April 3, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Justin Stressman",
                    "user_href": "/profile/Justin-Stressman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ross Lumbus",
                "href": "/profile/Ross-Lumbus-1"
            },
            "answer_text": "Of course i do. I am not dishonest enough to pretend he was perfect nor needed to be. Nor that he has 100% control over every aspect and every business and every department and every person and supply line and product. The reason i don’t is i am not an idiot ",
            "date": "Answered April 4, 2020",
            "views": "39",
            "upvotes": " Answer requested by Tony Drake",
            "upvoters": [
                {
                    "user_id": "John McCormick",
                    "user_href": "/profile/John-McCormick-165"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Diamond",
                "href": "/profile/Jonathan-Diamond-15"
            },
            "answer_text": "This kind of situation is so far outside the realm of normal experience I don’t see how it alone could serve as a measure of his success. I think, for me seeing the entire government, at both the national and state level abandon post sours my judgment but not necessarily blaming him. Can you say you would have said stay get sick, possibly die, Merica? I would have said go be well too. ",
            "date": "Answered April 3, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cathy Riess",
                    "user_href": "/profile/Cathy-Riess"
                }
            ]
        },
        {
            "author_info": {
                "name": "Milton R Brown",
                "href": "/profile/Milton-R-Brown"
            },
            "answer_text": "Trump has been praised by leaders around the world for his action taking control by quarantine and mobilization to develop cures by thousands of doctors while taking huge action to stall the economic recession and saving families from being foreclosed or evicted. No other leader in the world has done so much or acted as well. ",
            "date": "Answered April 5, 2020",
            "views": "11",
            "upvotes": " Answer requested by Tony Drake"
        },
        {
            "author_info": {
                "name": "Enver Weitz",
                "href": "/profile/Enver-Weitz"
            },
            "answer_text": "Yes. His handling has been phenomenal. Unlike the DNC who's still fighting him in a middle of a crisis of a crisis. The DNC does not have & never had the American people's lives as their number 1 priority. ",
            "date": "Answered April 4, 2020",
            "views": "6",
            "upvotes": " Answer requested by Tony Drake"
        },
        {
            "author_info": {
                "name": "Jay Wil",
                "href": "/profile/Jay-Wil-18"
            },
            "answer_text": "I never trusted his judgement BEFORE the Covid-19 pandemic so, his mismanagement and, inactions recently are no surprise to me at all. ",
            "date": "Answered April 4, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Paul Friday",
                "href": "/profile/Paul-Friday-14"
            },
            "answer_text": "Who would have done better and, with considered time-lines, what would she. He have done differently? Far Right and Far Left need not reply… ",
            "date": "Answered April 5, 2020",
            "views": "6",
            "upvotes": " Answer requested by Tony Drake"
        }
    ]
}