{
    "title": "Are Austroasiatic people Mongoloid or a different race? - Quora",
    "tags": [
        "Mongoloids"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexei Muraki",
                "href": "/profile/Alexei-Muraki"
            },
            "answer_text": "Yes, the Austroasiatic (or Mon-Khmer) people are a Mongoloid (East Asian-related) population native to Southeast Asia. They originated in southern China and Laos.  Several genetic and linguistic studies came to similar results: The origin and homeland of the early Austroasiatic peoples is located in southern China and northern Laos/Vietnam. Sidwell (2011) suggests that the likely homeland of Austroasiatic is the middle Mekong, in the area of modern Laos, Thailand, and Cambodia. Peiros (2011) show with his analysis that the homeland of Austroasiatic is somewhere near the southern Yangtze. He suggests the Sichuan Basin as likely homeland of proto-Austroasiatic before they started their expansion to Southeast Asia (and parts of India). He further suggests that the family must be as old as proto-Austronesian and proto-Sinotibetan or even older. Georg van Driem proposes that the migration of Kra–Dai people from Taiwan replaced the original Austroasiatic language but the effect on the people was only minor. Local Austroasiatic speakers adopted Kra-Dai languages and partially their culture. (As example, many Thais in Thailand have high Mon ancestry.) The linguists Sagart (2011) and Bellwood (2013) support the theory of an origin of Austroasiatic along the southern Yangtze river in southern China. Early history: The Austroasiatic people started to expand from Southern China or northern Laos to many parts of Southeast Asia. They displaced the outnumberd Negrito people and fastly dominated most parts of Southeast Asia. (Later they were partially assimilated by new waves of Kra-Dai and Austronesian tribes.) Example of Austroasiatic peoples: Vietnamese (in Vietnam) Khmer (in Cambodia) Mon people (in Thailand and Myanmar) Here the average distribution of Mongoloid (East Asian related) ancestry among modern people:  Modern distribution of Austroasiatic languages:  A genetic and linguistic research in 2015 about ancient and modern people in Asia suggest an origin and homeland of Austroasiatic in today southern China or even further north and show that Austroasiatic populations also migrated into parts of India before the arrival of the Indo-Aryans. Austroasiatic people contributed also some cultural elements to modern South Asians.  Austroasiatic East Asian lineages above.  Austroasiatic speaking population of India above  The Munda mixed with the local populations and are a minority group in India. Many of them are predominantly South Asian but can have up to 70% East Asian ancestry. Conclusion: The Austroasiatic people are a Mongoloid (East Asian related) population and are closely related to other Mongoloid people. They created great cultures such as the Mon and Khmer empire and had some influence on India (Bengalis) and Sri Lanka:   Thank you for reading! :) ",
            "date": "Updated April 5, 2020",
            "views": "36",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Roberts",
                    "user_href": "/profile/James-Roberts-181"
                },
                {
                    "user_id": "Saito Takahashi",
                    "user_href": "/profile/Saito-Takahashi"
                },
                {
                    "user_id": "Eric Huang",
                    "user_href": "/profile/Eric-Huang-144"
                },
                {
                    "user_id": "Md Showrav",
                    "user_href": "/profile/Md-Showrav-3"
                },
                {
                    "user_id": "Ben Haryo",
                    "user_href": "/profile/Ben-Haryo"
                },
                {
                    "user_id": "Racine Reberio",
                    "user_href": "/profile/Racine-Reberio"
                },
                {
                    "user_id": "Ayu Soenardiman",
                    "user_href": "/profile/Ayu-Soenardiman"
                },
                {
                    "user_id": "Faustina Prima Aksara",
                    "user_href": "/profile/Faustina-Prima-Aksara"
                },
                {
                    "user_id": "Robert Berger",
                    "user_href": "/profile/Robert-Berger-28"
                },
                {
                    "user_id": "Nilanjan Chanda",
                    "user_href": "/profile/Nilanjan-Chanda-2"
                },
                {
                    "user_id": "Brahmavir Prabhu-Raje",
                    "user_href": "/profile/Brahmavir-Prabhu-Raje"
                },
                {
                    "user_id": "Chen Yang",
                    "user_href": "/profile/Chen-Yang-359"
                },
                {
                    "user_id": "Sayak Banik",
                    "user_href": "/profile/Sayak-Banik"
                },
                {
                    "user_id": "Thomas West",
                    "user_href": "/profile/Thomas-West-64"
                },
                {
                    "user_id": "Yudhistira Wedartama",
                    "user_href": "/profile/Yudhistira-Wedartama"
                },
                {
                    "user_id": "Amirah Melati",
                    "user_href": "/profile/Amirah-Melati"
                },
                {
                    "user_id": "Julian Fejzo",
                    "user_href": "/profile/Julian-Fejzo"
                },
                {
                    "user_id": "Girish Bhat",
                    "user_href": "/profile/Girish-Bhat-93"
                },
                {
                    "user_id": "Ebis Mark",
                    "user_href": "/profile/Ebis-Mark"
                },
                {
                    "user_id": "Marco Fan",
                    "user_href": "/profile/Marco-Fan-4"
                },
                {
                    "user_id": "Sridharan Yadav",
                    "user_href": "/profile/Sridharan-Yadav"
                },
                {
                    "user_id": "James Bundy",
                    "user_href": "/profile/James-Bundy-3"
                },
                {
                    "user_id": "Luo Shunhai",
                    "user_href": "/profile/Luo-Shunhai"
                },
                {
                    "user_id": "Yufril Aziz",
                    "user_href": "/profile/Yufril-Aziz-1"
                },
                {
                    "user_id": "Aliaksei Parkhach",
                    "user_href": "/profile/Aliaksei-Parkhach-1"
                },
                {
                    "user_id": "Rafael Ferreira",
                    "user_href": "/profile/Rafael-Ferreira-172"
                },
                {
                    "user_id": "Wilhelm Reinhardt",
                    "user_href": "/profile/Wilhelm-Reinhardt"
                },
                {
                    "user_id": "Putra Duha",
                    "user_href": "/profile/Putra-Duha"
                },
                {
                    "user_id": "Harya Dony Pratama",
                    "user_href": "/profile/Harya-Dony-Pratama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Musselman",
                "href": "/profile/Thomas-Musselman"
            },
            "answer_text": "“Monoloid” is an outmoded term that is now viewed as racist and insulting; please don’t use it. If you mean the people in China, Korea, Japan and nearby areas say “East Asian”. Scientists also no longer think of “race” as a scientific concept; it is a socially-defined one. Groups of people lumped together by one culture might be viewed as a “racial” category in that culture but it doesn’t mean they have a unique common origin or close relationship. The people of the Andaman Islands, e.g., have a look like they are related to West Africans, but DNA tests indicate Europeans are more closely related to West Africans than they are, i.e. looks are deceiving. People from the pre-European Australian continent and Tasmania are closely related to Torres Straight islanders and some of the people of New Guinea (but not to all since such island has received migrations Australia did not). In the 1800s when racism was the norm and cultural and physical anthropology in its infancy some scientists of the day included Australian Aborigines as a separate group, others lumped them in with East Asians; some made Malaysians a separate group; some Polynesians. DNA tests are mostly used to trace descent now. Australian Aboriginal people used to live in Asia, the extent of which is still unknown. One of their genetic signatures has been found in Amerindians in South America suggesting that inter-marriage in ancient times and migration is outside our current knowledge of historical events. ",
            "date": "Updated July 23, 2020",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brandon-James",
                    "user_href": "/profile/Brandon-James-340"
                },
                {
                    "user_id": "Ranjan Kumar",
                    "user_href": "/profile/Ranjan-Kumar-763"
                },
                {
                    "user_id": "Francisco San Juan",
                    "user_href": "/profile/Francisco-San-Juan-7"
                },
                {
                    "user_id": "Phạm Chi Mai",
                    "user_href": "/profile/Phạm-Chi-Mai-1"
                },
                {
                    "user_id": "Simone King",
                    "user_href": "/profile/Simone-King-3"
                },
                {
                    "user_id": "Ryo Oz",
                    "user_href": "/profile/Ryo-Oz-1"
                },
                {
                    "user_id": "Nur Shomik",
                    "user_href": "/profile/Nur-Shomik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter Smyth",
                "href": "/profile/Walter-Smyth"
            },
            "answer_text": "Out of Africa showing Haplogroup C diverged from CF with East Asians and Australasians carrying different subclades of Haplogroup C. Haplogroup C and it’s subclades in East Asia and Austronesia:  World Y-DNA Map Native Americans carry overwhelmingly DNA originating in Siberia with some Central Asian DNA.  MTDNA Map: This map shows that Austronesians carry the same MTDNA as other East Asians, but different subclades. MTDNA D which is common amongst some Austronesians, is an East Asian MTDNA in origin. Haplogroup B is said to have originated in South East Asia. Austronesians and Mongolaids do not resemble each other because they do not carry the same subclade, just like people of the Cameroons do not resemble Western Europeans even though they carry a subclade of R1B.  ",
            "date": "Answered May 25, 2019",
            "views": "13",
            "upvotes": " Answer requested by John McGuinnes",
            "upvoters": [
                {
                    "user_id": "Alexei Muraki",
                    "user_href": "/profile/Alexei-Muraki"
                },
                {
                    "user_id": "Amirah Melati",
                    "user_href": "/profile/Amirah-Melati"
                },
                {
                    "user_id": "John McGuinnes",
                    "user_href": "/profile/John-McGuinnes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tamizh Deva",
                "href": "/profile/Tamizh-Deva"
            },
            "answer_text": "Austroasiatic people are Mongoloid, like most other Southeast Asians. Genetically they are close to other Southeast and East Asians.      The Munda people in India speak Austroasiatic, but are mixed with Indians. Austroasiatic languages today:  Austroasiatic originated somewhere in southern China. ",
            "date": "Answered May 19, 2019",
            "views": "11",
            "upvotes": " View 3 Upvoters "
        }
    ]
}