{
    "title": "Are you bored with staying at home due to covid-19? - Quora",
    "tags": [
        "Dealing with Boredom",
        "Recreational and Leisure Activities",
        "Boredom",
        "COVID-19 (2019-2020)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saurabh Mali",
                "href": "/profile/Saurabh-Mali-35"
            },
            "answer_text": "Dont worry.Covid 19 is not for lifetime.Feel happy amd only live with enjoy.here some trics to do in lockdown. Reading all new stuff 1.The first thing you should do is reading. Read and read a lot. Study about something you find exciting. Change the genre of books you usually read; not just fiction, try to read the autobiography of famous and inspirational personalities, like those of Barack Obama, APJ Abdul Kalam, and Jawaharlal Nehru. 2. Learn new things; Craft, Paintings or may be Sculpturing Next, you could take up a craft. Like crocheting, knitting or loom knitting, this is simple. Look up Knifty Knitter on Google and it will show you what it is. Get some yarn, learn how to make hats and donate them to the homeless and persons in need. Giving back to the community where you live helps alleviate boredom and give a sort of pleasure. 3. Open your artistic side Get some colouring books and colours. It’s a good way to open up the artistic side of yourself, and it is fun. Express your thoughts and fantasies with paint and brush. Believe me, drawing and painting is the most soothing way of helping your brain evacuate all the junk and refresh for all new learning. 4. Sing, dance and explore new tunes These can be the best activities to keep you fresh and enthusiastic. Open yourself to better things in the world and realize that there's more to life than what you have. Learn a new form of dance from youtube. Sing your favuorite songs, record, listen and share with your friends. Believe me, it will be all fun. If you have any musical instrument at home, then it's the best time to play with it. Learn to play new tunes. Hopefully, you will discover something to do that will take away your boredom. 5. Make realistic goals, think about future plans Yes, this is the most important and helpful thing to remove the boredom. Ask yourself about what your aim is and what exactly you are doing in order to achieve your goals. For a student, time is the most valuable resource; thus, one has to identify the most important tasks that add value to one's education and focus on them. You should try to set aside a specific period during the day/night when the energy levels are high to perform the most important tasks. Make a full-proof plan for your career, reaching the goal and achieving that feat. Start working: Identify your strengths, your weaknesses, your hobbies. Find out where you want to be 10 years down the line. 6. Make some travel plans for future Though at this time, you should not even think of stepping out of your home but you can think about it for future vacations. You can make a list of places you would want to visit during your winter vacation. You can read about your favourite destinations, it'll make you ecstatic. 7. Meditate This is the biggest stress reliever given the fact that we people have to deal with a lot of stress daily in our life. Our brain is mostly like a boiling pressure cooker and it definitely needs rest so that the body can rejuvenate and heal itself for oncoming activities. 8. Talk to people We are social beings we need to talk to people. Start conversations online, even with strangers but in a constructive manner. When you interact with people you don't know, you get the chance to break out of your comfort zone and change your view of reality altogether. This can spark creative ideas, give you new ideas to think about, and plenty more and in the end you will get a new friend. ",
            "date": "Answered May 6, 2020",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohini Jugran",
                "href": "/profile/Mohini-Jugran"
            },
            "answer_text": "We all are stuck at our homes these days. Despite the fact that Lockdown 2.0 has began, life is still stopped at the standstill. Nothing is same anymore. We can’t go out to chill with friends anytime we want. There are no more Saturday Night Discos. Even going out for movies isn’t the same anymore. Life has somehow become boring and ‘not-so-happening’ all of a sudden. Even though we are still burdened from just the same amount of workload, targets and meetings, the FUN factor kind of seems to be missing from our lives. If you too feel your days being dragged like nothing else, the highlight of your days missing and there seems to the feeling of missing out, there worry not. There are ways and means by which we can make the most of this time that we all have and enjoy it to the fullest. There are many activities that can be done by one and all to enjoy the little things in our lives. Try out some of the activities mentioned in this post and enjoy the quarantine period. https://blog.madcrayons.com/favourite-quarantine-entertainment/ ",
            "date": "Answered July 9, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sofia Mouratidis",
                "href": "/profile/Sofia-Mouratidis"
            },
            "answer_text": "Not exactly bored. But I feel a bit overwhelmed and feel the need to go outside and get some fresh air sometimes. I’m an introvert, which means that the activities I enjoy to do are by 90–95% non-extroverted activities (e.g., going to clubs or social events etc). So staying home is not really a problem with me, as long as I use my time productively. And I do use my time productively because I’m busy with University work. Therefore, my every day at home is reading the required readings from my textbooks, watching online lectures and writing my notes, attending tutorials, research journal articles and anything needed to work on my upcoming assignments, preparing for the final exams in June and in the end of the day I have a mental breakdown due to my exhaustion. And while I’m not overloading my brain with scientific research, statistics and Freud, I read a book (even though I read 60 pages of uni textbook!) watch YouTube vdeos, spend my time on Quora reading answers and chatting or finding something interesting to work on. If I decide to get out of the house, I’ll just go for a short morning walk and at the shops IF I need something. Other than that, I’m okay. But I need to take it a bit easy and handle my stress more effectively. ",
            "date": "Answered April 16, 2020",
            "views": "252",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Greg Harduk",
                    "user_href": "/profile/Greg-Harduk"
                },
                {
                    "user_id": "Karan Mehta",
                    "user_href": "/profile/Karan-Mehta-8"
                },
                {
                    "user_id": "Amina Lachachi",
                    "user_href": "/profile/Amina-Lachachi"
                },
                {
                    "user_id": "Marcus Lundgren",
                    "user_href": "/profile/Marcus-Lundgren-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khushi Jha",
                "href": "/profile/Khushi-Jha-111"
            },
            "answer_text": "of course not…… as a person i am very enthusiastic at every situations. I do not let my mood control me rather i control it. Though sometimes i fail but i keep on building good habits…. In this quarantine period i have decided to install self-discipline in me which i lacked in so many areas (i didn’t give time to study, i used to eat plenty of junk food,etc). So its really fun and beneficial working on me. I suggest you guys also to make yourself your best friend and improve yourself in your weak areas… no one in this entire world of 7 billion people can comprehend and tally you the way you will do…. don’t get bored in your presence.. if you can’t entertain yourself, no one else can…. stay blessed stay cheerful…. thankyou ",
            "date": "Answered April 10, 2020",
            "views": "117",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rekha Mishra",
                "href": "/profile/Rekha-Mishra-269"
            },
            "answer_text": "No, not at all. Infact, I am greatful that I got this time of self-analysing. I have written down my visions. I have been working on habits that I want to inculcate since long but kept avoiding it. I started doing what I love to do but couldn't as I had this brilliant excuse “I am busy, I don't have time” I study everyday (except Sat/Sun) related to my domain. I read books. I write Blogs and I journal my everyday. I work from home. And I workout, pay attention to my nutrition and diet. Most importantly, I have got all the time in the world for self love and self care. And it's been a month, I haven't watched Netflix and Prime. Just spending my time learning things that would be beneficial to me in long term ♥️ Cheers. Be Happy Always 🤗 ",
            "date": "Answered April 27, 2020",
            "views": "101",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Micah Wilson",
                "href": "/profile/Micah-Wilson-51"
            },
            "answer_text": "I’m retired Navy. I once spent 97 days on board a carrier going in circles off the coast of Lebanon. In the 7 months we spent in the Mediterranean, we had 3 port visits at 3 days each, plus one day off for a ‘steel beach picnic’. A few days in the house? I do get out to go to the grocery store to resupply, not stock up. We play cards, board games, go through our belongings from where we moved a week ago. I take my dog out into the sidewalks for exercise around the apartment complex. ",
            "date": "Answered March 29, 2020",
            "views": "513",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rise Anderson",
                    "user_href": "/profile/Rise-Anderson"
                },
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Smith",
                "href": "/profile/Brandon-Smith-505"
            },
            "answer_text": "No, I am busy writing and finding ways to understand the world. I don’t think we need to be bored, I went kayaking with my son and took the dog for a longer walk than usual. I also spent time with my son on Minecraft, exploring his creative ideas. I am a student, so I get to focus on school and make the best of these times. Focus on the opportunities that the problem brings, and you will overcome the difficulties. ",
            "date": "Answered March 29, 2020",
            "views": "163",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Clara White",
                    "user_href": "/profile/Clara-White-40"
                },
                {
                    "user_id": "Rise Anderson",
                    "user_href": "/profile/Rise-Anderson"
                },
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Rai",
                "href": "/profile/Abhishek-Rai-160"
            },
            "answer_text": "Wake up in afternoon, get ready, take few steps and here comes my office. Loneliness killling me. I am missing everyday journey from home to office and back to home. I am missing momos, pizzas and many more street foods. The only positive thing is I have learned to work from home and stay productive. My temporary office 😌  ",
            "date": "Answered April 6, 2020",
            "views": "102",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Jacobucci",
                "href": "/profile/Todd-Jacobucci"
            },
            "answer_text": "I was talking with a contemporary about that a few days ago. Neither one of us found staying home difficult. There is a reason why - we are both in our mid-50s. We also agreed that if this had happened when we were in our twenties, we’d be going nuts. ",
            "date": "Updated April 10, 2020",
            "views": "115",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lacey White",
                "href": "/profile/Lacey-White-36"
            },
            "answer_text": "I have never been bored in my post doesn't life. I am frustrated that I cannot due some social things I have wanted to do or visit places I have wanted to visit this summer, but I have a wealth of interests and activities that I can do. It all comes down to whether or not you actually like your own company. ",
            "date": "Answered July 12, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Logan Casey",
                "href": "/profile/Logan-Casey-4"
            },
            "answer_text": "No because I’m not staying at home. I do college classes at home, but I get out and go to the store, go to the drive-thru, go for walks, go for drives, go to the park, just spend time outside. The only people totally isolated and confined to their homes and/or rooms are either those who are actually sick, or those who choose to confine themselves. ",
            "date": "Answered March 30, 2020",
            "views": "137",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chukwuma Princewill",
                "href": "/profile/Chukwuma-Princewill"
            },
            "answer_text": "Yes I am ",
            "date": "Answered March 29, 2020",
            "views": "183",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeremy Lim",
                    "user_href": "/profile/Jeremy-Lim-224"
                },
                {
                    "user_id": "Kea Renee",
                    "user_href": "/profile/Kea-Renee-1"
                },
                {
                    "user_id": "Rebeca Morales",
                    "user_href": "/profile/Rebeca-Morales-15"
                },
                {
                    "user_id": "April Kin",
                    "user_href": "/profile/April-Kin"
                },
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Tag",
                "href": "/profile/Michelle-Tag"
            },
            "answer_text": "YESSSS! But Jack Daniel’s is just steps away. ",
            "date": "Answered March 29, 2020",
            "views": "80",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dianna Garland",
                    "user_href": "/profile/Dianna-Garland-1"
                },
                {
                    "user_id": "Jay Chelsey",
                    "user_href": "/profile/Jay-Chelsey"
                },
                {
                    "user_id": "Charlene Sessions",
                    "user_href": "/profile/Charlene-Sessions"
                },
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Jackson",
                "href": "/profile/Keith-Jackson-82"
            },
            "answer_text": "God yes. I have a wonderful country garden that I want to do things in ,but the bloody garden centres are shut. Would have thought that as gardening is a thing that’s positive to mental well being, and it’s a way of producing produce, that they would be a essential service. ",
            "date": "Answered March 29, 2020",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chantal Gaudiano Whittington",
                "href": "/profile/Chantal-Gaudiano-Whittington"
            },
            "answer_text": "Are you kidding? I have BOOKS. There is no such thing as boredom when you have plenty of good books. ",
            "date": "Answered April 3, 2020",
            "views": "43",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Skalet Brace",
                    "user_href": "/profile/Skalet-Brace"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Blue-Grey-OM"
                },
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Dewar",
                "href": "/profile/Craig-Dewar-1"
            },
            "answer_text": "No. I have a 2 year old daughter who ensures it is never boring. She thinks every day is Sunday as I'm not going out to work. It is the.best holiday I have had in the last 2 years. ",
            "date": "Answered April 2, 2020",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ulf Osterberg",
                    "user_href": "/profile/Ulf-Osterberg"
                },
                {
                    "user_id": "Jeremy Lim",
                    "user_href": "/profile/Jeremy-Lim-224"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emanuela Odi",
                "href": "/profile/Emanuela-Odi"
            },
            "answer_text": "Yes!!!!!!!!!!!!!!!!!!!!!!! Now is one month I can't go out…. ",
            "date": "Answered March 30, 2020",
            "views": "33",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Skalet Brace",
                    "user_href": "/profile/Skalet-Brace"
                },
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert A. Jorg",
                "href": "/profile/Robert-A-Jorg"
            },
            "answer_text": "Yes I sure am!!!!! ",
            "date": "Answered April 5, 2020",
            "views": "84",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donna Collins",
                    "user_href": "/profile/Donna-Collins-183"
                },
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aashish Yadav",
                "href": "/profile/Aashish-Yadav-126"
            },
            "answer_text": "No , I am not bore staying at home because too much develop our self and doing online work COVID-19 teach so many things , important of health , technology etc. ",
            "date": "Answered May 6, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony Adams",
                "href": "/profile/Tony-Adams-184"
            },
            "answer_text": "Not really. ",
            "date": "Answered March 29, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Smith",
                "href": "/profile/Bill-Smith-1797"
            },
            "answer_text": "Yes ",
            "date": "Answered May 4, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jennie Rowe",
                    "user_href": "/profile/Jennie-Rowe-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hanibal Aman",
                "href": "/profile/Hanibal-Aman"
            },
            "answer_text": "Yes ",
            "date": "Answered April 2, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dream Tech",
                "href": "/profile/Dream-Tech-14"
            },
            "answer_text": "Yes ",
            "date": "Answered April 4, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aesha Elise",
                "href": "/profile/Aesha-Elise"
            },
            "answer_text": "No ",
            "date": "Answered April 4, 2020",
            "views": "52",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakhi Jain",
                    "user_href": "/profile/Rakhi-Jain-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krishsanth Sirivel",
                "href": "/profile/Krishsanth-Sirivel"
            },
            "answer_text": "I am, are you? ",
            "date": "Answered May 4, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steward Steven",
                "href": "/profile/Steward-Steven"
            },
            "answer_text": "Yes. ",
            "date": "Answered March 31, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sudhakar S Bhatt",
                "href": "/profile/Sudhakar-S-Bhatt"
            },
            "answer_text": "Yes ",
            "date": "Answered April 3, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Muhammad Arif Prasetyawan",
                "href": "/profile/Muhammad-Arif-Prasetyawan"
            },
            "answer_text": "No! ",
            "date": "Answered June 2, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Sims",
                "href": "/profile/Brian-Sims-61"
            },
            "answer_text": "No ",
            "date": "Answered March 29, 2020",
            "views": "32",
            "upvotes": "0"
        }
    ]
}