{
    "title": "Are Turkic people originally of the mongoloid race? - Quora",
    "tags": [
        "Mongoloids",
        "Turkic",
        "Central Asia",
        "Turkish Ethnicity and People",
        "Turkey (country)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexei Muraki",
                "href": "/profile/Alexei-Muraki"
            },
            "answer_text": "Yes, the Turkic people either originated in southern Siberia/Mongolia or northern China. Some suggest a more eastern origin in Manchuria, particularly the Liao river basin. While another study supports and origin in the Chinese province of Gansu. The early Turks, also known as proto-Turkic people, were a 100% Mongoloid population. They were closely related to modern East Asians and Siberians and shaped Central Asia after their expansion from the east. They replaced the Caucasoid Iranian Scythians and even influenced parts of Europe (Tatars, Avars, Bulgars,…) → That means: Yes, the original Turks were Mongoloid (East Asian). And most Turkic people are still predominantly Mongoloid.  Most Turkic people still are predominantly Mongoloid. Also the modern Turkish people in Turkey have 21,7% East Asian genome in average. Some people in Europe can trace a noteworthy amount of their ancestry to Turkic peoples from Siberia and northern China. A study about Hungarians, Austrians and Romanians found noteworthy East Asian components and lineages, which likely arrived to Europe with Turkic groups (possibly from the Oghur branch). Recent genetic studies concluded that there is a “Turkic component” found in every modern Turkic speaking population. This component is linked to East Asians and Siberians and can be traced back to a region called “South Siberia and Mongolia” (SSM). (The Genetic Legacy of the Expansion of Turkic-Speaking Nomads across Eurasia) A linguistic point of view supports a region in northeastern China, close to the Mongolic and Tungusic homelands and possibly also with intensive contact with Koreanic and Japonic languages and peoples. The former Altaic family theory is largely rejected but even the strongest critics say that all included languages must have been in very close (geographically) contact to each other in ancient times, most likely in Manchuria. Thus Altaic is now generally viewd as “areal family”. (Some still support a shared origin and call it “Transeurasian”.)  The ancient Turks looked like the modern local native Turkic people in this and nearby regions:       The early Turks were called “Tujue” 突厥 by the Chinese. The first historically attested Turkic empire was the Göktürk Khaganate:  But Turkic people existed before and are belived to be the major component of the Xianbei and Xiongnu (and possibly the Huns) next to the early Mongols. Also the Avars, a nomadic warrior tribe which ruled over parts of Austria and Hungary some 1500 years ago, are suggested to be of predominantly Turkic origin. Avar burials in Austria showed that they were a Mongoloid population and formed about 25% of the total population of the Avar Khaganate. Some even suggest 30% to 40%. Genetic testing showed that the Avar ruler samples were predominantly East Asian and had close relation to modern people in Kazakhstan, Mongolia and northern China.   The ancient Turkic people, next to other Siberians, share close affinity with the main ancestors of the people that migrated into the Americas (Native Americans).  Turkic ancestry in modern Turkey:  We see that modern Turkish people also have noteworthy Turkic/East Asian ancestry. Another study found 21,7% East Asian ancestry in Turkish people on average (this excludes ethnic minorities, which have a lower but still noteworthy percentage). Conclusion: The Turkic people are a Mongoloid people and closely related to other Siberians and East Asians. They expanded from Mongolia and northern China and shaped Central Asia (most Central Asians are now Turkic and predominantly Mongoloid/East Asian). Other regions, such as Anatolia (Turkey), but also parts of Europe, have noteworthy Turkic/East Asian (Mongoloid) influence.  Thank you for reading. :) ",
            "date": "Updated October 13, 2020",
            "views": "33",
            "upvotes": " View 65 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hakan Kisa",
                    "user_href": "/profile/Hakan-Kisa"
                },
                {
                    "user_id": "Nathcanont Pacharawan",
                    "user_href": "/profile/Nathcanont-Pacharawan"
                },
                {
                    "user_id": "Ly Tu Nhien",
                    "user_href": "/profile/Ly-Tu-Nhien"
                },
                {
                    "user_id": "Ivan O. Dulciny",
                    "user_href": "/profile/Ivan-O-Dulciny"
                },
                {
                    "user_id": "Huda Shaikh",
                    "user_href": "/profile/Huda-Shaikh-65"
                },
                {
                    "user_id": "Val Loyola",
                    "user_href": "/profile/Val-Loyola"
                },
                {
                    "user_id": "Tunca Doğan Tırpan",
                    "user_href": "/profile/Tunca-Doğan-Tırpan"
                },
                {
                    "user_id": "Zee Li",
                    "user_href": "/profile/Zee-Li-3"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Aslı Bilgin",
                    "user_href": "/profile/Aslı-Bilgin"
                },
                {
                    "user_id": "Reuben Hayat",
                    "user_href": "/profile/Reuben-Hayat"
                },
                {
                    "user_id": "Arnab Bose",
                    "user_href": "/profile/Arnab-Bose-33"
                },
                {
                    "user_id": "León Eduardo Grueso",
                    "user_href": "/profile/León-Eduardo-Grueso"
                },
                {
                    "user_id": "Abhishek Krishnan (अभिषेक कृष्णन) (അഭിഷേക് കൃഷ്ണൻ)",
                    "user_href": "/profile/Abhishek-Krishnan-अभिषेक-कृष्णन-അഭിഷേക്-കൃഷ്ണൻ"
                },
                {
                    "user_id": "Lynn Elizabeth Lytton",
                    "user_href": "/profile/Lynn-Elizabeth-Lytton"
                },
                {
                    "user_id": "Li Shu Yan",
                    "user_href": "/profile/Li-Shu-Yan"
                },
                {
                    "user_id": "Yisong Wang",
                    "user_href": "/profile/Yisong-Wang-3"
                },
                {
                    "user_id": "Ra'ef Gritli",
                    "user_href": "/profile/Raef-Gritli"
                },
                {
                    "user_id": "Akshit Tripathi",
                    "user_href": "/profile/Akshit-Tripathi"
                },
                {
                    "user_id": "Selçuk Arslan",
                    "user_href": "/profile/Selçuk-Arslan-2"
                },
                {
                    "user_id": "Aikoria Aiko",
                    "user_href": "/profile/Aikoria-Aiko"
                },
                {
                    "user_id": "Rohit Bhamidipati",
                    "user_href": "/profile/Rohit-Bhamidipati-1"
                },
                {
                    "user_id": "James Bundy",
                    "user_href": "/profile/James-Bundy-3"
                },
                {
                    "user_id": "Gratia Anandita",
                    "user_href": "/profile/Gratia-Anandita"
                },
                {
                    "user_id": "Khizar Khan",
                    "user_href": "/profile/Khizar-Khan-122"
                },
                {
                    "user_id": "Raul Castro",
                    "user_href": "/profile/Raul-Castro"
                },
                {
                    "user_id": "Igor S. Rossine Gleb",
                    "user_href": "/profile/Igor-S-Rossine-Gleb"
                },
                {
                    "user_id": "Lily Temmer",
                    "user_href": "/profile/Lily-Temmer"
                },
                {
                    "user_id": "Adi Primanda Ginting",
                    "user_href": "/profile/Adi-Primanda-Ginting"
                },
                {
                    "user_id": "Charles Chen",
                    "user_href": "/profile/Charles-Chen-85"
                },
                {
                    "user_id": "Achint Agarwal",
                    "user_href": "/profile/Achint-Agarwal-1"
                },
                {
                    "user_id": "Yiğit Hatunoğlu",
                    "user_href": "/profile/Yiğit-Hatunoğlu-1"
                },
                {
                    "user_id": "Karthi Karunanidhi",
                    "user_href": "/profile/Karthi-Karunanidhi"
                },
                {
                    "user_id": "Adrian Raka",
                    "user_href": "/profile/Adrian-Raka"
                },
                {
                    "user_id": "Maxwell-Luis Law",
                    "user_href": "/profile/Maxwell-Luis-Law"
                },
                {
                    "user_id": "Oleg Sidorenko",
                    "user_href": "/profile/Oleg-Sidorenko-6"
                },
                {
                    "user_id": "Edwin Tunggawan",
                    "user_href": "/profile/Edwin-Tunggawan"
                },
                {
                    "user_id": "Chen Yang",
                    "user_href": "/profile/Chen-Yang-359"
                },
                {
                    "user_id": "Vijay Sekhar",
                    "user_href": "/profile/Vijay-Sekhar-17"
                },
                {
                    "user_id": "Hasti Salah",
                    "user_href": "/profile/Hasti-Salah"
                },
                {
                    "user_id": "Hamza Muhammad",
                    "user_href": "/profile/Hamza-Muhammad-104"
                },
                {
                    "user_id": "Chengez Hussaini",
                    "user_href": "/profile/Chengez-Hussaini"
                },
                {
                    "user_id": "Shawn Han Song",
                    "user_href": "/profile/Shawn-Han-Song"
                },
                {
                    "user_id": "Robert Rio Brewin",
                    "user_href": "/profile/Robert-Rio-Brewin"
                },
                {
                    "user_id": "Frank Rabbon",
                    "user_href": "/profile/Frank-Rabbon"
                },
                {
                    "user_id": "Harya Dony Pratama",
                    "user_href": "/profile/Harya-Dony-Pratama"
                },
                {
                    "user_id": "Levent Saydam",
                    "user_href": "/profile/Levent-Saydam"
                },
                {
                    "user_id": "Julian Fejzo",
                    "user_href": "/profile/Julian-Fejzo"
                },
                {
                    "user_id": "Rachid Masimov",
                    "user_href": "/profile/Rachid-Masimov"
                },
                {
                    "user_id": "Saba Zarghampour",
                    "user_href": "/profile/Saba-Zarghampour"
                },
                {
                    "user_id": "Cagil Guacamole",
                    "user_href": "/profile/Cagil-Guacamole"
                },
                {
                    "user_id": "Armin Nahalbandian",
                    "user_href": "/profile/Armin-Nahalbandian"
                },
                {
                    "user_id": "Furkan Aslan",
                    "user_href": "/profile/Furkan-Aslan-3"
                },
                {
                    "user_id": "Krassimir Kostov",
                    "user_href": "/profile/Krassimir-Kostov"
                },
                {
                    "user_id": "Siau Liu",
                    "user_href": "/profile/Siau-Liu"
                },
                {
                    "user_id": "Dong-Yoon Lee",
                    "user_href": "/profile/Dong-Yoon-Lee"
                },
                {
                    "user_id": "Yufril Aziz",
                    "user_href": "/profile/Yufril-Aziz-1"
                },
                {
                    "user_id": "Rafael Ferreira",
                    "user_href": "/profile/Rafael-Ferreira-172"
                },
                {
                    "user_id": "Luo Shunhai",
                    "user_href": "/profile/Luo-Shunhai"
                },
                {
                    "user_id": "Solomon Malekani",
                    "user_href": "/profile/Solomon-Malekani"
                },
                {
                    "user_id": "Lei San",
                    "user_href": "/profile/Lei-San-2"
                },
                {
                    "user_id": "Aliaksei Parkhach",
                    "user_href": "/profile/Aliaksei-Parkhach-1"
                },
                {
                    "user_id": "Salih Ulu",
                    "user_href": "/profile/Salih-Ulu-1"
                },
                {
                    "user_id": "Payton Brown",
                    "user_href": "/profile/Payton-Brown-50"
                },
                {
                    "user_id": "Thomas Morrissey （汤姆）",
                    "user_href": "/profile/Thomas-Morrissey-汤姆"
                }
            ]
        },
        {
            "author_info": {
                "name": "Li Shu Yan",
                "href": "/profile/Li-Shu-Yan"
            },
            "answer_text": "The Turkic people are just Turkic people with Turkic cultures, languages and customs. Race is an outdated concept and people from Central Asia have been mixed of Middle Easterners, Europeans, South Asians and East Asians for a long time. Even before the Indo-European migration or Turkic migration, there were already people living in Central Asia and they had connections with surrounding tribes. The earliest people found in Eurasia looked like Cro-Magnon or Australoid people. 7,000 years ago, brown skinned people were sporadically found in Europe and Asia with slight differentiation. Australoid and Proto-Mongoloid skulls were dug from East Asia and India. These population had brown skin and curly hair. These people split from common ancestors 40,000 years ago. They had brown skin, large eyes and thick lips. This population evolved to look different via natural selection and genetic mutation through migrations. They also mixed with the existing neanderthal and archaic hominid in the places. Tribes, ethnics and civilizations were formed in respective places but there was no racial concept.. People can argue that Mongols are Mongoloid, but “Mongoloid” people with haplogroup O is not similar as “Mongoloid” with haplogroup C or D (Japanese are classified as Mongoloid too). Moreover, “Mongoloid” can be people of different cultures and ethnic, different origins, different appearance and not just one group. Haplogroup C is found in Australian aborigines but they look nothing like Mongolians. People can argue that Caucasoid is a single race, but “Caucasoid” people with haplogroup J is not similar as “Caucasian” with haplogroup R or N (Finns are Caucasoid too). Moreover, “Caucasoid” can be people of different cultures and ethnic, different origins, different appearance and not just one group. Haplogroup R1b is found in Sub-Sahara Africans but they look nothing like Europeans. Racial theory is developed during the colonial era to differentiate colonizers from the natives efficiently. This is already outdated as there is no colonization anymore. But racial theory seeped into different cultures post-colonization and it is difficult to revert to normal. Anthropologically, there are not just Mongoloid, Caucasoid and Negroid anthropology. These are the most famous groups but there are others. There are brachycephaly and dolichocephaly, both structure are found in all races and ethnic groups. ",
            "date": "Answered December 23, 2019",
            "views": "741",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alper Karaca",
                    "user_href": "/profile/Alper-Karaca-4"
                },
                {
                    "user_id": "Kuru Soğan",
                    "user_href": "/profile/Kuru-Soğan"
                },
                {
                    "user_id": "Wang Zheng Huan 王正焕",
                    "user_href": "/profile/Wang-Zheng-Huan-王正焕"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dilara Kutlu",
                "href": "/profile/Dilara-Kutlu-1"
            },
            "answer_text": "Lets clarify this question by using Y-dna results of Turkic people for some ‘’ idiots’’ who are trying to make Turkic people mongloid despairingly. Firstly some information about Y-Dna haplogroups Turkic people have ; Haplogroup C: Haplogroup C-M130 is attributed to the northeast of Asia as it is easy to find the highest frequencies among the indigenous populations of Mongolia. This haplogroup is found at lower frequencies among Turkic people of Central Asia except Kazakhs. On the other hand, Mongolic and Tungusic people have the highest frequencies. It is possible that this haplogroup might have spread into Turks during the Mongol invasions of 13th century as well as previous tribal leagues in the history. Haplogroup E: It is discussed whether the haplogroup E-M96 originated in Africa or Asia, but it is possible to see the highest frequencies of haplogroup E in Africa. On the other hand, E-M243, which is a common subclade in North Africa, is also found in Europe (Albania, Greece and Italy) and Asia at significant frequencies. Haplogroup E-M78 is also found in the ethnicities of Ural-Volga region such as Chuvash people [Turkic] (14%), and Mordvins [Uralic] (10,2%), which is a significant amount. Haplogroup F*: F is the 40.000 year-old father of the haplogroups: G, H, I, J, K, L, M, N, O, P, Q, R, S, T. The father of F is CF. The minor sub-groups of F (F-M89) haplogroup have been observed in Yugurs of North China and Kazakhs in a frequency of 4-6%. The minor subclades of this haplogroup has also been observed in the Indian subcontinent as well. These findings indicate that the possible origin place of haplogroup F might be somewhere in Central or Southern Asia. On the other hand, the major sub-groups of Haplogroup F are Haplogroups G, H, [IJ], and K. Haplogroup G: Haplogroup G (G-M201) is subdivided as G1 and G2. The haplogroup G1 is more common in Argyn and Madjar tribes of Kazakhs whereas G2a is more common in Tatar and Nogay tribes of Kazakhstan. On the other hand, G2a is also found in Caucasian ethnicities. In Turkey, G has a frequency of 11% among Turkish males whereas this percentage is around 18% in Azerbaijan. Haplogroup H: Haplogroup H is common in South Asia, but it is also found in Central Asian Turkic people at various frequencies. Haplogroup I1: Haplogroup I1(I-M253) is more common in northern Europe with a frequency of 37% in Sweden, 31.6% in Norway, 28% in Finland. Tatars of Eastern Europe also has a significant amount of this haplogroup. Haplogroup I2: The haplogroup I2 (I-M438) also has a significant amount among Turkic people of Eastern Europe. This haplogroup has the highest frequency in Bosniaks with a frequency of 55.5%, and then 26% in Romania. However, it is possible to see this haplogroup in Turkic people as well. Haplogroup J1:Although Haplogroup J1 (J-M267) is more common in Caucasia and Middle East, it is possible to see this haplogroup among Turkic people. It is possible to see this haplogroup among Turkic people from Altai mountains to Balkans. Haplogroup J2: It is not obvious where J2 originated exactly. J2 is one of the most highest haplogroups in Caucasus; it is also high in some parts of Central Asia. Turkish people also has a 24% frequency of J2 in Turkey. It also has significant frequencies in Central Asian Turkic people such as Uygurs, Uzbeks and Turkmens, and also common in Middle Eastern Turks such as Azerbaijani, Iraqi/Syrian Turkmens and Turkish people. J2 is one of the most common haplogroups in the world, spreading from Northern China to Portugal, and from Lithuania to Arabia with the highest frequencies in West Asia. J2 is subdivided into two sub-groups: J2a and J2b. Turkic people are mostly related to J2a; however, J2b is also observed in Ural-Volga Tatars, Uzbeks and Hazara people. It is possible to observe most of J2 variations among Turkic people such as J2-M322, J2-M410, J2-M530 (J2-L24), J2-M67, J2-M92, J2-L26 etc. This haplogroup is found in nearly all Turkic people at lower or higher frequencies. Haplogroup L: Haplogroup L is supposed to have originated somewhere in South Asia. However, this haplogroup is common in most of Turkic people at various frequencies. Haplogroup N: Haplogroup N is supposed to be related to Northern Asia and Europe. Typically haplogroup N is found in northern people of Asia and Europe such as Finnish and North Siberian people. For example, haplogroup N is found in Nenets at 97.3%; Khanti people at 76.6%, Finnish people at 61.5%, Lithuanians 42%, Yupiks (of Eskimo) at 50.6%. However, this haplogroup is also found in northern Turkic people. Haplogroup O: Haplogroup O is supposed to have originated somewhere in eastern or southeastern Asia. However, this haplogroup is also found in Turkic people of Central Asia at significant proportions. Haplogroup Q: Haplogroup Q is found in indigenous peoples of the Americas at the highest frequencies. However, this haplogroup is supposed to have originated somewhere in Siberia 20.000 years ago. It is also found in Europeans at a frequency of 0.5-2.5%. Tungusic people has this haplogroup at lower frequencies such as 4.2% whereas Selkups has it at %66.4 . Kets who are of Dene-Yenisey language family has haplogroup Q at %93.7 . Turkic people also has this haplogroup, but it is observed that it is not more than 10%. Haplogroup R1a: Haplogroup R1a is a common Y-DNA haplogroup which is usually observed in Turkic, Germanic and Slavic people of Eurasian steppes at significant frequencies. It is interesting that this haplogroup is especially observed in Kygyz people in Central Asia at a frequency of 68%, which is a significant amount. This haplogroup is found in nearly all Turkic people at lower or higher frequencies. Haplogroup R1b: Haplogroup R1b is also common in Turkic and Western European people. Haplogroup R1b is found at a higher frequency in especially Bashkirs in Ural-Volga region. This haplogroup is also found in other Turkic people at various frequencies. Haplogroup R2: Haplogroup R2 is a more common haplogroup in Southern Asia; however, it is also observed in Central Asian Turkic people at various frequencies. Haplogroup T: Haplogroup T is sparsely populated in Southern Asia, Europe and Eastern Africa, but this haplogroup is also found in Central Asian Turkic people at lower frequencies.           For people who say the old turkic people were mongloid, whats living Turks ? Clearly they are not mongloid. If Turkish peope, Uzbeks, Tatars, Kyrgyz people, Uyghurs and other Turkic people aren’t Turkic who are Turkic and where they live ? Finally genetically Turks are more indo-european than most of all indo-iranian. Languages or language families don’t make people related, dna does. ",
            "date": "Answered September 21, 2019",
            "views": "1",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mooji Kang",
                    "user_href": "/profile/Mooji-Kang"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/2-Wilhelm"
                },
                {
                    "user_id": "Tunca Doğan Tırpan",
                    "user_href": "/profile/Tunca-Doğan-Tırpan"
                },
                {
                    "user_id": "Ichabod Crane",
                    "user_href": "/profile/Ichabod-Crane-27"
                },
                {
                    "user_id": "Gulcin Aydgn",
                    "user_href": "/profile/Gulcin-Aydgn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cengiz Çelik",
                "href": "/profile/Cengiz-Çelik-6"
            },
            "answer_text": "Yes, Turkic people originated from East Eurasians (Mongoloid) populations. The Turkic people largely descend from the Northeast Asian/Siberian community based in Manchuria and eastern Mongolia.  The proto-Turks are genetically fully East Asian/Siberian and later expanded to many parts of Eurasia. We were successful and powerful warriors and Turkic clans also played a noteworthy part in the history of China. Turkish people in Turkey still have Turkic blood and East Asian phenotypes are more common than many think.       East Eurasin ancestry (Mongoloid lineage) is present in all Turkic people. Turkish people have according to a 2014 genetic study about 21,7% East Asian DNA. Turkic warriors from historical documentary movie:  Most warriors of the Mongol empire were also Turkic. Mongols were always rather small ethnic group, as today. I am Turkish, living in Vienna, and have East Asian phenotypes. Not fully, but clearly East Asian ancestry breaks through. ",
            "date": "Answered October 14, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexei Muraki",
                    "user_href": "/profile/Alexei-Muraki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tamizh Deva",
                "href": "/profile/Tamizh-Deva"
            },
            "answer_text": "The original Turks clearly yes. The Turkic people are believed to have originated in today Manchuria (northeastern China). They were partially agriculturalists but adopted a nomadic life. Than they started their journey to the West. (The Turkic migration). During and after the conquest of Central-Asia and some other places, they assimilated some of the locals (mostly Indo-Europeans). Thus several modern Turkic groups look mixed (half white half east-asian). This for example is emperor Gaozu (also known as Liu Zhiyuan (劉知遠)).He is a Shatuo-Turk.  The Shatuo-Turks ruled over parts of northern China and created several dynasties. After the fall of them, they were assimilated into the Chinese sphere. This happend also vice versa, some Han-Chinese migrated north and were assimilated into the Turkic groups. A chinese chronic say: The Turks are similar to our Han people. We can not see any difference at first. If a Turk speaks Chinese and wear chinese cloaths we can not identify him as non-Han. To the main question again: The original Turks are closely related to the Mongolians but also to other East-Asians. ",
            "date": "Updated March 16, 2019",
            "views": "2",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Li Shu Yan",
                    "user_href": "/profile/Li-Shu-Yan"
                },
                {
                    "user_id": "Cengiz Çelik",
                    "user_href": "/profile/Cengiz-Çelik-6"
                },
                {
                    "user_id": "Mahyar Ahmadi",
                    "user_href": "/profile/Mahyar-Ahmadi-1"
                },
                {
                    "user_id": "Lothar Gustaffson",
                    "user_href": "/profile/Lothar-Gustaffson"
                },
                {
                    "user_id": "Alexei Muraki",
                    "user_href": "/profile/Alexei-Muraki"
                },
                {
                    "user_id": "Armin Nahalbandian",
                    "user_href": "/profile/Armin-Nahalbandian"
                },
                {
                    "user_id": "Julian Fejzo",
                    "user_href": "/profile/Julian-Fejzo"
                },
                {
                    "user_id": "Smitty Schmee",
                    "user_href": "/profile/Smitty-Schmee"
                },
                {
                    "user_id": "Bobby Chen",
                    "user_href": "/profile/Bobby-Chen-26"
                },
                {
                    "user_id": "Amarsanaa Narmandakh",
                    "user_href": "/profile/Amarsanaa-Narmandakh-1"
                },
                {
                    "user_id": "Aybüke Kaya",
                    "user_href": "/profile/Aybüke-Kaya"
                },
                {
                    "user_id": "Gaurav Gurkhe",
                    "user_href": "/profile/Gaurav-Gurkhe"
                },
                {
                    "user_id": "Phạm Chi Mai",
                    "user_href": "/profile/Phạm-Chi-Mai-1"
                },
                {
                    "user_id": "Cliff A. Raynor",
                    "user_href": "/profile/Cliff-A-Raynor"
                },
                {
                    "user_id": "Cengizhan Tünaydın",
                    "user_href": "/profile/Cengizhan-Tünaydın"
                },
                {
                    "user_id": "Juliana Schiesari",
                    "user_href": "/profile/Juliana-Schiesari"
                },
                {
                    "user_id": "S.P. Cheng",
                    "user_href": "/profile/S-P-Cheng"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atakan Türkkök",
                "href": "/profile/Atakan-Türkkök"
            },
            "answer_text": "Mongolid is a really bad term and I dont like it, how about we use just the word asian? Yes, for the most part ancient turks were predominantly asian with a little caucasoid admixture. Turks migrated more to the western parts after the fall of the gokturk khaganate and became more and more white/caucasoid. Turks are asians but not eastasians like chinese ,koreans, japanese but rather central asians. Turkic people are nomadic, warriors, steppepeople who believed to tengri. Our ethnic cousins were the mongols, tungus people. Since turks are nomadic people, turkic people have scattered to all parts of the world, mixing with the local inhabitans of the lands they migrated. This is why most of us have different genetic make ups and different Haplogroups. ",
            "date": "Answered March 16, 2018",
            "views": "988",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melika Babaei",
                    "user_href": "/profile/Melika-Babaei"
                },
                {
                    "user_id": "Amarsanaa Narmandakh",
                    "user_href": "/profile/Amarsanaa-Narmandakh-1"
                },
                {
                    "user_id": "Pete Mylonas",
                    "user_href": "/profile/Pete-Mylonas"
                },
                {
                    "user_id": "Erika Butler",
                    "user_href": "/profile/Erika-Butler-バトラー-エリカ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bobby Chen",
                "href": "/profile/Bobby-Chen-26"
            },
            "answer_text": "Absolutely; the “mongoloid” is the father of the Turkic people:   ",
            "date": "Answered April 24, 2019",
            "views": "555",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexei Muraki",
                    "user_href": "/profile/Alexei-Muraki"
                },
                {
                    "user_id": "Cengiz Çelik",
                    "user_href": "/profile/Cengiz-Çelik-6"
                },
                {
                    "user_id": "Bishka",
                    "user_href": "/profile/Bishka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Gupta",
                "href": "/profile/Rohit-Gupta-1473"
            },
            "answer_text": "This happened because of Muhammad Ghori. Pls read this. Rohit Gupta's answer to Did Prithviraj Chauhan really kill Ghauri? ",
            "date": "Answered June 10, 2019",
            "views": "376",
            "upvotes": "0"
        }
    ]
}