{
    "title": "Are there any history books recommendations on East Asia? - Quora",
    "tags": [
        "East Asia",
        "History Books",
        "Asia",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Graham",
                "href": "/profile/Bruce-Graham-1"
            },
            "answer_text": "Thanks for your question. If you want your history in an easily digestible form, written in a novelistic and clear way- one author to investigate is Sterling Seagrave. He has written books about Japan, China, The Philippines. Any one of these books will alter your perspective, bring new insights, open new horizons and give you a new perspective. This is the history where the curtain is ripped open and places explored where very few other historians dare to go. Try The Soong Dynasty for example, if you want to know about China’s 20th Century. If you ever wondered about the ties between Taiwan’s rulers and gangsters- this is a great beginning.  Image: The Soong Dynasty Here is Sterling on the Philippines:  Source: The Marcos Dynasty eBook: Sterling Seagrave Possibly Mr. Seagrave’s most controversial book:  What happened to the Japanese gold looted during the war? Image: Gold Warriors: America's Secret Recovery of Yamashita's Gold: Sterling Seagrave, Peggy Seagrave A review of the book is here: LRB · Chalmers Johnson · The Looting of Asia: Japan, the US and stolen gold ",
            "date": "Answered August 2, 2018",
            "views": "208",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Berglund",
                    "user_href": "/profile/David-Berglund-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fardeen Hook",
                "href": "/profile/Fardeen-Hook"
            },
            "answer_text": "this is a recommendation for you >> A History of East Asia: From the Origins of Civilization to the Twenty-First Century 1st Edition I Hope This Helps You ",
            "date": "Answered August 27, 2018",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Misael Jackson",
                "href": "/profile/Misael-Jackson"
            },
            "answer_text": "Here you can get it directly ⇩ ⇰ File formats: ePub, PDF, Kindle, Audiobook, mobi, ZIP. Download ~ >> A History of East Asia: From the Origins of Civilization to the Twenty-First Century",
            "date": "Answered July 26, 2018",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elliot Clark",
                "href": "/profile/Elliot-Clark-15"
            },
            "answer_text": "Please visit my Blog to find the book you are looking for and download it for free. Click the link below The Lost History of Christianity ",
            "date": "Answered August 13, 2018",
            "views": "33",
            "upvotes": "0"
        }
    ]
}