{
    "title": "Are the Cherokee and the other 'Five Civilized Tribes' extinct? It seems that most who claim ancestry from these tribes are racially mixed. - Quora",
    "tags": [
        "Choctaw Nation of Oklahoma",
        "Trail of Tears",
        "Cherokee Nation",
        "Native Americans"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert P. Collins",
                "href": "/profile/Robert-P-Collins"
            },
            "answer_text": "The Five Tribes are the Cherokee, Chickasaw, Choctaw, Creek, and Seminole nations. They all come from the American Southeast. Having met and spoken with members of four of the Five Tribes, I can assure you that they are not extinct, and they are in no more danger of dying out than any other distinctive cultural group in the United States. If we are tempted to think otherwise, it is only because of our own tradition of assuming that the American Indians in general are a “dying race.” This says more about us Wvcenv (“Virginians,” Anglo-Americans) than it does about the original Americans. As for their being “racially mixed,” their so-called racial purity is a concern introduced by white people and our racial pseudo-science. It is closely related to our historic obsession with skin color as a criterion for sorting human beings into superior and inferior categories. Indian tribes didn’t worry about such things. Belonging to a tribe was like belonging to a family; you could be born, adopted, or married in, with the community’s consent. The concept of blood quantum — of being, for example, seven-eighths Cherokee and one-eighth white — is a racist conceit that was imposed on the tribes by the federal government. Initially it was a measure of presumed inferiority: The higher the quantity of “Indian blood,” the lower the individual’s presumed capacity for intellect, self-control, and “civilization.” We no longer endorse such 18th-century doctrines as phrenology, animal magnetism, and the caloric theory, but many of us still have trouble shedding belief in race and in white supremacy. The idea of a “full-blood” Indian is an artificial construct as well, as all tribes practiced exogamy (marrying outside the group), whether they merely tolerated it or actively encouraged it. There were no “uncontacted” tribes in the United States in 1800, and all the Indian communities contacted by Lewis and Clark’s “Corps of Discovery” (1804–06) already had a history of contact with white people. Two members of the Corps were already married to Indian (Dakota and Shoshone) women from the region being “discovered.” The children of these men were “half-breeds” or “mixed-bloods” to Americans, and “métis” to French-speaking Canadians, but to their Native relatives they were Dakota or Shoshone, period. Some tribal governments have rejected blood quantum as a standard for membership, but most retain it — partly as a means to exclude culturally white people who claim to be entitled to tribal membership by virtue of “blood” alone. Now that Native American identity is seen as an honor rather than a stigma, some whites strive to acquire it as assiduously as their ancestors strove to acquire Indian land. Besides, many white people imagine that tribal membership is always accompanied by a financial windfall, or else they hope to receive earmarked college scholarship money. In my experience, they seldom demonstrate any interest in “their” tribe except as a source of valuable assets and historical curiosities. It seldom occurs to them that they might have an obligation to future generations. By the way, all five of the tribes mentioned in this question have rejected the patronizing label of “Civilized,” which implies that their fellow Native Americans are uncivilized. They simply call themselves the Five Tribes, with the understanding that this means the five southeastern nations that were subjected to forced removal ca. 1832–1850. ",
            "date": "Answered August 9, 2018",
            "views": "996",
            "upvotes": " View 47 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Theresa Vaughan",
                    "user_href": "/profile/Theresa-Vaughan-6"
                },
                {
                    "user_id": "Weyodi O'Clerc Stern",
                    "user_href": "/profile/Weyodi-OClerc-Stern"
                },
                {
                    "user_id": "Logan Robertson",
                    "user_href": "/profile/Logan-Robertson-40"
                },
                {
                    "user_id": "Kevin Taylor",
                    "user_href": "/profile/Kevin-Taylor-332"
                },
                {
                    "user_id": "Yes Indeed",
                    "user_href": "/profile/Yes-Indeed-11"
                },
                {
                    "user_id": "Britnee Blandin",
                    "user_href": "/profile/Britnee-Blandin-1"
                },
                {
                    "user_id": "Normandie Kent",
                    "user_href": "/profile/Normandie-Kent-2"
                },
                {
                    "user_id": "Patricia Niuryth",
                    "user_href": "/profile/Patricia-Niuryth"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Leo-Proctor"
                },
                {
                    "user_id": "Heather Frigiola",
                    "user_href": "/profile/Heather-Frigiola"
                },
                {
                    "user_id": "Cynthia Floyd",
                    "user_href": "/profile/Cynthia-Floyd"
                },
                {
                    "user_id": "Clay Elam",
                    "user_href": "/profile/Clay-Elam"
                },
                {
                    "user_id": "Mary Ann Mills",
                    "user_href": "/profile/Mary-Ann-Mills"
                },
                {
                    "user_id": "Ahmad Nisar",
                    "user_href": "/profile/Ahmad-Nisar-2"
                },
                {
                    "user_id": "Andrew Holmes McClure",
                    "user_href": "/profile/Andrew-Holmes-McClure"
                },
                {
                    "user_id": "Escofhari Baba",
                    "user_href": "/profile/Escofhari-Baba"
                },
                {
                    "user_id": "Kim K Nguyen",
                    "user_href": "/profile/Kim-K-Nguyen"
                },
                {
                    "user_id": "Svend Marup Jensen",
                    "user_href": "/profile/Svend-Marup-Jensen-1"
                },
                {
                    "user_id": "Stewart Dean",
                    "user_href": "/profile/Stewart-Dean-1"
                },
                {
                    "user_id": "Vijay Murthy",
                    "user_href": "/profile/Vijay-Murthy-16"
                },
                {
                    "user_id": "Michael Sheldon Reed",
                    "user_href": "/profile/Michael-Sheldon-Reed"
                },
                {
                    "user_id": "Nigel Davies",
                    "user_href": "/profile/Nigel-Davies-6"
                },
                {
                    "user_id": "Steven Brownfield",
                    "user_href": "/profile/Steven-Brownfield"
                },
                {
                    "user_id": "Judi Goldstein",
                    "user_href": "/profile/Judi-Goldstein"
                },
                {
                    "user_id": "Deborah Savage",
                    "user_href": "/profile/Deborah-Savage-13"
                },
                {
                    "user_id": "Chris Fagg",
                    "user_href": "/profile/Chris-Fagg"
                },
                {
                    "user_id": "James Swanson",
                    "user_href": "/profile/James-Swanson-39"
                },
                {
                    "user_id": "Randy Nino",
                    "user_href": "/profile/Randy-Nino"
                },
                {
                    "user_id": "Adam Holt",
                    "user_href": "/profile/Adam-Holt-28"
                },
                {
                    "user_id": "Erik Painter",
                    "user_href": "/profile/Erik-Painter"
                },
                {
                    "user_id": "Carmen Kotting",
                    "user_href": "/profile/Carmen-Kotting"
                },
                {
                    "user_id": "Sheila Johnson",
                    "user_href": "/profile/Sheila-Johnson-11"
                },
                {
                    "user_id": "Barbara Brugger",
                    "user_href": "/profile/Barbara-Brugger"
                },
                {
                    "user_id": "Erik Lund",
                    "user_href": "/profile/Erik-Lund-1"
                },
                {
                    "user_id": "Akshay Subramaniam",
                    "user_href": "/profile/Akshay-Subramaniam-5"
                },
                {
                    "user_id": "Lauren Connelly",
                    "user_href": "/profile/Lauren-Connelly-5"
                },
                {
                    "user_id": "Gloria Cole",
                    "user_href": "/profile/Gloria-Cole-1"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Wayne Fallis",
                    "user_href": "/profile/Wayne-Fallis"
                },
                {
                    "user_id": "Tara Nitka",
                    "user_href": "/profile/Tara-Nitka"
                },
                {
                    "user_id": "Daniel Hungerford",
                    "user_href": "/profile/Daniel-Hungerford"
                },
                {
                    "user_id": "Gabriel J. Ferrer",
                    "user_href": "/profile/Gabriel-J-Ferrer"
                },
                {
                    "user_id": "John Bartram",
                    "user_href": "/profile/John-Bartram"
                },
                {
                    "user_id": "Julie Slama",
                    "user_href": "/profile/Julie-Slama-2"
                },
                {
                    "user_id": "Steve Williams",
                    "user_href": "/profile/Steve-Williams-394"
                },
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                },
                {
                    "user_id": "Peri Collins",
                    "user_href": "/profile/Peri-Collins-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erik Painter",
                "href": "/profile/Erik-Painter"
            },
            "answer_text": "No. Absolutely not. The Cherokee, Chickasaw, Choctaw, Creek (Muscogee), and Seminole are not “extinct”. I can tell you don’t realize it, but what you are implying about “racially mixed” is racist pseudo-science nonsense. They are in no danger of going extinct. They have vibrant and growing cultures. You can go and meet these people. They are real. Membership in a tribe is determined by the tribal government laws. Just like citizenship in the UK, Germany, or Ireland, or the US. Each federally recognized tribe has an elected government. They set up the rules. Some require direct descent from a tribal member about 100 years ago in 1907. Some require that you have at least one parent or grandparent who was a tribal member. There are many different standards. This is not really any different than the way different countries have different standards. In Germany, for many years people whose families had moved to Russia in the time of Catherine the Great could move “back” and become citizens. If one of your grandparents was an Irish citizen who was born in Ireland, but neither of your parents was born in Ireland, you may become an Irish citizen. In Spain, if your mother or father was Spanish or if a grandparent was exiled, you can become Spanish. Those people who choose to do that are “really Irish” or whatever. It does not matter what “race” some of your relatives are. The Prime Minster of Ireland, Leo Eric Varadkar, has a father born in India. He was born in Ireland and raised Hindu and Catholic. He is “really” Irish. Having mixed heritage does not mean he is less Irish. The same goes for Winston Churchill who had an American mother. Or, sadly it is true, Trump. His mother was born and raised in Scotland and his father was conceived in Germany. Being part of an ethnic group or citizen or enrolled tribal member is in part about rules the group has but also about culture. It is not often about race. The Cherokee or Choctaw cultures have been in continuous existence. They did not “die out”. Like all living cultures they are not preserved in aspic, but undergo continual change. But there is continuity. Members are “really” tribal members. The culture is not “extinct”. If someone has a white American grandfather but is raised as part of the community, they are truly Choctaw (or other tribe). The “Five Tribes” have in common with each other that most of them were forced out of homelands east of the Mississippi and had to move to Oklahoma. Today there are three federally recognized Cherokee tribal governments. They are The Eastern Band in North Carolina. They have about 12,000 enrolled members. Home - Eastern Band of Cherokee . Cherokee Nation in Oklahoma has around 288,749 members.Cherokee Nation > Home . And the United Keetoowah Band in Oklahoma has about 14,300 United Keetoowah Band of Cherokee Indians in Oklahoma, UKB The Mississippi Band of Choctaw Indians (MBCI) has about 10,000 members. Mississippi Band of Choctaw Indians . Choctaw Nation of Oklahoma has about 223,272 enrolled members.Homepage | Choctaw Nation The Jena Band of Choctaw Indians has only 241 members. Welcome to Jena Choctaw The MOWA Band of Choctaw Indians is a Alabama State recognized tribe and have a pretty good case to become federally recognized. They have 3,600 members. Mobile and Washington Counties in Alabama The Chickasaw Nation is in Oklahoma where they were forced to relocate. Home | Chickasaw Nation They are the 13th largest recognized tribe with 38,000 members. The Muscogee (Creek) are now part of one of 9 federally recognized tribes. The Muscogee (Creek) Nation is in Oklahoma. There are 80,591 people enrolled in the Muscogee Creek Nation, Muscogee (Creek) Nation. The Alabama-Quassarte Tribal Town is in Oklahoma and has 369 members, Alabama-Quassarte Tribal Town. The Kialegee Tribal Town in Oklahoma has 700 members, kialegeetribal The Thlopthlocco Tribal Town based in Oklahoma has 845 members, Thlopthlocco Tribal Town of Oklahoma. The Poarch Band of Creek Indians of Alabama has about 3,000 members, The Poarch Band of Creek Indians. The Coushatta Tribe of Louisiana, Coushatta Tribe of Louisiana has 940 members. And the Alabama-Coushatta Tribe of Texas has 1,100 members, ALABAMA-COUSHATTA TRIBE OF TEXAS. The Seminole are in three federally recognized tribal governments. The Seminole Nation of Oklahoma has 18,800 members, Seminole Nation of Oklahoma. The Seminole Tribe of Florida has 4,000 members, Seminole Tribe of Florida - The Official Home of the Florida - Seminole Indians. The Miccosukee Tribe of Indians of Florida was part of the Seminole tribal government until 1962. They have about 400 members, Miccosukee Resort & Gaming ",
            "date": "Updated August 11, 2018",
            "views": "12",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Taylor",
                    "user_href": "/profile/Kevin-Taylor-332"
                },
                {
                    "user_id": "Britnee Blandin",
                    "user_href": "/profile/Britnee-Blandin-1"
                },
                {
                    "user_id": "Jeff Collins",
                    "user_href": "/profile/Jeff-Collins-24"
                },
                {
                    "user_id": "Randy McDonald",
                    "user_href": "/profile/Randy-McDonald"
                },
                {
                    "user_id": "John Philip",
                    "user_href": "/profile/John-Philip-5"
                },
                {
                    "user_id": "Oliver Schnee",
                    "user_href": "/profile/Oliver-Schnee"
                },
                {
                    "user_id": "Pontus Rudholm",
                    "user_href": "/profile/Pontus-Rudholm"
                },
                {
                    "user_id": "Alessandro Piccirilli",
                    "user_href": "/profile/Alessandro-Piccirilli-1"
                },
                {
                    "user_id": "Jawad Yuwono",
                    "user_href": "/profile/Jawad-Yuwono"
                },
                {
                    "user_id": "Teena Hiesberger",
                    "user_href": "/profile/Teena-Hiesberger-1"
                },
                {
                    "user_id": "Gerard van Wilgen",
                    "user_href": "/profile/Gerard-van-Wilgen"
                },
                {
                    "user_id": "J.W. Saret",
                    "user_href": "/profile/J-W-Saret"
                },
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "Sam Schowalter",
                    "user_href": "/profile/Sam-Schowalter-3"
                },
                {
                    "user_id": "Gloria Cole",
                    "user_href": "/profile/Gloria-Cole-1"
                },
                {
                    "user_id": "Robert P. Collins",
                    "user_href": "/profile/Robert-P-Collins"
                },
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                },
                {
                    "user_id": "Norman Owen",
                    "user_href": "/profile/Norman-Owen"
                },
                {
                    "user_id": "Yosey Huff",
                    "user_href": "/profile/Yosey-Huff"
                },
                {
                    "user_id": "Tom Graves",
                    "user_href": "/profile/Tom-Graves"
                },
                {
                    "user_id": "Marva Dasef",
                    "user_href": "/profile/Marva-Dasef"
                },
                {
                    "user_id": "Nicole Ballard",
                    "user_href": "/profile/Nicole-Ballard"
                },
                {
                    "user_id": "Steve Williams",
                    "user_href": "/profile/Steve-Williams-394"
                },
                {
                    "user_id": "Lisa Marie Ambrose",
                    "user_href": "/profile/Lisa-Marie-Ambrose"
                },
                {
                    "user_id": "Ben Waggoner",
                    "user_href": "/profile/Ben-Waggoner-1"
                },
                {
                    "user_id": "Michael Alvis",
                    "user_href": "/profile/Michael-Alvis-1"
                },
                {
                    "user_id": "Mills Baker",
                    "user_href": "/profile/Mills-Baker"
                },
                {
                    "user_id": "Sasu Xinkang Ölander",
                    "user_href": "/profile/Sasu-Xinkang-Ölander"
                },
                {
                    "user_id": "Chinmay Talikoti",
                    "user_href": "/profile/Chinmay-Talikoti"
                },
                {
                    "user_id": "Dimitris Almyrantis",
                    "user_href": "/profile/Dimitris-Almyrantis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Riggsby",
                "href": "/profile/Matt-Riggsby"
            },
            "answer_text": "No, they’re definitely still around. I’ve been though the Cherokee reservation in North Carolina, and there are rather more in Oklahoma. There are likewise members of the other tribes around the country in various places. Despite concerted efforts to wipe them out, these tribes survive. Indeed, the Cherokee and Choctaw are respectively the largest and third largest federally recognized tribes. It is certainly the case that there are a great many people in those tribes who don’t have pure native ancestry, and there are still more people who claim ancestry in those tribes, particularly the Cherokee, who don’t seem particularly native at all. The former, certainly, is not surprising. Mixed heritage is pretty common among modern native Americans, with something like half of tribal members having some kind of non-native ancestry. The Cherokee and Seminoles in particular took a good number of outsiders into their tribes. Having close association with Cherokee is often a source of family myths that they have “Cherokee blood,” when at most their entirely non-native families might have been legally inducted into the tribe without any actual intermarriage taking place. ",
            "date": "Answered July 10, 2018",
            "views": "16",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bobby Young",
                    "user_href": "/profile/Bobby-Young-86"
                },
                {
                    "user_id": "Jimmy Maxwell",
                    "user_href": "/profile/Jimmy-Maxwell-12"
                },
                {
                    "user_id": "Roger Harley",
                    "user_href": "/profile/Roger-Harley-1"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Anna Maria Schaer",
                    "user_href": "/profile/Anna-Maria-Schaer"
                },
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-235"
                },
                {
                    "user_id": "Deborah Wilson",
                    "user_href": "/profile/Deborah-Wilson-93"
                },
                {
                    "user_id": "Beverly Blalock",
                    "user_href": "/profile/Beverly-Blalock"
                },
                {
                    "user_id": "Lou Coury",
                    "user_href": "/profile/Lou-Coury"
                },
                {
                    "user_id": "Stephen Comer",
                    "user_href": "/profile/Stephen-Comer-4"
                },
                {
                    "user_id": "Charles Knouse",
                    "user_href": "/profile/Charles-Knouse-2"
                },
                {
                    "user_id": "Rich Alderson",
                    "user_href": "/profile/Rich-Alderson"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Deirdre Beecher",
                    "user_href": "/profile/Deirdre-Beecher"
                },
                {
                    "user_id": "Alexandre Bueno",
                    "user_href": "/profile/Alexandre-Bueno"
                },
                {
                    "user_id": "Michael Sheldon Reed",
                    "user_href": "/profile/Michael-Sheldon-Reed"
                },
                {
                    "user_id": "Gabriel J. Ferrer",
                    "user_href": "/profile/Gabriel-J-Ferrer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Lacey",
                "href": "/profile/Lee-Lacey"
            },
            "answer_text": "No, the Five Civilized Tribes are not extinct. You may have to travel a ways to find a 100% full-blooded example, as those tribes have intermarried extensively with “European” stock. That does not mean they are extinct. Tribes establish their criterion for membership one of two ways, and each way has benefits and drawbacks. Blood quantum or percent Indian blood is used by some tribes to define qualification by ancestry in relation to tribal membership. laws. Blood quantum is based on laws were developed by Europeans and thus did not necessarily reflect how American Indians had traditionally identified themselves or members of their tribe, and thus ignored the native practices of absorbing other peoples by adoption. Blood quantum also ignored tribal cultural continuity and could eventually result in no one who can meet the criterion for tribal membership. Another means by which criterion fo tribal membership is set is lineal descent. In this method, members must be able to document descent from original enrollees listed on tribal rolls. This method does not guard the blood quantum of tribal members, so the tribe becomes less visibly Indian, over time. These tribes are now trying to hold onto their culture, for it is tribal culture that is at the center of a tribe. ",
            "date": "Answered July 11, 2018",
            "views": "221",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Taylor",
                    "user_href": "/profile/Kevin-Taylor-332"
                },
                {
                    "user_id": "Jeff Collins",
                    "user_href": "/profile/Jeff-Collins-24"
                },
                {
                    "user_id": "Robert Canales",
                    "user_href": "/profile/Robert-Canales-1"
                },
                {
                    "user_id": "Jan Tupps",
                    "user_href": "/profile/Jan-Tupps"
                },
                {
                    "user_id": "Jean Patton",
                    "user_href": "/profile/Jean-Patton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carmen Kotting",
                "href": "/profile/Carmen-Kotting"
            },
            "answer_text": "The Native American Almanac, Arlene Hirschfelder and Martha Kreips de Montaño list all the recognized tribes, their locales and tribal offices where you can contact them and get information about their numbers, etc. There are still some tribes seeking federal recognition, and some have only state recognition. And, yes there are members who have European mixture as well as those who are mixed with other tribes.. Also, there are many people who claim without definitive proof native ancestry, especially Cherokee, maybe because historically they were part of what was listed as the “Five Civilized Tribes” rather than being related to any of those other “savages”. ",
            "date": "Answered July 10, 2018",
            "views": "136",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Stephen Comer",
                    "user_href": "/profile/Stephen-Comer-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jean Patton",
                "href": "/profile/Jean-Patton"
            },
            "answer_text": "I wouldn’t say that the Cherokee, and those of the Five Civilized tribes are “extinct” – it’s more like they have been very genetically modified over the generations from being exposed to many different peoples since colonization. A person can claim ancestry if the DNA is floating around in their cellular material. It may be that it’s not the same DNA that made up the tribe hundreds of years ago. You are right in your observation that the Native American tribes are racially mixed, but they are still in tribal formation with governing bodies. ",
            "date": "Answered July 11, 2018",
            "views": "99",
            "upvotes": " Answer requested by Michael Sheldon Reed",
            "upvoters": [
                {
                    "user_id": "Jeff Collins",
                    "user_href": "/profile/Jeff-Collins-24"
                },
                {
                    "user_id": "Daryl Woodard",
                    "user_href": "/profile/Daryl-Woodard-1"
                },
                {
                    "user_id": "Jean Patton",
                    "user_href": "/profile/Jean-Patton"
                },
                {
                    "user_id": "Mackenzie Lange",
                    "user_href": "/profile/Mackenzie-Lange-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandy Ellis",
                "href": "/profile/Sandy-Ellis-9"
            },
            "answer_text": "All cultures & races, in my opinion, become extinct when their language isn’t spoken, songs not sung, , and all their traditions are cast away. Even if blood remained 100% pure, the nation would be extinct. As far as I know, The languages, stories, traditions & songs still exist in all the nations that I personally know of. Therefore, they cannot be extinct. ",
            "date": "Answered July 11, 2018",
            "views": "116",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Sheldon Reed",
                    "user_href": "/profile/Michael-Sheldon-Reed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Valencia",
                "href": "/profile/Daniel-Valencia-33"
            },
            "answer_text": "No they are still there many are full blooded others are not but it seems that many wannabes always claim those tribes in particular both black and white many their ancestors did have close friendly relationship with these groups but weren't part of them ",
            "date": "Answered July 10, 2018",
            "views": "70",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jeff Collins",
                    "user_href": "/profile/Jeff-Collins-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig D. Kimball",
                "href": "/profile/Craig-D-Kimball"
            },
            "answer_text": "First of all, “extinct” is not a word used for people or cultures. The term “Five Civilized Tribes” refers to the Cherokee, Muskogee, Choctaw, Chickasaw, and Seminole. Yes, it is true that most members of these tribes are mixed, but there are still full-blooded people. It’s not specific to these five tribes. As a whole, mixed natives are more common than full natives, at least in the U.S. In fact, it’s similar in Australia. Half-aboriginal half-white people are more common than full aboriginal people. ",
            "date": "Answered July 10, 2018",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ralph Goodman",
                    "user_href": "/profile/Ralph-Goodman-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Curtis Proctor-Artz",
                "href": "/profile/Curtis-Proctor-Artz"
            },
            "answer_text": "No, but there are two factions of the Cherokee tribe: one in North Carolina and the other in Oklahoma. Also, the Keetowah Band split off from the Oklahoma tribe and is considered separate now. ",
            "date": "Answered July 12, 2018",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeff Collins",
                    "user_href": "/profile/Jeff-Collins-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Rose",
                "href": "/profile/Alexander-Rose-6"
            },
            "answer_text": "They are not extinct and that's not how it works. It's based on culture, not skin color. ",
            "date": "Answered July 10, 2018",
            "views": "29",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Jamaica Knauer",
                "href": "/profile/Jamaica-Knauer"
            },
            "answer_text": "The actor Wes Studi is Cherokee, and in fact, Cherokee was the first language he learned to speak. :-) ",
            "date": "Answered July 13, 2018",
            "views": "29",
            "upvotes": "0"
        }
    ]
}