{
    "title": "Are there any Huguenots left? - Quora",
    "tags": [
        "Huguenots",
        "Politics of France",
        "History of France",
        "History of Europe",
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bertrand Feuvray",
                "href": "/profile/Bertrand-Feuvray-1"
            },
            "answer_text": "I believe there are many Huguenots left. I was born and raised in France and I once went to a Protestant Church in France. There is some communication between Protestants and Catholics now.When I was living in London, England, I had a job as a Royal Mail deliverer or postman and I once delivered mail to a French Huguenot Church in Soho, London, England. I went in and I saw their Church programs and they were in English and French.I have always like French Huguenots and the fact that they blossomed elsewhere once they left France.I am not proud for being French when I see how a large number of people were treated the way they were. French Huguenots were good French citizens while in France.The hatred against catholic France was translated as a hatred against France among the descendants of French Huguenots in the USA. Benedict Arnold defected to the British because he could not stand to see his native USA side with France. I can understand that very easily because I have met an American guy with a French last name and who had French Huguenot ancestry and he hated France. When I see all the terrible things the Catholic Church did,. I am so surprised that France would not get rid of it when they had a chance with Henry VI who was a French Huguenot and became King of France with the help of the English. ",
            "date": "Answered September 14, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Doucher",
                "href": "/profile/Stephen-Doucher"
            },
            "answer_text": "There are descendants of the Huguenots in Germany, France, the United States, Canada, and elsewhere. It is questionable how many of them are still religious. I had a great-grandmother who was from an American Huguenot family and she intermarried with Lutheran German-Americans. I also went to high school with a man whose mother was from France (and Catholic) and his father was an American and I remember that I asked him about modern Huguenots in France (he had attended elementary school in France, his family lived there when he was younger, and he often went back) and he told me he knew people of Huguenot background in France but that they were as secular as modern French Catholics. ",
            "date": "Answered March 21, 2020",
            "views": "154",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "William Jines",
                    "user_href": "/profile/William-Jines"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lars Eidevall",
                "href": "/profile/Lars-Eidevall"
            },
            "answer_text": "A few thousand came to protestant Scandinavia as refugees, and a few hundred to Sweden. One of them was the forefather of my maternal grandfather in a family of teachers and priests. One if his sons became a wealthy pirate in the Dutch Caribbeans and he owned half of Demerara by Guyana. His inheritance was used to start girl schools in Lund and Stockholm. ",
            "date": "Answered March 21, 2020",
            "views": "52",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "William Jines",
                    "user_href": "/profile/William-Jines"
                },
                {
                    "user_id": "Kim E Ellingsen",
                    "user_href": "/profile/Kim-E-Ellingsen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian George le Fèvre",
                "href": "/profile/Ian-George-le-Fèvre"
            },
            "answer_text": "One right here. Jacques le Fèvre arrived in Fredericia Dk in the 18th century along with the Lacour and other families after 150 years of exile in Poland, Holland and Germany. ",
            "date": "Answered March 21, 2020",
            "views": "36",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adelino José Soares de Mello",
                    "user_href": "/profile/Adelino-José-Soares-de-Mello"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "William Jines",
                    "user_href": "/profile/William-Jines"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adelino José Soares de Mello",
                "href": "/profile/Adelino-José-Soares-de-Mello"
            },
            "answer_text": "I don't think they use the name any longer, but most are very proud of their heritage. I have met quite a few in Germany, South Africa and other places. I was a very close friend of some. Funnily, I don't remember ever meeting any in France. I'm sure there must be some. ",
            "date": "Answered March 26, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Luiz Carlos Lopez",
                    "user_href": "/profile/Luiz-Carlos-Lopez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter de Loriol",
                "href": "/profile/Peter-de-Loriol-1"
            },
            "answer_text": "Yes, there are many temples where they worship in France and Geneva, at least. As far as families of Huguenot heritage, they are all over the world: USA, UK, all the English speaking countries, all protestant Europe, Russia… Famous Huguenot names and others. ",
            "date": "Answered March 20, 2020",
            "views": "49",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "William Jines",
                    "user_href": "/profile/William-Jines"
                }
            ]
        }
    ]
}