{
    "title": "Are Vlachs descended from Romanians or are Romanians descended from Vlachs? - Quora",
    "tags": [
        "Romanian Ethnicities and People",
        "Romania"
    ],
    "response": [
        {
            "author_info": {
                "name": "Razvan Baba",
                "href": "/profile/Razvan-Baba"
            },
            "answer_text": "Tl;dr: yes, with any meaning of the word Vlach. If referring to Vlach as “the Balkan Romance-speaking peoples who live south of the Danube in what are now eastern Serbia, southern Albania, northern Greece, North Macedonia, and southwestern Bulgaria, as indigenous ethnic groups” [Wikipedia/Vlach], then the answer is “yes”. the culture mingled to the point where there is little to no genetic difference. Whoever is looking for minute differences in haplogroups, is either lying or is basing their study on a very tiny sample of people of “arbitrarily pure” descent, likely to prove one political viewpoint or another. If referring to Vlach as the historic inhabitants of Wallachia, then the answer is also yes. Many of the loosely similar indigenous groups were already in existence before Wallachia was formed in form of czarates and voivodates, thanking in part to rich forests and very low population density. As other answers pointed out, Vlach is an exonym. The native name for Wallachia was Țeara Rumânească(later name Țara Românească, Church Slavonic Цара Рꙋмѫнѣскъ ). Rumân is a historic term used to refer to the ethnicity of Romance speaking, chiefly Eastern Christian people now referred to as Romanian. ",
            "date": "Answered December 21, 2019",
            "views": "173",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nikolay Ivanov",
                    "user_href": "/profile/Nikolay-Ivanov-62"
                }
            ]
        },
        {
            "author_info": {
                "name": "Iulian Arion",
                "href": "/profile/Iulian-Arion-1"
            },
            "answer_text": "None! The Vlahians from the Balkan Peninsula evolved separately compared to the population in the northern Danube. The Vlahians from the Balkan Peninsula are the descendants of the Latin-speaking people from ancient times, who lived in those places. In the territory of Romania, the evolution of Latinity was through acculturation during the Romanian republic: Iulian Arion's answer to How did Moldova end up as a Romance-speaking country, when its territory was not even part of the Roman Empire? After the Roman conquest, colonists from all over the Roman empire were brought. Iulian Arion's answer to Do the Romanians descend from the Romans in any way? In the territory of Dacia begin to come as intruders from the north. it enters acculturation with the local population and with the Sarmatians.They created Santana de Mures - Cherniachov culture. Where did the goths, the vandals, the huns, the gepids, the avars and the other migratory people come from? Where was their homeland and what made them leave it? ",
            "date": "Answered December 22, 2019",
            "views": "88",
            "upvotes": " Answer requested by Andreas Rodrigues Bonic",
            "upvoters": [
                {
                    "user_id": "Dan Miclea",
                    "user_href": "/profile/Dan-Miclea"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atipic Micu",
                "href": "/profile/Atipic-Micu"
            },
            "answer_text": "To my knowledge Vlach is a name given by some foreigners to Romanians and Aromanians (I’m including under this name, not entirely justified, all the romance speaking from the Balkans, south of Danube, other than Daco-Romanians) . You are probably referring to Aromanians. If that’s the case my two cents theory is that they are remnants of the old Latin (Thracian?) speaking population from the Balkanic region of the Roman empire. ",
            "date": "Answered December 22, 2019",
            "views": "63",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jude Bennett",
                    "user_href": "/profile/Jude-Bennett-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nyerges Á. Zoltán",
                "href": "/profile/Nyerges-Á-Zoltán"
            },
            "answer_text": "Vlach=Volokh=rumân=român=romanian in english These words mean the same nation. Today the bulk of them live north to the Danube in Romania. ",
            "date": "Answered December 22, 2019",
            "views": "64",
            "upvotes": " View 1 Upvoter"
        }
    ]
}