{
    "title": "Are there any mysteries left in the world? - Quora",
    "tags": [
        "Mysteries",
        "Nature",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Johannesen",
                "href": "/profile/Alexander-Johannesen"
            },
            "answer_text": "Seriously? :) Anything science pursues is a mystery, from the plumes on Eceladus (we know what they are, but not how they work apart from theories of compaction), to natural bridges on the moon (erosion, impact, collapse?), to what makes methane on Mars (life, death, something non-organic?), to pretty much a million questions more. What about what happens to moving objects traveling through the Kuiper belt, why the slow-down? What model universe do we live in? What was before the singularity?  Perhaps you mean mystery as something we can't even properly theorize about, something that we have so little data of to render it as pure speculation? Like, is there alien life, or, can a politician ever be trusted? Or maybe something more down to Earth, like, where did all the Nazi gold go? Where is Atlantis? Was there ever a El Dorado? Or the usual hotch-potch of illuminati, pyramids, astrology and crusaders in a stupifying but otherwise lucrative batch of mysteries? I think the short answer will always be \"yes.\" In fact, do we truly know anything? Even the simplest knowledge you think you have can be torn apart by well-placed epistemological arguments. Want true mystery? Try philosophy. ",
            "date": "Answered September 28, 2010",
            "views": "583",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Pudalov",
                    "user_href": "/profile/Eric-Pudalov"
                },
                {
                    "user_id": "Jon Davis",
                    "user_href": "/profile/Jon-Davis-10"
                },
                {
                    "user_id": "Amir Ilman",
                    "user_href": "/profile/Amir-Ilman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sella Rafaeli",
                "href": "/profile/Sella-Rafaeli"
            },
            "answer_text": "A good place to start is naturally Wikipedia, e.g. http://en.wikipedia.org/wiki/Category:Lists_of_unsolved_problems Random 10 of my personal favorites (not off Wikipedia): Technology / Physics- Higg's Boson (\"The God Particle\") - does it exist? (CERN particle accelerator actually making headway towards that one)- Black Holes - what's that all about?- P =/!= NP? - Artificial Intelligence - will any computer ever pass the Turing Test?- Will/When we ever be able to place a human space colony outside Earth? - Psychology - In general, succinctly: why do humans do what we do? - Does free will exist? (Neuro-evidence has come a long way in scientifically refuting this in recent years.) - History / Humanity- How much of the Bible actually happened?- How will mainstream ('Western'?) morals change over the next 200 years? (They've certainly changed in the last 200 years.)- How long will the USA remain a superpower? (Who'll come next?) Despite continually convincing ourselves otherwise, I think we don't even have a general idea of what the hell is going on. Everything is still a mystery. ",
            "date": "Answered May 13, 2012",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Pudalov",
                    "user_href": "/profile/Eric-Pudalov"
                },
                {
                    "user_id": "Umesh Naik (उमेश नाईक)",
                    "user_href": "/profile/Umesh-Naik-उमेश-नाईक"
                },
                {
                    "user_id": "Adam Campbell",
                    "user_href": "/profile/Adam-Campbell"
                },
                {
                    "user_id": "Jon Davis",
                    "user_href": "/profile/Jon-Davis-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phil Luong",
                "href": "/profile/Phil-Luong"
            },
            "answer_text": "This isnt very related to your detailed question but here I go anyways... Sentinel Island. Only place that's never been colonized. No one knows anything about the island except that there are indigenous people who live there. They also run around naked. ",
            "date": "Answered May 13, 2012",
            "views": "18",
            "upvotes": "0"
        }
    ]
}