{
    "title": "Are Jats the descendents of Aryans or Scythians? - Quora",
    "tags": [
        "Scythians",
        "Jat Ethnicity and People",
        "Descendants"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manpreet Sohal",
                "href": "/profile/Manpreet-Sohal-33"
            },
            "answer_text": " people above in this pic are rajputs, so tell me guys do they look like central Asian? I agree everyone in India are mixed but simple question I want to ask do they even look bit central Asian? Rajput doesn't mean any race if you will go to uttrakhand you will find bit mongoloid rajputs punjabi rajput look more like others punjabi, rajasthani rajputs again a mix one, poor jat if couldn't find girl in his community to marry then he may marry outside his caste since jat doesn't have rules of throwing out of community on this basis, so chances of mixing with time in jats is higher but in rajputs mixing is only possible if any new clan added to them. You are linked to the present royal family speaks about your past or present. Actually rajputs are mix of royal family who stopped adding new clan to them around 16th century, different clan of rajput have different origin so saying rajput represent scythian is not at all correct, maleecha(foreigner) are not allowed in Indian culture and to a kshatriya rank until they embrace kshatriya dharma set by brahmins fully Most probably Agnivanshi rajputs clan are made from foreigner like scythian, huns, since history points around 8th century new kshatriya were made through yug on Mount Abu, now who were these kshatriyas? These were ruling family of scythian, huns and even some low castes. Only brahmin varna is fixed other varna like kshatriya, vaishya and shudra are flexible. So one of our friend is saying jat came from sindh and scythian were ruling region which exclude sindh.     Indo-scythian empire was started from sindh-gujrat, look picture uploaded above, in picture above from 91BC to 360AD you can see who were ruling sindh! In first grapth of 91BC sindh was completely ruled by indo-scythian, in 9CE sindh was partially indo-scythian and partially indo-parthian, who were parthian? They were iranid scythian similar kind of people, now in 41 AD you can Western satrap of scythian partially ruling sindh and partially by indo-parthian who were similar kind of people, in last 360 AD you can see sindh is mostly ruled “Abhira” tribe and little by Western satrap of scythian, now who are “Abhira”, abhira were scythian tribe go and Google it. A guy provided a random pic without any label of who is actually ruling sindh became fact to you! Lol I want to ask simple question at present there is any jat present in sindh? May be few, present sindhi has nothing to do with jats,were original people of punjab, Haryana and western UP coward that Jat occupied most of land of this region? If Jat were migrant from sindh then how comes 90%+ villages of punjab, Haryana founded by jats? Is it even possible? More than sindh population of present is Jat population of just punjab(India+Pakistan), how can a tribe from such a small region can form such a large community in West India? Are you guys illiterate? Just do propaganda to show someone great. if whole demographic of present sindh is changed then you believe scythian ruling West India near Christian Era must have stucked to a same place up to 7–8th century Ad?  Above dna chart represent various community of West India, here Jatt refers to haryanvi jaats, the orange part represents here ‘steppe’, aryans were steppe but with they got mixed that is what present brahmin and Kshatriya represent, but around 2000 year back new people from steppe invaded India those where scythian they also got mixed with time but not as much as older aryan , so in above chart you can see highest steppe is recorded in jats still ignorance is ruling over some Indians mind who can't accept simple things, this chart also represents “Sindhi” people i want to ask you people is there any close relation between ‘jats’ and ‘sindhis’ dna? Sindhi people posses just 30% steppe while jats posses 63% steppe highest in India and in whole South Asia after ‘kalash people’, NE records to 17–22% highest in whole South Asia, highest European blood in whole India around 27%, how can a local sindhi tribe can posses this much NE what a ignorance, chachnama tells about struggle between “Sahi clan, Lohana clan and brahmins”, who are sahi and Lohan? They are jat clans former is found in haryana and latter in punjab, dahir was brahmin when he came to rule for after defeating these Jat clans he tried to impose restriction on these non-hindu origin community! But he got failed, it's better to read whole chachnama then pointing on some specific lines of it, yes scythian were maleecha low people for Hindus like non Muslims are kafir low people for Muslims. Above dna chart source: Are Haryana Jats the closest living descendents of our Vedic forefathers ? Above study is done by professor Rathore a rajput so it is unbias study and it is very well known from past researches there is a community in West India which posses much higher steppe dna than brahmins. It is interesting to note that he has compared jats to real aryan but dna changes introduced in jats dna is around 2000 year back proves later migration Again there is belief made in Indians other than rajputs no one have ruled in past. So listen my clan is ‘malik’ we are called as ‘gathwada’, our khap is also known as gathwada khap, we are gathwada because we have ruled garh ghazni in past we have come from Afghanistan area. Dna wise our haplotype is Q which were of both scythian and huns, dholpur Royal jat is ruling from past 900 years either dholpur or other area but ruling without any gap (it is shown like before 17th century jat has nothing with rule), tell me who had built chittod Fort? Champrati mor, who was Champrati mor? All mor jat are still present in Haryana , our ancestor were mostly illiterate and were not interested in writing his history doesn't mean you will make any story on basis of chachnama. Ain-a-akbari has zamindari data of akbar time period read it you will get to know at that time around 60–70% land of West India was occupied by jats, how it is possible for a non Hindu caste who came from sindh in 11th, 12th century to occupy that much land? Everyone know rajput ruled in past but tell me at present what most of rajputs are doing? In my bagpat area my family personally has used Labour in our field who were rajput woman not even man Rajput woman, many rajput man at present are earning through autorikshaw and even though working as Labour, one who is saying scythian were rulers of West India why they will settle as pastorals doesn't make any sense, rule depends on time, scythian were most hated maleecha by Hindus because of their barbaric nature, do you think brahmins through their mind would have not done anything at that time to make them weak? Harshavardhna Bains was born in present Haryana, all Bains of Haryana and punjab of this region or near region are jats, it is clearly written about him as jit ruler, jit was term at that time used for jats and jit is Indian pronunciation of ge-te(जीट), gete in itself was scythian tribe, harshavardhna mentions about jat khap rule of that time in punjab(punjab and Haryana) and his role in making khap strong and all these things are neglected from history and everything is focused on chachnama, sindh. Around 250 clans of jats are still found in central Asia and Europe is not point to be neglected. Even Gurjar who were famous for Gurjar partihar became milkman and some of their ruling family joined rajputs, gujjar also have central Asian origin most probably from khazar tribe they still have clan known as “hun” everyone know who were hun, other clan like “chechi” is Indian changed pronunciation of “yechi”, other clan like “kasana” are kushan who joined gujars.  Jat people in group. Our kaswan clan is believed to be descendent of kushans I have one kaswan jat friend from rajasthan his pic is below  Most importantly jats(particularly Haryana one) have around 20% NE European dna more than any community in whole South Asia, even more than pasthuns. Reference :https://www.google.com/url?sa=t&source=web&rct=j&url=http://blogs.discovermagazine.com/gnxp/2013/08/what-the-harappa-ancestry-project-has-resolved/&ved=2ahUKEwij2POYz_DhAhUJK48KHUj0CscQFjAAegQIBBAB&usg=AOvVaw2zGYKPmedy8YDr-WCaBgfw For understanding more clearly watch this video of sangwan Jat comparing his dna result with dna of Tajikistan local population, since we know scythian, hun came from above hind Kush.  ",
            "date": "Updated November 18, 2019",
            "views": "36",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashish Kumar",
                    "user_href": "/profile/Ashish-Kumar-20249"
                },
                {
                    "user_id": "Ranjit Lakhbinder Pratap Singh",
                    "user_href": "/profile/Ranjit-Lakhbinder-Pratap-Singh"
                },
                {
                    "user_id": "Rohan Chauhan",
                    "user_href": "/profile/Rohan-Chauhan-88"
                },
                {
                    "user_id": "Alex Denton",
                    "user_href": "/profile/Alex-Denton-34"
                },
                {
                    "user_id": "Rahul Singh",
                    "user_href": "/profile/Rahul-Singh-12766"
                },
                {
                    "user_id": "Gaurav",
                    "user_href": "/profile/Gaurav-1878"
                },
                {
                    "user_id": "Magnus",
                    "user_href": "/profile/Magnus-177"
                },
                {
                    "user_id": "BadAss ChauDhary",
                    "user_href": "/profile/BadAss-ChauDhary"
                },
                {
                    "user_id": "Rehan Salam",
                    "user_href": "/profile/Rehan-Salam-2"
                },
                {
                    "user_id": "Jazz Chaudhary",
                    "user_href": "/profile/Jazz-Chaudhary-3"
                },
                {
                    "user_id": "Adarsh Tomar",
                    "user_href": "/profile/Adarsh-Tomar-12"
                },
                {
                    "user_id": "Hogwarts Express",
                    "user_href": "/profile/Hogwarts-Express-3"
                },
                {
                    "user_id": "Lakshay Vashishtha",
                    "user_href": "/profile/Lakshay-Vashishtha-1"
                },
                {
                    "user_id": "Rohit Bharadwaj",
                    "user_href": "/profile/Rohit-Bharadwaj-35"
                },
                {
                    "user_id": "Faizan Saifi",
                    "user_href": "/profile/Faizan-Saifi-106"
                },
                {
                    "user_id": "Rachna Teotia",
                    "user_href": "/profile/Rachna-Teotia"
                },
                {
                    "user_id": "Shubham Baliyan",
                    "user_href": "/profile/Shubham-Baliyan-15"
                },
                {
                    "user_id": "Hafez Kiman",
                    "user_href": "/profile/Hafez-Kiman"
                },
                {
                    "user_id": "Rohan Meena",
                    "user_href": "/profile/Rohan-Meena-13"
                },
                {
                    "user_id": "Arun Kumar",
                    "user_href": "/profile/Arun-Kumar-23780"
                },
                {
                    "user_id": "Prince Chaudhary",
                    "user_href": "/profile/Prince-Chaudhary-303"
                },
                {
                    "user_id": "Shubham Malik",
                    "user_href": "/profile/Shubham-Malik-78"
                },
                {
                    "user_id": "Desi Sarkar",
                    "user_href": "/profile/Desi-Sarkar"
                },
                {
                    "user_id": "Om Bolan",
                    "user_href": "/profile/ओम-बोलान-Om-Bolan"
                },
                {
                    "user_id": "OM Dagar",
                    "user_href": "/profile/OM-Dagar-4"
                },
                {
                    "user_id": "Harsh Dabas",
                    "user_href": "/profile/Harsh-Dabas-10"
                },
                {
                    "user_id": "Thomas Paine",
                    "user_href": "/profile/Thomas-Paine-59"
                },
                {
                    "user_id": "Priyansh Chaudhary",
                    "user_href": "/profile/Priyansh-Chaudhary-6"
                },
                {
                    "user_id": "Karan Sangwan",
                    "user_href": "/profile/Karan-Sangwan-12"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tony-2604"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashveer H",
                "href": "/profile/Ashveer-H"
            },
            "answer_text": "The Jats are supposed to have migrated from the Sindh region according to the Wikipedia page Jat people - Wikipedia. “ \"Jat\" is an elastic label applied to a wide-ranging, traditionally non-elite,[a] community which had its origins in pastoralism in the lower Indus valley of Sindh.At the time of Muhammad bin Qasim's conquest of Sind in the 8th century, Arab writers described agglomerations of Jats in the arid, the wet, and the mountainous regions of the conquered land.The new Islamic rulers, though professing a theologically egalitarian religion, did not alter either the non-elite status of Jats or the discriminatory practices against them that had been put in place in the long period of Hindu rule in Sind. Jackson, Peter in their book ‘ The Delhi Sultanate: A Political and Military History’ quoted that “Nor can the liberation that the Muslim conquerors offered to those who sought to escape from the caste system be taken for granted. … a caliphal governor of Sind in the late 830s is said to have … (continued the previous Hindu requirement that) … the Jats, when walking out of doors in future, to be accompanied by a dog. The fact that the dog is an unclean animal to both Hindu and Muslim made it easy for the Muslim conquerors to retain the status quo regarding a low-caste tribe. In other words, the new regime in the eighth and ninth centuries did not abrogate discriminatory regulations dating from a period of Hindu sovereignty; rather, it maintained them.” Thus Jats were technically outcastes in the Hindu system and their origin was Sindh. So they were Sindhi outcastes pastoralists.  Now often in the Aryan caste system, outcaste would have job  dealing with corpses and since Jats were not into any such occupation, they were simply outcasted on the basis of belonging to a foreign tribe. So they could be descendant of Afghans who migrated during Pre-islamic times. I cannot really say that they are scythians since Scythians were ruling the North-western region of Sub-continent.  Also look at the Scythian map:  This does not include Sindh. I don’t understand why a bunch of warrior fighters who were rulers of the land will take to nomadic pastorialism and why will they heavily migrate to Sindh when the Sindh region was also attacked and ruled by foreign invaders. Also according to Arabs, there was cluster of Jats in the arid, the wet, and the mountainous regions of the conquered land which shows that Jats might have been native of Sindh. I feel Jats are neither of Scythian or Aryan origins but probably were original natives of Sindh (before all kinds of invasions). They could be of Harappan/ Indus Valley origins or ancients migrants from Baloch, South-eastern Iranian origins. Their origins were a bit humbler. The descendants of Scythians are probably todays Rajputs (The original Aryan warrior races of North-west India now Pakistan was decimated by all the Invasions so the migrating scythian tribes probably became the new kshatriyas. ), Afghans, Pashtuns, some Punjabis. The surviving descendants of Aryans of that region are some Pashtuns, Punjabi-Sindhi Brahmins, and some traders, farmers, pastoralists in Punjab, Afghan, Sindh, North-west Pakistan regions (Not jats since they were considered outcastes and the Jats didn’t give a damn about this descrimination). They are of native Sindh origins. ",
            "date": "Answered June 15, 2017",
            "views": "59",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Suave Desi Villager",
                    "user_href": "/profile/Suave-Desi-Villager"
                },
                {
                    "user_id": "Shubham Parmar",
                    "user_href": "/profile/Shubham-Parmar-235"
                },
                {
                    "user_id": "Mansaram Karwa",
                    "user_href": "/profile/Mansaram-Karwa"
                },
                {
                    "user_id": "Nsvd Murali Prasad",
                    "user_href": "/profile/Nsvd-Murali-Prasad-1"
                },
                {
                    "user_id": "Sumit Rawat",
                    "user_href": "/profile/Sumit-Rawat-48"
                },
                {
                    "user_id": "Anshul Tyagi",
                    "user_href": "/profile/Anshul-Tyagi-75"
                },
                {
                    "user_id": "Jatin",
                    "user_href": "/profile/Jatin-259"
                },
                {
                    "user_id": "Shivam Singh Chauhan",
                    "user_href": "/profile/Shivam-Singh-Chauhan-33"
                },
                {
                    "user_id": "Samrat Ghosh",
                    "user_href": "/profile/Samrat-Ghosh-18"
                },
                {
                    "user_id": "Subhashish Borah",
                    "user_href": "/profile/Subhashish-Borah"
                },
                {
                    "user_id": "Yuktivaadi Manush",
                    "user_href": "/profile/Yuktivaadi-Manush"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suave Desi Villager",
                "href": "/profile/Suave-Desi-Villager"
            },
            "answer_text": "JATS are scythians and malechhas with R1b y haplogroup which is NOT aryan. Only upper caste biharis and up guys are pure aryans with highest r1a1 presence and this is now proved and explained below. Punjab, haryana, uttakhand, jammu and Kashmir, himachal pradesh are NOT aryans. They are scythians mixed with invading hoardes like persians Afghans mughals, Turks etc since all these foreigners came through that route. Moreover most of the aryan mahajanpadas were I up and bihar. Haplogroup r1a1 is the accurate indicator of aryan Gene. It is most commonly found among the upper castes like brahmins, kshatriyas, bhumihars, lalas of up and bihar province. Even some lower castes Olin these states too have it in remarkable proportion. This frequency decrease as we go down towards south. And towards east of bihar I.e west Bengal. The western states especially Punjab haryana and Kashmir himanchal have some amount of r1a1 but they are mostly scythians mixed with other races like Turks, persians.since most of the foreign invaders came through that route. U can check that. Btw I will give u a list of some famous upper castes people from up and bihar and u can check how do they look. Aham Sharma , a bhumihar from Bihar Amitabh bacchan , a lala from up Neha Sharma, bhumihar girl from bihar Sriti jha, brahmin from bihar, Narendra jha, brahmin from bihar, Pankaj tripathi, brahmin from bihar Sushant Singh (savdhan India fame) , kshatriya from up Abhinav Kumar (trivago guy) , bhumihar from bihar. Akshara Singh, kshatriya from up. Ravi kishan, former actor and politician, brahmin from up. ",
            "date": "Answered October 6, 2020",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rishi Singh",
                "href": "/profile/Rishi-Singh-1019"
            },
            "answer_text": "Scythians are Aryans. Majority Rajasthan Rajputs and all Jats and Khatri are of foreign origin from area adjoining Caspian sea. Modern day Iran, Georgia etc (Historically Scythia, Media etc.). North Indian Aryan majority castes Rajput (not all. Some belong to Dravidian kshatriya clans too, hence they are not white skin everywhere). Similar to Jats in Rajasthan, but dark in far places. Rajputs in Haryana and UP are much dark skin than Jats. They are similar to Gurjars in looks.Jats (Sikh or hindu Jat). 10% dark due to mixing, 50% as white as Iranians/Europeans, 40% medium complexion.Khatri (Hindu/Sikh). Similar in skin color as Jats in Punjab/Haryana.Ahir/Yadav (majority). Similar to Jats in Haryana, but much dark in other places.Gurjar/Gujar, badgujar, Patidar.Sunar (Gold Smith).Brahmins",
            "date": "Answered August 19, 2020",
            "views": "298",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Chauhan",
                    "user_href": "/profile/Rohan-Chauhan-88"
                },
                {
                    "user_id": "Rahul Singh",
                    "user_href": "/profile/Rahul-Singh-12766"
                },
                {
                    "user_id": "Prabhat Singh Rajput",
                    "user_href": "/profile/Prabhat-Singh-Rajput-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajay Singh Pundir",
                "href": "/profile/Ajay-Singh-Pundir-8"
            },
            "answer_text": "Historian claims jat to be originated from Europe or central asia but today they even do not look 1% of them. Many jats in rural areas also look dark ( black) to tan dark skin, even darker than bhramin or khatris. I never saw any jat to be very fair or white. So this question seems to be misleading. Even Rural bhramin look much better than jats. Punjabi khatris are most fairest in North India followed by bhramins. ",
            "date": "Answered October 30, 2019",
            "views": "11",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suave Desi Villager",
                    "user_href": "/profile/Suave-Desi-Villager"
                },
                {
                    "user_id": "Sahil",
                    "user_href": "/profile/Sahil-1167"
                },
                {
                    "user_id": "Deepak Pathak",
                    "user_href": "/profile/Deepak-Pathak-477"
                },
                {
                    "user_id": "Shubham Parmar",
                    "user_href": "/profile/Shubham-Parmar-235"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Long-Living-Stone"
                },
                {
                    "user_id": "Sourav Sharma",
                    "user_href": "/profile/Sourav-Sharma-697"
                },
                {
                    "user_id": "Rishabh Kumar Singh",
                    "user_href": "/profile/Rishabh-Kumar-Singh-6"
                },
                {
                    "user_id": "Deepak Vats",
                    "user_href": "/profile/Deepak-Vats-101"
                },
                {
                    "user_id": "Lucky Raj Singh",
                    "user_href": "/profile/Lucky-Raj-Singh-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sunny Atwal",
                "href": "/profile/Sunny-Atwal-7"
            },
            "answer_text": "Official source properly investigated:- Indo Scythian:: History of The Dosanjh Clan ",
            "date": "Answered July 20, 2018",
            "views": "1",
            "upvotes": "0"
        }
    ]
}