{
    "title": "Are nation-states necessary? - Quora",
    "tags": [
        "Political Science",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Haddock",
                "href": "/profile/Steven-Haddock"
            },
            "answer_text": "The experience of federal states like Canada, the United States and Switzerland, among others, do tend to indicate that some form of local control is the best for all concerned.  As such, attempting to have a one \"unified world government\" is probably a bad idea for several reasons:- There's no reason to try to go with one legal system.  There are a few basic legal systems and, alhtough they work differently, the people who use them are generally happy with them.- It does make it easier to deal with language differences.  Even in Canada, federal laws have to be written in both English and French, but the laws of most provinces don't have to be.  Law is particularly hard to translate and there are many cases where the English and French texts don't match.- There's a good reason for local government; it makes it easier to get in touch with your politicians.  I've been to Toronto City Hall and Queens Park (Ontario's legislature) more times than I can count, but far away Ottawa only a few times and the United Nations even fewer times.  - As the Eurozone has shown, different regions have different borrowing needs.  Having multiple government borrowers and currencies can often be a good idea. ",
            "date": "Answered March 17, 2013",
            "views": "15",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eirik Birkeland",
                    "user_href": "/profile/Eirik-Birkeland-3"
                },
                {
                    "user_id": "Ian George le Fèvre",
                    "user_href": "/profile/Ian-George-le-Fèvre"
                },
                {
                    "user_id": "Matus Galajda",
                    "user_href": "/profile/Matus-Galajda-1"
                },
                {
                    "user_id": "Heather An",
                    "user_href": "/profile/Heather-An-3"
                },
                {
                    "user_id": "Harshit Madan",
                    "user_href": "/profile/Harshit-Madan-9"
                },
                {
                    "user_id": "Robin Daverman",
                    "user_href": "/profile/Robin-Daverman"
                },
                {
                    "user_id": "Joan Hoffman",
                    "user_href": "/profile/Joan-Hoffman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tolga Yıldırımoğlu",
                "href": "/profile/Tolga-Yıldırımoğlu"
            },
            "answer_text": "We need states. We have nations. Binational states tend to work less efficiently than nation states. Nations who feel oppressed in their state should be (and often, do) gain independence. All those together make it likely that most states will end up with a nation forming a strong majority. ",
            "date": "Answered December 31, 2018",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Grain",
                "href": "/profile/David-Grain-3"
            },
            "answer_text": "The nation state gives you a country of domicile. You are protected by the laws of the state whether you are a citizen or not but in return you have the obligation to obey the laws of the state It gives you something to be patriotic about as your homeland/fatherland. It will have a national anthem which often praised the nation-state for example O Canada, Advance Australia Fair, God defend New Zealand and many others. A Nation-state will have a flag which often forms a rallying point for patriotism or to support the nation’s sports stars such as in America the singing of The Star Spangled Banner before sports events, ",
            "date": "Answered August 7, 2018",
            "views": "479",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ala Ddin",
                    "user_href": "/profile/Ala-Ddin-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tisho Yanchev",
                "href": "/profile/Tisho-Yanchev-1"
            },
            "answer_text": "As far as i know, a ‘’nation state’’ means a country that is based on nationality, political ideology and other common features, a ‘’nation’’ is a country that is based on ethnicity and culture, i.e. on ethnic identity, people identify themselves with their ethnicity. Examples would be pretty much all European and Asian countries except China are all based on ethnicity and culture, America is a nation state by that definition because Americans do not identify as an ethnicity and their country is not based on culture, but on nationality, they identify by their political ideology, not ethnicity, China is the same by the way despite the fact that their gov. is actively trying to create the idea of a single Chinese ethnic identity. So in that sense, sooner or later, all countries will become ‘’nation states’’ because a single ethnicity will no longer exist. ",
            "date": "Answered July 10, 2016",
            "views": "564",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "TD",
                    "user_href": "/profile/TD-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aron Jan Cortel",
                "href": "/profile/Aron-Jan-Cortel"
            },
            "answer_text": "If you are an independent nation state, your citizens can have freedom and no other country can dictate your internal affairs. ",
            "date": "Answered January 26, 2017",
            "views": "201",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Hornhardt",
                "href": "/profile/Peter-Hornhardt-1"
            },
            "answer_text": "NO ",
            "date": "Answered June 18, 2017",
            "views": "46",
            "upvotes": "0"
        }
    ]
}