{
    "title": "Are American Indians and Native Americans different or the same? - Quora",
    "tags": [
        "Native American History",
        "Native Americans",
        "American Ethnicity and People",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Riggsby",
                "href": "/profile/Matt-Riggsby"
            },
            "answer_text": "They’re essentially the same, in that they’re inexact terms for the same batch of people. As far back as Columbus, native peoples in the New World got stuck with the name “Indians,” since Columbus thought or at least wanted people to think that he’d found a sea route to India. However, this was both confusing and inaccurate, since it wasn’t India at all, and one would often have to specify east Indians or west Indians (this was made all the more confusing by the West Indies having a more specific meaning of several of the larger islands of the Caribbean). And so by the middle of the 20th century, people started using the term “Native Americans” in place of “American Indians,” resolving the ambiguity. That said, both refer to a sometimes poorly defined set of people. Depending on context, it may or may not include native Alaskans or Pacific Islanders who, while natives of the New World defined in the broadest sense, were never regularly described as “Indians.” It may also be used to describe either all natives of the New World from Canada to Tierra del Fuego, or just natives of what is now the United States. ",
            "date": "Answered September 16, 2018",
            "views": "16",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shashank Nayak",
                    "user_href": "/profile/Shashank-Nayak-8"
                },
                {
                    "user_id": "Rich Alderson",
                    "user_href": "/profile/Rich-Alderson"
                },
                {
                    "user_id": "Daniel Dvorkin",
                    "user_href": "/profile/Daniel-Dvorkin-3"
                },
                {
                    "user_id": "John Freeberg",
                    "user_href": "/profile/John-Freeberg-1"
                },
                {
                    "user_id": "Bobby Terry",
                    "user_href": "/profile/Bobby-Terry-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Nolan",
                "href": "/profile/Mike-Nolan-39"
            },
            "answer_text": "The terms are not exactly the same. Native Americans, also known as American Indians, Indigenous Americansand other terms, are the indigenous peoples of the United States, except Hawaii. There are over 500 federally recognized tribes within the US, about half of which are associated with Indian reservations. The term \"American Indian\" excludes Native Hawaiians and some Alaska Natives, while Native Americans (as defined by the US Census) are American Indians, plus Alaska Natives of all ethnicities. Native Hawaiians are not counted as Native Americans by the US Census, instead being included in the Census grouping of “Native Hawaiian and Other Pacific Islander.” https://en.wikipedia.org/wiki/Native_Americans_in_the_United_States ",
            "date": "Answered September 16, 2018",
            "views": "353",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wang White",
                "href": "/profile/Wang-White"
            },
            "answer_text": "I hate to correct others, but these comments need clarification; To take the entry from Columbus’s log entry, “gens en dios” to any rudimentary spanish knowledge means a people of god, which was a term used at the time with people living in harmony with nature. (god?) other terms, au dios, with god, vaya con dios ? etc. etc. Now how could he believe he found India when it didn’t exist, the area was call Hindustan, there was an Indus river , I suppose residents were labeled as “indians?” The country was made up of Rajasthans ? the head was call a Raj ?? India did not come to existence till much later, I born as an indian on a reservation, and no matter what the “politically correct term” is in current use, we are still the same. however, with these PC terms, the effect is lost in the translation; someone calls you a “ developmentally delayed fornicating aboriginal” does not elicit the same response, in other words, he’s not spitting out chicklets! What's black and blue and a bit of red and lies in the ditch?…. yes! one who likes to tell indian jokes! ",
            "date": "Answered September 17, 2018",
            "views": "472",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Shainblum",
                "href": "/profile/Mark-Shainblum-1"
            },
            "answer_text": "“Native Americans” is the current, modern term. “Indians” is a semi-obsolete term that isn’t used officially anymore, though a few Native American groups still choose to use it themselves. Here in Canada, we mostly use the term “First Nations” to describe the people who were called “Indians”, and “Inuit” to describe the people who were once called “Eskimos”. Though again, some people in those groups still choose to use the old terms. ",
            "date": "Answered September 16, 2018",
            "views": "456",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erik Painter",
                    "user_href": "/profile/Erik-Painter"
                },
                {
                    "user_id": "Bobby Terry",
                    "user_href": "/profile/Bobby-Terry-1"
                }
            ]
        }
    ]
}