{
    "title": "Are smart people intelligent? - Quora",
    "tags": [
        "Smart People",
        "Social Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michele Stewart",
                "href": "/profile/Michele-Stewart-2"
            },
            "answer_text": "I've known a lot of intelligent people who weren't very smart. And a lot of smart people who weren't necessarily intelligent. Take the case of someone I knew intimately. He had a measurable IQ of 150. Intelligent? Yes. Could program a spaceship if he wanted? Yes. Could properly balance a checkbook? No. This guy, while very intelligent, did not make very many smart decisions. He had failure after failure and never really lived up to his potential. He had knowledge, and he knew abstract concepts, could even actually see things in 3 dismensions, but it was his life choices that made him not very smart. Making and losing money, choosing the wrong partners, stealing, never really holding down a job for long, etc. He was definintely intelligent but not very smart. Things did work out for him in the end, when he finally found a partner with smarts. The two complemented and completed each other so that they managed to enjoy a measure of success. Now take this woman I've known for a very long time. She’s not very intelligent with a measurable IQ of around 92. she had a very hard life, abusive parent, dropped out of school and was lost for awhile until she found a somewhat intelligent man. They married and had three gorgeous children. She was, perhaps, the smartest woman I know. Smart when it came to life itself. She raised her children to be independent, non-judgmental, kind, giving and all around incredible. She herself went on to get her GED, though she struggled through it and didn't really need one anyway. Not as a stay-at-home mom. But she made the smart choice to get one. When things got tough and she had to go back to work, she found a job in a doctor’s office and managed to handle it quite nicely. She's the person others went to for advice. So yeah, she was smart if not intelligent. So there is a difference and I can truthfully say that one does not necessarily include the other. They may, and when they do, you find a successful, well educated, secure individual who knows how to handle life's twists and turns. The combination of the two is what we all would like and what makes us unstoppable in obtaining our desires and dreams. As for me, I consider myself to be intelligent, but not smart. Yeah, my own measurable IQ is high. Not up there with someone who can program a rocket ship, but above average. I made a number of bad choices myself even when my intelligence knew they were a mistake. Made them anyway. That's what made me not smart. You see, I believe that intelligence is only our potential. We can measure it because it deals with concepts not facts Or decision factors. Intelligence is applied to the overall pictures, the gestalt of a problem. But without the smarts, applying that intelligence in just the right way to solve just the right problem or create just the right situation, is much, much harder. You need both. Sometimes that comes as two separate people, sometimes it comes in one person. But one without the other is often doomed to fail. Smart needs the intelligence to solve the problems. Intelligence needs the smart to make the right decisions in applying the solutions. Now I may not have explained it clearly so I welcome help to untangle the weave I've made here. I know what I mean, but I don't always know how to say what I want to get my meaning across. I mean, I mean what I say and I said what I mean, but I don't always know what I mean or what I said, know what I mean? Yeah, confuses me too. ",
            "date": "Answered January 22, 2017",
            "views": "986",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Franklyn Lee",
                    "user_href": "/profile/Franklyn-Lee-2"
                },
                {
                    "user_id": "Emma Murray",
                    "user_href": "/profile/Emma-Murray-66"
                },
                {
                    "user_id": "Daniel Alumona",
                    "user_href": "/profile/Daniel-Alumona"
                },
                {
                    "user_id": "Chaz Granholm",
                    "user_href": "/profile/Chaz-Granholm-1"
                },
                {
                    "user_id": "Bel Boo",
                    "user_href": "/profile/Bel-Boo"
                },
                {
                    "user_id": "Susan Bernhardt Kemper",
                    "user_href": "/profile/Susan-Bernhardt-Kemper"
                },
                {
                    "user_id": "Brad Young",
                    "user_href": "/profile/Brad-Young-47"
                },
                {
                    "user_id": "Pradeep Jha",
                    "user_href": "/profile/Pradeep-Jha-22"
                },
                {
                    "user_id": "Rohit Antony",
                    "user_href": "/profile/Rohit-Antony-1"
                },
                {
                    "user_id": "Martha Lancaster",
                    "user_href": "/profile/Martha-Lancaster"
                },
                {
                    "user_id": "Shreya Rajgopal",
                    "user_href": "/profile/Shreya-Rajgopal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Beers",
                "href": "/profile/Vincent-Beers"
            },
            "answer_text": "Depends on how you define the words. To the average idiot they mean the same thing. From my perspective smart is the ability to make good decisions and embrace change as needed. Intelligence is simply the volume of information you may have access to on any given topic. Which would mean some people can be smart but lack intelligence (being capable of good decisions but lacking information); and some people may be intelligent but not be smart (having access to lots of information but not being able to use it properly). As example from that perspective I tend to be smart, but my range of intelligence is limited to the areas I’ve decided to study. Which means I tend to be able to learn and understand things, but it doesn’t mean I have an interest in knowing everything. ",
            "date": "Answered October 24, 2016",
            "views": "276",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Miller",
                "href": "/profile/Gary-Miller-3"
            },
            "answer_text": "In America I've always considered smart and intelligent to be synonyms.  Both of them refer to an ambiguous combination of both knowledge and mental processing power in normal everyday usage.  If you were referring to just processing power you would say someone have a very high IQ.  If you were referring just to how much knowledge a person had you might say that they are very well read or very well educated. ",
            "date": "Answered August 21, 2011",
            "views": "19",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Hsu",
                    "user_href": "/profile/Jack-Hsu-22"
                },
                {
                    "user_id": "Jeerah",
                    "user_href": "/profile/Jeerah"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Anonymous0087-1"
                },
                {
                    "user_id": "Drew Bayman",
                    "user_href": "/profile/Drew-Bayman"
                },
                {
                    "user_id": "Alice Minnie",
                    "user_href": "/profile/Alice-Minnie-1"
                },
                {
                    "user_id": "Adrianne J. Lee",
                    "user_href": "/profile/Adrianne-J-Lee"
                },
                {
                    "user_id": "Doug Delmonico",
                    "user_href": "/profile/Doug-Delmonico"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Welsh",
                "href": "/profile/Bill-Welsh-2"
            },
            "answer_text": "This is one of those questions that leaves me shaking my head.  I might have heard sillier questions, but maybe not.  According to every dictionary and thesaurus I could find, the two are synonymous.  Therefore, any distinction we make here is artificial.  Utterly.  We can make something up that sounds good, maybe, but they are the same.  We can go out on our own and create \"constructs\" whereby some distinction is drawn, but seriously, this is all semantics folks.  Honest.   Im my particular profession, there came a time at which people began to try to make a distinction between 'evaluation' and 'assessment'.  In every record of the English language, they are synonyms.  My cynical side says that someone was trying to sound intelligent by introducing a subtle but entirely artificial distinction between the two.  We have better things to do.  This is silly.  And it's plain dumb. ",
            "date": "Answered May 4, 2013",
            "views": "783",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sabrina Hoyle-Brown",
                    "user_href": "/profile/Sabrina-Hoyle-Brown"
                },
                {
                    "user_id": "Daniel Burke",
                    "user_href": "/profile/Daniel-Burke-52"
                },
                {
                    "user_id": "Brian Bi",
                    "user_href": "/profile/Brian-Bi"
                },
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                },
                {
                    "user_id": "Bill Welsh",
                    "user_href": "/profile/Bill-Welsh-2"
                },
                {
                    "user_id": "Kat Li",
                    "user_href": "/profile/Kat-Li-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Wilkinson",
                "href": "/profile/Andrew-Wilkinson-3"
            },
            "answer_text": "I always thought what separates a smart person from an intelligent person is how they go about handling a certain situation.  A intelligent person has a clearer understanding of how to proceed and accomplish something.A smart person may be very clever but not know how to deal with a certain situation.I could be very wrong, just my take on this. ",
            "date": "Answered August 21, 2011",
            "views": "713",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Risto Lankinen",
                    "user_href": "/profile/Risto-Lankinen"
                }
            ]
        },
        {
            "author_info": {
                "name": "C.S. Friedman",
                "href": "/profile/C-S-Friedman"
            },
            "answer_text": "Smart and intelligent are synonyms. “intelligent”, being derived from Latin, is favored in formal writing and pretentious conversations. There’s no other difference. ",
            "date": "Answered June 14, 2016",
            "views": "232",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michele Stewart",
                    "user_href": "/profile/Michele-Stewart-2"
                },
                {
                    "user_id": "Sanam Rai",
                    "user_href": "/profile/Sanam-Rai-1"
                },
                {
                    "user_id": "Tatiana Estévez",
                    "user_href": "/profile/Tatiana-Estévez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lyndie Daniels",
                "href": "/profile/Lyndie-Daniels"
            },
            "answer_text": "Since those word are synonyms, I would say, Yes. ",
            "date": "Answered May 12, 2018",
            "views": "39",
            "upvotes": "0"
        }
    ]
}