{
    "title": "Are the Kennedys the most important American political dynasty? - Quora",
    "tags": [
        "Kennedy Family (U.S. politics)",
        "Political History of the United States of America",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Kotterman",
                "href": "/profile/Chris-Kotterman"
            },
            "answer_text": "In the modern era, I would agree that the Bushes have had the most influence on the direction of the country, for better or worse. Bush 41 essentially began American foreign policy of direct military intervention in the middle east, and his administration was the incubator for many of the neocons that would get to live out their wet dreams during the Bush 43 administration. Bush 43 basically set the country on a course of open-ended nation building in the middle east via the Cheney-Wolfowitz-Feith \"we'll be greeted as liberators\" philosophy that has cost us untold billions and thousands of American lives. There is no way you make decisions like that about the direction of American foreign/military policy and it not have lasting effects, including the inability of the government to deal with the great recession. Any money that would have helped ease the consequences at home had long before been spent overseas, and narrowed the options that Obama had at hand significantly. You could even make a strong argument that the general push for further deregulation in many areas, including finance, contributed greatly to the environment that led to the recession. I don't think it's an understatement to say that while Obama has certainly made his mark in certain areas (healthcare and shutting down Iraq must notably), the country largely looks the way it does today as an extension of the Bush policies, collectively. Clinton also had a hand, mostly through welfare reform, but I wouldn't classify the Clintons as a dynasty just yet, unless Hillary gets elected in 2016. ",
            "date": "Answered November 24, 2013",
            "views": "288",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Mihalick",
                    "user_href": "/profile/Justin-Mihalick"
                },
                {
                    "user_id": "Dan Holliday",
                    "user_href": "/profile/Dan-Holliday"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Holliday",
                "href": "/profile/Dan-Holliday"
            },
            "answer_text": "Of all time?  Or currently?  Because that's hard to say. A lot of power comes from \"behind the scenes\" and then it's so clouded in secrecy as to make it immeasurable.  Let's just say that they are in the top ten.   Right now, I'd say that the Clintons and Bushes are the power-players.  To this day, the two Georges have a lot of pull within the quiet party managers.  Bill and Hillary are arguably the most powerful family in the Democratic party.  If I had to list the power-dynasties in the USA, I'd say: Kennedy (Dem)Bush (Rep)Clinton (Dem)Rockefeller (Rep/ [+1 Dem])After that, you have some regional families: Taft (Ohio, Rep)Daley (Illinois, Dem)Udall (West, Dem/Rep)Cheney (Wyoming, Rep)Cuomo (New York, Dem)",
            "date": "Answered November 19, 2013",
            "views": "11",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Mihalick",
                    "user_href": "/profile/Justin-Mihalick"
                },
                {
                    "user_id": "Thomas Suraj",
                    "user_href": "/profile/Thomas-Suraj"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jason-Blau"
                },
                {
                    "user_id": "Ian McCullough",
                    "user_href": "/profile/Ian-McCullough"
                },
                {
                    "user_id": "Jack Calnan",
                    "user_href": "/profile/Jack-Calnan"
                },
                {
                    "user_id": "Susann Moy",
                    "user_href": "/profile/Susann-Moy"
                },
                {
                    "user_id": "Ellen Vrana",
                    "user_href": "/profile/Ellen-Vrana"
                },
                {
                    "user_id": "Michael Lee",
                    "user_href": "/profile/Michael-Lee-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neel Kumar",
                "href": "/profile/Neel-Kumar"
            },
            "answer_text": "No.  Bushes are.  They have produced 2 Presidents (first so so, second a complete disaster) and have another lined up to take on the mantle. ",
            "date": "Answered November 19, 2013",
            "views": "124",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Justin Mihalick",
                    "user_href": "/profile/Justin-Mihalick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill McDonald",
                "href": "/profile/Bill-McDonald"
            },
            "answer_text": "Adams, Roosevelt, Randolph from the past. ",
            "date": "Answered November 19, 2013",
            "views": "180",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Justin Mihalick",
                    "user_href": "/profile/Justin-Mihalick"
                }
            ]
        }
    ]
}