{
    "title": "Are the 7 wonders of the world still intact, and if not, what happened to them? - Quora",
    "tags": [
        "Wonders",
        "Seven Wonders of the World",
        "Monuments",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Gall",
                "href": "/profile/Dan-Gall-1"
            },
            "answer_text": "Only the Pyramids survive as one of the original seven Wonders of the World. The Great Pyramid of Giza exist today tho stripped of their covering. Colossus of Rhodes destroyed in an Earthquake in 226 BC Hanging Gardens of Babylon. Possibly were a myth. Any gardens were destroyed in 1st Century AD Lighthouse of Alexandria The lighthouse was severely damaged by three earthquakes between AD 956 and 1323 and became an abandoned ruin. It was the third longest surviving ancient wonder (after the Mausoleum at Halicarnassus and the extant Great Pyramid of Giza), surviving in part until 1480, when the last of its remnant stones were used to build the Citadel of Qaitbay on the site. Mausoleum at Halicarnassus It was destroyed by successive earthquakes from the 12th to the 15th century, Statue of Zeus at Olympia One of the Seven Wonders of the Ancient World, the statue was lost and destroyed during the 5th century AD; details of its form are known only from ancient Greek descriptions and representations on coins. Temple of Artemis The earliest version of the temple (a temenos) antedated the Ionic immigration by many years, and dates to the Bronze Age. Callimachus, in his Hymn to Artemis, attributed it to the Amazons. In the 7th century BC, it was destroyed by a flood. Its reconstruction, in more grandiose form, began around 550 BC, under Chersiphron, the Cretan architect, and his son Metagenes. The project was funded by Croesus of Lydia, and took 10 years to complete. This version of the temple was destroyed in 356 BC by Herostratus in an act of arson. ",
            "date": "Answered February 17, 2020",
            "views": "235",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Barbara Steiner",
                    "user_href": "/profile/Barbara-Steiner-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stuart Herring",
                "href": "/profile/Stuart-Herring-2"
            },
            "answer_text": "Only one.The Wikipedia article on the Seven Wonders of the Ancient World states:“Of the original Seven Wonders, only one—the Great Pyramid of Giza (also called the Pyramid of Khufu, after the pharaoh who built it), the oldest of the ancient wonders—remains relatively intact. The Colossus of Rhodes, the Lighthouse of Alexandria, the Mausoleum at Halicarnassus, the Temple of Artemis and the Statue of Zeus were all destroyed. The location and ultimate fate of the Hanging Gardens are unknown, and there is speculation that they may not have existed at all.” ",
            "date": "Answered February 16, 2020",
            "views": "132",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                },
                {
                    "user_id": "Bobi Lloyd",
                    "user_href": "/profile/Bobi-Lloyd"
                },
                {
                    "user_id": "Albert Stadt",
                    "user_href": "/profile/Albert-Stadt"
                },
                {
                    "user_id": "Barbara Steiner",
                    "user_href": "/profile/Barbara-Steiner-4"
                }
            ]
        }
    ]
}