{
    "title": "Are there similarities between Alexander the Great and Napoleon Bonaparte? - Quora",
    "tags": [
        "Alexander the Great",
        "Napoleon Bonaparte",
        "History of France",
        "History of Europe",
        "Ancient History",
        "World History",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Overland",
                "href": "/profile/Brian-Overland-1"
            },
            "answer_text": "A few, yes. Both are famous for winning many, many battles in a row. But here they differ. Alexander never really lost, but he did meet his match in India, against Hindu warriors, of all people (which is ironic because modern India is associated with Gandhi and pacifism); that last battle was considered a tie, and Alexander’s armies finally turned to go back home. Napoleon suffered more obvious defeats near the end of his career. The invasion of Russia (“a land war in Asia”) ended in total disaster even if he didn’t technical lose a battle to the Russians. The Russians retreated, left Moscow, burned the crops, and left the cruel Russian winter to destroy the French army. But later, Waterloo was considered a clear defeat for Napoleon. Both men are famous not just for winning battles but for employing strategy and tactics superior to their opponents. Both are still studied — to this day! — in military War Colleges to study strategy. Alexander, in particular, had inherited a great military machine from his father, Phillip — it was in many ways the finest army ever trained up to that point — but it was that plus his superior tactics that enabled him to subdue the much larger Persian army, maybe the largest on Earth. Both men are admired (even by their critics) for rising to great heights from small beginnings. The achievement is more impressive in the case of Napoleon Bonaparte because… even though his family was minor aristocracy in Corsica, he was not considered royal or noble when he came to Paris to be trained as an officer. Instead, he was more or less “middle class” or maybe “upper middle class.” (Interesting side note: the deaths of so many French aristocrats, thanks to the Revolution, created many openings in the upper echelons of the French military — helping Napoleon to become a general at an unusually young age. Napoleon, from Corsica, was not considered a “real” aristocrat and so escaped the guillotine.) It’s sometimes forgotten that Alexander inherited the kingship of Macedonia. He might have been pushed aside, had it not been for the untimely death of his father, followed by the untimely (and equally suspicious) death of his infant brother — that tiny brother being the child of Phillip’s favorite wife. Nonetheless, the nobles and elders of Macedonia proclaimed Alexander king; they knew he was already a proven, highly competent commander in the field, and they wanted a real leader as king, not an infant boy. So at least he “earned” his kingship partly on merit. (Those deaths are still suspiscious, though.) What is remarkable, however, and “Napoleonic,” is how Alexander used the kingship of Macedonia — at the time a minor little kingdom — to rise to conquer “the known world.” Though technically still King of Macedonia, Alexander become ruler of a vast territory and was thought of in later ages as a conqueror/emperor/divine figure. To some people, he was a scourge and a figure of fear; to others he became a god. He left in his wake a huge empire that was divided four ways. ",
            "date": "Answered April 18, 2019",
            "views": "13",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Robinson",
                    "user_href": "/profile/Michael-Robinson-161"
                },
                {
                    "user_id": "John Dunsayne",
                    "user_href": "/profile/John-Dunsayne"
                },
                {
                    "user_id": "Teja Reddy",
                    "user_href": "/profile/Teja-Reddy-387"
                },
                {
                    "user_id": "Dan Houser",
                    "user_href": "/profile/Dan-Houser-1"
                },
                {
                    "user_id": "Scott Riddle",
                    "user_href": "/profile/Scott-Riddle-3"
                },
                {
                    "user_id": "Jeremy Selby",
                    "user_href": "/profile/Jeremy-Selby"
                },
                {
                    "user_id": "Dominic Davis",
                    "user_href": "/profile/Dominic-Davis-33"
                },
                {
                    "user_id": "Steve Weinkauf",
                    "user_href": "/profile/Steve-Weinkauf"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Konstantinidis",
                "href": "/profile/Alexander-Konstantinidis-1"
            },
            "answer_text": "I don’t see any similarities beyond the fact that Napoleon had a certain strategic genius, not at par though with Alexander. To remind the basic facts, Alexander begun his excursion with 30,000 Greeks marching against the most powerful Empire of the time, which in only one battle (Gavgamila) assembled an army of approximately 1,000,000 soldiers. Alexander was never defeated, and we can not say the same for Napoleon. Furthermore, Alexander was fighting in the front line with his troops while Napoleon was always observing the battle from a safe position. Last but not least, Alexander was the student of one of the greatest philosophers of the time, Aristotle (himself a student of Platon) and was embodying all the virtues of the Greek civilization. Not the same with Napoleon. ",
            "date": "Answered April 18, 2019",
            "views": "864",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Barno Kaharova",
                    "user_href": "/profile/Barno-Kaharova"
                },
                {
                    "user_id": "Emiliano Jonuzi",
                    "user_href": "/profile/Emiliano-Jonuzi"
                }
            ]
        }
    ]
}