{
    "title": "Are GKI table tennis racquets good? - Quora",
    "tags": [
        "GKI Table Tennis",
        "GKI Table Tennis Rackets",
        "Table Tennis Rackets"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ajit Rao",
                "href": "/profile/Ajit-Rao-13"
            },
            "answer_text": "I highly recommend GKI racquets if your’e a beginner or a recreational player. It was my first racquet which was suggested to me by my coach when i started playing. I used it for 2 years and it allowed me to control the ball very well and also gave me a very educational insight into understanding spin. The rubber has a decent speed/spin combination which is very important during early basic stroke development phase. The ply itself is on the heavier side which makes looping and topspin drives powerful. Have fun training! ",
            "date": "Answered October 13, 2016",
            "views": "45",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "AKS VERMA",
                    "user_href": "/profile/AKS-VERMA-6"
                },
                {
                    "user_id": "Jaskirat Singh Ahluwalia",
                    "user_href": "/profile/Jaskirat-Singh-Ahluwalia"
                },
                {
                    "user_id": "Joe Sebastian",
                    "user_href": "/profile/Joe-Sebastian-9"
                },
                {
                    "user_id": "Satya Prasad Nemana",
                    "user_href": "/profile/Satya-Prasad-Nemana"
                },
                {
                    "user_id": "Oum Kuvelkar",
                    "user_href": "/profile/Oum-Kuvelkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohan Bansal",
                "href": "/profile/Rohan-Bansal-21"
            },
            "answer_text": "Regarding GKI pre-assembled bats, you can generally find a better pre-assembled Stag bat for same price range and better overall balance. Reason I believe is the average quality of blades they use. Regarding rubbers I feel Euro Jumbo, Hybrid Gx, Chelonz are decent rubbers having good overall spin and speed respectively (Chelonz won't give you those spinny serves) talking about GKI alone and not comparing. (These were quite effective and had good life. Though being a bit cheaper would make them perfect.) And since there are really few cheaper rubbers for 1200 Indian bucks Spintex and Offensive XX are decent slow controlled rubbers to have. Already mentioned, I haven’t ever been a fan of GKI blades. I have used the five rubbers I have mentioned in a combination some time or other. Though not now. Viewpoints of different players can no doubt vary. Play well! ",
            "date": "Updated September 27, 2017",
            "views": "78",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaskirat Singh Ahluwalia",
                    "user_href": "/profile/Jaskirat-Singh-Ahluwalia"
                },
                {
                    "user_id": "Himanshu Aggarwal",
                    "user_href": "/profile/Himanshu-Aggarwal-57"
                },
                {
                    "user_id": "Rishabh Tak",
                    "user_href": "/profile/Rishabh-Tak-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sardar Singh",
                "href": "/profile/Sardar-Singh-20"
            },
            "answer_text": "Yes, I personally felt they are the best for beginners and ammetuers given value for money, also they are pretty durable. I used the GKI Kung Fu, It is very popular. Now it would be priced at around INR 800/. If you think you are good at spinning the ball, can also consider Butterfly racquets too. ",
            "date": "Answered September 6, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Piyush Pani Mathur",
                "href": "/profile/Piyush-Pani-Mathur"
            },
            "answer_text": "I haven't played with gki racquet but.. playing with the gki chelonz hybrid rubber…it's very good…durable and control..I had played with Mark v also..it's better ",
            "date": "Answered April 26, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gourab Kar",
                "href": "/profile/Gourab-Kar-2"
            },
            "answer_text": "Please find my and answer here: Gourab Kar's answer to Are GKI's table tennis equipments better and economical than other companies' products? ",
            "date": "Answered November 23, 2017",
            "views": "32",
            "upvotes": " Answer requested by Anand Bhaskar"
        }
    ]
}