{
    "title": "Are early historic records of Jesus reliable? - Quora",
    "tags": [
        "The Historical Jesus",
        "History of Christianity",
        "Jesus",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim O'Neill",
                "href": "/profile/Tim-ONeill-1"
            },
            "answer_text": "The agreement by the overwhelming majority of scholars (apart from a a tiny handful of contrarians and mavericks who no-one takes very seriously) is not based purely on the extra-Biblical references in Josephus, Tacitus and Pliny. There are also many elements in the gospels that don’t make much sense unless Jesus was a historical person, especially the parts where the gospel writers seem to be having to go to some effort to make Jesus fit the idea that he was the Messiah. It makes more sense for the contradictory stories of Jesus being born in Bethlehem (as a Messiah was supposed to) despite being from the insignificant village of Nazareth if Jesus was actually from Nazareth and the stories are trying to shoehorn him into the Messiah narrative. In addition to this, we have references in the Pauline epistles which also only make sense if he knew Jesus had been a recent historical figure. Paul would not have written about Jesus having been born as a human, of a human mother and born a Jew (Galatians 4:4), or that he had a \"human nature\" and that he was a human descendant of King David (Romans 1:3) if he somehow didn’t believe Jesus had been a human being. Paul also says that Jesus had brothers who Paul knew personally (1Cor 9:5) and mentions, in passing, meeting Jesus’ friend “Cephas” (the original Aramaic form of “Peter”) and Jesus’ oldest brother James (Gal 1:19). It’s a bit difficult to know the friend and brothers of a man who didn’t exist. But on top of all this we have at least three non-Biblical mentions of Jesus that refer to him not just as the saviour deity worshipped by Christians but as a historical human being. They are actually accepted as genuine (in the case of one of the Josephus mentions, mostly genuine) by virtually all scholars of these writings. The arguments made against their authenticity tend to be by non-scholars or by the tiny handful of genuine scholars who accept the “Jesus myth” hypothesis and so have an axe to grind here. Pliny Pliny the Younger’s letters to Trajan are mainly seeking advice about how to deal with Christians but the first of them makes a point of mentioning these Christians meet “on a fixed day before dawn and sing responsively a hymn to Christ as to a god”. This last phrase indicates that Pliny considered this “Christ” to simply be a man. This reference is not very useful for establishing Jesus as a historical figure though, as it seems most of what Pliny understood about Christianity he got from Christians themselves. Tacitus Tacitus was writing about the same time as Pliny, in the early second century. The mention of Jesus in the Annals of the aristocratic Roman historian and senator Publius Cornelius Tacitus is significant partly because of his status as one of the most careful and sceptical historians of the ancient world and partly because it is from what is obviously a hostile witness. Tacitus absolutely despised Christianity, as he makes clear when he mentions how the emperor Nero tried to scapegoat them after the Great Fire of Rome in 64 AD. He also gives an account to his readers as the origin of the Christian sect and their founder in Judea: Consequently, to get rid of the report, Nero fastened the guilt and inflicted the most exquisite tortures on a class hated for their abominations, called Christians by the populace. Christus, from whom the name had its origin, suffered the extreme penalty during the reign of Tiberius at the hands of one of our procurators, Pontius Pilatus, and a most mischievous superstition, thus checked for the moment, again broke out not only in Judæa, the first source of the evil, but even in Rome, where all things hideous and shameful from every part of the world find their centre and become popular.(Tacitus, Annals, XV.44) Again, this clear reference to Jesus, complete with the details of his execution by Pilate, is a major problem for the Mythicists. They sometimes try to deal with it using their old standby argument: a claim that it is a later interpolation. But this passage is distinctively Tacitean in its language and style and it is hard to see how a later Christian scribe could have managed to affect perfect Second Century Latin grammar and an authentic Tacitean style and fool about 400 years worth of Tacitus scholars, who all regard this passage aa clearly genuine. A more common way of dismissing this passage is to claim that all Tacitus is doing is repeating what Christians had told him about their founder and so it is not independent testimony for Jesus at all. This is slightly more feasible, but still fails on several fronts. Firstly, Tacitus made a point of not using hearsay, of referring to sources or people whose testimony he trusted and of noting mere rumour, gossip or second-hand reports as such when he could. He was explicit in his rejection of history based on hearsay earlier in his work: My object in mentioning and refuting this story is, by a conspicuous example, to put down hearsay, and to request that all those into whose hands my work shall come not to catch eagerly at wild and improbable rumours in preference to genuine history. (Tacitus, Annals, IV.11) Secondly, if Tacitus were to break his own rule and accept hearsay about the founder of Christianity, then it's highly unlikely that he would do so from Christians themselves (if this aristocrat even had any contact with any), who he regarded with utter contempt. He calls Christianity \"a most mischievous superstition .... evil .... hideous and shameful .... (with a) hatred against mankind\" - not exactly the words of a man who regarded its followers as reliable sources about their sect's founder. Furthermore, what he says about Jesus does not show any sign of having its origin in what a Christian would say: it has no hint or mention of Jesus' teaching, his miracles and nothing about the claim he rose from the dead. On the other hand, it does contain elements that would have been of note to a Roman or other non-Christian: that this founder was executed, where this happened, when it occurred (\"during the reign of Tiberius\") and which Roman governor carried out the penalty. We know from earlier in the same passage that Tacitus consulted several (unnamed) earlier sources when writing his account of the aftermath of the Great Fire (see AnnalsXV.38), so it may have been one of these that gave him his information about Jesus. But there was someone else in Rome at the time Tacitus wrote who mixed in the same circles, who was also a historian and who would have been the obvious person for Tacitus to ask about obscure Jewish preachers and their sects. None other than Josephus was living and writing in Rome at this time and, like Tacitus, associated with the Imperial court thanks to his patronage first by the emperor Vespasian and then by his son and successor Titus. There is a strong correspondence between the details about Jesus in Annals XV.44 and Antiquities XVIII.3.4, so it is at least quite plausible that Tacitus simply asked his fellow aristocratic scholar about the origins of this Jewish sect. For these reasons this reference is considered to be genuine and made by Tacitus, probably after consulting with exiled Jews at the Flavian court to get his information. Contrary to the claims of some, it does not simply refer to the existence of Christians, but clearly traces this sect to a human founder who was executed by Pilate in Judea in the reign of Tiberius. He literally tells us who, what, when and where about Jesus. Josephus The Jewish priestly aristocrat Joseph ben Matityahu, who took the Roman name Flavius Josephus, is our main source of information about Jewish affairs in this period and is usually the only writer of the time who makes any mention of Jewish preachers, prophets and Messianic claimants of the First Century. Not surprisingly, he mentions Jesus twice: firstly in some detail in Antiquities of the Jews XVIII.3.4 and again more briefly when mentioning the execution of Jesus' brother James in Antiquities XX.9.1. The first reference is problematic, however, as it contains elements which Josephus cannot have written and which seem to have been added later by a Christian interpolator. Here is the text, with the likely interpolations in bold: \"Now there was about this time Jesus, a wise man, if it be lawful to callhim a man; for he was a doer of paradoxical deeds, a teacher of such men as receive the truth with pleasure. He drew over to him both many of theJews and many of the Gentiles. He was [the] Christ And when Pilate at the suggestion of the principal men amongst us, had condemned him to the cross,those that loved him at the first did not forsake him; for he appeared to them alive again the third day; as the divine prophets had foretold these and ten thousand other wonderful things concerning him. And the tribe of Christians, so named from him, are not extinct at this day.\" There has been a long debate about what parts of this reference to Jesus are authentic to Josephus or even if the whole passage is a wholesale interpolation. Proponents of the Jesus Myth hypothesis, naturally, opt for the idea that it is not authentic in any way, but there are strong indications that, apart from the obvious additions shown in bold above, Josephus did mention Jesus at this point in his text. To begin with, several elements in the passage are distinctively Josephean in their style and phrasing. \"Now (there was) about this time ...\" is used by Josephus as a way of introducing a new topic hundreds of times in his work. There are no early Christian parallels that refer to Jesus merely as \"a wise man\", but this is a term used by Josephus several times, eg about Solomon and Daniel. Christian writers placed a lot of emphasis on Jesus' miracles, but here the passage uses a fairly neutral term παραδόξων ἔργων - \"paradoxa erga\" or \"paradoxical deeds\". Josephus does use this phrase elsewhere about the miracles of Elisha, but the term can also mean \"deeds that are difficult to interpret\" and even has overtones of cautious scepticism. Finally, the use of the word φῦλον (\"phylon\" - \"race, tribe\") is not used by Christians about themselves in any works of the time, but is used by Josephus elsewhere about sects, nations or other distinct groups. Additionally, with the sole exception of Χριστιανῶν (\"Christianon\" - \"Christians\") every single word in the passage can be found elsewhere in Josephus' writings. The weight of the evidence of the vocabulary and style of the passage is heavily towards its partial authenticity. Not only does it contain distinctive phrases of Josephus that he used in similar contexts elsewhere, but these are also phrases not found in early Christian texts. And it is significantly free of terms and phrases from the gospels, which we'd expect to find if it was created wholesale by a Christian writer. So either a very clever Christian interpolator somehow managed to immerse himself in Josephus' phrasing and language, without modern concordances and dictionaries and create a passage containing distinctively Josephean phraseology, or what we have here is a genuinely Josephean passage that has simply been added to rather clumsily. As a result of this and other evidence (eg the Arabic and Syriac paraphrases of this passage which seem to come from a version before the clumsy additions by the interpolator) the consensus amongst scholars of all backgrounds is that the passage is partially genuine, simply added in a few obvious places. Louis H. Feldman's Josephus and Modern Scholarship (1984) surveys scholarship on the question from 1937 to 1980 and finds of 52 scholars on the subject, 39 considered the passage to be partially authentic. Peter Kirby has done a survey of the literature since and found that this trend has increased in recent years. He concludes \"In my own reading of thirteen books since 1980 that touch upon the passage, ten out of thirteen argue the (Antiquities of the JewsXVIII.3.4 passage) to be partly genuine, while the other three maintain it to be entirely spurious. Coincidentally, the same three books also argue that Jesus did not exist.\" The other mention of Jesus in Josephus, Antiquities XX.9.1, is much more straightforward, but much more of a problem for Jesus Mythicists. In it Josephus recounts a major political event that happened when he was a young man. This would have been a significant and memorable event for him, since he was only 25 at the time and it caused upheaval in his own social and political class, the priestly families of Jerusalem that included his own. In 62 AD the Roman procurator of Judea, Porcius Festus, died while in office and his replacement, Lucceius Albinus, was still on his way to Judea from Rome. This left the High Priest, Hanan ben Hanan (usually called Ananus), with a freer reign than usual. Ananus executed some Jews without Roman permission and, when this was brought to the attention of the Romans, Ananus was deposed. This deposition would have been memorable for the young Josephus, who had just returned from an embassy to Rome on the behalf of the Jerusalem priests. But what makes this passage relevant is what Josephus mentions, in passing, as the cause of the political upheaval: Festus was now dead, and Albinus was but upon the road; so (the High Priest) assembled the Sanhedrin of judges, and brought before them the brother of Jesus, who was called Messiah, whose name was James, and some others; and when he had formed an accusation against them as breakers of the law, he delivered them to be stoned. This mention is peripheral to the story Josephus is telling, but since we know from Christian sources that Jesus' brother James led the Jesus sect in Jerusalem in this period and we have a separate, non-dependent, Christian account of James' execution by the Jerusalem priesthood, it is fairly clear which \"Jesus who was called Messiah\" Josephus is referring to here. Almost without exception, modern scholars consider this passage genuine and an undisputed reference to Jesus as a historical figure by someone who was a contemporary of his brother and who knew of the execution of that brother first hand. This rather unequivocal reference to a historical Jesus leaves Jesus Mythicists with a thorny problem, which they generally try to solve one of two ways: (i) \"The words \"who was called Messiah\" are a later Christian interpolation\" - Since it is wholly unlikely that a Christian interpolator invented the whole story of the deposition of the High Priest just to slip in this passing reference to Jesus, Mythicists try to argue that the key words which identify which Jesus is being spoken of are interpolated. Unfortunately this argument does not work. This is because the passage is discussed no less than three times in mid-Third Century works by the Christian apologist Origen and he directly quotes the relevant section with the words \"Jesus who was called the Messiah\" all three times: in Contra Celsum I.4, in Contra Celsum II:13 and in Commentarium in evangelium Matthaei X.17. Each time he uses precisely the phrase we find in Josephus: αδελφος Ιησου του λεγομενου Χριστου (\"the brother of that Jesus who was called Messiah\"). This is significant because Origen was writing a whole generation before Christianity was in any kind of position to be tampering with texts of Josephus. If this phrase was in the passage in Origen's time, then it was clearly original to Josephus. (ii) \"The Jesus being referred to here was not the Jesus of Christianity, but the 'Jesus, son of Dameus' mentioned later in the same passage.\" After detailing the deposition of the High Priest Ananus, Josephus mentions that he was succeeded as High Priest by a certain \"Jesus, son of Damneus\". So Mythicists try to argue that this was the Jesus that Josephus was talking about earlier, since Jesus was a very common name. It certainly was, but we know how Josephus was careful to differentiate between different people with the same common first name. So it makes more sense that he calls one \"Jesus who was called Messiah\" and the other \"Jesus son of Damneus\" to do precisely this. Nowhere else does he call the same person two different things in the same passage, as the Mythicist argument requires. And he certainly would not do so without making it clear that the Jesus who was made HIgh Priest was the same he had mentioned earlier, which he does not do. Mythicists are also still stuck with the phrase \"who was called Messiah\", which Origen's mentions show can't be dismissed as an interpolation. They usually attempt to argue that, as a High Priest, Jesus the son of Damenus would have been \"called Messiah\" because \"Messiah\" means 'anointed\" and priests were anointed with oil at their elevation. Since there are no actual examples of any priests being referred to this way, this is another ad hoc argument designed merely to get the Mythicist argument off the hook. So the consensus of scholars, Christian and non-Christian, is that the Antiquities XVIII.3.4 passage is authentic despite some obvious later additions and the Antiquities XX.9.1 passage is wholly authentic. These references alone give us about as much evidence for the existence of a historical \"Jesus, who was called Messiah\" as we have for comparable Jewish preachers and prophets and is actually sufficient to confirm his existence with reference to any gospel or Christian source. Put these references together with the other indications of the historicity of Jesus and you can see why almost all scholars - Christian, non-Christian, atheist, agnostic and Jewish - agree that a historical Jesus most likely existed. The idea that he did not is fringe theory that is not taken seriously in scholarship. ",
            "date": "Updated November 7, 2016",
            "views": "85",
            "upvotes": " View 154 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Humphrey Clarke",
                    "user_href": "/profile/Humphrey-Clarke"
                },
                {
                    "user_id": "Riccardo Zanardi",
                    "user_href": "/profile/Riccardo-Zanardi-2"
                },
                {
                    "user_id": "Sudip Bose",
                    "user_href": "/profile/Sudip-Bose-29"
                },
                {
                    "user_id": "Marcelo Henrique Soares da Silva",
                    "user_href": "/profile/Marcelo-Henrique-Soares-da-Silva-1"
                },
                {
                    "user_id": "Spencer Alexander McDaniel",
                    "user_href": "/profile/Spencer-Alexander-McDaniel"
                },
                {
                    "user_id": "Suneish Basu",
                    "user_href": "/profile/Suneish-Basu"
                },
                {
                    "user_id": "Vivek Rajan",
                    "user_href": "/profile/Vivek-Rajan-9"
                },
                {
                    "user_id": "Borna Brlošić",
                    "user_href": "/profile/Borna-Brlošić"
                },
                {
                    "user_id": "Kenneth Andre Brown Sr",
                    "user_href": "/profile/Kenneth-Andre-Brown-Sr-1"
                },
                {
                    "user_id": "John Oparinde",
                    "user_href": "/profile/John-Oparinde"
                },
                {
                    "user_id": "Eric Halvorsen",
                    "user_href": "/profile/Eric-Halvorsen-3"
                },
                {
                    "user_id": "Andrew Johns",
                    "user_href": "/profile/Andrew-Johns-58"
                },
                {
                    "user_id": "Niklas Backm",
                    "user_href": "/profile/Niklas-Backm"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Rob McCarthy",
                    "user_href": "/profile/Rob-McCarthy-11"
                },
                {
                    "user_id": "Lexy Mendez",
                    "user_href": "/profile/Lexy-Mendez"
                },
                {
                    "user_id": "Kiara Gigacz",
                    "user_href": "/profile/Kiara-Gigacz"
                },
                {
                    "user_id": "Joseph Fustero",
                    "user_href": "/profile/Joseph-Fustero"
                },
                {
                    "user_id": "Tommy Duff",
                    "user_href": "/profile/Tommy-Duff"
                },
                {
                    "user_id": "Chris Bahr",
                    "user_href": "/profile/Chris-Bahr"
                },
                {
                    "user_id": "Jackie Almeida",
                    "user_href": "/profile/Jackie-Almeida-6"
                },
                {
                    "user_id": "Abdul Zen",
                    "user_href": "/profile/Abdul-Zen"
                },
                {
                    "user_id": "John Titor",
                    "user_href": "/profile/John-Titor-70"
                },
                {
                    "user_id": "April Diamond",
                    "user_href": "/profile/April-Diamond-2"
                },
                {
                    "user_id": "Nikola Mileusnic",
                    "user_href": "/profile/Nikola-Mileusnic"
                },
                {
                    "user_id": "Gary Hiel",
                    "user_href": "/profile/Gary-Hiel"
                },
                {
                    "user_id": "Matthew Moppett",
                    "user_href": "/profile/Matthew-Moppett"
                },
                {
                    "user_id": "Illie Fleck",
                    "user_href": "/profile/Illie-Fleck"
                },
                {
                    "user_id": "Rajeev J Sebastian",
                    "user_href": "/profile/Rajeev-J-Sebastian"
                },
                {
                    "user_id": "Bruno Menezes de Oliveira",
                    "user_href": "/profile/Bruno-Menezes-de-Oliveira"
                },
                {
                    "user_id": "Mária Chudová",
                    "user_href": "/profile/Mária-Chudová"
                },
                {
                    "user_id": "Anthony Zarrella",
                    "user_href": "/profile/Anthony-Zarrella"
                },
                {
                    "user_id": "Oliver Henry",
                    "user_href": "/profile/Oliver-Henry-3"
                },
                {
                    "user_id": "Bassem Samir",
                    "user_href": "/profile/Bassem-Samir"
                },
                {
                    "user_id": "Asher Nitin",
                    "user_href": "/profile/Asher-Nitin"
                },
                {
                    "user_id": "Amitabh Adhikari",
                    "user_href": "/profile/Amitabh-Adhikari"
                },
                {
                    "user_id": "Michael Marshall",
                    "user_href": "/profile/Michael-Marshall-34"
                },
                {
                    "user_id": "Chloe Edmund",
                    "user_href": "/profile/Chloe-Edmund"
                },
                {
                    "user_id": "Christopher Svanefalk",
                    "user_href": "/profile/Christopher-Svanefalk-1"
                },
                {
                    "user_id": "Cole Cornelius",
                    "user_href": "/profile/Cole-Cornelius"
                },
                {
                    "user_id": "Mawussi Zounon",
                    "user_href": "/profile/Mawussi-Zounon"
                },
                {
                    "user_id": "Suzanne Fortin",
                    "user_href": "/profile/Suzanne-Fortin"
                },
                {
                    "user_id": "Sabu Augustine",
                    "user_href": "/profile/Sabu-Augustine"
                },
                {
                    "user_id": "Jean-Michel Reynaud",
                    "user_href": "/profile/Jean-Michel-Reynaud"
                },
                {
                    "user_id": "Wouter van Burik",
                    "user_href": "/profile/Wouter-van-Burik"
                },
                {
                    "user_id": "Armin Hanik",
                    "user_href": "/profile/Armin-Hanik-2"
                },
                {
                    "user_id": "Loretta B DeLoggio",
                    "user_href": "/profile/Loretta-B-DeLoggio"
                },
                {
                    "user_id": "Peter Baker",
                    "user_href": "/profile/Peter-Baker-5"
                },
                {
                    "user_id": "Zachary Turpin",
                    "user_href": "/profile/Zachary-Turpin"
                },
                {
                    "user_id": "Brent Fisher",
                    "user_href": "/profile/Brent-Fisher-1"
                },
                {
                    "user_id": "Benjamín Muñoz",
                    "user_href": "/profile/Benjamín-Muñoz-1"
                },
                {
                    "user_id": "Tanner Dodge",
                    "user_href": "/profile/Tanner-Dodge"
                },
                {
                    "user_id": "Daniel Ptashny",
                    "user_href": "/profile/Daniel-Ptashny-1"
                },
                {
                    "user_id": "Yaaseen Bodhanya",
                    "user_href": "/profile/Yaaseen-Bodhanya"
                },
                {
                    "user_id": "Mark Smith",
                    "user_href": "/profile/Mark-Smith-27"
                },
                {
                    "user_id": "Santie Engelbrecht",
                    "user_href": "/profile/Santie-Engelbrecht"
                },
                {
                    "user_id": "Amanda Bankston",
                    "user_href": "/profile/Amanda-Bankston-1"
                },
                {
                    "user_id": "Gustavo Pedroso",
                    "user_href": "/profile/Gustavo-Pedroso-2"
                },
                {
                    "user_id": "Nathan Mathews",
                    "user_href": "/profile/Nathan-Mathews-8"
                },
                {
                    "user_id": "Michael Jack Assels",
                    "user_href": "/profile/Michael-Jack-Assels"
                },
                {
                    "user_id": "Riaan Engelbrecht",
                    "user_href": "/profile/Riaan-Engelbrecht"
                },
                {
                    "user_id": "Nghia Nguyen",
                    "user_href": "/profile/Nghia-Nguyen-27"
                },
                {
                    "user_id": "Alfredo Perozo",
                    "user_href": "/profile/Alfredo-Perozo"
                },
                {
                    "user_id": "Isaac McPherson",
                    "user_href": "/profile/Isaac-McPherson"
                },
                {
                    "user_id": "Sneh Chakraburtty",
                    "user_href": "/profile/Sneh-Chakraburtty"
                },
                {
                    "user_id": "Biff Yeager",
                    "user_href": "/profile/Biff-Yeager"
                },
                {
                    "user_id": "Rogelio Lorenzo",
                    "user_href": "/profile/Rogelio-Lorenzo"
                },
                {
                    "user_id": "Andy Kaminski",
                    "user_href": "/profile/Andy-Kaminski-1"
                },
                {
                    "user_id": "Fred Green",
                    "user_href": "/profile/Fred-Green-1"
                },
                {
                    "user_id": "Cilliers van Niekerk",
                    "user_href": "/profile/Cilliers-van-Niekerk"
                },
                {
                    "user_id": "Niranjan Sankaran",
                    "user_href": "/profile/Niranjan-Sankaran"
                },
                {
                    "user_id": "Graham Poulter",
                    "user_href": "/profile/Graham-Poulter"
                },
                {
                    "user_id": "Darrel Bristow-Bovey",
                    "user_href": "/profile/Darrel-Bristow-Bovey"
                },
                {
                    "user_id": "Jacques Rousseau",
                    "user_href": "/profile/Jacques-Rousseau"
                },
                {
                    "user_id": "Tiago S. Paz",
                    "user_href": "/profile/Tiago-S-Paz"
                },
                {
                    "user_id": "Rajni Kachhela",
                    "user_href": "/profile/Rajni-Kachhela"
                },
                {
                    "user_id": "Jason Harris",
                    "user_href": "/profile/Jason-Harris-30"
                },
                {
                    "user_id": "Emmett Redd",
                    "user_href": "/profile/Emmett-Redd"
                },
                {
                    "user_id": "Steven Merz",
                    "user_href": "/profile/Steven-Merz"
                },
                {
                    "user_id": "Brandon Munson",
                    "user_href": "/profile/Brandon-Munson-2"
                },
                {
                    "user_id": "Megat Ilhan",
                    "user_href": "/profile/Megat-Ilhan"
                },
                {
                    "user_id": "Andy Skrzypacz",
                    "user_href": "/profile/Andy-Skrzypacz"
                },
                {
                    "user_id": "Barry Rountree",
                    "user_href": "/profile/Barry-Rountree"
                },
                {
                    "user_id": "Ngooi Chiu-Ing",
                    "user_href": "/profile/Ngooi-Chiu-Ing"
                },
                {
                    "user_id": "David Cary",
                    "user_href": "/profile/David-Cary-24"
                },
                {
                    "user_id": "Alex Hensley",
                    "user_href": "/profile/Alex-Hensley"
                },
                {
                    "user_id": "Miriam Ettrick",
                    "user_href": "/profile/Miriam-Ettrick"
                },
                {
                    "user_id": "Michael Alvis",
                    "user_href": "/profile/Michael-Alvis-1"
                },
                {
                    "user_id": "Jesse S. Lewis",
                    "user_href": "/profile/Jesse-S-Lewis"
                },
                {
                    "user_id": "Roman Huczok",
                    "user_href": "/profile/Roman-Huczok"
                },
                {
                    "user_id": "Michael Ryan",
                    "user_href": "/profile/Michael-Ryan-1120"
                },
                {
                    "user_id": "Denis Oakley",
                    "user_href": "/profile/Denis-Oakley"
                },
                {
                    "user_id": "Jackie Montgomery",
                    "user_href": "/profile/Jackie-Montgomery"
                },
                {
                    "user_id": "Jorge Gutierrez",
                    "user_href": "/profile/Jorge-Gutierrez-4"
                },
                {
                    "user_id": "Colin Aitken",
                    "user_href": "/profile/Colin-Aitken"
                },
                {
                    "user_id": "Tilman Ahr",
                    "user_href": "/profile/Tilman-Ahr"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jason-Blau"
                },
                {
                    "user_id": "Shawn Endresen",
                    "user_href": "/profile/Shawn-Endresen"
                },
                {
                    "user_id": "KC Wildmoon",
                    "user_href": "/profile/KC-Wildmoon"
                },
                {
                    "user_id": "Sebi Bihari",
                    "user_href": "/profile/Sebi-Bihari"
                },
                {
                    "user_id": "Mike Walton",
                    "user_href": "/profile/Mike-Walton-20"
                },
                {
                    "user_id": "James Clark",
                    "user_href": "/profile/James-Clark-253"
                },
                {
                    "user_id": "Peter Foran",
                    "user_href": "/profile/Peter-Foran"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Anders Wang-Rask",
                    "user_href": "/profile/Anders-Wang-Rask"
                },
                {
                    "user_id": "Alex Pismenny",
                    "user_href": "/profile/Alex-Pismenny"
                },
                {
                    "user_id": "Martin Berggren",
                    "user_href": "/profile/Martin-Berggren"
                },
                {
                    "user_id": "Michael Wright",
                    "user_href": "/profile/Michael-Wright-45"
                },
                {
                    "user_id": "Scott Lockwood",
                    "user_href": "/profile/Scott-Lockwood"
                },
                {
                    "user_id": "James Morgan Ayres",
                    "user_href": "/profile/James-Morgan-Ayres"
                },
                {
                    "user_id": "Jim Rahn",
                    "user_href": "/profile/Jim-Rahn"
                },
                {
                    "user_id": "Kenneth Sturges",
                    "user_href": "/profile/Kenneth-Sturges-1"
                },
                {
                    "user_id": "Jared Busby",
                    "user_href": "/profile/Jared-Busby-1"
                },
                {
                    "user_id": "TK Chia",
                    "user_href": "/profile/TK-Chia"
                },
                {
                    "user_id": "Olivier Garamfalvi",
                    "user_href": "/profile/Olivier-Garamfalvi"
                },
                {
                    "user_id": "Joshua Luke Kuehnel",
                    "user_href": "/profile/Joshua-Luke-Kuehnel"
                },
                {
                    "user_id": "Velimir Zivkovic",
                    "user_href": "/profile/Velimir-Zivkovic"
                },
                {
                    "user_id": "Michael Morris",
                    "user_href": "/profile/Michael-Morris-18"
                },
                {
                    "user_id": "Claire J. Vannette",
                    "user_href": "/profile/Claire-J-Vannette"
                },
                {
                    "user_id": "Jemima Foy",
                    "user_href": "/profile/Jemima-Foy"
                },
                {
                    "user_id": "Raktim Mittra",
                    "user_href": "/profile/Raktim-Mittra"
                },
                {
                    "user_id": "Matthew J. Abhold",
                    "user_href": "/profile/Matthew-J-Abhold"
                },
                {
                    "user_id": "Noel Cain",
                    "user_href": "/profile/Noel-Cain"
                },
                {
                    "user_id": "Darren Furlotte",
                    "user_href": "/profile/Darren-Furlotte"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Peter Wheeler",
                    "user_href": "/profile/Peter-Wheeler"
                },
                {
                    "user_id": "Rodrigo Estrada Gil",
                    "user_href": "/profile/Rodrigo-Estrada-Gil"
                },
                {
                    "user_id": "Piotr Łuba",
                    "user_href": "/profile/Piotr-Łuba"
                },
                {
                    "user_id": "Eamon O'Kelly",
                    "user_href": "/profile/Eamon-OKelly"
                },
                {
                    "user_id": "Cristy L",
                    "user_href": "/profile/Cristy-L-1"
                },
                {
                    "user_id": "Nitin Patel",
                    "user_href": "/profile/Nitin-Patel-46"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Camilo Raphael",
                    "user_href": "/profile/Camilo-Raphael"
                },
                {
                    "user_id": "Lorenzo Barattini",
                    "user_href": "/profile/Lorenzo-Barattini"
                },
                {
                    "user_id": "Johnson King",
                    "user_href": "/profile/Johnson-King-2"
                },
                {
                    "user_id": "Deborah Gahm",
                    "user_href": "/profile/Deborah-Gahm"
                },
                {
                    "user_id": "Johannes Richter",
                    "user_href": "/profile/Johannes-Richter"
                },
                {
                    "user_id": "Gabriele Alfredo Pini",
                    "user_href": "/profile/Gabriele-Alfredo-Pini"
                },
                {
                    "user_id": "J. B. Kelleher",
                    "user_href": "/profile/J-B-Kelleher"
                },
                {
                    "user_id": "Yves Granger",
                    "user_href": "/profile/Yves-Granger"
                },
                {
                    "user_id": "Rob Lion",
                    "user_href": "/profile/Rob-Lion"
                },
                {
                    "user_id": "Roger Jamieson",
                    "user_href": "/profile/Roger-Jamieson-2"
                },
                {
                    "user_id": "Pontus Rudholm",
                    "user_href": "/profile/Pontus-Rudholm"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jellypantz"
                },
                {
                    "user_id": "Marcus Werner",
                    "user_href": "/profile/Marcus-Werner"
                },
                {
                    "user_id": "Ernest Brejtfus",
                    "user_href": "/profile/Ernest-Brejtfus"
                },
                {
                    "user_id": "Jeremy Arnold",
                    "user_href": "/profile/Jeremy-Arnold-4"
                },
                {
                    "user_id": "Gavin Yu",
                    "user_href": "/profile/Gavin-Yu-1"
                },
                {
                    "user_id": "Joe Fessenden",
                    "user_href": "/profile/Joe-Fessenden"
                },
                {
                    "user_id": "Sam Parker",
                    "user_href": "/profile/Sam-Parker-416"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/LoneWolf-6"
                },
                {
                    "user_id": "Frans du Plessis",
                    "user_href": "/profile/Frans-du-Plessis-1"
                },
                {
                    "user_id": "Gabriel Cha",
                    "user_href": "/profile/Gabriel-Cha-1"
                },
                {
                    "user_id": "Petter Häggholm",
                    "user_href": "/profile/Petter-Häggholm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dick Harfield",
                "href": "/profile/Dick-Harfield"
            },
            "answer_text": "We have no primary historical records about Jesus. The gospels were originally anonymous until attributed to Matthew, Mark, Luke and John later in the second century. Most New Testament scholars agree that these attributions are unreliable and say that none of the gospels could have been written by an eyewitness to the life and mission of Jesus. The gospels could be valuable as secondary historical sources if they were written independently of each other, by authors more or less contemporary to the events they portray and in a position to know about those events. However, almost all New Testament scholars now agree that Mark was the first New Testament gospel to be written and that the Gospels of Matthew and Luke were substantially based on that gospel. A somewhat lesser majority of scholars say that John was inspired by the Gospel of Luke. Thus, we have only one original New Testament source, not four. Furthermore, the authors were not contemporary to the events portrayed, as even Mark’s Gospel was not written until around 70 CE, with the other gospels written in the decades that followed. Josephus wrote what he felt that his Roman audiences wanted to hear, so his histories are never accepted uncritically by modern historians. Moreover, the primary reference to Jesus, in a passage now known as the Testimonium Flavianum is believed to have been doctored by Christians to make it appear that Josephus provided evidence for Jesus. Two somewhat divergent versions of the text have survived. Most importantly, the passage could not have been written by a proud and observant Jew, as Josephus clearly was. It is possible that the Testimonium Flavianum is a forgery in its entirety, but more likely that it is based on a core that has been freely manipulated. This is not a reliable source. It is true that Tacitus wrote his Annals in the second century. He is considered a bad historian, even by the standards of his day, and freely allowed his own prejudices and biases to colour his writings. He reported the Christian story of Jesus living in Palestine and being crucified under Pontius Pilate, but his reports were based on Christian tradition or hearsay. Once again, this is not a reliable source. Subject to further study of the evidence, we can not be sure that Jesus lived in Palestine in the first century or that he was crucified under Pontius Pilate. Unfortunately, we have no primary historical source, and the secondary sources are not very reliable. ",
            "date": "Answered July 21, 2017",
            "views": "13",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Titor",
                    "user_href": "/profile/John-Titor-70"
                },
                {
                    "user_id": "Ken Osborne",
                    "user_href": "/profile/Ken-Osborne-5"
                },
                {
                    "user_id": "Kurt Behnke",
                    "user_href": "/profile/Kurt-Behnke"
                },
                {
                    "user_id": "Giuseppe Lettieri",
                    "user_href": "/profile/Giuseppe-Lettieri-1"
                },
                {
                    "user_id": "Joachim Nyman",
                    "user_href": "/profile/Joachim-Nyman"
                },
                {
                    "user_id": "Michael Rynn",
                    "user_href": "/profile/Michael-Rynn-1"
                },
                {
                    "user_id": "Michael Hirst",
                    "user_href": "/profile/Michael-Hirst-8"
                },
                {
                    "user_id": "Ahmed Hashim",
                    "user_href": "/profile/Ahmed-Hashim-24"
                },
                {
                    "user_id": "Zap Rowsdower",
                    "user_href": "/profile/Zap-Rowsdower-3"
                },
                {
                    "user_id": "Thomas Collinson",
                    "user_href": "/profile/Thomas-Collinson-1"
                },
                {
                    "user_id": "Sergey Bobyk",
                    "user_href": "/profile/Sergey-Bobyk"
                },
                {
                    "user_id": "Mike Massen",
                    "user_href": "/profile/Mike-Massen"
                },
                {
                    "user_id": "Jim Short",
                    "user_href": "/profile/Jim-Short-2"
                },
                {
                    "user_id": "Patrick Mwesige",
                    "user_href": "/profile/Patrick-Mwesige"
                },
                {
                    "user_id": "Elias Mossholm",
                    "user_href": "/profile/Elias-Mossholm"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Samuel Lebaron",
                    "user_href": "/profile/Samuel-Lebaron"
                },
                {
                    "user_id": "Gyorgy Ujlaki",
                    "user_href": "/profile/Gyorgy-Ujlaki"
                },
                {
                    "user_id": "Kat Ferguson",
                    "user_href": "/profile/Kat-Ferguson-3"
                },
                {
                    "user_id": "Tom Pickett",
                    "user_href": "/profile/Tom-Pickett-2"
                },
                {
                    "user_id": "Thomas Kutz",
                    "user_href": "/profile/Thomas-Kutz-2"
                },
                {
                    "user_id": "Kelly Cameron",
                    "user_href": "/profile/Kelly-Cameron-4"
                },
                {
                    "user_id": "Arthur Young, Jr",
                    "user_href": "/profile/Arthur-Young-Jr"
                },
                {
                    "user_id": "Naveen Lalit",
                    "user_href": "/profile/Naveen-Lalit"
                },
                {
                    "user_id": "Johan Lars Persson",
                    "user_href": "/profile/Johan-Lars-Persson"
                },
                {
                    "user_id": "Paul Goffin",
                    "user_href": "/profile/Paul-Goffin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Semple",
                "href": "/profile/Robert-Semple-4"
            },
            "answer_text": "The first difficulty we have is that there are very few manuscripts from the 1st C. CE. that survived. Very often a manuscript will quote a source, like we’re supposed to be doing on Quora. 95% of the material quoted no longer exists. So we have to make the best of what we’ve got. What we’ve got is a fair bit, but some of it is second hand, and some requires a lot of historical criticism. We have to recognize, before anything else, that people in the first century wrote for people in the first century. “Historical” is a concept that none of them would recognize. When Josephus was writing his Antiquities, he wasn’t concerned with history as we know it; he was writing to prove to the Romans that the Jewish faith was as ancient and deserved as much respect as the Greek philosophers. No one kept verbatim records. If a major character gave a speech, and the “historian” knew how it turned out, the historian would create a speech and put it in the character’s mouth. There are 3 relevant references in Josephus’ Antiquities; one about John the Baptist, one about James the brother of Jesus, and one about Jesus. The passages about John and James are generally considered authentic and unedited. The passage about Jesus is universally regarded as edited, but generally regarded as authentic (there is a passage about Jesus; there is considerable discussion about what Josephus originally wrote). We have a letter from Pliny, the governor of Antioch, to the emperor Trajan, in the year 111 CE., asking what to do about these “christians:” the term is derogatory; it means “little christs.” A little later we have Tacitus ca. 116 CE. again derogatory, calling christians haters of humankind. Again we are dealing with a society where 95% of the manuscripts don’t exist. Also 95% of the population couldn’t read. Therefore there was no need to have copies of everything in every home or even every church (it is extremely likely that there were early churches that were completely illiterate.) The writers within the New Testament are another issue. I believe most of them knew they were writing something special; I don’t believe that any of them knew they were writing Bible. So we have 5+ writers of the Gospel (Matthew, Mark, Luke, John, “Q”, parts of the gospel of Thomas, and a fragment from the gospel of Peter). We can and do approach them as historical (there’s that word again) documents. Speaking of Bible, there was no sense of need to create a canon in the earliest church. Until Marcion, a Gnostic heretic 140s CE, said that the Pauline epistles and the gospel of Luke were the only acceptable scriptures, did the church start thinking of what constituted a New Testament. Books on this tend to be dense, hard reading, and narrow focused. The easiest would be The Story of Christianity, Volume 1, by Justo Gonzalez. If you want to know about the origins of the New Testament try The Evolution of the Word by Marcus Borg. If you’re a nerd like me you can try The Birth of Christianity by John Dominic Crossan. ",
            "date": "Answered October 29, 2016",
            "views": "830",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Pierre Fakeo",
                    "user_href": "/profile/Pierre-Fakeo"
                },
                {
                    "user_id": "Harry Phillip Davis",
                    "user_href": "/profile/Harry-Phillip-Davis-1"
                },
                {
                    "user_id": "Steven Merz",
                    "user_href": "/profile/Steven-Merz"
                },
                {
                    "user_id": "Philipp Armingeon",
                    "user_href": "/profile/Philipp-Armingeon"
                },
                {
                    "user_id": "Tim O'Neill",
                    "user_href": "/profile/Tim-ONeill-1"
                },
                {
                    "user_id": "Javier Francisco",
                    "user_href": "/profile/Javier-Francisco"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Yue",
                "href": "/profile/Kevin-Yue-1"
            },
            "answer_text": "Hooo boy. This question again. I’m honestly tired of answering it so I’m going to tell a story. A friend of mine is a huge Star Wars nerd. So obviously he bought release-day tickets to The Last Jedi … and hated it. Seriously, he hated that movie. Even mention the name of that film and instant-rant. Now, you know what? That’s fine. He’s allowed to have his opinion. But no, that wasn’t good enough for my friend. So he went one step further. He went around telling everyone that The Last Jedi is non-canon, that it isn’t actually a part of the Star Wars universe, and that it’s not sanctioned by Lucas or Disney. Actually, according to him, it’s a movie made by another producer designed to make the Star Wars franchise look bad. Sound far-fetched? That is exactly how Atheists talk about the Bible.  Look, if you want to critique the Gospels, go ahead. That’s fine. But pretending the Gospels are not a part of historical record is simply a lie. Why do I say this? Because the Gospels aren’t an isolated source. Because it’s comprised of many sources, it includes its own collaboration. Anyone who tells you that you need “extra-biblical sources” is making things up.Because even despite #1, we actually do have external corroboration from Tacitus, Josephus, Mara, Lucian, and others.Because 4 historical sources is a lot. Tiberius has only 4 main sources which document his life, and he was the bloody Emperor of RomeBecause the Gospels can be dated very accurately to close geotemporal proximity to Jesus. We have 50,000 manuscript copies, dating to within 100 years of writing. As opposed to the 50 copies we have of Tacitus, within 1000 years.Because even conservative analyses describe them as second-person sources. So, what does this imply for Atheists? Very little, which is why it’s astounding to me that people keep lying about this. Historians believe the following 3 facts about Jesus: Jesus was a real person who was baptized by John the Baptist and crucified by Pontius PilateThree days after Jesus’ execution, his tomb was emptyJesus’ disciples claimed they had seen him rise from the dead.That’s all. Seriously, that’s it. You don’t have to suddenly become Christian. You don’t have to admit Jesus was a good person. You don’t even have to think The Last Jedi was a good film. Oh, but it also means that you need to stop saying stupid things like “Jesus is based on Horus.” No. He’s a real person. Real people aren’t “based on” fictional characters. I mean, come on, that doesn’t even make sense.  But then why even say that the Gospels are historical documents if you’re going to ignore everything they say? The simple answer is that someone can think they saw something and be mistaken. But there’s a world of difference between making a mistake and make-believe. A historical account doesn’t suddenly become fiction if the author makes a mistake.  If you want a more in-depth analysis of biblical sources, I cover it in more depth here: Historical Sources for Jesus by Kevin Yue Thanks for the A2A ",
            "date": "Answered September 10, 2018",
            "views": "41",
            "upvotes": " View 73 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Dorohov",
                    "user_href": "/profile/Daniel-Dorohov"
                },
                {
                    "user_id": "Natalia Roszkowska",
                    "user_href": "/profile/Natalia-Roszkowska"
                },
                {
                    "user_id": "Fiona Hurley",
                    "user_href": "/profile/Fiona-Hurley-3"
                },
                {
                    "user_id": "Heather Rose",
                    "user_href": "/profile/Heather-Rose-270"
                },
                {
                    "user_id": "Anastasia",
                    "user_href": "/profile/Anastasia-848"
                },
                {
                    "user_id": "Dave Kaczmarowski",
                    "user_href": "/profile/Dave-Kaczmarowski-1"
                },
                {
                    "user_id": "Ronil Doshi",
                    "user_href": "/profile/Ronil-Doshi"
                },
                {
                    "user_id": "Cristalle Watson",
                    "user_href": "/profile/Cristalle-Watson"
                },
                {
                    "user_id": "Sherri Reid",
                    "user_href": "/profile/Sherri-Reid-3"
                },
                {
                    "user_id": "Madison Hancock",
                    "user_href": "/profile/Madison-Hancock-11"
                },
                {
                    "user_id": "Billy Brant",
                    "user_href": "/profile/Billy-Brant"
                },
                {
                    "user_id": "Hazel Sarah Federico",
                    "user_href": "/profile/Hazel-Sarah-Federico"
                },
                {
                    "user_id": "Koryn Burgher",
                    "user_href": "/profile/Koryn-Burgher-2"
                },
                {
                    "user_id": "Steve Frateschi",
                    "user_href": "/profile/Steve-Frateschi"
                },
                {
                    "user_id": "Mark B. Howell",
                    "user_href": "/profile/Mark-B-Howell-1"
                },
                {
                    "user_id": "Jim Miller",
                    "user_href": "/profile/Jim-Miller-139"
                },
                {
                    "user_id": "Thomas Brown",
                    "user_href": "/profile/Thomas-Brown-145"
                },
                {
                    "user_id": "Priscilla Andrew",
                    "user_href": "/profile/Priscilla-Andrew-1"
                },
                {
                    "user_id": "John Cunningham",
                    "user_href": "/profile/John-Cunningham-213"
                },
                {
                    "user_id": "Ben Shropshire",
                    "user_href": "/profile/Ben-Shropshire"
                },
                {
                    "user_id": "James Ryan Wei Soo",
                    "user_href": "/profile/James-Ryan-Wei-Soo"
                },
                {
                    "user_id": "Sean P. Collins",
                    "user_href": "/profile/Sean-P-Collins"
                },
                {
                    "user_id": "Gerald Rhodes",
                    "user_href": "/profile/Gerald-Rhodes-2"
                },
                {
                    "user_id": "Andrew P. Frank",
                    "user_href": "/profile/Andrew-P-Frank"
                },
                {
                    "user_id": "Mikenkathy Healey",
                    "user_href": "/profile/Mikenkathy-Healey"
                },
                {
                    "user_id": "Oscar S. Grant",
                    "user_href": "/profile/Oscar-S-Grant"
                },
                {
                    "user_id": "Anjela Palmer",
                    "user_href": "/profile/Anjela-Palmer"
                },
                {
                    "user_id": "Megan Heeren",
                    "user_href": "/profile/Megan-Heeren"
                },
                {
                    "user_id": "Melinda Vaughn",
                    "user_href": "/profile/Melinda-Vaughn"
                },
                {
                    "user_id": "Janine Blackburn",
                    "user_href": "/profile/Janine-Blackburn"
                },
                {
                    "user_id": "Don Bruck",
                    "user_href": "/profile/Don-Bruck"
                },
                {
                    "user_id": "Jaap-Jan de Wit",
                    "user_href": "/profile/Jaap-Jan-de-Wit"
                },
                {
                    "user_id": "Veronica Young",
                    "user_href": "/profile/Veronica-Young-3"
                },
                {
                    "user_id": "Joy Latelle",
                    "user_href": "/profile/Joy-Latelle"
                },
                {
                    "user_id": "Howell Albano",
                    "user_href": "/profile/Howell-Albano"
                },
                {
                    "user_id": "Jonah Blessum",
                    "user_href": "/profile/Jonah-Blessum"
                },
                {
                    "user_id": "Michael Wignjoatmodjo",
                    "user_href": "/profile/Michael-Wignjoatmodjo"
                },
                {
                    "user_id": "Renato Angulo",
                    "user_href": "/profile/Renato-Angulo"
                },
                {
                    "user_id": "John Mullins",
                    "user_href": "/profile/John-Mullins-17"
                },
                {
                    "user_id": "Rajni Kachhela",
                    "user_href": "/profile/Rajni-Kachhela"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Musselman",
                "href": "/profile/Thomas-Musselman"
            },
            "answer_text": "The New Testament record is part of the historical record; figuring out what in it is factual versus belief statements is no easy task. If you go with the “minimalist” interpretation of the “Jesus Seminar” skeptics what we know is limited: Jesus was a Jew born in Nazareth and raised in the Galilee not far from the Roman-occupied but Greek-speaking town of Sepphoris. He publicly supported a reformed type of Judaism, was in our terms a “faith healer”, taught in parables, and had some type of conflict with Temple authorities at the Temple in Jerusalem causing the Romans to kill him. His followers had some type of experience that they identified as Jesus returning in some type of physical yet spiritual form that they viewed as the resurrection which until then had been expected to be a general resurrection at the end of time. Jesus and they appear to have thought the world was ending soon. Exactly which statement about his actions and which about his words are “historically true” is a matter of dispute with scholars since most of what we know comes from people who were already believers. Josephus is the earliest non-Christian source, and scholars credit some of what we have from him as added by Christians later but other statements about Jesus and his brother James to have been original to Josephus not Christians. By the time non-Jewish Romans were writing about Jesus Christianity had already begun to spread and the Romans were not writing about Jesus but his followers, except to note he existed. ",
            "date": "Answered August 27, 2018",
            "views": "44",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jim Schoepski",
                    "user_href": "/profile/Jim-Schoepski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Stevens",
                "href": "/profile/Ben-Stevens-55"
            },
            "answer_text": "Josephus and Tacitus alone are enough to prove Jesus existed and was crucified. See my detailed answer analyzing the passage in Josephus and its importance here: Ben Stevens's answer to What is the best evidence for a historical Jesus? As for Tacitus, he is one of the most reliable ancient historians we have! Tossing his claim away as Christian based is absurd. Tacitus in that very passage chastises Christians as superstitious and he had no love for the Jews! Even one of the most skeptical NT scholars John Dominic Crossan says: “That he [Jesus] was crucified is as sure as anything historical can ever be, since both Josephus and Tacitus, in texts to be seen in the final chapter, agree with the Christian accounts on at least that basic fact.”(Crossan, JRB, 163-4) Frankly Josephus and Tacitus are not even that important compared to the NT and other Christian literature. And let’s be honest, even later 2nd century Christian literature proves conclusively Jesus existed. But as for the NT, all its books were written in the 1st century. Even a liberal NT scholar John A.T. Robinson has contended for the whole NT dating BEFORE 70 A.D.! Though I disagree with some of his arguments, his point here stands beyond dispute on how early the dating of the NT has steadily become: “Yet the time-span over which the New Testament documents have been held to come into being has expanded and contracted in concertina fashion—or rather having been stretched to its greatest lengths by the extreme German critics of the nineteenth century it has been contracting fairly steadily ever since. At the turn of this century, the span extended from about AD 50 to about AD 150—and that was already a good deal shorter than it had been on some reckonings. By the middle of this century, with the isolated exception of one book, it was halved, from about AD 50 to about AD 100. I am personally of the opinion that it should be halved, or more than halved, again, from about AD 47 to just before AD 70.”(Robinson, CTNT, 62-63) 150 years sounds like nonsense. Anyone who contends that has never studied the history or just refuses to be convinced of it. I have only seen Archarya S. contend for a mid to even late 2nd century dating of the four Gospels and she was the liar (yes she most certainly lied and frequently in her books too) behind the made-up “facts” in the atrocious “Zeitgeist” documentary. This sort of hyper skepticism employed on the New Testament is never done anywhere else in antiquity. We do not have dates for events in even most POLITICAL history where the records and archaeological date are abundant…never mind Jesus was a poor, itinerant, preacher from Galilee. Blomberg uses this analogy: “A striking analogy to the problem of the four Gospels appears with the four extant accounts of Julius Caesar’s crossing the Rubicon River and committing himself to the civil war that would lead to his becoming emperor and turning the Roman republic into his empire. No-one knows for sure the exact date or location of this crossing. Not all of the details in each account readily square with one another; one even contains a narrative of the miraculous. Still, classicists have no doubt that the event was historical (and of historic significance).”(Blomberg, HRG, 34) In any event, the four Gospels represent Greco-Roman biographical genre written only a few decades after their figure. This is extremely early for antiquity and the fact we have not one (which would already be good) but four is astounding. And the fact we have this sort of evidence for a man like Jesus is nothing short of amazing. Such evidence would only be expected of over the top political figures deliberately trying to leave their mark on history. Yet Jesus even beats some of them. One secular NT scholar E.P. Sanders compares Jesus with no flattering language and his history to Alexander the Great’s (proving this is not a “Christian apologist” only analogy): “Finding out what Jesus thought is much closer to the quest for the historical Alexander [the Great]. Nothing survives that was written by Jesus himself. The more or less contemporary documents, apart from those in the New Testament, shed virtually no light on Jesus’ life or death, though they reveal a lot about the social and political climate. The main sources for our knowledge of Jesus himself, the gospels in the New Testament, are, from the point of view of the historian, tainted by the fact that they were written by people who intended to glorify their hero. The sources for Jesus are better, however, than those that deal with Alexander. The original biographies of Alexander have all been lost, and they are known only because they were used by later—much later—writers. The primary sources for Jesus were written nearer his own lifetime, and people who had known him were still alive. This is one of the reasons for saying that in some ways we know more about Jesus than about Alexander.”(Sanders, HFJ, 3-4) We could go into more details on the finer points associated with the Gospels. But this evidence should certainly be sufficient to demonstrate the Gospels were written close enough that maintain Jesus as a myth is untenable. The fact some are able too only proves human ingenuity to remain deluded and nothing more. Reference: Crossan, John D. Jesus: A Revolutionary Biography. HarperCollins, 1994. Robinson, John A.T. Can We Trust the New Testament? William B. Eerdmans Publishing Company, 1977. Blomberg, Craig L. The Historical Reliability of the Gospels. Downers Grove, IL. InterVarsity Press, 2007. Sanders, E.P. The Historical Figure of Jesus. Allen Lane The Penguin Press, 1993. ",
            "date": "Answered July 24, 2017",
            "views": "471",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elijah Lees",
                    "user_href": "/profile/Elijah-Lees"
                },
                {
                    "user_id": "Pennie Benavides",
                    "user_href": "/profile/Pennie-Benavides"
                },
                {
                    "user_id": "Rick Westera",
                    "user_href": "/profile/Rick-Westera"
                },
                {
                    "user_id": "Natalia Simanjuntak",
                    "user_href": "/profile/Natalia-Simanjuntak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurence Mohanty",
                "href": "/profile/Laurence-Mohanty"
            },
            "answer_text": "Thanks for A2A. All modern scholars agree on two points. Jesus was baptized by John the Baptist and he was executed by Pontius Pilate, a Roman Prefect. Also it is generally agreed that he was a Gallilian and he travelled to Judea. These conclusions have been arrived at on the basis of early and detailed writings about Jesus. A Jewish historian, Flavious Josephus, has mentioned Jesus in his book, ‘Antiquity of the Jews', which is a historical account of the Jews. A Roman politician named Tacitus has recorded that Jesus was executed by Pontius Pilate, a Roman Prefect in charge of Judea. Another Roman politician named Pliny has recorded that when he was Governor of northern Turkey a sect called Christians worshiped Christ as God. So, within decades of the death of Jesus he is mentioned by a Jewish historian and Roman politicians. This shows that Jesus actually lived. Also Christian writings within a few decades of Christ's death are proof that he existed. It is agreed that Paul's early letters were written within 25 years of Jesus' death. The gospels were written when the contemporaries of Jesus were still alive. They may disagree on details but all agree that Jesus lived and died. Some Rabbis have written that Jesus was a sorcerer. The Romans considered Jesus and the Christians as trouble makers. But nobody questioned the existance of Jesus Christ. So these records prove that Jesus did exist. ",
            "date": "Answered September 10, 2018",
            "views": "93",
            "upvotes": " Answer requested by Suyog S",
            "upvoters": [
                {
                    "user_id": "Roger Comeault",
                    "user_href": "/profile/Roger-Comeault"
                },
                {
                    "user_id": "Leonard J Shapiro",
                    "user_href": "/profile/Leonard-J-Shapiro"
                },
                {
                    "user_id": "Pierre Fakeo",
                    "user_href": "/profile/Pierre-Fakeo"
                },
                {
                    "user_id": "Marc Robidoux",
                    "user_href": "/profile/Marc-Robidoux"
                },
                {
                    "user_id": "Basil Fondu",
                    "user_href": "/profile/Basil-Fondu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "Most “credible historians” (that excludes almost all apologists) agree that the Bible is not a reliable source. (Either that or reality isn’t - since the Bible and reality differ.) Josephus wasn’t born until about 10–15 years after Jesus supposedly died, so anything he wrote about Jesus was hearsay. Since the earliest version of Antiquities we have is centuries after he died, and a Jew (which he was) wouldn’t have written some of what he wrote. (He says, “I shall accurately describe what is contained in our records… without adding any thing to what is therein contained, or taking away any thing therefrom.” - yet someone added the Testimonium sometimeafter he finished his writing.) Tacitus wasn’t born until a generation (at least) later. (If he was writing 150 years after Jesus’ death, he would have been over 125 years old.) So both of them are merely hearsay - writing what someone else told them (or told someone who told them, or …) Not the least bit authoritative. And that’s from the first century CE. Most of Christianity is from centuries later. ",
            "date": "Answered October 31, 2016",
            "views": "384",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jill Smith",
                    "user_href": "/profile/Jill-Smith-773"
                },
                {
                    "user_id": "Christoph Kohring",
                    "user_href": "/profile/Christoph-Kohring"
                },
                {
                    "user_id": "Michael Bodell",
                    "user_href": "/profile/Michael-Bodell-3"
                },
                {
                    "user_id": "Carey Sublette",
                    "user_href": "/profile/Carey-Sublette"
                },
                {
                    "user_id": "Jim Dorans",
                    "user_href": "/profile/Jim-Dorans-1"
                },
                {
                    "user_id": "Nelson Cunnington",
                    "user_href": "/profile/コニンゴトン-ネルスン-Nelson-Cunnington"
                },
                {
                    "user_id": "Shan Barani",
                    "user_href": "/profile/Shan-Barani-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Stafford",
                "href": "/profile/Greg-Stafford-7"
            },
            "answer_text": "Q: What does the historical record show about Jesus? Nothing. The “historical record” includes any material contemporary with the subject, whether gleaned from government documents, personal letters, or any kind of eye witness accounts. None exist that mention Jesus. One source often cited is by Josephus (Titus Flavius Josephus; born Yosef ben Matityahu), a Jew who helped the Romans during the First Jewish-Roman war, as well other contemporary first century events. Although later versions of his writing do mention Jesus experts generally agree that the mention is an interpolation because the style does not fit Joseph’s, and the paragraph severely breaks the flow of the narrative. All other sources are from later writers, including the Biblical gospels. ",
            "date": "Answered August 18, 2018",
            "views": "312",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Murali Krishnan",
                    "user_href": "/profile/Murali-Krishnan-138"
                },
                {
                    "user_id": "Zeb Holtz",
                    "user_href": "/profile/Zeb-Holtz-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Basil Fondu",
                "href": "/profile/Basil-Fondu"
            },
            "answer_text": "Not everyone agrees that Jesus lived. There is zero — that’s none, nada, zip, zero— contemporaneous documentation for Jesus. Everything written about him, in the Bible or outside it, was written multiple generations after he allegedly lived by people who never witnessed him living. Yes, that includes the Gospels which were not written by Matthew, Mark, Luke and John. The authors are unknown and all four date to multiple generations after Jesus allegedly lived. Tacitus and Josephus were not alive when Jesus allegedly lived and, thus, could not possibly have witnessed him living. Tacitus was simply repeating stories. The mention of Jesus in the works of Josephus is regarded as a forgery inserted by the Church in 400 C.E., long after even Josephus was dead. It was such a poor forgery that it used language not in use when Josephus lived. So, to answer your question directly, no, the early historic records (which aren’t all that early) are not remotely definitive evidence that Jesus lived. ",
            "date": "Answered October 29, 2016",
            "views": "388",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kumaraswamy S Vasan",
                    "user_href": "/profile/Kumaraswamy-S-Vasan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jo Wharrier",
                "href": "/profile/Jo-Wharrier"
            },
            "answer_text": "No. The gospels were based on oral history some two generations after his death. Given how story tellers like hyperbole to make their stories more interesting it is almost certain what we read is a composite of people and places with a splash of exaggeration. The only contemporary writer was Josephus who mentions Jesus twice though the second mention was almost certainly a later insertion. This is a common problem with copyists. Tacitus is wholly unreliable as his work would be hearsay alone. Paul never met Jesus and fell out with the disciples he did meet so again unreliable. The oldest bible found in Ethiopia does not have the last seven verses of Mark, The oldest gospel which throws into doubt the meeting at the tomb and the resurrection. So what do you think? Jesus existed? Probably. That he did all the things reported? Unlikely. ",
            "date": "Answered November 25, 2018",
            "views": "186",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Williams",
                    "user_href": "/profile/David-Williams-328"
                }
            ]
        },
        {
            "author_info": {
                "name": "Calvin Henrick",
                "href": "/profile/Calvin-Henrick"
            },
            "answer_text": "If we had a single text, I would have to say no. However, we have a number of text and, once you accumulate all of them, it is a gigantic leap to say that there was not a man called Jesus who was crucified by the Romans and whose followers worshiped “as a god”, as one source puts it. This is a lecture going through much of the historical evidence for Jesus from secular and hostile witnesses. The lecture is, of course, by a Christian, but this stuff is part of what converted him in the first place.  ",
            "date": "Answered October 30, 2016",
            "views": "145",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leonard J Shapiro",
                    "user_href": "/profile/Leonard-J-Shapiro"
                },
                {
                    "user_id": "Pierre Fakeo",
                    "user_href": "/profile/Pierre-Fakeo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucha Tijuanera",
                "href": "/profile/Lucha-Tijuanera"
            },
            "answer_text": "The Roman historian and senator Tacitus referred to Christ, his execution by Pontius Pilate, and the existence of early Christians in Rome in one page of his final work, Annals (written ca. AD 116), book 15, chapter 44.[1] The context of the passage is the six-day Great Fire of Rome that burned much of the city in AD 64 during the reign of Roman Emperor Nero.[2] The passage is one of the earliest non-Christian references to the origins of Christianity, the execution of Christ described in the canonical gospels, and the presence and persecution of Christians in 1st-century Rome.[3][4] Scholars generally consider Tacitus' reference to the execution of Jesus by Pontius Pilate to be both authentic, and of historical value as an independent Roman source.[5][6][7] Eddy and Boyd state that it is now \"firmly established\" that Tacitus provides a non-Christian confirmation of the crucifixion of Jesus.[8] Historian Ronald Mellor has stated that the Annals is \"Tacitus's crowning achievement\" which represents the \"pinnacle of Roman historical writing\".[9] Scholars view it as establishing three separate facts about Rome around AD 60: (i) that there were a sizable number of Christians in Rome at the time, (ii) that it was possible to distinguish between Christians and Jews in Rome, and (iii) that at the time pagans made a connection between Christianity in Rome and its origin in Roman Judea.[10][11] Tacitus on Christ - Wikipedia ********** ",
            "date": "Answered March 5, 2018",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Gibbs",
                "href": "/profile/Robert-Gibbs-14"
            },
            "answer_text": "The Gospel accounts, with the exception of Luke’s gospel, were written by eyewitness. Luke states that he throughly gathered the information for his gospel, which no doubt included the eyewitness accounts of many who were with Jesus and heard the things he said and saw the things he did. When these accounts were written, with the exception of John’s Gospel which was written later, there were hundreds of eyewitnesses still alive, these could have disputed any inaccuracies in the Gospel accounts, but there is no record that any eyewitness ever objected to the details in the gospel accounts. 1 Corinthians 15: 5–6 NW — … he appeared to Ceʹphas, and then to the Twelve. After that he appeared to more than 500 brothers at one time, most of whom are still with us, though some have fallen asleep in death. ",
            "date": "Answered July 2, 2018",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Bozinovich",
                "href": "/profile/Chris-Bozinovich"
            },
            "answer_text": "I don't see how it's even possible to be whipped, slashed, and beaten could carry the cross he carried by himself. I don't see how a common carpenter could push a giant boulder or of the way and escape a cave. I don't think that stuff is Any bit reliable. They say the actual cross is hidden in the Vatican along with the original Bible that was written in Arabic. They once had n article on the internet with the so called skeleton of Jesus Christ. ",
            "date": "Answered October 30, 2016",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Taylor",
                "href": "/profile/John-Taylor-640"
            },
            "answer_text": "There are a lot of historical writings about Jesus, many more than writing about Caesar or any of the Greek writers. Also, there are comments from a number of ancient writers. Being therefore this kind of person [i.e., a heartless Sadducee], Ananus, thinking that he had a favorable opportunity because Festus had died and Albinus was still on his way, called a meeting [literally, “sanhedrin”] of judges and brought into it the brother of Jesus-who-is-called-Messiah … James by name, and some others. He made the accusation that they had transgressed the law, and he handed them over to be stoned.13 –Josephus ▸ Pliny the Younger, a Roman governor and friend of Tacitus, wrote about early Christian worship of Christ “as to a god.” \"But Sunday is the day on which we all hold our common assembly, because it is the first day on which God, having wrought a change in the darkness and matter, made the world; and Jesus Christ our Saviour on the same day rose from the dead. For He was crucified on the day before that of Saturn (Saturday); and on the day after that of Saturn, which is the day of the Sun, having appeared to His apostles and disciples, He taught them these things, which we have submitted to you also for your consideration.\" -First Apology of Justine Martyr. Chapter 67 (150-160) \"Believe on the Lord Jesus Christ and you shall be saved\" Acts 16:31 ",
            "date": "Answered March 4, 2018",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Winslade",
                "href": "/profile/Mike-Winslade"
            },
            "answer_text": "Are the gospel stories of Jesus based on the testimony of eyewitnesses and therefore historically reliable? Partly, maybe. Obviously the part where the family of Jesus left immediately for Egypt (Matthew 2:14) and also at the same time the family left for Nazareth (Luke 2:39) both cannot be literally true. The same would go for any number of other contradictions in the story. The gospels are not contemporary, eyewitness testimony. At best they were written decades after the purported events and were probably not written by the attributed authors. It follows that the historical reliability is probably not rated that high. ",
            "date": "Answered July 2, 2018",
            "views": "47",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leonard J Shapiro",
                    "user_href": "/profile/Leonard-J-Shapiro"
                },
                {
                    "user_id": "Pierre Fakeo",
                    "user_href": "/profile/Pierre-Fakeo"
                },
                {
                    "user_id": "Ken Osborne",
                    "user_href": "/profile/Ken-Osborne-5"
                },
                {
                    "user_id": "Basil Fondu",
                    "user_href": "/profile/Basil-Fondu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Reid",
                "href": "/profile/Paul-Reid-36"
            },
            "answer_text": "Neither Tacitus not Josephus are credible sources, and there is no historical record of Jesus at all…and not all academics and historians believe in his existence, it is by no means a general consensus. Some historians believe that a Jesus probably existed as a person, but attach no supernatural significance to that. ",
            "date": "Answered October 29, 2016",
            "views": "211",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Massen",
                    "user_href": "/profile/Mike-Massen"
                },
                {
                    "user_id": "Matthew Moppett",
                    "user_href": "/profile/Matthew-Moppett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Motel",
                "href": "/profile/Steve-Motel"
            },
            "answer_text": "The Josephus Antiquities piece is a tricky one. A majority of Biblical and Josephus scholars may well agree that part of the passage is historical and part is an interpolation. That said, they may, or may not. I’m certainly not aware of any polling or similar! And, I am aware of reputable scholars who do claim the whole passage is an interpolation. That has no major bearing on Jesus’ actual historicity; it does have some bearing on reading that whole section of the Antiquities. ",
            "date": "Answered April 10, 2017",
            "views": "93",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Schaefer",
                    "user_href": "/profile/Eric-Schaefer-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandy Sommers",
                "href": "/profile/Sandy-Sommers-3"
            },
            "answer_text": "Not even close; the gospels were written decades after the alleged Jesus and they were written by ghost writers based on traditional oral history (hearsay). There were no eyewitness accounts of Jesus for obvious reasons. ",
            "date": "Answered July 2, 2018",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wyatt Wye",
                    "user_href": "/profile/Wyatt-Wye"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Suiter",
                "href": "/profile/Jeremy-Suiter-3"
            },
            "answer_text": "The authority for any historical figure is the ancient history encyclopedia this is where you will find if Jesus existed, as well as the evidence for and agaisnt his existence. Jesus is a historical fact. ",
            "date": "Updated September 3, 2018",
            "views": "187",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Joshua Wofford",
                "href": "/profile/Joshua-Wofford-1"
            },
            "answer_text": "Yes. I would recommend the work of Lee strobel and Gary habermas if you want to research this furthet ",
            "date": "Answered July 2, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George Matsos",
                "href": "/profile/George-Matsos-1"
            },
            "answer_text": "the Gospels do not even explicitly claim Matthew, Mark, Luke, or John as their authors. Instead, the Gospels have an abnormal title convention, where they instead use the Greek preposition κατά, meaning “according to” or “handed down from,” followed by the traditional names which are in the accusative case. For example, the Gospel of Matthew is titled εὐαγγέλιον κατὰ Μαθθαίον (“The Gospel according to Matthew). If it were intended to show that the name given to each gospel is also the name of the author of the Gospel, then these names would end in the genetive case to show possession. ",
            "date": "Answered July 2, 2018",
            "views": "112",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "George Hartwell",
                "href": "/profile/George-Hartwell"
            },
            "answer_text": "Some of the best documented historical records are the four books written about Jesus. They are called Matthew, Mark, Luke and John. As historical documents that may the best documented records of the time. They are real historical records and stand up to careful historical examination. They have proven themselves accurate against many questions and doubts as we learn more. ",
            "date": "Answered March 5, 2018",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheila Davis",
                "href": "/profile/Sheila-Davis-36"
            },
            "answer_text": "I would say those written by Tacitus- Roman Senator historian,…Josephus-Jewish historian,…Pliny the Roman-Senator governor,… Lucian of Samosata-Greek Satirest. These people never personally met Jesus but the Romans referred to him as Christus, they personally dealt with the first century Christians. ",
            "date": "Answered July 22, 2017",
            "views": "16",
            "upvotes": "0"
        }
    ]
}