{
    "title": "Are Kuwait and Palestine allies? - Quora",
    "tags": [
        "International Relations of Kuwait",
        "International Relations of Palestine",
        "Foreign Relations of Palestine",
        "Kuwait",
        "Palestine",
        "Israeli–Palestinian Conflict"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amjad Shadid",
                "href": "/profile/Amjad-Shadid-1"
            },
            "answer_text": " Palestine and Kuwait are recently renewing their relations for the better. As many Gulf nations are unfortunately forgetting the Palestinians, Kuwait is one of the few who refuses to adopt the new Gulf policy on Israel. Kuwait stated that it will be the last to normalize relations with Israel and that they will never normalize until a Palestinian state with East Jerusalem as it’s capital, is established. They’re even considering opening an office or embassy in the Palestinian territories. Kuwait even made a draft resolution at the UN Security Council, proposing international protection of the Palestinians from any threats, such as those from Israel. It was made after Israel killed dozens of Palestinians in the Gaza border. Kuwait even had to risk straining relations with the United States, over a bunch of civilians being killed. Israel deducts money that Palestinians transfer to the families of people killed, injured or jailed. Kuwait is one of the countries criticizing Israel at the UN for this move, along with Indonesia, stating that Palestinians “have the right ... to do whatever they want with their money.” Kuwait is challenging the United States over the Palestinians, and absolutely rejecting the US Embassy move in Jerusalem in Dec 2017, and even invited Jimmy Carter to its country for that. Kuwait is, therefore, acting as one of Israel’s biggest opponents, despite being in the GCC.  Kuwaiti demonstrators protest embassy move to Jerusalem. However, relations between Kuwaitis and Palestinians have such a negative past. When PLO leader Yasser Arafat naively supported Saddam Hussein and his invasion of Kuwait, the Kuwaitis and the Palestinians living in Kuwait were frustrated. There was an exodus of 200,000 Palestinians and Kuwaitis, by Iraqi forces. Iraqi forces also put pressure on the PLO office in Kuwait. There was only one demonstration by Palestinians in Kuwait during the occupation, which was a pro-Kuwaiti one. After Kuwait was liberated of Iraqi forces, the Kuwaitis were mad at the Palestinians. There were still 200,000 Palestinians in Kuwait, out of the previous 400,000. After one week in March 1991, the Palestinian population was almost gone. As a Palestinian, my parents and their families used to reside in Kuwait. They said that they experienced some sort of discrimination, with them being repeatedly called by Kuwaitis as “Fulustun”. They also fled Kuwait after Iraq invaded it, and both my parents’ families moved to Jordan. Today, Palestinians are not as discriminated and hated by Kuwaitis, at least the younger generation, as 25 years ago. But the hate is still directed by Kuwaitis of older generations, who blame the Palestinians for betraying Kuwait. They are told by many Palestinians that they can’t be blamed for their leader’s mistake and that Palestinians helped Kuwaitis in various ways during the war. Still, many young and freshly educated Palestinians are returning to Kuwait for work. We cannot judge a relationship by it’s past. We judge it by its present stage. Kuwait and Palestine are becoming stronger allies of each other. And as a Palestinian, I love Kuwait, and many of my relatives love it as well. May Allah bless Kuwait!  MP Abdullah Fuhad Al-Enezi displaying the 'kaffiyeh' as a sign of support for Palestine in face of Trump's move on Jerusalem. Kuwait refuses to budge as other Gulf nations abandon the Palestinian cause PressTV-Poll: 85% of Kuwaitis reject normalization with Israel Kuwait proposes 'international protection' for Palestinians Palestine-Kuwait relations: 'Ice has started to melt' Palestinians Tell of Abuse From Resentful Kuwaitis ",
            "date": "Answered March 10, 2019",
            "views": "645",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tanzilur Rahaman",
                    "user_href": "/profile/Tanzilur-Rahaman"
                },
                {
                    "user_id": "Waleed Khalid Shaikh",
                    "user_href": "/profile/Waleed-Khalid-Shaikh-2"
                },
                {
                    "user_id": "Mohammad Salem",
                    "user_href": "/profile/Mohammad-Salem-42"
                },
                {
                    "user_id": "Hashim Al-Hawazini",
                    "user_href": "/profile/Hashim-Al-Hawazini"
                },
                {
                    "user_id": "Ahmad Kadan",
                    "user_href": "/profile/Ahmad-Kadan"
                },
                {
                    "user_id": "Pranay Kumar Shome",
                    "user_href": "/profile/Pranay-Kumar-Shome"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ram Ohri",
                "href": "/profile/Ram-Ohri"
            },
            "answer_text": "No, they are not allies. But Kuwait, like many other Muslim countries has lots of people who sympathise with Palestinians and their terrorism. Ram Ohri ",
            "date": "Answered January 1, 2017",
            "views": "234",
            "upvotes": "0"
        }
    ]
}