{
    "title": "As a French leader how does the Sun King, Louis 14th, compare with Napoleon? - Quora",
    "tags": [
        "French Leaders",
        "Napoleon Bonaparte",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yvan Testu",
                "href": "/profile/Yvan-Testu"
            },
            "answer_text": "Both can be compared because they used french human stock as cannon fodder, they settled their capital in the Ile de France ( Versailles and Paris distance is 20 km ) and they started a complete reorganisation of Europe since the Spanish King realm was divided in 3, Latin America + Philippines went to the Spanish line, France + Louisiana to the Bourbon line, Milanese + the 10 Low Countries to the Austrian habsbourg linesince the Austrian habsbourg line was also the Emperor of the Holy Roman Empirethe result is that France was completely surrended by the Austrians ( except at Switzerland level ) both wanted sea dominance but both were more skilled in battling on the ground Napoléon made a better job because he took control of the Rhine ( the Rhine Confederation ) and although Louix XIV made great allegoric paintings of his Rhine crossing he did not managed the Rhine Napoleon broke the austrian hard hand, after the congress of Vienna, France was surrended with various monarch families, the Dutch stathouder, a combination of Habsburg/Hohenzollern in the German confederation, the neutral Switzerland, the Savoy family in the Piedmont and the Borbon in Spain. Although Louis XIV battled a lot he had an intense diplomatic activity in Versailles and had been surrended by top level people ( Vauban, Louvois, Richelieu and then Mazarin ), Napoleon was more reacting as a gifted General and made poor use of political resources like the diplomatic skills of Talleyrand or the naval skills of La Fayette ",
            "date": "Answered October 14, 2016",
            "views": "990",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Valeriy Prokhorov",
                "href": "/profile/Valeriy-Prokhorov"
            },
            "answer_text": "In general, Napoleon was far more superior ruler than Louis XIV was. First and foremost, Napoleon has turned French state into a modern and relatively efficient mechanism, cemented by Napoleon’s code and spirited by the core values of French Revolution. Even Bourbon Restoration has failed to roll these changes back, disregarding the dreams of Louis XVIII and (especially) Charles X. In comparison, Louis has left behind a deeply flawed mostly feudal type of state which was evident to some of the smarter contemporaries. Some historians even blame Louis XIV for the Revolution of 1789 and this is not an extreme view. On a personal level I just can’t compare an educated workaholic Napoleon to a mediocre (although highly self confident) Louis, or a guy who effectively granted a freedom of religion in France to a guy who has expelled the Protestants in 1685. One has left a legacy in arts, paintings, architecture. Another one has left Civil Code, good roads (bandit free), educational system, National Bank, unified taxation, etc. For me the winner is obvious ",
            "date": "Answered May 31, 2020",
            "views": "242",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tin Pizent",
                    "user_href": "/profile/Tin-Pizent"
                },
                {
                    "user_id": "Nadia A. Hernandez",
                    "user_href": "/profile/Nadia-A-Hernandez"
                },
                {
                    "user_id": "Kaivalyae Panicker",
                    "user_href": "/profile/Kaivalyae-Panicker"
                },
                {
                    "user_id": "Shiv Malik",
                    "user_href": "/profile/Shiv-Malik-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Moran",
                "href": "/profile/William-Moran-11"
            },
            "answer_text": "I give the nod to Louis XIV. Both were fairly evenly matched at the art of war, both beggared and wrecked the nation, but Louis was the better ruler… and builder Napoleon left this behind — his arch of triumph:  Louis left this — the Palace of Versailles :  Gardens  Hall of Mirrors  On view of the exterior (there are many more) Louis was also patron of the arts Neither cared much for the common folk ",
            "date": "Updated October 15, 2016",
            "views": "660",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruben Wahab",
                    "user_href": "/profile/Ruben-Wahab"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pete Laberge",
                "href": "/profile/Pete-Laberge"
            },
            "answer_text": "I do not have time tonite for a complete answer, and besides I just went through a wonderful root canal….. But here is a cute little ditty on Louis XIV :Louis XIV And here is Music Vid on Napoleon:  And a cartoonish vid on Waterloo:  Enjoy! ",
            "date": "Answered October 14, 2016",
            "views": "464",
            "upvotes": "0"
        }
    ]
}