{
    "title": "At the end of World War 2, what carriers had radar-equipped aircraft? - Quora",
    "tags": [
        "Radar",
        "Aircraft Carriers",
        "World Wars",
        "Aircraft",
        "World War II",
        "Warfare",
        "Military",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Lund",
                "href": "/profile/Erik-Lund-1"
            },
            "answer_text": "It seems as though this question is another window into grognard fightermania. Including surface search radar, all surviving aircraft carriers had radar-capable aircraft by the end of the war. Fairey Barracuda - Wikipedia The Grumman TBF/TBM Avenger If the question is about carrier-borne, radar-equipped night fighters, the difficulties of carrier night operations largely reserved this function to a few carriers, with Enterprise famously being the only night carrier in the Pacific at the end of the war. USS Enterprise (CV-6) - Wikipedia However, sometimes you can’t see even in daylight, and carrier arms were working out the all-weather fighter intercept role. All-weather interception would seem to call for radar on interceptors. The problem with that is that you can put a radar on a single seat fighter, but you can’t invent the time and attention the pilot requires to fly their plane and monitor the radar at the same time. That’s more-or-less an operational critique, and an explanation for the use of Avengers as night-fighters in spite of their inability to intercept pretty much anything. Admirals were free to throw a few late-war SE fighter conversions aboard the carrier fleet to see if an avionics miracle would occur, and British admirals had the advantage that the Admiralty had been thinking about this for longer than the Navy Department, and consequentially had the perhaps slightly more suitable Firefly. I wouldn’t go so far as to call any of this being “radar capable,” in the sense that they were capable of actually using these radars effectively. There’s a reason that the postwar navies spent so much time and effort developing dedicated all-weather fighters. (Apart from the chance to kill two naval aviators for the price of one. Whoo boy was that stuff dangerous!) Per the stipulations of the question, however, those carriers were already radar-capable in the much more important sense of being able to use radar to carry out the function for which carriers arguably exist in the first place —finding and sinking enemy boats. ",
            "date": "Answered October 24, 2020",
            "views": "95",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fernando Rolandelli",
                    "user_href": "/profile/Fernando-Rolandelli-1"
                },
                {
                    "user_id": "Loring Chien",
                    "user_href": "/profile/Loring-Chien"
                },
                {
                    "user_id": "Billy Clement",
                    "user_href": "/profile/Billy-Clement-2"
                },
                {
                    "user_id": "Bosley Plourde",
                    "user_href": "/profile/D-B-Oswald"
                }
            ]
        },
        {
            "author_info": {
                "name": "James O’Shea",
                "href": "/profile/James-O-Shea-4"
            },
            "answer_text": "Small numbers if F6F-3N radar-equipped Hellcats flew off USN carriers, usually under a half dozen embarked, and smaller numbers of F6F-5N radar Hellcats off of British carriers, in even smaller groups. The F4U-3E and -3N Corsairs were too late for the war. Most fleet carriers in the USN had a few F6F-3Ns. HMS Indomitable carried three -5Ns as part of its air group at Okinawa, the other British Pacific Fleet carriers used Corsairs or Seafires for fighters, and Seafires didn’t have radar while radar Corsairs weren’t available. The -5Ns usually fought in daylight with the other Hellcats. Night fighter cover over Okinawa was often operated by USAAF P-61 long-range night fighters, not aircraft from the carriers. A P-61 over Japan forced down a Japanese fighter late on 15 August 1945, a few hours after a Seafire from British Pacific Fleet killed a Japanese fighter; the Seafire is usually credited as getting the last air-to-air kill of the war, as the P-61 didn’t fire a shot, just forced the Japanese aircraft to go too fast too low and hit the water. USN Airborne Early Warning aircraft were typically PBYs with radars, and therefore not carrier-based. The USN usually used destroyers, supported by light craft such as LSTs, as radar pickets rather than AEW aircraft; see further USS Aaron Ward and USS Laffey, just for examples. ",
            "date": "Answered October 24, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Loring Chien",
                    "user_href": "/profile/Loring-Chien"
                }
            ]
        }
    ]
}