{
    "title": "Can organic farming done in conventional farm? - Quora",
    "tags": [
        "Organic Food",
        "Organic Farming",
        "Farming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dipra Sen",
                "href": "/profile/Dipra-Sen"
            },
            "answer_text": "The answer is both YES and NO. Why YES? The main concept of organic farming is that soil is a living entity. If the farm is used for conventional chemical farming for long period then the soil is probably dead with no or little micro-nutrients left for farming. To convert that conventional farm into an organic farm requires 2-3 years of organic practice. During the last 12 months of this period, the farm must be under supervision of 1 of 18 organic certification agencies accredited by National Accreditation Body as mentioned by A.S Ramprasad.  Why NO? There are some practical constraints in organic farming. If you are a small farmer: If your neighboring farms are in conventional farming then you must maintain a butter zone of 25–50 feet depending on crops and other conditions. If you’re a marginal to small farmer then you’ll have very small farming space left for organic farming after leaving the buffer zone.If you are a medium farmer: Here is the real potential of organic farming. If you have few acres of land and some livestock then you’re in haven. You can do organic farming with peace in mind. Make your own organic manure, bio-pesticides from your livestock and farm residues.If you are a large commercial farmer: In this case you have acres of farmland, so no problem for the buffer zone. But the main problem is the size of your land itself. With larger land size you’ll need greater amount of organic manures, pesticides etc. Right now, the market for organic manure and bio-pesticides is still very small in India. You’ll have to deal with the resource problem. If you want to produce your own manures then you’ll need to set up a medium sized dairy. This increases the risk of profitability. If the dairy fails, you will be at loss. I hope you’ve found this answer helpful. You can visit our website for more details on organic farming. Never forget to give ‘Upvote’ with a smile :) ",
            "date": "Answered January 24, 2018",
            "views": "632",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ajit Kumar",
                    "user_href": "/profile/Ajit-Kumar-4391"
                },
                {
                    "user_id": "Anand Manral",
                    "user_href": "/profile/Anand-Manral-2"
                },
                {
                    "user_id": "Ira Periyavallur",
                    "user_href": "/profile/Ira-Periyavallur"
                }
            ]
        },
        {
            "author_info": {
                "name": "A.S Ramprasad",
                "href": "/profile/A-S-Ramprasad"
            },
            "answer_text": "Yes. Organic farming can be done on conventional farming field, but the land must be managed as organic for 36 months prior to the first organic harvest. During the last 12 months of this period, it must be under the supervision of an organic certification body (i.e. that the farm has been reviewed and approved as a transitional organic farm). Till that 36 months, food grown cannot be considered as organic food. The idea behind this is, what ever residual effects of conventional farming are there, they must be get cleared in these 36 months. Till then it is called transitional organic farm ",
            "date": "Answered April 29, 2016",
            "views": "480",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anand Manral",
                    "user_href": "/profile/Anand-Manral-2"
                },
                {
                    "user_id": "Ashish Mishra",
                    "user_href": "/profile/Ashish-Mishra-142"
                },
                {
                    "user_id": "Raj Kiran",
                    "user_href": "/profile/Raj-Kiran-31"
                },
                {
                    "user_id": "Ajay Balashetti",
                    "user_href": "/profile/Ajay-Balashetti"
                },
                {
                    "user_id": "Kavitha Krishna",
                    "user_href": "/profile/Kavitha-Krishna"
                }
            ]
        }
    ]
}