{
    "title": "Can my school see what I am doing on my phone if I am connected to their WiFi? - Quora",
    "tags": [
        "Wi-Fi Access Points",
        "Wireless Technology",
        "Wi-Fi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Perkins",
                "href": "/profile/Daniel-Perkins-22"
            },
            "answer_text": "Most likely the answer is yes. They can monitor the traffic and see what you've been searching. That said, unless you are searching some pretty heavy topics (stuff that definitely wouldn't fly with your parents), the chances of them noticing your traffic and looking into it would be slim to none. If you would like to combat them viewing your searches, you can use a VPN. I use a free VPN on my iPhone called FreeVPN. Watch an ad before connecting, then connect and enjoy (from what I've seen) unlimited data usage. Works for me at my school and is pretty fast too. ",
            "date": "Answered September 10, 2018",
            "views": "22",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Flynn Mckee",
                    "user_href": "/profile/Flynn-Mckee-1"
                },
                {
                    "user_id": "Judee Hmawe",
                    "user_href": "/profile/Judee-Hmawe"
                },
                {
                    "user_id": "Peter Theodore Yang",
                    "user_href": "/profile/Peter-Theodore-Yang"
                },
                {
                    "user_id": "Cory Meisch",
                    "user_href": "/profile/Cory-Meisch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinayak Saini",
                "href": "/profile/Vinayak-Saini-10"
            },
            "answer_text": "If they know usage of wifi or they have a techincal user available there then there is possiblity but not only you are vulnerable to school staff but also anyone who know how to do mitm (man in the middle attack ) on wifi To monitor your actions like seeing what you are seeing Monitoring what u downloaded or where u go surf over internet and sme things happens with your credentials and other sensitive data u see all are exposed but all are average user then no problem you are hidden until someone shoulder surf you ",
            "date": "Answered September 11, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patel Darshan",
                    "user_href": "/profile/Patel-Darshan-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Katsman",
                "href": "/profile/Steve-Katsman"
            },
            "answer_text": "All depends on the network security systems and the firewalls they are using, however in this day and age I would assume that yes, they can. To be clear, we are talking internet activity/connections. Playing a game that doesn’t try to “call home” would not register on the monitoring system. ",
            "date": "Answered September 10, 2018",
            "views": "442",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cory Meisch",
                    "user_href": "/profile/Cory-Meisch"
                }
            ]
        }
    ]
}