{
    "title": "Can you recommend some good books that explore, in detail, the concept in of political power? - Quora",
    "tags": [
        "Political Philosophy",
        "Power (society)",
        "Political Science",
        "Reading",
        "Book Recommendations",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laura Karpuska Santos",
                "href": "/profile/Laura-Karpuska-Santos"
            },
            "answer_text": "I don’t know anything so general. In fact, in order to answer any question on “what power is” or “what determines the dynamics of power” we would need first to define power in a framework and then we would have to define the “rule of law”, or how power is given and what are its instruments. Those are separate questions. For example, if you are focusing on political power, it matters if you are interested on how power is acquired in a dictatorship or in a democracy to then talk about its dynamics. In general terms, I could mention three references. Daron Acemoglu has a book that touches on some of this subject in an economic framework. The book title is “Economic Origins of Dictatorship and Democracy”.There is a very interesting article from Robert Dahl from 1957 entitled “The concept of power”.Regarding minorities and majority, you may find Romer’s article “Why the poor do not expropriate the rich: an old argument in new garb” interesting: http://www.sciencedirect.com/science/article/pii/S0047272798000425But there are many intellectuals that discussed the idea of power. To name a few (and to not even mention to classic readings on politics): Foucault, Hanna Arendt, etc ",
            "date": "Answered February 14, 2017",
            "views": "317",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marcos Ross",
                    "user_href": "/profile/Marcos-Ross"
                },
                {
                    "user_id": "Brittany Rose",
                    "user_href": "/profile/Brittany-Rose-55"
                }
            ]
        },
        {
            "author_info": {
                "name": "Efe Lowery",
                "href": "/profile/Efe-Lowery"
            },
            "answer_text": " In his new introduction to this classic text on political economy, Galbraith reasserts the validity of the core thesis of American Capitalism: The best and established answer to economic power is the building of countervailing power. The trade union remains an equalizing force in the labor markets, and the chain store is the best answer to the market power of big food companies. This work remains an essential guidepost of American mores as well as that as of the American economy. American Capitalism: The Concept of Countervailing Power (Classics in Economics Series) ",
            "date": "Answered January 30, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Penny Cornett",
                "href": "/profile/Penny-Cornett"
            },
            "answer_text": "In the category of fiction, it would be hard to beat Allen Drury’s Advise and Consent series, starting in 1959. He won the Pulitzer for the first one, and then went on to publish the rest of the series over the next 20 years or so. Drury was a very observant UP reporter in Washington. ",
            "date": "Answered January 30, 2019",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karen Roberts",
                "href": "/profile/Karen-Roberts-236"
            },
            "answer_text": "I myself cannot answer from personal experience because I feel from my own point of view politics is a personal subject but to help you I would recommend to google your question then you can receive answers to your question best wishes Karen. ",
            "date": "Answered January 30, 2019",
            "views": "10",
            "upvotes": "0"
        }
    ]
}