{
    "title": "Can there be a good dictator? - Quora",
    "tags": [
        "Dictators"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cheng Tien Pao",
                "href": "/profile/Cheng-Tien-Pao"
            },
            "answer_text": "Q. Can there be a good dictator? -Actually, a majority of dictators started with intention of becoming a good dictator. But most of them failed to do so. A benevolent dictatorship refers to a government in which an authoritarian leader exercises absolute political power over the state but is perceived to do so with regard for benefit of the population as a whole, standing in contrast to the decidedly malevolent stereotype of a dictator. A benevolent dictator may allow for some economic liberalization or democratic decision-making to exist, such as through public referenda or elected representatives with limited power, and often makes preparations for a transition to genuine democracy during or after their term. It might be seen as a republican form of enlightened despotism.The label has been applied to leaders such as Mustafa Kemal Atatürk of Turkey, Josip Broz Tito of Yugoslavia, Lee Kuan Yew of Singapore, and France-Albert René of Seychelles.From https://en.wikipedia.org/wiki/Be... - For every authoritarian country that has managed to grow rapidly, there are several that have floundered. For every Lee Kuan Yew of Singapore, there are many like Mobutu Sese Seko of the Congo. Dani Rodrik- The government is the most important institution in a developing country. The policies pursued by the government will shape the quality of other institutions and the incentive structure in the economy. Political leaders run the government, therefore, it is necessary to understand their motivation and behavior in order to understand the country’s policies. The political leader’s motivation is not necessary selfish—as Alfred Marshall indicated— especially for those leaders who fight for their nation’s independence and prosperity.A political leader certainly worries about the security of his/her tenure in office and his/her own position in the nation’s history. Regardless of the political system, the best way to achieve security of tenure and to establish a leader’s historical status is to bring prosperity to the nation.I will argue in next section that many political leaders in developing countries in the 1950s and 1960s—especially the first-generation leaders who brought political and economic independence to their countries through long periods of revolution or struggle—were motivated by their desire for their nation’s modernization rather than by selfish vested interests.Excerpts from Development and Transition: Idea, Strategy, and Viability By Justin Yifu Lin - -As the above excerpts said, most of the leaders want to bring their nations to prosperity. But in authoritarian countries, there are many Congo-like nations for one Singapore-like nation. -If one can ask each and every leader of all authoritarian countries whether he would like his country to be like Singapore or Congo, almost all the leaders will reply ‘Singapore’, I believe. -So what are the differences between the leaders of Singapore-like nation and Congo-like nation? - -There are only two fundamental differences among those leaders; -The leaders of Singapore-like nation are both wise and good. -The leaders of Congo-like nation may be good but not wise, may be wise but not good, or may be both not-wise and not-good. -Most of the leaders of the nations are not bad guys. If they are bad guys, they will not be leaders, mostly. Have you ever met a leader who wants to make his nation to become a failed state intentionally since he becomes a leader? -Each and every leader wants to leave a good name after he leaves the office, but only few of them achieve the intention. -It is not easy for a person to become a wise and good person. It is more difficult to be a good and wise leader. The leader has to make effort all the time to be wise and not to be bad. If not, he can become unwise and bad anytime during his life. It is very easy to be unwise and bad. There’s no need to make any effort. -So for one leader to bring prosperity to the nation, he must try to be wise and good all the time. -If a leader is good but not wise, he will not know what is good and what is bad in most of the complex affairs. Therefore, there’s a chance to make bad decision most of the time although he doesn’t mean it. -If a leader is wise but not good, there is always a chance to make for his own good rather than nation’s good in each and every minute of his office time. If he cannot control himself, he can always find loophole in his nation’s law to make for his own good. -If a leader is not good and not wise, ........... then anyone can imagine what’s the result. - -There are only a few leaders who are not good and not wise. -There are some leaders who are wise but not good. -There are more leaders who are good but not wise enough. -There are only a small amount of leaders who are both wise and good because it is too difficult. -So it is the reason that ………. For every authoritarian country that has managed to grow rapidly, there are several that have floundered. For every Lee Kuan Yew of Singapore, there are many like Mobutu Sese Seko of the Congo. Dani Rodrik- So Wisdom is purified by morality, and morality is purified by wisdom: where one is, the other is, the moral man has wisdom and the wise man has morality, and the combination of morality and wisdom is called the highest thing in the world.From Digha Nikaya 4 Soṇadaṇḍanta Sutta ",
            "date": "Answered November 21, 2019",
            "views": "800",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sam Qwato",
                "href": "/profile/Sam-Qwato"
            },
            "answer_text": "Q. Can there be a good dictator? (1) Short answer: Yes (2) Plentiful of benevolent dictators in East Asian history. East Asian Confucian heritage countries have a tradition of a strong State (aka Civil Service, bureaucracy, state machinery) capacity, sometimes overwhelming Rule of law. (3) In Confucian psyche, there is primacy of societal wel-being (as opposed to rah rah enforced Individualism), you respect the leader, let the leader 'do his/her job'. Both leader and subjects have their roles, their obligations, their operating equilibrium, as in dad and his family. Per sociologist Max Weber, China had the first modern state (\"Weberian state\") in the world. Qin dynasty (221 BCE). East Asia has a long and strong state capacity heritage. (4) Check out Pre-WW2 Japan fromthe Meiji Restoration modernization drive (actual power wielded by Tokugawa shogunate, the last feudal Japanese military government 1603 to 1867 in the Emperor's name),through WW2 militaristic Japan.Military dictatorship era of Asian Tiger South Korea, and Miracle on the Han River.Military dictatorship era of Asian Tiger Taiwan, and Taiwan Miracle.Asian Tiger Singapore has 74% ethnic Chinese majority, thus a predominantly East Asian heritage society. There was no dictatorship. Lee Kuan Yew's robust leadership propelled Singapore From Third World to First, in 60 seconds flat.China from Deng through Xi today. Forklifted 600m Chinese out of poverty in blinktime. And the juggernaut is still throttling.Colonial Hong Kong, an Asian Tiger, a Global Financial Center, was a dictatorship of sorts, notwithstanding the benign Brit rule. There was no democracy. The Brit governor was a good dictator, of sorts!",
            "date": "Answered January 17, 2018",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cam Davis",
                    "user_href": "/profile/Cam-Davis-18"
                },
                {
                    "user_id": "Tay Kai Ze",
                    "user_href": "/profile/Tay-Kai-Ze"
                },
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                },
                {
                    "user_id": "Gabe Gronlund",
                    "user_href": "/profile/Gabe-Gronlund"
                },
                {
                    "user_id": "Gísli Magnússon",
                    "user_href": "/profile/Gísli-Magnússon-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Hendriks",
                "href": "/profile/Peter-Hendriks-7"
            },
            "answer_text": "For a while certainly, but after a while the man starts believing he is a genius and infallible. All the people around him will just agree, as they are afraid to fall from grace. Dictators usually get addicted to their power and serious opponents will either be killed or locked up. The verdict: treasons and undermining the stability of the state. Unchecked power tends to corrupt both the man at the top as his entire entourage. ",
            "date": "Answered January 13, 2018",
            "views": "363",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Wright",
                "href": "/profile/Robert-Wright-6"
            },
            "answer_text": "What does “good dictator” mean? Saddam Hussein (Iraq) and Muammar Gaddafi (Libya) both greatly raised the standard of living of their people. Iraq was the most educated nation in the Middle East until it ran afoul of U.S. foreign policy. Gaddafi was similarly praised for similar accomplishments and won awards for its strides forward. It ran afoul of U.S. foreign policy as well. They were both ruthless dictators. Politics was very risky business in these countries. ",
            "date": "Answered January 13, 2018",
            "views": "333",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yair Yerushalamski",
                "href": "/profile/Yair-Yerushalamski"
            },
            "answer_text": "do you mean a person who is good at being a dictator or a good person who happened to be a dictator? if the second one is what you mean, no, it’s almost non existent. the reason is if a dictator will be too good compared to his predecessor, he’ll be eaten alive by the citizens of his country. a dictator needs to be strict and a dictator needs to control his people, that’s the whole purpose of a dictator. ",
            "date": "Answered January 13, 2018",
            "views": "311",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephan van Ingen",
                    "user_href": "/profile/Stephan-van-Ingen"
                },
                {
                    "user_id": "Elia Hartono",
                    "user_href": "/profile/Elia-Hartono"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carolyn Webb",
                "href": "/profile/Carolyn-Webb-25"
            },
            "answer_text": "No. Once a head of state becomes a dictator democracy flies out the window. Even though some dictators are not as bad as others there is no such thing as a GOOD dictator just like there is no such thing as a GOOD HEART ATTACK. There is just BAD and WORSE ",
            "date": "Answered January 14, 2018",
            "views": "104",
            "upvotes": "0"
        }
    ]
}