{
    "title": "Can abortion cause death? - Quora",
    "tags": [
        "Causes of Death",
        "Abortion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kent Aldershof",
                "href": "/profile/Kent-Aldershof"
            },
            "answer_text": "Abortion always causes death. Except in the very rare cases when the abortion is botched. The purpose of an abortion is to kill. A vulnerable and defenseless infant. The first measure of success in an abortion is that the killing was successful. The baby is dead. A secondary measure of success is that the mother is not dead. The third priority is that the mother recovers from the process without excessive bleeding, infection, or permanent damage to her body. The measure of success in an abortion never involves long-term impact on the mother. Such as depression. Sadness. Guilt. Decline in temperament and attitude. Or suicide. Even though a common result of abortion is a second death, by suicide. Six times as common among mothers who have killed their babies, as among mothers who have delivered their babies. An alternate form of a second death from abortion is the child from the woman’s second pregnancy. And the third. And so on. A woman who has killed the child of her first pregnancy, is exceedingly likely to have one or more additional abortions, killing her successive children. Or were you just selfishly worrying about death to the mother, during any abortion procedure? Medical or surgical abortion is quite unlikely to kill a woman during the procedure, if it is done by a qualified physician in a proper clinical setting. Just as normal delivery is quite unlikely to kill a woman, during a normal delivery. 700 a year, on average, out of four million live births. Way less than a hundredth of one percent. But since not all abortions are performed by qualified physicians in a proper setting, the fact is that maternal deaths due to abortion are distressingly frequent. Women still try to perform abortions themselves, which probably has around a 50% fatality rate. And women still go to abortion midwives, and to non-licensed abortion doctors, where the fatality rate is also appalling. Of course, the major concern when a women recognizes she has become pregnant should not be about preserving the mother’s life. Nor about preserving her lifestyle, and her comforts and her pleasures and her self-indulgences. The main concern ought to be the maintaining the life and health of her baby. And that should make abortion abhorrent to all women. Unfortunately, far too many women do think first about themselves, their life and their lifestyle. Abortions are done, when a woman decides the life of a baby, her baby, is less important than maintaining her lifestyle. A grotesque tradeoff. The ultimate act of selfishness. Particularly when most commonly, the woman’s lifestyle is generally ruined anyway, even after a successful abortion, by enduring feelings of guilt, remorse, and shame. So yes, abortion does cause death. Death first of the infant, but very frequently thereafter, also death of the mother. She may die from a non-medically conducted procedure, or from suicide. Or — often — from self-destruction of her being, through recognizing that she intentionally murdered her own child. Her life is not worth anything after that. ",
            "date": "Updated June 30, 2018",
            "views": "33",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lorna Jane Ayupan",
                    "user_href": "/profile/Lorna-Jane-Ayupan"
                },
                {
                    "user_id": "Emma Greenland-Broadsmith",
                    "user_href": "/profile/Emma-Greenland-Broadsmith"
                },
                {
                    "user_id": "Chukwuemeka Onyimadu",
                    "user_href": "/profile/Chukwuemeka-Onyimadu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicky Shearer",
                "href": "/profile/Nicky-Shearer-1"
            },
            "answer_text": "Any medical procedure can cause death. But it is extremely rare. You are more likely to die from the pregnancy itself than the abortion to end it. Abortion is riskier if not performed by a medical professional, which is why access to it should be easy and free. There are some people who see any woman contemplating abortion as worthy of contempt and will use scare tactics to prevent her practicing her legal rights. Pickets outside clinics with huge blown up pictures of a tiny fetus to induce guilt, claims that it will be a regretful decision (it never is) and claims that it will increase the likelihood of suicide (not true). These people see the unborn as more important than the mother and they even go so far as to try to legislate against miscarriage, with women arrested for risky behaviours. Some states tell women abortion can increase their risk of suicidal thoughts. Researchers say that’s not true. The bottom line is, an attack on abortion is an attack on women's choice. No one should be forced to go through with a pregnancy. It's immoral and there is a special place in hell for people who advocate it. ",
            "date": "Answered June 29, 2018",
            "views": "818",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amy Llewelyn",
                    "user_href": "/profile/Amy-Llewelyn"
                },
                {
                    "user_id": "C. J. Smith",
                    "user_href": "/profile/C-J-Smith-17"
                },
                {
                    "user_id": "Zee LaRue",
                    "user_href": "/profile/Zee-LaRue"
                },
                {
                    "user_id": "Pippi M. R. Groving",
                    "user_href": "/profile/Pippi-M-R-Groving"
                },
                {
                    "user_id": "Noria Uroshima",
                    "user_href": "/profile/Noria-Uroshima"
                },
                {
                    "user_id": "Janie Keddie",
                    "user_href": "/profile/Janie-Keddie"
                },
                {
                    "user_id": "Dawn Elmore",
                    "user_href": "/profile/Dawn-Elmore-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Orion Cohen",
                "href": "/profile/Orion-Cohen-2"
            },
            "answer_text": "For the woman? Extremely infrequently. Abortions are a very low risk procedure, certainly safer than carrying the pregnancy to term. For the bun in the oven? Yes, that’s the whole point of the procedure, to terminate the life of the fetus (or zygote or embryo, depending on the stage of pregnancy). There is this rather absurd pro-life strawman which is to act as if pro-choicers don’t think the fetus is alive. I should mention not all pro-lifers do this, though it is common. I saw one article written by someone who interviewed a number of scientists about whether or not life began at conception, the title was some clickbait saying “you won’t like what they had to say” as the scientists almost all agreed, life begins at conception. I’m willing to bet if those scientists had been asked if a tree is alive, they all would have said yes as well. Yes, abortion results in death. So does wiping down your counters; cleaning products are responsible for so many bacteria being killed. I’m also guilty of taking life, just earlier today I killed several ticks for accosting my dog. The question isn’t “does life begin at conception?”, it’s “is life worth protecting from the moment of conception?”. I would say no. I see no reason to protect an unfeeling unconscious organism simply because it’s DNA is categorized the same as mine. ",
            "date": "Answered October 27, 2019",
            "views": "300",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark O'Dell",
                    "user_href": "/profile/Mark-ODell"
                },
                {
                    "user_id": "Kristin Long",
                    "user_href": "/profile/Kristin-Long-21"
                },
                {
                    "user_id": "Emily Marie",
                    "user_href": "/profile/Emily-Marie-549"
                },
                {
                    "user_id": "Ying Wu",
                    "user_href": "/profile/Ying-Wu-51"
                },
                {
                    "user_id": "Frank Kap",
                    "user_href": "/profile/Frank-Kap"
                },
                {
                    "user_id": "Eileen M. Gormley",
                    "user_href": "/profile/Eileen-M-Gormley"
                },
                {
                    "user_id": "Erin Wood",
                    "user_href": "/profile/Erin-Wood-57"
                },
                {
                    "user_id": "Jane Mcconnell",
                    "user_href": "/profile/Jane-Mcconnell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Davis",
                "href": "/profile/Joshua-Davis-49"
            },
            "answer_text": "Well, yes, in the broadest of terms that Life results in Death. But hold onto your holy scripture and your Sinner Beater/Baseball Bat of Smiting +2.. Depending on the level of growth of the group of cells within the uterus, such an incident might rank below a significant scrape of your knee when you trip on the sidewalk. At the other end of the spectrum is the termination of growth of a group of cells and tissues- perhaps even organs, of a type- of which would likely not survive outside the womb environment.. and by likely I mean I’d rather place bets on the local football team, who presently look worse than the Cleveland Browns (a team with decades of losing seasons!) Some things are not meant to survive; at a micro level, mutations are a way in which a species weeds out what attributes enable the group to adapt, survive, and eventually prosper. Generally speaking, lacking a central nervous system, or major components thereof, doesn’t top that list- at least for vertebrates. And since we’re mammalian- I presume we’re speaking of mammals; I didn’t stumble onto an amphibian/reptilian discussion did I?- we usually grow our young inside the host body, meaning that it’s not one potential member of the species who is affected, but two; and what occurs within the host body absolutely impacts their health, up to and including severe distress and death. If anything, proper abortive methods or D&E further advance the health of the host in present era than anything else, further enabling the potential to advance the species- that’s the whole point, right? Keep poppin’ out babies, populate the human race, diversify our potential to survive a changing world with new ideas and perspectives on how to improve life? It’s not?? Color me surprised. ",
            "date": "Answered October 28, 2019",
            "views": "143",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Erin Wood",
                    "user_href": "/profile/Erin-Wood-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard King",
                "href": "/profile/Richard-King-221"
            },
            "answer_text": "That depends upon the method used. Saline abortion effectively scalds the fetus and upsets the osmotic balance and maybe the heart rate too. Dilation and curettage (D&C) basically means tearing the fetus limb from limb as well as removing its blood/oxygen supply. Lethal injection kills a vital organ, such as the heart, which causes death of the rest of the fetus. Use of prostaglandins changes the “acceptability” of the placenta by the mother, which leads to separation, contractions, and expulsion. The above all relate to the innocent inhabitant of the uterus. As to the mother, she may suffer fatal bleeding, organ puncture, and/or infection that can be fatal. ",
            "date": "Answered October 17, 2018",
            "views": "358",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Bergström",
                "href": "/profile/Brian-Bergström"
            },
            "answer_text": "Yes. Almost every time abortion causes the gruesome death of an innocent human life by dismemberment and evisceration. Maternal death statistics are skewed because of the leftist agenda, still over 60,000 mothers die directly from abortion annually. Many more die later from complications, because shame prevents them from seeking appropriate medical attention. And post-abortive mothers are 5x more likely than their peers to commit suicide. ",
            "date": "Updated January 17, 2020",
            "views": "437",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lorna Jane Ayupan",
                    "user_href": "/profile/Lorna-Jane-Ayupan"
                },
                {
                    "user_id": "Daniel Rocha",
                    "user_href": "/profile/Daniel-Rocha-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Byrd",
                "href": "/profile/Marc-Byrd-4"
            },
            "answer_text": "No. It results in the lack of creation of a person. Nobody dies when an abortion is performed. It simply stops the development of the fetus/embryo and removes it from the host body. A fetus or embryo has no personality, no knowledge, no experience, and no identity. It is a parasite with the potential to become a human being. Now,an abortion is an uncomfortable and invasive procedure (although not as much as raising an unwanted child). Yes, accidental deaths have occured, but only as much as in any other medical procedure. No, abortion does not result in death. ",
            "date": "Answered October 27, 2019",
            "views": "162",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gregory Miner Gustafson",
                    "user_href": "/profile/Gregory-Miner-Gustafson"
                },
                {
                    "user_id": "Kristin Long",
                    "user_href": "/profile/Kristin-Long-21"
                },
                {
                    "user_id": "Raeganne Fulwood",
                    "user_href": "/profile/Raeganne-Fulwood-1"
                },
                {
                    "user_id": "Jean Keegan",
                    "user_href": "/profile/Jean-Keegan"
                },
                {
                    "user_id": "Albert York",
                    "user_href": "/profile/Albert-York-2"
                },
                {
                    "user_id": "Anruth Dailaigh",
                    "user_href": "/profile/Vampirate-Kitsune"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Flanagan",
                "href": "/profile/Jeff-Flanagan-4"
            },
            "answer_text": "It’s a set of procedures that are safer than pregnancy. The danger comes in in authoritarian states where women don’t have rights, and end up dying in botched amateur abortions. Some alt-Christians, who got the entirely wrong message from corrupt preachers, think that’s a just punishment, but that’s to be expected when so many people mistake women’s rights to self-determination for killing babies. This was done on purpose by propagandists to get Conservatives to vote for Republican scoundrels who only care about themselves. ",
            "date": "Answered October 17, 2018",
            "views": "253",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stanley Marsh",
                "href": "/profile/Stanley-Marsh-11"
            },
            "answer_text": "It depends on who you’re talking about. Death will always occur in abortion, as an abortion is termination of a harmful or unwanted pregnancy. Abortions are safe to the mother, but complications can occur. Most abortions are actually safer than child birth! Although, do not try at home abortions. You should always visit a doctor to discuss your options. ",
            "date": "Answered June 28, 2018",
            "views": "411",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zee LaRue",
                    "user_href": "/profile/Zee-LaRue"
                },
                {
                    "user_id": "Noria Uroshima",
                    "user_href": "/profile/Noria-Uroshima"
                },
                {
                    "user_id": "Ethan A. Hayes",
                    "user_href": "/profile/Ethan-A-Hayes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kamaat Ashayt Ahhotep Satdjehuti",
                "href": "/profile/Kamaat-Ashayt-Ahhotep-Satdjehuti"
            },
            "answer_text": "Medical science all over the world have found that no, you are more likely to die at the dentist than having an abortion. That said, if it is illegally done by people who don’t know what they are doing or don’t have antibiotics then yes. Anti choicers are not pro life. And aborting is NOT murder. ",
            "date": "Answered September 1, 2018",
            "views": "224",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rich Clark",
                    "user_href": "/profile/Rich-Clark-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lo Lol",
                "href": "/profile/Lo-Lol-11"
            },
            "answer_text": "everything results in death. life results in death, so does eating, time is what results in death. Abortion, if done properly, results in the death of the fetus, but not of the human Abortion is a very delicate thing, if the procedure is done improperly there will be consequences. ",
            "date": "Answered October 27, 2019",
            "views": "70",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Erin Wood",
                    "user_href": "/profile/Erin-Wood-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gloria Cole",
                "href": "/profile/Gloria-Cole-1"
            },
            "answer_text": "Abortion is the medical termination of a nonviable pregnancy. Many back-alley abortions in the 1950s resulted in the death of women. Modern professional abortions are safe, efficient, and effective. ",
            "date": "Answered October 27, 2019",
            "views": "63",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erin Wood",
                    "user_href": "/profile/Erin-Wood-57"
                },
                {
                    "user_id": "Jean Keegan",
                    "user_href": "/profile/Jean-Keegan"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Bäckman",
                "href": "/profile/David-Bäckman"
            },
            "answer_text": "It’s Death for the aborted fetus, that’s for sure. Abortions performed by trained medical personnel under controlled conditions are quite safe. But not entirely without risk. The uterus has a very good blood supply an can cause massive bleeding if its damaged. ",
            "date": "Answered October 17, 2018",
            "views": "170",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dan O'Brien",
                    "user_href": "/profile/Dan-OBrien-111"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamie Vanecek",
                "href": "/profile/Jamie-Vanecek-1"
            },
            "answer_text": "To the fetus? Yes to the mother there is some damage internally especially if fetus is sucked out,certain parts of the human body have a timeframe to function correctly and if stopped/prevented from functioning there is a reaction sort of a withdrawal process that makes reproduction more difficult in the future ",
            "date": "Answered October 27, 2019",
            "views": "75",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Lance",
                "href": "/profile/Frank-Lance-1"
            },
            "answer_text": "Yes, as does using hand sanitizer. Something dying is irrelevant. What matters is what dies and why the thing that died has relevant moral value. The unborn don’t have it. ",
            "date": "Answered October 27, 2019",
            "views": "55",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erin Wood",
                    "user_href": "/profile/Erin-Wood-57"
                },
                {
                    "user_id": "Joshua Davis",
                    "user_href": "/profile/Joshua-Davis-49"
                },
                {
                    "user_id": "Jane Mcconnell",
                    "user_href": "/profile/Jane-Mcconnell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evan Cummings",
                "href": "/profile/Evan-Cummings-8"
            },
            "answer_text": "It could, if legal abortion were reversed and women were forced to use back alley abortionists, the conditions may not be sterile or safe. ",
            "date": "Answered March 5, 2018",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pippi M. R. Groving",
                    "user_href": "/profile/Pippi-M-R-Groving"
                }
            ]
        },
        {
            "author_info": {
                "name": "Puja Shalini Mudadla",
                "href": "/profile/Puja-Shalini-Mudadla"
            },
            "answer_text": "The question should be more specific. There are 2 types : medical & surgical. As long as the medical standards are good . Both are safe. It depends on the days of your pregnancy. The early the best. Always doctors consent is necessary. Never try out by yourself.  ",
            "date": "Answered March 5, 2018",
            "views": "401",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "C. J. Smith",
                    "user_href": "/profile/C-J-Smith-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravindra Mutha",
                "href": "/profile/Ravindra-Mutha"
            },
            "answer_text": "THE DEATH RATE FROM ABORTION IS 20 PER 100000 ABORTIONS . BLEEDING , INFECTIONS ARE THE MAJOR CONTRIBUTING CAUSES. IT DEPENDS UPON WEEKS OF GESTATION AND VARIOUS FACTORS. ",
            "date": "Answered July 24, 2018",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Zalkin",
                "href": "/profile/David-Zalkin"
            },
            "answer_text": "Abortion always causes death. ",
            "date": "Answered March 5, 2018",
            "views": "169",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bryan Katz",
                    "user_href": "/profile/Bryan-Katz-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leticia Rivera",
                "href": "/profile/Leticia-Rivera-4"
            },
            "answer_text": "For 1/3 of the women while the abortion still being illegal. Nonetheless women keep aborting. ",
            "date": "Answered October 27, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dawn Heistand",
                "href": "/profile/Dawn-Heistand-1"
            },
            "answer_text": "Abortion is death ! Abortion is killing an innocent unborn baby ! Thanks ",
            "date": "Answered March 5, 2018",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shawna Nichols",
                "href": "/profile/Shawna-Nichols-3"
            },
            "answer_text": "Abortion absolutely causes death!! ",
            "date": "Answered March 5, 2018",
            "views": "29",
            "upvotes": "0"
        }
    ]
}