{
    "title": "Can a coma cause memory loss? - Quora",
    "tags": [
        "Loss of Memory",
        "Amnesia",
        "Comas",
        "Consciousness",
        "Memory (information storage)",
        "Human Memory",
        "Human Brain",
        "Neuroscience",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alan Hall",
                "href": "/profile/Alan-Hall-13"
            },
            "answer_text": "The coma itself does not appear to cause memory loss. In my brother’s case, after recovering from his coma, his recollections of his past were more vivid and clear than they were before. However, the brain injury that causes a coma often does cause some memory loss as well as loss of brain function, depending on the location and nature of the injury. For one thing, the memories just prior to the injury that caused the coma are often forgotten. This is because each person moves short-term memories into long-term memory storage at night while sleeping. An analogy is writing a document on a computer (in memory) and then pulling the plug, suddenly shutting off the computer before saving the document to the hard disk. It is gone forever. However, in real life, sometimes such memories can be recalled later. In those cases, the memory may have merely been suppressed, due to their traumatic nature. Also, people that have suffered a brain injury and recovered sometimes have an inability to permanently store long-term memories. They understand and remember everything for a short time, but eventually, those memories fade away. This situation was depicted in the movie “Fifty First Dates.” ",
            "date": "Answered June 13, 2019",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yasir Hasan",
                    "user_href": "/profile/Yasir-Hasan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Rasanen",
                "href": "/profile/Matthew-Rasanen"
            },
            "answer_text": "Comas often cause memory loss, as part of what is called executive function. This involves the capacity to strategize, memory, and focus. I was in a coma for a month in 2008 from meningitis and encephalitis together. I still have a few issues, but all three parts of my executive junction are still with me. I have improved my memory the most of the three. I lost all memory for the 6 to 9 months before my coma. I still have a bit less reading retention than I had before, but not too bad. I have to work harder to plan and strategize, and my focus is more easily distracted than it was before. Comas are different for pretty much everybody. Bacterial encephalitis is the worst. Helen Keller had encephalitis at age 3 and became deaf and blind. It is possible to wake up with one or more limbs amputated. Some people become retarded. Encephalitis comas can affect most any part of the brain, with the resulting deficits. ",
            "date": "Answered March 11, 2020",
            "views": "597",
            "upvotes": "0"
        }
    ]
}