{
    "title": "Can algo trading beat an average trader? - Quora",
    "tags": [
        "Financial Traders",
        "Algorithmic Trading",
        "Trading (finance)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pratik Jain",
                "href": "/profile/Pratik-Jain-217"
            },
            "answer_text": "As you start to trade in financial markets, you develop your rules and strategies to speculate profitable stock movements. These rules are based on a variety of fundamental and technical factors. You try out numerous strategies and finally discover the one that works for you. This process requires several iterations but it’s definitely possible to find a profitable strategy. In the last 5 years, I have devised several dozen strategies which work on almost all market conditions. In order to further validate the strategy, you backtest it on historical data using software like Amibroker. And once you are convinced with the backtest results, you start trading on the live market based on that strategy. There is a fundamental flaw with this approach considering you do all these manually. Let me list down the possible challenges you may encounter: Scenario 1: Your system signals several buy/sell signals in a day but you are unable to take all the trades. Of course, you are a human being and you cannot be glued to your computer screen all the time. Scenario 2: You take a trade based on your system, but there is a slight lag between when the signal appears and when you punched the order. This time lag may cause a change in stock price and eat up your profits. Scenario 3: Last but not least, your mind doesn’t allow you to take the trade although it’s signaled by your system. Few months back, one of my trading systems gave me buy signal on a blue-chip stock, however, the index fell by more than 3% on that particular day and I ignored the buy signal thinking that the overall market sentiment is negative. What happened next? The particular stock I ignored zoomed by 17% in the next 3 hours! Lets’ park No 1 and No 2 for now as they are pretty much self-explanatory. But what exactly happened in the 3rd scenario? Well, your emotions played with you! The human mind is discretionary, it always tends to accommodate the risk factor before taking any decisions. And when money is involved, the emotions multiply. If you think through it, you will recall several examples where you missed something valuable because emotions interfered with your decision making. How do you avoid emotions during trading? The only way is to automate your trading strategy with the help of Algorithmic Trading. I would again recommend using Amibroker through which you can code, backtest and automate your trading strategies. The buy/sell signals would be sent immediately to your broker’s terminal and order would be placed instantly. No human intervention involved at all! This would also overcome the challenges mentioned in scenario 1 and 2 mentioned above. That’s the beauty of Algorithmic trading. And I hope I have explained multiple reasons why it can beat human traders any day. ",
            "date": "Answered November 29, 2019",
            "views": "548",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Mishra",
                    "user_href": "/profile/Rahul-Mishra-259"
                },
                {
                    "user_id": "Shekhar Kumar",
                    "user_href": "/profile/Shekhar-Kumar-113"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajay Parmar",
                "href": "/profile/Ajay-Parmar-48"
            },
            "answer_text": "Surely,main thing is not only stretagy,u need some good luck,if the country is in battle mood,or bad -unstable political environment,it's bad time for those all.un lucky investers…. Mainly focus on watchlist …if u continuously rotate (daily,weekly, monthly)trending scripts in ur watchlist ,u earn tremendous even by simple trending stretagy… ",
            "date": "Answered June 24, 2017",
            "views": "341",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakesh Velayudhan",
                    "user_href": "/profile/Rakesh-Velayudhan-4"
                }
            ]
        }
    ]
}