{
    "title": "Can a state lose its statehood for breaking the original statehood treaty? - Quora",
    "tags": [
        "Statehood",
        "Delhi Statehood"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Murphy",
                "href": "/profile/Chris-Murphy-104"
            },
            "answer_text": "No. Once a state becomes state, it will ALWAYS be a state. The United States Supreme Court took up this issue in 1869 in the case of Texas v. White. The court, like Lincoln, viewed the Confederacy to be a treasonous insurrection by individuals within the state rather than any sort of legal break of statehood. Chief Justice Salmon Chase wrote, “The union between Texas and the other states was as complete, as perpetual, and as indissoluble as the union between the original states. There was no place for reconsideration or revocation, except through revolution or through consent of the States.” In other words, Chief Justice Chase was stating that the only potential way for a state to leave the United States was through a revolution (such as the one in which the original 13 colonies fought for independence from Great Britain) or by the States permitting it. In fact, the court ruled that the states of the Confederacy were still “states of the Union” — although led by insurgents — throughout the Civil War. So, anytime you hear individuals in California, Texas or other states raising money to declare independence from the United States, just consider it to be a waste of money. Otherwise, it can only be done by a bloody revolution (in which the United States wouldn’t lose) or by the other 49 states agreeing to it. ",
            "date": "Answered March 11, 2018",
            "views": "450",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas Shaw",
                    "user_href": "/profile/Thomas-Shaw-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Rudolph II",
                "href": "/profile/Don-Rudolph-II"
            },
            "answer_text": "Assuming you’re referring to states in the USA, there’s no such thing as “the original statehood treaty.” The original 13 states that became independent after the American Revolution formed the United States of America first under the Articles of Confederation, which were ratified in 1781, and then the Constitution of the United States of America, which went into effect in 1789. New states began to be admitted through the procedures originally spelled out under the Land Ordinance of 1785 and Northwest Ordinance of 1787 (passed under the Articles of Confederation and remained in effect after the Constitution was ratified) and the procedures set forth in Article IV of the Constitution, shortly after the Constitution was ratified. No state has ever lost its statehood, although the states that rebelled during the Civil War had to “earn” their way back into the Union by rectifying the problems that led them to rebel in the first place, and no state has ever attempted to leave the Union other than at the outset of the Civil War. There is no procedure listed in the Constitution by which a state can be expelled from the Union, and the Supreme Court ruled after the Civil War that no state can secede unilaterally. Whether or not one could leave with the consent of Congress is not known, since it’s never been tried, other than the one time they all got their rear ends handed to them for trying it. ",
            "date": "Answered March 11, 2018",
            "views": "159",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Burke",
                "href": "/profile/Kevin-Burke-93"
            },
            "answer_text": "No. The treaties are replaced by the constitution of the U.S. - once a state is in, it is in forever. If a state violates federal law it can be fined or sanctioned by the Federal government, but it can never be expelled. ",
            "date": "Answered March 10, 2018",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harihar Tiwari",
                "href": "/profile/Harihar-Tiwari-3"
            },
            "answer_text": "Lucknow UP tehsil biswan block reusaJila Sitapur Mera naam Harihar Tiwari Meri Arthik sahayata ki jaach Kare Gayi Jilla star Si Arthik sahayata ki santushti ki gai parantu 6 mahine Ho Gaye Sachivalaya anubhag 5 May koi sunvai nahin kar rahe hum bahut pareshan hai kripya Karke Hamein Arthik sahayata anudan delay jai bhumihin hai ham ",
            "date": "Answered June 9, 2019",
            "views": "46",
            "upvotes": "0"
        }
    ]
}