{
    "title": "Can you get strep while on antibiotics? - Quora",
    "tags": [
        "Strep Throat",
        "Antibiotics",
        "Pharmaceuticals"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Marwa",
                "href": "/profile/John-Marwa-1"
            },
            "answer_text": "I would guess yes, but it depends. Antibiotic and antibacterial are broad classification of anti microbial therapies. It comes down to matching the right bug to the right drug. It is also possible to be on a right drug and still get another infection from a different bug, bacteria is also a broad classification of pathogens. If you were specific with your question, I would have narrowed down my answer. JM. ",
            "date": "Answered July 6, 2018",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carol Whelan",
                "href": "/profile/Carol-Whelan"
            },
            "answer_text": "Sure you can. You can get any bacterial infection that is not susceptible to what ever antibiotic you are taking. IF you are on zithromax, I believe about 70% of strep bacteria is now resistant, That is just one example, as antibiotic resistance is rampant. Nothing on Quora should be mistaken for medical advice, see your doctor ",
            "date": "Answered March 25, 2017",
            "views": "44",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dee Moynihan",
                    "user_href": "/profile/Dee-Moynihan"
                },
                {
                    "user_id": "Brianna Malaguti",
                    "user_href": "/profile/Brianna-Malaguti"
                },
                {
                    "user_id": "Katie Simpson",
                    "user_href": "/profile/Katie-Simpson-27"
                },
                {
                    "user_id": "Janet Caruana",
                    "user_href": "/profile/Janet-Caruana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexandra Plot",
                "href": "/profile/Alexandra-Plot"
            },
            "answer_text": "Yes, if it isn't a broad spectrum antibiotic, which kills many different forms of bacteria. Some antibiotics are more specific to a particular type of bacteria, so they won't necessarily protect you from the Streptococcus bacteria. Generally, broad spectrum antibiotics are More damaging to people's long term immune system, by causing more strains of resistant bacteria. They also kill more of the healthy bacteria in your intestines that are necessary for your health and immune system to function properly. ",
            "date": "Answered February 18, 2020",
            "views": "387",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pam Armstrong",
                "href": "/profile/Pam-Armstrong-3"
            },
            "answer_text": "Unfortunately Yes. I'm scared shitless about it also. I recently read that a reported case of an infection that did not respond to any antibiotic known. The cocktails they use for treating MRSAs did not work and it was only a matter of time. ",
            "date": "Answered March 25, 2017",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Katie Simpson",
                    "user_href": "/profile/Katie-Simpson-27"
                }
            ]
        }
    ]
}