{
    "title": "Did the 'French Resistance' in WWII make a real difference? - Quora",
    "tags": [
        "French Resistance (WWII)",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Henry Foley",
                "href": "/profile/Henry-Foley"
            },
            "answer_text": "Before and after D Day intelligence for the allies was vital. Troop movements, troop positions, Also blowing bridges and general delaying troop movement to reinforce the beaches in Normandy. In the days leading up to D-Day, German forces in Normandy outnumbered the Allied troops massing for the invasion, so it was also critical for the French Resistance to prevent German reinforcements from reaching the beaches. Most notably, Germany’s powerful SS 2nd Panzer Division was based in Toulouse, a city in the Languedoc province of southwest France. Disruption of the rail line prevented this important division from reaching Normandy for eleven days, giving the Allies time to establish the beachhead that would enable them to advance further into the countryside after the invasion. French Resistance members remained active participants, giving American and British military commanders vital information about German defensive positions. Even French citizens who weren’t involved in the Resistance movement gave directions to the Allies and kept them informed about where the German troops were posted. Nazi retaliation against the Resistance was swift and brutal. On June 9, 1944, there were hundreds of hangings and murders at the hands of the Germans. The next day, 642 men, women, and children in the village of Oradour-sur-Glane were slaughtered, and the village was burned. Still, the Resistance fought on. In June and July, a group of maquis fought valiantly against a battalion of 10,000 German soldiers and was defeated, and when the Allies marched toward Paris and the south of France, the Resistance was by their side. Even with the high price paid by so many Resistance members, its numbers continued to strengthen. From within its ranks grew an organized fighting force known as the French Forces of the Interior (FFI) that, by October 1944, grew to 400,000. It was the base from which France rebuilt its army to 1.2 million soldiers by VE Day (May 8, 1945). And all because of people whose acts of bravery weren’t inspired by dreams of glory. Rather, they were ordinary people living at an extraordinary time, who circumstances called upon to help reclaim their country. So yes the french resistance was vital to the success of D Day and the eventual liberation of western Europe. Also i might add there are many cases of resistance fighter taking on the Germans in pitched battles even though they were hopelessly outnumbered. ",
            "date": "Answered February 20, 2017",
            "views": "19",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dick Graes",
                    "user_href": "/profile/Dick-Graes"
                },
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "Robert Gardener",
                    "user_href": "/profile/Robert-Gardener-3"
                },
                {
                    "user_id": "Marveen Deygas",
                    "user_href": "/profile/Marveen-Deygas"
                },
                {
                    "user_id": "Çağrı Murat",
                    "user_href": "/profile/Çağrı-Murat"
                },
                {
                    "user_id": "Mark Adams",
                    "user_href": "/profile/Mark-Adams-426"
                },
                {
                    "user_id": "Kevin Harper",
                    "user_href": "/profile/Kevin-Harper-10"
                },
                {
                    "user_id": "Aline Choupin",
                    "user_href": "/profile/Aline-Choupin"
                },
                {
                    "user_id": "Sylvie Lacour",
                    "user_href": "/profile/Sylvie-Lacour"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gaultier-Dlbr"
                },
                {
                    "user_id": "Joseph Shorter",
                    "user_href": "/profile/Joseph-Shorter"
                },
                {
                    "user_id": "Gilles Peret",
                    "user_href": "/profile/Gilles-Peret"
                },
                {
                    "user_id": "Mohan Babu",
                    "user_href": "/profile/Mohan-Babu-65"
                },
                {
                    "user_id": "Jimmy Fitzgerald",
                    "user_href": "/profile/Jimmy-Fitzgerald-2"
                },
                {
                    "user_id": "Dave Cosby",
                    "user_href": "/profile/Dave-Cosby"
                },
                {
                    "user_id": "Eamon O'Kelly",
                    "user_href": "/profile/Eamon-OKelly"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Andrew Leiter Doolittle",
                "href": "/profile/George-Andrew-Leiter-Doolittle"
            },
            "answer_text": "Two fresh French Army Divisions suddenly appeared on the border of Southern Germany as soon as the Americans arrived…so indeed yes as “that was no mere resistance.” ",
            "date": "Answered February 20, 2017",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stuart Campbell",
                "href": "/profile/Stuart-Campbell-46"
            },
            "answer_text": "Rather troubling that a large number of the Free French that joined the call to arms from De Gaulle were Ivorians and other West Africans who were later written out of the picture. Not unlike the wholly white view of the World Wars shown in the British film industry ",
            "date": "Answered February 20, 2017",
            "views": "273",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike McAvoy",
                    "user_href": "/profile/Mike-McAvoy-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Adams",
                "href": "/profile/Mark-Adams-426"
            },
            "answer_text": "The French resistance defeated the Nazi`s before D-Day by blowing up their supply lines. https://socialistworker.co.uk/art/34250/Paris+was+liberated+by+revolt+in+August+1944 ",
            "date": "Answered June 5, 2018",
            "views": "260",
            "upvotes": "0"
        }
    ]
}