{
    "title": "Did the authors of the New Testament read the Old Testament? - Quora",
    "tags": [
        "Hebrew Bible",
        "The Four Gospels",
        "The New Testament",
        "The Old Testament",
        "The Bible"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deepak George",
                "href": "/profile/Deepak-George-3"
            },
            "answer_text": "Interesting question(s)... Did the authors of the New Testament read the Old Testament?Was this even possible? Well,lets look at the second part of the question first..Was this possible?? Yes, it definitely was possible.The Old Testament existed during the time of Jesus and his apostles,not in the form of the 39 books we have today (51 in the Orthodox Bible), but it existed.Radiocarbon dating of the Dead Sea Scrolls prove that the Hebrew Bible canon along deutrocanonical manuscripts existed before Christ.So the old testament existed!Moses commanded the Israelites to keep the scripture, to memorize them and pass it on through generations.Joshua 1:8 \"This book of law shall not depart out of thy mouth; but thou shalt meditate therein day and night....\"So we can safely assume the Jews definitely read at least the Torah during the time of Jesus. It was part of the temple worship.Reading the Torah | Jewish Virtual Library Did the authors of the New Testament read the Old Testament? Possibly.The authors of the New Testament are :Matthew, Mark, Luke, John, Paul, Peter, James, John, and Jude.Matthew,Mark,John,Peter,James were disciples of Christ.Jude was a brother to James. They were traditional Jews, for a fact. They read the scriptures.Luke was probably a gentile. Do we know for a fact that he read the Old Testament?, the Scripture of the Hebrews?Not really. There are instances of reference to the scriputure in the book of Acts, but they dont conclusively point to Luke having read the scriptures himself.it is possible that Luke did not read the Old Testament. Does this,then change the authenticity or the authority of the gospel according to St Luke or the Acts of the apostles??No. The New Testament is the fullfilment of the scriptures. It completes the scripture and makes it whole. The writings of Luke are not contrary to the scripture They serve their purpose by  proclaiming the ministry of Chirst and his disciples. That's all that  matters. Its possible that not ALL the authors of the New Testament have read the scriptures. But they remain constant in theme and it resonates with the scripture. The beauty of the salvation is understood only when both covenants are read together. ..And that is how it is supposed to be. ",
            "date": "Answered October 29, 2015",
            "views": "693",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hillel Gray",
                "href": "/profile/Hillel-Gray"
            },
            "answer_text": "Yes but.  It was not the \"Old Testament\"  to them.It's quite possible that some authors did not have the same canon of books as the Hebrew Bible canon(s) that emerged. Some HB books are not quoted and apparently not alluded to by NT authors. Moreover, (afaik) they did not have a book (codex) of the entire Hebrew Bible. We do not know how many texts of the various books were circulating and accessible. There were many authors or communities of authors for NT books, not to mention editors and redactors. NT books have their own composition history and were not simply written by the attributed authors. These many authors had varied access to Hebrew Bible books and their translations.For instance, if Paul was a historical figure responsible for some NT works (but not all) attributed to him, he presumably learned Hebrew Bible texts in pharisaic (rabbinic) circles in Judea, in Hebrew. But other authors were located far from Jerusalem with (presumably) less of a reading & interpretation practice with Hebrew bible literature.With these caveats in mind, yes: NT books contain hundreds of explicit and implicit references to the Hebrew scriptures. Jesus and Paul, for instance, are often performing midrash (aka exegesis) from Hebrew Bible verses. Therefore, NT authors were not only \"reading\" they were reinterpreting the Jewish Bible, sometimes consistent with the rabbinic tradition, and often with profound (\"Christian\") innovations. In short, some of the many NT authors read some Hebrew Bible books, but I'd suppose that few, if any, could even have looked at all books in what Christians now call the Old Testament. ",
            "date": "Answered March 7, 2012",
            "views": "33",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alex Nakashian",
                    "user_href": "/profile/Alex-Nakashian"
                },
                {
                    "user_id": "Dennis Fischman",
                    "user_href": "/profile/Dennis-Fischman"
                },
                {
                    "user_id": "Garrett Knisley",
                    "user_href": "/profile/Garrett-Knisley"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Lexy Mendez",
                    "user_href": "/profile/Lexy-Mendez"
                },
                {
                    "user_id": "Bob Simcoke",
                    "user_href": "/profile/Bob-Simcoke"
                },
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Tuan Huynh",
                    "user_href": "/profile/Tuan-Huynh-4"
                },
                {
                    "user_id": "Derek Magill",
                    "user_href": "/profile/Derek-Magill"
                },
                {
                    "user_id": "Joan Hoffman",
                    "user_href": "/profile/Joan-Hoffman-1"
                },
                {
                    "user_id": "James Mohr",
                    "user_href": "/profile/James-Mohr"
                },
                {
                    "user_id": "Simeon Eberhardt",
                    "user_href": "/profile/Simeon-Eberhardt"
                },
                {
                    "user_id": "Pamela Dennett Grennes",
                    "user_href": "/profile/Pamela-Dennett-Grennes"
                },
                {
                    "user_id": "Shankar Iyer",
                    "user_href": "/profile/Shankar-Iyer-5"
                },
                {
                    "user_id": "Nicholas Vahalik",
                    "user_href": "/profile/Nicholas-Vahalik"
                },
                {
                    "user_id": "Adeel Shafique",
                    "user_href": "/profile/Adeel-Shafique"
                },
                {
                    "user_id": "Britt Smith",
                    "user_href": "/profile/Britt-Smith"
                },
                {
                    "user_id": "Suzanne Grubb",
                    "user_href": "/profile/Suzanne-Grubb"
                },
                {
                    "user_id": "Christopher Awad",
                    "user_href": "/profile/Christopher-Awad"
                },
                {
                    "user_id": "James H. Kelly",
                    "user_href": "/profile/James-H-Kelly"
                },
                {
                    "user_id": "David Jones",
                    "user_href": "/profile/David-Jones-40"
                },
                {
                    "user_id": "Clinton Combs",
                    "user_href": "/profile/Clinton-Combs"
                },
                {
                    "user_id": "Noble P. Abraham",
                    "user_href": "/profile/Noble-P-Abraham"
                },
                {
                    "user_id": "Shan Kothari",
                    "user_href": "/profile/Shan-Kothari"
                },
                {
                    "user_id": "Judy Levy Pordes",
                    "user_href": "/profile/Judy-Levy-Pordes"
                },
                {
                    "user_id": "David Metcalfe",
                    "user_href": "/profile/David-Metcalfe"
                },
                {
                    "user_id": "Greg Price",
                    "user_href": "/profile/Greg-Price"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                },
                {
                    "user_id": "Jay Wacker",
                    "user_href": "/profile/Jay-Wacker"
                },
                {
                    "user_id": "Yves Granger",
                    "user_href": "/profile/Yves-Granger"
                },
                {
                    "user_id": "Arvind Shrihari",
                    "user_href": "/profile/Arvind-Shrihari"
                },
                {
                    "user_id": "Shane Kai Glenn",
                    "user_href": "/profile/Shane-Kai-Glenn"
                },
                {
                    "user_id": "Kevin Litwack",
                    "user_href": "/profile/Kevin-Litwack"
                },
                {
                    "user_id": "Christine Choi",
                    "user_href": "/profile/Christine-Choi-1"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Kavinay Kishor",
                    "user_href": "/profile/Kavinay-Kishor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Blower",
                "href": "/profile/Stephen-Blower-1"
            },
            "answer_text": "Presumably, and almost certainly, no non-Jews produced the writings of the New Testament as we have them. ALL of the books of the New Testament were written in a common form of Greek called koine Greek prevalent in the eastern part of the Mediterranean basin, then part of the Roman Empire. As a result of the Alexandrian conquests of more than three centuries earlier, most Jews throughout the Roman empire spoke either Aramaic, a later form of Hebrew, but communicated to the wides audience in koine Greek. This form of Greek used by Jews was best known at the time from its use as the first translation of the Hebrew Bible, the Septuagint. The translation of the Hebrew Bible began as early as the third century before the time of the New Testament. In the Septuagint, a certain number of ‘Hebraicisms’ existed, meaning the translators sometimes exhibited grammatical constructions that seem to reflect efforts of translating Hebrew idioms or grammatical constructions more than using an idiomatically Greek use or grammatical construction. That is a complex topic, but not really important to answer the question. The point of all that is, when the authors of the New Testament quote what we call the Hebrew Bible, they are almost always quoting the Septuagint Greek form of the Hebrew Bible, as that is the language they are both writing in and almost certainly the version of the biblical texts their intended audience would have been familiar with. This is no small point. The “Scriptures” as they know them and refer to them don’t include the writings they themselves are producing, meaning the Gospels or Epistles or the book of Revelation, because they likely are not conscious of writing Scripture itself at the time. They are writing for other faith communities to spread the gospel of Jesus and the message of Christianity as it was forming as a separate sect of Judaism at the time. While the first audiences of these texts were clearly written for Jews and by Jews, who became Jewish Christians, eventually this comes to include a “Gentile” or non-Jewish Christian group, who nonetheless would have been taught and become familiar with the sacred writings of the Jews as a necessary part of their teachings as system of belief. By the second century this issue comes into a serious debate with something known as the Marcionite controversy, with a teacher named Marcion who believes that the Hebrew Bible was NOT in fact necessary for (his version of) Christianity, and not even all of the New Testament writings as they had then been brought together! Marcion’s view (described as dualistic gnosticism) was considered heretical and extreme, it did not reflect a majority view accepted by most early church fathers, and was eventually excluded by the major authorities teaching in the church at the time. But again, this goes beyond the scope of the question. Another answer goes to lengths to explain if the authors of the New Testament COULD have been familiar with the Hebrew Bible at all, by pointing out that through the discovery of the Dead Sea Scrolls we (i.e. scholars) know that versions of the Hebrew Bible existed in the first two centuries of Christianity; in fact this is a logical necessity and I’m not aware anyone believes that these texts were ever NOT available in the Jewish communities, as the same texts, or very nearly the same texts, had and have continued to be used in a religious setting, meaning among the priestly and rabbinical classes of Jewish peoples, from the time they were produced right up until modern times. However, most of the Jewish peoples scattered across the post-Alexandrian Greek Empire by the third century BCE outside of Judea did not still read and understand Hebrew, as they most likely did not use it as their everyday language, and this was clearly an issue that led to the need for the Greek translation called the Septuagint mentioned above. The present codified text of the Hebrew Bible that had been passed down as we have it today is called the Masoretic text, named for the editors and scribes working around the 9th or 10th century of this era, meaning approximately 1,000 years ago, who arranged, edited, and made both grammatical and orthographic notations to the Hebrew text, including developing a system of vowel points to go with the text so that readers of the Hebrew would understand its intended meaning and pronunciation. Again, that goes beyond what is needed for this answer, but the fact remains that the Jews who wrote the books of the New Testament were thoroughly immersed in the traditions of the Hebrew Bible, or “Old Testament” as Christians now call it, albeit most likely in its Greek translation form called the Septuagint. Much of the vocabulary for the New Testament is derived from this same “Septuagint” koine Greek, so there is an obvious correlation between the sets of texts. I hope this clarifies the answer to the question, and is useful to some readers. ",
            "date": "Answered August 31, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Simpson",
                "href": "/profile/John-Simpson-4"
            },
            "answer_text": "One very notable feature of the NT is the extent to which it alludes to or quotes the OT. It appeals to the OT in order to provide proof of statements made, confirmation for positions espoused, illustration of principles advanced, and answers to questions raised. Frequently, even when no formal citation is given or perhaps even intended, the NT writers follow forms of thought or speech patterned after OT passages. It is apparent that the NT writers and our Lord himself were so steeped in the language and truths of OT revelation that they naturally expressed themselves in terms reminiscent of it.  Because of this strong affinity of the NT writers for the OT, it is not always easy to determine with precision when a quotation is intended, where it begins, where it ends, and what OT passage or passages are alluded to. Consequently, estimates of the number of OT quotations and passages quoted vary considerably. A very conservative count lists 295 separate quotations: 224 direct citations prefixed by an introductory formula; 7 additional cases where \"and\" connects a second quotation to the one previously identified as such; 19 passages where a paraphrase or summary rather than a definite citation follows an introductory formula (e.g., Matt 2:23); and 45 quotations where the length (e.g., 1 Peter 3:10-12) or the specificity (e.g., Matt 27:46) makes it entirely clear that a reference to the OT is intended. Since many quotations are fairly extended, these 295 actually occupy some 352 verses of the NT. Two hundred and seventy-eight different verses of the OT are cited (some of them several times): 94 from the Law, 99 from the Prophets, and 85 from the Writings. As soon as allusions as well as direct quotations are included, the count rises sharply. Toy lists 613 instances; Shires, 1,604; Dittmar, 1,640, and Huehn yields a count of 4,105. These figures are evidence of the very close relationship between the Testaments.  Frank E. Gaebelein, ed., The Expositor's Bible Commentary – Volume 1: Introductory Articles: General, Old Testament, New Testament, For a partial list, see Quotations from the Old Testament in the New Testament  http://catholic-resources.org/Bible/Quotations-NT-OT.htm ",
            "date": "Answered March 7, 2012",
            "views": "384",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lexy Mendez",
                    "user_href": "/profile/Lexy-Mendez"
                },
                {
                    "user_id": "Joan Hoffman",
                    "user_href": "/profile/Joan-Hoffman-1"
                },
                {
                    "user_id": "Nathan Ketsdever",
                    "user_href": "/profile/Nathan-Ketsdever"
                },
                {
                    "user_id": "Noble P. Abraham",
                    "user_href": "/profile/Noble-P-Abraham"
                },
                {
                    "user_id": "Arvind Shrihari",
                    "user_href": "/profile/Arvind-Shrihari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Hamric",
                "href": "/profile/Mark-Hamric"
            },
            "answer_text": "Before the Apostle Paul died he writes a letter to his friend and disciple Timothy asking that he come to him. In this request he speaks of those who had abandoned him and of those whom he had sent to various places. But He also mentions that Luke is with him, (Luke is the author of the book of Acts and the Gospel that bears his Name.) Paul asks Timothy to bring Mark with him when he comes and further asks that Timothy bring some of Paul's personal items, to wit, A cloke, some books, and a parchment.  The Parchment was pretty important to him, Probably because it was a Hebrew copy of one of the biblical scrolls. Parchments were made of sheep skins as opposed to the papyrus. It is likely that Paul was planning to prepare Mark and Luke to write two of the Gospels that are now part of our Cannon.    2Timothy 4:6-136 For I am now ready to be offered, and the time of my departure is at hand. 7 I have fought a good fight, I have finished my course, I have kept the faith: 8 Henceforth there is laid up for me a crown of righteousness, which the Lord, the righteous judge, shall give me at that day: and not to me only, but unto all them also that love his appearing.  9  Do thy diligence to come shortly unto me: 10 For Demas hath forsaken me, having loved this present world, and is departed unto Thessalonica; Crescens to Galatia, Titus unto Dalmatia.  11 Only Luke is with me. Take Mark, and bring him with thee: for he is profitable to me for the ministry. 12 And Tychicus have I sent to Ephesus. 13  The cloke that I left at Troas with Carpus, when thou comest, bring with thee, and the books, but especially the parchments. ",
            "date": "Answered June 23, 2013",
            "views": "449",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alex Nakashian",
                    "user_href": "/profile/Alex-Nakashian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Mackey",
                "href": "/profile/Dave-Mackey"
            },
            "answer_text": "Absolutely. There are numerous references within the New Testament to the Old Testament. [Most of] the original authors of the New Testament were Jewish - and read the Old Testament (or Hebrew) Scriptures.Granted, the translation they most likely read was a bit different from that we read today - they probably read the Septuagint, a Greek translation of the Hebrew original...this version was very popular at that time since Alexander's conquest of the known world had spread Greek across the then-known world. ",
            "date": "Updated February 28, 2014",
            "views": "967",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noris Parms",
                    "user_href": "/profile/Noris-Parms"
                },
                {
                    "user_id": "Lexy Mendez",
                    "user_href": "/profile/Lexy-Mendez"
                },
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Sam Ronicker",
                    "user_href": "/profile/Sam-Ronicker"
                },
                {
                    "user_id": "Brian Zwick",
                    "user_href": "/profile/Brian-Zwick"
                },
                {
                    "user_id": "Joan Hoffman",
                    "user_href": "/profile/Joan-Hoffman-1"
                },
                {
                    "user_id": "Daniel Lowe",
                    "user_href": "/profile/Daniel-Lowe-1"
                },
                {
                    "user_id": "Mark Fortner",
                    "user_href": "/profile/Mark-Fortner"
                },
                {
                    "user_id": "Noble P. Abraham",
                    "user_href": "/profile/Noble-P-Abraham"
                },
                {
                    "user_id": "Gerrit M. Lansing",
                    "user_href": "/profile/Gerrit-M-Lansing"
                },
                {
                    "user_id": "Neil Russo",
                    "user_href": "/profile/Neil-Russo"
                },
                {
                    "user_id": "Alex Regueiro",
                    "user_href": "/profile/Alex-Regueiro"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                },
                {
                    "user_id": "Alison Stone",
                    "user_href": "/profile/Alison-Stone"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Kavinay Kishor",
                    "user_href": "/profile/Kavinay-Kishor"
                },
                {
                    "user_id": "Antonia Anni",
                    "user_href": "/profile/Antonia-Anni"
                },
                {
                    "user_id": "Arvind Shrihari",
                    "user_href": "/profile/Arvind-Shrihari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Chapman",
                "href": "/profile/Bob-Chapman"
            },
            "answer_text": "Luke 24.44ff:  Then [Jesus] said to them, ‘These are my words that I spoke to you while I was still with you—that everything written about me in the law of Moses, the prophets, and the psalms must be fulfilled.’ Then he opened their minds to understand the scriptures, and he said to them, ‘Thus it is written, that the Messiah is to suffer and to rise from the dead on the third day, and that repentance and forgiveness of sins is to be proclaimed in his name to all nations, beginning from Jerusalem. You are witnesses of these things. And see, I am sending upon you what my Father promised; so stay here in the city until you have been clothed with power from on high.’ To understand the Christian scriptures, you need the Hebrew scriptures. They don't stand alone from each other. ",
            "date": "Answered March 13, 2012",
            "views": "356",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lexy Mendez",
                    "user_href": "/profile/Lexy-Mendez"
                },
                {
                    "user_id": "Judith Williams",
                    "user_href": "/profile/Judith-Williams-2"
                },
                {
                    "user_id": "Casey Hill",
                    "user_href": "/profile/Casey-Hill"
                },
                {
                    "user_id": "Noble P. Abraham",
                    "user_href": "/profile/Noble-P-Abraham"
                },
                {
                    "user_id": "Kit Monisit",
                    "user_href": "/profile/Kit-Monisit"
                },
                {
                    "user_id": "John Simpson",
                    "user_href": "/profile/John-Simpson-4"
                },
                {
                    "user_id": "Christopher Rubin",
                    "user_href": "/profile/Christopher-Rubin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jackson Maia",
                "href": "/profile/Jackson-Maia-2"
            },
            "answer_text": "Yes they did, jesus read Isaiah scrolls in the temple, when tempted Jesus quoted Deuteronomy 3 times. The disciples several times quoted scriptures to refer as Jesus the fulfillment of prophecy, the ceremonial laws practiced are from the levitcus book, they had all the genealogies from Chronicles, the knowledge of the kings of Israel comes from the books of Kings, they talked about their father Abraham from the book of Genesis and the exodus from Egypt. They had all of their history down and all of the OT books. ",
            "date": "Answered March 22, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Henderson",
                "href": "/profile/Tom-Henderson-10"
            },
            "answer_text": "If they were of the educated class, the answer is most assuredly yes. I am not a scholar here, but that probably includes Matthew, Luke, and Paul at least. ",
            "date": "Answered September 3, 2014",
            "views": "74",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brendan Delany",
                    "user_href": "/profile/Brendan-Delany"
                },
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "The New Testament was supposedly written in the late 1st century - by followers of Jesus, who would have been Jews, so they would have had only one holy book - the Old Testament. The books that comprise it weren't combined into \"the New Testament\" until the 4th century. ",
            "date": "Answered October 20, 2015",
            "views": "578",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joan Hoffman",
                    "user_href": "/profile/Joan-Hoffman-1"
                },
                {
                    "user_id": "Paul Cutcliffe",
                    "user_href": "/profile/Paul-Cutcliffe"
                },
                {
                    "user_id": "Pat Ryan",
                    "user_href": "/profile/Pat-Ryan-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "R. Eric Sawyer",
                "href": "/profile/R-Eric-Sawyer"
            },
            "answer_text": "Jesus is recorded as reading in the synagogue when handed the scroll of Isaiah.This suggests that such readings were perhaps not uncommon, and that even those who could not read were accustomed to being read to on a regular basis. ",
            "date": "Answered July 7, 2014",
            "views": "269",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atanasio Segovia",
                "href": "/profile/Atanasio-Segovia"
            },
            "answer_text": "A picture is worth a thousand words. This one shows you how much the NT writers referenced the OT (from openbible.info).  ",
            "date": "Answered April 20, 2014",
            "views": "316",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kit Monisit",
                    "user_href": "/profile/Kit-Monisit"
                }
            ]
        }
    ]
}