{
    "title": "Did you ever get lost somewhere? What happened? - Quora",
    "tags": [
        "Being Lost",
        "Losing and Finding Things",
        "Personal Experiences",
        "Experiences in Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Burden",
                "href": "/profile/Michael-Burden-6"
            },
            "answer_text": "Have you ever been in a maze, like the one pictured below ? This one is the probably our most famous maze, in the grounds of Hampton Court Palace on the outskirts of London. I have been in this maze, but I was not lost in it, because it is quite easy to find your way out again.  However I have been in another maze similar to the famous Hampton Court maze, but one which I found much more challenging. Indeed I was quite lost and confused in this maze, and it took me about half an hour to get out again. I remember how the rest of the family, who had made their escape from it, kept calling to me, wondering where I was, though we could not see each other.  The maze which was so difficult and which I did indeed get lost was the one above, the Dragonfly Maze, in Bourton-on-the-Water in Gloucestershire. The village, which is something of a tourist attraction in itself, is in the heart of The Cotswolds, that quintessentially English area of countryside with its pretty stone villages and rolling hills. A feature of the Dragonfly Maze, unlike the majority of other English hedge mazes, is that it incorporates a series of clues and puzzles throughout the maze that must be deciphered in order to fully complete the game. This concept for the game-within-a-maze was inspired by the 1979 “treasure hunt” book Masquerade by the designer of the Dragonfly Maze, Kit Williams (pictured below).  Williams’s book provided readers with obtuse clues and riddles that would lead one lucky winner to the location of a golden hare treasure. Taking this model of riddles and rewards, the builders of the Dragonfly Maze placed their titular golden insect in the middle of the maze. However the dragonfly is contained inside of an elaborate frog automaton which was designed by Kit Williams himself. To liberate the bauble, visitors must not only find their way to the middle of the maze, but also solve all of the clues to get the clockwork frog to give up its dinner. Unfortunately, even if the puzzles and the maze are solved, the dragonfly is just to look at and cannot be taken. However the real prize in the Dragonfly Maze is the sense of wonder and adventure brought on by going treasure-hunting in a hedge maze. It was no wonder I got lost in it, and no wonder it was so difficult if it was designed by Kit Williams. The treasure hunt that gripped a nation The link above is to an article which tells you more about this book and its treasure hunt, and I must confess that the book had me gripped too when it first appeared forty years now, though I was nowhere near to solving it. ",
            "date": "Answered September 12, 2019",
            "views": "339",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maria N. Kelliher",
                    "user_href": "/profile/Maria-N-Kelliher"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Yates",
                "href": "/profile/John-Yates-42"
            },
            "answer_text": "Four of us who were working on an adult education project in Istanbul went to the grand bazaar most of which is subterranean & massive. It seems to spread out in all directions & many of the stalls sell similar items & after a while, it's easy to lose one’s direction & get hopelessly lost as we did & could not find the way to where we entered but even more scary was that it took us ages to find an exit at all which was a very claustrophobic feeling being underground. We eventually emerged in unfamiliar area miles from where we entered. ",
            "date": "Answered September 7, 2019",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anne Prescott",
                    "user_href": "/profile/Anne-Prescott-1"
                }
            ]
        }
    ]
}