{
    "title": "Did the Confederacy want to occupy the Union states or did they just want to secede from the Union? - Quora",
    "tags": [
        "Confederacy",
        "Secessionism in the USA",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Kelly",
                "href": "/profile/John-Kelly-348"
            },
            "answer_text": "Just want to secede? Is that why they seized Federal armories with more than 200,000 muskets and rifled muskets? Is that why they seized navy yards, with all their stores as well as naval artillery and heavy, land-based guns? Is that why they seized or attempted to seize Federal fortifications? In 1859 and 1860, John Floyd, the Secretary of War and a Virginian, shipped 115,000 muskets and rifled muskets to armories in the South. He did that without the prior knowledge or consent of the President or Congress. It was only when he attempted to ship heavy artillery for coastal defense batteries that he was detected, because a clerk in the War Department complained. So-called “state troops” (that’s unconstitutional, see below) in Alabama and Florida seized armories and other Federal property before their states had passed secession ordinances. That was also two months before Lincoln was inaugurated. Those so-called state troops attempted to seize Forts Barrancas and McRea in Florida on the evening January 8, 1861, almost two months before Lincoln was inaugurated. The Lieutenant commanding had his men fire over the heads of the mob—excuse me, “state troops”—who scurried back to Pensacola as fast as their fat little legs would carry them. On January 9, 1861, cadets from the Citadel, the state military academy in South Carolina, fired on Star of the West, an unarmed merchant ship attempting to deliver troops and supplies to Fort Sumter. I am so heartily sick and tired of this constant bullcrap that attempts to portray those bellicose, blood-thirsty, elitist weasels as innocent citizens attempting to exercise their rights and then being attacked by ruthless Mr. Lincoln. They were spoiling for a fight, they got their fight, and they got their collective butt kicked. They have been whining and lying about it ever since. It cost hundreds of thousands of Americans, north and south, their lives. It was also a gross violation of the constitution—Article One, Section ten reads: No State shall enter into any Treaty, Alliance, or Confederation; grant Letters of Marque and Reprisal; coin Money; emit Bills of Credit; make any Thing but gold and silver Coin a Tender in Payment of Debts; pass any Bill of Attainder, ex post facto Law, or Law impairing the Obligation of Contracts, or grant any Title of Nobility. No State shall, without the Consent of the Congress, lay any Imposts or Duties on Imports or Exports, except what may be absolutely necessary for executing it's inspection Laws: and the net Produce of all Duties and Imposts, laid by any State on Imports or Exports, shall be for the Use of the Treasury of the United States; and all such Laws shall be subject to the Revision and Control of the Congress. No State shall, without the Consent of Congress, lay any duty of Tonnage, keep Troops, or Ships of War in time of Peace, enter into any Agreement or Compact with another State, or with a foreign Power, or engage in War, unless actually invaded, or in such imminent Danger as will not admit of delay. In Virginia and Tennessee, they had to fiddle the vote because many parts of those states were opposed to secession. The western counties of Virginia seceded from the Commonwealth, and became the state of West Virginia in 1863. The southwestern counties had so many draft-dodgers (the freedom-loving Confederacy enacted conscription a year before the United States did so) and deserters that Lee had to send two brigades there to try to bring them into line. The eastern counties of Tennessee announced their intention to seceded from the state, after the first secession ordinance had failed, and the state legislature fiddled the vote the second time. Troops were quickly sent to occupy Knoxville, the center of secession resistance. In 1863, Burnside lead a force across the mountains from Kentucky, drove the Confederate garrison out of Knoxville, and then held against repeated attacks, including assaults by the over-rated James Longstreet with his troops from the Army of Northern Virginia. He had to lead his now ragged troops across the mountains back to Virginia, in winter, and many were lost to malnutrition, disease and, above all, desertion. This is the propaganda of a coterie of self-interested creeps who plunged the country into to its bloodiest war solely so they could keep their “peculiar institution.” As Andrew Johnson of Tennessee pointed out to them in the Senate, their institution was not threatened. To this day, the slave states had the power to block any amendment to end slavery, if they had simply remained in the Union. The blood-thirsty clowns cut off their noses to spite their ugly mugs, and they’ve been lying and whining about that every since, too. Really, this crap just makes me ill. The slave-owners lost the shooting war, but they have won the propaganda war since the shooting war ended. The sad thing is how many Americans buy that horse poop. ",
            "date": "Answered April 6, 2017",
            "views": "889",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Fairweather",
                    "user_href": "/profile/Jack-Fairweather-6"
                },
                {
                    "user_id": "Gary Miles",
                    "user_href": "/profile/Gary-Miles-1"
                },
                {
                    "user_id": "Gregory A. Farrell",
                    "user_href": "/profile/Gregory-A-Farrell"
                },
                {
                    "user_id": "James Bancroft",
                    "user_href": "/profile/James-Bancroft-7"
                },
                {
                    "user_id": "Tim Coco",
                    "user_href": "/profile/Tim-Coco"
                },
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                },
                {
                    "user_id": "William Watkins",
                    "user_href": "/profile/William-Watkins-48"
                },
                {
                    "user_id": "Ken Helmick",
                    "user_href": "/profile/Ken-Helmick"
                },
                {
                    "user_id": "Clark Houchen",
                    "user_href": "/profile/Clark-Houchen"
                },
                {
                    "user_id": "Marshall Faulds",
                    "user_href": "/profile/Marshall-Faulds"
                },
                {
                    "user_id": "Duncan Cairncross",
                    "user_href": "/profile/Duncan-Cairncross"
                },
                {
                    "user_id": "Stephen Frantz",
                    "user_href": "/profile/Stephen-Frantz"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Rayca",
                "href": "/profile/Brian-Rayca"
            },
            "answer_text": "As far as states that were in the Union, the North? The Confederacy did not have any intention of occupying territory, with the exceptions of Border slave states that they hoped would join them, particularly Kentucky and Maryland. Those two states when invaded were invited to join the Confederacy. It was hoped and even anticipated, that Border states would join the confederacy if “freed” from what the Confederates considered occupation. This was a grave error in judgement and completely ignored the internal politics of those states. However, the Secession crowd routinely misjudged and trampled the unionist sentiments within their own states. This happened in Texas, Eastern Tennessee, West Virginia, and Western North Carolina, Northern Alabama in particular. That being said, Territories for expansion, to the West Coast were very much on the minds of Confederates. It was the expansion of slavery into those territories that was a major factor in causing the war. Seizing those territories and holding them was a goal of the Confederacy. They wanted and did invade New Mexico, Arizona. They stated goals after independence was to expand the Confederacy into Mexico and Cuba. ",
            "date": "Answered April 6, 2017",
            "views": "283",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gregory A. Farrell",
                    "user_href": "/profile/Gregory-A-Farrell"
                },
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                },
                {
                    "user_id": "Ken Helmick",
                    "user_href": "/profile/Ken-Helmick"
                },
                {
                    "user_id": "Will Jennings",
                    "user_href": "/profile/Will-Jennings-17"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Lobb",
                "href": "/profile/Richard-Lobb-1"
            },
            "answer_text": "Eleven states, from Virginia down to Florida and over to Texas, joined the Confederacy. Kentucky and Missouri remained in the Union but were deeply riven, with factions on both sides. The Confederates attempted to win both states over, but were defeated, and no military efforts were made after early 1862. A ragtag band of Confederates made an abortive foray into the New Mexico territory, but it failed. After these excursions, the rebels concentrated on holding what they had. \"All we ask is to let alone,\" is the way Confederate President Jefferson Davis put it. The rebel Army of Northern Virginia moved into Maryland in late 1862 (Antietam campaign) and Pennsylvania in 1863 (Gettysburg). But these were attempts to move the fighting out of war-ravaged Virginia and to seek decisive battle rather than to conquer territory. The Confederacy never had a vision of moving north in the political sense. Some Confederates hoped to move south and annex Cuba or form an alliance with Mexico, but these were pipe dreams. The rebels had their hands full holding onto the territory they had, a project that ultimately failed, of course. ",
            "date": "Answered February 12, 2018",
            "views": "428",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles R. Gray",
                    "user_href": "/profile/Charles-R-Gray-1"
                },
                {
                    "user_id": "David Richardson",
                    "user_href": "/profile/David-Richardson-35"
                },
                {
                    "user_id": "Austin Middleton",
                    "user_href": "/profile/Austin-Middleton"
                },
                {
                    "user_id": "Dennis Pratt",
                    "user_href": "/profile/Dennis-Pratt-3"
                },
                {
                    "user_id": "Ryan Rodriguez",
                    "user_href": "/profile/Ryan-Rodriguez-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raymond Wayne Holton",
                "href": "/profile/Raymond-Wayne-Holton"
            },
            "answer_text": "No, they didn’t want to occupy the North I don’t think. They wanted to be free of northern influence on their social norms though. I don’t think the south thought out the likely outcome of war very well. Sam Houston said basically “We’re gonna get our asses kicked Folks”. He correctly assessed the relative strength of the two combatants and wouldn’t take the oath of loyalty that cost him his governorship of Confederate Texas. He died a far less revered man than he deserved to. Anyway, I doubt the South thought they had the resources to occupy the North. I think they just sensed the prevailing winds and saw that in all likelihood slavery was going to be ended sooner rather than later in the US. I think it really was a rich mans’ war and a poor mans’ fight. When Lincoln was elected it seemed a harbinger of doom to wealthy planters who basically were the Southern economy. I think they kind of panicked and abruptly started succession proceedings. The South felt itself being herded towards a place they didn’t choose as a part of the United States. The rich didn’t like it. I don’t think a lot of the poor cared nearly as much but they weren’t much valued anyway in the South. There’s a book named “Bullwhip Days” that was compiled by the WPA , I believe, during the Depression and it is the spoken history of pre- Civil War days by Surviving former slaves of which there were still many. They tell the story of their slavery. They recount differing experiences and treatments they received as slaves. Surprisingly to modern people many slaves said they’d have rather been a slave than a poor white man. They recounted that poor white people were treated worse than most slaves. And some slaves loved their owners/masters. Some slaves were very well treated and didn’t want to leave their plantations after freedom. Of course this is controversial to state but it is the actual words former slaves said. But is is also true that there were stories of cruelty too. But believe it or not most of the stories were of better treatments and even happiness. I’m not trying to apologize for slavery. It was a fascinating book undertaken by a fascinating government agency. ",
            "date": "Answered September 18, 2018",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Cate",
                "href": "/profile/John-Cate-2"
            },
            "answer_text": "They just wanted to secede. Why would they have wanted to subjugate the North, and force millions of people who already hated the South and its way of life into living under their rule? They wanted to add the border slave states of Kentucky and Missouri that remained under Union control, but had no interest in the Northern free states. If the North had let the Confederacy have its independence peacefully in 1861, the South would have left them be to have whatever type of government and domestic institutions they wanted (i.e. no slavery). The problem was that the North viewed the Union as indivisible, and furthermore felt that the Southern states had no legitimate reason to leave, since Lincoln didn’t plan on trying to ban slavery anywhere that it already existed. During the war, Confederate troops only entered free Union territory a few times, and all as the result of war measures designed to help the Confederacy win the war militarily. At no time did the CSA attempt the permanent occupation of any territory of a free state. Jefferson Davis said it himself…”We just want to be left alone.” ",
            "date": "Answered April 6, 2017",
            "views": "853",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ed Wigley",
                    "user_href": "/profile/Ed-Wigley"
                },
                {
                    "user_id": "Russell Person",
                    "user_href": "/profile/Russell-Person"
                },
                {
                    "user_id": "Matthew Sutton",
                    "user_href": "/profile/Matthew-Sutton-3"
                },
                {
                    "user_id": "Gene McCluskey",
                    "user_href": "/profile/Gene-McCluskey-1"
                },
                {
                    "user_id": "Eric Cowen",
                    "user_href": "/profile/Eric-Cowen-1"
                },
                {
                    "user_id": "Daniel Ptashny",
                    "user_href": "/profile/Daniel-Ptashny-1"
                },
                {
                    "user_id": "Will Jennings",
                    "user_href": "/profile/Will-Jennings-17"
                },
                {
                    "user_id": "Dilwinder Johal",
                    "user_href": "/profile/Dilwinder-Johal"
                },
                {
                    "user_id": "Mary Taft",
                    "user_href": "/profile/Mary-Taft-1"
                },
                {
                    "user_id": "Mohammad Alsafran",
                    "user_href": "/profile/Mohammad-Alsafran"
                },
                {
                    "user_id": "John Walton",
                    "user_href": "/profile/John-Walton-1"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Hopkins",
                "href": "/profile/Jim-Hopkins-43"
            },
            "answer_text": "Southern slave holders abhorred northerners, who they were convinced were all rabid abolitionist. They wouldn’t have wanted any free states. When the original 7 states formed their federal government, they sent emissaries to some of the states that were still in the Union, but only those that had legalized slavery. So there were some northern states they sought to occupy, notably Missouri, but also Kentucky. That being said, the decades leading up to the Civil War had shown that the southern slave states tended to be more expansionist than northerners. Sure, there were people from the north like Douglas and Pierce who looked westward, but they were balanced by other voices who were opposed to the Mexican American war and saw it as nothing more than a land grab. In the south, they had many more leaders who lusted after Latin America and dreamed of a great big ‘slave republic’. ",
            "date": "Answered November 9, 2019",
            "views": "96",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve Schlackman",
                    "user_href": "/profile/Steve-Schlackman-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Zaper",
                "href": "/profile/Peter-Zaper"
            },
            "answer_text": "No. The war is mislabelled as a civil war is where tow factions what to take over the same country as in the Russian civil war between the Whites and the Reds. In the American Civil War, the Confederacy did not want to occupy the North, they wanted to secede and go their own way. Lincoln would not permit it as he was committed to preserving the Union at any cost. He saved the Union and thus the nation. ",
            "date": "Answered April 6, 2017",
            "views": "118",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrew Lenihan",
                    "user_href": "/profile/Andrew-Lenihan"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Boyle",
                "href": "/profile/Joseph-Boyle"
            },
            "answer_text": "Their ideal would have been a continuing Union without the fanatical abolitionist far North. New England, Upstate New York, and the Great Lakes strongly supported the Republican Party and the war, volunteering in droves. If these areas gave up and joined Canada instead, the move from Richmond to Washington is a much shorter one than Montgomery to Richmond. ",
            "date": "Answered February 5, 2018",
            "views": "311",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "Diana Aulicino",
                    "user_href": "/profile/Diana-Aulicino-1"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                },
                {
                    "user_id": "Sara Erickson",
                    "user_href": "/profile/Sara-Erickson-5"
                },
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikey Ward",
                "href": "/profile/Mikey-Ward-2"
            },
            "answer_text": "Occupation of the North was never the goal of the Confederacy. The Confederacy merely wished for their independence to be respected by the North, to the Confederates, they were merely exercising the rights their forefathers had exercised in 1775, some Northerners agreed with this view as well. The Confederacy was pushed into a war for their independence, they didn’t ask for it, but if war meant that the North would see reason, then they would fight it. Jefferson Davis’ war policy was at first a strict defensive one, to preserve his nation as much as possible whilst waiting for the North’s will to fight to sap to the point of opening peace negotiations, it wasn’t until 1863 when real incursions into the North were approved. ",
            "date": "Answered October 7, 2019",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Dewar Gleissner",
                "href": "/profile/John-Dewar-Gleissner"
            },
            "answer_text": " The Confederate States of America simply wanted to be left alone. They never wanted to occupy the Northern states and only invaded the North temporarily for military advantage in their grand defensive strategy. ",
            "date": "Answered February 5, 2018",
            "views": "513",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cameron Kingsley",
                    "user_href": "/profile/Cameron-Kingsley-1"
                },
                {
                    "user_id": "Kaleb Bolena",
                    "user_href": "/profile/Kaleb-Bolena"
                },
                {
                    "user_id": "Tim Coco",
                    "user_href": "/profile/Tim-Coco"
                },
                {
                    "user_id": "Paul White",
                    "user_href": "/profile/Paul-White-110"
                },
                {
                    "user_id": "Ryan Rodriguez",
                    "user_href": "/profile/Ryan-Rodriguez-44"
                },
                {
                    "user_id": "Lucas Klein",
                    "user_href": "/profile/Lucas-Klein-13"
                },
                {
                    "user_id": "Nathan Manning",
                    "user_href": "/profile/Nathan-Manning-8"
                },
                {
                    "user_id": "Lonnie Willie",
                    "user_href": "/profile/Lonnie-Willie"
                },
                {
                    "user_id": "James Hazuga",
                    "user_href": "/profile/James-Hazuga"
                },
                {
                    "user_id": "Allen Keen",
                    "user_href": "/profile/Allen-Keen-3"
                },
                {
                    "user_id": "Richard Dress",
                    "user_href": "/profile/Richard-Dress-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pete Salas",
                "href": "/profile/Pete-Salas"
            },
            "answer_text": "Their goal was to secede from the Union, not to conquer any northern states. They were already over their heads defending their territory and major offensive actions were beyond their capability. Robert E. Lee did invade Union territory but only as a short term strategic endevor. He had no intention of keeping the territory. ",
            "date": "Answered April 6, 2017",
            "views": "358",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                },
                {
                    "user_id": "Matthew Sutton",
                    "user_href": "/profile/Matthew-Sutton-3"
                },
                {
                    "user_id": "Aaron Bell",
                    "user_href": "/profile/Aaron-Bell-13"
                },
                {
                    "user_id": "Robert Cameron",
                    "user_href": "/profile/Robert-Cameron-16"
                },
                {
                    "user_id": "Randall Burns",
                    "user_href": "/profile/Randall-Burns"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Ron Rosenthal",
                    "user_href": "/profile/Ron-Rosenthal-1"
                },
                {
                    "user_id": "Carlos Simpson",
                    "user_href": "/profile/Carlos-Simpson-7"
                },
                {
                    "user_id": "Robert Hegwood",
                    "user_href": "/profile/Robert-Hegwood"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Andrew Leiter Doolittle",
                "href": "/profile/George-Andrew-Leiter-Doolittle"
            },
            "answer_text": "This is a great question actually….one we don't really know the answer to namely “what really were the War Aims of the Confederacy?” General Lee did attempt to invade the North at Gettysburg…with catastrophic consequences. The purpose appears to have been an attempt at a flanking movement in order to lay siege to Lincoln and Washington DC from the North…but this would have been impossible without taking the Port of Baltimore. Gettysburg is a long way from Baltimore. Washington DC was a very tempting target though at the time. ",
            "date": "Answered April 15, 2017",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Theodorakis",
                "href": "/profile/Nick-Theodorakis"
            },
            "answer_text": "They wanted to expand slavery southward by by conquering parts of Latin America. https://www.americancivilwarforum.com/from-mexico-to-panama-the-plans-for-southern-expansion-2345519.html Golden Circle (proposed country) - Wikipedia ",
            "date": "Answered February 12, 2018",
            "views": "130",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gary Miles",
                    "user_href": "/profile/Gary-Miles-1"
                },
                {
                    "user_id": "Gregory A. Farrell",
                    "user_href": "/profile/Gregory-A-Farrell"
                },
                {
                    "user_id": "Ryan Rodriguez",
                    "user_href": "/profile/Ryan-Rodriguez-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim George",
                "href": "/profile/Jim-George-2"
            },
            "answer_text": "They wanted to succeed from the Union and own people. \"Just\" indicates exclusivity. They were each clear in their succession statements that the war was about slavery. ",
            "date": "Answered April 6, 2017",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Bunner",
                "href": "/profile/Thomas-Bunner"
            },
            "answer_text": "No. They simply wished to “go in peace” and to be “left alone”, and from the beginning was under attack after seeking a peaceful solution. ",
            "date": "Answered October 12, 2020",
            "views": "37",
            "upvotes": "0"
        }
    ]
}