{
    "title": "Did the Romans smoke? - Quora",
    "tags": [
        "Roman Army",
        "Ancient Romans",
        "Smoke (particles, not smoking)",
        "Health Effects of Smoking",
        "Roman Empire",
        "Cigarettes",
        "Ancient Rome",
        "Smoking",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clarence Uhrich",
                "href": "/profile/Clarence-Uhrich"
            },
            "answer_text": "The real answers are dependent on one’s definition of smoking: They did not have tobacco. That came from the New World (Americas) about 1,000 years after the fall of the Roman Empire. 27th July 1586. by Ben Johnson. The most common date given for the arrival of tobacco in England is 27th July 1586, when it is said Sir Walter Raleigh brought it to England from Virginia. Indeed, one legend tells of how Sir Walter's servant, seeing him smoking a pipe for the first time, threw water over him, fearing him to be on fire. Historic UK › HistoryUK › Introduc... Introduction of Tobacco to England - Historic UK However they did inhale incense used to perfume the air during religious ceremonies. In Roman polytheism the useof incense in ritual offerings is deeply entrenched. ... The acerra (incense box) was a key ritual item for ancient Romansand it is clear that frankincense, along with other kinds of imported incense, such as cinnamon, myrrh and nard, was used in abundance throughout the imperial age. WordPress.com: Create a Free Website or Blog › romanpagan › inc... Incense | Roman Pagan As a Seventh Day Adventist Christian, I learned about nutmeg as an opiate in my college class in foreign foods. Ellen G. White one of the church founders warned about it as causing stupors. Her experience with Bible studies at people’s homes in the 19th century caused her to be drugged without knowing what was happening. Many people burned nutmeg on censers in their parlors. The smoke gets the inhalants “high”. See: Nutmeg may have been a rare delicacy in ancient Greece and Rome, although there is little evidence of its use in the food or drink of those times. UCLA › library › unitproj › spice Nutmeg and Mace - Medicinal Spices Exhibit - UCLA Biomedical Library ... https://www.unodc.org/unodc/en/data-and-analysis/bulletin/bulletin_1966-01-01_4_page003.html The Romans did not smoke as we know it today. They did use incense and perhaps many of those substances had the effects of nutmeg on them. Then there are other possibilities such as this: Did the Romans smoke opium or cannabis around 50 BCE? ",
            "date": "Answered October 23, 2020",
            "views": "190",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris G Hibbett (El Bobo)",
                    "user_href": "/profile/Chris-G-Hibbett-El-Bobo"
                },
                {
                    "user_id": "Georgene Wickstrand",
                    "user_href": "/profile/Georgene-Wickstrand-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Chevallier",
                "href": "/profile/Jim-Chevallier"
            },
            "answer_text": "No one in Europe smoked until encountering the habit in the Western Hemisphere among Native Americans. So, no. (I presume by smoking you mean holding something to your mouth and sucking in smoke from something burning, not just being in a very smoky place, like an incensed church. There are some very nutty answers here and one of the screwiest has blocked comments so no one can say as much.) ",
            "date": "Answered October 23, 2020",
            "views": "101",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Holder",
                    "user_href": "/profile/Richard-Holder-46"
                },
                {
                    "user_id": "Clarence Uhrich",
                    "user_href": "/profile/Clarence-Uhrich"
                },
                {
                    "user_id": "Owen Brown",
                    "user_href": "/profile/Owen-Brown-239"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Dusemund",
                "href": "/profile/Robert-Dusemund"
            },
            "answer_text": "Not in the way that they used pipes, cigars or cigarettes. But above all priests inhaled the smoke of herbs burnt in fire bowls or even gases coming out of cracks in rocks (as the oracle of Dephi did by the Greeks). Pipes for smoking were invented parallel(!) around 1,600-1,300 BC in South America (Marajó island in the Amazon estuary) and in Germany (found in a Bawarian town) and in the Middle East. Only the American Pipes were used for Tobacco, the others for smoking herbs or dried fruit, in the middle East maybe also for hemp and poppy seeds (as ancestors of cannabis and opium but with far fewer active ingredients). Cigars came not before Columbus to Europe accompanied with potatoes and tomatoes. ",
            "date": "Answered October 23, 2020",
            "views": "99",
            "upvotes": " Answer requested by Jonel Samnath"
        }
    ]
}