{
    "title": "Did Hitler and the Nazis see Jews as communists? - Quora",
    "tags": [
        "Communists",
        "Nazism",
        "Adolf Hitler",
        "Communism",
        "Nazi Germany",
        "Jewish Ethnicities and People",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Holton",
                "href": "/profile/Bob-Holton"
            },
            "answer_text": "The Nazi’s saw Communism as being a Jewish conspiracy. They also saw American capitalism as being a Jewish conspiracy. Their bizarre cosmology pretty much blamed everything that happened to anyone in the German speaking world at any time on a belief that Jews had made it their main business to make life hard for Germans. While a belief that was mostly a result of the beliefs of the worst of the anti-Semitic people in upper class German society, and brought to the fore with the social cataclysm of their loss in WWI, channeled through the fever dreams of Hitler, there were some reasons why the Russian Bolsheviks were seen as being “Jewish” by some contemporaries. Some of the reasons for this, in addition to the ease with which most of Europe’s ethnic groups could be convinced of the wickedness of Jews, was due to the significant numbers of secular Jews among Europe’s Communists and Socialists and in particular those leading the Russian revolution. The reason’s for this were complex but may well be due to a lack of an outlet for those who wished to pursue popular social reform combined with the Jews position as permanent outsiders. It was also noted among those peoples who resisted the Communists (Ukrainians, later Poles) that many of the Checka, especially those working outside Russia were populated by Jews. Some of the later anti-Semitism seen in the Ukraine and eastern Europe were probably exacerbated by this. Even in Russia itself, the Soviets eventually used anti-Semitic for their own purposes; Stalinist NKVD and then the KGB were largely purged of Jews. Of course, despite all this, the vast majority of Russian and European Jews were neither Communist nor secular, just as that few were in any way involved in finance; most were poor, religious peasants like most other ethnic groups there. ",
            "date": "Answered October 24, 2020",
            "views": "123",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Louise Florence",
                    "user_href": "/profile/Louise-Florence-1"
                },
                {
                    "user_id": "Ludwig Luft",
                    "user_href": "/profile/Ludwig-Luft-1"
                },
                {
                    "user_id": "Matthew Cowell",
                    "user_href": "/profile/Matthew-Cowell-4"
                },
                {
                    "user_id": "Mika Timonen",
                    "user_href": "/profile/Mika-Timonen-1"
                },
                {
                    "user_id": "Daniel Hwang",
                    "user_href": "/profile/Daniel-Hwang-67"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Hopkin",
                "href": "/profile/Dave-Hopkin-1"
            },
            "answer_text": "Nazi racial policies were based on psuedo-science, actually utter rubbish dressed up to sound scientific that portrayed the various ethnic groups in a “league table” of their ideal “Ayrian” race The Jews were the bottom of the hierarchy and classed as “sub human” Why that happened? There was (and is) a level of anti-semitism endemic in Europe going back to the Cruxification (the Jews were “christkillers”) and there have been outbreaks of violent anti-semitism over the last 2000 years, including the pogroms in Eastern Europe in the 19th century So the Nazis conflated the pre-exisiting levels of anti semitism with allegations of imagined jewish wrong doings against Germany, the “Stab in the back of WW2” and the financial crash of Weimar Germany was blamed on the Jewish Bankers in New York acting against Germany rather than a global financial crises affecting everyone Communism was deemed a “Jewish Inspired” plot against Germany for the simple reason that as pre-revolutionary Russia was instututionally anti-semetic places huge numbers of restictions on Jews, the jews were promininent in the leaders and supporters of the Revolition ",
            "date": "Answered October 25, 2020",
            "views": "108",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Howell",
                    "user_href": "/profile/Robert-Howell-114"
                },
                {
                    "user_id": "John McEwan",
                    "user_href": "/profile/John-McEwan-13"
                },
                {
                    "user_id": "Martin Watts",
                    "user_href": "/profile/Martin-Watts-23"
                },
                {
                    "user_id": "Jesus Soto Martinez",
                    "user_href": "/profile/Jesus-Soto-Martinez"
                }
            ]
        }
    ]
}