{
    "title": "Did the Greek people make a mistake in separating from the Ottoman Empire as stated by Prof. Dimitri Kitsikis? - Quora",
    "tags": [
        "Greek Ethnicity and People",
        "Ottoman Empire",
        "Greece",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vangelis Denaxas",
                "href": "/profile/Vangelis-Denaxas"
            },
            "answer_text": "No, and it was inevitable. The revolution of 1821 was the result and combination on a series of parameters, like the difference in taxation between the muslims and the christians who were considered dhimmi, which meant a kind of inequality between the subjects of the ottoman empire, as well as the bringing of ideas like nationalism from western Europe through Greek sea traders and businessmen. This idea of nationalism anyway would much later inspire and the Turks themselves during the beginning of the 20th century and Mustafa Kemal, an archetype of Turkish nationalist himself, clearly had quoted that in the old Ottoman Empire, the Greeks had been pioneers on this matter due to their education and knowledge of the western ideologies of the 18th and 19th century. This separation also took place during the era of the gradual decline of the ottoman state on many levels, like corruption of local officials and pashas, technology, science, education etc, less trained army, difficulties on when the western powers clearly were far ahead in many such aspects. The ottoman economy still had been heavily based on agriculture and on a still medieval and feudal like system (with the lands given from the Sultans to persons like the sipahis, janissaries, religious vacufs, monasteries etc) It took place during a historical period when the western powers had already evolved in knowledge and education while had managed more or less to separate the process of organizing their state mechanisms from religion unlike the Ottomans who still had been trapped in many aspects (education etc) by the Sharia law. It is not a coincidence that some Ottoman officials and soldiers who had participated in the armed conflicts in Peloponessos after 1821, during the Revolution, had kept on talking in their memoirs about an uprising of infidels against the house of Islam and not about a nation’s uprising. This was evident of a certain political philosophy in the ottoman world which had been developed though the millet system and where the notion about nation had been connected clearly with religion. Of course at the same moment this does not mean that later on in the process the independent Greek state became a kind of heaven on earth or that it had not always been a country serving the interests of greater powers, like the British or the Americans later on. This is anyway something that, more or less, happens always with almost all small states on the planet. Nevertheless, the separation of the Greeks back then was the separation from a dying multinational state. The officials of that state in their times had understood very well that they had to make changes, more or less, but for decades thay had also to face a lot of obstacles from within the state mechanisms themselves like officials who had been stuck to older traditions ",
            "date": "Answered October 24, 2020",
            "views": "696",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Giannis Lainas",
                    "user_href": "/profile/Giannis-Lainas"
                },
                {
                    "user_id": "Josef Kotsifis",
                    "user_href": "/profile/Josef-Kotsifis"
                },
                {
                    "user_id": "Ahmet Yigit",
                    "user_href": "/profile/Ahmet-Yigit-4"
                },
                {
                    "user_id": "Endri Cara",
                    "user_href": "/profile/Endri-Cara-2"
                },
                {
                    "user_id": "Susan Petrakis",
                    "user_href": "/profile/Susan-Petrakis"
                },
                {
                    "user_id": "Alan Piersonn",
                    "user_href": "/profile/Alan-Piersonn"
                },
                {
                    "user_id": "Jenny Kim",
                    "user_href": "/profile/Jenny-Kim-257"
                },
                {
                    "user_id": "Jone Orfanakhs",
                    "user_href": "/profile/Jone-Orfanakhs"
                },
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                },
                {
                    "user_id": "Atila Togay",
                    "user_href": "/profile/Atila-Togay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Giannatos",
                "href": "/profile/Mike-Giannatos"
            },
            "answer_text": "I would like to shed some light in another aspect of the issue. To delineate that aspect, suppose that a very poor woman is married for a long time to a very rich man, with whom she shares very little in common. There is no love, she feels oppressed and in general she sees no future in the relation. Should she get a divorce, even if this means that she might have a difficult life after it? In my humble opinion, she should. Even if her life after the divorce is worse than before it. In the matter of the separation of Greece from the Ottoman Empire, Greece, as well as other Balkan states, felt that there was no connection between the Greeks and the Ottomans. So, the decision to form an independent state was correct, regardless if Greece would be better as part of the Ottoman Empire or not. It doesn’t matter whether Greece would be more prosperous or have had more power under the auspice of the Ottoman Empire. The will of her inhabitants was to form an independent country and they still haven’t changed their mind, so the initial decision was correct. Under the above rationale, Prof. Kitsikis opinion bares no significance. It’s just an opinion and we all know the saying regarding opinions and assholes… ",
            "date": "Answered October 26, 2020",
            "views": "139",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Piersonn",
                    "user_href": "/profile/Alan-Piersonn"
                },
                {
                    "user_id": "Christos Gourgaris",
                    "user_href": "/profile/Christos-Gourgaris"
                }
            ]
        }
    ]
}