{
    "title": "Did the Industrial Revolution improve life in Great Britain? - Quora",
    "tags": [
        "Industrial Revolution",
        "History of Great Britain"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Orchard",
                "href": "/profile/John-Orchard-14"
            },
            "answer_text": "I suppose it depends on your perspective, or at least the perspective of the people of the time. Undoubtedly it brought great wealth to those who were in a position to exploit the opportunities. This gave advantage to the landowners and those with investment money. For the remainder it was a more nuanced picture. Traditional jobs became mechanised and far fewer manual labourers were required. This caused a movement of people from agricultural to urban settings, whereby the towns expanded to meet the needs of the increasing number of manufacturing enterprises. In this case the people were often in poor housing in their old life with limited income and short life expectancy. The move to overcrowded tenements in towns made for different problems but this was often associated with increasing income. On balance they were probably marginally better off when they arrived in their chosen industry. This last group were the largest and the fact that they themselves felt better off once settled is the primary reason why Marx’ and Engels’ prediction that the proletariat would first rise in revolution in England simply failed to be realised. The skilled artisan who was steadily being out produced by factories and mills were the worst off. Their income was generally reduced and often they had been forced to penury or labouring. Cottage industries could not compete. Those who fell into this group mostdefinitely did not benefit from the Industrial Revolution. There is an oft forgotten aspect of the Industrial Revolution that did provide great opportunities for those whose brain enabled them to organise and control. Managers had been almost unheard of prior to this period. Now a new middle class emerged, those who had skills to manage. They acquired better education, significantly increased their wealth and this group above all others found the Industrial Revolution was a life-changing opportunity and they benefitted greatly. ",
            "date": "Answered August 8, 2020",
            "views": "42",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Philip Talmage",
                    "user_href": "/profile/Philip-Talmage"
                },
                {
                    "user_id": "Gareth Adamson",
                    "user_href": "/profile/Gareth-Adamson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Brei",
                "href": "/profile/Nick-Brei"
            },
            "answer_text": "The Industrial Revolution was at the time and until recently, acknowledged as one of the greatest advances of mankind and it propelled Great Britain as a leader of the world. Then of course. It was undoubtedly also an inspiration to a relatively small part of the world. But later, as engineering and science developed it became a force that was unstoppable in its capacity to make a difference to global economies and in so doing to the working man and woman. But instead perhaps on reflection, the Industrial Revolution was the beginning of the end of an unpolluted evolutionary planet that had previously allowed the natural world to proceed alongside the human world in a smooth and gradual evolutionary combination without causing any serious problems. However, through contaminating the environment this has become ever more disastrous. Great progress was made in the past leading to vast wealth for a relatively few. Sometimes this was through genuine individual acumen and entrepreneurial ability, but often, it was through luck, or family and circumstance, and of having the good fortune of owning land in the right place for exploration of its mineral wealth and various other extenuating circumstances. Over time, this inevitably led to the establishment of capitalization dividing the nation into the asset speculators, who also were normally the employers of the poor or less well off; who were then - with a few notable and noble exceptions - used as virtually slave-wage labour. Expansion of profits and products taking priority over the importance of welfare and of a fair days wage for a fair days work. But then also, the quality of goods and services were important, and taking a certain pride in providing these elements were a vital part of the equation. Also the financial system was reasonably carefully regulated to prevent businesses and banks from taking unfair advantage Capitalism through the evolution of deregulation, and allowing free markets including stock markets to exponentially expand in a laissez-faire manner without effective supervision, has led to a wealth extracting secrecy of financial engineering and crime infested tax haven economics. This is a spider’s web of very many trillions of loose money, and described by Professor Ronen Palan of City University, one of the first academics to take tax havens seriously, as ‘a second British empire which is at the very core of global financial markets today.’ Criminals inevitably flock to libertarian, un-policed spaces for dealing in money. Laws have been carefully drafted to achieve maximum secrecy to enable the wealth extractors to keep their individual balance sheets off the record. But nevertheless it is still shown as a vast credit balance for the nation and accepted by neoliberal governments as a credible way of exhibiting the financial power and legitimacy of the country and specifically the prowess of government. But as for the Treasury seeing more than a few crumbs of the results of such vast interests? This is never going to happen! Which is evident from the miserly amount that is available to maintain the interests of the nation. PROFIT OVER PEOPLE is the mantra of neoliberal governments and particularly, all the extreme right wing Conservative administrations (certainly since Reagan and Thatcher). Profit is always privatized. But all expenses and business setbacks or incompetency are conveniently left to the individual to bare (even when they are told -at short notice they are redundant) or this, is then transferred through the specious tax system to the public purse. Inevitably this means, the mass and poorer section of society having to take the brunt of any downturn caused by such plutocratic based society via the capitalist system; the billionaire oligarchs and the multi millionaire asset- speculators in the first place, with their overriding need to suppress wages and continually extract debt to continue their opulent and unjustly privileged lifestyle. But through this perverted policy, the environment is being destroyed exponentially, along with the natural world of the planet, because their Money God of profit is the be-all-and-end-all of existence and the so-called free-markets - which are rather like a mafia based casino gambling economy and must be allowed to thrive. So much for \"We are all in this together!' It is time for a fresh approach before it is too late. As others have said; Liberty, Fraternity and Equality should be the mantra of society, but capitalism is a serious obstacle to this. For meritocracy is a philosophical fabrication as advocated by both the fundamental tenets of the few who really exploit capitalism to ensure the vast mass of the people are failures, and will remain failures to wage-slave for them, and so that they can dominate them for their own self-enrichment and self aggrandizement. Even though, in too many cases, the poorly remunerated wage-slaves are equally qualified. But also more often than not the only truly wealth producers maintaining the country through their honesty and declared taxes unlike the ‘few.’. For this is the corrupt system which currently predominates and is destroying basic democratic rights of the many and will continue to do so until there is a true RENAISSANCE of all our political and administrative systems, which are so abysmally failing the vast majority. Economically, politically and socially, the people must be integrated. There is currently far too much political distortion and dissembling. All employment should have: status, dignity, self-respect and the genuine ability to participate fully in society. Corporate capitalism distorts the truth of employment and the true wealth of the country. Corruptly buying back stock inflates the stock market, and quantitative easing and low interest rates manipulates actual capital worth. Government statistics are dangerously manipulated and supported by right-wing billionaire wealth-extractor proprietors who bankroll them to effectively place them in power. The Industrial Revolution saw the great age of steam, canals and factories which changed the face of the British economy forever in the 18th century and led to the emergence of what became the Capitalist Revolution.’ Early 18th century British industries were generally small scale and relatively unsophisticated. Most textile production, for example, was centred on small workshops or in the homes of spinners, weavers and dyers: a literal ‘cottage industry’ that involved thousands of individual manufacturers. Such small-scale production was also a feature of most other industries, with different regions specializing in different products: metal production in the Midlands, for example, and coal mining in the North-East. Because there were limited sources of power, industrial development during the early 1700s was initially slow. Textile mills, heavy machinery and the pumping of coal mines all depended heavily on old technologies of power: waterwheels, windmills and horsepower were usually the only sources available. Changes in steam technology, however, began to change the situation dramatically. As early as 1712 Thomas Newcomen first unveiled his steam-driven piston engine, which allowed the more efficient pumping of deep mines. Steam engines improved rapidly as the century advanced, and were put to greater and greater use. More efficient and powerful engines were employed in coalmines, textile mills and dozens of other heavy industries. By 1800 perhaps 2,000 steam engines were eventually at work in Britain. All this industrialization was stopped by spurious neoliberal politics and particularly since Thatcher and Reagan, and the unnatural deregulation. Ostensibly by their policies (agreeing to the abolition of the Glass-Steagall Act (1933) and the Bretton Woods Agreement (1944) as advocated by Thatcher and later other so-called leaders for this country. Britain has fundamentally changed into a much greater Americanized country, obsessed with money- grabbing, gambling, ‘whats in it for me attitude,’ untruthful and fraudulent personalities mostly interested in power, property and ever more possessions. leaving the mass of the population struggling and asphyxiating through increasing debt. The Industrial Revolution has through egregious greed by the corrupt financialization industry, developed into a world of only money and ever more corrupt profit. This is now turning in on itself, contaminating everything in an insatiable manner through pollution and detritus. Relentlessly devouring the welfare of the planet with seemingly uncontrollable climate change due to governments themselves being controlled by these dominant, corrupt wealth extraction forces. It has become a fraudulent global economic system creating unwanted, unsustainable consumer goods and services, - particularly the latter in Britain - replacing a country that was the proud instigator of what was and could have been a revolution for unimaginable good. But due to the inexorable greed of a relative few is sinking into a fetid swamp of disgrace. History in retrospect will possibly see it as one of the most dangerous and potentially cataclysmic times homo sapiens has ever faced, with little evidence to date, of this fundamentally changing. The Scientific Domesday clock (the worlds’ scientists official recorder) has recently gone from two minutes to MIDNIGHT down to 100 MINUTES and it is relentlessly progressing as we place profit over people over our planet….. Midnight is the point of ultimate extinction of the homo sapiens species! ",
            "date": "Answered August 7, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Salvatore Barrera",
                    "user_href": "/profile/Salvatore-Barrera"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamie Cawley",
                "href": "/profile/Jamie-Cawley-1"
            },
            "answer_text": "Yes. What is very little appreciated was how shit life was before the IR for poor folk. Every horror later commented on was there but few commented on it at the time: it was always and inevitable, so what’s to say? Later, as we moved into the Victorian period in North West Europe, it became clear that at least some of the horrors could be avoided and people campaigned for improvement. That’s why we become more aware of the problems. By the by, the term “Industrial Revolution’, created by French historians to contrast with the French Revolution and popularised in the 18sos in English by Arnold Toynbee is really misleading. Over a period of decades not only did industry change but so did: transport, finance, education, literature, sport and all aspects of life, due to the sustained economic boom. If we called the 18th century boom few people would ask your question. For details get my book : The Birth of Now https://www.amazon.co.uk/Birth-Now-Effect-Greatest-History/dp/1785891227 ",
            "date": "Answered August 7, 2020",
            "views": "86",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Philip Talmage",
                    "user_href": "/profile/Philip-Talmage"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Allum",
                "href": "/profile/Keith-Allum"
            },
            "answer_text": "By the numbers, no. The benefits of economic takeoff - as opposed to the technological revolution that drastically altered the economic landscape - were not evenly distributed, so the overall benefit flowed towards the monied middle class and away from the common people. The drastic changes that befell rural economies and home-based industries alike led to the involuntary abandonment of the countryside, the destruction of the rural economy driving incapable paupers to the workhouse and the able poor to relocate entire families to industrial towns and cities. The term revolution has a rather different connotation in societies where revolution is not automatically assumed to be an unalloyed blessing. In the sense the Industrial Revolution disrupted families, devastated communities, created refugee communities obliged to live in squalid conditions in what to modern eyes would seem to be forced labour terms, it was well named. It would take centuries for the benefits to trickle down from the decision-makers to the peasants who unwillingly were obliged to become arguably the first proletariat, and the resulting democratic deficient is still deep and abiding. It is therefore ironic to witness the active misdirection that plays out even today, that seeks to imply society's ills can be cured by eliminating the aristocracy. Given they have played no active part in this process from its earliest beginnings, setting up in their place financiers, industrialists, with a cadre of career politicians that act - in effect - as their fawning uncritical courtiers, seems to have been misguided at best. And at worse that we have been the slack-jawed, dull-eyed victims of a succession of increasingly ham-fisted illusionists. ",
            "date": "Answered August 8, 2020",
            "views": "64",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adam Daher",
                    "user_href": "/profile/Adam-Daher-1"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Musselman",
                "href": "/profile/Thomas-Musselman"
            },
            "answer_text": "Air pollution went up, and death rates in London did, too. But the people who moved there chose to believing London life was better, so we can’t say it was irrational. The enclosure movement was driving some of it rather than London being wonderful. Overall though in most ways you can measure life improved over time for survivors: cheaper clothes with more variety, more varied food, more varied entertainment, more personal freedoms. People tend to ignore the poverty and early deaths from the period before, e.g. farm accidents, rural oppression, and the like. ",
            "date": "Answered August 7, 2020",
            "views": "29",
            "upvotes": " Answer requested by Peter Kvint",
            "upvoters": [
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                },
                {
                    "user_id": "Peter Kvint",
                    "user_href": "/profile/Peter-Kvint-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike McGuire",
                "href": "/profile/Mike-McGuire-115"
            },
            "answer_text": "Not really for the poor and those who did not own much at that time, but for the investors and those with wealth or property then yes. The process created wealth, a little of it trickled down, perhaps its fair to say it improved the quality of life for the following generations and today we are all better for it. ",
            "date": "Answered August 8, 2020",
            "views": "26",
            "upvotes": " Answer requested by Peter Kvint",
            "upvoters": [
                {
                    "user_id": "Adam Daher",
                    "user_href": "/profile/Adam-Daher-1"
                },
                {
                    "user_id": "Kathryn Berck",
                    "user_href": "/profile/Kathryn-Berck-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Kvint",
                "href": "/profile/Peter-Kvint-1"
            },
            "answer_text": "No. The poor peasants lost their handicrafts and beekeeping. They revolted and burned the machines. The uprising was put down with the new industrially manufactured weapons. Without a livelihood, they fled to the cities where they had to live on what they could steal. The many poor criminals were then sent to the colonies as slaves. Only 200 years later in the Battle of the Somme 1 July 1916 - 18 November 1916 did the poor get revenge when the young English nobles advanced to the German positions and were killed by the industrially manufactured machine guns. ",
            "date": "Answered August 7, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ludwig Nijholt",
                "href": "/profile/Ludwig-Nijholt"
            },
            "answer_text": "No. Initially the industrial revolution increased poverty. In fact, average wages didn’t really improve until late in the 19th century - over one hundred years after the revolution began. (As Eric Hobsbawm points out in his The Age of Revolution, in 1815 French peasants were probably better off than their British counterparts.) ",
            "date": "Answered August 8, 2020",
            "views": "24",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Bob Hunter",
                "href": "/profile/Bob-Hunter-61"
            },
            "answer_text": "What do you think? Would you rather live now, with decent sanitation, electric power and light, television, telephone and cheap imported food. Or would you rather live by smokey tallow rush light, where the most advanced medical thought was to stab you with a knife and let you bleed the ill humours out ",
            "date": "Answered August 8, 2020",
            "views": "28",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Nigel Readings",
                "href": "/profile/Nigel-Readings-1"
            },
            "answer_text": "Of course it did hugely particularly if you were in a strong position you became wealthier, if you were not our benefits were fewer. ",
            "date": "Answered August 7, 2020",
            "views": "18",
            "upvotes": " Answer requested by Peter Kvint"
        },
        {
            "author_info": {
                "name": "Barry Davies",
                "href": "/profile/Barry-Davies-11"
            },
            "answer_text": "It has improved life throughout the world. It wasn’t always good for the workers at the time though. ",
            "date": "Answered August 8, 2020",
            "views": "73",
            "upvotes": "0"
        }
    ]
}