{
    "title": "Did the Dark Ages happen? - Quora",
    "tags": [
        "Dark Ages (historical era)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Emra",
                "href": "/profile/Michael-Emra"
            },
            "answer_text": "Yes! (and no!), allow me to explain. The 'Dark Ages' refers to the 5th and 6th centuries in Britain, the period after the fall of the Roman Empire and the migration of saxons from continental Europe; the Early Medieval period. 'Dark Ages' has fallen out of favor as a description for this period, the Post or Sub Roman is preferred So why was it called the Dark Ages? Because for a long time we knew very little about what was going on. Written sources are few and far between, and often have the added problem of being transduced into myths and legends - that is to say they're not contemporary, but often written centuries after the fact.  The archaeological record is also not terribly illuminating, and until relatively recently not much concerted work was done on understanding it, because it's seen as not being very interesting. It is, in fact, very interesting, and we're starting to understand that. Note that I am by no means an authority on the post-roman period, but I can at least offer a broad canvas of what went on. So, at the end of the Roman Empire in Britain, Christianity was the official religion. This is countered by an upswing in the old ways of the cult, the so-called Pagan Revival, where old shrines were refurbished and put back into use. One supposition is that this is a reaction by the Roman 'old money', who try to re-enforce their dwindling significance by harking back to the old ways. The old narrative was that the Roman Empire falls in the 4th century CE. Centralised government and taxation disappears practically overnight. Britain is devastated, towns and cities depopulated and abandoned, plague ravages the last. For two-hundred years virtually nothing of interest happens. People don't make things, they don't build things, they leave almost no traces of what went on. The narrative that is now emerging is more complicated. People did try and hang on to the Roman structures of governance, rival and competing factions form administrative districts and kingdoms all over England. There is compelling evidence that the legend of King Arthur is based off of one such individual, the former military leader Arthurius, who carved out his own kingdom in this time. Roman occupation wasn't successful because of cultural dominance, but hybridisation. The post-roman period can be seen as a return to the way of life that predominated before the Roman invasion; dispersed, rural settlement, with trade and commerce situated in reoccupied hillforts rather than the planned towns and cities that characterise the Roman period. This perhaps explains the 'Dark Earth Horizon', found in London and elsewhere, which is a thick, rich agricultural soil post-dating the end of the Roman Empire and pre-dating the Anglo-Saxons. Structures were typically built of wood and earth, not stone, although there is evidence of Roman ruins being re-purposed as granaries and barns. Technological complexity is seen to diminish - pottery is of lesser quality, metalwork less elaborate, and less of it is found. There is also mounting evidence that small-scale settlement by continental Europeans, bringing their own technologies and ways of life, was occurring long before the Anglo-Saxon period. I recently worked on a Roman Villa site in the south of England. There we found compelling evidence for post-roman re-use of the site after it had been systematically dismantled - new beams inserted into old buildings using the rubble left behind. What they were using it for I couldn't say. So, did the withdrawal of the Empire reduce the people still living in Britain to virtual savages - without the knowledge of how to build and maintain stone buildings? Craft fine pottery and jewelry? Maybe. A more nuanced suggestion is that leaving behind the 'Roman' was of doing things is a choice, made by individuals capable of making decisions. That, as with the Roman upper-class and their return old pagan ways when faced with the crisis of Christianity, the post-roman proliferation of rival kingdoms, adopted simpler lifestyles in the name of forging and re-enforcing their new identity as Not-Romans. As more light is shone on this period, and more sites are found and studied, time may well tell all. ",
            "date": "Answered March 28, 2016",
            "views": "761",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brandon Parry",
                    "user_href": "/profile/Brandon-Parry-8"
                },
                {
                    "user_id": "Ксюша Измалкова",
                    "user_href": "/profile/Ксюша-Измалкова"
                },
                {
                    "user_id": "Jay Wacker",
                    "user_href": "/profile/Jay-Wacker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Riggsby",
                "href": "/profile/Matt-Riggsby"
            },
            "answer_text": "Sort of. The idea of a “dark age” is a slander by writers of the Renaissance against the Middle Ages in general, but more recent scholarship has been pushing back against that idea hard. As early as the Victorians, it was well established that the later Middle Ages were a period largely characterized by increasing intellectual activity, economic development, and political stability, not the period of ignorance and superstition suggested by the phrase “dark age.” That phrase was at the time limited to the first few centuries after the collapse of the Roman empire in the west, often up to the time of Charlemagne. And even that idea has been under attack. While nobody would characterize that period as being particularly good, it’s becoming increasingly clear that despite economic depression and political fragmentation, literate traditions and intellectual activity did carry on. Not a great time, but not really inherently “dark” either, and a lot of that darkness comes from our own lack of information. We’ve got growing lists of written works which we know existed but are lost to us today. It’s reached the point where many historians recommend discarding the idea altogether, and it’s mostly retained as a familiar label, shorthand for the early Middle Ages, rather than a serious description. ",
            "date": "Answered May 2, 2019",
            "views": "758",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Mounser",
                    "user_href": "/profile/Jack-Mounser"
                },
                {
                    "user_id": "David Akers",
                    "user_href": "/profile/David-Akers-15"
                },
                {
                    "user_id": "Deepak S Fernandes",
                    "user_href": "/profile/Deepak-S-Fernandes"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "David Gouldstone",
                    "user_href": "/profile/David-Gouldstone"
                },
                {
                    "user_id": "Daryl Hubber",
                    "user_href": "/profile/Daryl-Hubber"
                },
                {
                    "user_id": "Spencer Alexander McDaniel",
                    "user_href": "/profile/Spencer-Alexander-McDaniel"
                },
                {
                    "user_id": "Jamarian Cleveland",
                    "user_href": "/profile/Jamarian-Cleveland-2"
                },
                {
                    "user_id": "Raphaël du Sablon",
                    "user_href": "/profile/Raphaël-du-Sablon"
                },
                {
                    "user_id": "Simon Davis",
                    "user_href": "/profile/Simon-Davis-14"
                },
                {
                    "user_id": "Dennis Klickermann",
                    "user_href": "/profile/Dennis-Klickermann"
                },
                {
                    "user_id": "Karim Avram",
                    "user_href": "/profile/Karim-Avram"
                },
                {
                    "user_id": "Antti Kouhi",
                    "user_href": "/profile/Antti-Kouhi"
                },
                {
                    "user_id": "Sean Markham",
                    "user_href": "/profile/Sean-Markham-2"
                },
                {
                    "user_id": "Ashutosh Mehndiratta",
                    "user_href": "/profile/Ashutosh-Mehndiratta"
                },
                {
                    "user_id": "Peter Knutsen",
                    "user_href": "/profile/Peter-Knutsen-1"
                },
                {
                    "user_id": "Paul Adam",
                    "user_href": "/profile/Paul-Adam-27"
                },
                {
                    "user_id": "Nathan Yang (楊立慶)",
                    "user_href": "/profile/Nathan-Yang-楊立慶"
                },
                {
                    "user_id": "Matthew Nghiem",
                    "user_href": "/profile/Matthew-Nghiem"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suede Tyler",
                "href": "/profile/Suede-Tyler"
            },
            "answer_text": "IF you’re referring to a time when disease was rampant and people were doing basically whatever they want than yes. During the middle ages disease was untreated and rape, murder, robbbery, pillaging, war, famine, death were so vast humans almost died in that region. However someone things got better and now we’re here on the brink of another dark age ironic isnt it ? ",
            "date": "Answered December 27, 2017",
            "views": "131",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Rose",
                "href": "/profile/Alan-Rose-11"
            },
            "answer_text": "Perhaps you are referring to the rather interesting but ultimately bonkers theory that the Dark Ages were invented by the Holy Roman Emperor, and the years 614 to 911 didn’t actually happen. Phantom time hypothesis - Wikipedia I must say that compared to some of the other conspiracy theories, and perhaps because I like a bit of history, I really like this one. Of course if you look at the evidence it can’t be true, but that’s the case of most conspiracy theories and people still believe them! I guess it’s because it’s so subtle; no dead princesses, no moon, no aliens… yet if you think about it, it is completely mindblowing. ",
            "date": "Answered September 1, 2017",
            "views": "481",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Holman",
                    "user_href": "/profile/Paul-Holman-4"
                },
                {
                    "user_id": "Mike Mattock",
                    "user_href": "/profile/Mike-Mattock-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Osmo Ronkanen",
                "href": "/profile/Osmo-Ronkanen-1"
            },
            "answer_text": "Not really but many people just think them in the wrong era. Dark ages were the first centuries after the collapse of Rome in around 500–800, at most 500–1000. When people hear of middle ages they typically think of 1000–1500 then they associate dark ages to that. ",
            "date": "Answered May 2, 2019",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deepak S Fernandes",
                    "user_href": "/profile/Deepak-S-Fernandes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Cramer",
                "href": "/profile/Will-Cramer-2"
            },
            "answer_text": "The Dark Ages are now referred to as the Middle Ages, or Medieval Period. It seem that the term Dark Ages were the authorship of prejudiced Protestant historians, at least this what I understand. The early Middle Ages were from 500 to 1000 AD, the High Middle Ages was from 100 to 1300, and the Late Middle Ages are from 1300 to 1500. Now also during the same time period is the Renaissance from 1300 to 1600 was occurring. ",
            "date": "Answered June 30, 2019",
            "views": "88",
            "upvotes": " Answer requested by Ramesh Chandran",
            "upvoters": [
                {
                    "user_id": "Uma Priyadarsi",
                    "user_href": "/profile/Uma-Priyadarsi"
                },
                {
                    "user_id": "Gísli Magnússon",
                    "user_href": "/profile/Gísli-Magnússon-2"
                },
                {
                    "user_id": "Chuck Garen",
                    "user_href": "/profile/Chuck-Garen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gwydion Madawc Williams",
                "href": "/profile/Gwydion-Madawc-Williams"
            },
            "answer_text": "Western Europe had far less written records between the fall of Rome and the 11th or 12th centuries. A generally lower level of culture, but better agriculture. Shrunken cities and a loss of learning. Elsewhere in the world, there was much more continuity and gaps in different eras. ",
            "date": "Answered December 27, 2017",
            "views": "294",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kent Adsuara",
                    "user_href": "/profile/Kent-Adsuara"
                }
            ]
        },
        {
            "author_info": {
                "name": "S. Patrick Maiorca",
                "href": "/profile/S-Patrick-Maiorca"
            },
            "answer_text": "The term Dark Ages was coined by a Medival scholar named Petrarch to denote the lack of documents in the period following the fall of the Roman Empire. The term Dark Ages like the Hellenistic Dark Ages is used to denote other periods where there has been a decline in written records and writing. The period that Petrarch called the Dark Ages is often called the Early Middle Ages. ",
            "date": "Answered March 16, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Fares Gafaf",
                "href": "/profile/Fares-Gafaf"
            },
            "answer_text": "A rather misleading term. ",
            "date": "Answered March 16, 2020",
            "views": "82",
            "upvotes": "0"
        }
    ]
}