{
    "title": "Do Japanese consider themselves white? - Quora",
    "tags": [
        "Culture of Japan",
        "White People",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Svanfridur Mura",
                "href": "/profile/Svanfridur-Mura"
            },
            "answer_text": "I can’t speak for most Japanese people, but it depends on what you mean by white. In the West, ‘white’ usually means European, so Japanese people living in the West or influenced by it probably don’t. However, if you just use ‘white’ to describe skin color then I suppose you could say SOME Japanese people are ‘white’ (though it should be made clear that ‘white’ is not a race, just a description of skin complexion with a lot of heavy baggage); I don’t know how many Japanese people think like this though. My dad is half “white” European and half Japanese (and his side of the family is obviously Japanese), and he considers himself ‘brown’, because he has dark hair and darker skin. However, this is a minority of Japanese people, and a lot of people don’t recognize him as Japanese, thinking instead he’s hispanic or, when he had very long hair, Native American. A lot of his family have darker skin than most Japanese people, as well as facial hair, and this give my dad kinda a vague look that when he travels often makes people (especially, usually, white tourists) assume he’s a local, no matter where he is if it’s outside of the West. We’re not really sure why our family differs from the Japanese norm, but the running theory is that they’re descendant from the Ainu people who once lived throughout Japan but were displaced when the modern Japanese people settled the islands. So, basically is what I’m saying, not all Japanese people are even pale enough to be considered ‘white’, no matter your metric, and I know my US-Japanese family would balk at ever being called white. ",
            "date": "Answered August 7, 2020",
            "views": "206",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matyu Thm",
                "href": "/profile/Matyu-Thm"
            },
            "answer_text": "Interesting question. Some Japanese do,some don't. It would be easier to answer “Are Japanese actually white?”. And even then it would depend on definition of race. Some people like I, consider race only skin color. In that case, yes they are white. Many people, however consider race mixture of skin color, hair color and eye color. Europeans ( and most of Americans ) have brown or blond hair and blue,green or brown eyes. Japanese have black hair and black eyes. In that case they wouldn't be considered white.  They eyes are actually not as small as people think as you can see. ",
            "date": "Answered May 29, 2019",
            "views": "3",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Logan",
                    "user_href": "/profile/Mike-Logan-79"
                },
                {
                    "user_id": "Michi Nakayama",
                    "user_href": "/profile/Michi-Nakayama"
                },
                {
                    "user_id": "Aboo Jameel",
                    "user_href": "/profile/Aboo-Jameel"
                },
                {
                    "user_id": "Raja Singh",
                    "user_href": "/profile/Raja-Singh-1354"
                },
                {
                    "user_id": "Ray Ku",
                    "user_href": "/profile/Ray-Ku"
                },
                {
                    "user_id": "Eita Murakami",
                    "user_href": "/profile/Eita-Murakami"
                },
                {
                    "user_id": "Nizam Abu Bakar",
                    "user_href": "/profile/Nizam-Abu-Bakar"
                },
                {
                    "user_id": "Yoon Kok Keong",
                    "user_href": "/profile/Yoon-Kok-Keong"
                },
                {
                    "user_id": "Jerry Mc Kenna",
                    "user_href": "/profile/Jerry-Mc-Kenna"
                },
                {
                    "user_id": "Erika Butler",
                    "user_href": "/profile/Erika-Butler-バトラー-エリカ"
                },
                {
                    "user_id": "Neil Christian Molde",
                    "user_href": "/profile/Neil-Christian-Molde"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Roseman",
                "href": "/profile/Mark-Roseman-5"
            },
            "answer_text": "In the U.S., for purposes of racial classification, they are considered Asian. That said, during WW 2, Japanese Americans drafted into the Army had to be classified as either White or Black, and they were designated as White. ",
            "date": "Answered August 26, 2020",
            "views": "108",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Predrag Maksimovich",
                    "user_href": "/profile/Predrag-Maksimovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gloria Cole",
                "href": "/profile/Gloria-Cole-1"
            },
            "answer_text": "Skin color is neither an adequate nor appropriate way to classify a naturally occurring group of people. Biological Aspects of Race The Japanese are a nation, an ethnicity, a culture, but they are not a biological race. ",
            "date": "Answered November 14, 2018",
            "views": "695",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aboo Jameel",
                    "user_href": "/profile/Aboo-Jameel"
                }
            ]
        }
    ]
}