{
    "title": "Do Muslims believe in reincarnation? - Quora",
    "tags": [
        "Rebirth",
        "Reincarnation",
        "Belief and Beliefs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Morteza Karimi",
                "href": "/profile/Morteza-Karimi"
            },
            "answer_text": "No. It is a false idea. Islam clearly refutes the notion of the soul returning to this world in the form of another person or a different living creature, to obtain what is needed to reside alongside the other purified souls. In line with this the Quran says: \"Until, when death comes to one of them (those who join partners with Allâh), he says: \"My Lord! Send me back, \"So that I may do good in that which I have left behind!\" No! It is but a word that he speaks, and behind them is Barzakh (a barrier) until the Day when they will be resurrected\"[1]. Whereas, according to the theory of reincarnation the Day of Judgment, Heaven, Hell, the reward and punishment of the hereafter all and all, lose their true position and meaning; for they perceive that almost every human is subsequently sent back after death to this world to face the results of their acts. This is completely in contradiction with the teachings of the divine prophets and the fundamental beliefs of Islam and has been considered as kufr by Shia Imams. Ma’mun once said to Imam Reza: “What's your opinion about those who believe in reincarnation?” The Imam replied: \"One who believes in reincarnation has denied God Almighty and has claimed Heaven and Hell to be unreal.”[2] Similarly, Imam Sadiq (A.S.) also says: \"They suppose that both Heaven and Hell do not exist, nor will resurrection happen and in their view resurrection is nothing but transferring from one body and structure to another. If the soul was a righteous one while in the former body it will return in a better and superior structure at the highest level imaginable in this world, but if it was corrupt and ignorant, it will return in the form of four legged animals that are used for hauling things which live in pain and hardship or in the form of a small ugly looking bird that flies at night and and likes the graveyard and finds peace there\".[3] Of course, one must be aware that not only is the idea of reincarnation in contradiction with the teachings of the prophets and is considered to be kufr and denying resurrection and otherworldly reward and punishment of the hereafter, it is also known to be an unsubstantial theory in the eyes of scholars and philosophers which have presented several faults regarding the matter. The famous philosopher, Sadrul Mutaahhilin (Mullah Sadra) says: \"…the nafs, in its first level of being brought to existence, stands at the level of nature. Then in proportion to its materialistic motion towards perfection, the nafs evolves all the way through being a plant and an animal to being a human. And if the nafs, at any level fulfills its potential (quwwah), even in the most subtle amount, it is impossible for this actuality (fi’liyyah) to regress back into pure potentiality once more. In addition to this, as was said before, the matter (maddah) and form (surah) are a united entity that bears the two aspects of actuality and potential, that take on the path of evolution together, advancing and developing at any point and chance possible, therefore, it is impossible for a soul that has passed the vegetative or animate level to attach to a form of sperm or fetus (be reincarnated in these forms).\"[4] The second flaw in this theory is that how can we claim the oneness of an entity in which hypothetically exists in two different times? Throughout our lives, every single one of us has put behind various stages consisting of diverse physical and psychological traits, but what brings all of these diversities together are links that we call our memories; it is these memories that allow us to call each of us one person, despite all the diversity we experience in our lives. But this can't be said if we believe in reincarnation. How does reincarnation explain the oneness of a person in one life with the person in another life if they have nothing in common, not even memories (because reincarnation says that when one transmigrates into another body, in almost all cases, it forgets all its memories). The physical body cannot be an explanation for unity either because the theory claims that one might return as a woman or a man, a human or an animal, so the two don’t share anything, neither memories, nor the same body. Likewise, psychological similarities also would not help since in that case whichever two people with the same psychological traits would therefore be one, which is obviously an absurd thing to say. In other words, the objection can be put this way; how much psychological similarity is needed in order to determine the unity of two people? Hence we can deduce that the extension of one entity through two separate times is logically unacceptable.[5] [1]Mu’minun:99-100. 2]Safinatul-Bihar, under the term نسخ [3]Ihtijaj Tabarsi, vol. 2, pg. 89. [4]Shawahidul-Rububiyyah, pg. 161. [5]Ma’arefe Eslami, pg. 175. Source: What is Islam's viewpoint regarding reincarnation?‎ ",
            "date": "Answered April 8, 2017",
            "views": "33",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emerald Fusion",
                    "user_href": "/profile/Emerald-Fusion-1"
                },
                {
                    "user_id": "Kolawole Salami",
                    "user_href": "/profile/Kolawole-Salami"
                },
                {
                    "user_id": "Riha Chowdhury",
                    "user_href": "/profile/Riha-Chowdhury"
                },
                {
                    "user_id": "Md Md",
                    "user_href": "/profile/Md-Md-206"
                },
                {
                    "user_id": "Abeer Mobarez",
                    "user_href": "/profile/Abeer-Mobarez"
                },
                {
                    "user_id": "Seyed Jafar Mahmoudi",
                    "user_href": "/profile/Seyed-Jafar-Mahmoudi"
                },
                {
                    "user_id": "Mary A. Daniels",
                    "user_href": "/profile/Mary-A-Daniels"
                },
                {
                    "user_id": "Hossein Maeen",
                    "user_href": "/profile/Hossein-Maeen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sathya Sathesh",
                "href": "/profile/Sathya-Sathesh"
            },
            "answer_text": "\"Surely this is a reward for you, and your striving shall be recompensed.\" [76:22]  The reward can be in this life or the next life but isn't the same as the concepts found in Eastern Religions. \"Indeed, Allah does not do injustice, [even] as much as an atom's weight; while if there is a good deed, He multiplies it and gives from Himself a great reward.\" [4:40] Philosophy alone cannot guarantee the truth because it does not produce certainty. The truth, consequently, can only be attained by using independent research methods and keeping aside the uncertified traditional practice. Inserting own ideas and metaphorical philosophy in the interpretation of The Quran is out of the question and not needed.  And indeed, We have eased The Quran in your tongue that they might be reminded (44:58). It is indisputable that some Muslims strongly embrace and believe in the cycle of rebirth. Such Muslims support their claim with Quran 56:61. We have decreed death among you, and We are not to be outdone (56:60) In that We will change your likenesses and produce you in that form which you do not know (56:61). Similarly, whereas the majority of exponents of rebirth affirm that rebirth occurs in the human body, others who are in minority opine that it may occur also in other living creatures such as insects, animals, fish and plants. Generally speaking, the rationale for rebirth varies from one traditional society to another as well as from traditional metaphysical viewpoint to religious metaphysics. About one-third of Europeans who believe in 'scientific' rebirth affirm that it guarantees a new positive occasion for achievement since one life is too short; that it gives room for one to correct the mistakes of the previous existence and thus serves as an antidote to the crisis of life. Plato (if such a person even existed) wrote in his Phaedrus that \"ten thousand years must elapse before the soul of each one can return to the place from where she came. Only the soul of the righteous persons can get back to its original state in less time\". Interestingly, Plato's remark presupposes that it takes a righteous soul lesser time to cease from rebirth and vice versa. More importantly, various cues have been advanced by exponents of rebirths as proof for it. These are deformity at birth or birthmarks and manifestation of some skills or qualities deemed possessed by the ancestral parents such as memory transfer, family resemblance and behavioral pattern. Man is a bi-component creature. His origin is clay (for Adam) and water (i.e. semen; for Adam's progenies). In the process of creation, God breathed His Spirit into Adam. (15: 29, 32: 7-9, 38: 72) Although majority of scholars have conceptualized Ruh as soul and even interpreted it in the various verses of The Quran where it appears as \"angel Gabriel\", Jibreel (not angel), Isa (\"Jesus\"), an angel of immense size, revelation, Quran and human soul among others. A careful study of the verses of The Quran on Nafs and Ruh reveals that God uses in respect of each three connotations. Nafs is used to connote physical body (a human being), a spirit, and a man's psyche (mind). Death: Death is the separation of the soul from the body which is an irreversible cessation of life in any appointed term. As soon as the soul is separated from the body, man is dead. Death is an inevitable phenomenon, of which the exact time is not only unpredictable but also is beyond human control. It is a debt which every person must pay. Ghazali (if he existed) and Iqbal perceive death as a transformation from one state to another. God says death is certain and that every person and living soul must experience it. (3:185, 21:35) God has predetermined the life span of every living soul. It is He who created you from clay and then decreed a term and a specified time [known] to Him; then [still] you are in dispute. (6:2) And it is not [possible] for one to die except by permission of God at a decree determined. And whoever desires the reward of this world - We will give him thereof; and whoever desires the reward of the Hereafter - We will give him thereof. And we will reward the grateful. (3:145) More importantly, it is worth mentioning that it is not only a man's life span that is predetermined but also the place and time of death as well as the nature of his death, as evident in this verse: Indeed, God [alone] has knowledge of the Hour and sends down the rain and knows what is in the wombs. And no soul perceives what it will earn tomorrow, and no soul perceives in what land it will die. Indeed, God is Knowing and Acquainted. (31:34) Meanwhile, it should be noted that death occurs once on righteous people. God says in a clear, unambiguous term: \"They will not taste death therein except the first death, and He will have protected them from the punishment of Hellfire.\" (44:56) Then, are we not to die (37:58) Except for our first death, and we will not be punished? (37:59). Essentially, this order of 'First Death' is for the righteous and their companions only. Non-believers and those who are not righteous do not come under this category because single death is conditional and will be given to those who will not be punished. Please also see the following verses: When the angels said, \"O Mary, indeed God gives you good tidings of a word from Him, whose name will be the Messiah, Isa, the son of Maryam - distinguished in this world and the Hereafter and among those brought near. (3:45) And whoever obeys God and the Messenger - those will be with the ones upon whom God has bestowed favor of the prophets, the steadfast affirmers of truth, the martyrs and the righteous. And excellent are those as companions. (4:69) And if the deceased was of those brought near to God (56:88) And if he was of the companions of the right (56:90) Then [for him is] rest and bounty and a garden of pleasure (56:89) Indeed, this is the great attainment. (37:60) Those who do not fit in the desired criteria, they will be given a task of 'example work' on the Earth to attain the required level of the deeds to enter the paradise. For the like of this let the workers [on earth] work. (37:61) Those who will not progress to enter paradise, they will be punished according to their deeds and returned back to Earth in new bodies (Resurrection) for another appointed time. If they attain the status of a righteous person by their good deeds they will enter paradise upon their death. If not then they will be sent back to the world until they attain the desired level of progress into paradise. The Quran has mentioned three categories of people in respect of accountability. And you become [of] three kinds. (56:7) These categories are mentioned in The Quran again and again and I have also briefly explained in the above paragraphs. People who are close to God (Prophets, their companions and martyrs may fall in this category) Righteous people Non-believers and wrong doers. People who belong to the 1st and 2nd categories may progress to the next life in paradise after their First Death. However, people in the 3rd category will be sent back (reborn) to the world for a further appointed term (age) as a punishment which will be given according to their deeds and of course in accordance with the natural laws of 'cause and effect'. The Quran clearly says that they have ignited this fire by their own doing in which they will dwell. Is it you who makes it grow, or are We the grower? (56:64) And have you seen that which you sow? (56:63) And have you seen the fire that you ignite? (56:71) But if he was of the deniers [who were] astray, (56:92) And burning in Hellfire (56:94). Rebirth Cycle is mentioned by 'every time changing their skins (bodies)': Indeed, those who disbelieve in Our proofs/signs - We will drive them into a Fire. Every time their skins are roasted through We will replace them with other skins so they may taste the punishment. Indeed, God is ever Exalted in Might and Wise. (4:56) Now, The Quran explains about the wrongdoer's physical remand and sentence which is only possible if they will be reborn and sent back to the world in a physical form. And the companions of the left - what are the companions of the left? (56:41) [They will be] in scorching fire and scalding water (56:42) And a shade of black smoke, (56:43) Neither cool nor beneficial. (56:44) Past Life is referred to in the following verses: Indeed they were, before that, indulging in affluence, (56:45) And they used to persist in the great violation, (56:46) And they used to say, \"When we die and become dust and bones, are we indeed to be resurrected? (56:47) But when We removed the punishment from them until a term which they were to reach, then at once they broke their word. (7:135) PUNISHMENT IN THE NEXT WORLDLY LIFE WILL NOT END HERE, IT MAY BE EXTENDED TO CHANGING THEIR FORM ACCORDING TO THE SEVERITY OF THEIR WRONG DOINGS. In that We will change your likenesses and produce you in that form which you do not know (56:61). And you had already known about those who transgressed among you concerning the Sabt, and We said to them, \"Be apes, despised.\" (2:65) I can understand your feelings very well, because this post is clashing with our current belief but unfortunately this is the bitter truth whether we accept it or not. However, this is a crucial and essential part of our belief to believe in the 'last day of judgment' in the same way as it is written in The Quran. We have left traditional books of hadith due to the fact that they do not match with what is written in The Quran but we are not ready to change our orthodox thoughts which are indeed inspired by the same obsolete books and man-made philosophy. I'm writing all this after extensive research and within the course of my research, I have thought much about the 'for' and 'against' arguments. I'm willing to have a debate/discussion about this with anyone on Facebook or Skype call. Even if we put the Quranic verses aside, I can give a thousand logical reasons why the traditional \"only one life and then heaven/hell forever\" theory is absolutely unjust and makes no sense! For my forthcoming posts, I have gathered more useful information and materials to go into further depth which I will put into logical words in the light of The Quran. Please just keep an open mind while reading them. (I don't like to use the word \"prophet\" since I know that is not the correct translation of the word 'Nabi', but we'll just go with the traditional translations for now) ",
            "date": "Answered October 4, 2019",
            "views": "722",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Md Md",
                    "user_href": "/profile/Md-Md-206"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abdul Syed",
                "href": "/profile/Abdul-Syed-88"
            },
            "answer_text": "Reincarnation is the religious or philosophical concept that the soul or spirit, after biological death, begins a new life in a new body that may be human, animal or spiritual depending on the moral quality of the previous life's actions. One of the primary beliefs of Islam is the belief in the Hereafter, resurrection, the Paradise and the Hell. Allah says (interpretation of the meaning]: “Everyone shall taste death. Then unto Us you shall be returned”[ al-‘Ankaboot 29:57 ] And He says (interpretation of meaning): “To Him is the return of all of you. The Promise of Allah is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve” [ Yunus 10:4 ] He also says [interpretation of the meaning]: Verily, He knows each one of them, and has counted them a full counting. And everyone of them will come to Him alone on the Day of Resurrection (without any helper, or protector or defender)” [ Maryam 19:94-95 ] And He says (interpretation of the meaning): “Allaah! Laa ilaaha illa Huwa (none has the right to be worshipped but He). Surely, He will gather you together on the Day of Resurrection about which there is no doubt” [ al-Nisa’ 4:87 ] And He says concerning the disbelievers who think they will not be resurrected (interpretation of the meaning): “The disbelievers pretend that they will never be resurrected (for the Account). Say (O Muhammad): Yes! By my Lord, you will certainly be resurrected, then you will be informed of (and recompensed for) what you did; and that is easy for Allah” [ al-Taghaabun 64:7 ] Allah says refuting those who claim reincarnation (interpretation of the meaning): Do they not see how many of the generations We have destroyed before them Verily, they will not return to them. [ Ya-Sin 36:31 ] Which means “do you not learn a lesson from those nations whom Allah destroyed before you of those who disbelieved in the Messengers. They came to this world only once, and will not return to it.\" There are several hadeeth as well which mention and confirm resurrection. For example: The Prophet (peace and blessings of Allah be upon him) said: “In man there is a bone which will not be consumed by the earth, and from it he will be regenerated on the Day of Resurrection.” They asked, “What bone is that, O Messenger of Allah?” He said, “The tailbone.” (Narrated by Muslim, 5255). The idea of reincarnation is rejection and denial of resurrection and hereafter and it has been refuted by texts of Islam. ",
            "date": "Answered October 21, 2018",
            "views": "840",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Md Md",
                    "user_href": "/profile/Md-Md-206"
                },
                {
                    "user_id": "Anup Singh",
                    "user_href": "/profile/Anup-Singh-179"
                },
                {
                    "user_id": "Mohammad Sohel Karim",
                    "user_href": "/profile/Mohammad-Sohel-Karim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abu abdAllah Yusef",
                "href": "/profile/Abu-abdAllah-Yusef"
            },
            "answer_text": "Praise be to Allaah. What is meant by reincarnation or the transmigration of souls is that when the body dies, the soul moves to another body, where it will be happy or miserable as the result of its previous actions, and thus it moves from one body to another. This is one of the falsest of false beliefs, and one of the worst forms of kufr or disbelief in Allaah, His Books and His Messengers. For belief in the Hereafter, the Reckoning, Paradise and Hell are among the things that are well-known in the teachings of the Messengers and in the words of the Books which were revealed to them. Belief in reincarnation is tantamount to disbelief in all of that. The Islamic understanding of the Resurrection is stated clearly in the Book of Allaah and the Sunnah of His Messenger (peace and blessings of Allaah be upon him). For example, Allaah says (interpretation of the meaning]: “Everyone shall taste death. Then unto Us you shall be returned” [al-‘Ankaboot 29:57] “To Him is the return of all of you. The Promise of Allaah is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve” [Yoonus 10:4] “The Day We shall gather the Muttaqoon (the pious) unto the Most Gracious (Allaah), like a delegation (presented before a king for honour). And We shall drive the Mujrimoon (polytheists, sinners, criminals, disbelievers in the Oneness of Allaah) to Hell, in a thirsty state (like a thirsty herd driven down to water)” [Maryam 19:85-86] “Verily, He knows each one of them, and has counted them a full counting. And everyone of them will come to Him alone on the Day of Resurrection (without any helper, or protector or defender)” [Maryam 19:94-95] “Allaah! Laa ilaaha illa Huwa (none has the right to be worshipped but He). Surely, He will gather you together on the Day of Resurrection about which there is no doubt” [al-Nisa’ 4:87] “The disbelievers pretend that they will never be resurrected (for the Account). Say (O Muhammad): Yes! By my Lord, you will certainly be resurrected, then you will be informed of (and recompensed for) what you did; and that is easy for Allaah” [al-Taghaabun 64:7] And there are other clear and unambiguous verses. There are innumerable references in the Sunnah which mention and confirm the Resurrection, and give details concerning it. For example, the Prophet (peace and blessings of Allaah be upon him) said: “You will be resurrected barefoot, naked and uncircumcised.” Then he recited (interpretation of the meaning): “As We began the first creation, We shall repeat it. (It is) a promise binding upon Us. Truly, We shall do it” [al-Anbiya’ 21:104]. (Then he said:) “And the first one to be clothed on the Day of Resurrection will be Ibraaheem…” (Narrated by al-Bukhaari, 3100; Muslim, 5104). And the Prophet (peace and blessings of Allaah be upon him) said: “In man there is a bone which will not be consumed by the earth, and from it he will be regenerated on the Day of Resurrection.” They asked, “What bone is that, O Messenger of Allaah?” He said, “The tailbone.” (Narrated by Muslim, 5255). And he said: “The sun will be brought close to mankind on the Day of Resurrection until it will be as close to them as a meel.” Saleem ibn ‘Aamir [one of the narrators of this hadeeth] said: “By Allaah, I do not know whether by meel he meant a distance on land (a mile) or the stick with which kohl is applied to the eyes. The Prophet (peace and blessings of Allaah be upon him) said: “Then the people will be submerged in sweat according to their deeds; some with be in sweat up to their ankles, some up to their knees, some up to their groin and some up to their jaws.” He said: and the Messenger of Allaah (peace and blessings of Allaah be upon him) pointed to his mouth. (Narrated by Muslim, 5108). And he said: “I will come to the gate of Paradise on the Day of Resurrection and ask for it to be opened. The gatekeeper will ask, ‘Who are you?’ I will say: ‘Muhammad.’ He will say, ‘I was commanded not to open it for anyone before you.’” (Narrated by Muslim, 292). And there are other similar ahaadeeth. The idea of the transmigration of souls is a rejection of these texts and a denial of the Resurrection. The Islamic teachings concerning torment or blessing in the grave and the questioning of the two angels clearly prove that the soul of man does not move to another body, rather it and the body experience torment or blessing, until mankind will be gathered to their Lord. Imaam Ibn Hazm (may Allaah have mercy on him) said: “It is sufficient refutation of their idea to note that there is consensus among all Muslims that they are kaafirs and that those who believe in this idea are following something other than Islam, and that the Prophet (peace and blessings of Allaah be upon him) taught something other than this.” (al-Fasl fi’l-Milal wa’l-Ahwa’ wa’l-Nihal, 1/166). The belief that the body will perish and will not be restored to experience blessing or punishment is a means that leads man to indulge in desires, wrongdoing and evil. This is what the Shaytaan wants for those who follow this corrupt belief, in addition to pushing them further in to kufr when he makes them believe in this false idea. What you must do is to advise this person and remind him of the words of Allaah and the words of His Messenger (peace and blessings of Allaah be upon him), and call him to repent from this kufr. If he repents and turns to Allaah, all well and good, otherwise keep away from him and warn others against listening to him, and tell people that you reject his beliefs, lest people be deceived by him. And Allaah knows best. Islam Q&A Sheikh Muhammed Salih Al-Munajjid Useful video ( Is The Qur’an God’s Word ? ) you can check it for more information about The Qur’an God’s Words .  ",
            "date": "Answered April 8, 2017",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ratty Ana",
                    "user_href": "/profile/Ratty-Ana-1"
                },
                {
                    "user_id": "Vishal Garg",
                    "user_href": "/profile/Vishal-Garg-77"
                }
            ]
        },
        {
            "author_info": {
                "name": "V.N. Raja",
                "href": "/profile/V-N-Raja"
            },
            "answer_text": "Islam and christianity are dogmatic religion, both originated from older Judaism. Christianity was originally a sect of Judaism and Islam borrows heavily from both Christianity and Judaism. Both Christianity and Islam believe in heaven and hell , and judgement day. In Christianity, you ho to heaven only if you accept Jesus Christ as your Lord and savior. Even if you committed unlimited number of sins, after death Jesus Christ intercedes on your behalf with God and you go straight to heaven. If you dont accept Jesus Christ as your savior, inspite of lot of charity and kindness, you will go to hell. In Islam, Jesus Christ has been replaced by Prophet Mohammad. If you are a Muslim, and praise Prophet Mohammad everyday, you go to heaven. You are a Non Muslim, you simply go to hell. Your good or bad deeds dont matter in Islam either. Islam and Christianity dont believe in concepts like karma and reincarnation. ",
            "date": "Answered December 3, 2019",
            "views": "317",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anshul Yadav",
                    "user_href": "/profile/Anshul-Yadav-38"
                },
                {
                    "user_id": "Urvashi Bhardwaj",
                    "user_href": "/profile/Urvashi-Bhardwaj-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nabeel",
                "href": "/profile/Nabeel-71"
            },
            "answer_text": "According to Islamic Teachings, we humans are here to prove with our Deeds (Karma) and on Judgement the God will judge our fate, then we will rebirth eternal, Its also said in Islam that Allah swt sent Millions of messengers to earth and who knows what they say so its forbidden for Muslims to speak anything negative about others faith. No rebirth on this plane is mentioned, we will get reward for Jihaad, Jihaad with our evil thoughts, desires, tauba, forgiveness, love and mercy to those who are in need. Allah has recognized himself as Ghafoor o Raheem, so I believe whoever does good deeds or karm will be given a chance to go to heaven. Muslims are not the only creation of Allah, Allah clearly said Ashraf-Ul-Makhluqat to Humans not Muslims, So he loves everyone equally and I am damn sure everyone in the kingdom of Allah will be a King himself. Be good, Do good, Charity, Salah, Love, Mercy, Hope, Basics of Islam ",
            "date": "Updated March 27, 2020",
            "views": "475",
            "upvotes": " Answer requested by Akshay Jain",
            "upvoters": [
                {
                    "user_id": "Kenley Jarrell",
                    "user_href": "/profile/Kenley-Jarrell"
                },
                {
                    "user_id": "Tom Graves",
                    "user_href": "/profile/Tom-Graves"
                },
                {
                    "user_id": "Kyrani Eade",
                    "user_href": "/profile/Kyrani-Eade"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahmad Nazir",
                "href": "/profile/Ahmad-Nazir-9"
            },
            "answer_text": "definitely no once we die there is no turning back we are in the grave until the day of resurrection and when that day approaches we will be resurrected and anyone who believes in the oneness of God (Allah) followed his commands will be destined to Paradise and whomever associated partners with Allah will be thrown in HELL with their false Gods and false deities which they used to worship. (IT MAKES SENSE DOESN’T IT?) ",
            "date": "Answered June 8, 2018",
            "views": "262",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raida Innab",
                "href": "/profile/Raida-Innab"
            },
            "answer_text": "Not in the sense you may be familiar with according to Hindus, but there is mention in the Quran that the soul becomes ‘hostage’ to what it has earned, which is similar ideology to karma and other instances where God turned people into apes. This is not certain whether they actually became apes or were regressed to an ape-like status. ٣٦ نَذِيرًا لِلْبَشَرِ Q74:36 A warning to the mortals. ٣٧ لِمَنْ شَاءَ مِنْكُمْ أَنْ يَتَقَدَّمَ أَوْ يَتَأَخَّرَ Q74:37 To whomever among you wishes to advance, or regress. ٣٨ كُلُّ نَفْسٍ بِمَا كَسَبَتْ رَهِينَةٌ Q74:38 Every soul is hostage to what it has earned. ٦٥ وَلَقَدْ عَلِمْتُمُ الَّذِينَ اعْتَدَوْا مِنْكُمْ فِي السَّبْتِ فَقُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِينَ Q2:65 And you surely knew those of you who violated the Sabbath. We said to them, “Be despicable apes!” ٦٦ فَجَعَلْنَاهَا نَكَالًا لِمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِلْمُتَّقِينَ Q2:66 Thus We made it a deterrent for their generation, and for subsequent generations, and a lesson for the righteous. ",
            "date": "Answered October 9, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Naoya Yamaguchi",
                "href": "/profile/Naoya-Yamaguchi"
            },
            "answer_text": "Most of them do not. But the Alawite Muslims do. Allah is supposed to be omnipotent. He is capable of doing even things not written about in the Qur’an. He is able to let you reincarnate, too ",
            "date": "Answered March 29, 2018",
            "views": "294",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dilshan Kavinda",
                    "user_href": "/profile/Dilshan-Kavinda-6"
                },
                {
                    "user_id": "Tom Graves",
                    "user_href": "/profile/Tom-Graves"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Ward",
                "href": "/profile/Robin-Ward-29"
            },
            "answer_text": "Not that I’m aware BUT they all too often choose martyrdom , which means they go to (their) heaven and get 72 virgins. I have some trouble determining if these “virgins” are male or female? —if it really matters? but —re-incarnation ? —-I think thats Buddism? ",
            "date": "Answered April 20, 2018",
            "views": "457",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Talat Zehra",
                "href": "/profile/Talat-Zehra-1"
            },
            "answer_text": "Reincarnation is not acceptable in ‘Isla:m. It is certainly a belief that can exclude a person from the Circle of ‘Isla:m. How ever Muslims believe in the Bodily Resurrection of all Human Beings in the Day of Resurrection. But this is in opposition to Reincarnation. ",
            "date": "Answered April 20, 2018",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shariq Siddiqui",
                "href": "/profile/Shariq-Siddiqui-4"
            },
            "answer_text": "no ,muslim not believe in reincarnation, they believe heaven and hell for eternity.and they also believe when people go to grave their punishment start from that time. ",
            "date": "Answered December 6, 2018",
            "views": "118",
            "upvotes": " Answer requested by Akshay Jain"
        },
        {
            "author_info": {
                "name": "Mohd Ilyas",
                "href": "/profile/Mohd-Ilyas-28"
            },
            "answer_text": "According to Islam, there is no mention in any of the holy books. Thus, Muslims believe in only one life and one death. Muslims do not believe in reincarnations. ",
            "date": "Answered December 5, 2018",
            "views": "93",
            "upvotes": " Answer requested by Akshay Jain"
        },
        {
            "author_info": {
                "name": "Kenley Jarrell",
                "href": "/profile/Kenley-Jarrell"
            },
            "answer_text": "I think it's a specific group that does ",
            "date": "Answered July 23, 2018",
            "views": "188",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suzy Boone",
                "href": "/profile/Suzy-Boone"
            },
            "answer_text": "Yes ",
            "date": "Answered May 4, 2020",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fazel Subian",
                "href": "/profile/Fazel-Subian-2"
            },
            "answer_text": "  ",
            "date": "Answered April 5, 2019",
            "views": "239",
            "upvotes": " Answer requested by Salma Eissa"
        }
    ]
}