{
    "title": "Do Middle-Eastern Arabs descend from Bedouins? - Quora",
    "tags": [
        "Bedouins",
        "Arab (People)",
        "Middle Eastern People",
        "Middle Eastern Culture",
        "The Arab World",
        "Genealogy",
        "Arab Ethnicity and People",
        "Saudi Arabia",
        "The Middle East"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohammad Jaafar",
                "href": "/profile/Mohammad-Jaafar-3"
            },
            "answer_text": "Not really, in the past there used to be two types of Arabs: Qahtanites: They are considered to be the pure Arabs, they originated from Yemen.Adnanites:They are arabized Arabs.These two groups are further divided into two types each: Bedouin Arabs:In Arabic they are referred to as “عرب البدو”: arab albadw or “الأعراب”: al'aarab, they do not live in cities, and they stay on the move once the water reservoir have been depleted, you can say they are the eskimos of the desert, they usually belong to a single clan, they are hardy people, and are usually hired by city Arabs to lead the trading caravan, as they are very skilled at navigating the desert, and scouting.Of course, here I am talking about the old Bedouin Arabs, modern Bedouin Arabs some of them still follow their old ways, some of them adapted to the modern life, some of them still follow their old ways, but use the tools of the modern era.City ArabsIn Arabic they are referred to as “عرب حضر” the word “حضر” in Arabic means civilization Arabs as well as city Arabs, arabs that lived in houses that are made of clay and rocks, and even some of them that have built citadels and small castles, unlike their Bedouin counterparts, city Arabs can be several clans living side by side, forming a Tribe, for example, the Quraysh Tribe is a City Arabs group, it is formed from various clans living side by side, and each clan has a representative in the Quraysh council, including the clan of prophet Mohammad, the hashemite which is considered to be an Adnanite.",
            "date": "Answered August 1, 2020",
            "views": "154",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amirhosein Asgari",
                    "user_href": "/profile/Amirhosein-Asgari"
                },
                {
                    "user_id": "Waleed Al Alawi",
                    "user_href": "/profile/Waleed-Al-Alawi"
                },
                {
                    "user_id": "Hadeed Malik",
                    "user_href": "/profile/Hadeed-Malik"
                },
                {
                    "user_id": "Ali Mahdi",
                    "user_href": "/profile/Ali-Mahdi-19"
                },
                {
                    "user_id": "Moataz El Shafie",
                    "user_href": "/profile/Moataz-El-Shafie"
                },
                {
                    "user_id": "Raoulito Raoul",
                    "user_href": "/profile/Raoulito-Raoul"
                },
                {
                    "user_id": "Alper Bilgin",
                    "user_href": "/profile/Alper-Bilgin-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abu Ahham",
                "href": "/profile/Abu-Ahham"
            },
            "answer_text": "There are two biggest group of Arabs in the Peninsula, Adnanites and Qahtanites both are original Arabs. This classification of Adnanite and Qahtanite is to determine the branch of their tribes member, Adnanite Arabs are the inhabitants of North, East and West Arabia while South Arabia are Qahtanite. Now for the most part some people would say that Adnanite Arabs are not pure Arabs but they are Arab being Arabized, I simply reject this idea because if we take a look at Prophet Muhammad he is an Adnanite Arab. The direct ancestor of Quraysh tribe known as Ma’ad ibn Adnan and Ma’ad himself is a native inhabitants from the Arabian Peninsula also he is the founder of Mecca. Bedouin are Arabs nomadic lifestyle and not all Arabs follow these lifestyle anymore. Some Arabs are sedentary like the Banu Hamida from Jordan which already start assimilating to abandon this tradition. Bedouin Arabs are 100% genuine Arabs, they are not mixed with other races and they maintain their order and tradition from ancient time. I know this because both of my grandparents are bedouin Arabs. The term pure Arabs and Arab being Arabized quite be sketchy because there are many Arabs today that doesn’t know their tribe lineage and never live as a bedouin or have a bedouin relative. First, pure Arabs means both paternal and maternal lineage are belong to Arabs from Arabian Peninsula. Second, Arab being Arabized means people that adopt Arab culture (language, tradition, music, religion, literature etc) which being follow by Arabs from Peninsula nowadays, this apply to those whom come from Levantine region and Maghreb region (North Africa). Last, you can’t be an Arab if you don’t have a paternal lineage of Arab (this also depend on socio-religio view). ",
            "date": "Answered August 17, 2020",
            "views": "718",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nisha Linde",
                    "user_href": "/profile/Nisha-Linde"
                },
                {
                    "user_id": "Gourishankar Panicker",
                    "user_href": "/profile/Gourishankar-Panicker-2"
                },
                {
                    "user_id": "Alper Bilgin",
                    "user_href": "/profile/Alper-Bilgin-5"
                },
                {
                    "user_id": "Huda Ahmed",
                    "user_href": "/profile/Huda-Ahmed-114"
                },
                {
                    "user_id": "Veronique Helmridge-Marsillian",
                    "user_href": "/profile/Veronique-Helmridge-Marsillian"
                },
                {
                    "user_id": "Raoulito Raoul",
                    "user_href": "/profile/Raoulito-Raoul"
                },
                {
                    "user_id": "Saddam Yousafzai",
                    "user_href": "/profile/Saddam-Yousafzai-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aeomær Rajeh",
                "href": "/profile/Aeomær-Rajeh"
            },
            "answer_text": "Being a Bedouin is a way of life. Some Arab tribes were Bedouin (roaming the desert ), and some were living up on the mountain (in villages ) and some in cities and in the countryside. But the Bedouin were the least effected by foreign influence, so their Arabic is the purest. Answer. Yes, some Arabs are descended from Bedouin but not all of them. Unfortunately now due to modernization most if not all of them settled down. ",
            "date": "Answered August 1, 2020",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abu Ahham",
                    "user_href": "/profile/Abu-Ahham"
                },
                {
                    "user_id": "Raoulito Raoul",
                    "user_href": "/profile/Raoulito-Raoul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Einstein",
                "href": "/profile/Kevin-Einstein-2"
            },
            "answer_text": "Arabs descend from the Queen of Saba… also known as the Queen of Sheba or the Queen of Arabia! If you mean white skinned Arabs they came from Turkey during the Muslim conquest of North Africa! ",
            "date": "Answered August 4, 2020",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nebojath Davis",
                "href": "/profile/Nebojath-Davis"
            },
            "answer_text": "no they descend from Ishmael ",
            "date": "Answered August 1, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roger Louis",
                    "user_href": "/profile/Roger-Louis-5"
                }
            ]
        }
    ]
}