{
    "title": "Do Native Americans who speak English have distinct accents? - Quora",
    "tags": [
        "English Language Accents",
        "American Accents",
        "American English",
        "Accents"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Lambert",
                "href": "/profile/Richard-Lambert-4"
            },
            "answer_text": "As a generalization, yes they often do. And you are correct, it will vary a lot, depending on tribe and location, as well as other factors.Native American heritage is only one factor of many. I believe biological influences have very little affect, since I have two adopted Sioux sisters who never lived among others and have very little if any trace of a \"Native American\" accent. As a parallel comparison, I have had a very large involvement with Asians in the U.S. and in Asia over the years, in most cases second generation immigrants to the U.S. have accents indistinguishable from other American groups. Actually it is sometimes a little unsettling, after all the exposure to different Asian groups, my ear is tuned toward small differences, when a generic U.S. accent pops out, it sometimes catches me by surprise initially. From my experience, the accent is affected by many different factors. Other languages spoken in the household and cultural identification, socioeconomic status, region all play a significant role. One thing I have found interesting is that particularly for some of the more northern tribes, I have noticed some similarities with parts of what I hear commonly from some Canadians. As a stereotypical \"tell\", there are speech and mannerism characteristics that point to possible Native American heritage. I you want to get a feel for some of them, a vacation spent on the Navaho reservation, the Flathead near Glacier Park or in Eastern Montana near Custer Battlefield would be helpful, and they could use the tourism dollars. My expertise comes from quite a bit of Sociology and the fact I grew up on and around reservations. As an adult, I was in the military where there were people from all cultures and regions and have lived in many places throughout the U.S. and the world. Over time, I picked up bits and pieces from many influences, so my origins were a little difficult to pinpoint. Also, there was a time where my ear was tuned to be able to predict with significant accuracy a lot about many peoples' heritage, region and backgrounds from observing them and listening to them speak. I am pretty confident about what I have observed, but there may be people out there with more formal training that could provide a more empirically based and defendable answer. ",
            "date": "Answered February 20, 2017",
            "views": "12",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mikhail Margolin",
                    "user_href": "/profile/Mikhail-Margolin-1"
                },
                {
                    "user_id": "Giuseppe Longo",
                    "user_href": "/profile/Giuseppe-Longo"
                },
                {
                    "user_id": "Zach Montazeri",
                    "user_href": "/profile/Zach-Montazeri"
                },
                {
                    "user_id": "Ed Christian",
                    "user_href": "/profile/Ed-Christian-2"
                },
                {
                    "user_id": "Michael Koeberg",
                    "user_href": "/profile/Michael-Koeberg"
                },
                {
                    "user_id": "Willie Boyd",
                    "user_href": "/profile/Willie-Boyd"
                },
                {
                    "user_id": "Lauren Rodriguez",
                    "user_href": "/profile/Lauren-Rodriguez-118"
                },
                {
                    "user_id": "Erika Norby",
                    "user_href": "/profile/Erika-Norby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Koeberg",
                "href": "/profile/Michael-Koeberg"
            },
            "answer_text": "Yes and it is known as the Reservation Accent. This dialect was developed over decades of segregation and isolation from their White and Black American neighbours on the reservations where they had to listen to the heavily accented speech of their elders instead of the varieties usually found beyond their domains. It has become stable enough to constitute a speech form in its own right but due to the higher social mobility, many now speak with a lighter and often diluted accent. There is American Indian Pidgin English but doesn’t have the characteristics of a pidgin apart from a simpler grammar and morphosyntax. Even then, the differences are comparable the situation of African-American Vernacular English to the best of my knowledge. Some Native American tribes may sound either Hispanic and French due to Spanish and French colonial influences in centuries past. This is especially true for the communities that live in the Southwest and Louisiana. Otherwise, the young and upwardly mobile tend to sound little different from their neighbours with some having no discernible accent. This will vary according to background as many still living in the reservations tend to have a pronounced accent. ",
            "date": "Updated January 30, 2019",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mikhail Margolin",
                    "user_href": "/profile/Mikhail-Margolin-1"
                },
                {
                    "user_id": "Willie Boyd",
                    "user_href": "/profile/Willie-Boyd"
                },
                {
                    "user_id": "Lauren Rodriguez",
                    "user_href": "/profile/Lauren-Rodriguez-118"
                },
                {
                    "user_id": "Charles Cycholl",
                    "user_href": "/profile/Charles-Cycholl"
                },
                {
                    "user_id": "Eamon Bohan",
                    "user_href": "/profile/Eamon-Bohan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernest W. Adams",
                "href": "/profile/Ernest-W-Adams"
            },
            "answer_text": "Older ones who live on large reservations a long way from whites do, certainly. Elderly Navajos have a distinctive accent, because English is a second language to them. But these days English is the first language for most native Americans, and their indigenous language is secondary. You won’t hear a strong accent from most people under about 50. (There are exceptions, naturally.) ",
            "date": "Answered October 5, 2016",
            "views": "24",
            "upvotes": " View 36 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mikhail Margolin",
                    "user_href": "/profile/Mikhail-Margolin-1"
                },
                {
                    "user_id": "Matthew D. Gamble",
                    "user_href": "/profile/Matthew-D-Gamble"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Dan Holliday",
                    "user_href": "/profile/Dan-Holliday"
                },
                {
                    "user_id": "Maggie McQuaid",
                    "user_href": "/profile/Maggie-McQuaid-2"
                },
                {
                    "user_id": "Noel Cain",
                    "user_href": "/profile/Noel-Cain"
                },
                {
                    "user_id": "Paige Stone",
                    "user_href": "/profile/Paige-Stone-1"
                },
                {
                    "user_id": "David White",
                    "user_href": "/profile/David-White-192"
                },
                {
                    "user_id": "Evelyn MacPhee",
                    "user_href": "/profile/Evelyn-MacPhee"
                },
                {
                    "user_id": "Anne Fletcher-Jones",
                    "user_href": "/profile/Anne-Fletcher-Jones"
                },
                {
                    "user_id": "Jeff Collins",
                    "user_href": "/profile/Jeff-Collins-6"
                },
                {
                    "user_id": "Nicola Carapellese",
                    "user_href": "/profile/Nicola-Carapellese"
                },
                {
                    "user_id": "Arnav Varma",
                    "user_href": "/profile/अर्णव-वर्मा-Arnav-Varma"
                },
                {
                    "user_id": "Chase Quinton",
                    "user_href": "/profile/Chase-Quinton"
                },
                {
                    "user_id": "Chris Colella",
                    "user_href": "/profile/Chris-Colella-2"
                },
                {
                    "user_id": "Anthony Corbelli",
                    "user_href": "/profile/Anthony-Corbelli"
                },
                {
                    "user_id": "Diego Leon",
                    "user_href": "/profile/Diego-Leon-12"
                },
                {
                    "user_id": "Victoria Rosaria",
                    "user_href": "/profile/Victoria-Rosaria"
                },
                {
                    "user_id": "Michael Koeberg",
                    "user_href": "/profile/Michael-Koeberg"
                }
            ]
        }
    ]
}