{
    "title": "Do public intellectuals have as much of an influence today as they did in past eras? - Quora",
    "tags": [
        "Public Intellectuals",
        "Thought Leadership",
        "Intellectuals",
        "Intellectualism",
        "Influence",
        "Society",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pete Combes",
                "href": "/profile/Pete-Combes"
            },
            "answer_text": "If someone has something worth talking about or a talent worth selling these days if they are not promoting themself already they will be picked up by some sort of media impresario. The reach of their influence is faster and farther than it would have been, but really is any any of what we take on a a daily basis of any lasting influence for our lives? No. Its mostly entertainment. Which we pay too much for anyway. There is probably a link between this an mental health problems ",
            "date": "Answered May 1, 2019",
            "views": "23",
            "upvotes": " Not for Reproduction "
        },
        {
            "author_info": {
                "name": "James Lacey",
                "href": "/profile/James-Lacey"
            },
            "answer_text": "No because Public Intellectuals used to write magazine articles. To be clear, that is not all they did, but that is how many or most became familiar to the public, and they also typically gave talks and wrote books. But when is the last time you bought a magazine? ",
            "date": "Answered April 30, 2019",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Aubrey",
                "href": "/profile/Richard-Aubrey"
            },
            "answer_text": "The definition of public intellectual has been (self) expanded. Anybody with a degree and a keyboard can call himself a public intellectual. Because of that, because of the number of wannabe public intellectuals, the class as a whole has less credibility than it used to. ",
            "date": "Answered April 30, 2019",
            "views": "9",
            "upvotes": " Answer requested by Charles Morris"
        }
    ]
}