{
    "title": "Do polytheists have to worship all the gods from their pantheon, or is it only a few that they feel connected to? - Quora",
    "tags": [
        "Idolatry",
        "Polytheism",
        "Idol Worship (religious beliefs)",
        "Religious Worship",
        "Deities (gods)",
        "Worship and Worshipping",
        "Theology",
        "Belief and Beliefs",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah McLean",
                "href": "/profile/Sarah-McLean-11"
            },
            "answer_text": "This is an interesting question, because the answer is basically ‘yes.’ I know that doesn’t make a lot of sense, so let me elaborate. Ancient Greek paganism is what I know best, so I’m going to use that as an example. In a true polytheistic society like Ancient Greece, yes, you worship all the gods. Because… they’re just there. They’re not a “pantheon,” they’re just there. It’s not really about whether you feel connected to them or not, they’re just there. They need appeasing so that life can move on as normal and be as good as possible, and you need to appear pious, so you worship the gods and attend their annual festivals and other public functions. There’s no rule about having to worship all the gods because it goes unsaid; of course you worship the gods, why wouldn’t you? And yet, plenty of people belonged to mystery cults that centered around one specific god, so if there was one particular deity you felt personally connected to, you could dedicate your life to them. Modern neopaganism works a little differently, to say the least. Except for reconstructionists who attempt to replicate ancient paganism with maximum historical accuracy, most neopagans just pick and choose the gods they feel the most connected to. And this is because there really isn’t a good reason not to do that. Gods are no longer relied upon for the crops to grow or the storms to cease, and you know that you don’t need to worship them just to function. Society isn’t pagan, so there’s no social obligation to worship the gods either. And then there’s the added complication of worshipping gods across pantheons — if that’s something you do, then you can’t literally worship every single god that exists. It’s most practical to work with the gods that you feel most connected to, and that will help you with your personal spiritual development. So, for example, I believe in all gods and I work mainly with Greek gods, but I don’t worship all of them. I don’t dedicate time and energy and resources to all of them, because I just don’t feel like I need to. That is definitely not how ancient paganism worked. But there’s nothing conventional about my religious system, either. As soon as you’re talking about a pagan society (with all the social and political implications), well, then that dynamic changes entirely. The way neopagans interact with their gods changes based on the individual or their group. Some work with entire pantheons, some work cross-pantheons, some work only with individual gods, and some work with only two archetypical gods while “plugging in” the names and faces of appropriate deities. But this is not how ancient paganism worked, or how a polytheistic society works. However, even in such a context, it’s possible to work directly with individual deities that you feel connected to. ",
            "date": "Answered October 11, 2020",
            "views": "136",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doug Freyburger",
                    "user_href": "/profile/Doug-Freyburger"
                },
                {
                    "user_id": "Tayoh Dey",
                    "user_href": "/profile/Tayoh-Dey"
                },
                {
                    "user_id": "Matt Benson Parry",
                    "user_href": "/profile/Matt-Benson-Parry"
                },
                {
                    "user_id": "Mairon Aulendil",
                    "user_href": "/profile/Mairon-Aulendil"
                },
                {
                    "user_id": "Rafael Ferreira",
                    "user_href": "/profile/Rafael-Ferreira-172"
                },
                {
                    "user_id": "Gianpierre Lara",
                    "user_href": "/profile/Gianpierre-Lara-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Freyburger",
                "href": "/profile/Doug-Freyburger"
            },
            "answer_text": "“Do polytheists have to worship all the gods from their pantheon, or is it only a few that they feel connected to?” Odin showed up in a dream in late 1986 or early 1987 and told me to follow. I pondered for a year before I took him up on his request. I’ve been Asatru ever since. This is a topic I studied during that year of pondering. As I read the Norse sagas I noticed that the people treated festivals as something done by the entire town addressed to all of the deities. Some people only focused on one deity. They were rare enough to be remarked upon but they weren’t so rare as to be considered freaks. Some people declined to attend the festivals. They trusted in “their own might and main”. Again they were rare enough to be remarked upon but they weren’t so rare as to be considered freaks. Note well that it is never mentioned if the “might and main” folks believed or not. They declined to practice a religion that stresses practice. Belief doesn’t get mentioned until Christians are mentioned. You don’t “have to” do anything, though if you do nothing you aren’t a member of a religion that goes by practice not by belief. You can connect with only a few if you want to but that was viewed as a rare choice. If you just went with the flow and practiced the community practice in the center of the village with almost everyone else, you celebrated the entire pantheon. What I report is from the Icelandic sagas. It probably described how the ancients practiced elsewhere but I’m only certain that it describes practices in the north. Among us moderns far more of us focus on specific deities. This seems to be some sort of Christian baggage. Most of us were raised Christian and all of us grew up in Christian majority cultures. ",
            "date": "Answered October 12, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gianpierre Lara",
                    "user_href": "/profile/Gianpierre-Lara-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranjiv Kurup",
                "href": "/profile/Ranjiv-Kurup"
            },
            "answer_text": "Polytheism is a myth created by Christian theologians in order to contrast monotheism as some high watermark of spiritual evolution. Or they simply did not want to understand. There is no such thing as polytheism, as the highest reality is beyond human comprehension. Even terming it a “god”, or categorising it as monotheism, atheism, pantheism etc, is plain human arrogance. So how do we understand the divine, if it is an unknowable? Simply through its creation, its myriad expressions! And not just the material expressions (stars, planets, galaxies et al), even things like human objectives, sources of human character, sources of inspiration like music and art or nature, or higher human ideals. If you study the texts of ancient spiritual traditions, you'll see how every tangible attribute, every quality and every entity evolved in a whole chain of cause-effect relationships that go right back to the subtle unknowable source of all creation. Besides, that “source” though unknowable, is experiential and transformative! Just the mere experience of it will change your life. And what does that entail? Just a bit of disciplined, diligent, sustained practice! What practice? The wisdom of the ages - the old “pagan” practices! ",
            "date": "Answered October 12, 2020",
            "views": "42",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nikhil Bhonsle",
                    "user_href": "/profile/निखिल-भोंसले-Nikhil-Bhonsle"
                },
                {
                    "user_id": "Gianpierre Lara",
                    "user_href": "/profile/Gianpierre-Lara-1"
                },
                {
                    "user_id": "Pankaj Shah",
                    "user_href": "/profile/Pankaj-Shah-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swarnali Chatterjee Yokota",
                "href": "/profile/横田-チャタジー-スワルナーリ-Swarnali-Chatterjee-Yokota"
            },
            "answer_text": "Only Quora mediators and God knows how many times this question has come up. Hindu paganism.. We can worship which ever deity or deties we want to, feel close to one or many. ",
            "date": "Answered October 11, 2020",
            "views": "63",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Schaefer",
                    "user_href": "/profile/Thomas-Schaefer-2-1"
                },
                {
                    "user_id": "Pradip Gangopadhyay",
                    "user_href": "/profile/Pradip-Gangopadhyay"
                },
                {
                    "user_id": "Matt Benson Parry",
                    "user_href": "/profile/Matt-Benson-Parry"
                }
            ]
        }
    ]
}