{
    "title": "Do Sikhs follow Jesus? - Quora",
    "tags": [
        "Sikhs Ethnicity and People",
        "Jesus",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sunny S",
                "href": "/profile/Sunny-S-241"
            },
            "answer_text": "Sikhs Respect Jews, Jesus was a Jew, we have a high respect for Jew. They shares the genocide like sikhs for 100s of years. Jesus came to India and become a Hindu in Himalaya. Why should someone follow Jesus, Everyone one should follow who they are from their culture of Country. Jesus may be relevant to Israel not Egypt or Mexico or Germany. Come on Grow up, is there no one in your country that you can follow or do you not have your own path. The first Guru Nanak Dev Ji said god is not subjective. God is objective and its cares for all. Following is the basic mantra that all Sikhs and related people study. ੴ ਸਤਿ ਨਾਮੁ ਕਰਤਾ ਪੁਰਖੁ ਨਿਰਭਉ ਨਿਰਵੈਰੁ ਅਕਾਲ ਮੂਰਤਿ ਅਜੂਨੀ ਸੈਭੰ ਗੁਰ ਪ੍ਰਸਾਦਿ ॥ Onkar (God) is one, God is the doer( all world is being created, nursed and killed/transformed by god), God it not afraid of anyone (power or influence), god is shapeless (pervades in all the universe), does not born or die, God is attained with the grace of Guru. Religion is against Sikh Practice: The Middle east messenger are highly subjective, they take sides….David, Moses, Abraham, Jesus, Mohammed or any other. There is a also a compartmental thinking that god only help specific type of people, only a sort of people who have a specific label on them will go to haven( Haven is highly controlled realm, depends on who you know, not who you are)….this is against the basic principal of Sikhism. Guru Nanak did not say that I will take you to god, He was a realized Guru connected to god. He written himself the hymns of god and work on yourself to be one with god (So there was not bonanza or marketing plan, so gotta walk on the path of god). Hell and Heavens: Sikhs do not have any love for hell and havens, this is for the material people. Sikhs would like to attain Mukti or be the part of consciousness of god, So one does not have to come to life and suffer in the physical body again and again and again. Europeans(the spiritual people) were persecuted( it takes 50 years to destroy a culture and history, just let 2 generations die to convert all) to believe in Gods from Middle east, so they believe in Someone from Middle east( it does not send them to haven), so does the Latin Americans and African and Asians. Depends on how the spirituality was massacred does not make any religion great. I request everyone to review their spirituality and god is kind, you can attain Mukti only with true god not the god that was imposed on you. Some one from these persecuted places has to get up and walk on the path of Nirvana. Nanak is inside you embrace the real you and walk on the path of spirituality. https://www.sikhdharma.org/ ",
            "date": "Answered December 24, 2019",
            "views": "338",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gabriela Nitti",
                "href": "/profile/Gabriela-Nitti"
            },
            "answer_text": "From various conversations with Sikhs in UK, they all believe in Jesus. Not necessarily follow Jesus. Sikhs see him as a wonderful parallel with the person of Nanak, the first Sikh Guru. There is no direct connection between Christ and the Sikh Gurus. They do not intersect each other. The two form separate and distinct temporal and spatial points in our history, but when we look closely at them, they illuminate each other. By looking at them as parallel phenomena, we not only learn more about the founders of Christianity and Sikhism, but we also get a better sense of ourselves, of our neighbours, and of the world we live in. Both Christ and Nanak are remembered in almost identical ways. Churches resound with hymns like: \"Christ is the light of the world\" And Sikh Gurdwaras with: \"Satgur nanak pragatia miti dhundh jag chanan hoia\" - \"as Nanak appeared, mist and darkness disappeared into light.\" The powerful and substanceless light used across cultures and across centuries reveals the common patterns of our human imagination. Source and Further Reading: Research and Study of SikhismResearch and Study of ChristianitySikh Religion and Christanity",
            "date": "Updated September 2, 2020",
            "views": "12",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward Redcliff",
                    "user_href": "/profile/Edward-Redcliff"
                },
                {
                    "user_id": "Ramya Sharma",
                    "user_href": "/profile/Ramya-Sharma-53"
                },
                {
                    "user_id": "Rebecca Michalski",
                    "user_href": "/profile/Rebecca-Michalski-4"
                },
                {
                    "user_id": "Onkar Puri",
                    "user_href": "/profile/Onkar-Puri-2"
                },
                {
                    "user_id": "Rajdeep Singh",
                    "user_href": "/profile/Rajdeep-Singh-799"
                },
                {
                    "user_id": "Spray -The Third",
                    "user_href": "/profile/Spray-The-Third"
                },
                {
                    "user_id": "Gw Kaur",
                    "user_href": "/profile/Gw-Kaur"
                },
                {
                    "user_id": "JJ Singh",
                    "user_href": "/profile/JJ-Singh-58"
                },
                {
                    "user_id": "Amardeep Singh Gill",
                    "user_href": "/profile/Amardeep-Singh-Gill-2"
                },
                {
                    "user_id": "Tajesh Bagga",
                    "user_href": "/profile/Tajesh-Bagga"
                },
                {
                    "user_id": "R D Miller",
                    "user_href": "/profile/R-D-Miller"
                },
                {
                    "user_id": "Prem Chandran John",
                    "user_href": "/profile/Prem-Chandran-John"
                },
                {
                    "user_id": "Aasees Singh",
                    "user_href": "/profile/Aasees-Singh"
                },
                {
                    "user_id": "Radhe Shyam Ojha",
                    "user_href": "/profile/Radhe-Shyam-Ojha"
                },
                {
                    "user_id": "Mandeep Singh",
                    "user_href": "/profile/Mandeep-Singh-4244"
                },
                {
                    "user_id": "Balwinder Khaira",
                    "user_href": "/profile/Balwinder-Khaira"
                },
                {
                    "user_id": "Sardar Bhadur",
                    "user_href": "/profile/Sardar-Bhadur"
                },
                {
                    "user_id": "Rakesh Patil",
                    "user_href": "/profile/Rakesh-Patil-522"
                },
                {
                    "user_id": "Gurlal Randhawa",
                    "user_href": "/profile/Gurlal-Randhawa-3"
                },
                {
                    "user_id": "Arpit Pal",
                    "user_href": "/profile/Arpit-Pal-3"
                },
                {
                    "user_id": "Inderjit Singh Uberoi",
                    "user_href": "/profile/Inderjit-Singh-Uberoi"
                },
                {
                    "user_id": "Subham",
                    "user_href": "/profile/Subham-110"
                },
                {
                    "user_id": "Harpreet Singh",
                    "user_href": "/profile/Harpreet-Singh-4256"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tajvir Dhesi",
                "href": "/profile/Tajvir-Dhesi-1"
            },
            "answer_text": "Aight, wait a sec. Ok, ok, searching through my following list on Twitter. I’m scrolling for a Jesus. C’mon, still not there, still not ther- oh, I’ve found it! Wait, that’s just my Mexican friend. But in all seriousness, no Sikhs do not follow Jesus. We do believe he was a holy human being and a man of God and we respect him for that, but we do not follow him. ",
            "date": "Answered April 24, 2017",
            "views": "268",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "S. Anderson",
                    "user_href": "/profile/S-Anderson-34"
                },
                {
                    "user_id": "Scott Jackson",
                    "user_href": "/profile/Scott-Jackson-112"
                },
                {
                    "user_id": "Peter Godipelly",
                    "user_href": "/profile/Peter-Godipelly-2"
                },
                {
                    "user_id": "Pardeep Singh",
                    "user_href": "/profile/Pardeep-Singh-271"
                },
                {
                    "user_id": "Raju Dhesi",
                    "user_href": "/profile/Raju-Dhesi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manvir Singh",
                "href": "/profile/Manvir-Singh-141"
            },
            "answer_text": "Nope. We do believe Jesus was a man of God though, just as we do with Mohammad, Abraham, Moses, etc. We respect Jesus and all of the prophets listed above, but as far as following anyone goes, we only follow the Guru ",
            "date": "Answered April 8, 2017",
            "views": "397",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simon Glass",
                    "user_href": "/profile/Simon-Glass-2"
                },
                {
                    "user_id": "Satvir Nijjar",
                    "user_href": "/profile/Satvir-Nijjar"
                }
            ]
        }
    ]
}