{
    "title": "Do Sinhalese believe and accept them to be the descendants of Tamils? - Quora",
    "tags": [
        "Sinhalese People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roshan Silva",
                "href": "/profile/Roshan-Silva-8"
            },
            "answer_text": "Do Sinhalese believe and accept them to be the descendants of Tamils? No. I don’t think we are descendants of Tamils. But Tamils (particularly Sri Lankan Tamils) and Sinhalese share similar ancestral roots. Mix of Various migrants of indian mainland and native people of sri lanka . Sinhalese in north eastern parts of india while SL tamils southern parts of india(mainly). I think this summarize Sinhalese origins. “The Sinhalese originally came from northern India, as shown by genetic and linguistic connections. After they arrived in Sri Lanka, some of the Sinhalese apparently intermarried with the indigenous Vedda people, but even if so these lineages are minor. The data also shows that they intermarried with Tamils, certainly to a more substantial degree than with the Vedda. By and large, Sinhalese are related to Bengalis with some elements of Tamil-, Gujarati-, and Punjabi-connected ancestry. They don't seem to have any ancestry from southeast Asia. “ DNA of Sri Lanka's Sinhala speakers South Asians overall are a mixture of 3 ancestral groups. local hunter-gatherers,Middle Eastern farmers,Central Asian herdersAverage Genetic Breakdown of Sri lankan Groups based of ancestry from 3 groups mentioned above. As you can see Sri lankan Tamils shre ancestry with both Sinhalese and Indian Tamils( more Ancestral south Indian ancestry(ASI) and less Ancestral north Indian ancestry(ANI) than Sinhalese But more North south Indian and less Ancestral South Indian ancestry than Indian tamils in sri lanka). Peopling of India - Wikipedia  Averaged ancestry of Sri lankan populations from various geographical locations(2015 , as a subset of determining ancestry of sri Lankan malays/ this is the largest study on sri Lankan populations so far) Also suggests North and south indian mixed ancestry .  Dissecting the genetic structure and admixture of four geographical Malay populations Migration Route to island of sri lanka.  Following studies show more north indian DNA than tamil on Sinhalese , Concluding predominantly north indian origin. Genetic26526 admixture of Sinhalese by Dr. Saha Papiha  Genetic admixture by Dr.Sarabjit Mastana of 121 samples of Sinhalese collected from Colombo A number of genetic admixture calculations were carried out using Tamil, Bengali, Gujarati (Patel), and Punjabi as parental populations. Admixture calculations were performed using two different methods- point estimates and maximum likelihood method. In all combinations Bengali - (50-66%) North Western Indian -(20-23%) Tamil- (30%-11%) The 23 and me (individual genetic studies) ancestry of a Sinhalese sample.(low country who are of south indian mixing)   Sinhalese are not descendants of Tamils, But may have similar origin with later mixing. ",
            "date": "Updated September 6, 2020",
            "views": "847",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Senthil Kumar",
                    "user_href": "/profile/Senthil-Kumar-2692"
                },
                {
                    "user_id": "Pradeep Siriwardana",
                    "user_href": "/profile/Pradeep-Siriwardana"
                },
                {
                    "user_id": "Ajay Jayachandran",
                    "user_href": "/profile/Ajay-Jayachandran-5"
                },
                {
                    "user_id": "Prabha abewarne",
                    "user_href": "/profile/Prabha-abewarne"
                },
                {
                    "user_id": "SK Das",
                    "user_href": "/profile/SK-Das-2"
                },
                {
                    "user_id": "Ashish R Mallya",
                    "user_href": "/profile/Ashish-R-Mallya-8"
                },
                {
                    "user_id": "Ebis Mark",
                    "user_href": "/profile/Ebis-Mark"
                },
                {
                    "user_id": "Duvin Subasinghe",
                    "user_href": "/profile/Duvin-Subasinghe-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ananthasegaram Rajasegaram",
                "href": "/profile/Ananthasegaram-Rajasegaram"
            },
            "answer_text": "Some Sinhalese, accept that Tamils and Sinhalese are one Root <1>, same time some Sinhalese not accept that they descendants of Tamils, <2>,Some Sinhalese beloved they from European Root, <3>, My Policy- The ancient Sinhala and Tamils people were one Root, <1>, why ? , The Ancient King - Ravanas / Ravanan, period, nearly -3000, years before in Srilanka, one language spoken, in these language, < Sinhala and Tamil words, can see it >, The king - Ravanas ( Incavas ),lived in Bolivia / Peru land, after fight with indian King-RAM, , they left ceylon , and reached South America, ( PUMA Punku / Thai Puma Punku- < a Incas / Mayan / Tamilan word->- Thai < Mother> + Puma punku < Earth Centre Point> , that means- the Mother centre Point of the earth,/ English,. In Mexico- there were Sinhala and Tamil words, how did Sinhala words gone to Mexico, before- B.C. Year, because of Mayan Civilization. 1- Pakal (mayan + Tamilan )- Thawal (Sinhala)- Day time / Afternoon -(English), 2- Poya- ( Mayan + Sinhala+ Tamilan)- Full moon (English), 3- Manik-( Mayan + Sinhala + Tamilan)- Jem (English), 4- Oya / Nathi-(Mayan + Sinhala + Tamilan)- River(English), 5- Paka-(Mayan + Tamil )- Patha( Sinhala), -Side (English), Which Civilization has closer link with Sinhala Civilization, ? Tamils I think so, Why should Sinhalese wait for Aryan Image Stories. ",
            "date": "Answered August 22, 2020",
            "views": "130",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Blacker",
                    "user_href": "/profile/David-Blacker-4"
                },
                {
                    "user_id": "Prakasam K",
                    "user_href": "/profile/Prakasam-K-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Vijay",
                "href": "/profile/Rahul-Vijay-144"
            },
            "answer_text": "Most Sinhalese are NOT the descendents of Tamils. Most Sinhalese have Indo- Sinhalesid ancestry, who trace their origin to Aryans who occupied Bengal by the 7th century BCE. Only Sri Lankan Tamils, Veddas, Rhodiyas & many indigenous Lankan tribes have Tamil ancestry. When Prince Vijaya came to Sri Lanka along with his 60,000 followers, he killed lacs of Dravidians & overthrew Tamil rule from Lanka. He then established Aryan or Pre Sinhalese cultural kingdom. ",
            "date": "Answered August 22, 2020",
            "views": "102",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Duvin Subasinghe",
                    "user_href": "/profile/Duvin-Subasinghe-1"
                },
                {
                    "user_id": "Ebis Mark",
                    "user_href": "/profile/Ebis-Mark"
                },
                {
                    "user_id": "Roshan Silva",
                    "user_href": "/profile/Roshan-Silva-8"
                }
            ]
        }
    ]
}