{
    "title": "Do you think the COVID-19 will end by the middle or year end? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Mike Winslade",
                "href": "/profile/Mike-Winslade"
            },
            "answer_text": "Do you think the COVID-19 will end by the middle or year end? “End” ?? This is a virus. It probably has natural reservoirs in the animal population and already has spread worldwide among humans. Plus, most pandemics like this have had a “second wave” and sometimes a “third wave.” The immediate threat might ameliorate but the threat does not “end.” Probably never. Humans will get used to whatever the new normal is after this, but I can’t think of any places where that would happen by mid-year 2020. By year end 2020, there will be places with very low transmission rates and relaxed restrictions relating to transmission control. Places like Austria, Switzerland, South Korea, New Zealand and China, but probably not Brazil or the USA (who might relax restrictions before then but probably won't have the very low transmission rates that the rest of the world would use to justify relaxing those restrictions). A vaccine next year (2021) might change things if it can be delivered in sufficient quantity. ",
            "date": "Answered May 7, 2020",
            "views": "268",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "ImRaaN kHAn Mohammed",
                    "user_href": "/profile/ImRaaN-kHAn-Mohammed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hans Muellers",
                "href": "/profile/Hans-Muellers"
            },
            "answer_text": "no, it will not end but it might be controlled It is a virus that will be around for a long time unless we find a dose of something that will kill it inside of our bodies. Think of Tuberculosis, it’s dangerous, it’s around…but we are no longer that afraid of it, we know how to handle it. Covid-19 is a NEW virus, we don’t know anything about it, we don’t know and are learning. We KNOW we can get rid of it if we don’t spread it, but that is very difficult as we can see. Staying home sounds great but we are learning it is difficult, has other ramifications. But END ? no will not end.. but by then we should have learned how to contain it somewhat. ",
            "date": "Answered April 3, 2020",
            "views": "290",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Raynier Hoffman",
                    "user_href": "/profile/Raynier-Hoffman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cortez Copeland",
                "href": "/profile/Cortez-Copeland"
            },
            "answer_text": "End. Americans have an individual based culture. We are not always moved by the idea of sacrificing self (enjoyment, social pleasure, shopping habits, etc.) for the health of others. With this in mind I'd guess it'll take months before we get the idea. Given a vaccine won't come until the end of the year and the fact there may be a second wave reigniting everything mentioned so far, it'll hopefully be done by the end of the year. ",
            "date": "Updated April 5, 2020",
            "views": "379",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Busari Arundhati",
                    "user_href": "/profile/Busari-Arundhati"
                },
                {
                    "user_id": "Fraser Hornsby",
                    "user_href": "/profile/Fraser-Hornsby-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krister Sundelin",
                "href": "/profile/Krister-Sundelin"
            },
            "answer_text": "Q: Do you think the COVID-19 will end by the middle or year end? A: Given how long the 1917–1918 influenza, the Asian flu and the Hong Kong flu lasted, I think CoViD-19 will stay with us for a year and half to two years, which puts the formal end of the pandemic to the end of 2021 or spring 2022. ",
            "date": "Answered April 10, 2020",
            "views": "63",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gary Braithwaite",
                    "user_href": "/profile/Gary-Braithwaite"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zara Hassan",
                "href": "/profile/Zara-Hassan-42"
            },
            "answer_text": "well! it will depends on us what we do treat with this if we will follow the instructions of doctors then definitely it will be recovered. but if don't take any restrict action then it will take long time. Chen Renyi ’s eyes, Taiwan ’s society can not only face the virus but also continue to maintain economic activity, and help the world to help the United States and European countries. “Taiwan allows other countries to follow suit. This is a very remarkable message.” let me tell you situation off United state click on above link ",
            "date": "Answered April 26, 2020",
            "views": "110",
            "upvotes": " Answer requested by Busari Arundhati"
        },
        {
            "author_info": {
                "name": "John Talbot",
                "href": "/profile/John-Talbot-21"
            },
            "answer_text": "A2A. I am not an expert in virology, but I think it is difficult to say because the degree of enforced social distancing, and peoples adherence to those rules will determine the length of the time in question. ",
            "date": "Answered April 10, 2020",
            "views": "14",
            "upvotes": " Answer requested by Busari Arundhati"
        },
        {
            "author_info": {
                "name": "Claire Thomas",
                "href": "/profile/Claire-Thomas-143"
            },
            "answer_text": "this virus only killed .05% of the entire world and has been around since 2019 which means if you had the flu last year you are immune. Live Science ",
            "date": "Answered May 8, 2020",
            "views": "203",
            "upvotes": " Answer requested by Busari Arundhati"
        },
        {
            "author_info": {
                "name": "Joel Goldberg",
                "href": "/profile/Joel-Goldberg-21"
            },
            "answer_text": "NO ! ",
            "date": "Answered May 8, 2020",
            "views": "20",
            "upvotes": " Answer requested by Busari Arundhati"
        },
        {
            "author_info": {
                "name": "Kristin Jackson O’Shea Kittrell",
                "href": "/profile/Kristin-Jackson-O-Shea-Kittrell"
            },
            "answer_text": "No ",
            "date": "Answered April 6, 2020",
            "views": "20",
            "upvotes": " Answer requested by Busari Arundhati"
        }
    ]
}