{
    "title": "Do you think it’s possible to have a truly objective debate on any part of history? - Quora",
    "tags": [
        "Objectivity",
        "Debate",
        "World History",
        "History",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neil Sherman",
                "href": "/profile/Neil-Sherman-6"
            },
            "answer_text": "email sez: “Josh Batstone requested your answer Do you think it’s possible to have a truly objective debate on any part of history?” People paint elephants pink all the time, and pigs and donkeys have been launched through the skies with regularity, so yes, “anything is possible”. The statistical LIKELIHOOD of such a debate is what happens during those “a rabbi, a minister and a priest” jokes, THEY engage those debates BETWEEN THEMSELVES constantly. Then they step OUT of chambers and “The show must go on”. ",
            "date": "Answered September 8, 2020",
            "views": "21",
            "upvotes": " Answer requested by Josh Batstone",
            "upvoters": [
                {
                    "user_id": "Božo Sunara",
                    "user_href": "/profile/Božo-Sunara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Bauer",
                "href": "/profile/Mike-Bauer-12"
            },
            "answer_text": "for specialists, who understand the limits of writing or thinking up ‘history’, yes. objective in that they’re going to have a grasp on what can realistically be said. but, understand, they may be completely wrong about their own field. nothing they say objectively is going to keep the world ‘flat’ for them. ",
            "date": "Answered September 7, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ale Ćefo",
                "href": "/profile/Ale-Ćefo"
            },
            "answer_text": "Yes it's possible to have objective debate about history, however arriving at a convincing consensus is mostly not possible. ",
            "date": "Answered September 4, 2020",
            "views": "331",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ludwig Nijholt",
                "href": "/profile/Ludwig-Nijholt"
            },
            "answer_text": "First, debates are not intended to be objective. Second, history is not objective. I guess that explains why the answer here must be No. ",
            "date": "Answered September 7, 2020",
            "views": "14",
            "upvotes": " Answer requested by Josh Batstone"
        }
    ]
}