{
    "title": "Do you know anything about Polish refugees in Iran during World War 2? - Quora",
    "tags": [
        "Polish Ethnicities and People",
        "Refugees",
        "World Wars",
        "Iran",
        "World War II",
        "Warfare",
        "Military History and Wars ",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "AmirAli Dabouei",
                "href": "/profile/AmirAli-Dabouei"
            },
            "answer_text": "According to Wikipedia Following the Soviet invasion of Poland at the onset of World War II in accordance with the Nazi-Soviet Pact against Poland, the Soviet Union acquired over half of the territory of the Second Polish Republic or about 201,000 square kilometers (78,000 sq mi) inhabited by over 13,200,000 people. [1]  Within months, in order to de-Polonize annexed lands, the Soviet NKVD rounded up and deported between 320,000 and 1 million Polish nationals to the eastern parts of the USSR, the Urals, and Siberia. [2]  There were four waves of deportations of entire families with children, women, and elderly aboard freight trains from 1940 until 1941. The second wave of deportations by the Soviet occupational forces across the Kresy macroregion affected 300,000 to 330,000 Poles, sent primarily to Kazakhstan. [3]  Thanks to a remarkable reversal of fortune well over 110,000 Poles including 36,000 women and children managed to leave the Soviet Union with the Anders' Army. They ended up in {Iran}, India, Palestine, New Zealand, British Africa, as well as in Mexico. [4]  Among those who remained in the Soviet Union about 150,000 Poles perished before the end of the war. [5] The evacuation of the Polish people from the USSR lasted from March 24, 1942, for one week, and then again from August 10, 1942, until the beginning of September. In the first stage, over 30,000 military personnel, and about 11,000 children left Krasnovodsk (Turkmen SSR, present-day Turkmenistan) by sea for Bandar Pahlavi. In the second stage of evacuation from the interior, over 43,000 military personnel and about 25,000 civilians left with General Władysław Anders across the Caspian Sea to Iran. About one-third of the civilians were children. A smaller-scale evacuation to Ashkhabad-Mashhad followed, including the large and final group of civilians. So they didn’t actually live there much, they used Iran as a getaway path to Palestine/Israel and Africa which it didn’t lead to the really good stuff for Iranians, It happened while Iran was under Britain and Soviet Union control and famine, horrible economy and etc were in-between Iran. ",
            "date": "Answered October 24, 2020",
            "views": "142",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jack Pearson",
                    "user_href": "/profile/Jack-Pearson-166"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ludwig Luft",
                "href": "/profile/Ludwig-Luft-1"
            },
            "answer_text": "Well, the Poles in Iran were not refugees. They were deported to the Soviet Union from occupied Poland after the 1939 division. Some were mass-murdered (Katyn). Later, some were let go by the way of Iran to Palestine (British) and formed the 2nd Corp of the Polish Army in exile. Fought in Italy. Other deportees were pressed into a Soviet based and controlled Polish Army. Another Polish resistance was the AK ( internal army/guerilla). Never give up! ",
            "date": "Answered October 24, 2020",
            "views": "154",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rose Hadley",
                    "user_href": "/profile/Rose-Hadley-10"
                },
                {
                    "user_id": "Jarosław Musiał",
                    "user_href": "/profile/Jarosław-Musiał"
                }
            ]
        }
    ]
}