{
    "title": "Do you think rigid airships were a viable competitor to ocean liners back in the 1930s? - Quora",
    "tags": [
        "Ocean Liners",
        "Airships",
        "1930s",
        "Oceans",
        "Transportation",
        "Shipping",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leo Enticknap",
                "href": "/profile/Leo-Enticknap"
            },
            "answer_text": "Only two - the Graf Zeppelin and the Hindenburg - ever operated a commercial passenger and freight transportation schedule in anything approaching direct competition with ocean liners. Most of the others that tried were destroyed in accidents, taking most of their passengers and crew with them, before they carried a single fare-paying passenger or pound of cargo (and as we all know, so was the Hindenburg, but it did manage a year of commercial operation first). They only flew during the summer (good weather) months, with an average departure of once every 7–10 days between Germany and New York, and once or twice a month between Germany and Rio de Janeiro. If you wanted to go from or to anywhere else, you could not wait until a departure with an open booking was available, or could not afford the ticket (roughly, between the price of first and second class on a top rank liner), Zeppelin travel was not an option for you. Their freight capacity was also extremely limited - about the only thing they carried was time-sensitive mail. The bottom line is that rigid airships were too expensive, unreliable and dangerous to represent serious competition for ocean liners. That did not start to materialize until the emergence of turboprop airliners in the 1950s, and did not become an existential threat to transoceanic passenger transport by ship until the 707 and the DC-8 entered service. ",
            "date": "Answered May 10, 2020",
            "views": "100",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony VanCampen",
                    "user_href": "/profile/Anthony-VanCampen"
                },
                {
                    "user_id": "Monty Mason",
                    "user_href": "/profile/Monty-Mason-2"
                },
                {
                    "user_id": "James Michael Cavanagh",
                    "user_href": "/profile/James-Michael-Cavanagh"
                },
                {
                    "user_id": "Joel Hyland",
                    "user_href": "/profile/Joel-Hyland-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Matthews",
                "href": "/profile/Tom-Matthews-12"
            },
            "answer_text": "No, they were never really put up to be a competitor to ocean liners. Ocean liners can carry over a thousand passengers, have more space and luxury. They also have room in the cargo hold for tons of freight. The Hindenburg was more or less the same size as the Lusitania and could carry around 50 passengers and their luggage, no freight to speak of. They were more of the Lear jets or the Concordes of their time, though without the speed. A thing for the super rich to travel differently and a little bit faster than the rest, but also a bit of a dead end in the aircraft evolutionary tree. Airships were phased out in the 1930s because conventional airplanes were faster, cheaper and more reliable. They were also capable of carrying as many passengers. The Hindenburg ‘disaster’ looks spectacular, however as aviation disasters go, how many aircraft crash and the result is 62 of the 97 on board survive? There was a period when airships made perfect sense. When engines were less reliable, they were a safety option and in early ww1 they were able to be the 1st proper arial bombers with a degree of impunity, however by the 1930s they were obsolete, their only purpose being incredibly impresive and the fact they could stay in the air for days, affording the rich the best views money can buy ",
            "date": "Answered May 12, 2020",
            "views": "47",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anthony VanCampen",
                    "user_href": "/profile/Anthony-VanCampen"
                }
            ]
        }
    ]
}