{
    "title": "Do you think Mahatma Gandhi is not responsible for our independence? - Quora",
    "tags": [
        "Mahatma Gandhi",
        "History of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "K Vijay Kumar",
                "href": "/profile/K-Vijay-Kumar-9"
            },
            "answer_text": "Pearl S. Buck “He was right, he knew he was right, we all knew he was right. The man who killed him knew he was right. However long the follies of the violent continue, they but prove that Gandhi was right. 'Resist to the very end', he said, 'but without violence'. Of violence the world is sick. Oh, India, dare to be worthy of your Gandhi.” Rabindranath Tagore \"Mahatma Gandhi came and stood at the door of India's destitute millions, clad as one of themselves, speaking to them in their own language...who else has so unreservedly accepted the vast masses of the Indian people as his flesh and blood...Truth awakened Truth.” Quotation source:Google. I don't consider mahatma has a freedom fighter rather I consider him as a God and a preacher of truth and nonviolence who came to earth to teach us. I always seen people are debating about the role of Bapu in the independence of India, some people even uses bad words against him and criticise him about his nature. We always seen the agreesion is a key to win the battle. But Mahatma has broken and surprised everyone how the truth and nonviolence can be the biggest weapon even the bigger than any nuclear weapon. Mahatma Gandhi had the power to win the hearts of even his enemies. Yes iam sure due to Mahatma Gandhi our freedom delayed little and I respect our freedom fighter SUBHASH CHANDRA BOSE, MANGANL PANDEY, BHAGAT SINGH, RANI LAXMI BAI and many great leader are born and died of our nation to free us all. Yes may be without Bapu we may have achieved our freedom bit earlier but this world can never be known the truth that enemies can be defeated by love also… ",
            "date": "Answered July 3, 2017",
            "views": "297",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Priyank Gupta",
                    "user_href": "/profile/Priyank-Gupta-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepak S Fernandes",
                "href": "/profile/Deepak-S-Fernandes"
            },
            "answer_text": "No, and whoever thinks that Gandhi was not one of those responsible for Indian independence has not read much history. Gandhi was not SOLELY responsible for Indian independence — a lot of other players played roles in it. Gandhi’s idea of non-violence helped to shame the British into leaving. Many foreign writers like to think “oh, if the Nazis were there, Gandhi wouldn’t have won” — but forget that if the Nazis came or if the British were like General Dyer (Jallianwalla Bagh) all the time, then they would have been kicked out pretty quickly. The British ruled India through Indians. Gandhi’s brilliance was playing on British consciences and taking the moral high ground. By doing this, he was able to eliminate the divide-and-rule tactics and shame the English into leaving (you can’t very well claim to be fighting for democracy against the Germans if you don’t provide democracy to your colonies). But, as I repeat, Gandhi was not solely responsible ",
            "date": "Answered July 3, 2017",
            "views": "351",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priyank Gupta",
                    "user_href": "/profile/Priyank-Gupta-80"
                },
                {
                    "user_id": "Ayush Pandey",
                    "user_href": "/profile/Ayush-Pandey-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nitin S. Joglekar",
                "href": "/profile/Nitin-S-Joglekar"
            },
            "answer_text": "Q : Do you think Mahatma Gandhi is not responsible for our independence? A : For me giving credit of Indian independence to M K Gandhi is ‘sheer intellectual bankruptcy’. Was occupation of India a loss making business for British?Hardly 250,000 British [of which 50,000 were soldiers] were controlling this country of around 40 crores. Was it really difficult for British to crush the Indian ‘pacific freedom movement’?Was M K Gandhi & Co., really a threat to the British Empire?Was M K Gandhi & Co. the only group fighting forDid the British leave India willingly or they were forced to that?If they were forced to leave India, what forced them to leave India?If no individual but the circumstances did force the British to leave India, who created those circumstances? OR whose deeds caused creation of circumstances which forced British to leave India?Was Britain required to sign any agreement, deed, charter with a still stronger empire for providing military support in WW-2?Just think on these lines, the answer will automatically come out. ",
            "date": "Answered August 29, 2017",
            "views": "327",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manish Dubey",
                    "user_href": "/profile/Manish-Dubey-173"
                },
                {
                    "user_id": "Vivek Chauhan",
                    "user_href": "/profile/Vivek-Chauhan-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankshita Prasad",
                "href": "/profile/Ankshita-Prasad"
            },
            "answer_text": "Thanks for the A2A. Yes, of course. In my opinion, attributing India’s independence to Mr Gandhi defies objective assessment, academic integrity and logic. India does not owe its independence to any single entity. The political conditions of the world was so arranged (WW2, British bankruptcy, INA revolt, the rise of anti-colonial USA and Soviet Union etc) that it was impossible for India to rot under imperialism anymore. Hence, the claim of British leaving India because of a sudden development of benevolence triggered by witnessing Mr Gandhi demonstrating a hazy, incoherent and inconsistent adherence to the concept of 'Ahimsa' is far fetched. An imperial power does not suddenly recede because of 'conscience issues'. I agree Mr Gandhi was an important leader who had played some part in awakening the masses and leading them sporadically. But he was neither originator of the the idea of passive resistance/boycott that he is generally credited for, nor was he able to efficiently execute this well-formed chosen strategy. The Bengal revolutionaries had laid out the entire strategy of Passive Resistance as a political movement to achieve independence in 1905–1910, much before Mr Gandhi arrived on scene and added his brand of ‘ahimsa’ to it. It is true that British entertained Mr Gandhi to a certain extent and he could successfully bargain with them, but even they stood firm against his pressure when their vital interests were at stake. The British kid gloved Gandhi and his supporters throughout, allowed them the funding and the functioning since they hardly saw it as a threat to their existence. Many high ranking British officials including Viceroys Chelmsford, Linlithgow and Puckle (Director general of Intelligence in 1940) regarded Gandhi as an \"asset\". Ellen Wilkinson, who was a member of the British Parliament for several years , remarked after her visit to India in 1932 as a member of the India League Deputation that \"Gandhi was the best policeman the British had in India . Lastly, Chief Justice P.B. Chakrabarty discloses the following about his conversation with Clement Atlee, My direct question to him was that since Gandhi’s “Quit India” movement had tapered off quite some time ago and in 1947 no such new compelling situation had arisen that would necessitate a hasty British departure, why did they have to leave? In his reply Atlee cited several reasons, the principal among them being the erosion of loyalty to the British Crown among the Indian army and navy personnel as a result of the military activities of Netaji [Subhash Chandra Bose]. Toward the end of our discussion I asked Atlee what was the extent of Gandhi’s influence upon the British decision to quit India. Hearing this question, Atlee's lips became twisted in a sarcastic smile as he slowly chewed out the word, “m-i-n-i-m-a-l! Source: Why Brits disliked Netaji and made a Mahatma out of Gandhi2. Clement Atlee's Response on Gandhi's Role in Independence ",
            "date": "Answered July 6, 2017",
            "views": "13",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kartikey Kumar",
                    "user_href": "/profile/Kartikey-Kumar"
                },
                {
                    "user_id": "Ashok Prasad",
                    "user_href": "/profile/Ashok-Prasad-8"
                },
                {
                    "user_id": "Prem Manukonda",
                    "user_href": "/profile/Prem-Manukonda"
                },
                {
                    "user_id": "Rishita Rana",
                    "user_href": "/profile/Rishita-Rana-3"
                },
                {
                    "user_id": "Abhishek Varshney",
                    "user_href": "/profile/Abhishek-Varshney-7"
                },
                {
                    "user_id": "Mrinal Bhardwaj",
                    "user_href": "/profile/Mrinal-Bhardwaj-2"
                },
                {
                    "user_id": "Nikhil Singh",
                    "user_href": "/profile/Nikhil-Singh-355"
                },
                {
                    "user_id": "Pawan Sharma",
                    "user_href": "/profile/Pawan-Sharma-690"
                },
                {
                    "user_id": "Darshana Mathur",
                    "user_href": "/profile/Darshana-Mathur"
                },
                {
                    "user_id": "Ratul Singh Sodhi",
                    "user_href": "/profile/Ratul-Singh-Sodhi"
                },
                {
                    "user_id": "Manish Dubey",
                    "user_href": "/profile/Manish-Dubey-173"
                },
                {
                    "user_id": "Anasua Chakraborty",
                    "user_href": "/profile/Anasua-Chakraborty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thanga Tamil Selvan",
                "href": "/profile/Thanga-Tamil-Selvan"
            },
            "answer_text": "90 % of population did not know, care and fight for freedom, before Mahathma. It was the kings and his nieces fight against the British first. Then the most educated, royal youth fight against british by giving speech in star hotels. That fight did not include you and me. When we were included, there was a chance to receive it in 1930s. We are not ready to free our exploitations on others legally/ t was him to realise what was it to us and british. ",
            "date": "Answered July 8, 2017",
            "views": "148",
            "upvotes": " Answer requested by Manish Dubey"
        }
    ]
}