{
    "title": "Does war stimulate the economy? - Quora",
    "tags": [
        "International Economic Policy",
        "Macroeconomics Policy",
        "Economics (college major)",
        "Economic Policy",
        "Macroeconomics",
        "International Economics",
        "Warfare",
        "Military History and Wars ",
        "Finance",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Donley",
                "href": "/profile/Paul-Donley-1"
            },
            "answer_text": "Yes, it always has. In ancient times, conquering neighboring lands and setting off to build an empire meant booty and slaves. Ordinary soldiers kept what they could find, and the commander's power and wealth gained quickly. Most of that wealth went back to the lands of the conqueror.  For the conquered lands, the need to pay taxes to the conqueror and survive stimulated production, and opened up trade opportunities with the rest of the empire.  Rome became the first million person city by conquest and trade under the infamous Pax Romana. There was a limit to this sort of stimulation though; more for the conqueror than for the conquered. Sooner or later, the conquerors found their forces overextended. They ran out of soldiers to occupy the conquered lands and the logistics of keeping soldiers in faraway lands became impossible.   No matter how superior their forces in technique or technology, defending the empire was too expensive; and with soldiers spread too thin it became too expensive to conquer more lands to loot. The empire itself got looted.  Rome's last really profitable war was with Dacians to the north, circa 100 AD by Trajan. The gold from Dacia was enough to build the Colosseum and many well known monuments.  Although Rome would hold its vast empire for 300 more years and conquer many more lands, the costs of defending the empire became far greater than conquest could provide. Although many Romans weren't aware of it, it was trade and taxes that sustained the huge city of Rome. Successful empires before and after Rome found trade produced more wealth than conquest. The economic model of war changed dramatically with the advent of the Industrial Revolution. Industrialized war led to the concept of Total War, where conquest was achieved by destroying the enemy's ability to make the weapons of war. Civilians and industry were as important as targets as armies. War changed dramatically in the mid 19th century when Gen Sherman introduced the concept of Total War. War became something that was financed with bonds issued by warring parties. It became a sort of bet: the winner's bonds were valuable but the loser's bonds were worthless. Houses in Europe became wealthy or destroyed by the results of war. The expectations of  the conquest model persisted until well into the 20th century. The Versailles Treaty reparations are an example.  If you look at the way countries were organized to mass produce weapons during WWII, economic activity was at once rationed and active. In the US, nearly everyone had a job during the war. Huge fortunes were made in war materiel production. The challenge was to meet the returning soldiers' expectations of full employment. War torn Europe recovered slowly. Churchill was dumped almost immediately after the war in favor of a Labor government promising consumer products and jobs. If it had not been for the Marshall Plan, conceived in response to the very real threat of Soviet invasion, Europe might still be struggling with the devastation of WWII. (It was only in 1998(?) that Britain paid off its war debt to the US.) During the Cold War, two profitable versions of war came about: 1) war by proxies that had to be armed and trained; and 2) perpetual war where the fears were never quite realized but never subsided. War became a technology race driven by propaganda.  The changes over the centuries are dramatic. It's no longer profitable to conquer and loot. The goal is to control resources and industrial capacity. But yes, war has always been profitable. ",
            "date": "Answered May 4, 2016",
            "views": "1",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christian Valdivia",
                    "user_href": "/profile/Christian-Valdivia-11"
                },
                {
                    "user_id": "Nishank Gupta",
                    "user_href": "/profile/Nishank-Gupta"
                },
                {
                    "user_id": "Hergen Junge",
                    "user_href": "/profile/Hergen-Junge"
                },
                {
                    "user_id": "Alistair Thompson",
                    "user_href": "/profile/Alistair-Thompson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nate Carmody",
                "href": "/profile/Nate-Carmody"
            },
            "answer_text": "War stimulates an economy less effectively than throwing a brick through your own window. Keynesian economics is based on the belief that the short-term effects of the broken window being repaired are a net positive to the economy, as the window is repaired by the glazer who gets paid and buys a new hat, whereby the hat store owner buys more hats from their supplier, who buys … This short term effect is thought to outweigh the long term effect of the increase in debt brought on by paying to replace something that didn’t need to be replaced before you deliberately broke it. Like all debt financed purchases, this only works in the short term. Notably, the wartime economy is less effective than this ideal model because: People are killed, people who could be effective efficient participants in the economy, so the economy’s human capital is reduced.Spending on war goods warps the economy. The glass manufacturer in the example above has real uses in a peacetime economy, as people need glass and having efficient glass production benefits the economy in the long term. Spending on smart bombs does not have the same carryover, and transferring human and infrastructure capital to produce missiles and bombs keeping the people and money from helping the economy get more efficient at doing things the benefit people (building cars, opening a restaurant, widening that highway were you are stuck in a traffic jam every evening, …).The unpredictability of war makes everyone, companies and individuals, nervous about the uncertainties involved. Uncertainty leads to lower investment and higher interest rates. This reduces capital investments and lowers growth rates.Throwing a brick through your own window hurts you by either increasing your debt (you had to pay to fix the window), or reducing your ability to be better off because you don’t have as much money to invest in other things that benefit you (your retirement account, a new handbag, the latest iPad,…). That is identical to the way war spending hurts the economy over the long run - less money to spend on things that actually benefit the economy. Additionally, and contrary to what you can derive from an economics textbook full of figures, algorithms, and charts, long term economic growth comes from increasing economic efficiency. Efficiency increases are the result of some combination of more effective workers, better use of technology, better infrastructure, efficient regulations, and open inexpensive capital. Wars correlate to reduction in human capital, inefficient use of technology advances, wrecked infrastructure, more restrictive regulations, and increased cost of capital. While World War 2 provided a production stimulus to the US economy, people did not benefit in terms of their standard of living until after the war was over and the economy returned to a peace-time economy where meat wasn’t rationed, automobiles were produced, records were made again, and personal freedoms were increased. WW2 provided less of a production stimulus to other countries as they were constantly getting their factories blown up and cities burned. ",
            "date": "Answered May 17, 2016",
            "views": "718",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benjamin Fanjoy",
                    "user_href": "/profile/Benjamin-Fanjoy"
                },
                {
                    "user_id": "Stephanie Seaton",
                    "user_href": "/profile/Stephanie-Seaton-8"
                },
                {
                    "user_id": "Craig Meiser",
                    "user_href": "/profile/Craig-Meiser"
                },
                {
                    "user_id": "Priyanka Bhosale",
                    "user_href": "/profile/Priyanka-Bhosale-9"
                }
            ]
        }
    ]
}