{
    "title": "Does Anubis, the Egyptian god, actually exist? - Quora",
    "tags": [
        "Egyptian Gods and Goddesses",
        "Ancient Egypt",
        "Egypt",
        "Existence",
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Billy Budd",
                "href": "/profile/Billy-Budd-9"
            },
            "answer_text": "Anubis was, most likely, a genetically modified human. I suspect that the Anunnaki created this creature using existing DNA from jackals/dogs and humans. Note the ANU prefix which is derived from Anu, the Sky God and founder of the Anunnaki. The Anunnaki were tetraploid humans with extremely advanced knowledge including genetics. It was Enki of the Anunnaki that actually created Adam and Eve using existing humans and perhaps bonobos (see Secrets of the PInk Kush for reason). They wanted to create their own version of humans that would obey them. I suspect they made Anubis in order to protect the entrance to their domains. There have been many eyewitness accounts of Dog faced men and Werewolves, both of which are bipedal. They appear to be guarding something in the burial mounds. See the Beast of Bray Road for an example of such eyewitness accounts and this strange behaviour. This does not necessarily prove the existence of Anubis but I would certainly not rule out the existence of such a beast. They may in fact, be related to the Sasquatch which has been proven to exist. I also suspect that Sasquatch are also genetically modified (see story of Esau in the Old Testament) and are guardians of the tetraploid humans. source: Secrets of the Pink Kush ",
            "date": "Answered October 4, 2020",
            "views": "127",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amy Rosander",
                    "user_href": "/profile/Amy-Rosander"
                },
                {
                    "user_id": "Bernadette Dunn",
                    "user_href": "/profile/Bernadette-Dunn-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jade McLove",
                "href": "/profile/Jade-McLove"
            },
            "answer_text": "I’ve seen Anibus…twice. Once as a solid figure standing in my Kitchen and once sitting in a parked car right infront of the restaurant I was eating. More like a Ghost. I believe that the Egyptian Gods want us (americans) to bring them into being into our realm once again. I’m a powerful propet who in dreams can cross over into the underworld. Which is probably why Anibus is interested in me. Ever since I did it I have seen him twice now. The secound time I saw a human skull of death, under the Jackels head. But then I’ve seen I Am the Jewish God in a dream, and the Apocolyptic version of Jesus Christ, white hair and fiery eyes in a dream. But I have never seen either like that in real life. Only Anibus have I seen right in front of me. I’m just really wondering…why? ",
            "date": "Answered September 22, 2017",
            "views": "32",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bernadette Dunn",
                    "user_href": "/profile/Bernadette-Dunn-6"
                },
                {
                    "user_id": "Stir Fry",
                    "user_href": "/profile/Stir-Fry-27"
                },
                {
                    "user_id": "James Hicks",
                    "user_href": "/profile/James-Hicks-73"
                },
                {
                    "user_id": "Kaira Murray",
                    "user_href": "/profile/Kaira-Murray"
                },
                {
                    "user_id": "Debra Joy",
                    "user_href": "/profile/Debra-Joy-11"
                },
                {
                    "user_id": "Ryann Bong",
                    "user_href": "/profile/Ryann-Bong"
                },
                {
                    "user_id": "Wes Phillips",
                    "user_href": "/profile/Wes-Phillips-17"
                },
                {
                    "user_id": "Liam Dowler",
                    "user_href": "/profile/Liam-Dowler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Curt Brasier",
                "href": "/profile/Curt-Brasier"
            },
            "answer_text": "Gods and Goddesses are said to ‘exist’ so long as people continue to put their energy and beliefs in them. I happen to know that in the North African area many people continue to worship the Egyptian gods, goddesses and mythologies. I also am aware of thousands of Egyptian Wiccan Witches. So, I am positive that Anubis actually exists to these thousands of people. Can anyone actually prove that a deity exists? Not so much! My conclusion is that if any single deity really exists, then they all do! Here’s something to consider: When Moses was being raised in Pharaoh’s Court, the God Amun was Pharaoh’s favorite deity. So, Moses ended every prayer with the Egyptian word ‘AMEN’! This word translates in English as ‘Hail Amun’! Millions of Christians around the world jubilantly repeat this phrase on a regular basis! So I ask: Does Amun exist? Blessed Be! Storm )O( ",
            "date": "Answered September 25, 2018",
            "views": "13",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stir Fry",
                    "user_href": "/profile/Stir-Fry-27"
                },
                {
                    "user_id": "Brady Vandenbulcke",
                    "user_href": "/profile/Brady-Vandenbulcke"
                },
                {
                    "user_id": "Catrina King",
                    "user_href": "/profile/Catrina-King-10"
                },
                {
                    "user_id": "Caitlan Yap",
                    "user_href": "/profile/Caitlan-Yap"
                },
                {
                    "user_id": "Brandon Deitzel",
                    "user_href": "/profile/Brandon-Deitzel"
                },
                {
                    "user_id": "Ryann Bong",
                    "user_href": "/profile/Ryann-Bong"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Freyburger",
                "href": "/profile/Doug-Freyburger"
            },
            "answer_text": "If you mean physical existence zero people have ever produced evidence that any deity has a physical existence. Videos are welcome if you can produce the evidence. That limits the type of existence but it's not the only type. The majority never have direct personal experience of deities. A minority have always had direct personal experience of deities. Anubis included. Not one of the few who I have experienced but you didn't ask about the clan of Odin. I don't know what exist means in this context. Real to the people who have the experiences is not proof of existence. ",
            "date": "Answered May 2, 2017",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Catrina King",
                    "user_href": "/profile/Catrina-King-10"
                },
                {
                    "user_id": "Ryann Bong",
                    "user_href": "/profile/Ryann-Bong"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Raxana"
                },
                {
                    "user_id": "Prafful Allamraju (प्रफुल అల్లంరాజు)",
                    "user_href": "/profile/Prafful-Allamraju-प्रफुल-అల్లంరాజు"
                },
                {
                    "user_id": "Predrag Maksimovich",
                    "user_href": "/profile/Predrag-Maksimovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Predrag Vuleta",
                "href": "/profile/Predrag-Vuleta"
            },
            "answer_text": "Yes and no. Depends on how you define “existence”. If we say that Anubis was an entity, then we could say that Anubis still exists as an entity, in whichever transcendental state or multiuniverse we could find his egoic focus. There is no temple or worshiper of Anubis in this dimension, so in that context we could say that Anubis does not exist. We could also say that all Gods represent archetypes of Superconsciousness, in which case we could state that Anubis exists, but his form may have transfigured into other more contemporary manifestations. ",
            "date": "Answered April 22, 2017",
            "views": "25",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Ryann Bong",
                    "user_href": "/profile/Ryann-Bong"
                },
                {
                    "user_id": "Aditya Aman",
                    "user_href": "/profile/Aditya-Aman-14"
                },
                {
                    "user_id": "Alien Traderz",
                    "user_href": "/profile/Alien-Traderz"
                },
                {
                    "user_id": "Prafful Allamraju (प्रफुल అల్లంరాజు)",
                    "user_href": "/profile/Prafful-Allamraju-प्रफुल-అల్లంరాజు"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clarence Sherrick",
                "href": "/profile/Clarence-Sherrick"
            },
            "answer_text": "Anubis ( a Greek designation) was the guardian of the Afterlife in Egyptian spiritual mythology…. also responsible for the art of mummification. Originally thought to have the head of a Jackal. It is now indicated by scientific evidence that his head actually represented wild dogs to be found in the Egyptian desert. The existence of Anubis is entirely a “belief” system. If you truly believe Anubis exists then he does….at least to you. However, the worship of Anubis has greatly declined and would now be classified as a “cult.” ",
            "date": "Answered May 1, 2017",
            "views": "19",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brady Vandenbulcke",
                    "user_href": "/profile/Brady-Vandenbulcke"
                },
                {
                    "user_id": "Catrina King",
                    "user_href": "/profile/Catrina-King-10"
                },
                {
                    "user_id": "Ash Lynx",
                    "user_href": "/profile/Ash-Lynx-8"
                },
                {
                    "user_id": "D.R. Cremonese",
                    "user_href": "/profile/D-R-Cremonese"
                },
                {
                    "user_id": "Luan Nguyen Thanh",
                    "user_href": "/profile/Luan-Nguyen-Thanh-7"
                },
                {
                    "user_id": "Ryann Bong",
                    "user_href": "/profile/Ryann-Bong"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Greg Raines",
                    "user_href": "/profile/Greg-Raines-3"
                },
                {
                    "user_id": "Jeff Honebrink",
                    "user_href": "/profile/Jeff-Honebrink"
                },
                {
                    "user_id": "Prafful Allamraju (प्रफुल అల్లంరాజు)",
                    "user_href": "/profile/Prafful-Allamraju-प्रफुल-అల్లంరాజు"
                },
                {
                    "user_id": "Juno DeLorenzo",
                    "user_href": "/profile/Juno-DeLorenzo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Baryla",
                "href": "/profile/Jason-Baryla"
            },
            "answer_text": "No proof of Anubis has ever surfaced, save for some heiroglyphs. And pictures from a few thousand years ago is not very good evidence. So it’s safe to say that Anubis probably doesn’t exist. ",
            "date": "Answered April 21, 2017",
            "views": "991",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert L Hill",
                    "user_href": "/profile/Robert-L-Hill"
                },
                {
                    "user_id": "Tamer Mess",
                    "user_href": "/profile/Tamer-Mess"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Williams",
                "href": "/profile/Robert-Williams-670"
            },
            "answer_text": "Hell No ",
            "date": "Answered December 11, 2017",
            "views": "278",
            "upvotes": "0"
        }
    ]
}