{
    "title": "Does the Devanagari script really the most scientific script in the world? If yes, then why are others ignoring it? - Quora",
    "tags": [
        "Devnagri",
        "Script (language)",
        "Devanagari (script)",
        "Writing Systems",
        "Languages of India",
        "Linguistics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Subrahmanyam Marripoodi",
                "href": "/profile/Subrahmanyam-Marripoodi"
            },
            "answer_text": "Not just Devanagari, but no traditional script is scientific enough, partly because no script is actually capable of representing all the sounds pronounced by the speakers of a particular language with which it is associated. Also , partly because, each script has in itself certain irrational or irregular features of orthography. However, we are given to a false fanatical notion that our scripts are all-perfect, as we are used to adjusting with their inadequacies and to unconsciously vesting each symbol with several unrecognised phonetic properties. In the particular case of Devanagari, it too cannot represent all the sounds vocalized by Hindi speakers, because it has not been the original or own script of Hindi. So it has no vowel and the secondary symbol thereof, to represent the ‘e’ sound in words like पहले, महक, कहना etc. It needed to use dots like in Urdu to indicate certain other sounds. Even now, it does not have a separate character to indicate the [f] sound and as such, uses the letter फ [pha] in its place. Don’t think that I am faulting Devanagari alone. I am telling you this, because you have asked about that script. The script of my own mother tongue, Telugu suffers no less from a few similar inadequacies, though adjudged as the second best script of the world. I am trying to remedy this situation. But my success depends on how far the novelties introduced by me would receive the nod of the press, media, governments and more importantly, software experts. Coming to the second part of your question : By “Others ignoring Devanagari” , if you mean to say “others are not adopting it” - let me tell you a fact. Devanagari is not popular with others because they have scripts similar to it which do just as fine for all purposes. Besides, Devanagari does not have certain sounds peculiar to non-Aryan languages. For example, Telugu script has 5 -6 letters in extra, compared with those of Devanagari. Moreover, Deanagari is used for writing schwa-deleted languages like Hindi, Marathi and Nepali and therefore, became a schwa-deleted script itself. So it cannot be adopted by schwa-compliant languages like Telugu. ",
            "date": "Answered February 29, 2020",
            "views": "594",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aakrisht Utsav",
                    "user_href": "/profile/Aakrisht-Utsav-1"
                },
                {
                    "user_id": "Satyadev Badireddi(బదిరెడ్డి సత్యదేవ్)",
                    "user_href": "/profile/Satyadev-Badireddi-బదిరెడ్డి-సత్యదేవ్"
                },
                {
                    "user_id": "Yegireddi Vamsi ( యేగిరెడ్డి వంశీ )",
                    "user_href": "/profile/Yegireddi-Vamsi-యేగిరెడ్డి-వంశీ"
                },
                {
                    "user_id": "Sachchidanand Swami",
                    "user_href": "/profile/Sachchidanand-Swami"
                },
                {
                    "user_id": "Vamsi Krishna Nukala",
                    "user_href": "/profile/Vamsi-Krishna-Nukala-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Victoria-Gardens-3"
                },
                {
                    "user_id": "Kumar Dhanapal",
                    "user_href": "/profile/குமார்-தனபால்-Kumar-Dhanapal"
                },
                {
                    "user_id": "Srikanth Throvagunta",
                    "user_href": "/profile/Srikanth-Throvagunta"
                },
                {
                    "user_id": "Goutham R",
                    "user_href": "/profile/Goutham-R-22"
                },
                {
                    "user_id": "Siva Teja",
                    "user_href": "/profile/Siva-Teja-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Uma Maheshwar G",
                "href": "/profile/Uma-Maheshwar-G"
            },
            "answer_text": "Yes! But it's not really the only one! The Devanagari script is one of the many scripts that developed from the ancient Brahmi script known from the 4–5 century BC. There are about two hundred scripts that are derived from the ancient Brahmi. They are spread across many languages of south Asia and South East Asia. The Brahmi script was designed on the scientific basis of “places and manner of articulation” features. This feature is exactly the basis for the modern International phonetic chart. All the modern Brahmi derived scripts, viz. Devanagari, Bangla, Asamiya, Odiya, Telugu, Kannada, Sinhala, Malayalam, Tamil etc. have inherited the same design feature. The Brahmi and all its derivatives are classfied as abugida type of alfa-syllabery class where each character represents a syllable. Devanagari is not only a distinct type face but also has its own idiosyncrasies. Some of these contribute to the unscientific characteristics of the devanagari writing system. For example: It is a common practice to follow the writing scheme from left to right and top to bottom in sequencing the sounds. But this is violated in the following cases: 1. Transcribing the diacritic ि 'i' on the left side of the consonant(s) as in: Script -===Roman = phonetic Sequence sequence equivalence कि ====== (ik) = [ki], स्कि ====== (isk) = [ski], म्स्कि ===== (imsk) = [mski], र्कि ======= (irk) = [kri], र्स्कि ====== (irsk) = [rski]. 2. Similarly, writing vowel diacritics of ए i.e. े and ऐ i.e.ै as in के (ek) for [ke] and कै (aik) for [ Kai] are violations of the normal order of reading (read top to bottom). 3. The vertical stroke found with consonants represents an inherent vowel by -ा [ a]. This vertical stroke along with the vowel gets deleted whenever the consonant like स [sa] is combined with another consonant like क [Ka] as in the following स्क [ska]. But it doesn't happen with every consonant as in कटठडढदरह where in क्क, ट्क, ठ्क, ड्क, ढ्क,द्क,र्क, ह्क। These are not normal renditions.Therefore they are irregular. In other words, Devanagari is not the most scientific as claimed, but certainly devanagari writing scheme is far far better than or scientific than any non-Brahmi derived orthographies of the world. Some of these irregularities do not occur in other Brahmi derived scripts but there are other kind of irregularities. The Devanagari script is a writing system, whereas, the international phonetic alphabet is not a writing system but a comprehensive scheme that represents possible sounds in the human languages. Next to the Brahmi derived scripts, the Korean script is the one that is organized reflecting the articulatory positioning of the organs of speech. However, ordering scheme of the symbols of the sounds is based on the Brahmi derived script scheming i.e. writing from left to right and top to bottom. ",
            "date": "Updated March 11, 2020",
            "views": "485",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aditya Shri",
                    "user_href": "/profile/Aditya-Shri-2"
                },
                {
                    "user_id": "Subham Kumar Senapati",
                    "user_href": "/profile/Subham-Kumar-Senapati"
                },
                {
                    "user_id": "Gadarla Rohit",
                    "user_href": "/profile/Gadarla-Rohit"
                },
                {
                    "user_id": "Pranith",
                    "user_href": "/profile/Pranith-5"
                },
                {
                    "user_id": "Shashanka Bhat",
                    "user_href": "/profile/Shashanka-Bhat-1"
                },
                {
                    "user_id": "Mukunda",
                    "user_href": "/profile/Mukunda-10"
                },
                {
                    "user_id": "Srikanth Throvagunta",
                    "user_href": "/profile/Srikanth-Throvagunta"
                },
                {
                    "user_id": "Narasimhan Ramabhadran",
                    "user_href": "/profile/Narasimhan-Ramabhadran"
                },
                {
                    "user_id": "Ashutosh Shukla",
                    "user_href": "/profile/Ashutosh-Shukla-222"
                },
                {
                    "user_id": "Chandrapati Rajyarama",
                    "user_href": "/profile/Chandrapati-Rajyarama"
                }
            ]
        }
    ]
}