{
    "title": "Does wealth create poverty? - Quora",
    "tags": [
        "Wealth Vs. Poverty",
        "Public Policy",
        "Economic Policy",
        "Poverty",
        "Economics of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Soroushian",
                "href": "/profile/John-Soroushian"
            },
            "answer_text": "No one has to become poorer for someone else to become wealthier. In the Stone Age, everyone was poor and no one was wealthy. As the global economy grew and wealth was created, the percentage of poor people dropped and wealthy people increased.  Wealth is created by delivering value to people. I can create wealth by providing you with a good or service you are willing to pay me for. Both of us should be made better off by this process. Existing wealth can finance more wealth creation. A wealthy investor can use her resources to finance an entrepreneur developing a new product. The success of this product can make the investor and entrepreneur wealthier, while benefiting consumers. Wealth creation can help reduce poverty. A poor person can build a pizza business that grows into a multinational corporation making himself wealthy in the process. He can hire other poor people to help him run this business, lifting them out of poverty too. Wealth creation does not always guarantee poverty reduction. A new product that automates car production should on net create wealth, but it can also throw many autoworkers out of work and into poverty. However, newly created wealth can help those disrupted by the wealth creation process. The wealth created by the car automation process can be used to finance unemployment assistance and new job training to compensate the autoworkers that were most hurt by it. Wealth is socially harmful when used to partake in rent-seeking activities. A dictator using his money to hire thugs to loot his country for personal benefit is engaging in rent-seeking activity that is socially harmful and will likely increase poverty in his country. Rent-seeking is something we should all be concerned about.  There are a lot of nuances to wealth and the wealth creation process, but wealth does not have to come at the expense of other people. In fact, wealth creation is often a tool for lifting people out of poverty. ",
            "date": "Updated October 23, 2017",
            "views": "53",
            "upvotes": " View 68 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Linda Mhayise",
                    "user_href": "/profile/Linda-Mhayise"
                },
                {
                    "user_id": "Nk Lprasadh",
                    "user_href": "/profile/Nk-Lprasadh"
                },
                {
                    "user_id": "Adi Primanda Ginting",
                    "user_href": "/profile/Adi-Primanda-Ginting"
                },
                {
                    "user_id": "Snuffles",
                    "user_href": "/profile/Snuffles-15"
                },
                {
                    "user_id": "Tejas Kannampuzha",
                    "user_href": "/profile/Tejas-Kannampuzha"
                },
                {
                    "user_id": "Le Sellers",
                    "user_href": "/profile/Le-Sellers"
                },
                {
                    "user_id": "Tarang Ranpara",
                    "user_href": "/profile/Tarang-Ranpara-1"
                },
                {
                    "user_id": "Jayanth Krishnan",
                    "user_href": "/profile/Jayanth-Krishnan-4"
                },
                {
                    "user_id": "Rakesh Jeswani",
                    "user_href": "/profile/Rakesh-Jeswani-1"
                },
                {
                    "user_id": "Danyel Kanlibicak",
                    "user_href": "/profile/Danyel-Kanlibicak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pascal Morimacil",
                "href": "/profile/Pascal-Morimacil"
            },
            "answer_text": "Wealth IS poverty. When one person has more rights than another, that is wealth. When one person has fewer rights than another, that is poverty. One cannot exist without the other. One person cannot have more rights without another person having fewer rights. For example, quora could just be a website where people ask and answer questions, but then no wealth would be created. If instead, some people can display their content, and others cant, then that is a disparity in rights. It can be leveraged to create wealth, profit, etc. Selling advertising space for example. If you produce goods and services, but are not restricting access, then you are not making a profit. Public schools provide education to everyone, and so cost money. By reducing inequality, they make the opposite of profit, they cost money. Private schools provide education too, but that access is restricted. So they can increase inequality, and make profits. If firefighters just put out fires where needed, then they are a costly public service. If they can leverage a burning home with a child inside, they could be making huge profits. Using the fires to create massive inequality. Wealth/poverty. If you work in a restaurant during the day, and volunteer at a soup kitchen in the evening, the work being done, of preparing food, is going to be pretty much the same. Yet in one case, access to the food is restricted, food might go to waste if people cant pay, so there is a profit to be made, wealth inequality to be created. One person can eat, and another can starve. In the soup kitchen, access to food is not restricted, so there is no wealth inequality being created, no profit, no wealth. In fact, the opposite: wealth is used up to decrease poverty. ",
            "date": "Answered January 3, 2018",
            "views": "559",
            "upvotes": "0"
        }
    ]
}