{
    "title": "Does the discovery of an immense 12,000 year old megalithic ceremonial center at Gobekli Tepi invalidate how we thought civilisation first began? - Quora",
    "tags": [
        "Göbekli Tepe",
        "Archaeology",
        "Anthropology",
        "Conspiracy Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aidan Colyer",
                "href": "/profile/Aidan-Colyer"
            },
            "answer_text": "As with anything scientific (that includes archaeology) it would take a lot to completely invalidate how we think civilisation began. Our thoughts on the subject and the dates can change but that doesn’t necessarily mean that the themes are out of whack. Consider for a moment the iron age or the bronze age. These are old classifications that have slowly changed over the years as more research has come to light. Most people view the ages as an ‘oh they started to use X so it switched as soon as the ore was chucked into the furnace etc.’. In reality flint tools were used right through the Bronze age and into the iron age. If you really think about it the use of flint didn’t stop entirely. Gun flints are a thing and that is much later. While not as pervasive as the lithic ages you still see people using flint in the modern ages. I know I have made rudimentary tools to cut string or sharpen pencils. There has even been reuse of lithic technologies in surgery. So what does that have to do with your question? Well it shows that the Ages we ascribe to things and the periods are relatively arbitrary. Just because some bright spark decided they wanted to use flint or obsidian in the operating theatres of the post modern era doesn’t mean we have to rewrite the lithic ages. (This is an article about the use in modern times How Stone Age blades still cut it in surgery ) The relevance to how civilisation started is the same. It will change things but not necessarily cause a complete rewrite. The age of human construction will certainly be pushed earlier as has happened with the Bronze age as items are more closely dated and new sites discovered (while an older article this is the type of thing I am talking about Carbon-14 and the Beginning of the Late Bronze Age in the Aegean). Where the issues come are with chronological dating. We currently use a lot of Absolute dating but the original age system was a relative chronology. (I double checked wikipedia and it gives a decent enough run down there so I wont go into it in a lot of detail). The upshot is that in archaeological circles there may be excitement it doesn’t invalidate but enriches the knowledge. So what about the themes? That is where there will be slightly more change. I will throw a quick summary of the formation of civilisation and we can see if it fits. Civilisation is where there are sedentary peoples who have formed a society that has enough excess to have non production jobs such as priests and artists. It is a society that allows a bureaucracy to administer. Now that is very rough and people could nit pick with a lot of it (and likely will in the comments especially the sedentary bit but I digress). The essential part is how does Gobekli Tepe change any of that? Now it may push back the dates of when humans could and did come together to create megalithic structures but that in itself doesn’t make a civilisation. One monument doesn’t make a civilisation. One thing that may change is the impetus for the forming of civilisations and whether groups before the early civilisations could come together in large numbers. We already know that groups could do this by places such as Silbury hill. What about the ceremonial nature. Well what was the ceremony? As archaeologists the old joke of if in doubt it is ritual comes from sites like this. We don’t have any written descriptions of ceremonies what we do have is a bunch of very educated people making educated guesses. Consider this for a second. Lots of rural places have that one tree where the kids hang out. it ends up with initials and love hearts carved into it. This happens in urban areas as well. That is because humans follow patterns. It was the place to hang out for 2–3 generations possibly. That is an easy concept for us. Now consider something like the site in question. Until we have a lot more analysis this site could have been built and decorated and reused over many generations. That’s just because that is where they always went because their parents took them there and so on. When you have what looks like a ceremonial centre it doesn’t necessarily mean religion or faith. Hell it doesn’t necessarily mean that the place had set ceremonies and priests or bureaucrats or leaders. People are social and meet up. In an age with relatively few identifiable places short of particular mountains or rivers etc (at that size its not as if you can have an accurate place of meeting) having a built place that could be used to meet at is an advantage. From the description we can see that this site does have some hallmarks of a civilisation. Those strands of civilisation can be drawn backwards and it increases the likelihood of earlier traces of civilisation being found. So in conclusion. It doesn’t necessarily invalidate the ideas wholesale. There may be a shake up in how we consider societies to have come together. Absolute dating doesn’t invalidate themes either. Whatever happens it will change the theories but it wont invalidate theories by its mere existence impressive though it might be. Thanks for the A2A ",
            "date": "Answered January 10, 2017",
            "views": "731",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zack Phillips",
                    "user_href": "/profile/Zack-Phillips-8"
                },
                {
                    "user_id": "Eric Vicini",
                    "user_href": "/profile/Eric-Vicini"
                },
                {
                    "user_id": "Elizabeth Gonzales",
                    "user_href": "/profile/Elizabeth-Gonzales-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Emra",
                "href": "/profile/Michael-Emra"
            },
            "answer_text": "Probably not. Gobekli Tepi in Turkey is a megalithic site comprised of rings of carved limestone slabs. The first phase of the site’s construction is dated to around 10,000 BC (11,500 BP).  An artist’s reconstruction of Gobekli Tepi. This means it predates the Neolithic Revolution; when humans first made permanent settlements in the Fertile Crescent where they domesticated plants and animals. Megalithic construction is a hallmark of Neolithic cultures all over the world. These massive projects brought a community (or many of them) together to construct things like henges and stone circles. Conventional wisdom says that these are the product of complex societies. In order to invest hundreds of thousands of man-hours into their construction, there must be a reliable source of surplus food, and someone who controls it. These projects can be seen as a way of re-enforcing the identity of a community by staking their claim on a landscape, but also by coming together and producing something as a group. Gobekli Tepi defies this conventional wisdom. Klaus Schmitt, the archaeologist that has investigated the site since the mid 90s, says Gobekli Tepi shows it is the other way around; complex societies with their permanent settlement and domesticated crops and animals, are the product of megalithic culture. His argument is that Gobekli Tepi, or the first phase of it, was built by mesolithic hunter-gatherers. Mesolithic people travelled the landscape, following migrations of animals and the seasons. They didn’t have permanent, year-round settlements. This is borne out not just by radiocarbon dates, but also by the animal bone assemblages, showing a distintly wild animal profile. At Gobekli Tepi, it appears that the demands of its construction forced them to settle, plant crops and husband animals. This is what is, potentially, so revolutionary about it. As Ian Hodder put it ‘The temple preceded the city’. But there are problems. Schmitt is saying ‘this temple I have discovered proves that all sedentary civilisations are the product of megalithic construction’. Well, no, it doesn’t. The evidence is very good that at Gobekli Tepi it did, and that’s wonderful and something we didn’t know before, but that doesn’t translate into a new universal truth about all sedentary civilisations, everywhere. We know that the shift to sedentary lifestyles occurred independently in several places in the Fertile Crescent as a response to similar environmental conditions. Plenty more groups did not develop agriculture. There are still essentially pre-agricultural societies today who live nomadic lifestyles. Archaeologists were once very keen on finding these universal rules to human development. I would hazard a guess that Schmitt is still of this mindset. Laterally, we have more of an appreciation that human beings are haphazard and very difficult to predict. The same environmental stimuli will prompt different responses in different groups. Or different stimuli will prompt very similar responses. I would look at it like this. Gobekli Tepi will re-write textbooks, but it does not re-write history. It does not prove that monumental building must pre-date settlement in all cases, just that in this one instance it did. At the risk of editorialising, you can imagine how it might be equally as important for a nomadic, hunter-gatherer group to stake a visible claim on their territory, or to come together and build something great in response to a threat, as it would be to a settled one to mark the boundaries of their own land. ",
            "date": "Answered December 3, 2016",
            "views": "39",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matt Riggsby",
                    "user_href": "/profile/Matt-Riggsby"
                },
                {
                    "user_id": "Arno Bode",
                    "user_href": "/profile/Arno-Bode"
                },
                {
                    "user_id": "Richard P Green",
                    "user_href": "/profile/Richard-P-Green"
                },
                {
                    "user_id": "Andy Mumford",
                    "user_href": "/profile/Andy-Mumford-2"
                },
                {
                    "user_id": "Sean Cronin",
                    "user_href": "/profile/Sean-Cronin-22"
                },
                {
                    "user_id": "Brendan Whitson",
                    "user_href": "/profile/Brendan-Whitson"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/The-Shreester"
                },
                {
                    "user_id": "Amal Guptan",
                    "user_href": "/profile/Amal-Guptan"
                },
                {
                    "user_id": "Marc Rodes",
                    "user_href": "/profile/Marc-Rodes"
                },
                {
                    "user_id": "Bill Acuff",
                    "user_href": "/profile/Bill-Acuff"
                }
            ]
        }
    ]
}