{
    "title": "Does democracy fail a country and its people during a major event such as Covid-19? - Quora",
    "tags": [
        "Politics and Government",
        "Political Science",
        "Democracy",
        "World History",
        "Government",
        "COVID-19 (2019-2020)",
        "Countries of the World",
        "International Relations",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Haran",
                "href": "/profile/Mike-Haran-7"
            },
            "answer_text": "By rights democracy should be restrained and emergency powers installed.But with today's mentality can you trust any one with these powers. We have a minority government in Canada which acts as an autocracy committing illegal acts ranging from pressuring attorney general into committing illegal dropping of charges to illegally benefitting in the millions from a charitable foundation.Compared to that of his cousins to the south this is small fry but it does follow a similar pattern.Politicians today just don't care whether they get caught or not as they seem to have things arranged in such a way as to face no consequences so how can you trust them with emergency powers why when the emergency is over we will probably be looking down the barrels of main battle tank guns. ",
            "date": "Answered October 29, 2020",
            "views": "787",
            "upvotes": " Answer requested by Rashid Hussain"
        },
        {
            "author_info": {
                "name": "J Tang",
                "href": "/profile/Rob-J-Tang"
            },
            "answer_text": "Blind Spot Number 1: Democracy is the cause of major mishaps. The fact is: Even though the American model has shown imperfections in a number of areas, there are still numerous successful cases of Western liberal democracy such as Australia, Canada, Japan, New Zealand, South Korea and many countries in Western and Northern Europe. You cannot just make a judgement that democracy fails based on a few unsuccessful cases alone. Don’t be naive like some people who think that they can live a better life under non-democratic institutions such as autocracy and totalitarianism. The main reasons why many democratic countries fail to curb the spread of Covid-19 are: Many of their citizens are influenced by skeptics who keep spreading untrue claims that Covid-19 is not real or conspiracy theorists who “believe” that Covid-19 is a disease plotted by the world governments to destroy the current world order and establish a new one of their own.Many of their citizens lack self-discipline in disease prevention and they have not heed the advices of health authorities seriously. Some of them also have a long history of distrust in their governments (probably under the influence of conspiracy theorists and skeptics).",
            "date": "Answered October 30, 2020",
            "views": "736",
            "upvotes": " Answer requested by Rashid Hussain"
        }
    ]
}