{
    "title": "Does poverty lead to crime? If yes, why so? - Quora",
    "tags": [
        "Poverty",
        "Crime"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikita Rogozin",
                "href": "/profile/Nikita-Rogozin-2"
            },
            "answer_text": "This assertion is hardly founded in observable reality. For example, no person (other than substance abusers) in the USA is objectively poor: Noone is malnourished in the USA and everyone has access to basically unlimited food;Everyone has access to all of the scientific and philosophical thought of the world in their lap, with access to unlimited education and self-improvement options and the ability to instantly communicate with any person in the world. Plus all the entertainment options;Everyone has (or can easily find) reasonable accommodation to live, people live on the street in the US only by their own choice;Noone is needing for clothing;Everyone has access to private transportation and public (or can easily find a job to pay for it);Employment opportunities to vastly improve living standards are abundant.All of the above objectively constitutes a Utopian living standard with all the human needs covered. And one can have them covered even without doing any productive work/contributing to society (which was not part of any Utopia). Yet there is crime in the US. Why? And on the other hand, we have ample examples across the world of mass objective poverty not resulting in any significant crime rates. Why? And I will simply deny the statement that some “poverty” lead a person to commit any crime in the US, as they would be hard pressed to credibly prove that they exhausted all other non-criminal options to improve their circumstances. I’d venture that this is more about the fact that the crime prevention measures in US currently are grossly inadequate. But not that poverty management measures are insufficient. ",
            "date": "Answered August 14, 2018",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Viktor Viktorson",
                    "user_href": "/profile/Viktor-Viktorson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dena Barrett",
                "href": "/profile/Dena-Barrett-2"
            },
            "answer_text": "There are a number of ways poverty can lead to crime. Of course not everyone who is struggling with poverty commits criminal acts and many who end up in the judicial system are guilty of being poor rather than actually being criminals. First, the obvious. If a person is living in poverty they are less likely to have access to advanced education, life skills and job training. They are more likely to face unemployment or under employment. They are more likely to live in areas where crimes such as gangs and substance abuse are prevalent. Growing up in such environments increase the possibility of becoming involved in such activities because of the despair, frustration, anger and hopelessness created in such environments. If faced with the choice of barely getting by on a minimum wage job or making good money dealing drugs, many choose the criminal life because it allows an escape from poverty. So, for these reasons poverty may lead to more criminal activity. Second, a person struggling every day with the deprivations of poverty might resort to criminal behavior out of seeming necessity. If your children are hungry and you have no money for food you are more inclined towards stealing to feed your family. If you can't pay rent you may feel the only way to avoid homelessness is to get money through illegal activities. Third is perhaps the most problematic way in which poverty can lead to a person being treated as a criminal. Let's say a person living in poverty gets pulled over for speeding and gets a ticket. A financially stable person can simply pay the ticket and move on but a very poor person doesn't have the extra hundred dollars or so. So the person goes to court to ask for leniency or permission to pay the ticket over time. Automatically court costs are added that can be $50-80 or more in some places. The judge agrees that you can pay over say 6 months. But now the $100 ticket is $150. The judge says you must be on probation until the ticket is paid. In many places that means you must pay a fee to the probation department until you have paid off the ticket. And they add an administrative fee for allowing you to pay over time. Now your $100 ticket is $175 with all the court cost. So probation says you must pay $30 per month on the ticket and $25 for probation. So now each month you must pay $55. Now, for many people paying a $55 a month bill might be irritating but wouldn't pose a serious financial hardship. But when you are already struggling to pay rent and buy food $55 might be nearly impossible. So, a couple months in you miss a payment. You simply don't have $55. Now probation is threatening to tell the courts you are in contempt and you could face more serious problems. Next month you have to pay $110 but you just don't have it. So the courts suspended your driver's license but you have to get to work otherwise you will never be able to pay it off. Then you get caught driving on a suspended license. Next stop is jail. Then comes having to post bail and you are back in court. Now the judge is angry but willing to give you another chance. But you end up with another fine and court costs and it is back to probation. But you have lost your job because you didn't show up and didn't call because you were in jail. But it doesn't matter because your car was towed when you were arrested and in order to get it back you have to pay the towing fee of about $125 plus a $50 a day storage fee. Now that $100 ticket you got is going to cost you more than $500 when it is all over. And you are now locked in to the criminal justice system. And it becomes an overwhelming cycle that seems sometimes as if it is forcing a person into crime. ",
            "date": "Updated August 23, 2019",
            "views": "15",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-47746"
                },
                {
                    "user_id": "Leslie Guardado",
                    "user_href": "/profile/Leslie-Guardado-7"
                },
                {
                    "user_id": "Thọ Trường Official",
                    "user_href": "/profile/Thọ-Trường-Official"
                },
                {
                    "user_id": "Shi Shishang",
                    "user_href": "/profile/Shi-Shishang"
                },
                {
                    "user_id": "Grazia Sher",
                    "user_href": "/profile/Grazia-Sher"
                },
                {
                    "user_id": "Viv Snead",
                    "user_href": "/profile/Viv-Snead"
                },
                {
                    "user_id": "John Glatthar",
                    "user_href": "/profile/John-Glatthar"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Mami-17"
                },
                {
                    "user_id": "Anthony Smith",
                    "user_href": "/profile/Anthony-Smith-1389"
                },
                {
                    "user_id": "Jim Sadler",
                    "user_href": "/profile/Jim-Sadler-18"
                },
                {
                    "user_id": "Amine Gaabouri",
                    "user_href": "/profile/Amine-Gaabouri"
                },
                {
                    "user_id": "Maanda Ramukumba",
                    "user_href": "/profile/Maanda-Ramukumba"
                },
                {
                    "user_id": "Daniel George",
                    "user_href": "/profile/Daniel-George-179"
                },
                {
                    "user_id": "Spenser Hicks",
                    "user_href": "/profile/Spenser-Hicks"
                },
                {
                    "user_id": "Sivia Minelli",
                    "user_href": "/profile/Sivia-Minelli"
                },
                {
                    "user_id": "Kallol Poddar",
                    "user_href": "/profile/Kallol-Poddar-1"
                },
                {
                    "user_id": "Ronelyn Borres",
                    "user_href": "/profile/Ronelyn-Borres-1"
                },
                {
                    "user_id": "Chiara Govender",
                    "user_href": "/profile/Chiara-Govender"
                },
                {
                    "user_id": "Isabel Hennig",
                    "user_href": "/profile/Isabel-Hennig"
                },
                {
                    "user_id": "Adrienne Phillipi",
                    "user_href": "/profile/Adrienne-Phillipi"
                },
                {
                    "user_id": "William Jones",
                    "user_href": "/profile/William-Jones-190"
                },
                {
                    "user_id": "Antonio Tela",
                    "user_href": "/profile/Antonio-Tela"
                },
                {
                    "user_id": "Mark Tisland",
                    "user_href": "/profile/Mark-Tisland-1"
                },
                {
                    "user_id": "Naomi Werry",
                    "user_href": "/profile/Naomi-Werry"
                },
                {
                    "user_id": "Eric Dyer",
                    "user_href": "/profile/Eric-Dyer-13"
                },
                {
                    "user_id": "Nicholas James",
                    "user_href": "/profile/Nicholas-James-29"
                },
                {
                    "user_id": "Rasmus Kongshøj",
                    "user_href": "/profile/Rasmus-Kongshøj"
                },
                {
                    "user_id": "[AP-STUDENT] Romarie Gontinas",
                    "user_href": "/profile/AP-STUDENT-Romarie-Gontinas"
                },
                {
                    "user_id": "Faustino Juliano",
                    "user_href": "/profile/Faustino-Juliano"
                },
                {
                    "user_id": "Maria Bucur",
                    "user_href": "/profile/Maria-Bucur-6"
                },
                {
                    "user_id": "Khadija Sakhi",
                    "user_href": "/profile/Khadija-Sakhi"
                },
                {
                    "user_id": "Brian Bedal",
                    "user_href": "/profile/Brian-Bedal-1"
                },
                {
                    "user_id": "What Ever",
                    "user_href": "/profile/What-Ever-590"
                },
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Finn",
                "href": "/profile/Daniel-Finn-28"
            },
            "answer_text": "No. Poverty does not promote or create crime, and certainly not on it's own many factors must be considered. I hear those nay Sayers saying \"show me the evidence, you're insane\"… Well there was actually an experiment in New York, Baltimore, Los Angeles, Boston and Chicago where this was tested in some measure. In Moving to Opportunity, 5,000 families were subsidised to move from poor to affluent areas. The results were somewhat surprising. Ten years on, the boys in those families were 20 per cent more likely to have been excluded from school than those who stayed behind. They were also more likely to have been arrested, though interestingly they were less likely to have been arrested for violent crime. In this case, moving poor kids to rich areas didn't make them less likely to be criminals, but it did change the type of crime they were likely to commit… So this leads to many conclusions, as it would appear that \"poverty\" alone wasn't the only factor contributing to \"crime\" only defining the type of crime most common.. So Not having enough money isn't the thing I see causing crime. I would imagine Pain, trauma and neglect in childhood are more influential factors. But then location is also a factor, Violent crime, for example, peaks on pay day when people go out spending cash on drink and get into fights. Perhaps this could be reduced by daily payments, instead of big amounts all at once.. Where there are high-rises you get less burglary but more violent crime, whereas in the suburbs you get more burglary. But the strange and complicated thing is that each and every human is unique, and may act differently in certain situations. Moving to Opportunity - Wikipedia ",
            "date": "Answered August 25, 2018",
            "views": "948",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eyitayo Obikoya",
                    "user_href": "/profile/Eyitayo-Obikoya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khushal Arora",
                "href": "/profile/Khushal-Arora-25"
            },
            "answer_text": "In the current essay we will discuss the fact that poverty causes crime. Poverty is a characteristic of the economic situation of the individual or social group in which they cannot satisfy a certain range of the minimum requirements needed for life saving ability. Poverty is a relative concept and depends on the overall standard of living in this society. According to experts, not getting decent wages for their work, young people gradually lose the desire to marry, marry, have children – they are full of fear for tomorrow, not sure that tomorrow they will not be fired because of another financial crisis. In addition, low wages and lack of jobs, experts say, are pushing young people to commit crimes in order to get rich quickly. It is, therefore, among criminals, increases the number of adolescents, aged 18 to 25 years. Poverty is a consequence of diverse and interrelated reasons, which combine into the following groups: – economic (unemployment, low wages, low productivity, lack of competitiveness of the industry); – socio-medical (disability, old age, high levels of morbidity); – Demographic (parent families, a large number of dependents in the family); – socio-economic (low level of social guarantees); – educational qualifications (a low level of education, lack of training); – political (military conflict, forced migration); – regional-geographic (uneven development of regions). As well, current crisis makes people react and do something, even if it is illegal, they start committing a crime. Poverty causes many crimes, as if a person was not poor and had faith in himself, he would not face the thought that he should search another ways to get money. Being poor, which could be caused by different reasons, makes a person unhappy, incapable to earn enough money, to buy anything he wants or at least something necessary. Poverty determines a certain stereotype in a person’s thoughts, and he does not see any constructive solving of the problem, as he wants to choose the easiest way of getting money, even harming other people. Poverty has a huge psychological influence on people, who become depressed, desperate and then they decide to commit a crime, as they have not found anything that can legally get them out of such situation. Too many problems that a person faces in the modern society makes him get angrier on the whole situation and look for the new way of solving their problem. The desperate economical situation in the country and consequently the lack of the work places especially for young people creates the thoughts and actions of crime. No guarantees from the government and no proper help to people who are poor, leads to the chaos and misunderstanding, where the only way out they find is to commit a crime. Poverty as a social phenomenon in a historical sense is of lasting value. The extent and depth of “immersion” of the people in the country reflects two important aspects of society – the level of development of productive forces and the corresponding character of their operation principle of social justice. Most often, poverty is treated as financial insecurity of people, when income of a person or family does not allow maintaining socially necessary consumption for life, interfering with normal living and personal development. Poverty serves as guidelines for shaping social policy. This phenomenon is assessed by using indicators of absolute and relative poverty, its depth and severity, as well as by the subjective perception of their individual well-being and quality of life. To determine the effect of poverty on crime, there may be also another way: by studying the living conditions of the poor and convicted before they commit crimes. As a consequence of the fact that poverty causes crime, criminally distorted psychology of society, values, personality as a direct cause of crime are expressed by more than just greed, aggression, irresponsibility and neglect of criminal law prohibitions. It has several forms: greed, greed, the cause component of the Organized Crime and Entrepreneurship, greed, parasitism, generating professional and recidivism, greed, irresponsibility, have a “drunken” crime, situational robbery and looting teens, when crimes are committed to meet the immediate material needs , greed, poverty, which is based on physical survival. At a gain now there is 80% of the totality of the causes of crime at this time. The main source of crime in any society is the aggravation of his social contradictions. It is also defined as meaningful and quantifiable features of the formation are within a specific time parameters. It is known that the technologically advanced capitalist countries do not have the same crimes. As a fact, crimes begin from the childhood. As a rule, if a child was born in a poor family, there are more chances that he will start committing crimes. All over the world there is propaganda of a luxurious way of life, of successful people, of expensive mansions, cars, of beautiful journeys, etc. When children and adolescents see that and understand that parents will not provide them with all these things, they start looking for the opportunity to get money fast to buy at least something. And consequently they decide to commit a crime. The crimes committed by adolescents are considered the cruelest. The majority of cases of all crimes show that a driving force of the crimes is the money. The values of the society are built the way that those people with the problems in their minds decide to bring closer all these luxurious things. One of the main aspects that can prevent poverty is education. If children are educated properly, then they will perceive the reality as it is and they will try to succeed in legal ways to study, to get a job. Sometimes, crimes are the symptom of the culture, and education can cure the cultural poverty and financial poverty will be cured itself, as a consequence. As a fact, not only poor people commit crimes, as there are also rich people who have no boundaries in their actions and power and they also commit crimes to get more money and power. Considering the statistics, the total number of the seven index crimes is reported to police per 100,000 inhabitants in the United States. The research states that if to reduce poverty, crime will be reduced, although with the crisis that has begun in 2008, there have been registered less crimes, although there are more poor people because of the crisis. As an example of it, in the first decade of the XXI century crime in the United States has tended to decline. By the end of the decade, crime rates, according to many indicators, have fallen dramatically, despite the economic crisis of 2008-2010. In some cities such as New York, the crime rate has dropped to the record lows. With the onset of recession in the U.S., many media outlets have expressed fears that the crisis (for example, increased unemployment and reduced real incomes of people) will lead to a rapid increase in crime. FBI report shows that these fears have not yet met. Published in the 2008, the study of the Heritage Foundation showed that the relationship between economic perturbations and crime exists, but it is not so clear. Thus, in the United States there is a nation-wide crime statistics since 1934. During all this time only for 16 years the crime rate has declined. The crime rate has steadily increased from 1955 to 1972, although this time the U.S. economy has experienced a rapid period of development, weak, a recession occurs only in mid-1960. In turn, during the Great Depression – statistics was only for the period from 1934 to 1938 – criminals showed less activity. Federal Bureau of Investigation (FBI) issued a preliminary report on crime rates in the U.S. in 2009. This statistics is based on data provided by about 17 thousand law enforcement agencies of different jurisdictions. The main conclusions of the report – compared to 2008, the number of property crimes in the U.S. decreased by 6.1%, violent crimes – by 4,4%. According to the report, this year the number of murders in the U.S. fell by 10%, robberies – on 6,5%, rape – by 3,3%. Among property crimes, the most significantly decreased the number of thefts of cars (by 18,7%), theft (by 5,3%) and burglary (2.5%). The greatest reductions in crime noted in cities with populations exceeding one million. In addition to FBI statistics, the crime rate measures the U.S. Bureau of Justice Statistics by the Census Bureau (study called National Crime Victimization Survey). Since 1973, there have been annually polled 70-80 thousand of households (family or group of people living together and having a total budget), to identify – about how many actually committed crimes Americans have not informed the police. The last time similar research was conducted in 2008. It showed that the victims of the criminals, Americans turn to law enforcement agencies do not always: becoming the victims of violent crimes, they shall notify the police in 51,2% of the property – in 39,6% of cases. Another important indicator for gauging the level of crime in the U.S. is a traditional study conducted the service Gallup “Rating the perception of crime.” Every year Gallup asks Americans to estimate – increased or decreased the number of crimes in their area and across the country. In the recent years, such survey was conducted in September 2009. Then 74% of Americans said that compared with last year the crime rate in the U.S. grew on 15% – reported that the situation has improved. The rise in crime in their area was 51% decrease – 29%. As a fact, 12% of respondents said that the situation with crime in their place of residence was “very serious”; the crime rate across the United States similarly estimated 55% of respondents. It is curious that in the last decade, both of these indicators remain fairly stable, fluctuating slightly. As a rule, those countries where there is no proper economic regulations, there are more chances that people will react negatively and commit more crimes, as the consequence of unhappy life and no perspective in such countries. Although there is no proof of the direct connection of the fact that poverty is the main motive to commit a crime, as there are many factors present in the minds of people who in different situations can act differently. It is not quite explicable that fact that while there is a depression and economical crisis all over the world, people do not commit more crimes, as the statistics shows that people do not intend to commit more crimes. The consequences and the logic of this fact are not fully understandable. In the modern world everything changes so quickly that people get accustomed to the situation, they learn the rules of the “game” and probably they try to find a better way to earn money and succeed than to commit a crime. There can be also hope that the more people get more education, the more they get knowledge, the better they understand life and the rules to survive. The more people know, the better they understand the situations, the values, the perspective, the more ideas they have, the more creative they are and the more they feel capable to find a job and to succeed in life. In poor countries such as Brazil and the countries of the former Soviet Union, there are millions of poor people who do not have a way out because of the lack of any perspectives to find a job, as the level of corruption is extremely high. In such countries it is especially visible the difference and the gap between the extremely rich and very poor people. There are almost no middle class people who have a job, a house and other benefits. That is why there are almost no chances to combat it, as poor and desperate people in these countries do not see any other opportunity except committing a crime. The obvious injustice and no social guarantees make people feel as losers, who see the luxurious life and who cannot touch it. As a fact, there is a lot of envy because of such a big gap and so much poverty. Each country has its problems and level of poverty, but there is one main point- the lack of money. If people had money at least for the basic needs, there would not be such level of poverty. And as Aristotle said: “Poverty – a source of disturbance and crime”, which means that little problem becomes a huge problem if there is nothing useful done to prevent it. That is why the right policy of the country will be able to eliminate poverty and along with that there will be no crime in the future. What factors specifically lead to poverty in the countries? This high level of unemployment, a significant number of jobs that do not provide a living wage, as well as reducing the number of social service costs. It can be emphasized that poverty reduction should not be a charity event. It must go against strong social inequalities. The only way to do this is to foster a society of equal opportunities. If we deal only with short-term problems in order to achieve short term objectives rather than to focus on strategic issues of economic and social development, we may miss the last chance to make the country the basis for a viable, long-term development based on economic and social modernization. So, the agenda should include the following vital issues: – Reducing inequality and providing our citizens the opportunity to realize their constitutional rights; – Restoration of a common economic space; – Infrastructure development through the joint efforts of government and the private sector (roads, railways, ports, airports, bridges, power lines, electricity, etc.); – The solution of demographic problems of the countries; – The rise of living standards (including environmental problems); – Eliminating unevenness in the level of regional development; – Harmonization of interethnic relations in the country and the creation of normal living conditions for the communities living outside of Russia; – National security and territorial integrity; – The safety of citizens; As a fact, it is easier to prevent poverty than to deal with its consequences. The fact that people commit crimes when they are poor does not justify them. But the government has to take measures to prevent the poverty, there should be created more opportunities for people to work, as keeping people busy can prevent crimes and even the thoughts of it. Proper economical policy, positive changes in the social sphere, economical issues and employment can guarantee the higher level of education and understanding the principles, which will avoid the crime in the future. There should be also organized the certain campaigns aimed at the reduction of poverty, as it in some cases causes crime. Anyway, if the importance of money wan not so crucial these days, probable the majority of people would not commit crimes. As it is very difficult to be different from everyone in the society that value the materialistic ideas, the goods and products, it becomes a real challenge not to have goals to buy, to own something. It happens because the society judges those who are different, who has different vision, goals, principles and ideas. That is why people are almost forced to do everything “the right way” to be as everyone else is, to work and to succeed. And if there are no possibilities for that in the country, people start looking for other, wrong ways to reach it anyway. They start looking for the easiest, quickest and lowest ways to reach their goal, and that is why robberies, different violent crimes and thefts occur. Some people after committing them feel “innocent”, as they think that if the government did not give certain things and possibilities to them, then they have the right to take things or money from the richer people. Deceiving themselves, people live in their own world that is so narrow, that allows them to commit a crime and to presume that no one will ever know. As a fact, it is sad that a reality is that money takes a very important place in people’s lives. Everything people do to earn money sometimes in not enough, that is why arise different problems which lead to the thoughts to commit a crime as that last opportunity. Everyone wants to live worthily and this desire determines unexpected behavior. Often people want to prove something to their friends, family, loved ones, but they do not manage to achieve it in a legal way, choosing instead the lowest possible way to commit a crime, thinking that from that moment on everything would change for the better. It is obvious that money rules the world, which is why almost every crime is based on the desire to get more money at any cost. Those who commit crime do not usually think about consequences and they pay for everything they have done later. Sometimes people just lack the patience and they want to have everything too soon without any considerable long time efforts. Consequently, this practice does not work and people are forced to pay for everything they have done. Psychological help and support in difficult situations can help and benefit people to overcome difficulties, challenging times and other problems. Being open to discussions, to new ideas, to new opportunities and options, people can stop thinking about committing a crime because they are poor. The capacity to believe in yourself, in the future possibilities and in the brighter future lacks in the minds of the people. It is surprising that people commit crimes, as it is obvious that sooner or later they will pay for what they have done and it is important to take control of the life. The mistake is that people sometimes consider themselves cleverer than the others and think they are capable of changing they life easily by harming someone else. This method, fortunately, does not work. Being realistic and optimistic at the same time can save situation and turn life to the better. All in all, only the right policies of the countries can solve this problem and make people understand and see other right ways to earn money and to get out of poverty. People are instruments in the hands of the government and they play by its rules. If there will be more opportunities and proper social conditions for people to live and work, the crimes that are caused by poverty will not take place anymore. A lot depends on the country people live in and on the fact how they see their future, which possibilities and advantages they see and want to implement in their life. Anyway, everything depends on a choice a person makes, wherever he lives and whatever he has.[1] Footnotes[1] How Does Poverty Cause Crime Criminology Essay",
            "date": "Answered August 1, 2020",
            "views": "863",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dharamveer Dheer",
                    "user_href": "/profile/Dharamveer-Dheer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda Polk",
                "href": "/profile/Linda-Polk"
            },
            "answer_text": "People living in poverty have very little power, so they are taken advantage of by people who do have power. Poor people are criminalized for actions that are often ignored by police when done by people who have money. Have you read the Attorney General’s report regarding police and judicial practices in Ferguson, MO (https://www.justice.gov/sites/default/files/opa/press-releases/attachments/2015/03/04/ferguson_police_department_report.pdf)? You don’t have to read the entire report to see examples of what I am saying. People were fined hundreds of dollars for minor traffic violations. Many lost their jobs and homes because they could not pay the initial fines, were slapped with steeper fines, and then incarcerated for “violating court orders” to pay these fines -which were imposed by the private companies hired to collect the fines, not the court. IF our government really wanted to end poverty, they would allow people who commit minor crimes to perform community services in exchange for money. I just paid off a fine for a relative who was paying what she could afford, $35 per month, for a speeding ticket. The court was charging her an extra $50 per month for various fees, so she would never be able to pay the fine and have her drivers license reinstated. If she can’t drive, she can’t work, so she will be stuck in poverty the rest of her life. This happens to tens of thousands of people all over America every day. Considering the situation, there are many people living in poverty who see crime as their only method of escape. It is a logical conclusion, especially for young Black kids who are identified as criminals at an early age (for getting into a fight at school, shoplifting a minor item they thought they could not live without at the moment, arrested for loitering right in front of the apartment they live in, or being pressured into delivering drugs by gangs in their neighborhood) and excluded from assistance with higher education. No one escapes poverty on their own. I know many people who claim to have independently pulled themselves up by their bootstraps, but who gave them their boots? Ayn Rand comes to mind as a person who preached against any type of government assistance and claimed to have made herself rich without help from others; however, she never reveals who paid for her ticket from Russia to America, who helped her become an American citizen, how she paid for college, and she never mentioned the government assistance she received when cancer interfered with her ability to work and live independently. Crime and poverty are related, but there are many more crimes committed by wealthy people that are under prosecuted or never prosecuted. Jeffery Epstein [Filthy Rich: The Billionaire's Sex Scandal--The Shocking True Story of Jeffrey Epstein: James Patterson, John Connolly, Tim Malloy: 9781455542642: Amazon.com: Books ], Curt Johnson [S.C. Johnson Billionaire Heir Gets 4 Months Jail, $6K Fine In Child Sex Assault Case], and the multitude of Wall Street millionaires who were never arrested for raping America’s economy are prime examples. Rather than asking “How does poverty lead to crime”, we may want to turn out attention to “Why we allow a minority of rich folks to blind our vision to their crimes and cause us to believe there are given segments of society that deserve oppression?” ",
            "date": "Answered July 30, 2018",
            "views": "199",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cedric Norman",
                    "user_href": "/profile/Cedric-Norman"
                },
                {
                    "user_id": "Josh White",
                    "user_href": "/profile/Josh-White-360"
                },
                {
                    "user_id": "Shi Shishang",
                    "user_href": "/profile/Shi-Shishang"
                },
                {
                    "user_id": "ReDash",
                    "user_href": "/profile/ReDash-1"
                },
                {
                    "user_id": "Alexzandra Dangol",
                    "user_href": "/profile/Alexzandra-Dangol"
                },
                {
                    "user_id": "Ntuthuko Mathenjwa",
                    "user_href": "/profile/Ntuthuko-Mathenjwa"
                },
                {
                    "user_id": "Linda Schmidt",
                    "user_href": "/profile/Linda-Schmidt-86"
                },
                {
                    "user_id": "Andreco Manigault",
                    "user_href": "/profile/Andreco-Manigault"
                },
                {
                    "user_id": "Daniel Issaks Rubin",
                    "user_href": "/profile/Daniel-Issaks-Rubin"
                },
                {
                    "user_id": "Ibrah Nolan",
                    "user_href": "/profile/Ibrah-Nolan"
                },
                {
                    "user_id": "Elariel Maddox",
                    "user_href": "/profile/Elariel-Maddox"
                },
                {
                    "user_id": "Stefan Henry",
                    "user_href": "/profile/Stefan-Henry-4"
                },
                {
                    "user_id": "Daniel George",
                    "user_href": "/profile/Daniel-George-179"
                },
                {
                    "user_id": "Lancelot Jean Mallia",
                    "user_href": "/profile/Lancelot-Jean-Mallia"
                },
                {
                    "user_id": "John Hart",
                    "user_href": "/profile/John-Hart-267"
                },
                {
                    "user_id": "Khine Zar Thae",
                    "user_href": "/profile/Khine-Zar-Thae"
                },
                {
                    "user_id": "Tiarnie Beno",
                    "user_href": "/profile/Tiarnie-Beno"
                },
                {
                    "user_id": "Colin Boggust",
                    "user_href": "/profile/Colin-Boggust"
                },
                {
                    "user_id": "Gurpreet Kaur Sahota",
                    "user_href": "/profile/Gurpreet-Kaur-Sahota-1"
                },
                {
                    "user_id": "Donnie Simeone",
                    "user_href": "/profile/Donnie-Simeone"
                },
                {
                    "user_id": "Anna Maria Lowman",
                    "user_href": "/profile/Anna-Maria-Lowman"
                },
                {
                    "user_id": "April Smith",
                    "user_href": "/profile/April-Smith-748"
                },
                {
                    "user_id": "Roger Bailey",
                    "user_href": "/profile/Roger-Bailey-32"
                },
                {
                    "user_id": "Süeda Yiğit",
                    "user_href": "/profile/Süeda-Yiğit"
                },
                {
                    "user_id": "What Ever",
                    "user_href": "/profile/What-Ever-590"
                },
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "Juan Padilla",
                    "user_href": "/profile/Juan-Padilla-50"
                },
                {
                    "user_id": "Timothy O'neal Thompson",
                    "user_href": "/profile/Timothy-Oneal-Thompson"
                },
                {
                    "user_id": "Ed O'Farrell",
                    "user_href": "/profile/Ed-OFarrell-3"
                },
                {
                    "user_id": "Brad Heinrichs",
                    "user_href": "/profile/Brad-Heinrichs"
                },
                {
                    "user_id": "Ivonne Martinez",
                    "user_href": "/profile/Ivonne-Martinez-10"
                },
                {
                    "user_id": "Liam N. O' Ceallaigh",
                    "user_href": "/profile/Liam-N-O-Ceallaigh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julien Philippe",
                "href": "/profile/Julien-Philippe-3"
            },
            "answer_text": "Does poverty lead to crime? If yes, why so? Yes it does. We, as humans, have primary needs that need to be fulfilled. When they are, we usually aim to satisfy a next layer of need, more sophisticated and hence less imperious to be fulfilled. They are nevertheless important, they are about “life” and not “sole survival”, especially in our modern individualist societies in which most aspire more than ever to prosperity, success, recognition, and benefit from “meritocraty” in order to achieve something for themselves “beyond others”, whatever their merits might be. This “pyramid of needs” can be described as working as such : “Primary needs” : Feeding ourselves, and sleeping in a safe place are the most necessary and hence basical conditions of existence, for any animal. Humans included. Almost anybody will do anything requiered to achieve subsistance.Anyone not able or inclined to achieve said subsistance by legal means will hence either end-up “doing worst” as a “trade off for getting something better”, in the street, either in a shelter, either in a “invisible job” for a roof and some food, either end up in grey, delictual, or even criminal activities if the previous alternative ain’t good or “productive” enough for said individual to achieve its goals.I’ll find a hard time to blame people for fighting for their survival in our societies of abundance as long as they “take from the system itself”, and not directly from individuals, especially violently.Each additionnal layer of needs and their satisfaction obeys to a similar pyramidal logic, from the most basic (primary) to the most “sophisticated”. “Legality if possible, illegality if necessary” (even the U.S.A themselves work like this as a country to achieve their goals, “with the U.N if possible, without if necessary”). Here it is :the proportion of the people affected by each additionnal layer of needs decreases “vertical layer after vertical layer” :Secondary needs : Almost everyone needs transportation and a work to be autonomous. People will hence be keen to fraud the public transportation when they can’t pay it, and to pay a bribe for a job when obtaining one legally is difficult, especially in the poor countries, or in the “criminalility strongholds in the rich ones” (like Napoli, in Italy, or some Balkans countries in Europe).Tertiary needs/wishes : Most want a personnal mean of transportation and to own their home, secure their future, travel when they can where they want, and enjoy life. Greed makes it entry here : shoplifting beyond food, tax-fraud4th layer of needs/wishes/quests : Existential ones, often overlapping on each other. I’ll use an ad-hoc cheap terminology coined for the occasion :The “Lower needs”, the futile ones : Many want a quite luxurious life beyond their reasonnable needs, and are hence to demonstrate greed to achieve that. Is corruption or even tax-fraud a crime ? ;-)The “Higher needs”, the transcendental ones : Most want to accomplish themselves, despite a lot will give that up on the way, or transfer that on their children.The “Horizontal needs”, the networking / social ones : Some need to be really succesfull, beyond material comfort.The “Vertical needs”, or pyramidal needs, the dominant one : A lesser “some” aspire to Power “beyond money or simple recognition”. These needsThe “Wrathful needs”, or “the Flame” that consumes everything (and even its beholder), the destructive ones : An ever tighter minority, usually batshit insane, aspire to enrichment, accomplishement, recognition, or domination through destruction if necessary, or even simply enjoyable. Beware !A select few will Rule them all, by any means necessary.Only One rules us all, even them. ^^The bigger the prize, the harder the race : The radicality of these who aspire to a certain layer but can’t obtain it by moral or legal means (out of lazzyness, incapacity, or impossibility) tend to increase layer after layer, from petty theft to genocide.The higher the layer, the lesser the numbers : Each people aspiring to the point of “conditionless realization on “a next layer” is a fraction of the previous one. But a fraction that constantly replenishes itself, “Nature hating emptyness” and the “pyramide” or “foodchain” almost always reshaping itself along the decheance or disparition of some of its elements, including the highest.Mecanically, à lack is meant to be fulfilled, poverty being our starting ground. Out of lack of food, you’ll have some people food stealing in the shops or anywhere food is present and in reach instead of starvingOut of lack of housing, you’ll have some people squatting instead of sleeping outside or in a shelter.Out of lack of order, security, safety (usually in bad neighbourhoods or weak/unstable States), you’ll have gangs, militias, guerillas out of a vacuum of Power to respond to its consequences… or fulfill itOut of lack of material confort or (self or not) perceived wealth, you’ll have tax-frauds, shoplifting, house-breaking, assaulting, up to the biggest criminal enterprises, because eh, some people never have enough.Out of personnal insecurity or lack of recognition, you’ll have nagging, deceiving, harassement/bullying, stealing other’s work, etc.Out of will to dominate, you’ll end up with violence on various degrees. At home, in the neighbourhood, in a “territory”, up to whole countries and even regions of the World. Are some countries “thugs” ? :)And so forth, and so on… Let’s look at the U.S.A (a random choice :) in a few maps to assess our poverty issues and the relationship they entertain with other factors : Poverty (2010 data). The impoverished south vs the more prosperous north, beyond the postcards and the rust-belt. Violent Criminality (2010–2012 data). The violent south and coasts versus the more peaceful north. The correlation between poverty and violent criminality is not perfect, but is nevertheless obvious. The remaining correlation being easily found between “racial minorities” in the U.S.A (Latino, Blacks, Indians) and poverty, and ethnicaly diversity and criminality, especially in the big American cities :  Ethnicity (2012 data). The zones with a population mainly from German and English ancestry has usually a lower rate of poverty & criminality than the others, including the “American” one’s. Aparte : One can easily observe why the best ally of America in Europe might not be the U.K or France, like one would think… But Germany, the 2 countries having marvellously completed each other in Europe since WW2. Diversity (2010 data, the leading racial group proportion decreases when the color is darker). One again, the zones occupied with populations with German & English, but also American ancestry, distinguish themselves from the others by their ethnical homogeneity. Second aparte : How surprising, ain’t it ? :) Amusing to see then Germans & Americans “teaching Serbs” all the benefits of seeing their common multi-ethnic State Yugoslavia being divided in different tiny multi-ethnic States… Along the Serbs themselves. I guess you never shit on your own doorstep when you can easily do that elsewhere. ;-) “Diversity” in the homicide rate, sorted per ethnicity for each U.S State (2010 data). One would be temptated to understand the Americans of German, “American” and English ancestry : Whiter streets, cleaner States ? ^^ It is to be noted that, in accordance with the violent criminality rate map, the German and English ancestry zones are usually less violent in relative data than the “American” ancestry ones, with the notable exception of the not very prosperous State of Missouri. Population’s density (2010 data) : For obvious reasons, big cities nurture inequalities, with poor neighbourhoods and hence a wide criminality.I guess that’s enough to rest my case : poverty indeed breeds criminality. And both are breeden by ethnical diversity, because some communities are more used to exploit others, these “others” being in turn still lagging in term of integration and prosperity compared to the WASP (White Anglo Saxons Protestants), supposed “central axis” of the American society which determine the framework of both this integration and prosperity.  U.S citizen votes for the presidential election of 2016 : Republican (reddish) / Democrat (Blue) :  Third aparte : Beyond the cities (more democrats) / countryside (more republican), we can see that that the Black and even Hispanics will likely be more “democrats”, and our “true Americans” and Americans of German, English, & even French ancestry will likely be more “Republicans”, especially nowadays.  And hence understand why Trump and the Reps often use the aforementionned map-correlation in their political propaganda, shits on the non-white races in the U.S.A, wants to build a wall with Mexico, values the “traditionnal America”, and pretends to “make America great again”. After all, ain’t the Reps America itself, the one and only ? ;-)  Addition : On a different perspective, we can see that under the geopolitical angle as well, implying that Rich countries can also be quite criminal :  And then consider than the U.K, France, the Germans (whatever were their political forms), Russia, and Spain are among the biggest warmongers of all times, the rest of Europe faring well in such ranking as well, while the Americans took over everyone since World War 2. If poverty easily leads to criminality, so does greed, even of the Wealthiest’s. ",
            "date": "Answered October 7, 2018",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeffer Fallarcuna",
                    "user_href": "/profile/Jeffer-Fallarcuna"
                },
                {
                    "user_id": "Justin Manda",
                    "user_href": "/profile/Justin-Manda-3"
                },
                {
                    "user_id": "Tiger Joe Sallmen",
                    "user_href": "/profile/Tiger-Joe-Sallmen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pascal Morimacil",
                "href": "/profile/Pascal-Morimacil"
            },
            "answer_text": "When you have money, you have so many options. Where should I eat today? Which country should I travel to next weekend? When you have a little bit less money, the questions become slightly different. Should I eat pasta or rice? Can I afford to take a couple of days of vacation this year? As the noose of poverty tightens around your neck, your options become more and more restricted. But you can live without. It’s not like you really need that vacation, or that trip to the dentist, or to afford sauce or condiments with your pasta. Who needs all this fancy stuff anyway, right? When you reach a certain point in poverty, you end up out of options. Out of legal ones anyway. You have nowhere to sleep tonight. You didnt have anywhere to sleep last night either, and the night before, but you just cant make it anymore, you are going to fall over. You get some rest, huddled up on a bench in a park, only to be woken up by the police, harassed, and forced to move along. Betrayed by your body, you end up forced into small transgressions of the law. Soon, you have to pee, but cannot afford to pay. You end up pissing while hiding behind some bushes, or in the back of an alley. Guilty, ashamed, anywhere you go you will be asked to leave, you try to have as little impact on others as possible. You steal food from trashcans and so on. Whether you decide to beg, work, or steal, anything you do is illegal. The laws become meaningless, it is all about your personal code of ethics, and whether you get caught or not. Maybe you decide to only steal food that is being thrown away by supermarkets. It is being wasted anyway. You are still a good person, just trying to get by. Nobody cares about you though. You are a criminal. You are a lazy, pathetic bum, and you brought this upon yourself. People loath you, harass you, are out to get you. At some point, cold, lonely, bitter and rejected, it dawns on you: Why should you care? F*** everyone else! Other people commit crimes, and get respect and admiration, while you try to live a good honest life, but end up treated like scum? You try so hard not to cause issues for anyone, while they do not hesitate for a second before calling the cops on you, or doing anything they can to make your life worse? Screw them. If it’s everyone for themselves, then you will do what you need to survive. Kill or be killed, life is a jungle. Do what you need, take what you can get, dont get caught. Those are the rules of your life now, if you want to survive. Morality is for living in a group. Once an individual is excluded from the group, it becomes irrational to follow the rules of the group. ",
            "date": "Answered July 18, 2019",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cedric Norman",
                    "user_href": "/profile/Cedric-Norman"
                },
                {
                    "user_id": "Esra Taha",
                    "user_href": "/profile/Esra-Taha-1"
                },
                {
                    "user_id": "Grundy Luis Shaftowitz",
                    "user_href": "/profile/Grundy-Luis-Shaftowitz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Archie Meijer",
                "href": "/profile/Archie-Meijer"
            },
            "answer_text": "It starts with desperation, and then it can get to the point of normalization. In extreme cases of poverty where you can’t afford to eat or can’t afford a roof over your head I can even sympathize. However, more often it’s relative deprivation that drives the crime rate. People will be in poverty but still be able to afford food and rent, yet they see little prospect of legitimate success so getting involved in crime becomes more alluring as a way of making money or even just as a way of blowing off steam. There’s some nuance to this. A person may be relatively impoverished and get involved in drug dealing using the rationalization that they’re just ‘helping people have a good time’ and getting paid for it, even if the person would never resort to violence or theft to make money. And then that person may run into some more dangerous, shady characters accusing them of infringing on their ‘turf’, and find themselves crossing that particular moral event horizon and resorting to violence to deal with them. Another example of nuance in how poverty can lead to crime is that a relatively impoverished person may do expensive things to self-medicate, some of which may be illegal and other things that are legal, things like alcohol abuse, drug abuse, or they may gamble with hopes of winning big and getting out of poverty. They go broke, and then they find themselves desperate enough to resort to serious crime to be able to pay rent, eat, and maintain their addiction. These effects accumulate and people in the poor neighborhood notice the crime and have to live with that going on around them on a daily basis. This can lead to criminality becoming normalized or even seen as ‘cool’. Teenagers start forming gangs. People, even adolescents talking amongst their friends and expressing an approving attitude towards getting involved in illegal activity to get money becomes destigmatized. People see legitimate success as elusive, blame the surrounding society for having abandoned them, and so see criminality as a natural, normal reaction to the state of things. Some people like to chastise the welfare system, and say that people are mooching. But in practice most people want real jobs and real opportunities for success and not to merely subsist on welfare. I’d rather people mooch off the welfare system than turn into criminals. Of course, welfare alone isn’t sufficient. But policies need to consider how to give those with lower incomes legitimate opportunities. States should stop tying property taxes to education and employ experts to determine the optimal distribution of educational funding according to need. Punishing failing schools by taking away funding does not work. That being said attaching some conditions to how the money is spent can be reasonable if there is evidence that the schools are not spending it wisely. Giving well-qualified and experienced teachers bonuses for teaching in struggling school districts would help. Universities should also offer affirmative action for people who come from neighborhoods whose school systems are struggling, not based on race, but based on geography. Reward the students who in spite of it all do well in these schools and it will show people in these places that if you work hard you can have legitimate success. And not everyone needs to go to college. Trade schools should adopt similar policies. And subsidies for developing businesses in struggling neighborhoods should also be enhanced. And while it’s controversial, I think that people with higher incomes should be incentivized to move to these places. Some people say this causes problems i.e. gentrification, but studies show that most of the effects of gentrification are positive. For example, children who lived in the neighborhood before gentrification show higher test scores and less behavioral problems and less incidents of delinquency. The negative effects can be alleviated with the right policies such as requiring that landlords not to raise rates too quickly for people who were previously renting. Ultimately having mixed-income neighborhoods is healthier as then the rich and poor are neighbors. They know each other as people and so the struggles of the poor are not a distant, abstract problem. ",
            "date": "Answered January 22, 2019",
            "views": "748",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leslie Guardado",
                    "user_href": "/profile/Leslie-Guardado-7"
                },
                {
                    "user_id": "John Hart",
                    "user_href": "/profile/John-Hart-267"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edgar D. McDonald II",
                "href": "/profile/Edgar-D-McDonald-II"
            },
            "answer_text": "Linda Polk’s answer is very typical of progressives who want to blame everything on the rich and the courts. Her answer completely ignores free will, the fact that environmental conditions play a lessor role to that. If you change the environment, you change the mind. That is the same logic that got us the modern concept of prison in the first place. How do you fix that? Why wealth redistribution, of course! The 1% needs to pay their fair share. Trouble is you still have free will. Well if you give them counselling, job training, and assistance in transitioning back into society. They will see the benefits of living an honest productive life, and choose to live that way instead. It only makes sense to me. Is the rejoinder to the above. Trouble is like Michelle’s school lunch program, the children did not choose to do what made sense to her. If given the choice, pizza and hamburgers from the snack bar, V. Tofurky from the lunch room, the snack bar makes sense to the kids. Now here is where the angry responses come from. So you are saying that being raised poor has no relation to the high amount of crime in the neighborhoods? Well there is a correspondence, claims the responders. Why yes there is. The overwhelming number of households in that neighborhood do not have a father in the home either. They are dead, or in prison. The people with the clout in the neighborhood are the gangbanging dope dealers. Their code of conduct controls and influences things too. Thalt shall never snitch. So you can do what you want to whomever you want because if someone sees something, and then says something, it costs them dearly.With dad out of the picture the father figure becomes the gang leader. The gang leader is there to make money, and maintain his power. The youngsters are mere pawns in his game.The people with money are the drug dealers and pimps. Those are the success models. So kids are lured into the “LIFE” willingly believing they will get rich like Chuckie the Pimp.",
            "date": "Answered February 25, 2019",
            "views": "648",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Cedric Norman",
                    "user_href": "/profile/Cedric-Norman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Allen",
                "href": "/profile/Michael-Allen-27"
            },
            "answer_text": "A way that growing up in poverty can lead to crime is simply learned behaviors. Noted already is the idea that some in poverty commit “subsistence” crimes. As a child growing up, you may see your father, mother, or extended family, selling drugs for an example. As a child you are never told that selling drugs are illegal things that your family does to put clothes on your back, or food in your mouth, but instead you believe it is just a part of life. Interesting story, this happened to me. As a kid, I always was around marijuana. It was bought and sold in my house. The older kids would try their hardest to get me to get them some. I did. I did very illegal things with drugs and money at a young age that I thought of as just normal things that people did. I, naturally, was doing only what I had learned. At 18 years old, I was involved in an investigation selling drugs to undercover officers multiple times. I was not selling drugs to feed myself or put clothes on my back then. I was selling drugs because that was a learned behavior. Another note. Physical abuse seems to be more prevalent in areas of poverty. I don’t know that as a fact, but it is my experience. Again, as a child, I watched and was victim of physical violence many times. This was a big issue in my experience. As I became an adult, the things I learned were transferred, no matter how hard you rebel against them, to my adulthood. Yes. People grow up in poverty around drugs and violence all the time then as adults live lives without drugs or violence. I am not inferring that it is a guarantee of your future life. It certainly is a strong predictor. People do what they learn. A person convicted of a crime has a very good chance of being stuck in poverty. Our society hates criminals, locks them up, and doesn’t give them jobs. Many people think criminals shouldn’t even be allowed to vote. The cycle of these learned behaviors repeats generation after generation. The question of whether poverty was a cause for the cycle, or symptom of the cycle is more difficult. ",
            "date": "Answered August 20, 2016",
            "views": "35",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "Frantz Senat",
                    "user_href": "/profile/Frantz-Senat-2"
                },
                {
                    "user_id": "Sztachó Zsolt",
                    "user_href": "/profile/Sztachó-Zsolt"
                },
                {
                    "user_id": "Francesco Lettich",
                    "user_href": "/profile/Francesco-Lettich"
                },
                {
                    "user_id": "Sean White",
                    "user_href": "/profile/Sean-White-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amelia Gray",
                "href": "/profile/Amelia-Gray-30"
            },
            "answer_text": "No. But yes. Potentially it makes sense on paper but thats the farthest reason to why someone draws to crime and even then poverty stricken people aren't the only type of people who commit crimes. Hard drugs or abuse of medicines can lead someone to crime. One of those thing you can potentially get from your primary care provider but if they make a mistake in giving you a drug you just got yourself addicted too you can potentially turn herion or meth. If you come from an overly weathly family and have had everything always go your way, you can potentially get stuck in that mind set into believing you can do anything to anyone. Some people come from abusive households and have the fight or flight response. Sometimes they can't determine the right moments in which to fight. Ignorance, not knowing something was illegal but got dragged into the maddness. There's plenty of other examples, but poverty usually is an element, not the cause. ",
            "date": "Answered February 12, 2020",
            "views": "161",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Le Sellers",
                "href": "/profile/Le-Sellers"
            },
            "answer_text": "Poverty, per se, does not “promote crime”. This is completely misleading. In the 1940s, Black USmericans were no less poor than the Whites around them, and probably much more so. They were no less poor than Black USmericans today, maybe more so. But Black crime rates were only marginally higher than the white crime rate, and even then only in some places. Poverty does not “promote crime”. The obvious follow up query should be “What does promote crime?” Certainly, there are many things that contribute to this problem. We have neither time nor the inclination to discuss all of them. It may not even be possible to discuss all of them. But there is one basic cause, proven repeatedly to make criminals: fatherlessness. Without a father in the home, indeed, without the father in the home, a child has a many times greater chance of becoming a criminal than a home where the father resides with his wife, the children’s mother. Girls get pregnant far more often when their father is not there. Boys get girls pregnant more often. Boys and girls are far more likely to become violent. The reason? Women civilize men. That’s one of their two principal duties (the other is to bear and rear children). But men’s job, even before providing for their families, is to civilize their children. Why has this happened? We can pinpoint the why and the when. LBJ signed the “New Frontier” legislation, and forced poor women to kick their husbands out of the home because government checks were larger than their husbands’ pay envelopes. Since that day, Black bastardy has risen from 12% (or thereabouts) – lower than the equivalent White rate – to ~¾ of all children born to Black mothers in USmerica. It’s so bad that in many communities, even in the few intact homes, since fatherlessness is so prevalent as to be the “norm”, a husband and father may still be unable to raise civilized children: he’s seen as the whacko, the weirdo, the crazy old man, even, or more accurately, especially by his children. Welfare has caused more poverty, more crime, more bastards, more pure evil than anything else in this country. Welfare is not charity. Welfare destroys. Charity ennobles. Welfare demeans both giver and recipient. Charity edifies both receiver and donor. If we want to reduce crime, we must eliminate welfare. Welfare is destroying the culture, the society, the very fabric of this country. ",
            "date": "Answered September 23, 2018",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eyitayo Obikoya",
                    "user_href": "/profile/Eyitayo-Obikoya"
                },
                {
                    "user_id": "Robert Lanz",
                    "user_href": "/profile/Robert-Lanz-2"
                },
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John McAllister",
                "href": "/profile/John-McAllister-37"
            },
            "answer_text": "In America, yes. Americans are brainwashed that they must be rich. Well off. They have to keep up with or pass the Jones’. So, when you don’t have a legal way to get money, such as a job, you may opt for an illegal one, like running drugs. Even with minimum wage at $15 an hour, some people can’t pay their bills. Debt is a big problem. So, what do you do? What if you can’t find a job because you’re black, have a record, have poor credit, or something? Not every poor person is a criminal. But, poverty contributes. What if you get a ticket and can’t pay it? Minor stuff, right? Right off, I know a dozen people who can’t afford a $150 ticket. The courts don’t care. When you start getting into more serious things, many can’t afford a lawyer that will suck them dry of thousands of dollars and do nothing. The system today holds all your past against you. Well, at least for some people. Others can do horrible things in the past and have no worries. Run off a bridge and kill your girlfriend? No problem, it’s forgotten. But, the average man will have it throw up in his face every time he is confronted by the police or in court. Without a lawyer there to say otherwise, you’re hurt. If you have a child, what would you do to feed it? I’ve seen women sell themselves to put food on the table as often as I’ve seen their husbands pimp them out for the money. If you’re hungry, what will you do? Steal? I remember when hunting was the poor man’s legal way out. With the gun banners, anti-hunting nuts, and others, this way is limited to a few. Every time a shooting happens, the ones who suffer aren’t the shooters or the victims, it’s the poor. Sure, if everyone had millions in the bank we would still have crime. Some steal for the thrill, some to become part of a group, or some because they are sick. It’s the same with murder, rape, and other crimes. ",
            "date": "Answered October 9, 2018",
            "views": "792",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joe Davis",
                    "user_href": "/profile/Joe-Davis-185"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "Poverty does not lead to crime in most cases. Abraham Lincoln was born in a log cabin, and educated himself by candlelight at night. Poverty did not prevent him from becoming President of the United States. Martin Luther King, Jr. exemplifies many American religious leaders who were also born poor. Poverty didn’t prevent them from making positive change for their Communities. However, taken on a broader scale — statistically — Poverty does tend toward a statistical jump in Crime. It seems to start with robbery and theft. I don’t defend it, but people will tend toward theft when they are desperate (or feel desperate). They are often punished by the Law, and then they become part of an underclass that encourages each other to be “hip” and rebel against the Majority Society. They will drop out of school — they will never read another book. At length, this underclass will have no chance of legitimate employment, and so will turn to Crime simply to support self and family. Their main resort is drug dealing, but they can turn to any other Vice in this regard, or even to Organized Crime. THEREFORE — a real solution to Poverty would benefit these individuals as well as Society in general. Here’s my solution: Teach Small Business principles in all Public Schools to all children, starting with Kindergarten all the way through High School (adapted for age group).If we do that, then in only one generation, there will be virtually Zero Unemployment and Zero Poverty for the first time in History — and that status will last for the rest of Human History. This would also reduce Crime based on Robbery and Theft to historically low levels. Other vices and “victimless crimes” would probably linger. Yet, for the vast majority of folks in Poverty today, a Public Education in Small Business principles — the way the world actually works — would completely solve their problem. I’m convinced. ",
            "date": "Answered October 19, 2019",
            "views": "633",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Liam N. O' Ceallaigh",
                    "user_href": "/profile/Liam-N-O-Ceallaigh"
                },
                {
                    "user_id": "Marcus Richardson",
                    "user_href": "/profile/Marcus-Richardson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Finnegan",
                "href": "/profile/Alexander-Finnegan"
            },
            "answer_text": "No. There are nations with high levels of poverty but low levels of crime. There are white collar criminals who embezzle millions of dollars even though they are already rich.Some theft is caused by necessity. If your children are starving and you steal a loaf of bread, for example.Unnecessary theft is sometimes caused by materialism. There is a high rate of theft in the U.S. because there is advertising everywhere. “Buy this and you will be happy” the ads say. But you are broke. “Everyone else has it, that isn’t right” the criminal says to himself. “That person is rich anyway, they can buy another one.” Then they steal.Some steal to pay for drug habits.Some crime is promoted by culture. For example, n the American South if someone hits you or shoves you first, studies have shown that both men and women are more likely to retaliate.Inner city gang violence is associated with poverty.But consider the high levels of domestic violence in all sectors of income levels.Interestingly, in the graph below it shows that poverty is actually inversely proportional to property crimes. This is the opposite of what people normally think.  ",
            "date": "Answered February 24, 2019",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eyitayo Obikoya",
                    "user_href": "/profile/Eyitayo-Obikoya"
                },
                {
                    "user_id": "Tiarnie Beno",
                    "user_href": "/profile/Tiarnie-Beno"
                },
                {
                    "user_id": "Phil Singh",
                    "user_href": "/profile/Phil-Singh-1"
                },
                {
                    "user_id": "Ashton Attri",
                    "user_href": "/profile/Ashton-Attri"
                },
                {
                    "user_id": "John Johnson",
                    "user_href": "/profile/John-Johnson-2016"
                },
                {
                    "user_id": "Brian Smith",
                    "user_href": "/profile/Brian-Smith-2275"
                },
                {
                    "user_id": "Jude McLachlan",
                    "user_href": "/profile/Jude-McLachlan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanmay Srivatsa",
                "href": "/profile/Tanmay-Srivatsa-2"
            },
            "answer_text": "No, it is only told by people who have sympathy towards criminals. In few cases might be true but most of the cases false. If poverty leads to crime then tell me why rape has been done? So, Politicians, High post officers, and Businessmen are rich then why are still they involved in corruption? Even, some people support criminals If someone is robbed then people say “leave him he is poor.” Rich people do crime people says “You know only bad work now I tell you good work” For youth Drink and Drive, exceeding speed limit looks cool Selling sim card without identification looks easy The hypocrisy is one side such people support criminal other side shout at police question on their duties. ",
            "date": "Updated August 24, 2020",
            "views": "338",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eyitayo Obikoya",
                    "user_href": "/profile/Eyitayo-Obikoya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sayanti Banerjee",
                "href": "/profile/Sayanti-Banerjee-29"
            },
            "answer_text": "Yes poverty is also responsible to increase the rate of crimes. What happend here?The person who are born with silver spoon in their mouth are getting better education and training and therefore employed in high productive jobs such as doctors,engineers,advocate,accountant and earning huge amount of money,whereas the person who are illiterate and belonged in slum areas are therefore not getting proper education and training and employed in low productive jobs such as rickshaw pullers,Industrial workers and marginal workers and their salaries are meagre. So it's very important to reduce the gap between the rich and poor to develop the economic condition of the society. The richer people are going on richer and the poorer people are going on poorer as a result the rate of criminals has also increased. There are three basic human necessities of life thatis food,clothing and shelter,when these necessities are not being fulfilled as a result they have involved themselves in criminal activies such as robbing ,drug addiction,murdering and many more . When they find elite class people are leading luxorious life ,and they are still below the poverty line that turned their attention towards performing criminal activities. Education plays the very important role to eradicate poverty. While government has launched several institutions to decline the rate of poverty. School dropout is also the reason that lead towards poverty.Lack of education of their parents influenced their wards to involved in child labour. School dropout leads to juvenile delinquency . So poverty is also responsible to increase the crime rates. ",
            "date": "Answered March 15, 2019",
            "views": "828",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sogand Gh",
                    "user_href": "/profile/Sogand-Gh-1"
                },
                {
                    "user_id": "Samraat Rathore",
                    "user_href": "/profile/Samraat-Rathore-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Himuka",
                "href": "/profile/John-Himuka-日向-ジョン"
            },
            "answer_text": " http://dw.com QUORA has many Q&A on this subject already Does poverty lead to crime? If yes, why so? Therefore I know that by answering this question will not stop crimes. However, I think we all need to realize that all cultures created people of “well to do” and “not well to do” and cultures who were in an environment with plenty of foods growing naturally (fruits, yams, etc.,) were more lenient towards poor (unfortunate) people stealing foods . If a person committed harsher crimes the whole village people will gather and determine his/her punishment but evidently there were more crimes to adultery than stealing or robing in olden day cultures which of course is another story. Cultures in larger territory having to import foods started out with barter and then to currency as a mean (median) of exchange. In order for a person in that culture to live he/she had to eat but if they do not have the currency they cannot get foods to survive. It will be obvious that they will demand for foods for survival and if they do not get it eventually rob from people who has foods. Modernization of societies have created poverty and hence some will commit crimes to satisfy their needs though most will persevere. So less poverty, less crime and one way our past cultures reduced poverty was by hiring soldiers for war. Naturally, healthy poor people joined the military since they will be given free foods and a salary but it was in exchange for their life. Nicole Galloway　Published on Oct 17, 2011  ",
            "date": "Answered September 20, 2018",
            "views": "658",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Reid",
                "href": "/profile/Christopher-Reid-61"
            },
            "answer_text": "Considering crime rates were relatively low during the Great Depression, I don’t think so. Crime rates rapidly increased during the 1960s when America’s economy was booming. I think it has much more to do with how criminals are treated. When the punishments are strict, you get less criminals on the streets and stronger deterrents against future crimes. If society is understanding towards criminals and treats them as victims themselves, crime becomes far more rampant - it’s not rocket science. Factors like single parenthood and unemployment also don’t help. These especially increased for blacks in America since the 1960s. The welfare state creates a financial incentive for single motherhood while minimum wage laws make unskilled workers unprofitable to hire. Black teenage unemployment went from around 9% in 1948 to about 50% in the 80s, for example. And black single motherhood from around 20% in 1960 to 70% these days. Meanwhile the likes of Al Sharpton are out there telling blacks to think of themselves as victims and blame white people for their problems. This doesn’t help. Why work if you think racism will hold you down anyway? Also, the public education system has been somewhat of a failure, especially for minorities and poor areas. Blacks are about 13% of America’s population but commit 52% of the homicides. While Asians are 6% and commit about 1% of the homicides. Forgive me if these aren’t exact, but I believe they’re right. Cultures differ and some are more violent than others. Obviously not all blacks are violent but something must be going on to cause these massive discrepancies. Some of these facts are attributed to a “legacy of slavery” but this doesn’t hold up. Most of these statistics began to go in bad directions only after the 1960s - they are more accurately a “legacy of liberal policies”. Why aren’t Jews the poorest, most violent group as a “legacy of the holocaust”? That was more recent and devastating than slavery, not that it’s a competition. Historically, I think you’ll find different groups have different attitudes and values which are reflected in their behaviour. Those which work hard don’t stay poor for long. Early generations of Asians in America were often very poor, worked long hours, slept in close quarters where they worked and save a lot. But future generations have become much better off largely thanks to the sacrifices of an earlier generation. Other groups which solve problems through violence or blaming the rest of society for their failings are doomed to fail and continue to be violent. ",
            "date": "Answered September 27, 2017",
            "views": "218",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brad Heinrichs",
                "href": "/profile/Brad-Heinrichs"
            },
            "answer_text": "When your desperate you will do what it takes to make sure your kids have a place to live ,food, and clothes. Back a few years ago the place me and wife were working burned down. A Cargill meat plant in Booneville. Went from decent to flat nothing after a few years not being able to find work at the time we had three kids. After a year the only way I found to be able to make any thing was to go back to drug dealing. Which is something I told wife I wouldn't do anymore hell been out the dealing game for like 8 yrs at that point. But alas had to do it cause there was no other way, we applied at every place with in reasonable driving distance. No luck. That's why crime and proverty are linked, desperate people will do what it takes to get their kids feed and clothes, with a roof. ",
            "date": "Answered August 25, 2018",
            "views": "135",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles Whiskey",
                "href": "/profile/Charles-Whiskey-1"
            },
            "answer_text": "If there's anything that could drive any sane person crazy, it is the inability to meet the most basic necessities of life. To wake up in a wretched, cockroach infested and filthy home without knowing where the next meal will come from is enough to make most individuals prone to committing a crime. A distortion of the mind can easily rear it's ugly head in this case, making the individual heading down the psychopathic lane. The correlation between poverty and crime is apparently positively related, given the high rate of crimes recorded in the slums. This however doesn't mean that some of the rich are not also dubious in criminal acts . After all, it is an open secret that many of the rich got where they are through shear greed and outright thievery. To say the poor should be the main suspect to every crime would be totally unfair and biased in a subjective kind of way, simply put. This is so because greed, lust, lack of control and anger doesn't have a boundary between the rich and the poor. In essence, though poverty can push some poor people towards criminal tendencies, it is not in anyway exclusive only to the them. The rich also steal and are guilty of crimes despite their lofty living standards. ",
            "date": "Answered August 6, 2018",
            "views": "4",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ikmal Hakimi",
                    "user_href": "/profile/Ikmal-Hakimi-10"
                },
                {
                    "user_id": "Lancelot Jean Mallia",
                    "user_href": "/profile/Lancelot-Jean-Mallia"
                },
                {
                    "user_id": "Amy Puglia",
                    "user_href": "/profile/Amy-Puglia"
                },
                {
                    "user_id": "Danh Thanatos",
                    "user_href": "/profile/Danh-Thanatos"
                },
                {
                    "user_id": "Süeda Yiğit",
                    "user_href": "/profile/Süeda-Yiğit"
                },
                {
                    "user_id": "What Ever",
                    "user_href": "/profile/What-Ever-590"
                },
                {
                    "user_id": "Gbenga Akinyemi",
                    "user_href": "/profile/Gbenga-Akinyemi-1"
                },
                {
                    "user_id": "Eddie Hughes",
                    "user_href": "/profile/Eddie-Hughes-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Hargraves",
                "href": "/profile/Adam-Hargraves-1"
            },
            "answer_text": "Among all the answers to this Quora question, there are very few that use numbers and data. First of all, there’s a couple of strong arguments against the causative role of poverty in crime, before we even start. Many people are in “poverty”, which whatever country, but only a few of those go on to commit crime. If poverty causes crime, why isn’t it compelling everyone in poverty to do it? Many people in poverty never commit a crime in their entire lives. How’d you explain that? Then add in the fact that most (85% or more) of those who do commit a crime are male. So where does the hypothesis go now? Does poverty predominantly only compel men to become criminals? Are men living in poverty and women not? Clearly, there’s a problem with this argument. Anyway, you can’t answer the question of whether or not poverty causes crime by just correlating those two factors together among huge groups of people. Because it could be that a tiny minority of those with one factor are accounting for the whole of the correlation, and we could find that *those* people have another factor which more strongly predicts the presence and absence of the other. In order to find out if that’s the case, you have to trace individuals over time. There is a study Amir Sariaslan which did this: they looked at individual families and their cousins, and found that within families, poverty correlated with crime. However, that correlation disappeared when they factored in who those with high crime rates had for biological relatives. In fact, the prediction of crime by poverty disappeared when compensating for “unobserved familial factors”. Childhood family income, adolescent violent criminality and substance misuse: quasi-experimental total population study Also, crime went down during the recession. So… What does cause crime? Well, we know that there’s are genetic variants in a couple of genes known to be associated with having committed an offence. It’s hard to imagine a way in which your genetic code is correlating with being a criminal that isn’t causative. Two genes linked with violent crime ",
            "date": "Answered May 7, 2020",
            "views": "328",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Aaron-Da-SIlva-em-Luto-Pelo-José-Azevedo"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bruss",
                "href": "/profile/John-Bruss-2"
            },
            "answer_text": "It seems that way. But if we use “perverse behaviors” rather than “prosecuted crimes”, we’d likely see wealth is no different than poor. But wealthy folks have far less publicized perverse behaviors, are far less often discovered (far better disguised…even expected), are less often arrested, fewer are prosecuted and ever fewer are successfully prosecuted. So the data gathering is heavily skewed….IMO, due to professional, political and special interest opportunists. Here’s my example of skewing data: Some luxury car models have been shown to be more reliable than low cost cars. However, seldom is information published telling us about wealthier car owners being fastidious about car care (much like their health care) compared to owners of entry priced car models (and their health care). Plus of course, wealthier folks might be far more motivated (and able) to keep their data undisclosed than others. How many wealthy people share the information about them or their children “getting in trouble”? They often successfully avoid having that be discovered. Example: Long ago, Ted Kennedy left a woman to die in his car and waited to talk to family and lawyers before he talked to the police and was never charged with a crime. ",
            "date": "Answered February 12, 2020",
            "views": "188",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cheryl Williams",
                    "user_href": "/profile/Cheryl-Williams-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hamza Afzal Butt",
                "href": "/profile/Hamza-Afzal-Butt"
            },
            "answer_text": "Not all time Poverty is mother of all crimes and in some casses the rich people alo commit crime due to their wealth as they think that their wealth can hide their all crimes. So we cansay that crimes are not only associated with poverty as it also have involment of wealthy and rich people. Lets see some examples which will clerify the root causes of all crimes:  1: Donald Trump: The Donald Trump has distingish personality as he had committed so many crimes in his life as due to his wealthy background nobody can dare to punish him as no complainant can stand and speak against him. So we cannot associate crimes with poverty. 2: Adolf Hitler: The Adolf Hitler is also a rich person as he born in rich family and when he got power he finish all his opponents as Jews claim that hitler done the world biggest holocaust incident. As his crime against humanity have no relation with poverty. 3: Kim Jong un: The Kim Jong un is also knwon as the great person as Europe and USA declare him terrorist that his cruelity takes so many lives of North and South Korean people. As Kim Jong Un is not a poor person and it proves that poverty is not the mother of all crimes. ",
            "date": "Answered April 19, 2018",
            "views": "35",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rukhsar Amjad",
                    "user_href": "/profile/Rukhsar-Amjad"
                },
                {
                    "user_id": "Samuel Cowley",
                    "user_href": "/profile/Samuel-Cowley-1"
                },
                {
                    "user_id": "Matt Chanoff",
                    "user_href": "/profile/Matt-Chanoff"
                },
                {
                    "user_id": "Ulla Vinther Rasmussen",
                    "user_href": "/profile/Ulla-Vinther-Rasmussen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pete Zeman",
                "href": "/profile/Pete-Zeman"
            },
            "answer_text": "Because, clearly, it does. Not all crime, but a lot of it. If you add one part Poverty to one part Substance Abuse, you’d have a criminality cocktail Poverty is to Prison as Affluence is to College. Whether you want to be a Felon or a Brain Surgeon, it sure helps to pick the right parents. Your family sets your expectations and models behavior. How many parents can teach what they have never experienced.?Your level of education is, as a general rule, unlikely to exceed your parents. Education is destiny. If you can’t finish High School, your income prospects are nearly nil.Kids raised in poverty are seldom told: “you can go as far as your hard work and talent will take you.” In fact, they hear just the opposite: “there’s no hope for you.”If you have no plans for the future, you don’t think about tomorrow. Consequently, criminal consequences don’t work.Crime and Violence may coincide, but they are not synonymous. Violence is learned at home, in childhood. It’s taught in the best of families. But since there is a social taboo, it is not reinforced by the larger culture…….unless you are raised in poverty and have few other means to assert your standing in your culture. In that case, violence may be exalted and respected.",
            "date": "Answered September 22, 2016",
            "views": "16",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Hart",
                    "user_href": "/profile/John-Hart-267"
                },
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "JC Mitchell",
                    "user_href": "/profile/JC-Mitchell"
                },
                {
                    "user_id": "Charles Locke",
                    "user_href": "/profile/Charles-Locke-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ric Lawes",
                "href": "/profile/Ric-Lawes-2"
            },
            "answer_text": "I disagree it is the ‘mother’ of all crime but it is way ahead of most reasons. Crime analysis is usually propagated by those ‘without’, wanting to take what they don’t have, rather than earn money to pay for it. Ease of crime makes it an option. Take for example the issue of drugs being sold. An out of work person gets an offer to sell some drugs at whatever the cost and they make a profit. every time they walk down the street. The rules may not be favourable but the reward is worth (to them) the risk. Or they can work for dollars on the hour and struggle. That is why the increasing number of unemployed become targets for sales of illicit material. We all have to put food on the table and we need the essentials of life. Crime is the lazy way out but a lot of people chose it due to the imbalance within the social system we live under. ",
            "date": "Answered June 26, 2016",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Johnathan Law",
                "href": "/profile/Johnathan-Law"
            },
            "answer_text": "Yes. Dayris Lucia Del Rosario Cabral is right that there are many rich criminals. And perhaps overall, rich criminals do the most damage to society than poor ones. But comon, for every gang boss you have 10 thugs working minimum wage. For every politically insulated hedge fund manager, you have 10 janitors stealing sensitive documents from large corporations.  Poor people commit more crime. That's pretty much a fact. Poverty drives people to desperation, and when people are desperate, they're willing to do pretty much anything. This is true regardless of whether or not a person is decent hearted, well educated person. I would consider myself both those things, but I am ashamed to say that I, too, have been driven to crime by circumstance in the past. ",
            "date": "Answered October 28, 2014",
            "views": "113",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "What Ever",
                    "user_href": "/profile/What-Ever-590"
                },
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "Courtney Wright",
                    "user_href": "/profile/Courtney-Wright-185"
                },
                {
                    "user_id": "Clay Elam",
                    "user_href": "/profile/Clay-Elam"
                },
                {
                    "user_id": "Kenneth House",
                    "user_href": "/profile/Kenneth-House-6"
                },
                {
                    "user_id": "Gbenga Akinyemi",
                    "user_href": "/profile/Gbenga-Akinyemi-1"
                },
                {
                    "user_id": "Tlhogi Letlhogonolo",
                    "user_href": "/profile/Tlhogi-Letlhogonolo"
                },
                {
                    "user_id": "Srinivas Kari",
                    "user_href": "/profile/Srinivas-Kari"
                },
                {
                    "user_id": "Rachel Tan",
                    "user_href": "/profile/Rachel-Tan-13"
                },
                {
                    "user_id": "Josh Manson",
                    "user_href": "/profile/Josh-Manson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neena Thakur",
                "href": "/profile/Neena-Thakur-5"
            },
            "answer_text": "Poverty makes situations in a persons life that push you towards crime _for instance, my mother is serious and dying and She needs a Doctor and blood infusion ! I run around looking for money to admit her, buy blood and medication , have no money to pay for any of this. My mind and heart are weeping from fear,from despair I ask friends who are also poor we do not have bank accounts,as money vanishes before the month ends, so I plead,beg,by now my brain cannot think properly as I do not want her to die I go to a known money lender he too refuses ,Now I decide on robbery,but I do not want to be caught to be arrested ,so the brain works with a desperate scheme which helps me to get money which saves my mothers life,then it makes me wonder how I can buy more medical stuff and my mind says I will take one more shot with a close friend who does it on a better scale than me and I continue until I am caught but the thought remains in my head and heart that I have become a thief and I make more money than I had earned and do not stop knowing well that I have joined the life of a criminal!! BUT, Crime does not remain so simple as robbery alone, along the way ,they kill, threaten to kill to begin forthe underlying fear of being caught is always there,but the short term freedom and luxury of money makes them brave! Many,slum children whom a friend taught free to help them move out for better jobs have told them about their father who is in jail for being caught red handed with a group that broke into a jewellery shop, the gang did not get away nor did they get jewellery but instead got jailed for three years maybe more depending on the case!! This is sad,but poverty can drive you to Crime, not jus for lack of money,but the life style of lack of education, anger,despair,depression,family traumas, many are emotionally,mentally,disturbed by bitterness,no future to look forward to,no aim nor ambition except the emptiness of pockets and the need for money!!! ",
            "date": "Answered July 26, 2018",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anita Jacquet",
                "href": "/profile/Anita-Jacquet-1"
            },
            "answer_text": "When you lose income be it from losing a job, benefits being decreased or completely cut off or someone who was helping you stay afloat financially can no longer do it, the added stress on you is unbelievable. With virtually zero money coming in and, let's face it, no matter how free or no-strings-attached something seems, everything costs something, you begin to come up with other ways to come up with enough to just cover necessities, certain options and ideas for getting it that you wouldn't even consider when you had an income become something of a possibility no matter if it's stealing, dealing drugs, running drugs, whatever. I myself am a hairsbreadth away from being in that position and I'll tell you, I've become more open to alternatives other than the conventional methods of getting money because I've used those resources already and I can only get that assistance certain amounts of time before I'm no longer eligible or it's just no longer available due to budget cuts. With rent, the power bill, phone bill and any other expenses that are essential for your survival, you get desperate. You start thinking “ok, I literally have nothing to pay bills with or even feed myself/my family. I can stay out of trouble where losing everything is a certainty, or I can (fill in the blank) where, yes, I have a chance of going to jail, but I just need to be careful and not piss off the wrong people along the way….and so what if I go to jail. Three hots and a cot, no rent and no bills”. You start thinking even the risks of getting arrested or even injured or killed is easier to deal with. At least doing it this way, you have at least a chance of getting enough money just to keep a roof over your head. I hope this helps. ",
            "date": "Answered August 25, 2018",
            "views": "863",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Conrad Pat",
                    "user_href": "/profile/Conrad-Pat"
                },
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melaku Teguegne",
                "href": "/profile/Melaku-Teguegne"
            },
            "answer_text": "“Does poverty lead to crime? If yes, why so?” No; poverty does not lead to crime. Let us list some recent crimes of varying degree, scale, and consequence: Colonialism (the occupation and displacement of people in Africa, Asia, North and South America);Slavery (all over the world);Financial crimes (insider trading, money laundering, tax avoidance);Political crimes (assassinations, bribery);Mugging, burglary, rape;For the most part, the most egregious crimes have little to do with poverty. Neither Hitler nor Stalin nor Mao nor Trump nor Menachem Begin nor America's slave owners committed their crimes because they were poor. ",
            "date": "Answered August 11, 2018",
            "views": "677",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "Thiago Francisco",
                    "user_href": "/profile/Thiago-Francisco-2"
                },
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srini Sunku",
                "href": "/profile/Srini-Sunku"
            },
            "answer_text": "No. There is no relation of crime to poverty.incidentally some people who committed so called crime may be poor .crime is defined as an activity prohibited by law. But mere violations of law need not be called as crimes in strict sense.law keeps on changing nation to nation and place to place and society to society. Hence in the over all human sense any activity which hurts and really injures other co habitant basic right to exist is a crime. How why people commit crimes across the history? It is due to various psychological factors of human behaviour. It first starts with fun to live happily with others as living alone neither has a purpose nor it worth living. Then it leads to certain degree of friction as fun will not keep relationships in full motion for a long time.hence active and dynamic person of any group creates or pushes friction to anger and others add fuel to it leading to crime.all this is really done without any bad or ill motives. Spiritually speaking this friction leading to crime is genuinely needed for human groups with brain and analytical power to live long with an artificial purpose to live long or till the death. Infact God or almighty power has created us with no great purpose and humans are also on similar footing like that of animals and other biotic life. We have created money as a medium of exchange to value this group dynamics thus evolving concept of economy and artificial nation states.otherwise all humans are equal with no specific purpose to live long but to to enjoy every moment of living till death. Hence crime is no way related to poor ness and infact may be other way round is related to richness with unwanted excess money creating more friction and restlessness to such rich people. Rich people do so to give up their richness faster back to society before their death which apparently looks like greediness to poor and other Immature people. equally spirited financially poor misunderstand and wage a proxy war with such financially rich but spiritually poor and is perceived in general as poor people involved in crime incident and same is untrue. Hence crime or friction of one form or other is prmaaily necessary for humans to exist and live long at balanced peace and only goal of police is to regulate such crime to be in permissible level ",
            "date": "Answered September 26, 2018",
            "views": "533",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arnout Van A",
                "href": "/profile/Arnout-Van-A"
            },
            "answer_text": "The anwser is plain and simple, no. Just read about this exquisite human being: Bernard Madoff. Where there are rules there will always be breaking of rules. GREED and maybe to a lesser extent the feeling of ‘adventure’ are incentives for getting into the crime business. Another example is passionate crimes, or morally justifieable crimes (sometimes you have to break the rules to do the moral thing). However that being said, poverty obviously plays a huge factor in the crime statistics as well. If there wasn’t any poverty, crime-rate would certainly know a huge decline. Here’s an interesting read on the connection of poverty and crime: Poverty and Crime: Breaking a Vicious Cycle of Discrimination ",
            "date": "Answered July 22, 2016",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexander Turner",
                    "user_href": "/profile/Alexander-Turner-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tuborlayefa Yinfaowei",
                "href": "/profile/Tuborlayefa-Yinfaowei"
            },
            "answer_text": "As taught earlier in my 2 year in university about poverty have come to realize that indeed poverty cause crimes and more crimes and encourage crime like an inspiration. Examples For individual that lack basic need (commonly in Africa) they tend to go around begging on street , mostly they get 1 out of 10 which will never be enough after several attempts nothing is benefitted they go to the extent of picking pocket, stealing in a way u cant understand how intelligent human can be in stealing then they upgrade, to arms robbing . Such robbing sometimes due to the economy itself will even make the victim poor and tempted to do things for their survival like fraud, bribery e.t.c that why I stated earlier “poverty cause and encourage crime like an inspiration” . ",
            "date": "Answered January 7, 2017",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Osama Noor",
                    "user_href": "/profile/Osama-Noor"
                },
                {
                    "user_id": "Vernon Averill",
                    "user_href": "/profile/Vernon-Averill"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Robb",
                "href": "/profile/Dan-Robb-2"
            },
            "answer_text": "Strain theory ... asserts that we are socialized to seek rewards (in effect positing of goals), and when the rewards are blocked strain is created that can be relieved by law breaking (Henderson & Simon, 1994).  Burton et al. (1994/1997) conducted an empirical assessment of strain theory on three levels: strain created by the difference between aspirations and expectations, blocked opportunity, and relative deprivation.            Burton et al. (1994/1997) found that only blocked opportunity and relative deprivation have a significant effect on adult deviance, with relative deprivation having the greatest correlation.  However, they also measured self-control as a variable and found that it had a greater effect than any other variable.            Strain theory, social control theory, and differential association theory are widely held theories of criminal behavior causation.  Agnew (1992/1997) addressed juvenile delinquency in explaining them, but adult crime is assumed to be affected.[S]train theory argues that adolescents are pressured into delinquency by the negative affective states—most notably anger and related emotions—that often result from negative relationships.... Control theory, by contrast, denies that outside forces pressure the adolescent into delinquency.  Rather, the absence of significant relationships with other individuals and groups frees the adolescent to engage in delinquency.... In differential association/social learning theory, the adolescent commits delinquent acts because group forces lead the adolescent to view delinquency as a desirable or at least justifiable form of behavior under certain circumstances. (Agnew, 1992/1997, p. 49) Robb, D. L. (2002). An investigation of self-control and its relationship to ethical attitudes in criminal justice personnel. Dissertation Abstracts International, 62 (12), 4343. (UMI No. 3036984) ",
            "date": "Answered July 29, 2015",
            "views": "35",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Monika Izabela Paszkowska",
                    "user_href": "/profile/Monika-Izabela-Paszkowska"
                },
                {
                    "user_id": "Francisca Leila Chatora",
                    "user_href": "/profile/Francisca-Leila-Chatora"
                },
                {
                    "user_id": "Pascal Morimacil",
                    "user_href": "/profile/Pascal-Morimacil"
                },
                {
                    "user_id": "Cam C",
                    "user_href": "/profile/Cam-C-14"
                },
                {
                    "user_id": "Prabhjeet Singh",
                    "user_href": "/profile/Prabhjeet-Singh-102"
                },
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                },
                {
                    "user_id": "Yavor Hadzhiev",
                    "user_href": "/profile/Yavor-Hadzhiev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Bosen",
                "href": "/profile/Aaron-Bosen"
            },
            "answer_text": "There is often some correlation, (people who are extremely poor sometimes resort to crime to meet living expenses) but implying it’s causation can’t be proven, as there are enough statistical outliers to indicate otherwise. Case in point: the Kingdom of Tonga is both one of the world’s poorest nations (the average household income per year is under 300 dollars), and one of the nations with the *lowest reported crime rates in the world* in most possible categories of crime. In the United States on the other hand, criminal conduct is overwhelmingly committed by members of the middle class, which also uniquely in the US, makes up the largest percentage of the population. The middle class also makes up most victims of it for the same reason. Even then, deviations from city to city are not uncommon. If you’re looking for a single easy cause of criminality, you won’t find it to begin with, because it doesn’t exist. Every criminal is an individual with individual motivations, causes, ect. For that reason, they’ll always create problems with nice tidy hyptheses about who and why. ",
            "date": "Answered August 21, 2019",
            "views": "195",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maggie Deigh",
                "href": "/profile/Maggie-Deigh"
            },
            "answer_text": "Absolutely not! If that were the case, then only poverty-stricken people would be committing crimes. And all of the poverty stricken individuals would be committing crimes. So, logically, poverty cannot be the cause of crime. It can, however, factor in. For instance, there are many cities where it is a crime to sleep outdoors. Homeless people don’t have anywhere to sleep that’s not outdoors. So, they are criminals, committing a crime by closing their eyes. There’s a great deal of debate about whether closing ones eyes outdoors should be a crime. But currently, it is. There are also places where it’s illegal to give food to homeless people. In that case, it’s not the homeless person who’s committing a crime. It’s the affluent person who gives the food who is committing the crime. But it’s the poverty of the homeless person that is the reason why the affluent person committed that crime. ",
            "date": "Answered October 3, 2020",
            "views": "394",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jay Stein",
                    "user_href": "/profile/Jay-Stein-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "N'dria N're",
                "href": "/profile/Ndria-Nre"
            },
            "answer_text": "Not making enough money to afford public transportation or registration tags on car. Tags on car go expired. Desperation to make it to work motivates many people to drive with expired tags. Police have in car computers with databases to know which areas to ‘patrol’ for expired tags and lapsed insurance. Person is repeatedly pulled over and given the max fine/tickets. Many courts do not offer community volunteering as a way to pay off the fines and the person winds up in jail. More court costs create a new debt. Person winds up in jail again. It's called poverty crime, where the system even though it is justice and legal, can create deeper crippling poverty that can expose unsupervised children CPS and social services, creates problems for elderly/ disabled who might be under the care of the incarcerated person. Elderly/ disabled might wind up under APS services and social services. It creates a needless burden on other departments and create a deeper spiral from which there is no return unless services are available to help the person actually escape the trap with out parasitizing off the incarcerated person and their family. BTW debtors prisons are illegal but places like Michigan and the southern states make tons of money off of folks. ",
            "date": "Answered July 17, 2018",
            "views": "26",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "Alice Gordon",
                    "user_href": "/profile/Alice-Gordon-2"
                },
                {
                    "user_id": "Brad Heinrichs",
                    "user_href": "/profile/Brad-Heinrichs"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dayris Lucia Del Rosario Cabral",
                "href": "/profile/Dayris-Lucia-Del-Rosario-Cabral"
            },
            "answer_text": "No. There are many rich criminals. And the examples I have seen of criminals who lives in poverty or used to live was environment. For example, many hoods have a culture of crime and they teach to survive you must be tough and kill or you will be killed.Other example is when you see parents doing crime or you see a crime against your parents or someone you love a lot but the society and justice didn't work and you feel you must do it by yourself.Others just born with the instint. Those are my ideas. But poverty doesn't have to be with that even people always say it or use it to hidde their responsibility in crime. The best question would be, if poverty is cause of crime, why rich make crime too? ",
            "date": "Answered March 7, 2014",
            "views": "3",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bullet Bill",
                    "user_href": "/profile/Bullet-Bill-3"
                },
                {
                    "user_id": "Àdébàyór Ògúndéyì",
                    "user_href": "/profile/Àdébàyór-Ògúndéyì"
                },
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Anderson Moorer",
                    "user_href": "/profile/Anderson-Moorer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Casey",
                "href": "/profile/Jim-Casey-19"
            },
            "answer_text": "Poverty means , no money. If you have no means to get money in the ‘normal legal way’ and the need for money is desperate, then people can be stimulated to do desperate and illegal things like crime to get their needs fulfilled. And that’s the thing, often people are not criminals because they want to be evil, but simply want to get their own needs fulfilled. That of course doesn’t justify the crime, but poverty also often goes along with lack of education, so they don’t know a better way. And if they don’t see another way out, then committing crimes becomes more attractive. Fighting poverty therefore means fighting crime, but it does not mean all poor people are criminals, they are just more vulnerable and susceptible to it. ",
            "date": "Answered July 29, 2018",
            "views": "456",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Waf Waffles",
                    "user_href": "/profile/Waf-Waffles"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Sadler",
                "href": "/profile/Jim-Sadler-1"
            },
            "answer_text": "Poverty is most likely behind 90% of all crimes. However there are other factors as well such as brain disease or injury, mental illness and also things like family traditions. By that I mean that if a daughter sees her mom getting slapped around she will tend to think that is normal and may actually feel unloved if her future husband does not dominate and control her. Such girls will go to the end of the world to enrage a husband to strike out. Some women will actually divorce as they do not feel married unless the husband is very controlling. And yes a husband hitting a wife is criminal and that occurs among the rich and might be even more common than among the poor. We had a local fellow with a high income and extravagant life style. His business fell apart and his mansion was about to be repossessed and he was not even know if they would be living on the streets at that point. his wife went out and purchased a $2,000 pair of shoes and decided she should buy another pair as well for another $2,000. She had great store credit. She came back to the mansion and showed her husband what a brilliant buyer she was where upon he shot her and then shot himself. The causes of crime are complex but usually the penalties are applied to the poor. ",
            "date": "Answered September 26, 2018",
            "views": "426",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barnaby Page",
                "href": "/profile/Barnaby-Page"
            },
            "answer_text": "As others have observed, poverty can lead to crime but it does not in most cases, and similarly not all criminals are poor. There are as many reasons for crime as there are crimes and criminals, and of course definitions of “crime” vary dramatically among cultures and over time. It’s also worth noting something that I don’t think many of the other answers have touched upon, though: that sometimes the same factor can lead to both poverty and crime. Substance abuse is a good example of this. Poor life skills is another. And, undoubtedly, having a criminal past is a third. I think we can see, at least logically, that because these factors can also lead a rich person to commit crime, when they make a person poor it is also possible for them - independently of the poverty itself - to lead that person toward crime. ",
            "date": "Answered September 12, 2018",
            "views": "549",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian J. McCann",
                "href": "/profile/Brian-J-McCann"
            },
            "answer_text": "While poverty can lead to crime, it doesn't necessarily do so, nor is poverty a necessary determinant of criminality. In other words, yes, some poor people do commit crimes. This doesn’t mean that if you’re poor that you will commit crimes, nor that when a crime is committed, that the culprit will always be a poor person. For instance, Bernie Madoff wasn't impoverished when he defrauded investors of $64.8 billion dollars, nor was Phil Spector when he murdered Lana Clarkson, or Oliver North when he illegally sold weapons to the Iranians, and subsequently funneled the proceeds to the Nicaraguan Contras. Likewise, there are billions of people the world over who go about their daily lives without giving a single thought to committing a crime. ",
            "date": "Answered May 10, 2018",
            "views": "17",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Esra Taha",
                    "user_href": "/profile/Esra-Taha-1"
                },
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "David Schaffter",
                    "user_href": "/profile/David-Schaffter"
                },
                {
                    "user_id": "Lucas Judson",
                    "user_href": "/profile/Lucas-Judson"
                },
                {
                    "user_id": "Patrick Moritz",
                    "user_href": "/profile/Patrick-Moritz-3"
                },
                {
                    "user_id": "Barbara Holladay-Vernon",
                    "user_href": "/profile/Barbara-Holladay-Vernon"
                },
                {
                    "user_id": "Bronnwyn Schmidt",
                    "user_href": "/profile/Bronnwyn-Schmidt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael David Cobb Bowen",
                "href": "/profile/Michael-David-Cobb-Bowen"
            },
            "answer_text": "I think it’s an over-reliance on the idea of the American Dream. IE the supposition that there is something essentially moral about prosperity. There is nothing *essentially* moral about prosperity, just as there is nothing *essentially* ignoble about poverty. So I’d say this is a question about the nature of man and what man needs. If you say give a man a fish etc.. does the syllogism apply to morality? Is a man more honest if you give him a fish, or more honest if you teach him how to fish? So what if he buys a fishing boat? Is he even more honest? What if you give a man a fishing boat? Is it his prosperity what makes him moral? I’d say that it is the *way* in which people achieve prosperity (or not) that determines the extent to which they are honest or dishonest, criminal or upstanding. It is not the existence of prosperity itself. Therefore, if you buy into the idea that the possession of the goods of the American Dream makes one moral, then you can buy into the idea that not having the goods of the American Dream make one immoral. Looked at this way, pleading poverty is kind of like blackmail. Right? Fix income inequality or the poor would be justified in their immoral behavior. Isn’t it interesting how looking at this distinction changes whom one would call materialistic? Marx was entirely materialistic. See the connection? ",
            "date": "Answered September 22, 2016",
            "views": "15",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quinn Copeland",
                    "user_href": "/profile/Quinn-Copeland"
                },
                {
                    "user_id": "Neil Dwyer",
                    "user_href": "/profile/Neil-Dwyer"
                },
                {
                    "user_id": "Scott Richards",
                    "user_href": "/profile/Scott-Richards-10"
                },
                {
                    "user_id": "Chester Tan (陈文希)",
                    "user_href": "/profile/Chester-Tan-陈文希"
                },
                {
                    "user_id": "George Peterson",
                    "user_href": "/profile/George-Peterson-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raymond Beck",
                "href": "/profile/Raymond-Beck"
            },
            "answer_text": "Poor people aren’t more criminal. Rich people are more criminal. Why does wealth lead to crime? The real question. Poverty only seems to lead to crime because our police target poor people and poor people get railroaded in criminal courts. Low income people are more easily coerced into pleading guilty. Police target anyone out of the usual, such as people showing signs of low income. Police know they’ll have a far easier time making an arrest, if the suspect is poor. At best they’ll get a public defender telling the poor person to take the deal for probation. Then the poor person gets his probation revoked on the slightest technical violation and goes to prison. Our prisons are filled with poor people. but it doesn’t mean they’re more criminal than the wealthier. It just means they can’t afford to pay for private attorneys, like the rich, or most middle income. ",
            "date": "Updated October 6, 2018",
            "views": "417",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lancelot Jean Mallia",
                    "user_href": "/profile/Lancelot-Jean-Mallia"
                },
                {
                    "user_id": "Itsoju Sangtam",
                    "user_href": "/profile/Itsoju-Sangtam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Amici",
                "href": "/profile/Michael-Amici-1"
            },
            "answer_text": "No, yes, maybe. It is a lot harder to determine than it looks because there are many reasons for crime. I think crime is mostly about culture, poverty is a culture too. The problem is that poverty by itself is a causal factor in crime and the culture of poverty makes it far more likely as your dealing with people who think it alright to steal. People who are poor are not morally inferior therefore it is the culture you grow up in. I know rich people who lie cheat and steal as well as thugs. Their parent cheats on their tax taxes and golf and their wives. They teach their children that they can get things by using power, money, and influence. The poor often using physical power. It the culture that you grow up in tells you “you can get away with crime” and you do not have to play by the rules. Both rich and poor can be taught these tactics and both rich and poor lives can be ruined. I know poor people who wouldn’t steal and a dollar and rich people that never have enough. If you are taught young not lie cheat and steal you will be honest all your life. ",
            "date": "Answered March 31, 2019",
            "views": "214",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Perry Lundon",
                "href": "/profile/Perry-Lundon"
            },
            "answer_text": "Crime and poverty go hand and hand. When you don’t have food for yourself or your family you will do what you need to get food. Whatever the poverty situation individuals will do what is necessary to survive and criminal behavior is one of the primary ways to survive while living in poverty. Prisons are full of individuals that lived in poverty and often committed minor offenses to survive that landed them in prison. The average cost of incarceration in 2015 was $33,274 ranging from a low of $14,780 in Alabama to a high of $69,355 in New York. A high cost solution that has a multitude of alternative solutions that could be taken that cost less taxpayer dollars and is better for society. ",
            "date": "Answered August 30, 2018",
            "views": "286",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joost Boer",
                "href": "/profile/Joost-Boer-1"
            },
            "answer_text": "It really depends on cultural, geographical and locational factors. Indeed, on average it would appear that lower income areas have higher crimes rates (comparing e.g. an affluent American city with a less affluent American city). However, I’ve been to some really, really poor places in my life (e.g. when conducting research about poverty in areas where households had a USD2/day income) and I felt incredibly safe there - the people struck me as completely non-violent and not-prone to committing crimes. I felt more safe than I perhaps would in an affluent city like Amsterdam, at nighttime. I must say that these poor places I visited were rural areas, which traditionally have a considerably more developed social capital amongst people, than urban areas would tend to have. I can’t say an equal feeling of safety was present in some of the poor areas of Manila I - foolishly - visited at nighttime. People do get mugged/stabbed/shot there at an alarming rate. So, in the end, it really depends on many factors. But to say poverty → crime is too simplistic and would in many instances be outright wrong. ",
            "date": "Answered January 6, 2017",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bullet Bill",
                    "user_href": "/profile/Bullet-Bill-3"
                },
                {
                    "user_id": "Tuborlayefa Yinfaowei",
                    "user_href": "/profile/Tuborlayefa-Yinfaowei"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rudy Quiñones",
                "href": "/profile/Rudy-Quiñones-2"
            },
            "answer_text": "No but it happens more often with impoverished classes. I think its like an implied deal people accept that the rich get away with making bad deals with the poor so the poor replicate that on them and it goes lower and lower until the last person on the end get desperate cause they have no money and as lesser and lesser resources and opportunities occur the more the morality corrupts. Cause its a hard lesson to accept a fine rich man dressed the way you like in a car you like and not get angry while you are poor on the street. Life should not be this difficult I know cause I experience it. ",
            "date": "Answered July 28, 2016",
            "views": "146",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maria Colclasure",
                "href": "/profile/Maria-Colclasure"
            },
            "answer_text": "It all starts with the true criminals like the goverment and the rich who got thier hands so deep in the pot of money that’s how they are selfish they just want to knock us down or knock us off they are thinking they are better than. Besides the fact that thier are some homeless people that are doing crime as well. In turn it gives the homeless a bad rap. That is why we are singled out to the rich do you know some people ask the saddest questions about the homeless some should be ashamed of how they think then sunday they go to church like they are such the christian are what ever religion the thing is the homeless have more heart than them any day that is the difference . ",
            "date": "Answered May 4, 2018",
            "views": "381",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob McNally",
                "href": "/profile/Bob-McNally-3"
            },
            "answer_text": "Most criminals are not intelligent individuals. Most workers in McDonald’s flipping burgers are wealthier than a criminal. Most criminals are chaotic and living lives plagued with uncertainty and fear. Are they desperate? Yes, often they are. Not necessarily for good reason though. Criminals by and large want whatever impulse they have satisfied immediately. Or to put it another way, they can’t delay gratification and see no benefit in doing so. They make unreliable and dangerous companions and are surrounded by the same. If you are a criminal it is highly likely you are also a victim of crime from other criminals. Criminals are poor because they are unable to undertake paid labour. They have not learned or bothered to learn the habits needed to get a job. In short, the whole human race started out poor. Most of us are criminals. Redeeming a criminal is difficult. The truth is the individual has to want to change. ",
            "date": "Answered April 28, 2018",
            "views": "838",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Miller",
                "href": "/profile/Matthew-Miller-45"
            },
            "answer_text": "People in true poverty lack the basic essentials of what it means to be a living human being. This makes them desperate. Desperate people will do anything to get what they need. It is biology. I have a simple experiment that might help you (or anyone with the same question) to understand. Think of a food that you really do not like. I am not talking about a food that disgusts or nauseates you, but one that you just really do not like, and that you would never choose to eat. Now, go three or four days without eating anything. At the end of that period, get some of that food that you don’t like. How do you react to it now? See, while some criminals are greedy and lazy, and while some people seem to be born “bad”, many people in poverty have no way to get what they need as humans outside of stealing it. Thus, they turn to crime. ",
            "date": "Answered March 27, 2018",
            "views": "22",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nhlanhla Sithole",
                    "user_href": "/profile/Nhlanhla-Sithole-2"
                },
                {
                    "user_id": "Jacqueline Homan",
                    "user_href": "/profile/Jacqueline-Homan"
                },
                {
                    "user_id": "Paula Smith",
                    "user_href": "/profile/Paula-Smith-115"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mara Obelcz",
                "href": "/profile/Mara-Obelcz"
            },
            "answer_text": "My father used to say that during the depression, there was nothing to steal. There was however plenty of crime and violence. Bootleggers, Bonnie and Clyde, and others not quite so famous Poverty has an effect on some people that leads to acts of desperation, especially in a society that values possessions over character When looking at crime, we need to judge crimes committed to enhance wealth such as shoddy products that harm consumers, pushing opiates on unsuspecting patients and creating an epidemic, funny mortgages that left people bankrupt and homeless, rigging the stock market and taking 7+billion dollars in taxpayer money… Crime has many faces ",
            "date": "Answered July 11, 2018",
            "views": "75",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Henry Sasser",
                "href": "/profile/Henry-Sasser"
            },
            "answer_text": "Poverty is not the “mother of crime.” But it is one major contributor. Crime exists, because people want something they do not have, and are not willing to obey the law(s) on the books to get it. What poverty does is, it reduces the things poor people have available to them, thereby offering far more things for poor people to desire—and much more motivation to them to commit a crime to get it. Therefore, more poor people commit crimes than people who aren’t. But this isn’t a causal relationship, it is a parallel one. The same factors that cause poverty are the factors that increase crime rates among poor populations. That’s why simply throwing money at poor communities doesn’t help. Until we address the factors that cause the poverty itself, we cannot address the co-existing crime rates. Poverty is not the “mother” of crime. It is simply it’s “Nest.” ",
            "date": "Answered August 14, 2018",
            "views": "28",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sr Singh",
                    "user_href": "/profile/Sr-Singh-3"
                },
                {
                    "user_id": "Ahmad Abdul Rehman",
                    "user_href": "/profile/Ahmad-Abdul-Rehman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bridget Collins",
                "href": "/profile/Bridget-Collins-19"
            },
            "answer_text": "No, it’s fear & greed. Fear. Fear is the mother of all crimes. Fear that you will never have enough. I say to people “A thief wants what you have - no matter how much they have it’s never enough. They want what you have.” Fear & greed drive most crimes. They kill you because they want what you have or they’re afraid you’ll expose them. They’re afraid they’ll be punished for cheating or shamed for having an affair. If poverty was the mother of all crimes, rich people would be the most law abiding folks we know. Bernie Madoff proves that’s not true. ",
            "date": "Answered September 25, 2018",
            "views": "129",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Justin Brader",
                "href": "/profile/Justin-Brader"
            },
            "answer_text": "Poverty leads people to have a negative thought about themselves. “I am poor so must be inferior”. That negative thought, is rooted in a core person belief of incapability, and possibly a second core belief of unlovability. Those core beliefs lead to an emotional response of feeling despair, fear, anger, sadness, etc. And those feeling lead people to act out… by committing crimes. The subconscious hope is that being SUCCESSFUL in crime will lead them or of poverty and failure into wealth and success. But it usually ends up getting them caught or forced into hiding, which rarely ends up leading to wealth and success. So the cycle starts again. And it keeps reinforcing itself being stronger and stronger. ",
            "date": "Answered February 23, 2018",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pankaj Dasila",
                    "user_href": "/profile/Pankaj-Dasila-5"
                },
                {
                    "user_id": "Bryce Edwards",
                    "user_href": "/profile/Bryce-Edwards-3"
                },
                {
                    "user_id": "Seif Juma",
                    "user_href": "/profile/Seif-Juma-2"
                },
                {
                    "user_id": "Hafla Noor",
                    "user_href": "/profile/Hafla-Noor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Li",
                "href": "/profile/Sam-Li-160"
            },
            "answer_text": "Necessity or lack of better opportunities can create incentive to commit crimes. For example a millionaire will not engage in looting because the opportunity cost of getting caught far outweighs any benefit. Poverty will likely result in a lack of resources to prevent crimes. This includes things like having the necessary manpower, equipment, and training for law enforcement. A lower probability of getting caught results in weak deterrence against criminal activities. ",
            "date": "Answered August 29, 2018",
            "views": "195",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jon Baldwin",
                "href": "/profile/Jon-Baldwin-4"
            },
            "answer_text": "How can poverty promote crimes? The obvious as stated above, if you have nothing, sometimes you take to get by. But more realistically, it's the sense of entitlement and that your own misfortune is due to other's successes. Being told not that you are useless and incapable but that the reason everyone else is doing well, is by keeping you down. Now you're both entitled to what others have, and since they are “keeping you down” you can get a little revenge by taking it. Identity politics and class warfare cause more crime than poverty itself. ",
            "date": "Answered November 30, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patrick King",
                "href": "/profile/Patrick-King-20"
            },
            "answer_text": "Not particularly. Ivan Boesky has done very well for himself. Joe Bonanno died at 97 an extremely wealthy man although he was a little stressed. Crime is like anything else. It may lead you to fortune or you may wind up in poverty living on hand-outs. The thing is, there are no guarantees. A good education, concentration and hard work may also lead you to poverty. The luck factor is what it is because you cannot second guess it. How many people who worked hard, saved their money and went to church are living in poverty today because they invested with Boesky? I’m not sure the number of people he ruined is even known. But what is known, Boesky paid his million dollar fine with a personal check, did his stint in prison and now he lived in luxury on the money he stole. As many criminals are psychopaths one can’t even say they live in emotional poverty. They think no more about their victims than you think about the carrots you ate the other night. ",
            "date": "Answered September 8, 2018",
            "views": "247",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raymond McAneny",
                "href": "/profile/Raymond-McAneny-1"
            },
            "answer_text": "Take a hard look at life in the ghetto. You’re part of a dysfunctional family with four kids, no father and a mom working a minimum wage job or perhaps even two jobs. Your friends have money. They toss it around and no where to get more by dealing on the street corner. Shooting up gives you a taste of something better. Your peer group is the local gang and they make you feel like an alpha male with a gun. The way out of this life seems a million miles away and there is no one to guide you out of this jungle. So you deal, you rob and you kill to get buy. ",
            "date": "Answered November 30, 2019",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Lebedev",
                "href": "/profile/Andrew-Lebedev-2"
            },
            "answer_text": "Let’s say for one second that you are so poor, that you just got evicted. You are homeless, no place to go to, and no friends or relatives. You have nothing to sell, and need a place to stay. Your car might be good for a few days, but at some point it will be too cold, as winter is coming up. What do you do? The bank won’t give you a credit card, as you have had issues paying it off before, and you really don’t want to beg for money as it’s embarrassing, and will likely not earn you anything as you live in a poor city. Getting a loan might work for $500, but you know you won’t pay it off, and you don’t want jail time. Most people Resort to stealing, robbery, or gangs for help. ",
            "date": "Answered July 5, 2018",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peggy Papez",
                "href": "/profile/Peggy-Papez"
            },
            "answer_text": "Poverty does not lead to crime. The idea that poverty leads to crime however becomes a self fulfilling prophesy. The low expectations of the rest of society leads to the kind of thinking where poor people begin to believe crime is expected of them, or the even more harmful idea that they cannot leave poverty without the help of others and never through their own hard work. In both cases it becomes a race to the “bottom” as circumstances and societal conditioning dis-incentivises the poor from actively pursuing a better life for themselves until others do step forward to “help”. ",
            "date": "Answered August 1, 2018",
            "views": "742",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Frantz Senat",
                    "user_href": "/profile/Frantz-Senat-2"
                },
                {
                    "user_id": "Arash Shahriari",
                    "user_href": "/profile/Arash-Shahriari-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dana Leigh",
                "href": "/profile/Dana-Leigh-5"
            },
            "answer_text": "Yes, r/t the desperation for money or items to sell to gain by financially. Increased disparity of mental health issues. An increased in addiction rates r/t poor coping skills while taking money to continue the addiction. Increased anger and violence in society for being inferior. More seclusion and segregation with higher crime rate in demographical areas thus utilizing the learned behavior as a child in ghettos or poor rural towns that continue to cycle of crime. ",
            "date": "Answered December 6, 2018",
            "views": "103",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Greenfield",
                "href": "/profile/Joshua-Greenfield-3"
            },
            "answer_text": "Mankind is a slave to his stomach. Men are required by the job market to engage in conspicuous consumption to compete with their more monied peers. If you have to have something to overcome a barrier to entry, but cannot borrow without current income to get it then there exists a pressure and temptation to steal the item or steal something that can be sold to get it. However, it is not true that poverty is the root of all crime. Sometimes, culture that begins as a medicine becomes a poison and its partakers are routinely pushed to a breaking point they are either (maybe both) not emotionally mature nor adequately practiced in ethical problem solving enough to handle in accordance with the law. ",
            "date": "Answered June 11, 2018",
            "views": "285",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Sarlay",
                "href": "/profile/Robert-Sarlay"
            },
            "answer_text": "It shouldn’t be. Sometimes it is used as an excuse. With the myriad of federal, state, local, and church programs to help the poor no one should need to commit a crime to eat or to find a safe place to sleep at night - if they want to. Poverty in the USA is relative. Objective poverty exists elsewhere in this world and many of those places are safer than the ‘poor’ neighborhoods in the USA. So by example poverty doesn’t always equate to crime. Nonetheless, we need to try to eliminate as much poverty as possible thru job training, education, and other assistance as effective as possible. ",
            "date": "Answered September 25, 2018",
            "views": "227",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vilnis Krumins",
                "href": "/profile/Vilnis-Krumins"
            },
            "answer_text": "Poverty causes stress. And stress leads to all sorts of problems (e.g., depression). What makes it worse is that stress is contagious: if the people in your neighourhood are stressed then it will rub off on you — even if you are living well, it will affect you. Stress can lead to poor work performance, poor school performance, family problems, etc. And this leads to problems staying employed, finding employment, stayed housed, staying in school, etc.. All of this ends up creating a society in which crime (violent and non-violent) happens more easily. ",
            "date": "Updated May 29, 2018",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marianne Kooiman",
                "href": "/profile/Marianne-Kooiman"
            },
            "answer_text": "Because many people that live in poverty are being pushed into crime in order to survive. They don’t want to become criminals, they need to. Otherwise there would literally be no food on the table. People need money to survive, that’s a fact. People that live in poverty are no exception to that. So they start looking for ways to get money, however that ain’t easy when you’re poor. Mostly they try to stay honest for as long as possible, but without much success. They cannot make money the honest way, what remains is the dishonest way. That’s why countries that offer a minimum income for their citizens got a lower crime rate. These minimum incomes cost tax money, but in return the people get to live in a safer environment with less chance of getting robbed. Most people consider that worth the higher taxes. And for the people living in poverty, a minimum income ensures that they don’t need to fall back to crime in order to survive. ",
            "date": "Answered October 25, 2019",
            "views": "389",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "Jose Marco Bisnar",
                    "user_href": "/profile/Jose-Marco-Bisnar"
                },
                {
                    "user_id": "Galyna Kutsovska",
                    "user_href": "/profile/Galyna-Kutsovska"
                },
                {
                    "user_id": "Salwa Halabia",
                    "user_href": "/profile/Salwa-Halabia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Elderfield",
                "href": "/profile/Alex-Elderfield"
            },
            "answer_text": "I don’t think it is THE cause of ALL crime, we have crimes of passion, we have white collar crimes, we have colluding with foreign governments, we have securities fraud, insider dealing, war crimes, speeding on motorways, none of which would seem to be caused by poverty. However, if we did not have the social security safety net and health services we have in the UK, I could see that as people slipped into poverty and extreme poverty they may be driven to crime so they and their family could survive. I would, if I had not other means of providing for my family (no prospect of employment or anything to sell) I would probably turn to crime (at least shoplifting) to ensure their immediate survival. ",
            "date": "Answered August 5, 2018",
            "views": "303",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "That Guy",
                "href": "/profile/That-Guy-683"
            },
            "answer_text": "It doesn’t. During the Great Depression in the 1930’s transient men rode the rails looking to work for their next meal yet people could leave their doors unlocked, according to people who lived during that time. Today there is “poverty of the spirit” to paraphrase Mother Teresa, which, even though the government subsidizes food and housing, many recipients turn to crime (mostly involving using and selling of drugs). ",
            "date": "Answered July 5, 2018",
            "views": "916",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sogand Gh",
                    "user_href": "/profile/Sogand-Gh-1"
                },
                {
                    "user_id": "Gilbert Umayam",
                    "user_href": "/profile/Gilbert-Umayam-1"
                },
                {
                    "user_id": "Chris Shepard",
                    "user_href": "/profile/Chris-Shepard-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Wimmer",
                "href": "/profile/Carl-Wimmer-1"
            },
            "answer_text": "Crime happens when someone takes shortcut. Don’t want to work for 100 dollars (when that could take all day), steal it. It does not matter how much you already have, if you have a “shortcut mind”, you will commit crimes. Poverty does not lead to crimes, criminals do. Lots of poor people, just like lots of people in every economic strata, are honourable and good (and my privilege to know). Some people, in every economic strata, are criminals. ",
            "date": "Answered August 27, 2018",
            "views": "137",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kelli Mistry",
                "href": "/profile/Kelli-Mistry"
            },
            "answer_text": "This is pretty easy sometimes when people live in poverty they only know a certain way of life they don't know any better. And when they this is pretty easy sometimes when people live in poverty they only know a certain way of life they don't know any better. And when they see people that have things that they do not they think sure I can take that because they can just get another that's only one viewpoint on why poverty creates crime. I believe it all boils down to ignorance and conditioning, because ignorance does not mean stupid it means you don't know any better, you've never been shown another way. ",
            "date": "Answered August 14, 2018",
            "views": "238",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Evelyn Elwell Uyemura",
                "href": "/profile/Evelyn-Elwell-Uyemura"
            },
            "answer_text": "Yes. Whether you are talking about white people in Dickensian London or minorities in 2020 US, there is always a correlation between poverty and street crime or violent crime, or crimes like illegal substance abuse, prostitution, etc. Of course, the really huge-scale crime is often done by the rich, like Bernie Madoff, but most people don’t count white-collar crime when they think about crime. ",
            "date": "Answered February 12, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeffrey Ashe",
                "href": "/profile/Jeffrey-Ashe-1"
            },
            "answer_text": "Most crime is committed out of desperation. There seem to be no other ways to survive. Over the past years cash transfers to the destitute in poor countries have lead to less crime, more business startup, more looking for work elsewhere, more children attending school, better use of health care, less prostitution etc. . A small amount of predictable cash income tip the balance in favor of positive change. The same is true of saving in groups where the members hold each other accountable and help each other. Combining cash transfer with saving in groups can be particularly powerful in this regard. ",
            "date": "Answered September 6, 2018",
            "views": "229",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kunjan Trivedi",
                "href": "/profile/Kunjan-Trivedi-9"
            },
            "answer_text": "Welfare→ Single motherhood→ Bad students→ Crime Allow me to explain:  Single motherhood rates skyrocketed, esp in the black community starting the War on Poverty.  It’s not simply because of divorce rates and second-wave feminism, but less women are marrying in the first place.  Brilliant: the welfare system incentivized a bad decision not to get married. And now black kids have a 400% greater chance of being stuck in poverty in a broken household.  This has an impact on the kids as well. Suspension rates are directly related to the single motherhood rate. Now add in other factors like the need for male role models (especially in the black community) you get kids joining gangs. They commit serious crimes, all which could be solved by the parents getting married before having kids. @ ",
            "date": "Answered May 6, 2018",
            "views": "693",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Hargraves",
                    "user_href": "/profile/Adam-Hargraves-1"
                },
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "David Veksler",
                    "user_href": "/profile/David-Veksler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ying Wu",
                "href": "/profile/Ying-Wu-51"
            },
            "answer_text": "First, “Blight invites crime”; as an example, a neighborhood corner with unfixed, broken windows and unmended, broken fences is more likely to see crime than a corner that looks neat and prim. Research by some city governments has shown this to be true. Secondly, some people that commit crimes do so out of necessity rather than by choice, case in point: the man (in poverty) who was caught trying to steal a pizza so he could feed his kids. ",
            "date": "Updated October 6, 2018",
            "views": "81",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adam Hargraves",
                    "user_href": "/profile/Adam-Hargraves-1"
                },
                {
                    "user_id": "William Lawyer",
                    "user_href": "/profile/William-Lawyer-1"
                },
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "Tyler Lebeuf",
                    "user_href": "/profile/Tyler-Lebeuf"
                },
                {
                    "user_id": "Vibhanshu Sharma",
                    "user_href": "/profile/Vibhanshu-Sharma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Bradley",
                "href": "/profile/Charles-Bradley-43"
            },
            "answer_text": "Poverty can promote crime not only towards the intended reciprocants, but can promote malicious planning practices that could be voted in to registration by future society… Many believe that the Stutute of Limitations protect them…It may protect their finances, but it does nothing for their children in the future in terms of the court of public opinion… We could take a cue from various Asiatic cultures via actually thinking and acting for and towards more than just the current generation that breathes here on Earth… Just a thought… ",
            "date": "Answered August 27, 2018",
            "views": "132",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rudi van Doornegat",
                "href": "/profile/Rudi-van-Doornegat"
            },
            "answer_text": "People in survival mode may have no choice if begging doesn’t bring them enough to stay alive. Women may end up in prostitution. Human traffickers may take advantage of them by exploiting them. But other than that, it’s mostly wide spread wealth inequality that promotes crime. If everyone is poor, than there is no real prey. People may get jealous, especially if they see or feel the system is rigged against them climbing the social ladder. ",
            "date": "Answered August 13, 2018",
            "views": "167",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Aubrey",
                "href": "/profile/Richard-Aubrey"
            },
            "answer_text": "Perhaps it’s the reverse: Crime makes people not want to buy in a particular area, come there for recreation, work there, start businesses there. They don’t want to live there or keep businesses there. They don’t want to go to school there or send their kids to schools which are subject to crime and disruption. Money and the people with money and the ways to make money leave. Now you have poverty. ",
            "date": "Answered July 9, 2018",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gregory Norton",
                "href": "/profile/Gregory-Norton"
            },
            "answer_text": "Crimes are normal behavior of humans, so nothing really promotes crime. The relevant question is “What are the forces that discourage crime?” Poverty can undermine these forces, but the excuses of SJWs claiming “poverty causes crime” are far more damaging. The thinking behind questions such as this undermine the discouraging of crime. ",
            "date": "Answered August 30, 2018",
            "views": "360",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alyssa Boatang",
                    "user_href": "/profile/Alyssa-Boatang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Meier",
                "href": "/profile/Tom-Meier-18"
            },
            "answer_text": "It’s not. Poverty per se doesn’t generate crime, there are too many examples from history to list. Social alienation is probably the single greatest factor engendering crime. Obviously poverty can make people feel socially alienated but it doesn’t necessarily follow unless poverty is construed as unjust This is probably why many religions posit a supernatural justification or compensation for poverty. It helps promote social harmony. In the modern world, particularly in the West poverty is widely held to be unjust and so it generates a lot of social alienation. ",
            "date": "Answered April 16, 2018",
            "views": "238",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jaquess Schitt",
                    "user_href": "/profile/Jaquess-Schitt-1"
                },
                {
                    "user_id": "Douglas James",
                    "user_href": "/profile/Douglas-James-41"
                },
                {
                    "user_id": "Mike Kauffmann",
                    "user_href": "/profile/Mike-Kauffmann"
                },
                {
                    "user_id": "Dennis Pratt",
                    "user_href": "/profile/Dennis-Pratt-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Zaper",
                "href": "/profile/Peter-Zaper"
            },
            "answer_text": "Yes. In my years as a prosecutor the mor impoverished an area the higher the crime rate. It is that way in Chicago and all of the major cities as far as I know. With out jobs people turn to crime as a way to make money. Drug dealing is rampant as are armed robberies, burglaries, car thefts, etc. ",
            "date": "Answered January 6, 2017",
            "views": "533",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ulla Vinther Rasmussen",
                    "user_href": "/profile/Ulla-Vinther-Rasmussen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Combs",
                "href": "/profile/Richard-Combs-7"
            },
            "answer_text": "Hello there OP, It doesn’t. The disparity between people leads to anger, then crime. When there is a poverty stricken class that sees the wealthier all about them, crime blossoms. The rational mind takes a back seat and the desire to accumulate more power and wealth grows. Success in being a criminal entrepreneur leads to more crime, by being an example. There is also a vengeance in working the system and getting more than the government wants a person to have. The tragic irony is that the poor tend to commit more crime against other poor. Ciao ",
            "date": "Answered September 4, 2018",
            "views": "132",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben Andrews",
                "href": "/profile/Ben-Andrews-89"
            },
            "answer_text": "Say you are poor but really want a 70″ plasma TV. Your burger-flipping job covers food and rent, and that's it. You could save up or finance, or get a different job, or (since life isn't fair and the deck is clearly stacked against you) you could sneak into the house down the street and take the one there. Hey look, Mr. Richbritches went on vacation… ",
            "date": "Answered August 13, 2018",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Terri Cam",
                "href": "/profile/Terri-Cam-1"
            },
            "answer_text": "Poverty can lead to all sorts of problems. Poor people are unable to have their basic needs met. They don't have food or clothes because they can't pay for it. so they will steal to get it. Stealing opens the door to jail time. They don't have homes or bathrooms so they will squat in other peoples homes or publically expose themselves in order to ",
            "date": "Answered August 22, 2018",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Frink",
                "href": "/profile/Joe-Frink-2"
            },
            "answer_text": "Criminality, poverty, and low IQ are highly correlated. If there is a causal relation, it would be IQ, because each person is born with an innate capacity for intelligence. Some develop it, some don’t. Mean IQ is also different by race, 85, 89, 103, 106, 113 for black, Hispanic, white, Asian, and Ashkenazi Jew respectively. This observation correlates with disparities in crime and poverty. ",
            "date": "Answered September 3, 2020",
            "views": "170",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Antonio Angeloni",
                "href": "/profile/Antonio-Angeloni-1"
            },
            "answer_text": "Yes, here’s an example: In the South of Italy, it is quite poor because it has been abused by the rest of Italy. However, now it isn’t as poor; why? Because of organised crime. There aren’t enough jobs/opportunities that are legal. So people turn to mafias, crime; Camorra, Cosa Nostra, Sacra Corona Unita and ‘Ndrangheta. ",
            "date": "Answered March 1, 2020",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gandhi Kunal",
                "href": "/profile/Gandhi-Kunal"
            },
            "answer_text": "Yes of course, poverty can promote crime. When we talk about crime it's morally co-releated to poverty, it is true most of the crime committed are under poverty, some person commit crime only to overcome from hunger, it's hardly know a well rich income person commit crime, let's say a gentleman is committed crime absolutely their would be a reason behind i.e. poverty, I have seen everyone has a goodness in their heart their mind but to live they steal other properties. All the terrorists person since I have know they're a jobless, when they don't have any income that could efforts their life and their family they have no other option, so finally they chose to take up those profession then that profeprofession force them to commit crime. ",
            "date": "Answered August 5, 2018",
            "views": "285",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Haze",
                "href": "/profile/Robert-Haze-3"
            },
            "answer_text": "When we as a human are not getting our sufficient needs met we will do that what we must do to have these needs met. I know an individual with zero income. He applied and received Food Stamps. He receives $194 in food stamps monthly. This is his ONLY source of income. He can stretch this amount for less than two weeks. Then what. Shoplifting is an option. Some do. For a direct answer to your question, MOST DEFINITELY. ",
            "date": "Answered November 3, 2018",
            "views": "67",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Salwa Halabia",
                    "user_href": "/profile/Salwa-Halabia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Mason",
                "href": "/profile/Joshua-Mason-24"
            },
            "answer_text": "Because need births action. If you are starving (*need* to eat) you are more likely to steal food (an action) than one who just bought a great meal (action). Cleptomaniacs are an exception to that rule. Now, what truly constitutes *need*, in particular a need that requires illegal behavior as the only resolution, is debatable. Some desire a life of excess but can't afford it-that's greed not need. Some are addicts-that is a need but an acquired one. Food, shelter etc are fundamental. In a more abstract sense, some need to get to a better environment to live and/or raise their children, the need to get from point A to point B etc. Again, it's debatable - and certainly not *all* crime is a response to financial needs. Some need to not appear weak in a predatory environment for example. Need alone is not a justification for offensive behavior in a communal society ",
            "date": "Answered July 2, 2016",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Gavras",
                "href": "/profile/Steve-Gavras"
            },
            "answer_text": "No it does not. However, if you blame your poverty on someone else, you may feel justified in criminal behavior. Crime occurs when people have no respect for the property of others, or have no self-respect. Rich politicians and their rich cronies, and people at every other socioeconomic level commit crimes. ",
            "date": "Answered February 14, 2020",
            "views": "92",
            "upvotes": " Answer requested by Jayaram Krishnaswamy",
            "upvoters": [
                {
                    "user_id": "Clay Elam",
                    "user_href": "/profile/Clay-Elam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vernon Averill",
                "href": "/profile/Vernon-Averill"
            },
            "answer_text": "Why is poverty associated with criminality?  Being poor has always been a crime. Ask any rich person. Being poor will always be a crime. How poverty became a crime in America | Peter EdelmanA Poverty Expert Explains How We Make It a Crime to Be Poor5 Ways Being Poor is a Crime - Inequality.org",
            "date": "Answered October 26, 2019",
            "views": "205",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Shepard",
                    "user_href": "/profile/Chris-Shepard-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Langley",
                "href": "/profile/George-Langley"
            },
            "answer_text": "In isolation, poverty does not lead to crime any more than wealth leads away from crime. One could even argue that wealth leads to more crime than poverty does because there is no incentive to steal from a poor person, and stealing a $2K TV is certainly a “bigger” crime than stealing a loaf of bread. ",
            "date": "Answered September 17, 2018",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jhordi Adrian Medina",
                "href": "/profile/Jhordi-Adrian-Medina"
            },
            "answer_text": "Unlike what many people believe, poverty doesn’t lead to crime, crime is the result of social decomposition and a lack of both education and ethics, of course these can be aggravated by social inequality and lack of opportunities when it comes to former felons, but on the strictest sense, poverty doesn’t lead to crime alone. ",
            "date": "Answered July 7, 2019",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Angel Femia",
                "href": "/profile/Angel-Femia"
            },
            "answer_text": "yes it does lead to crime, they really have no choice if they want to survive. When I was on the streets we had to steal food from the vendors selling on the streets: fruit, bread or whatever we could find. Others go further. choicless ",
            "date": "Answered September 3, 2018",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Liam N. O' Ceallaigh",
                    "user_href": "/profile/Liam-N-O-Ceallaigh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "As Hamza says, although poverty breeds a variety of “subsistence” crimes, there are many crimes motivated by sheer greed and which are often committed by people who are already well-to-do or even outright wealthy. Also, there are yet other categories of crimes which are motivated by different things altogether. Sex crimes, for instance, may be the result of compulsions caused by clinical conditions like “paraphilias”, or by various types of mental illness. ",
            "date": "Answered June 11, 2018",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siddharth Kumar",
                    "user_href": "/profile/Siddharth-Kumar-228"
                },
                {
                    "user_id": "Fred Cox",
                    "user_href": "/profile/Fred-Cox-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Johns",
                "href": "/profile/Scott-Johns-18"
            },
            "answer_text": "It doesn't necessarily lead to crime, however, people who are wealthy really don't have the NEED or TEMPTATION to, for example, shoplift, or commit burglary, or Rob a bank … the people who do these things for the most part are the people who are inpoverished ",
            "date": "Answered September 19, 2018",
            "views": "81",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melanie Kliesen",
                    "user_href": "/profile/Melanie-Kliesen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carmela Chavez",
                "href": "/profile/Carmela-Chavez"
            },
            "answer_text": "Laws are created that place harsh criminal penalties and social apartheid against the enterprises and habits of the poor. Violence is often overlooked or carries a lesser punishment if one is not poor. Non-violent conduct is usually ONLY criminalized if it is associated with poverty. You can be paid and rewarded for stealing billions and crashing the economy of nations, but you will be condemned and disenfranchised and rejected from the economy for stealing from a gas station. ",
            "date": "Answered December 7, 2017",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paramdham Param",
                "href": "/profile/Paramdham-Param"
            },
            "answer_text": "desire fulfilled or otherwise is the seed from which all other emotions, passions feelings sprout. the malignant and-/ or uncontrolled result crime.. since desire feeds on itself. desire is deathless and endless in variety, so is the life of crime and varieties of crime there are criminals who are not poor and righteous who are poor.. anyway,, nowadays it is difficult to define crime if what is punishable by society/govt is the benchmark for crime ",
            "date": "Answered October 3, 2020",
            "views": "275",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shil King",
                "href": "/profile/Shil-King"
            },
            "answer_text": "For a lot yes it could be because of addictions and or just out right criminals. Also some people will steal to have something they absolutely need. But honestly I don’t believe the majority do. There’s plenty of poorer people who hardly have income or live pay check to pay check and they are not out here breaking the laws. Even people with money can be involved in crime. I think a lot had to do with the person. ",
            "date": "Answered January 14, 2020",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nizam Ismail",
                "href": "/profile/Nizam-Ismail-23"
            },
            "answer_text": "No, its politicians and law peace officers, poverty is an excuse for criminals, no matter how zuma had he still robbed our land of its fruits , and thus any rich in govt continues to do so, so were is poverty there in parliament , businesses same but they aint poor but also do crime in a business perspective and then never pay back or bribery is involved comapre the stats , the rich commits an average more crime than poors by 100 times more a day ",
            "date": "Answered April 19, 2019",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Silbermann",
                "href": "/profile/Frank-Silbermann"
            },
            "answer_text": "“Is poverty the leading cause of crime?” There is no way to know. Poverty is correlated with crime, and certainly it is one of many possible motivations for crime — but it could be that certain cultural standards tend to promote both poverty and crime together (and thus being responsible for most of the correlation). ",
            "date": "Answered April 18, 2019",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ted Guanzon",
                    "user_href": "/profile/Ted-Guanzon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guido Vitolo",
                "href": "/profile/Guido-Vitolo"
            },
            "answer_text": "this is partly true.Poor people acting like that because of their  condition.However this is not the only case. What really makes the difference it s tghe way you are.If you are not prone to certain things you will never act that way. On the same time it s also true that the lack of education it s one of the reason of bad behavior ",
            "date": "Answered March 7, 2014",
            "views": "166",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ted A. Brewster",
                "href": "/profile/Ted-Brewster"
            },
            "answer_text": "Not according to Joe Biden  ",
            "date": "Answered October 3, 2020",
            "views": "182",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Donald McCullough",
                    "user_href": "/profile/Donald-McCullough-3"
                },
                {
                    "user_id": "Joshua Youngkin",
                    "user_href": "/profile/Joshua-Youngkin-1"
                },
                {
                    "user_id": "William Oblasney",
                    "user_href": "/profile/William-Oblasney"
                },
                {
                    "user_id": "Judy Parker",
                    "user_href": "/profile/Judy-Parker-61"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                }
            ]
        },
        {
            "author_info": {
                "name": "A.k. Raja",
                "href": "/profile/A-k-Raja-4"
            },
            "answer_text": "Food is the basic need of human being . If there no way by which someone cannot get food then crime like theft, robbery, boycott, assault and can also lead to murder. Thus this is due to poverty. And poverty can promote certain crimes. ",
            "date": "Answered July 9, 2018",
            "views": "670",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nhlanhla Sithole",
                    "user_href": "/profile/Nhlanhla-Sithole-2"
                },
                {
                    "user_id": "Jacqueline Homan",
                    "user_href": "/profile/Jacqueline-Homan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mattias Eliasson",
                "href": "/profile/Mattias-Eliasson-1"
            },
            "answer_text": "This is very regional but having organized crime is usually a sign of people being locked out from the legal job market. If you can chose between a job at McDonald’s and organized crime, McDonald’s is as profitable but with a lot less risk. However most countries has barriers to enter the business community which many find to high. For example you may not have reputation enough to get a minimum wage job and the only people that will offer something below minimum wage are by definition criminals. ",
            "date": "Answered September 17, 2018",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Katongole Johnny",
                "href": "/profile/Katongole-Johnny-1"
            },
            "answer_text": "When you’re poor you become envious , Jealousy, on the other hand and this happens to people who fail to get out of their comfort Zone while they have desire to live good life and in the wrong run they end up being wrong doers. I Have helped people drive out of their comfort zone and earn good money worldwide at low cost Real Make Money Online At low Cost ",
            "date": "Answered September 22, 2016",
            "views": "281",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sandy Crooks",
                "href": "/profile/Sandy-Crooks"
            },
            "answer_text": "Assuming you mean crime related to property rather than the person -Doesn't it depend on how poor the individual is, in comparison with the society in which they live - and given the education they have had, their morals etc?So the answer has to encompass available government, financial & social support, the actual opportunity for criminal acts of gain, and so on. Does that help with your essay?! ;-) ",
            "date": "Answered March 7, 2014",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Al Huck",
                "href": "/profile/Al-Huck-1"
            },
            "answer_text": "No not at all! Instead poor brought up, that result in lack of self confidence and so little self respect what send angry children toward lying, theft, bullying, show-off and ending in crimes as crude afford to solve it. Working on polishing your talent for career or sports etc helps in staying away from criminal thoughts. ",
            "date": "Answered September 25, 2018",
            "views": "164",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James T. Bawden",
                "href": "/profile/James-T-Bawden"
            },
            "answer_text": "The answer is, sadly, very obvious. Desperate people do desperate things out of their desperation. Desperate people don’t quibble about Morality or Obedience to the Law. A hungry person WILL obtain food to eat, even if they have to steal it from a Grocery Store. ",
            "date": "Answered July 17, 2018",
            "views": "700",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brad Heinrichs",
                    "user_href": "/profile/Brad-Heinrichs"
                },
                {
                    "user_id": "Nhlanhla Sithole",
                    "user_href": "/profile/Nhlanhla-Sithole-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esio Ulo-Ante",
                "href": "/profile/Esio-Ulo-Ante"
            },
            "answer_text": "Crime is self constructed and can not be linked to poverty. Although most convict would admit that they commit crimes as a result of inability to afford a particular dream or purpose, this same persons go around indulging in the same act after been pardoned or freed. But in some situation it is poverty that lead to crime. ",
            "date": "Answered September 8, 2018",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tala Andromeda",
                "href": "/profile/Tala-Andromeda"
            },
            "answer_text": "Lack of viable options to make a living legally, poor neighborhoods have bad schools which give a bad education, being surrounded by crime and criminals with no option to leave the area, targeted policing in poor neighborhoods and over-charging defendants, inability to escape poverty gives children poor role models ",
            "date": "Answered May 5, 2018",
            "views": "672",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Emilia Bellone",
                    "user_href": "/profile/Emilia-Bellone"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Guanzon",
                "href": "/profile/Ted-Guanzon-1"
            },
            "answer_text": "Poverty is definitely a motivator for crime but there are certain factors to take into place before considering it as the leading cause, such as the demographic profile of an area, its access to different social services, cultural mores, etc. ",
            "date": "Answered April 18, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sebastian Andres Lazo Torrealba",
                "href": "/profile/Sebastian-Andres-Lazo-Torrealba"
            },
            "answer_text": "Bad education does. When poor people don't get properly educated, they go wrong. That's why countries like Uruguay or Iceland represents a very low crime rate in their societies. It's all about well educated kids ",
            "date": "Answered March 7, 2014",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lê Đức Duy",
                    "user_href": "/profile/Lê-Đức-Duy-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cornelius Vath",
                "href": "/profile/Cornelius-Vath"
            },
            "answer_text": "Desparate people do desperate things. The fact that they’re seeing chronically happy, healthy, wealthy people living the dream on TV 24 hours a day doesn’t help. The wealth distribution among humans is so bad, it should be criminal.  ",
            "date": "Answered December 2, 2017",
            "views": "533",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jacqueline Homan",
                    "user_href": "/profile/Jacqueline-Homan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhyuday Jaiswal",
                "href": "/profile/Abhyuday-Jaiswal"
            },
            "answer_text": "Poverty might be a reason, but severe circumstances motivates a person to commit these things and poverty also falls under these circumstances.#justMyThoughtIt's not just the poor, a well educated richer person can also do these things. ",
            "date": "Answered March 7, 2014",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ishan Mehta",
                "href": "/profile/Ishan-Mehta-4"
            },
            "answer_text": "Absolutely cause there is nothing like resisting easy money!!! Also the people in the grip of poverty are desperate to get free....in country like India which is filled with corrupt politicians who don't really care about anything more than themselves have been screwing people below the poverty line for decades on end!! These circumstances gave rise to most sought after and the undisputed king of Mumbai Dawood Ibrahim...he was born too in the slums of India and is the son of a police inspector....quite an irony!!! ",
            "date": "Answered March 7, 2014",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Sadler",
                "href": "/profile/Jim-Sadler-18"
            },
            "answer_text": "The poor simply refuse to vanish and die from hunger out in the woods. If the poor get hungry enough, or naked enough or cold or hot enough, and then angry enough then anyone may feel the wrath that flows from them. Then we have the millions who flee from suffering with booze, a needle or pills, or retreat into insanity. Allow poverty and you vote for sudden outrage and violence. ",
            "date": "Answered June 8, 2019",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anthony Ibbott",
                "href": "/profile/Anthony-Ibbott"
            },
            "answer_text": "Not necessarily. Mostly it’s the other way around. Criminals are not producers. They only consume. So a community of criminals will steal and consume until everything is gone. Then they will have nothing. And be poor. To be wealthy, you have to produce and trade. Trade is based on honesty. ",
            "date": "Answered September 11, 2019",
            "views": "71",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eyitayo Obikoya",
                    "user_href": "/profile/Eyitayo-Obikoya"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Smith",
                "href": "/profile/John-Smith-25421"
            },
            "answer_text": "If I go 4 days without food well I'm going to eat somehow. But I'm different from almost everyone out here. I would only do that after all options had been exhausted and all the dumpsters checked. I'm trying to stay out of jail and get off the street. But as I said I'm different. You don't always run into people who have normal thought processes and then maybe they are tired of the street and the struggle and jail is easy. Or maybe they have a drug problem. The reasons could be as varied as the people. ",
            "date": "Answered October 4, 2018",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Madsen",
                "href": "/profile/John-Madsen-39"
            },
            "answer_text": "The social determinants of crime are poverty, social exclusion, wage and income inequality, negative family background, level of education and other economic and social factors. http://fmwww.bc.edu/EC-P/wp948.pdf ",
            "date": "Answered March 16, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Erin Wood",
                    "user_href": "/profile/Erin-Wood-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hossam Soltan",
                "href": "/profile/Hossam-Soltan-1"
            },
            "answer_text": "Because there is a positive relationship between poverty and crimes. If I am poor, I would be frustrated and pressured; this pressure would explore any time. Imagine If you have kids and they are hungry and you do not have money, what would you do? You may steel money to feed them. ",
            "date": "Answered May 22, 2018",
            "views": "379",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jyoti Maurya",
                    "user_href": "/profile/Jyoti-Maurya-77"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Akridge",
                "href": "/profile/Robert-Akridge"
            },
            "answer_text": "All human beings, persons, have a universal set of human needs such as: oxygen, water, nutrients, shelter, clothing, social support, etc. Level of poverty impacts directly on these and other basic human needs. ",
            "date": "Answered September 3, 2018",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Angie Brooke",
                "href": "/profile/Angie-Brooke"
            },
            "answer_text": "Poverty is only one factor. There is greed, jealousy, revenge, and in the case of serial killers, self fulfillment. These combined cover all crime. ",
            "date": "Answered February 24, 2019",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eyitayo Obikoya",
                    "user_href": "/profile/Eyitayo-Obikoya"
                },
                {
                    "user_id": "Dan Nolen",
                    "user_href": "/profile/Dan-Nolen-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meeno Yoshida",
                "href": "/profile/Meeno-Yoshida"
            },
            "answer_text": "Often times people in poverty find the only way out is to either join the military or sell drugs. And many gangs even join the military for the adventure. Sometimes they cannot find job opportunity, or perhaps they get robbed everyday, or maybe they see the temptation of easy money. ",
            "date": "Answered October 18, 2019",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ben Dempsey",
                    "user_href": "/profile/Ben-Dempsey-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Kinsley",
                "href": "/profile/B-Kinsley"
            },
            "answer_text": "Yes banks are accused of criminality but it’s probably rare and also they have lawyers (maybe plenty of shady and and bad deeds but that’s a different question). In terms of economic crime mugging, drug dealing , pickpocketing ect the game theory offers more to people with few prospects to be damaged by a criminal record and they’ll probably be happier with the amount of money they gain despite the risk. ",
            "date": "Answered December 16, 2019",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohamed Alsayed",
                "href": "/profile/Mohamed-Alsayed-3"
            },
            "answer_text": "Poverty have a good relation with crimes. Because people have to satisfy their needs, and when they don't have enough money to do that. They will do that with illegal ways. ",
            "date": "Answered January 6, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Hart",
                    "user_href": "/profile/John-Hart-267"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Kutch",
                "href": "/profile/Joseph-Kutch"
            },
            "answer_text": "I will answer your question with a question.If poor people commit crimes because they’re poor, why do rich people commit crimes? Poverty and lack of education determines the type of crime. ",
            "date": "Answered April 18, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Fitzpatrick",
                "href": "/profile/Paul-Fitzpatrick-31"
            },
            "answer_text": "I'm sure at some point in history someone robbed a bank because they were broke. Poverty is definitely one reason for crime for certain people in certain circumstances. ",
            "date": "Answered August 18, 2018",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cristobal Patiño",
                "href": "/profile/Cristobal-Patiño-1"
            },
            "answer_text": "Yes. because Desperate Situations can make people take Desperate Measures. If their trying to feed their Children; what do you think they might do? ",
            "date": "Answered February 12, 2020",
            "views": "11",
            "upvotes": " Answer requested by Jayaram Krishnaswamy",
            "upvoters": [
                {
                    "user_id": "Samit Deshar",
                    "user_href": "/profile/Samit-Deshar"
                }
            ]
        },
        {
            "author_info": {
                "name": "C. Lee",
                "href": "/profile/C-Lee-182"
            },
            "answer_text": "There are to types of crimes. One for need nd the other for greed. If you are hungry, you will steal for food, clothing and shelter. If you are greedy, you steal for the things you want but don’t want to work for them. ",
            "date": "Answered August 12, 2018",
            "views": "188",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tao Lee",
                "href": "/profile/Tao-Lee-43"
            },
            "answer_text": "No because you see it all the time in Rich people too. They do it for personal gain and power over others. ",
            "date": "Answered January 15, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jacqueline Homan",
                    "user_href": "/profile/Jacqueline-Homan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jen Smoke",
                "href": "/profile/Jen-Smoke"
            },
            "answer_text": "Because the struggle is real…sometimes things don't go as planned and life takes a person's legs and she's already a single parent and the strength within the person would have to keep on keeping on for the kids sake because all they got is her because family isn't an option. She and her kids r all the family they got. ",
            "date": "Answered December 4, 2017",
            "views": "499",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mari Adkins",
                    "user_href": "/profile/Mari-Adkins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Caro",
                "href": "/profile/Jonathan-Caro-2"
            },
            "answer_text": "Because people have nothing to lose, why shouldn’t a homeless guy kick in your car window and steal your wallet, what’s going to happen him if caught? Three hots and cot. ",
            "date": "Answered August 13, 2018",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anders Nilsson",
                "href": "/profile/Anders-Nilsson-52"
            },
            "answer_text": "Powerty and inequalities in opportunity makes for a crime hotbed. When you have nothing and it seems there is no way out of that situation you have nothing to lose. ",
            "date": "Answered August 30, 2018",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Teodoro Cervantes-Leon",
                "href": "/profile/Teodoro-Cervantes-Leon"
            },
            "answer_text": "There is not a historical relationship. Poverty is not the problem. Crime, Poverty and the Familiy ",
            "date": "Answered September 27, 2017",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Narmatha Mothilal",
                    "user_href": "/profile/Narmatha-Mothilal"
                },
                {
                    "user_id": "Keldibek Kozhoev",
                    "user_href": "/profile/Keldibek-Kozhoev-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Conley",
                "href": "/profile/Frank-Conley-9"
            },
            "answer_text": "I think the notion that poverty leads to crime has been a long outdated theory that holds no place in modern day public policy making ",
            "date": "Answered September 19, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oliver Wright",
                "href": "/profile/Oliver-Wright-1"
            },
            "answer_text": "Because poetic sloppiness is the father of all excuses. ",
            "date": "Answered April 17, 2018",
            "views": "126",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Erik Fair",
                    "user_href": "/profile/Erik-Fair"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tak Nomura",
                "href": "/profile/Tak-Nomura-2"
            },
            "answer_text": "Yes. Here’s some proof. These are the 20 safest and most crime-free countries Also, How Does Poverty Cause Crime Criminology Essay ",
            "date": "Answered February 12, 2020",
            "views": "17",
            "upvotes": " Answer requested by Jayaram Krishnaswamy"
        },
        {
            "author_info": {
                "name": "Stan Lake",
                "href": "/profile/Stan-Lake-1"
            },
            "answer_text": "Crime leads to Poverty Wealthy societies are based on a degree of trust. Criminality is based on a lack of trust. ",
            "date": "Answered November 14, 2017",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vicki Carter",
                "href": "/profile/Vicki-Carter-14"
            },
            "answer_text": "It doesn't. It takes a criminal mind to be a criminal and that falls to rich and poor and all incomes in between ",
            "date": "Answered December 3, 2017",
            "views": "459",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven Babb",
                "href": "/profile/Steven-Babb"
            },
            "answer_text": "poor people steal because they don have things or want more things. rich people already have things like food and money and a house ",
            "date": "Answered August 1, 2018",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shakir Mumtaz",
                "href": "/profile/Shakir-Mumtaz"
            },
            "answer_text": "Preying on the lower self of a normal human being. Poverty is a double-edged sword. Read: Poverty VS Wealth ",
            "date": "Answered July 18, 2019",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Radhi Abushaheen",
                "href": "/profile/Radhi-Abushaheen"
            },
            "answer_text": "Imam Ali said: if pooverty is a man , i would have killed him. Duas.org - Dua - Supplications - Prayers - Islam ",
            "date": "Answered December 4, 2017",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Estanislao Deloserrata",
                "href": "/profile/Estanislao-Deloserrata"
            },
            "answer_text": "Poverty doesn’t promote crime. Poverty is one of the available excuses for committing crimes. ",
            "date": "Answered July 11, 2018",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abel Enos",
                "href": "/profile/Abel-Enos"
            },
            "answer_text": "Robbery and prostitution are good examples of crimes resulted from poverty. ",
            "date": "Answered November 24, 2018",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "C Jane Wayburn",
                "href": "/profile/C-Jane-Wayburn"
            },
            "answer_text": "Simple, if the only way some poor guy can get money to feed his family, is to resorts to crime, he will do it. ",
            "date": "Answered July 8, 2018",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kate White",
                "href": "/profile/Kate-White-73"
            },
            "answer_text": "This very recent article is a good description. BREAKING POVERTY: Crime, poverty often linked ",
            "date": "Answered September 17, 2018",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vegard Pettersen",
                "href": "/profile/Vegard-Pettersen-1"
            },
            "answer_text": "Let me put it this way.   ",
            "date": "Answered March 7, 2014",
            "views": "305",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anton Van Zyl",
                "href": "/profile/Anton-Van-Zyl-5"
            },
            "answer_text": "No money, no food. Do the calculation ",
            "date": "Answered July 5, 2018",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Hafetz",
                "href": "/profile/Robert-Hafetz-1"
            },
            "answer_text": "Crime causes poverty ",
            "date": "Answered July 16, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Riya Raju",
                "href": "/profile/Riya-Raju-10"
            },
            "answer_text": "Among other things... ",
            "date": "Answered March 7, 2014",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kamuyu Mwai",
                "href": "/profile/Kamuyu-Mwai"
            },
            "answer_text": "It may but not a MUST ",
            "date": "Answered March 7, 2014",
            "views": "163",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Felix Mccann",
                "href": "/profile/Felix-Mccann"
            },
            "answer_text": "Yes. ",
            "date": "Answered January 6, 2017",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Goud",
                "href": "/profile/Joseph-Goud"
            },
            "answer_text": "It isn’t. ",
            "date": "Answered April 23, 2018",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Little",
                "href": "/profile/Chris-Little-46"
            },
            "answer_text": "100% ",
            "date": "Answered February 12, 2020",
            "views": "23",
            "upvotes": "0"
        }
    ]
}