{
    "title": "Does Joe Biden inspire you? - Quora",
    "tags": [
        "Joe Biden Possible 2016 Presidential Campaign (2015)",
        "Joe Biden (politician)",
        "Inspiration",
        "Barack Obama (politician)",
        "Democratic Party (US politics)",
        "Politicians and Government Leaders",
        "Politics",
        "Politics of the United States of America",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Cataldo",
                "href": "/profile/Stephen-Cataldo"
            },
            "answer_text": "Biden was my Senator in the tiny state of Delaware for many years. He has no desire to inspire you. He is a policy wonk who likes people and wants to get the details right and get the right people in the right places. I’d bet what he wishes if he was president right now: not to give inspiring speeches while COVID-19 floods our hospitals, but rather to have appointed the best professionals to the CDC years ago, to have set up good relations between epidemiologists in the US and China so we had all the details early, to have helped both China and Italy when it hit them first and learned from their experiences, and to have been totally prepared with testing and case tracking here. America would look like Taiwan: more testing, more case tracking. We might need to shut down for 3 weeks, not 8; see 10,000 people die before the vaccine, not 100,000 or 250,000. America would be listed with Taiwan and Germany as a success story, not listed with Iran and Italy. If Biden was president, Trump would be tweeting that a few thousand older people dying is just like the flu and not worth shutting down the economy for 3 whole weeks and Biden is a loser. That’s what he wants to do. Not inspire you. Around the world, presidents that inspire are often trouble. Personally, I wish the Democratic primary voters had picked someone more ready to tackle the generations-long problems in DC, and someone younger. But Biden would make a better-than-average president. He’ll appoint good people, he’ll let the anti-corruption candidates that I really like have some access. He’ll talk to Republicans and might even mean that a few more senators decide to follow in McCain and Romney’s footsteps, which matters. I’ll watch West Wing for inspiration (or listen to FDR’s inaugural again.) ",
            "date": "Answered April 6, 2020",
            "views": "858",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josh Drake",
                    "user_href": "/profile/Josh-Drake-43"
                },
                {
                    "user_id": "Carol Henshaw",
                    "user_href": "/profile/Carol-Henshaw-11"
                },
                {
                    "user_id": "Bryce Adamson",
                    "user_href": "/profile/Bryce-Adamson-3"
                },
                {
                    "user_id": "Resist Tyranny",
                    "user_href": "/profile/Resist-Tyranny-1"
                },
                {
                    "user_id": "Darán Breathneach",
                    "user_href": "/profile/Darán-Breathneach"
                },
                {
                    "user_id": "K. Reynolds",
                    "user_href": "/profile/K-Reynolds-23"
                },
                {
                    "user_id": "Loren Becker",
                    "user_href": "/profile/Loren-Becker"
                },
                {
                    "user_id": "Jerry Renshaw",
                    "user_href": "/profile/Jerry-Renshaw-1"
                },
                {
                    "user_id": "Mike Beales",
                    "user_href": "/profile/Mike-Beales"
                },
                {
                    "user_id": "Keith Chase",
                    "user_href": "/profile/Keith-Chase-5"
                },
                {
                    "user_id": "Steve Brosnan",
                    "user_href": "/profile/Steve-Brosnan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dong Jie",
                "href": "/profile/Dong-Jie-16"
            },
            "answer_text": "I’ve read quite a few answers about why biden isn’t inspirational. So, I want to write about why JOE BIDEN inspires me. I’m inspired by: (a) his EXTRAORDINARY RESILIENCE AND COURAGE (b) his Belief in Democracy and America (c) his economic vision for America. Using technology to improve lives so we should be promoting Green jobs, Infrastructure repairs, promoting greater equality (which should include Net Neutrality and internet access for all, just like we believe electricity and water are utilities to be made available for all). (1) I’m inpired by his EXTRAORDINARY RESILIENCE AND COURAGE. Consider, he lost his first wife and daughter in a car accident when he was a young man. His 2 sons were injured. Fortunately, they recovered. But then, as a 72 year old man, he lost his eldest son to Gliobastoma an aggressive type of brain cancer. This is what an expert had to say about Gliobastoma: “There are no known causes for brain cancer, said Dr. Charles Redfern, medical director of Sharp Healthcare’s new Laurel Amtower Cancer Institute and Center for Neuro-Oncology. However, he said, the biggest risk factor is age. He said what makes the disease particularly devastating is that it strips sufferers of body function. That often includes the ability to think, see, speak, move, feel and comprehend. “Brain tumors are often devastating,” he said. “You can think of it as like having a stroke. … You could go from being a 40-year-old state’s attorney to being in a wheelchair overnight … or you could go from taking care of kids to needing someone to take care of you.”” Cancer that took life of Beau Biden, uncommon, but dangerous I cannot imagine, losing one child, let alone 2 and a partner I love. I cannot imagine the pain of losing MY child to cancer and then, on top of that, watching My Child deteriorate over a period of months. Perhaps My Child loses his sense of sight, or touch, or hearing. And then more and more of my child will disappear as the Gliobastoma engulfs his brain. Until he is but a shell of the human being who was MY CHILD . The closest I can imagine what Joe Biden went through is watching a parent you love grow senile or getting fast deteriorating alzheimers, then multiply that pain by a million times. In the 21st Century, with all the advances in medicine, it is an extremely unlucky parent who has to endure the death of a beloved child. But Joe Biden did not grow bitter. I believe these profound tragedies has made him HUMBLE. Quite frankly, if I have to live through what he did, and I didn’t have young children dependent on my survival, I’d simply have lost the will to live. (2) I’m inspired by his Belief in Democracy and America. When Joe Biden decided NOT to run for POTUS in 2016, he KNEW that the chances of him every running for POTUS was likely to be zero. After all, HRC was widely expected to win in 2016 and no matter how rotten a president she was, she would likely be the incumbent nominee in 2020. So it seems to me, that Joe Biden gave up his ambition and accepted what he saw was his fate. I believe that Joe Biden came back into politics and offered himself as a choice to be the Democratic Party’s presidential nominees in large part because he believed that democracy and America were in grave risk. He gave the democrats and the people a 3rd choice. If we didn’t want Sanders or Warren there was Joe Biden. He was the old and steady pair of hands. And if that’s what people wanted, then he was here to help. If they voted against him, then that was that. Remember. He had ALREADY WALKED AWAY from that ambition for the rest of his life. He didn’t have to come back to all the scrutiny, to all the criticisms, to all the slander and libel. And all for the risk of losing the primary anyway. In this equation there was nothing for Joe and Jill Biden to gain other than because they believed the soul of America was truly at risk and they felt they had to try to do something. Still, it was NOT their choice but the people’s. Some folks say that Joe Biden is now the nominee because of the DNC and Mass media supporting him. Really, we are so easily influenced? How do you explain the votes which Bernie Sanders got, including winning Iowa, Nevada, New Hampshire, but not other primaries? Those voters are smart but everyone else is stupid? BTW full disclosure: My Choice during the primaries was ANDREW YANG even though I knew he was a long shot. I will however VOTE for Biden because I do believe the soul of America and democracy is at risk. (3) Joe Biden’s economic vision for America THE BIDEN PLAN TO INVEST IN MIDDLE CLASS COMPETITIVENESS – Joe Biden for President I agree that we should be promoting Green Technology. Solar, Wind energy. Fracking? Let fracking compete with Solar and Wind and Hydrogen. Our infrastructure needs work. Greater equality includes ensuring that there is net neutrality and fast, reliable broadband access to the internet for everyone. I believe we need to narrow the digital divide. Healthcare - improve on Obamacare. Private health options MUST be available. But public ones are also available We do it in Australia, Canada, the EU, Japan, etc. Education. Dump’s fans like to say that Dump is better for the economy. I see no evidence of that. The trillion dollar tax cut benefited big corporations and the 1%. The debts of this trillion dollar tax cut is NOT PAYING for itself. Where is the 3% annualised growth rate which you need? Where is there a coherent plan to ensure good paying jobs? Sure, unemployment fell during dump’s tenure. But it was not sustainable. Joe Biden’s economic vision for America is achievable. I believe he will achieve it. It’s not perfect and I hope he will consider UBI as one of the tools in his arsenal. Because I believe that AI, Robotics, 5G Broadband and IOT are going to change the way we all work. Many will lose their jobs and not get an equivalent job. But Joe’s measures are a start in the right direction. ",
            "date": "Answered July 31, 2020",
            "views": "311",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carol Henshaw",
                    "user_href": "/profile/Carol-Henshaw-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emanuel Laforté",
                "href": "/profile/Emanuel-Laforté"
            },
            "answer_text": "No. Well, maybe. I was inspired by Obama. Have you listened to his speeches?  That was incredibly inspiring. I don’t see Joe doing that. At least not at the same rate of eloquence. Obama was an inspirational President. Biden is a good man, and will definitely be a better President anytime than the currently nincompoop in the White House: the brainless madman, the Donald. I’m European. A few months ago, I became American citizen. I used to be a little conservative, but I always thought healthcare and education should be a human right, don’t blame me, it works wonderfully in Europe and Japan, therefore my first choice was Bernie Sanders. He endorsed Biden today, so I will. Do you remember how Trump keeps calling the press, and anyone who opposes him as the “Enemy of the people”? I actually think he is the enemy of the American people. His authoritarian views should concern everyone in the United States. It is actually disturbing seeing conservatives, Republicans, and even libertarians supporting such behaviors. It is a sad time for Americans, and it left the bar extremely low for the White House. In conclusion, Biden can be inspirational when compared to the current uneducated President. Biden shares the values most of the American people do. Biden will bring back the United States to lead the World. Biden will take back the United States to its historical allies. Biden knows science is the cure for the current situation. Biden is a decent man. Sanders endorsement isn’t enough. Wait until you see Obama join the fight to recover the United States from the cult. It will help him more, and wait until he choices a great VP as well. Biden has inspirational people around him: that alone, makes him inspirational.  ",
            "date": "Answered April 14, 2020",
            "views": "313",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roy Edward Carr Jr.",
                "href": "/profile/Roy-Edward-Carr-Jr"
            },
            "answer_text": "Let me get this right you are asking if a bureaucrat that was in Washington DC for over forty years but has absolutely nothing to show for it other than selling his office of VP to China and the Ukraine and who knows who, enriching himself, his son and his brother inspires me? A guy that smells women’s hair, touches children and fondles unsuspecting women inspires me? A guy that is a goofy Buffon, a guy that couldn’t run a three car funeral without accepting a kick back, oh yes he really inspires me. Absolutely not Joe Biden is a creepy old, crooked, pedophile that sickens me!!! ",
            "date": "Answered April 8, 2020",
            "views": "193",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jackson Cage",
                    "user_href": "/profile/Jackson-Cage-6"
                },
                {
                    "user_id": "Robert Cummings",
                    "user_href": "/profile/Robert-Cummings-143"
                },
                {
                    "user_id": "Michael Calabrese",
                    "user_href": "/profile/Michael-Calabrese-38"
                },
                {
                    "user_id": "Madeline Brandenburg",
                    "user_href": "/profile/Madeline-Brandenburg"
                },
                {
                    "user_id": "Richard Morgan",
                    "user_href": "/profile/Richard-Morgan-108"
                },
                {
                    "user_id": "Robert Johnson",
                    "user_href": "/profile/Robert-Johnson-2449"
                },
                {
                    "user_id": "Norm Fishler",
                    "user_href": "/profile/Norm-Fishler"
                },
                {
                    "user_id": "Henry Parker",
                    "user_href": "/profile/Henry-Parker-11"
                },
                {
                    "user_id": "Al Marshall",
                    "user_href": "/profile/Al-Marshall-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Cataldo",
                "href": "/profile/Michael-Cataldo-3"
            },
            "answer_text": "No. Joe Biden, like many politicians is human with flaws. I don’t believe he is as bad as the Republicans make him out to be or as good as his followers claim. He is trust into the current position because of a need to rid ourselves of a megalomaniac who is destroying people’s faith in the United States. Like most of the country I will vote for him because Trump is not a choice. With any luck he will pick a running mate who is vibrant and will help make changes to our political system. This person should, for the good of future generations, accept a loss in Presidential power to prevent a tyrant from exercising unlimited power. There will always be people who will want to have unrestricted power. Hopefully we can move towards a bipartisan agreement to really limit it in an emergency, obviously the last four years proved the current system doesn’t work. ",
            "date": "Answered April 6, 2020",
            "views": "274",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeffery Will",
                    "user_href": "/profile/Jeffery-Will-3"
                },
                {
                    "user_id": "Darán Breathneach",
                    "user_href": "/profile/Darán-Breathneach"
                },
                {
                    "user_id": "Leo McDevitt",
                    "user_href": "/profile/Leo-McDevitt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Habib Fanny",
                "href": "/profile/Habib-Fanny"
            },
            "answer_text": "No, not really. But Biden is fine. He’s a guy I can live with. I don’t need inspiration to go vote. I consider it my civic duty. Besides, Donald Trump supplies all the inspiration I ever need, a cautionary tale about the calamities that befall us when people don’t vote in high enough numbers. ",
            "date": "Answered April 14, 2020",
            "views": "961",
            "upvotes": " View 51 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Josh Drake",
                    "user_href": "/profile/Josh-Drake-43"
                },
                {
                    "user_id": "Carol Henshaw",
                    "user_href": "/profile/Carol-Henshaw-11"
                },
                {
                    "user_id": "Ken Boardrow",
                    "user_href": "/profile/Ken-Boardrow"
                },
                {
                    "user_id": "Joshua Youngkin",
                    "user_href": "/profile/Joshua-Youngkin-1"
                },
                {
                    "user_id": "Kelli Nakamura",
                    "user_href": "/profile/Kelli-Nakamura-2"
                },
                {
                    "user_id": "Vishnu Linga",
                    "user_href": "/profile/Vishnu-Linga"
                },
                {
                    "user_id": "Varun Gaitonde",
                    "user_href": "/profile/Varun-Gaitonde"
                },
                {
                    "user_id": "Harrison Boyle",
                    "user_href": "/profile/Harrison-Boyle"
                },
                {
                    "user_id": "Barbara Hokanson Hicks",
                    "user_href": "/profile/Barbara-Hokanson-Hicks"
                },
                {
                    "user_id": "Riley Thompson",
                    "user_href": "/profile/Riley-Thompson-12"
                },
                {
                    "user_id": "Rex Appleby",
                    "user_href": "/profile/Rex-Appleby"
                },
                {
                    "user_id": "Alberto Oliveira",
                    "user_href": "/profile/Alberto-Oliveira"
                },
                {
                    "user_id": "Alfredo Perozo",
                    "user_href": "/profile/Alfredo-Perozo"
                },
                {
                    "user_id": "Teresa Baker",
                    "user_href": "/profile/Teresa-Baker-36"
                },
                {
                    "user_id": "Laveesh Sharma",
                    "user_href": "/profile/Laveesh-Sharma-2"
                },
                {
                    "user_id": "Mary Arneson",
                    "user_href": "/profile/Mary-Arneson"
                },
                {
                    "user_id": "Samad Khan",
                    "user_href": "/profile/Samad-Khan-33"
                },
                {
                    "user_id": "Karl Asafor",
                    "user_href": "/profile/Karl-Asafor"
                },
                {
                    "user_id": "Muhammed Vaseem",
                    "user_href": "/profile/Muhammed-Vaseem"
                },
                {
                    "user_id": "Kamil Koczurek",
                    "user_href": "/profile/Kamil-Koczurek"
                },
                {
                    "user_id": "Earl Dabney",
                    "user_href": "/profile/Earl-Dabney"
                },
                {
                    "user_id": "Daniel Lu",
                    "user_href": "/profile/Daniel-Lu-28"
                },
                {
                    "user_id": "Kyle Madura",
                    "user_href": "/profile/Kyle-Madura-1"
                },
                {
                    "user_id": "Tamara Lee",
                    "user_href": "/profile/Tamara-Lee-124"
                },
                {
                    "user_id": "Jarred Dunn",
                    "user_href": "/profile/Jarred-Dunn"
                },
                {
                    "user_id": "Ruth Bygrave",
                    "user_href": "/profile/Ruth-Bygrave-1"
                },
                {
                    "user_id": "Noelle Bridgman-Wile",
                    "user_href": "/profile/Noelle-Bridgman-Wile"
                },
                {
                    "user_id": "Matthew Bowyer",
                    "user_href": "/profile/Matthew-Bowyer-6"
                },
                {
                    "user_id": "Mario Stradale",
                    "user_href": "/profile/Mario-Stradale"
                },
                {
                    "user_id": "Bev Anne",
                    "user_href": "/profile/Bev-Anne-1"
                },
                {
                    "user_id": "Trey Davis",
                    "user_href": "/profile/Trey-Davis-111"
                },
                {
                    "user_id": "Cathy Riess",
                    "user_href": "/profile/Cathy-Riess"
                },
                {
                    "user_id": "Matt Parker",
                    "user_href": "/profile/Matt-Parker-230"
                },
                {
                    "user_id": "George Ramos",
                    "user_href": "/profile/George-Ramos-1"
                },
                {
                    "user_id": "Lars Hildebrandt",
                    "user_href": "/profile/Lars-Hildebrandt-2"
                },
                {
                    "user_id": "Dusty Walker",
                    "user_href": "/profile/Dusty-Walker-2"
                },
                {
                    "user_id": "Bruce A McIntyre",
                    "user_href": "/profile/Bruce-A-McIntyre"
                },
                {
                    "user_id": "Sara Rosseel",
                    "user_href": "/profile/Sara-Rosseel"
                },
                {
                    "user_id": "Holly Robertson",
                    "user_href": "/profile/Holly-Robertson-6"
                },
                {
                    "user_id": "Roshan Mark",
                    "user_href": "/profile/Roshan-Mark-2"
                },
                {
                    "user_id": "Katja Kaila",
                    "user_href": "/profile/Katja-Kaila"
                },
                {
                    "user_id": "Abdul Hussain",
                    "user_href": "/profile/Abdul-Hussain-90"
                },
                {
                    "user_id": "Mihir Mishra",
                    "user_href": "/profile/Mihir-Mishra-6"
                },
                {
                    "user_id": "Natalie Morales",
                    "user_href": "/profile/Natalie-Morales-7"
                },
                {
                    "user_id": "William Harold Hinkson II",
                    "user_href": "/profile/William-Harold-Hinkson-II"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Quang Tuyen Pham",
                    "user_href": "/profile/Quang-Tuyen-Pham"
                },
                {
                    "user_id": "Jeroen Westmaas",
                    "user_href": "/profile/Jeroen-Westmaas"
                },
                {
                    "user_id": "Elaine Scott",
                    "user_href": "/profile/Elaine-Scott-104"
                },
                {
                    "user_id": "Henry Brice",
                    "user_href": "/profile/Henry-Brice"
                },
                {
                    "user_id": "Emanuel Laforté",
                    "user_href": "/profile/Emanuel-Laforté"
                }
            ]
        },
        {
            "author_info": {
                "name": "Morgan Leake",
                "href": "/profile/Morgan-Leake-1"
            },
            "answer_text": "Biden inspires me to wonder how on earth anybody could seriously think he is capable of serving as President… ",
            "date": "Answered April 6, 2020",
            "views": "61",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jackson Cage",
                    "user_href": "/profile/Jackson-Cage-6"
                },
                {
                    "user_id": "Robert Cummings",
                    "user_href": "/profile/Robert-Cummings-143"
                },
                {
                    "user_id": "Michael Calabrese",
                    "user_href": "/profile/Michael-Calabrese-38"
                },
                {
                    "user_id": "K. Reynolds",
                    "user_href": "/profile/K-Reynolds-23"
                },
                {
                    "user_id": "Steven Parada",
                    "user_href": "/profile/Steven-Parada-1"
                },
                {
                    "user_id": "Eddie Smith",
                    "user_href": "/profile/Eddie-Smith-358"
                },
                {
                    "user_id": "Sheryl Ferguson",
                    "user_href": "/profile/Sheryl-Ferguson-4"
                },
                {
                    "user_id": "Judy Parker",
                    "user_href": "/profile/Judy-Parker-61"
                },
                {
                    "user_id": "Ric Cumming",
                    "user_href": "/profile/Ric-Cumming"
                },
                {
                    "user_id": "Henry Cooper",
                    "user_href": "/profile/Henry-Cooper-56"
                },
                {
                    "user_id": "James Lingren",
                    "user_href": "/profile/James-Lingren-1"
                },
                {
                    "user_id": "Mitchell McAleer",
                    "user_href": "/profile/Mitchell-McAleer"
                },
                {
                    "user_id": "Gerard Smorowski",
                    "user_href": "/profile/Gerard-Smorowski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lloyd Christensen",
                "href": "/profile/Lloyd-Christensen-2"
            },
            "answer_text": "To vote against him, yes. He was always an idiot. He was wrong on everything of importance. President Obama put him in charge of gun control and that didn’t lead to anything. And now he’s senile. ",
            "date": "Answered April 6, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jackson Cage",
                    "user_href": "/profile/Jackson-Cage-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leo McDevitt",
                "href": "/profile/Leo-McDevitt"
            },
            "answer_text": "No, Biden and I are light years apart on the issues. Should he become president, I’ve resigned myself to a lackluster next four years. That being said, I’ll take a lackluster presidency over the raging dumpster fire we currently have any day. ",
            "date": "Answered April 6, 2020",
            "views": "84",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carol Henshaw",
                    "user_href": "/profile/Carol-Henshaw-11"
                },
                {
                    "user_id": "Ken Boardrow",
                    "user_href": "/profile/Ken-Boardrow"
                },
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                },
                {
                    "user_id": "Robert Brown",
                    "user_href": "/profile/Robert-Brown-218"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Williams",
                "href": "/profile/Robert-Williams-427"
            },
            "answer_text": "Yes. To take a nap. ",
            "date": "Answered April 6, 2020",
            "views": "90",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jackson Cage",
                    "user_href": "/profile/Jackson-Cage-6"
                },
                {
                    "user_id": "Michael Calabrese",
                    "user_href": "/profile/Michael-Calabrese-38"
                },
                {
                    "user_id": "K. Reynolds",
                    "user_href": "/profile/K-Reynolds-23"
                },
                {
                    "user_id": "Ric Cumming",
                    "user_href": "/profile/Ric-Cumming"
                },
                {
                    "user_id": "Sarah A. Smith",
                    "user_href": "/profile/Sarah-A-Smith-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loren Becker",
                "href": "/profile/Loren-Becker"
            },
            "answer_text": "Not at all ",
            "date": "Answered April 8, 2020",
            "views": "97",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jackson Cage",
                    "user_href": "/profile/Jackson-Cage-6"
                },
                {
                    "user_id": "Michael Calabrese",
                    "user_href": "/profile/Michael-Calabrese-38"
                },
                {
                    "user_id": "Justin Juelich",
                    "user_href": "/profile/Justin-Juelich"
                },
                {
                    "user_id": "Robert Johnson",
                    "user_href": "/profile/Robert-Johnson-2449"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stuart Meyer",
                "href": "/profile/Stuart-Meyer-2"
            },
            "answer_text": "To heights of disbelief that democracy could be so inefficient and the MSM so heedless of what is and has been obvious for years (but even more so with Biden’s obvious mental decline. ) ",
            "date": "Answered April 7, 2020",
            "views": "118",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Madeline Brandenburg",
                    "user_href": "/profile/Madeline-Brandenburg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Boardrow",
                "href": "/profile/Ken-Boardrow"
            },
            "answer_text": "Does Biden inspire me? No. He and his 47 years are part of the problem than burdened us with Trump. But, he would get Trump out and correct much of Trump’s dumbassery, and THAT inspires me. ",
            "date": "Answered September 20, 2020",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jude Romano",
                "href": "/profile/Jude-Romano-1"
            },
            "answer_text": "If an old guy with dementia can be the democratic front runner for the office of the presidency, then hell yeah, he inspires me. ",
            "date": "Answered April 6, 2020",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jackson Cage",
                    "user_href": "/profile/Jackson-Cage-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Hebert",
                "href": "/profile/Greg-Hebert-13"
            },
            "answer_text": "Yes. He has for years. He is competent, capable, reliable and every bit as nice as he seems. ",
            "date": "Answered April 8, 2020",
            "views": "40",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carol Henshaw",
                    "user_href": "/profile/Carol-Henshaw-11"
                },
                {
                    "user_id": "Tom Nathe",
                    "user_href": "/profile/Tom-Nathe"
                }
            ]
        },
        {
            "author_info": {
                "name": "John L Plough",
                "href": "/profile/John-L-Plough"
            },
            "answer_text": "Lol ",
            "date": "Answered April 6, 2020",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Cummings",
                    "user_href": "/profile/Robert-Cummings-143"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcel Maria",
                "href": "/profile/Marcel-Maria"
            },
            "answer_text": "not at all delusional old cooser you need viagra to be inspired at 77 harris is who they should have chosen ",
            "date": "Answered April 6, 2020",
            "views": "30",
            "upvotes": " Answer requested by Arnav Limaye"
        }
    ]
}