{
    "title": "Does Russia plan to invade the US? - Quora",
    "tags": [
        "Russia–Ukraine Conflict (2014–present)",
        "Invasions",
        "Foreign Policy of Russia",
        "Russia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Viktor Ygorov",
                "href": "/profile/Viktor-Ygorov"
            },
            "answer_text": "This is insane the top post puts it best except in reverse. At no point has Russian federation threatened U.S, accused it of orchestrating anything or encroached on US borders . Claimed US to be a risk to world peace, its president a murderer criminal or thief. Or called for embargo due to US unjust hostile action towards other nations. Of which there has been plenty. The few flybys are an ordinary activity both nations engage in. No one in Russia of sound mind have proposed an attack on U.S. In the last 30 years… Let alone supported it. U.S. Is only mentioned as some geo political adversary that would likely be more hostile and assertive if it wasn't for level of defense Russia maintains. Battling US is never a topic of debate, or sane possibility… Us future leaders debating how they going to bomb other countries when in charge is not a popular topic as well. ( North Korea and US are simular in this ) It would be viewd as political suicide to promote war as electoral platform in Russia. The opinions about Russia mostly come from Hollywood, politicians creating enemies and old Cold War material…reporters that know that slendering Russia, its people or leaders is a good way to score cheap points with audience. In Russia however Us isn't viewd as enemy dispite all negativity we see directed at us, still it is viewed as a stubborn, high-strung partner.. Occasional hypocrite, but still long term partner. Russians despite what is portrayed by Hollywood don't fatishise wars with others… The culture of “theoretical war” non present .. It's substituted by history books. Currently, only one nation is capable of attacking anyone, any country at a drop of a hat with very little reason ( and has done so) and is potential risk to just about any nation from this stand point. It is not Russian federation. ",
            "date": "Answered September 14, 2016",
            "views": "35",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ira Serge",
                    "user_href": "/profile/Ira-Serge"
                },
                {
                    "user_id": "Andy Wait",
                    "user_href": "/profile/Andy-Wait-1"
                },
                {
                    "user_id": "Sofiia Novikova",
                    "user_href": "/profile/Sofiia-Novikova-1"
                },
                {
                    "user_id": "Flash Cloud",
                    "user_href": "/profile/Flash-Cloud"
                },
                {
                    "user_id": "Ellia Kristopany Kohen",
                    "user_href": "/profile/Ellia-Kristopany-Kohen"
                },
                {
                    "user_id": "Lena Burova",
                    "user_href": "/profile/Lena-Burova"
                },
                {
                    "user_id": "Valeriy Beloyar",
                    "user_href": "/profile/Valeriy-Beloyar"
                },
                {
                    "user_id": "Alex Ladov",
                    "user_href": "/profile/Alex-Ladov-1"
                },
                {
                    "user_id": "Leonardo Teles",
                    "user_href": "/profile/Leonardo-Teles-1"
                },
                {
                    "user_id": "Izik Estes",
                    "user_href": "/profile/Izik-Estes"
                },
                {
                    "user_id": "Jay Cashen",
                    "user_href": "/profile/Jay-Cashen"
                },
                {
                    "user_id": "Daniel Kalchev",
                    "user_href": "/profile/Daniel-Kalchev"
                },
                {
                    "user_id": "Olga Petrova",
                    "user_href": "/profile/Olga-Petrova-13"
                },
                {
                    "user_id": "Holden Jane",
                    "user_href": "/profile/Holden-Jane"
                },
                {
                    "user_id": "Boris Okner",
                    "user_href": "/profile/Boris-Okner"
                },
                {
                    "user_id": "Gigi J Wolf",
                    "user_href": "/profile/Gigi-J-Wolf"
                },
                {
                    "user_id": "Steve McIntyre",
                    "user_href": "/profile/Steve-McIntyre"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian KIdder",
                "href": "/profile/Brian-KIdder-3"
            },
            "answer_text": "Not militarily. Russia is in no position to do so. Russia's biggest issue is its size, diversity, the resulting insecurity of its borders and corresponding need to expand and co-opt bordering nations for use as buffer states. It also has failed to diversify economically, relying primarily upon energy exports for its trade, and its population is shrinking. Since global energy trade is denominated largely in dollars, and the dollar is rising and will continue to for the foreseeable future, this adds insult to injury as far as low global oil prices contributing to Russia's decline. Russia therefore seeks to attack the US by aligning with others to weaken or break the dollar-as-global-reserve juggernaut. This is likely doomed to fail, as the US Navy controls global shipping lanes, and therefore global trade flows by extension.  Geographic reality can't be entirely overcome with monetary machinations. ",
            "date": "Answered September 29, 2015",
            "views": "875",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bogdan Alexandrovich",
                    "user_href": "/profile/Bogdan-Alexandrovich"
                },
                {
                    "user_id": "John Holstlaw",
                    "user_href": "/profile/John-Holstlaw-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juri Mirlander",
                "href": "/profile/Juri-Mirlander"
            },
            "answer_text": "Yes, we always plan to deliver a fatal blow to the American mainland in case of en American aggression. Russia has recently deployed Status-6 Oceanic Multipurpose System aka “Poseidon”. Its an advanced torpedo armed with a powerful highly radioactive nuclear charge, when activated it will create a deadly highly radioactive tsunami which will destroy the American costline and deal as much collateral damage as possible rendering the target region inhabitable wasteland. The Nuclear agent used is Cobalt which produces extremely deadly radiation fallout, no chance of survival for any life form affected. Status-6 Oceanic Multipurpose System - Wikipedia  ",
            "date": "Answered July 20, 2020",
            "views": "39",
            "upvotes": " Answer requested by Chris Romero",
            "upvoters": [
                {
                    "user_id": "Sofiia Novikova",
                    "user_href": "/profile/Sofiia-Novikova-1"
                },
                {
                    "user_id": "Alexander Semigrodskikh",
                    "user_href": "/profile/Alexander-Semigrodskikh"
                },
                {
                    "user_id": "Konstantin Sivukhin",
                    "user_href": "/profile/Konstantin-Sivukhin"
                },
                {
                    "user_id": "Albert Michaels",
                    "user_href": "/profile/Albert-Michaels-3"
                },
                {
                    "user_id": "Alfonso Bullock",
                    "user_href": "/profile/Alfonso-Bullock"
                },
                {
                    "user_id": "Torbjörn Perttu",
                    "user_href": "/profile/Torbjörn-Perttu"
                },
                {
                    "user_id": "Ian Morgan",
                    "user_href": "/profile/Ian-Morgan-4"
                },
                {
                    "user_id": "Rupert Baines",
                    "user_href": "/profile/Rupert-Baines"
                },
                {
                    "user_id": "Saikat Das",
                    "user_href": "/profile/Saikat-Das-48"
                },
                {
                    "user_id": "Becca Makin",
                    "user_href": "/profile/Becca-Makin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clare Celea",
                "href": "/profile/Clare-Celea"
            },
            "answer_text": "While I have no direct links to Putin or the Russian government, and therefore no personal knowledge of their long-term plans, I think it's probably really safe to answer 'No' to this question. Nobody in their right mind is seriously planning to invade the U.S. It's HUGE, and it has one of the largest and best equipped militaries in the world. This has Bad Idea written all over it. ",
            "date": "Answered November 14, 2014",
            "views": "874",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ellia Kristopany Kohen",
                    "user_href": "/profile/Ellia-Kristopany-Kohen"
                },
                {
                    "user_id": "Valeriy Beloyar",
                    "user_href": "/profile/Valeriy-Beloyar"
                },
                {
                    "user_id": "Steve Andrews",
                    "user_href": "/profile/Steve-Andrews-44"
                },
                {
                    "user_id": "Alexander Semigrodskikh",
                    "user_href": "/profile/Alexander-Semigrodskikh"
                },
                {
                    "user_id": "Vladimir Lebedev-Schmidthof",
                    "user_href": "/profile/Vladimir-Lebedev-Schmidthof"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Mansfield",
                "href": "/profile/Dave-Mansfield-12"
            },
            "answer_text": "No. Just no. An attack on the mainland USA would likely result in a nuclear response to the attackers homeland. However even if we take out the nuclear card the logistics would be a nightmare because of the location. First of all they couldn't get close without plenty of warning to the US. Secondly, bordered on both sides by huge oceans the attackers would have to figure out a way to get an enormous number of troops, weapons, ammunition, food, and such into position without the world's largest air force, and the US Navy (the second largest air force btw) blowing them to bits. Should they do the impossible and establish a landing then they would be stuck trying to supply their troops against these same forces for the entire length of the war. (See Battle of Leningrad). In addition, the American people are armed to the teeth and have shown that they have the belly for a fight. Partisan groups would be impossible to quell and the constant harassment would make life extremely difficult. So the attackers would find himself cut off thousands of miles from home with no supply lines, no way to bring in reinforcements, and a hostile population that would fight to the death. There are probably other good reasons but this came to mind immediately. ",
            "date": "Answered July 7, 2019",
            "views": "136",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ellia Kristopany Kohen",
                    "user_href": "/profile/Ellia-Kristopany-Kohen"
                },
                {
                    "user_id": "Valeriy Beloyar",
                    "user_href": "/profile/Valeriy-Beloyar"
                },
                {
                    "user_id": "Vladimir Lebedev-Schmidthof",
                    "user_href": "/profile/Vladimir-Lebedev-Schmidthof"
                },
                {
                    "user_id": "Matthew Miller",
                    "user_href": "/profile/Matthew-Miller-293"
                },
                {
                    "user_id": "Alexander Lopez",
                    "user_href": "/profile/Alexander-Lopez-58"
                },
                {
                    "user_id": "Alfonso Bullock",
                    "user_href": "/profile/Alfonso-Bullock"
                },
                {
                    "user_id": "Aaron Gullison",
                    "user_href": "/profile/Aaron-Gullison"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jesse Jones",
                "href": "/profile/Jesse-Jones-8"
            },
            "answer_text": "Invade the U.S.?  No.  Russia *might* theoretically be able to occupy Alaska due to its proximity to Eastern Russia (it's just a hop across the Bering Strait).  However, this kind of sneak attack would only be remotely possible if the U.S. doesn't notice the necessary logistical build-up on the Russian side.  Amphibious landings are some of the trickiest and costliest military maneuvers. It's extremely unlikely that such a huge undertaking could be hidden in this age of satellite technology and cyber-espionage.  And at the very least, Sarah Palin of course would see the Russian invasion coming, as she famously can see Russia from her house.  Now, whether anyone in the U.S. would actually listen to Sarah Palin if she cried wolf on Russia is another story. Now -- does the Russian military have contingency plans to knock out U.S. offensive military capabilities as quickly as possible in the event of a sudden outbreak of war?  Absolutely.   Always has and always will. ",
            "date": "Answered November 18, 2014",
            "views": "750",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bogdan Alexandrovich",
                    "user_href": "/profile/Bogdan-Alexandrovich"
                },
                {
                    "user_id": "Ellia Kristopany Kohen",
                    "user_href": "/profile/Ellia-Kristopany-Kohen"
                },
                {
                    "user_id": "Valeriy Beloyar",
                    "user_href": "/profile/Valeriy-Beloyar"
                },
                {
                    "user_id": "Alexander Semigrodskikh",
                    "user_href": "/profile/Alexander-Semigrodskikh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vardges Bokhyan",
                "href": "/profile/Vardges-Bokhyan-1"
            },
            "answer_text": "They can’t do that: they don’t have the navy to project the power, they don’t have money to fund the attack, they don’t have any bases close to mainland USA, so they don’t have and can’t build logistics to fuel and feed the army. in fact, even if they start the invasion it would be stopped right at the Russia’s gates, and will be one of the most miserable attempts ever. ",
            "date": "Answered October 25, 2019",
            "views": "101",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kristi Nochka",
                    "user_href": "/profile/Kristi-Nochka"
                },
                {
                    "user_id": "Gilang Putranto",
                    "user_href": "/profile/Gilang-Putranto"
                },
                {
                    "user_id": "Valeriy Beloyar",
                    "user_href": "/profile/Valeriy-Beloyar"
                },
                {
                    "user_id": "Vladimir Lebedev-Schmidthof",
                    "user_href": "/profile/Vladimir-Lebedev-Schmidthof"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dimitri Scholz",
                "href": "/profile/Dimitri-Scholz"
            },
            "answer_text": "No ",
            "date": "Answered April 11, 2020",
            "views": "83",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Konstantin Sivukhin",
                    "user_href": "/profile/Konstantin-Sivukhin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefan Englund (ステファン エングルンド)",
                "href": "/profile/Stefan-Englund-ステファン-エングルンド"
            },
            "answer_text": "Of course they are, as are US doing plans to invade Russa. If there is something you can be sure of it is military making plannes, they make plannes for everything in numbers, plans of differnet scenarios for differnt occations and reasons. However they are almost always locked up somehwere and never to be used. So, of this you can be absolutly sure, as sure as death and taxes. Plannes are made to invade any possible country for any possible reason and this is done by countries like US, Russia and China. Most other countries don´t bather with that kind of ambitious plannes but they got other plans made that is more to their likeing. ",
            "date": "Answered July 7, 2019",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Belkin",
                "href": "/profile/Joe-Belkin"
            },
            "answer_text": "Unless it's one of those scenarios where an asteroid crashes into earth and there is a great dying, no one would ever invade the us - it is the only country where people are seriously armed ... Yes, everyone in Switzerland owns a rifle but when it comes to armed citizens, no one comes close to the U.S. ",
            "date": "Answered November 16, 2014",
            "views": "311",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vladimir Lebedev-Schmidthof",
                    "user_href": "/profile/Vladimir-Lebedev-Schmidthof"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victor Krichevsky",
                "href": "/profile/Victor-Krichevsky"
            },
            "answer_text": "That’s how propaganda in my home country USA is trying to present. In reality, that’s the USA, which have grandiose plans of invasion into Russia. Russia, of cause, may strike back in retaliation, so this possibility serves as a major deterrent ",
            "date": "Answered April 10, 2020",
            "views": "51",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "William Wyllie",
                "href": "/profile/William-Wylie-16"
            },
            "answer_text": "Russia would never invade a country that was able to fight back. Russia had magnificent attacks on Moldova, Georgia and now Ukraine and Syria, creating new Russian occupied countries and annexed Crimea. but would respect countries they are unable to bully. ",
            "date": "Answered April 11, 2020",
            "views": "61",
            "upvotes": " Answer requested by Chris Romero"
        },
        {
            "author_info": {
                "name": "Michelle Gray",
                "href": "/profile/Michelle-Gray-63"
            },
            "answer_text": "Why would Russia want to destroy itself? If Russia were to attack America both America, Britain, France, Russia, China, and all NATO countries would cease to exist. If Russia were to attack America, NATO would be obligated to defend America. Meaning that France, Britain, and the rest of NATO could be forced to join this war. Every country in the world would be eventually affected by this war anyway. ",
            "date": "Answered October 9, 2017",
            "views": "206",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Cichocki",
                "href": "/profile/Joe-Cichocki"
            },
            "answer_text": "Yes! ",
            "date": "Answered November 15, 2014",
            "views": "46",
            "upvotes": "0"
        }
    ]
}