{
    "title": "Does the New Testament cancel the Old Testament? - Quora",
    "tags": [
        "The New Testament",
        "The Old Testament",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erlinda Budoyan",
                "href": "/profile/Erlinda-Budoyan-1"
            },
            "answer_text": "God Never Intended His Laws to Be Cancelled But be magnified. Meaning to keep not only in letter but in spirit. The two examples below is how Yahshua magnify the commandment about “murder” and “ adultery” Matthew 5: 21 Ye have heard that it was said by them of old time, Thou shalt not kill; and whosoever shall kill shall be in danger of the judgment. 22 But I say unto you, That whosoever is angry with his brother without a cause shall be in danger of the judgment: and whosoever shall say to his brother, Raca, shall be in danger of the council: but whosoever shall say, Thou fool, shall be in danger of hell fire. 1 John 3: 14 We know that we have passed from death unto life because we love the brethren. He that loveth not his brother abideth in death. 15 Whosoever hateth his brother is a murderer: and ye know that no murderer hath eternal life abiding in him. Matthew 5: 27 Ye have heard that it was said by them of old time, Thou shalt not commit adultery: 28 But I say unto you, That whosoever looketh on a woman to lust after her hath committed adultery with her already in his heart. These Scriptures Prove the Ten Commandment is NOT done away Matthew 5: 17 Think not that I am come to destroy the law or the prophets: I am not come to destroy, but to fulfill. 18 For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled. 19 Whosoever, therefore, shall break one of these least commandments, and shall teach men so, he shall be called the least in the kingdom of heaven: but whosoever shall do and teach them, the same shall be called great in the kingdom of heaven. 20 For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven. Matthew 19: 16 And, behold, one came and said unto him, Good Master, what good thing shall I do, that I may have eternal life? 17 And he said unto him, Why callest thou me good? there is none good but one, that is, God: but if thou wilt enters into life, keep the commandments. 18 He saith unto him, Which? Yahshua said Thou shalt do no murder, Thou shalt not commit adultery, Thou shalt not steal, Thou shalt not bear false witness, 19 Honour thy father and thy mother: and, Thou shalt love thy neighbor as thyself. 20 The young man saith unto him, All these things have I kept from my youth up: what lack I yet? 21 said Yahshua unto him, If thou wilt is perfect, go and sell that thou hast, and give to the poor, and thou shalt have treasure in heaven: and come and follow me. 22 But when the young man heard that saying, he went away sorrowful: for he had great possessions. James 2: 8 If ye fulfill the royal law according to the scripture, Thou shalt love thy neighbor as thyself, ye do well: 9 But if ye have respect to persons, ye commit sin, and are convinced of the law as transgressors. 10 For whosoever shall keep the whole law, and yet offend in one point, he is guilty of all. 11 For he that said, Do not commit adultery, said also, Do not kill. Now if thou commit no adultery, yet if thou kill, thou art become a transgressor of the law. In conclusion, The New Covenant Did Not Cancel The Ten Commandment But Established it. Hebrews 8: 10 For this is the covenant that I will make with the house of Israel after those days, saith the Lord; I will put my laws into their mind, and write them in their hearts: and I will be to them a God, and they shall be to me a people: ",
            "date": "Answered October 2, 2018",
            "views": "589",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ronald Gray",
                    "user_href": "/profile/Ronald-Gray-44"
                },
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Triez",
                "href": "/profile/Bob-Triez"
            },
            "answer_text": ">> Does the New Testament cancel the Old Testament? I don’t understand the question really. I'm thinking you mean the Mosaic law and not Old Testament because the Old Testament is as completely applicable today as it ever has been. From the creation account, the fall of man, the flood, Abraham, Issac and Jacob to the slavery in Egypt, the Exodus & 10 Commmandments to the prophets, King David and the Psalms, Solomon and his wisdom and their leading up to the coming Messiah. It all is pointing to one thing - Christ. The Gospel was first mentioned all the way back in Genesis 3. Right after Adam sinned, God already had a plan in place and announced it there on the spot. And everything between then and the New Testament shows that plan being fulfilled. So absolutely not, the New Testament is the continuation and implementation of God's plan for redemption. Now, if you mean the Law of Moses specifically, yes - Christ fulfilled the law. And it is important to understand that the Law of Moses was never applicable to Christians. Never. It only ever applied to the Jews living before Christ. A lot of people ignorantly try to use the Mosaic Law as proof of Christian hypocrisy claiming for example “why do you condemn homosexuality but you don't follow any of the other laws?” And the answer to that is simple. As a Christian living after Christ— those laws were never meant for us. And regarding homosexuality, that is directly condemned in the New Testament (Romans 1 and 1 Corinthians 6:9-10 to name a couple references.) So no, the New Testament doesn't cancel out the Old Testament…but Christ did fulfill the Law and now Jew and Gentile alike are living under grace and the law of love through Jesus. ",
            "date": "Answered October 2, 2018",
            "views": "13",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lawrence Albertyn",
                    "user_href": "/profile/Lawrence-Albertyn"
                },
                {
                    "user_id": "Jimmy Couch",
                    "user_href": "/profile/Jimmy-Couch-2"
                },
                {
                    "user_id": "Terry Smith, Jr",
                    "user_href": "/profile/Terry-Smith-Jr-1"
                },
                {
                    "user_id": "Iain Giffen",
                    "user_href": "/profile/Iain-Giffen"
                },
                {
                    "user_id": "Gary Mastrella",
                    "user_href": "/profile/Gary-Mastrella"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Rachael Louise",
                    "user_href": "/profile/Rachael-Louise-50"
                },
                {
                    "user_id": "Raja Sekhar Telagathoty",
                    "user_href": "/profile/Raja-Sekhar-Telagathoty-1"
                },
                {
                    "user_id": "Isha Singhal",
                    "user_href": "/profile/Isha-Singhal-35"
                },
                {
                    "user_id": "Lisa Kinsler",
                    "user_href": "/profile/Lisa-Kinsler"
                }
            ]
        }
    ]
}