{
    "title": "Does Bill Gates say that the pandemic wiped out 25 years of vaccine progress in 25 weeks? - Quora",
    "tags": [
        "Bill and Melinda Gates Foundation",
        "Bill Gates",
        "Immunology",
        "Pandemics",
        "Immunizations",
        "Virology",
        "Wealthy People and Families",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chuck Bluestein",
                "href": "/profile/Chuck-Bluestein"
            },
            "answer_text": "Doesn’t this sound a little crazy? Here is the article that explains this and you should read this to find out what is happening now by Business Insider. The name of this article is Bill Gates says the pandemic wiped out 25 years of vaccine progress in 25 weeks! The article says on it this: \"This year is different, it's unique,\" Bill Gates said on a conference call with reporters ahead of the release of the Bill and Melinda Gates Foundation's Goalkeepers 2020 report. \"The COVID-19 pandemic has not only stopped progress, it's pushed it backwards.\" There is a lot more information on the article to read. Here is a picture from that article.  A 13-year-old teaches neighborhood children during COVID-19 school closures in Gaza. Reuters ",
            "date": "Answered September 15, 2020",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Julie Grenier",
                "href": "/profile/Julie-Grenier-8"
            },
            "answer_text": "The Bill and Melinda Gates Foundation does a yearly assessment of how the world is progressing: i.e., away from poverty, poor health, low education levels and so on. Due to the pandemic that world has taken a number of backwards steps. Yes, the quote is accurate according to Business Insider: Bill Gates says the pandemic wiped out 25 years of vaccine progress in 25 weeks Read the article: it’s short without a lot of detail. j For detail we need to read the full Goalkeepers Report that was published yesterday. We can end COVID-19. Together. ",
            "date": "Answered September 15, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Brian Kirkpatrick",
                    "user_href": "/profile/Brian-Kirkpatrick-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Frymann",
                "href": "/profile/Stan-Frymann-1"
            },
            "answer_text": "Bill Gates says the pandemic erased 25 years of vaccine progress in 25 weeks Yes, he said it. Perhaps he was engaging in hyperbole. Perhaps he was expressing frustration. And to some extent it is true. Read the article. “According to the Institute for Health Metrics and Evaluation (the Gates Foundation's data partner) 25 years of progress to get the world vaccinated against deadly diseases was just swiftly wiped out, in 25 weeks during the pandemic. Here's one example of how vaccine coverage has dropped to levels that haven't been seen since the 1990s, showing diphtheria, tetanus, pertussis (DTP) vaccination coverage worldwide: ",
            "date": "Answered September 15, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anita Baklund",
                "href": "/profile/Anita-Baklund"
            },
            "answer_text": "It is difficult to believe Bill Gates says the pandemic wiped out 25 years of vaccine progress in 25 weeks.The reason for this is the pandemics has NOT wiped out any vaccine progress, and Bill Gates is both intelligent and with much knowledge. ",
            "date": "Answered September 15, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sherri Wood",
                "href": "/profile/Sherri-Wood-33"
            },
            "answer_text": "Yes he does. Vaccination programs around the world ground to a halt, borders closed, supplies dried up. ‘We’ve Been Set Back About 25 Years’: Pandemic Erodes Global Health Progress ",
            "date": "Answered September 16, 2020",
            "views": "25",
            "upvotes": " Answer requested by Chuck Bluestein"
        },
        {
            "author_info": {
                "name": "Mike Webster",
                "href": "/profile/Mike-Webster-22"
            },
            "answer_text": "No he did not say any such a thing . Not only is it factually incorrect, there is no evidence anywhere that he said anything even remotely similar to that. ",
            "date": "Answered September 15, 2020",
            "views": "44",
            "upvotes": " Answer requested by Chuck Bluestein"
        },
        {
            "author_info": {
                "name": "Steve Griffith",
                "href": "/profile/Steve-Griffith-56"
            },
            "answer_text": "Sounds like big money doing a big talk, vaccines for most class of bugs are redundant as the bug mutates ",
            "date": "Answered September 18, 2020",
            "views": "12",
            "upvotes": " Answer requested by Chuck Bluestein"
        },
        {
            "author_info": {
                "name": "Lam Leong Yew",
                "href": "/profile/Lam-Leong-Yew"
            },
            "answer_text": "Please post your source of information. I cannot believe he said it… and even if he did, will need to understand the context of that statement. ",
            "date": "Answered September 15, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}