{
    "title": "Does the Thompson submachine gun have a rifled barrel? - Quora",
    "tags": [
        "Thompson Submachine Gun",
        "Submachine Guns",
        "Barrel",
        "Rifles",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ronald M. Walker",
                "href": "/profile/Ronald-M-Walker"
            },
            "answer_text": "I’m always surprised by questions involving “THE Thomson SMG” -( my stress on the word “the”. Definite article, implying that there’s only ONE “Tommy gun”.) Yet…. that is NOT the case at all. Thompson came up with his design - for a DELAYED BLOWBACK SMG; he owned no manufacturing facilities, so he subcontracted the making of kits of parts, and sold them in dribs and drabs. The Action relied on the inherent “stickiness” of a block of manganese bronze as it’s scraped across steel. Thompson narrowly missed the opportunity of WW1 to sell his “Trench Broom”, but managed to sell a number to the post office, for use by the Marine Corps (who were at the time protecting the mail) The Marines then carried them off to South America… WIth WW2 looming on the horizon, both the British and the French placed substantial orders with Thompson, the French were over-run before taking delivery, and the British took over the order. The US Army ordered a ton of Thompsons….. but significantly redesigned the weapon before adopting it. The cocking handle was moved from the top of the receiver to the side, the manganese bronze block was simply dumped, turning it from a Delayed-Blowback weapons to a Blowback one. I’m far from sure that there is ANY commonality of parts between the original “M1928” Thompson, and the “M1” Thompson, made in VERY much larger numbers. For what it’s worth, BOTH weapons had rifled barrels. The British recycled parts from the (M1928) Thompson and Mk3 SMLE into the near-silent “deLisle Carbine”(which used the Thompson’s rifled barrel!) ",
            "date": "Answered September 2, 2020",
            "views": "59",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Conor Howard",
                    "user_href": "/profile/Conor-Howard-13"
                },
                {
                    "user_id": "David Dunn",
                    "user_href": "/profile/David-Dunn-103"
                },
                {
                    "user_id": "Allen Jones",
                    "user_href": "/profile/Allen-Jones-174"
                }
            ]
        },
        {
            "author_info": {
                "name": "Corey Turpin",
                "href": "/profile/Corey-Turpin-4"
            },
            "answer_text": "Yes. Rifling became commonplace in the 1800’s and virtually all firearms from 1900 to present have rifled barrels excluding most shotguns. There’s no advantage to an unrifled firearm firing a rifle or handgun cartridge. Rifling causes the bullet to spin and be much more stable in flight which is conducive to accuracy. It also means the bullet is in contact with the barrel but the open spaces in the rifling impart less drag on the bullet which means better velocity. A smooth bore barrel has a lot of downsides. The biggest imo is powder and lead deposits have no place to go so you have to clean the barrel after a handful of shots where a rifled barrel can go 1,000’s of round between cleanings without major issues. Smooth bore barrels do not impart spin on the bullet which severely harms accuracy. Modern day handguns are far more mechanically accurate than a smooth bore rifle. Now lets talk shotguns. The reason most shotguns are smooth bore is rifling disrupts the pattern of birdshot and buckshot which is a negative. Shotguns can also fire slugs, these slugs have rifling built into the lead on the base of the slug. This rifling is not to impart spin, in this case it is to reduce friction between the slug and the barrel as the slug travels down the barrel. ",
            "date": "Answered September 1, 2020",
            "views": "164",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Conor Howard",
                    "user_href": "/profile/Conor-Howard-13"
                },
                {
                    "user_id": "Ben Emmich",
                    "user_href": "/profile/Ben-Emmich"
                },
                {
                    "user_id": "Arnie Reynolds",
                    "user_href": "/profile/Arnie-Reynolds-1"
                },
                {
                    "user_id": "Mike Madigan",
                    "user_href": "/profile/Mike-Madigan-2"
                },
                {
                    "user_id": "Dan Sunderland",
                    "user_href": "/profile/Dan-Sunderland-10"
                },
                {
                    "user_id": "Bob Bruno",
                    "user_href": "/profile/Bob-Bruno-2"
                }
            ]
        }
    ]
}