{
    "title": "Does Queen Elizabeth share any ancestry with the Anglo-Saxon kings that preceded the Norman Invasion? - Quora",
    "tags": [
        "Anglo-Saxons",
        "Queen Elizabeth II",
        "History of Great Britain",
        "The British Royal Family",
        "British Monarchy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Geoffrey Zhehao Li",
                "href": "/profile/Geoffrey-Zhehao-Li"
            },
            "answer_text": "Elizabeth II is a descendant of Edmund Ironside on two sides. The last Wessex dynast, Margaret Atheling, married Malcolm III of Scotland. Their descendants include John Balliol and Robert the Bruce, two rival Scottish lords who became kings of Scots successively. Robert the Bruce’s daughter, Marjorie, married Walter Stewart, and their son Robert II became King of Scots. The Queen Mother was descended from Robert II’s daughter, Joanna, who married John Lyon of Glamis. John Balliol’s line was extinct, but his sister’s line continued. Marie de Guise, James V’s wife, was a descendant of John Balliol’s sister. James V’s daughter, Mary, became Queen of Scots, and her son, James VI, became king of England as James I. James VI’s daughter, Elizabeth, married the Elector Palatine of Bavaria, and their daughter, Sophia, married the Elector of Luneberg-Brunswick, and their son George I became King of Great Britain. George I was succeeded by his male descendants until 1837, when Queen Victoria, daughter of Edward, Duke of Kent, became Queen of the United Kingdom. Both Elizabeth II and Prince Philip are Victoria’s descendants. Talking about the Godwinsons, Queen Elizabeth II is descended from Godwinsons via Margaret of Denmark and Anne of Denmark, the former descended from Tostig and the latter descended from both Tostig and Harold. PS: The most senior descendant of Edmund Ironside is the Duke of Calabria, as the line of Balliols passed through the Bourbons and ultimately Bourbon-Parma and Bourbon-Two Sicilies. I don’t know who’s the most senior descendant of Harold Godwinson, though. ",
            "date": "Answered July 3, 2020",
            "views": "317",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anthony Graham Dow Woodwark",
                    "user_href": "/profile/Anthony-Graham-Dow-Woodwark"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Hirstwood",
                "href": "/profile/Mark-Hirstwood-1"
            },
            "answer_text": "Of course, and many more than one Anglo-Saxon king or queen too. I can’t say I’ve saved links or information about this, but over a number of years learning about English history I can say that I’ve seen references and tidbits about her heritage; it goes back to the founder of England, Hengist, a Jute. Apparently she also shares heritage with other founders such as Cerdic of Wessex, and also the more widely known names such as Alfred the Great and others. One point that stood out that wasn’t about Her Majesty specifically, but a Marquess, on travel show Globetrekker: that Marquess descends from a number of Anglo-Saxon royals, and of course, Normans, but he shares both Anglo-Saxon Harold Godwinson and Norman William the Conqueror as his ancestors. I think it’s a safe enough bet that if a Marquess has that pedigree, it’s not much of a stretch that Elizabeth II would as well, if not surpass it. ",
            "date": "Answered September 4, 2019",
            "views": "450",
            "upvotes": " Answer requested by Brandon Johns",
            "upvoters": [
                {
                    "user_id": "Anthony Graham Dow Woodwark",
                    "user_href": "/profile/Anthony-Graham-Dow-Woodwark"
                },
                {
                    "user_id": "Micha Roded",
                    "user_href": "/profile/Micha-Roded"
                },
                {
                    "user_id": "Ben Toynton",
                    "user_href": "/profile/Ben-Toynton"
                },
                {
                    "user_id": "Ben Gee",
                    "user_href": "/profile/Ben-Gee-2"
                },
                {
                    "user_id": "Steve Lee",
                    "user_href": "/profile/Steve-Lee-169"
                },
                {
                    "user_id": "Eamon O'Kelly",
                    "user_href": "/profile/Eamon-OKelly"
                },
                {
                    "user_id": "John-Michael Mustchin",
                    "user_href": "/profile/John-Michael-Mustchin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Boxell",
                "href": "/profile/Geoff-Boxell"
            },
            "answer_text": "The Empress Matilda, Granddaughter of William the Conqueror, was also great-great-great-granddaughter of Æthelred the Unready, the great-great grandson of Alfred the Great: her son became Henry II of England. In addition both Queen Elizabteh and Prince Phillip are desended from King Harold via his daughter Gytha. Gytha, had been sent by King Swein of Denmark before his death to marry the Russian Prince of Smolensk, Vladimir Monomakh. The marriage proved fruitful and Gytha gave Vladimir a large brood of offspring, possibly as many as eight sons and three daughters. Gytha died on 07 May 1107 before her husband had achieved the pinnacle of his power as Grand Prince of Kiev. Their eldest son was Msistislav, known to the Norse world as, Harold. This Russian Harold had a daughter, Ingibiorge. She had a son who became King Valdemar of Denmark. ",
            "date": "Answered September 3, 2019",
            "views": "11",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Graham Dow Woodwark",
                    "user_href": "/profile/Anthony-Graham-Dow-Woodwark"
                },
                {
                    "user_id": "Micha Roded",
                    "user_href": "/profile/Micha-Roded"
                },
                {
                    "user_id": "Glenys Hutchinson",
                    "user_href": "/profile/Glenys-Hutchinson"
                },
                {
                    "user_id": "Ben Toynton",
                    "user_href": "/profile/Ben-Toynton"
                },
                {
                    "user_id": "Julia MacDonald Ogilvie",
                    "user_href": "/profile/Julia-MacDonald-Ogilvie"
                },
                {
                    "user_id": "Chris Young",
                    "user_href": "/profile/Chris-Young-114"
                },
                {
                    "user_id": "Steve Lee",
                    "user_href": "/profile/Steve-Lee-169"
                },
                {
                    "user_id": "Alen Thomas",
                    "user_href": "/profile/Alen-Thomas-75"
                },
                {
                    "user_id": "John-Michael Mustchin",
                    "user_href": "/profile/John-Michael-Mustchin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gareth Roberts",
                "href": "/profile/Gareth-Roberts-7"
            },
            "answer_text": "Yes, assuming the established family trees are accurate. The Empress Matilda, Granddaughter of William the Conqueror, was also great-great-great-granddaughter of Æthelred the Unready, the great-great grandson of Alfred the Great. And she is a direct ancestor of Elizabeth II. Via Henry VII, Elizabeth is also a descendant of Ednyfed Fychan, seneschal to the Kingdom of Gwynedd under Llywelyn the Great. Via James I of England and VI of Scotland she is a descendant of the first King of Scotland, Kenneth MacAlpin. Not that this is as special as it seems. Because of how ancestry works, most people in Britain are probably related ultimately, by circuitous routes (and Elizabeth II's family tree is hardly tangle-free), to those same people. But it's fun to have families like hers with their family trees laid out online for us to look at. ",
            "date": "Answered September 3, 2019",
            "views": "554",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Craig Dedo",
                    "user_href": "/profile/Craig-Dedo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eamonn Colfer",
                "href": "/profile/Eamonn-Colfer"
            },
            "answer_text": "Yes, mainly through Empress Matilda (Henry I's daughter) whose mother Matilda of Scotland (birthname Edith) was a direct descendant of Alfred the Great. Mathilda was the mother of Henry II. Matilda of Scotland - Wikipedia ",
            "date": "Answered May 22, 2020",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anthony Ames",
                "href": "/profile/Anthony-Ames"
            },
            "answer_text": "Yes. William the Conqueror’s son Henry the First married a princess from the old Anglo-Saxon ruling house. All English monarchs since 1154, and all British rulers since 1707, have been their descendants. Elizabeth is also descended from William's archrival Harold Godwinson. ",
            "date": "Answered September 4, 2019",
            "views": "133",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jennifer Burdoo",
                    "user_href": "/profile/Jennifer-Burdoo"
                },
                {
                    "user_id": "Mark Hirstwood",
                    "user_href": "/profile/Mark-Hirstwood-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "ABCDiamond",
                "href": "/profile/ABCDiamond"
            },
            "answer_text": "Q: Does Queen Elizabeth share any ancestry with the Anglo-Saxon kings that preceded the Norman Invasion? Yes. King Egbert, (802 – 839) the First King of England, was the 34th great-grandfather of Queen Elizabeth II. Kenneth MacAlpin, (810 – 858) the First King of Scotland, is listed as the 33rd Great Grandfather to Queen Elizabeth II. Queen Elizabeth II - Grandfathers ",
            "date": "Answered September 3, 2019",
            "views": "123",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jules Gillespie",
                "href": "/profile/Jules-Gillespie"
            },
            "answer_text": "Does Queen Elizabeth share any ancestry with the Anglo-Saxon kings that preceded the Norman Invasion? QE's ancestry goes back in to the depths of time, via Baldur to Woden. Anglo-Saxon Chronicle - Wikipedia Why do you think there are ravens at the Tower of London? Huginn and Muninn - Wikipedia ",
            "date": "Answered September 3, 2019",
            "views": "171",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Terence Thomas",
                "href": "/profile/Terence-Thomas-16"
            },
            "answer_text": "The Windsors are German by descent - BattenberG with a quick change of name in WWI so feel less uneasy about their Germanic roots ………it's very possible that they were linked from Anglo Saxon royalty / aristocracy as there were Germanic tribes who invaded Celtic Brtizn ",
            "date": "Answered September 5, 2019",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Scott",
                "href": "/profile/John-Scott-80"
            },
            "answer_text": "ANY ancestry? Sure she does, and so do you and so do I. “Basically, everyone alive in the ninth century who left descendants is the ancestor of every living European today.” So you’re related to Charlemagne? You and every other living European… ",
            "date": "Answered September 3, 2019",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Chen",
                "href": "/profile/Michael-Chen-161"
            },
            "answer_text": "Please Reach out to this organization and their experts Genealogical Research ",
            "date": "Answered September 4, 2019",
            "views": "46",
            "upvotes": "0"
        }
    ]
}