{
    "title": "During WWI when did soldiers have time to dig trenches, and how long did it take to build one across the battlefield? - Quora",
    "tags": [
        "World War I",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Terence Kreft",
                "href": "/profile/Terence-Kreft"
            },
            "answer_text": "As others have said you create a trench as a defence. In order to create a defensive whole you may then push towards the enemy in order to shorten your exposure time on the surface when attacking. So you create a trench parallel to the front, you then dig forwards in another trench and at the end of that trench build another parallel trench. The trench you dug going forward you build in a zig zag so that enemy fire can't cover the full length of this trench after your parallel trenches are completed this acts as a communication trench between them, so runners, supplies and reinforcements use the communication trenches to move between your parallels. So by a system of parallels and communication trenches you build up your defences.  So in the scenario I've listed above the Reserve trench would be built first then the Support trench and then the Front line trench. It was also quite possible to create the trench complex in reverse, so you build the Front line trench, then realising you need somewhere to retreat to if attacked you build the support trench etc. Have a look at Trench warfare - Wikipedia and consider the fun people had in those trenches oh and running saps and counter saps. ",
            "date": "Answered September 8, 2017",
            "views": "76",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lukáš Kubacki",
                    "user_href": "/profile/Lukáš-Kubacki"
                },
                {
                    "user_id": "Roger Peach",
                    "user_href": "/profile/Roger-Peach"
                },
                {
                    "user_id": "Lee Martin",
                    "user_href": "/profile/Lee-Martin-75"
                },
                {
                    "user_id": "Michel Haggman",
                    "user_href": "/profile/Michel-Haggman"
                },
                {
                    "user_id": "Eric Hamilton",
                    "user_href": "/profile/Eric-Hamilton-28"
                },
                {
                    "user_id": "Robert Mattison",
                    "user_href": "/profile/Robert-Mattison-4"
                },
                {
                    "user_id": "Leon Sabree",
                    "user_href": "/profile/Leon-Sabree"
                },
                {
                    "user_id": "Da Byle",
                    "user_href": "/profile/Da-Byle"
                },
                {
                    "user_id": "Cristian Alexander",
                    "user_href": "/profile/Cristian-Alexander-2"
                },
                {
                    "user_id": "Michael Smith",
                    "user_href": "/profile/Michael-Smith-387"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Lee",
                "href": "/profile/Tom-Lee-278"
            },
            "answer_text": "You generally don’t dig trenches while you’re under enemy fire. You dig trenches somewhere in the back on chosen ground to make the defense easier, then make a tactical retreat into the trenches. ",
            "date": "Answered September 8, 2017",
            "views": "169",
            "upvotes": "0"
        }
    ]
}