{
    "title": "During WWII, did the Nazi send prisoners of war to concentration camps? - Quora",
    "tags": [
        "Concentration Camps",
        "World War II",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Gordon",
                "href": "/profile/Jim-Gordon"
            },
            "answer_text": "Yes.  The concentration camps served as isolation and collection locales for various types of prisoners.  Some of the \"death camps\" used to dispose of holocaust victims also received uniformed military personnel captured by the Germans.  Some were sent for elimination per Hitler's orders regarding Soviet Army political commissars and Western Allies' special forces or commandos.  Some Western Allied military personnel were sent because they were Jewish. The German military services, particularly the Luftwaffe and the Navy, operated their own prison camps, at least partly as a way of controlling the treatment of captured Allied air force or navy prisoners and avoiding transfer of such prisoners to death camps.  By so doing, the German services hoped to secure better treatment of their own personnel captured by the Western Allies.  It should be noted, however, that Russian military personnel in all German PoW camps were subjected to extreme hardship, severe forced labor, minimal food rations and many cases of arbitrary execution. The German services, however, did create one concentration camp (not a death camp).  Offizierslager (Oflag = officers' camp) IV-C at Colditz Castle was used as a maximum security prison for \"incorrigible\" Allied military personnel who repeatedly tried to escape or were otherwise problem prisoners. Otherwise, German treatment of PoWs depended on who the PoWs were and who captured them.  If the Allied prisoners were captured by German Orpo police, the Gestapo, the SS or other Nazi party force or service, they were filtered to hold out the politically valuable prisoners, the commandos and special forces and SOE or OSS personnel, or Jewish personnel who attracted unwelcome notice, before the rest of those captured were passed on to the German military PoW systems.  Personnel who escaped from PoW camps were also supposed to have been handed to the Gestapo. ",
            "date": "Updated May 3, 2015",
            "views": "25",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "David B Landers",
                    "user_href": "/profile/David-B-Landers"
                },
                {
                    "user_id": "Joshua May",
                    "user_href": "/profile/Joshua-May-6"
                },
                {
                    "user_id": "Mike S Goodmann",
                    "user_href": "/profile/Mike-S-Goodmann"
                },
                {
                    "user_id": "Shan Barani",
                    "user_href": "/profile/Shan-Barani"
                },
                {
                    "user_id": "Jon Mixon",
                    "user_href": "/profile/Jon-Mixon-1"
                },
                {
                    "user_id": "Amitvikram Dutta",
                    "user_href": "/profile/Amitvikram-Dutta"
                },
                {
                    "user_id": "Josh Stukka Miller",
                    "user_href": "/profile/Josh-Stukka-Miller"
                },
                {
                    "user_id": "Andrew Warinner",
                    "user_href": "/profile/Andrew-Warinner"
                },
                {
                    "user_id": "Brian Dunlap",
                    "user_href": "/profile/Brian-Dunlap"
                },
                {
                    "user_id": "Mendel Cooper",
                    "user_href": "/profile/Mendel-Cooper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Cooper",
                "href": "/profile/Richard-Cooper-3"
            },
            "answer_text": "I’m a little surprised to not see any mention in the responses of the 168 Allied Airmen sent to Buchenwald in 1944. These airmen came from Great Britain, Canada, Australia, New Zealand, Jamaica and the United States and had been classified as terror flyers by the Germans and therefore not entitled to prisoner of war status. Under the leadership of New Zealander Phil Lamason, the senior Allied officer among the airmen, they were able to survive for two months while receiving the same treatment as the other prisoners in the camp until they were able to make contact with Luftwaffe officers visiting the camp to inspect bomb damage. When the head of the Luftwaffe, Hermann Goering, received the report he was reportedly outraged and demanded their immediate transfer to Luftwaffe control, which resulted in their being transferred to a regular Luftwaffe POW camp just days before their scheduled execution by the SS. There are several books describing this event including “168 Jump into Hell” “Destination Buchenwald” and a documentary “The Lucky Ones: Allied Airmen and Buchenwald”. ",
            "date": "Answered June 14, 2018",
            "views": "26",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Nicolow",
                    "user_href": "/profile/David-Nicolow"
                },
                {
                    "user_id": "Kid Mack",
                    "user_href": "/profile/Kid-Mack"
                },
                {
                    "user_id": "Mahmudul Hasan",
                    "user_href": "/profile/Mahmudul-Hasan-225"
                },
                {
                    "user_id": "Steve Surowiecki",
                    "user_href": "/profile/Steve-Surowiecki"
                },
                {
                    "user_id": "Marjean Fieldhouse",
                    "user_href": "/profile/Marjean-Fieldhouse"
                },
                {
                    "user_id": "Kurtis Rogers",
                    "user_href": "/profile/Kurtis-Rogers-1"
                },
                {
                    "user_id": "K Douglas Riley",
                    "user_href": "/profile/K-Douglas-Riley"
                },
                {
                    "user_id": "Faith Abbott",
                    "user_href": "/profile/Faith-Abbott-3"
                },
                {
                    "user_id": "Satish Kumar Nayak",
                    "user_href": "/profile/Satish-Kumar-Nayak"
                },
                {
                    "user_id": "Aritra Sarkar",
                    "user_href": "/profile/Aritra-Sarkar-28"
                }
            ]
        }
    ]
}