{
    "title": "During slavery in the US, what happened to slaves if their masters died? - Quora",
    "tags": [
        "Slavery in the United States",
        "History of Slavery",
        "Slavery",
        "History of the United States of America",
        "Death and Dying",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Hume",
                "href": "/profile/Ben-Hume-8"
            },
            "answer_text": "They were inherited my the next male kin. Son, uncle, nephew, cousin. Unless the choice was made to make the wife independent owner of land, assets, slaves and finances. A selected special one or few could be freed for excellent service. They could also be sold to an auctioneer of slaves to be resold if their was no heir or outstanding debt that slave reselling could pay off. Understand the 1825 emancipation of slavery paid hundreds of millions to slave owners to compensate their lose. It never compensated their slaves no freed. But they were better at actively re-educating the slaves socially and with literacy. Something the USA did not seriously take responsibility. ",
            "date": "Answered October 1, 2020",
            "views": "272",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kevin Rodney",
                    "user_href": "/profile/Kevin-Rodney-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jihoon Seo",
                "href": "/profile/Jihoon-Seo-3"
            },
            "answer_text": "They were property. The ownership went to the son or the wife. In the book Uncle Tom’s Cabin written by Harriet Beecher Stowe, the death of St. Clare the owner of Tom died. The ownership went to his wife who was a harsh and horrible master (well, being a slave master itself is horrible, but still some did additional immoral things) put Tom on sale. It’s because the ownership moved on from Mr. St. Clare to Mrs. St. Clare. If the dead master specifically mentioned what to do with the slave and wrote codified proof documents or a will, than the slave would be treated as such. In those cases, the “property” may be freed or the ownership would be given to somebody else.  ",
            "date": "Answered October 1, 2020",
            "views": "325",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Seo",
                    "user_href": "/profile/Andy-Seo-26"
                },
                {
                    "user_id": "David Smith",
                    "user_href": "/profile/David-Smith-533"
                },
                {
                    "user_id": "Daniel James Berger",
                    "user_href": "/profile/Daniel-James-Berger"
                },
                {
                    "user_id": "Alan Davy",
                    "user_href": "/profile/Alan-Davy"
                }
            ]
        }
    ]
}