{
    "title": "During and after World War II, what happened to the government’s economic role? - Quora",
    "tags": [
        "Economic History",
        "World Wars",
        "World War II",
        "World History",
        "Warfare",
        "Government",
        "Military History and Wars ",
        "Economics",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alastair Ross",
                "href": "/profile/Alastair-Ross-19"
            },
            "answer_text": "Please specify what government you are referring to. I believe there were several belligerents during World War II, and therefore more than one government having economic roles. (You’ll of course understand that the economic role of the Soviet government would be quite different from that in the UK, US or Germany, or any of the other myriad of countries that were involved. In many cases, the State ended up being a lot more proactive in ensuring that economic benefits passed onto the surviving citizens, creating strong economies that served the people with good basic education and healthcare - thus a fairly happy balance between capitalist and socialist ideals was achieved, even in the US, in part kept up by the need for most states to require a strong military due to the looming threat of the Cold War. Since the 1970’s there has been a concerted effort to pull wealth from the state and into the hands of a small proportion of society, mirroring the situation in many western countries pre World War 2). This is a very broad brush stroke of an answer but the question is also too general. ",
            "date": "Answered January 15, 2020",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jens Johansson",
                "href": "/profile/Jens-Johansson-23"
            },
            "answer_text": "In wartime any Governmental powers and control of matters considered economy normally increases. Power over bodies conscription, services etc.Power over property in the small scale, almost arbitrary takings of propertyPower over propery in the larger scale, almost arbitrary takings of major properties like factories or what is produced at factorys and control over factoriesPower over trade as international tradesystems often will be replaced with state exchanges and balance books. Few citizens or companys or other descendant G.O.s have their own reserves of gold or $ or euros or £Judicial powers affecting economic matters increaseCheers! ",
            "date": "Answered January 15, 2020",
            "views": "35",
            "upvotes": "0"
        }
    ]
}