{
    "title": "English nobility spoke French (and some Latin) as late as the year 1200 AD, the time of Richard I. When did English become prominent in Britain? - Quora",
    "tags": [
        "Language Shift",
        "English and French Languages",
        "Latin (language)",
        "History of Great Britain",
        "French (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kip Wheeler",
                "href": "/profile/Kip-Wheeler-1"
            },
            "answer_text": "It depends if you mean prominent among the nobility or prominent among the lower classes. The lower classes kept right on speaking English after the Norman Conquest of 1066. Their English borrowed lots of French loanwords and underwent a great deal of change, but they never stopped using English. Among the upper classes of England, French was still the primary language during the first half of the 1300s. The Statue of Pleading in 1362 required governmental business and court cases to be done in English, and King Richard II (deposed 1399) was bilingual, speaking both French and English—though he preferred French. King Henry IV (Henry Bolingbrook) was the first English king after the Norman Conquest who spoke English by preference. Writers like Chaucer, Gower, and Langland helped popularize English over French as well, doing the bulk of their writings in the last half of the 1300s. ",
            "date": "Updated February 15, 2020",
            "views": "354",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Axel Brosi",
                    "user_href": "/profile/Axel-Brosi"
                },
                {
                    "user_id": "Alex Neuenfeld",
                    "user_href": "/profile/Alex-Neuenfeld"
                },
                {
                    "user_id": "Travis Casey",
                    "user_href": "/profile/Travis-Casey-4"
                },
                {
                    "user_id": "Marcie Miller",
                    "user_href": "/profile/Marcie-Miller-10"
                },
                {
                    "user_id": "Jesse Lee O’Connor 李杰西",
                    "user_href": "/profile/Jesse-Lee-O-Connor-李杰西"
                },
                {
                    "user_id": "Michael Vincent",
                    "user_href": "/profile/Michael-ONial"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "Robin Harville",
                    "user_href": "/profile/Robin-Harville"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Herbert Stahlke",
                "href": "/profile/Herbert-Stahlke"
            },
            "answer_text": "Writing in English was strongly suppressed in the century after the Norman Invasion so that there are few surviving records from 1066 to about 1300. The poor population continued to speak English but with increasing numbers of French loanwords. But by 1300 the Norman overlords were losing their French and switching more and more to English. By 1350 English was again being used in the courts and in government and writing in various Middle English dialects spread rapidly. During the Old English period ending with the Normans, West Saxon, the language of Alfred's court, was the standard enforced by the king and the church. After English came back there was no standard dialect until printing arrived with William Caxton in the late 15th c. He published in London and helped to establish London English as the de facto standard. ",
            "date": "Answered February 9, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roger Williams",
                    "user_href": "/profile/Roger-Williams-31"
                }
            ]
        }
    ]
}