{
    "title": "For almost the entire 18th century, the tricorn hat was the standard men’s headwear, for both civilian and military dress. What explains its long life, and why did it finally fall out of favor? - Quora",
    "tags": [
        "Military Uniforms",
        "The 18th Century",
        "Hats & Caps",
        "Men's Fashion and Style",
        "Military",
        "Military History and Wars ",
        "Fashion and Style",
        "Clothing and Apparel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Muir",
                "href": "/profile/Bob-Muir-19"
            },
            "answer_text": "The tricorn hat was just an ordinary wide brimmed hat with the rim turned up. It was a common civilian and military piece of headwear for much of the eighteenth century. However, fashions change, and in an age of faster paced warfare, tricorn hats were not the best choice. If a soldier raised his hand above his shoulder, for whatever reason, his hat was knocked off. The impracticality of the item became more apparent as time passed by and other forms of headgear became more prominent. Warfare became more fluid and the shako evolved to meet this change. This is a process that has never stopped. ",
            "date": "Answered October 23, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Brittain",
                "href": "/profile/John-Brittain-19"
            },
            "answer_text": "Take a hat, normal crown, but a big, big, brim. So when it’s dry weather the brim tends to flop all over the place, and looked scruffy, so, fold the brim up as you find it convenient, hold the brim up at three points, and it becomes a tri(three)-corner hat, if you fold the hat up from the front , and from the back, you have a style favoured by big-wigs to display their badges showing their status. The options were as many as the wearers, but life developed, fashions changed, technology came along, so out of favour goes the tricorn. ",
            "date": "Answered October 23, 2020",
            "views": "53",
            "upvotes": "0"
        }
    ]
}