{
    "title": "For Buddhism, is rebirth a truth or a belief? - Quora",
    "tags": [
        "Rebirth",
        "Zen Buddhism",
        "Buddhism",
        "Belief and Beliefs",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cheng Tien Pao",
                "href": "/profile/Cheng-Tien-Pao"
            },
            "answer_text": "Q. For Buddhism, is rebirth a truth or a belief? -According to philosophy of Theravada Buddhism, - Whoever says that the samana Gotama knows and sees everything, claim to possess omniscience and omnivision, whether during walking, standing, sleeping or working, whoever says that, misinterprets me.But if anyone were to say that the samana Gotama possesses the three fold knowledge (i.e of previous lives, of the working of Kamma and of the destruction asava), he would state the position correctly.Gotama Buddha - Staying at Savatthi. Then the Blessed One, picking up a little bit of dust with the tip of his fingernail, said to the monks, \"What do you think, monks? Which is greater: the little bit of dust I have picked up with the tip of my fingernail, or the great earth?\"\"The great earth is far greater, lord. The little bit of dust the Blessed One has picked up with the tip of his fingernail is next to nothing. It doesn't even count. It's no comparison. It's not even a fraction, this little bit of dust the Blessed One has picked up with the tip of his fingernail, when compared with the great earth.\"In the same way, monks, few are the beings reborn among human beings. Far more are those reborn elsewhere. Thus you should train yourselves: 'We will live heedfully.' That's how you should train yourselves.\"From SN 20.2 Nakhasikha Sutta - At Savatthi. There the Blessed One said: \"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. A being who has not been your mother at one time in the past is not easy to find... A being who has not been your father... your brother... your sister... your son... your daughter at one time in the past is not easy to find.\"Why is that? From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. Long have you thus experienced stress, experienced pain, experienced loss, swelling the cemeteries — enough to become disenchanted with all fabricated things, enough to become dispassionate, enough to be released.\"From SN 15.14-19 Mata Sutta - \"This is the greater: the tears you have shed while transmigrating & wandering this long, long time — crying & weeping from being joined with what is displeasing, being separated from what is pleasing — not the water in the four great oceans.\"Long have you (repeatedly) experienced the death of a mother. The tears you have shed over the death of a mother while transmigrating & wandering this long, long time — crying & weeping from being joined with what is displeasing, being separated from what is pleasing — are greater than the water in the four great oceans.\"Long have you (repeatedly) experienced the death of a father... the death of a brother... the death of a sister... the death of a son... the death of a daughter... loss with regard to relatives... loss with regard to wealth... loss with regard to disease. The tears you have shed over loss with regard to disease while transmigrating & wandering this long, long time — crying & weeping from being joined with what is displeasing, being separated from what is pleasing — are greater than the water in the four great oceans.From SN 15.3 Assu Sutta - \"This is the greater: the blood you have shed from having your heads cut off while transmigrating & wandering this long, long time, not the water in the four great oceans.\"The blood you have shed when, being cows, you had your cow-heads cut off: Long has this been greater than the water in the four great oceans.\"The blood you have shed when, being water buffaloes, you had your water buffalo-heads cut off... when, being rams, you had your ram-heads cut off... when, being goats, you had your goat-heads cut off... when, being deer, you had your deer-heads cut off... when, being chickens, you had your chicken-heads cut off... when, being pigs, you had your pig-heads cut off: Long has this been greater than the water in the four great oceans.\"The blood you have shed when, arrested as thieves plundering villages, you had your heads cut off... when, arrested as highway thieves, you had your heads cut off... when, arrested as adulterers, you had your heads cut off: Long has this been greater than the water in the four great oceans.\"Why is that? From an inconceivable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. Long have you thus experienced stress, experienced pain, experienced loss, swelling the cemeteries — enough to become disenchanted with all fabrications, enough to become dispassionate, enough to be released.\"From SN 15.13 Timsa Sutta - \"Monks, suppose that this great earth were totally covered with water, and a man were to toss a yoke with a single hole there. A wind from the east would push it west, a wind from the west would push it east. A wind from the north would push it south, a wind from the south would push it north. And suppose a blind sea-turtle were there. It would come to the surface once every one hundred years. Now what do you think: would that blind sea-turtle, coming to the surface once every one hundred years, stick his neck into the yoke with a single hole?\"\"It would be a sheer coincidence, lord, that the blind sea-turtle, coming to the surface once every one hundred years, would stick his neck into the yoke with a single hole.\"\"It's likewise a sheer coincidence that one obtains the human state. It's likewise a sheer coincidence that a Tathagata, worthy & rightly self-awakened, arises in the world. It's likewise a sheer coincidence that a doctrine & discipline expounded by a Tathagata appears in the world. Now, this human state has been obtained. A Tathagata, worthy & rightly self-awakened, has arisen in the world. A doctrine & discipline expounded by a Tathagata appears in the world.\"Therefore your duty is the contemplation, 'This is stress/suffering... This is the origination of stress/suffering... This is the cessation of stress/suffering.' Your duty is the contemplation, 'This is the path of practice leading to the cessation of stress/suffering.'\"From SN 56.48 Chiggala Sutta ",
            "date": "Answered May 10, 2018",
            "views": "176",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Vitols",
                "href": "/profile/Paul-Vitols"
            },
            "answer_text": "Rebirth was taught by the Buddha, who was able to directly see all of his own past lives in a meditative insight that occurred shortly before his final enlightenment. For Buddhists, the Buddha’s word is taken as authoritative in everything, including this. So it’s first of all a matter of belief. As for evidence, it’s not easy to see what kind of evidence would be convincing for everyone. In Tibet there are accounts of Buddhist teachers predicting where and when they will be reborn, and when the infants found in those predicted circumstances are tested, they have knowledge that would appear to be available only to the previous incarnation. There are also many accounts in regular, secular life of people with memories from past lives, knowing things that they seemingly couldn’t know. But not everyone accepts these accounts; materialists come up with alternative explanations. In the West we have a materialistic outlook that many of us find hard to let go of, which presents a challenge to Western Buddhists. In my own case, I have no difficulty believing in rebirth; to me it makes sense and indeed more sense than any other belief. A decisive moment for me came in 1986 when I read the book Life After Life by Raymond Moody, about people’s near-death experiences. I became convinced that these people’s experiences were real, and that death is not the end for any of us. Interestingly and even paradoxically, this fact makes our lives, and every moment in them, count all the more. ",
            "date": "Answered August 3, 2017",
            "views": "316",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bren Butler",
                    "user_href": "/profile/Bren-Butler"
                },
                {
                    "user_id": "Dasun Tharaka",
                    "user_href": "/profile/Dasun-Tharaka-1"
                }
            ]
        }
    ]
}