{
    "title": "Greece claims the ancient Macedonians could read & write Greek. Roman historians in 180BC recorded that only the Macedonian nobility could read & the rest were illiterate & could only communicate orally. Who's right, the Greeks or Romans? - Quora",
    "tags": [
        "Ancient Greek & Latin",
        "Ancient Literacy",
        "Specific Ancient Greek and Roman Historians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dimitar-Esperanto Berberu",
                "href": "/profile/Dimitar-Esperanto-Berberu"
            },
            "answer_text": "Even the Greks were hardly literate, only 5% in Athens, less elswhere. Based on more trustable Latin sources - From IV century BC, gradually Greek dialect was introduced (via nobility) [E. Borza #1 authority]. The status of the ancient Macedon language is still debated. The kings always declared as Macedons (Alexnder the Great is made up recent substitution).  The Macedon nobility was multilingual - required to control wide areas.Hellenism was popular, due to the convenience of the copied Phoencicial script & easy way to pass knowledge/directions/religion.Not yet known what the Macedons language was like, so the Romans were closer to the truth. Of course, the Romans had superior administration to control over 1200 Greek city-states + the huge Macedon Kingdom for much longer. Their evidence is more reliable, not excluded to be biased, as the Greek sources were (Diogen had hard time to find honest Greeks). The conclusion is that I now know that I know nothing. Those that ‘know’ that Macedonian was Greek show their challenged logic. ",
            "date": "Updated December 26, 2019",
            "views": "167",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sa-Sp"
                }
            ]
        },
        {
            "author_info": {
                "name": "Demetres Karapanos",
                "href": "/profile/Demetres-Karapanos"
            },
            "answer_text": "One of my Great Grandmothers couldn’t Read or Write Greek. The Rich at her Village Kastri could both Read and Write Greek. Kastri=Castle is a village at the SubProvince of Kynouria= Dog’s Tail. Kynouria is a SubProvince of the Province of Arkadia= Female Bear. Was she not Greek? According to you She WAS NOT of Greek Nationality! She was a member of the Nation of Arkadians. And as the people of Kynouria (The Capital of Kynouria is Leonidion in Commomeration of HIM who died exactly 2499 years ago in the middle of August) had moved over there from Sparta and were -and still are speaking a Spartan Dialect instead of Demotike/Katharevousa= The Official Language of Greek Democracy and Granddaughter of Attica Dialect, not only she wasn’t Greek, but a Slav! I wish she was alive and you could go and tell on her Face: -Katerina you are not Greek. Now a description of her to assist you locating her. Brown Reddish Hair, EXTREMELY Thin though with wide shoulders and slightly above the average height of Greek Women. But still I remind you that Greeks at 1900 -due to malnutrition- were the Shortest in Average Europeans by far. Now I am in the Proud position to have to fill you with the information that she was constantly walking on Everyday Basis (Either in Cold and Rain or in Scorching Heat) uphill-downhill carrying on her shoulders a Gigantic Wooden Barrel filled with water for the needs of the stone masons -To make Connecting Construction Mud- who were building her house. I wish to had been there and had seen her face reactions, before she was going to tear you apart in tiny pieces for calling her a Non Greek. You must know that she wouldn’t stop for a moment to consider the reactions of the Americans and Europeans regarding her actions,- while I do take them under consideration whenever I am writing. By the way you can locate the meaning of her name at a Lexicon of Greek names. It would be very easy. Katerina/Kατερίνα is in the same page and very close to Karanos/Κάρανος, Kassandros/Κάσσανδρος and Kleitos/Κλείτος. Who are Karanos, Kassandros and Kleitos? Macedonians, a totally different Nation from Greeks, as the Laconians and Arkadians are also a totally different Nation and non Greeks. Also Atticans and Boeotians and Hepeirotes and Thessalians and Cretans according to your disgusting lies. ",
            "date": "Updated June 27, 2020",
            "views": "793",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Terry Zaffer",
                    "user_href": "/profile/Terry-Zaffer"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Byzantine-Warrior"
                },
                {
                    "user_id": "Dimitris Katsaros",
                    "user_href": "/profile/Dimitris-Katsaros-6"
                },
                {
                    "user_id": "Anastasios Rounis",
                    "user_href": "/profile/Anastasios-Rounis"
                },
                {
                    "user_id": "Elines E Makedones",
                    "user_href": "/profile/Elines-E-Makedones-1"
                },
                {
                    "user_id": "Stratos Gregoras",
                    "user_href": "/profile/Stratos-Gregoras"
                },
                {
                    "user_id": "Kalypso Magiopoulou",
                    "user_href": "/profile/Kalypso-Magiopoulou"
                },
                {
                    "user_id": "Giorgos Vassiliou",
                    "user_href": "/profile/Giorgos-Vassiliou"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sa-Sp"
                },
                {
                    "user_id": "Spyros Kallim",
                    "user_href": "/profile/Spyros-Kallim"
                }
            ]
        }
    ]
}