{
    "title": "Has the Cold War really ended? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Hestia- Phyllis Rizvanović",
                "href": "/profile/Hestia-Phyllis-Rizvanović"
            },
            "answer_text": "Factually, yes the Cold War is over. However, amidst rising tensions we may find ourselves in the midst of a new Cold War. To answer you questions, we must look at the causes of the Cold War: Historians have identified several causes that led to the outbreak of the Cold War, including: tensions between the two nations at the end of World War II, the ideological conflict between both the United States and the Soviet Union, the emergence of nuclear weapons, and the fear of communism in the United States. tensions: there are still tensions between the United States and many former Soviet States, however, no one of these countries would resort in a war, all but Russia. This is because unlike most former USSR states, Russia is a superpower, they have nuclear weapons, good relations with other countries, mainly and (most dangerously for the United States) with China. China is known to be somewhat an enemy to the United States, after all they are in a trade war. nuclear weapons: Russia has surpassed the United States in terms of missiles. This has brought a lot of stress amongst Americans and the American government. fear of communism: communism is no longer in the Soviet Union and neither is the Soviet Union itself. Currently, I wouldn’t say there is a Cold War between Russia and the United States, but this is only in regards to the world leaders of both countries. As we all know, president trump isn’t exactly good at individual thinking and may at times resort to asking Russia for help, or as some of you might say- Trump is Putins’ dog. And while it isn’t apparent that Trump hates Russia, you could say that Putin strongly dislikes the west and especially the United States. The people of both nations seem to dislike each other. But this isn’t to say that there aren’t any cold wars, America has found itself in multiple ‘cold wars’, you could say they are in a pre- Cold War with China, Iran, most of the Middle East, North Korea, you know what I mean. As for Russia, I don’t believe The Cold War is over, or ever was over, but it is just less dangerous than it used to be. Tensions between Russia and United States are rising at this very moment, are the two states currently at a cold war? Most likely. ",
            "date": "Answered June 14, 2020",
            "views": "290",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cameron Reilly",
                "href": "/profile/Cameron-Reilly"
            },
            "answer_text": "I don’t believe it ever ended. What was the Cold War really about? The same thing most wars have always really been about: economic dominance. The Cold War was a fight for dominance between two competing economic blocs - the American and the Soviet. It was called a “cold” war because unlike previous wars for economic dominance, the two countries did not engage in a direct military conflict. By 1950, both had nuclear weapons and both wanted to avoid the consequences of an all-out atomic war. Military conflict itself (eg America’s invasion of Vietnam) was allowable in a “cold” war, as long as the two sides didn’t engage the nuclear option. Coming out of WWII, the last remnants of the 19th century British and European trading blocs had finally been destroyed. At Bretton Woods, the USA engineered the greenback as the currency for the new bloc. The Russians, for a variety of valid reasons, didn’t trust the Americans (and vice versa). Neither did the British, but there wasn’t much they could do about it. There is copious evidence that the USA deliberately engineered the conditions of the Marshall Plan to make it almost impossible for the Russians to participate - and they succeeded. The Marshall Plan was designed to buy the economies of European countries and bring them into the American trading bloc with a faux kind of “aid” (most of the money never left the USA, it was more like a line of credit they could spend on American goods and services, with a deferred payment plan). The Soviet economy had been destroyed by WWII to a far greater extent than that American economy (thanks to a couple of very large oceanic moat protecting the US), so they couldn’t compete effectively on the “aid” front. They needed everything they had to re-build their own economy. Approximately 20 million people died in the USSR during WWII, compared to about 400,000 Americans. So the economic blocs were created in the late 40s and then they fought over control of them for the next 30-odd years. The other component of the Cold War involved countries who were only very loosely aligned to the USSR becoming communist, eg China, Vietnam, Cuba, North Korea, etc, as a way to end colonialism and create better living conditions for their people, something only communism was interested in doing, because the capitalist countries were happy to continue to trade with the colonial powers despite the living conditions of the indigenous people (for evidence, witness the American support for the re-establishment of French colonial authority over Indochina after WWII). The USA was determined to try to keep those countries inside their trading bloc and outside of the Soviet bloc, so they engaged in a range of economic and military actions to try to prevent communism from becoming successful in those regions. So where does that leave us today? The battle for economic dominance continues, mostly lead by the USA on one side, and a small group of non-aligned countries on the other side. The growing anti-Russian narrative in the USA over the last few years is evidence that the Russians are still seen as strong potential competitors, as is the series of American attempts to destroy the Venezuelan economy / political system after the election of Chavez, Trump’s trade war with China and the regular illegal American sanctions against North Korea, Cuba, Iran, etc. The recent American-lead invasions of Iraq and Libya were also mainly driven by economic objectives, as both countries were trying to engineer non-aligned economic trading blocs. ",
            "date": "Answered March 31, 2019",
            "views": "12",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Victor Gabriel",
                    "user_href": "/profile/Victor-Gabriel-22-1"
                },
                {
                    "user_id": "Cody Crouse",
                    "user_href": "/profile/Cody-Crouse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrey Yurchenko",
                "href": "/profile/Andrey-Yurchenko"
            },
            "answer_text": "Has the Cold War ended? This question entertains a solid and affirmative “no” in public consensus. But let me challenge that. We usually define Cold War between the lines of “A period of geopolitical, military, economic, and ideological confrontation of two major nations and their satellites. The two parties could not engage in a conventional war due to threat of mutual annihilation, thus it was called a Cold War”. Following what was essentially a collapse of Soviet Union, we used to believe that Cold War is over - as one party “claimed victory”. The communism sustained an ultimate defeat - or so we thought.Here we are, in 2018. Most of the equation did not change: there is still geopolitical, military, and economic confrontation. Two major contestants are still in possession of WMDs.Why? I’m going to disappoint many people, by claiming that Cold War never was an ideological confrontation. Okay. So why did it even exist?No secret that western parties reviled Soviet Union. Truman doctrine of 1947 was set to contain Communism, as everyone was paramount that Soviet Union sought expansion. But that is least to say, untrue - and here’s why; Soviet ideology was never communist. It was much less of a threat than its image.Soviet Union did not seek expansion. Apart from buffer states, it felt pretty comfortable within its bounds.Soviet military doctrine was defensive - you can affirm it by mostly defensive and reactionary development.Western powers had no problem aligning with “communist regimes” in China and Vietnam, making ideological argument invalid.United States employed McCarthyism, a practice that was no better than Soviet censorship. Although its legislature was repealed, the underlying ideology survived in political and journalist spheres as exceptionalism and bias.The latest events can be described as nothing but disrespect of mutual interest, and fundamental hypocrisy on part of both parties. The conflict is set to exist as long as parties don’t admit their true contentions. ",
            "date": "Answered April 28, 2018",
            "views": "855",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cameron Reilly",
                    "user_href": "/profile/Cameron-Reilly"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Young",
                "href": "/profile/Mark-Young-473"
            },
            "answer_text": "Yes… and kind of no. The “Cold War” is a period of time in which there was a power struggle between the modern Western countries headed by the United States and Western Europe, and the East with the spread of Communism from U.S.S.R., China, Vietnam, Korea, and some areas of South America including Cuba. During most of the time period from roughly 1948 to 1991, the KGB and the CIA conducted operations with the goal of limiting, harming, or destroying the interests of their respective enemy nations. Sometimes military action was taken and units were deployed in countries that had interest of resources for both sides. When Ronald Reagan became President, he took very bold steps under the intelligence and knowledge that the financial situation and cultural control over the “Iron Curtain” was loose and insubstantial. So he partly bluffed the Russians and fed their leadership their worst fears. And in truth, the Russians were falling far behind on keeping up with innovation, discovery, and technology. The U.S.S.R. lost most of their rebelling satellite nations that declared independence and joined up with the free world in hopes to prevent backlash or military response from the Mother Homeland. With the collapse of the U.S.S.R. and the loss of the KGB’s mission, support for furthering Communistic spread died out. .Communism was never really killed off in the same way monarchy powers were following the Age of Revolution. Almost all countries that entered the 21st Century with a strong sense of Communism have greatly softened up the agenda to keep up with the realization of a superior free market system. But it still exists in several countries that were never liberated from the grip. Worse still, it’s started creeping into Western politics and it’s come to a point now that it’s being argued and taught as a preferred “fairer” system over the “evil” capitalist boom that’s launched us into the modern age and given everyone the opportunity to succeed. ",
            "date": "Answered April 30, 2019",
            "views": "463",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Brian-Neutrinosan"
                },
                {
                    "user_id": "Alex Bestoso",
                    "user_href": "/profile/Alex-Bestoso"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wasja Kaczerski (Вася Качерский)",
                "href": "/profile/Wasja-Kaczerski-Вася-Качерский"
            },
            "answer_text": "Yuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuup It has, when the USSR fell. And just because some tension is going on doesn't mean there's a new war. ;) ",
            "date": "Answered June 14, 2018",
            "views": "282",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Marchant",
                "href": "/profile/John-Marchant-11"
            },
            "answer_text": "The collapse of the Soviet Union effectively brought an end to the Cold War. The Cold war was based upon the Soviet union heading an organization called the Warsaw Pact. The Warsaw pact was a group of East European countries controlled by Russia to form a buffer zone to prevent west European countries headed by the United States from expanding further to the east. That was the theory. In reality most of the countries that formed the Warsaw pact, Hungary, Poland, Czechoslovakia were in fact countries that Russia had taken during WW2 from Nazi occupation. Following WW2 the countries liberated/taken by Soviet forces were forced to accept Russian occupation and were dominated by Moscow. In 1948 the western powers formed the North Atlantic Treaty Organisation (NATO) headed by the USA, the aim of NATO was to form a defence organisation, an attack on one NATO country was an attack on all. In principle it’s main enemy was Russia, in 1955 Russia created the Warsaw pact a defence alliance against the west. Russia armed most of the Warsaw pact countries and thought that they would come to her aid if the west attacked. However, Russian rule of the countries it forcibly occupied was not accepted by many of the countries for example Poland in 1950 had an uprising that was put down by military force, similar in Hungary in 1955 and Czechoslovakia in 1968. The latter two being put down by the intervention of the Russian army. Less East Germany it is unlikely that all Warsaw pact countries would have defended Russia, if the western powers decided to invade Russia (which they wouldn’t have even contemplated). Today the Warsaw pact no longer exists most of the countries of the Warsaw pact have in fact joined NATO. The Cold war is at and end however Mr Putin has tried to continue Russian domination. John ",
            "date": "Answered July 17, 2019",
            "views": "246",
            "upvotes": " Answer requested by Bryan Jones",
            "upvoters": [
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-631"
                },
                {
                    "user_id": "Marco Ferrato",
                    "user_href": "/profile/Marco-Ferrato"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Hodgson",
                "href": "/profile/Nick-Hodgson-1"
            },
            "answer_text": "Yes the Cold War ended.  To be specific it ended between 1989 (with the opening up of borders between Eastern and Western Europe) and 1991 (with the dissolution of the Soviet Union). The Cold War was a conflict between Western Democracies/NATO led by the United States against the Soviet Union and her allies.  When the Soviet Union ceased to exist - there was no possibility of the war continuing.  In terms of your question details - of course we still see the world in terms of black and white, good and evil. Mankind has ALWAYS seen the world that way.  This attitude wasn't a Cold War invention.   Go back through history and you'll find we have always painted our enemies as pure evil.  Read some newspaper accounts from World War 1 and 2.  Look at Crimean War accounts from the 1850's.   Research attitudes towards Napoleon in the 1800's.   We always paint our enemies with the same brush and they do the same to us. ",
            "date": "Answered February 7, 2015",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Emery",
                    "user_href": "/profile/Alexander-Emery-2"
                },
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-631"
                },
                {
                    "user_id": "Richard Williams",
                    "user_href": "/profile/Richard-Williams-195"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Garcia",
                "href": "/profile/Tony-Garcia-81"
            },
            "answer_text": "The Cold War between the United States and the Soviet Union saw the two superpowers each attempting to curry favor in the Third World by fighting proxy wars of independence. These battles between communism and democracy often held little meaning for the minions seeking to eke out a living. They suffered from the colonial oppression of the East or West, depending upon where one sat on the ideological compass. During this time, in 1969, there was a skirmish between China and the Soviet Union on Zhenbao Island, which lies on the border between the two countries in the Ussuri River. Several dozen troops were killed on this island of neither strategic nor tactical importance. This small war had a transformative effect on both countries. Both presumed that the best way to win a war against the other was to develop stronger ties with the United States. As an ally, even a distant one, the U.S. could be called upon to aid one in its battle against the other. China and the Soviet Union quickly settled their border dispute and became friends due in large part to their one aligning position—both countries viewed the United States as a geopolitical and ideological threat. In 1991 the Soviet Union dissolved. Since then, Russia, while initially having reeled during its nascent strides toward democracy, has resurged as a superpower. China has taken steps toward a Western economic model and has emerged as a viable third superpower. But China and Russia still see the U.S. as a threat, and this has formed the basis of the New Cold War. They cooperate at the United Nations, seeking to thwart U.S. initiatives.[1] Russia sells China missiles and other military hardware. The two have conducted joint military drills in the Baltic and South China Seas.[2,3] And Russia has also shifted a large amount of its currency reserves into Chinese currency as a hedge against U.S. sanctions. In real terms—economically and militarily—China is more powerful today than Russia. But to expect a return to the fractious relationship that defined the two communist countries is unlikely. What does loom on the horizon are the sort of skirmishes that characterized the early Cold War. China and Russia appear to have held fast to one dictum of those early years: win the hearts and minds of the people. To this end, China pledged $60 billion in aid and loans to Africa.[4] Russia took advantage of political instability in Cuba, Venezuela, Columbia, Mexico and Brazil to meddle with elections and turn public sentiment against the United States. The New Cold War has started, and the U.S. apparently has no idea how to counterattack. Its anachronistic protectionism and slovenly approach to foreign affairs, its lack of statesmanship and diplomacy, coupled with a dearth of strategic initiatives, have left a special poignancy for its allies. Where the United States once led, morally as well as militarily, it now remains cocooned in this torpor of selfishness. The United States now attempts to fight this New Cold War on uneven footing with China and Russia. The Trump administration appears to have tacitly recognized this and has reversed the roles of half a century ago. Now the U.S. toadies to Vladimir Putin and Xi Jinping, hoping to gain an ally should threats to American hegemony increase in the Middle East and the Asian-Pacific Rim. Donald Trump’s instincts tell him to lob bluster at America’s enemies, But they know full well that this will be followed by an America that runs from its global responsibilities. This is the New Cold War. This is the New America. [1] Dangerous Liaisons [2] Russia says its Baltic Sea war games with Chinese Navy not a threat [3] China, Russia naval drill in South China Sea to begin Monday [4] https://www.washingtonpost.com/world/china-pledges-60-billion-in-aid-and-loans-to-africa-no-strings-attached/2018/09/03/a446af2a-af88-11e8-a810-4d6b627c3d5d_story.html?utm_term=.24b3f7a312ef ",
            "date": "Answered April 1, 2019",
            "views": "345",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Buczkowski",
                "href": "/profile/Tom-Buczkowski"
            },
            "answer_text": "Yes, the Cold War is over. Tom Buczkowski's answer to Is a second cold war between the U.S. and Russia a real possibility? Tom Buczkowski's answer to Is the western world currently embroiled in a new Cold War? The US, Russia, China, Great Britain, and France no longer entertain the scenario where they would launch nukes at one another. There is no threat of dozens, hundreds, or even thousands of these mushroom clouds appearing over any combination of these countries. They are more worried about nuclear proliferation among smaller, rogue states and terrorists. The threat of global nuclear war and an unending arms race were the real hallmarks of the Cold War. These nations now wage war on the new global battlefield, the global market, each maneuvering for access to natural resources and greater trade. Though regional saber rattling and military incursions in areas with strategic resources still occur, like the US in Iraq and Russia in Crimea, these countries stop short of direct conflict with one another in order not to totally destabilize the global market on which they depend. ",
            "date": "Updated June 16, 2016",
            "views": "24",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James H. Smith",
                    "user_href": "/profile/James-H-Smith-3"
                },
                {
                    "user_id": "Shraya Maharjan",
                    "user_href": "/profile/Shraya-Maharjan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul James Valentine",
                "href": "/profile/Paul-James-Valentine"
            },
            "answer_text": "It depends on what your definition of cold war is. If it is the struggle between the Soviet Union and the United States of America, it is gone, the Soviet Union is no more. But if you mean the struggle between Capitalism and Communism/Socialism, then it still exists, although Capitalism is winning, by far. There are still some communist countries out there. And some intellectuals have been supporting communism. I hope this answers your question! ",
            "date": "Answered January 29, 2019",
            "views": "751",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-631"
                },
                {
                    "user_id": "Phat Nguyen",
                    "user_href": "/profile/Phat-Nguyen-89"
                },
                {
                    "user_id": "Lim Kagen",
                    "user_href": "/profile/Lim-Kagen"
                },
                {
                    "user_id": "Richard Williams",
                    "user_href": "/profile/Richard-Williams-195"
                },
                {
                    "user_id": "Samuel Liu",
                    "user_href": "/profile/Samuel-Liu-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Wang",
                "href": "/profile/Joseph-Wang-9"
            },
            "answer_text": "Yes the Cold War really ended.   Among the major powers, we no longer see the world in black/white and good/evil terms like we did during the Cold War.  The current political situation resembles more Europe in the 19th century, when you had nations with different interests and some ideological conflict, but you didn't have this stark battle between ideologies. In addition, there is no power or combination or powers that can challenge the United States as a global power.  The United States is the only power that can project force at a global level. ",
            "date": "Answered February 7, 2015",
            "views": "37",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Emery",
                    "user_href": "/profile/Alexander-Emery-2"
                },
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-631"
                },
                {
                    "user_id": "Organixsfx Organixsfx",
                    "user_href": "/profile/Organixsfx-Organixsfx"
                },
                {
                    "user_id": "Andrew Ortega",
                    "user_href": "/profile/Andrew-Ortega-21"
                },
                {
                    "user_id": "Vedant Sapra",
                    "user_href": "/profile/Vedant-Sapra"
                },
                {
                    "user_id": "Uma Priyadarsi",
                    "user_href": "/profile/Uma-Priyadarsi"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tj-Scribe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Pietrasz",
                "href": "/profile/Richard-Pietrasz"
            },
            "answer_text": "In at least two major senses, it never ended. First, although nuclear arsenals of the two biggest powers were greatly reduced, and their alert status also, they are still a threat to destroy much of the human world.  There are more ignition points, due to nuclear proliferation, and China has increased its participation. In conventional weapons, both sides are still develop and maintain weapons for a US v Russia war. With the fall of USSR and the dissolution of the Warsaw Pact, NATO did not react in kind.  Instead, it expanded closer to Mother Russia itself.  Now Putin is reacting back. ",
            "date": "Answered July 7, 2014",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Emery",
                    "user_href": "/profile/Alexander-Emery-2"
                },
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-631"
                },
                {
                    "user_id": "Nadeem Hussain",
                    "user_href": "/profile/Nadeem-Hussain-40"
                },
                {
                    "user_id": "Fezile Nkuna",
                    "user_href": "/profile/Fezile-Nkuna-1"
                },
                {
                    "user_id": "Yash Agrawal",
                    "user_href": "/profile/Yash-Agrawal-9"
                },
                {
                    "user_id": "Alex Antoine",
                    "user_href": "/profile/Alex-Antoine"
                },
                {
                    "user_id": "Fred Landis",
                    "user_href": "/profile/Fred-Landis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaime Harlow",
                "href": "/profile/Jaime-Harlow"
            },
            "answer_text": "The Cold War never ended - in 1992, I know, personally, that Russia was trying to get GPS coordinates for pipeline interconnect valve stations operated by Tenneco. This is not a behavior expected from a quiescent dissolved nation-state. Yet, sadly, the Clinton Administration elected to trumpet USA supremacy without care for whether there was a change in Russia’s demeanor. It turns out that Russia changed its flag, the insignia on its weaponry, yet persisted to act belligerently in Bosnia, Afghanistan and Iraq. Too few recall that the Baathists of Iraq were the product of the Soviet Union, armed by the Soviets, and trained by the Soviets…we ended up sending troops to Iraq twice since the ostensible end of the cold war. ",
            "date": "Answered March 24, 2019",
            "views": "204",
            "upvotes": " Answer requested by Bryan Jones",
            "upvoters": [
                {
                    "user_id": "Bryan Jones",
                    "user_href": "/profile/Bryan-Jones-155"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Grant",
                "href": "/profile/James-Grant"
            },
            "answer_text": "Yes, it is over. When I was growing up, there was a sense that the world could end in the next few years. This feeling isn't around today. We worry now about another terrorist strike. While tragic, the dead would number in the 10s, 100s or even 1000s but not in the millions like an all-out war. Back then, the USSR and the West were actively trying to ruin each other by other means than outright warfare. The soviets lost when their system fell apart. It hasn't been rebuilt. Can another cold war start? Certainly, but the last one is over. ",
            "date": "Answered July 7, 2014",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryan Jones",
                    "user_href": "/profile/Bryan-Jones-155"
                },
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Salvatore Barrera",
                "href": "/profile/Salvatore-Barrera"
            },
            "answer_text": "In a way. But do you know why there are still many countries/nations that are supposedly communistic and/or socialistic ? Because they are really capitalistic. Many call this not a Cold War, per se, but an Economic War that can/will turn into a strategic war..militarily. Look at the authoritarianism of Chinese capitalism. Look at the oligarchical capitalism of Russia. Also, of course, look at the United States’s plutocratic capitalism. Now if China and Russia fully and completely democratizes like the United States, they can/may still be our democratic enemies because of their larger economic outputs than the United States. Many even said the REAL bitterness of North Korea is not because of the Korean War but because North Korean is not a part of globalization and its riches in international commerce. So is the Cold War over and all the above superpowers can stand down because we all worship the sacredness of the Holy Almighty American dollar. ",
            "date": "Answered June 14, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Artem Medvedev",
                "href": "/profile/Artem-Medvedev"
            },
            "answer_text": "The jury would still be out on that one, given the new events between Russia and the West. However, it doesn't take a lot of analysis to see that today's Russia is not the superpower that the USSR was nor is the confrontation between Putin's Russia and \"the West\" today as ubiquitous in its influence on the entire planet as the USSR-US confrontation of the Cold War. An interesting question would be, if we presume that the Cold War did end with the dissolution of the Soviet Union, who were the winners, if any. I believe that the \"traditional\" view that the Cold War ended in American victory is rather simplistic.  ",
            "date": "Answered March 9, 2016",
            "views": "983",
            "upvotes": " Answer requested by Spencer Perruzzi",
            "upvoters": [
                {
                    "user_id": "Khriszo Kamz",
                    "user_href": "/profile/Khriszo-Kamz"
                },
                {
                    "user_id": "Organixsfx Organixsfx",
                    "user_href": "/profile/Organixsfx-Organixsfx"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Billings",
                "href": "/profile/Tom-Billings-8"
            },
            "answer_text": "Well, there are people still “inside” the remnants of “the socialist camp” who don’t think so. Some of them live in Portland, Oregon. I remember sitting in a class at Portland State in 2002, and mentioning that “now that the Cold War is over”, …and hearing a hiss from the back of the room, … “The*Cold*War*isn’t*over*! The class bigots on the Left have not completely given up, by any means, especially given the riots we’ve had in Portland since an opponent of progressive policies came back to the White House. ",
            "date": "Answered June 4, 2019",
            "views": "102",
            "upvotes": " Answer requested by Bryan Jones",
            "upvoters": [
                {
                    "user_id": "Hara Krishna Pramanik",
                    "user_href": "/profile/Hara-Krishna-Pramanik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Howard Lanus",
                "href": "/profile/Howard-Lanus-1"
            },
            "answer_text": "In terms of fearing Communism as a global hegemonic force with an established nation as a base, yes. The Soviet Union collapsed, China has turned capitalist, and the only communist countries I know of, North Korea and Cuba, are poor, isolated, stagnant dictators. In terms of fearing a rival ideology for global hegemony, no. In many ways, we’ve simply changed the great enemy of democracy. In the 1930s and 40s, it was Fascism. After that, it was Communism, then Islamic Extremism. Now, it’s whatever ideology the politicians are opposed to, like Social Democracy. ",
            "date": "Answered July 6, 2019",
            "views": "87",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alex Bestoso",
                    "user_href": "/profile/Alex-Bestoso"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rod Mollise",
                "href": "/profile/Rod-Mollise"
            },
            "answer_text": "Yes. Things are much different now (from someone who lived through it and served in the Strategic Air Command). Yes, we still compete with Russia. But it’s now pretty much on the level of a developing country (albeit a heavily armed one). I can tell you this: nobody today, unlike in the height of the Cold War, is going to sleep wondering whether they will wake up the next morning. ",
            "date": "Answered June 4, 2019",
            "views": "52",
            "upvotes": " Answer requested by Bryan Jones",
            "upvoters": [
                {
                    "user_id": "Peter Robertsson",
                    "user_href": "/profile/Peter-Robertsson"
                },
                {
                    "user_id": "Vasily Smith",
                    "user_href": "/profile/Vasily-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Smaltz",
                "href": "/profile/Joe-Smaltz-2"
            },
            "answer_text": "The USSR no longer exists, so I’m thinking probably. Russia is still adversarial, but they have always been contrary. We like to irritate them. Right now there’s a little thing going on in Syria. Russia only has one warm water port in the Black Sea. They like having a base in Syria, that irritates us. Kind of a pissing contest, nobody wins, everybody gets alert. ",
            "date": "Answered June 3, 2019",
            "views": "19",
            "upvotes": " Answer requested by Bryan Jones",
            "upvoters": [
                {
                    "user_id": "Graham Chidwick",
                    "user_href": "/profile/Graham-Chidwick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Douglas Daniel",
                "href": "/profile/Douglas-Daniel"
            },
            "answer_text": "Good question. There is no Warsaw Pact and the Soviet Union lost some territory then changed its name. The Russian government clearly views the West as its enemy and feels that it must disrupt us as much as possible to survive. I would say that it has just thawed a bit. ",
            "date": "Answered June 4, 2019",
            "views": "46",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Olesia Borkovsky",
                    "user_href": "/profile/Olesia-Borkovsky"
                },
                {
                    "user_id": "Alex Bestoso",
                    "user_href": "/profile/Alex-Bestoso"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Agapax",
                "href": "/profile/George-Agapax"
            },
            "answer_text": "Technically Yes.  The Cold War was between NATO and Ussr, and ussr is no more. However recent tensions between Russia and USA shows that war never ended. Of course the alliances changed and NATO is trying to play into Russia's back yard (Ucraine, Georgia, Armenia). Russia tries to rebuilt hes strength. Also China is a major geopolitical player , and an \"ally\" with Russia against other Powers. ",
            "date": "Answered June 19, 2014",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-631"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan J. Loewen",
                "href": "/profile/Ryan-J-Loewen"
            },
            "answer_text": "No. The cold war ended when the USSR dissolved (December 26th, 1991), breaking the iron curtain (A boundary separating the Capitalist Europe and the Socialist Europe). The Cold War was a conflict of ideology, between Capitalism and Communism. When the USSR collapsed it represented the fall of Communism in Europe and the end of the arms race that had happened in result of this war of ideology. ",
            "date": "Answered March 29, 2018",
            "views": "762",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rich Whitsell",
                    "user_href": "/profile/Rich-Whitsell"
                }
            ]
        },
        {
            "author_info": {
                "name": "An Nguyen",
                "href": "/profile/An-Nguyen-678"
            },
            "answer_text": "Nope, not anymore since the USSR dissolved in 1991. For the Eastern Bloc countries, the USSR was their backbone, quite literally so, and their socialist governments overtaken. Since then, there are only 3 governments that has Marxism-Leninism as their main state philosophy: Cuba, Laos, and Vietnam (China has started have a mixed ecomomy, while the DPRK has switched to “Juche”, a purer form of communism). Meanwhile, these nations and the Western Bloc have restored relations; the US lifting its embargo on Vietnam, organised summits with China and the DPRK, etc. So, when they say it’s over, it’s really over, alright? ",
            "date": "Answered December 21, 2018",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Reid",
                "href": "/profile/Robert-Reid-90"
            },
            "answer_text": "The first one ended with the demise of the Soviet Union. However, Vladimir Putin seems to be trying for Cold War 2.0, with the seizure of Crimea from Ukraine and the battles in the Eastern Ukraine. There is also a return of the old KGB tactics against Russian citizens and the Russian operatives poisoning and killing off dissidents in Britain and other countries. I don't think Russia has the military power that is necessary to be a threat like it was during the cold war. However, Russia is rebuilding it's military, so time will tell. Who knows, maybe the next cold war will be a cyber war. ",
            "date": "Answered May 2, 2019",
            "views": "150",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Calvin Gordon Dodge",
                    "user_href": "/profile/Calvin-Gordon-Dodge"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Clifford",
                "href": "/profile/Paul-Clifford-27"
            },
            "answer_text": "Do you believe that the Cold War is actually over? Which one? USA verses Russia, China, Iran, North Korea or some other country Trump has pissed off. ",
            "date": "Answered June 14, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Doyle",
                "href": "/profile/Michael-Doyle-296"
            },
            "answer_text": "No the cold war hasn't ended for, the U.S. industrial war complex is too big to fail and thus, profits keep rolling in with the American tax payer paying and paying and ever more paying! ",
            "date": "Answered August 4, 2019",
            "views": "8",
            "upvotes": " Answer requested by Bryan Jones"
        },
        {
            "author_info": {
                "name": "Eugene Miya",
                "href": "/profile/Eugene-Miya"
            },
            "answer_text": "Yes. Different times. This question should probably merged with Is the Cold War still alive? ",
            "date": "Answered June 17, 2015",
            "views": "589",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Steven P. Barrett",
                "href": "/profile/Steven-P-Barrett"
            },
            "answer_text": "Yes and no. Despite the big parades held by the Russians, Chinese and North Koreans, for the most part, they’re for “domestic consumption.” The day they aren’t well, the missiles might be on their way. I’m exaggerating, but the tension isn’t nearly as taut as it was during the days of the Berlin Wall, the Castro brothers working to spread liberation and building up the Ortega bros. in Nicaragua and Ceasar what’s his name in Venezuela. ",
            "date": "Answered June 15, 2018",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ngee Kiat Low",
                "href": "/profile/Ngee-Kiat-Low"
            },
            "answer_text": "Cold War was a fight between communism and capitalism, and capitalism won. Russia is now a gas station and China a factory. China has more rich than USA, how is that communism? Cold War is over. Today's US China fight is over economics interests only, not an ideological fight at all. ",
            "date": "Answered June 14, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Shorif Khan",
                "href": "/profile/Shorif-Khan-3-1"
            },
            "answer_text": "The conflict ended when the USSR dissolved (December 26th, 1991), breaking the ideological barrier (A boundary separating the Capitalist Europe and therefore the Socialist Europe). The conflict was a conflict of ideology, between Capitalism and Communism. When the USSR collapsed it represented the autumn of Communism in Europe and therefore the end of the race that had happened in results of this war of ideology. More…… ",
            "date": "Answered January 24, 2020",
            "views": "176",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Igor Alexandrov",
                "href": "/profile/Igor-Alexandrov-2"
            },
            "answer_text": "War can be only hot. The term “Cold War” is only for western propaganda. It was never used in USSR and is not used in modern Russia. ",
            "date": "Answered April 30, 2019",
            "views": "32",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Shayn McCallum",
                "href": "/profile/Shayn-McCallum"
            },
            "answer_text": "No. The Cold War ended in 1989. There are signs of attempts to reinvent the Cold War with Russia and China but they are not really going anywhere. The lack If any real ideological camouflage makes it all just squalid real politik for the most part. ",
            "date": "Answered January 3, 2020",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hank Beel",
                "href": "/profile/Hank-Beel"
            },
            "answer_text": "By definition of the Cold War 1945–1991, YES! That Cold War ended. There could be another Cold War but it would not be that same Cold War even if it is the same nations involved. Cold War 2 perhaps??? ",
            "date": "Answered March 30, 2019",
            "views": "38",
            "upvotes": " Answer requested by Bryan Jones"
        },
        {
            "author_info": {
                "name": "Vasily Smith",
                "href": "/profile/Vasily-Smith"
            },
            "answer_text": "For Putin and in brainwashed part of Russian public it never ended. Phase two started few months ago. ",
            "date": "Answered July 6, 2014",
            "views": "202",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Michael Rohde",
                "href": "/profile/Michael-Rohde-7"
            },
            "answer_text": "Yes. To have a war, there has to be opponents. No one is our enemy. There is no war. We have competitors like everyone else. That does not equal war. ",
            "date": "Answered June 14, 2020",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Saintonge",
                "href": "/profile/Stephen-Saintonge"
            },
            "answer_text": "Yes. Putin’s Russia is not friendly towards the U.S., but it is not trying to destroy the U.S. and conquer the world, as the USSR tried to do. ",
            "date": "Answered January 6, 2018",
            "views": "221",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Leonid Jacobs",
                "href": "/profile/Leonid-Jacobs"
            },
            "answer_text": "The old cold war has ended with the demise of the Soviet Union. The new cold war is in making. ",
            "date": "Answered August 4, 2019",
            "views": "4",
            "upvotes": " Answer requested by Bryan Jones"
        },
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "The Cold War ended with the fall of Communism in Russia and the subsequent dissolution of the Soviet Union in 1991. ",
            "date": "Answered February 7, 2015",
            "views": "784",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wenhe Lu",
                "href": "/profile/Wenhe-Lu-1"
            },
            "answer_text": "The leaders of USSR decided that they did not want to continue the dirty tradition they inherited. SO USSR was dissolved and the cold war was over. Mind you, this was the major reason. There are other reasons you can find else where. There were just enough decency left in the Russian communist leaders. You can not find any of such decency in the current Chinese communist leaders. ",
            "date": "Answered June 8, 2019",
            "views": "52",
            "upvotes": " Answer requested by Bryan Jones"
        },
        {
            "author_info": {
                "name": "Aditya Dave",
                "href": "/profile/Aditya-Dave-51"
            },
            "answer_text": "I think there are a lot of good well researched answers here and you should definitely give them a read, but what I wanna talk about is the ubiquity of Cold War. How is it that there was always a cold war going on between atleast two countries? The answer goes back to ancient times where the trade and religious beliefs were the fuel for political feuds and tensions.  Hope this helps you readers and ask any questions in the comments section if any. ",
            "date": "Answered July 13, 2019",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Guy",
                "href": "/profile/Richard-Guy-24"
            },
            "answer_text": "No it still goes on with Russia hacking US elections. ",
            "date": "Answered July 27, 2019",
            "views": "7",
            "upvotes": " Answer requested by Bryan Jones"
        },
        {
            "author_info": {
                "name": "Ankit Tripathi",
                "href": "/profile/Ankit-Tripathi-150"
            },
            "answer_text": "Watch this video[in hindi] to understand this.  ",
            "date": "Answered June 21, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "A Nordic Potato",
                "href": "/profile/A-Nordic-Potato"
            },
            "answer_text": "No ",
            "date": "Answered May 16, 2019",
            "views": "20",
            "upvotes": "0"
        }
    ]
}