{
    "title": "Has the USAAF ever shot down any USSR aircraft during WWII? - Quora",
    "tags": [
        "Soviet Union",
        "Aircraft",
        "World War II",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Boris Sanochkin",
                "href": "/profile/Boris-Sanochkin"
            },
            "answer_text": "There are two known incidents of confusion resulting in air battles between US and Soviet forces. First on November 7, 1944 near Nis, Serbia when a group of US P-38s and B-25s spotted a Soviet 6th Guards logistic convoy, mistaken for for the Germans and bombed it. The 6th suffered 30+ casualties and 20 trucks destroyed, managed to shoot down one airplane and called Air support from 866th IAP. 866th mentioned that the planes aren’t German but failed to convince the opposite side that they aren’t too resulting in one Yak-9 shot down. Then they returned fire and shot down two more US aircraft. The American group escaped but then the overwhelming group of 40 P-38 appeared. By that time both sides started to realize that something is fishy. Newly arrived P-38s managed to identify the forces as Soviet and disengage. The result was 34 KIA, 39 WIA and 20 trucks of the 6th Guards destroyed, 3 to 7 USAAF aircraft and two pilots killed, 2 Soviet aircraft and 2 pilots killed. According to multiple Yugoslav sources 7 USAAF planed were shot down: 5 P-38s and 2 B-25s and one of 866th - Yak-9. Both Soviet and US side largely downplayed the incident. According to the USAAF report 3 P-38 were lost and two pilots killed, 5 Soviet planes were shot down. According to the Soviet report 5 P-38 were shot, of them 3 crash sites identified including two KIA (lt. Coleson, lt. Brewer), cpt King found alive and handed to the American side. Soviet forces according to own report lost one Yak-9 in the incident due to the American action (lt Shypulya KIA), another Yak-9 downed by friendly fire from the logistic column (lt Krivonogikh killed). On December 14, 1944 FDR apologized for the incident, wing commander Clarence Edwinson was found responsible for the whole mess. Another incident took place in April 22,1945 over Berlin. A distinguished ace Ivan Kozhedub was performing free hunt on the Germans and spotted a crippled B-17 attacked by the German fighters. He damaged the Germans forcing them to disengage but then the B-17 gunners attacked him mistaking for the German. He managed to escape but then two P-51 escorts attacked him. He couldn’t disengage this time and had to shoot them resulting in one destroyed and another crash-landed in the Soviet-controlled territory. No other incidents like that are known. ",
            "date": "Answered August 26, 2020",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kai Zhu",
                    "user_href": "/profile/Kai-Zhu-9"
                },
                {
                    "user_id": "Vadim Dmitriev",
                    "user_href": "/profile/Vadim-Dmitriev-5"
                },
                {
                    "user_id": "Jiri Mensik",
                    "user_href": "/profile/Jiri-Mensik"
                },
                {
                    "user_id": "Joseph Scott",
                    "user_href": "/profile/Joseph-Scott-13"
                },
                {
                    "user_id": "Anton Shishkin",
                    "user_href": "/profile/Anton-Shishkin-3"
                },
                {
                    "user_id": "David B Landers",
                    "user_href": "/profile/David-B-Landers"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roy Jaruk",
                "href": "/profile/Roy-Jaruk"
            },
            "answer_text": "Not that I recall. However, I do recall that three American submarine skippers accidentally sank Soviet merchant ships in the latter half of World War II that were out of the safe passage zones the Communists and the United States agreed to north of Hokkaido. Nothing much came of this, apart from ComSubPac cussing the skippers out. I recall that one of the boats rescued the Soviet crew and took them to Dutch Harbor in Alaska as the nearest American port. The crew included several women, and when they got to Dutch they didn’t want to go home! ",
            "date": "Answered August 19, 2020",
            "views": "14",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adam Shirback",
                    "user_href": "/profile/Adam-Shirback"
                },
                {
                    "user_id": "Luke Wiley",
                    "user_href": "/profile/Luke-Wiley-10"
                },
                {
                    "user_id": "Teddy van Geemen",
                    "user_href": "/profile/Teddy-van-Geemen-1"
                },
                {
                    "user_id": "Ethan Smith",
                    "user_href": "/profile/Ethan-Smith-133"
                },
                {
                    "user_id": "Sameer Mustapha",
                    "user_href": "/profile/Sameer-Mustapha-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barrie Rodliffe",
                "href": "/profile/Barrie-Rodliffe"
            },
            "answer_text": "They may well have done so, they tried shooting down many allied aircraft. RAF pilots were briefed to be wary of anti aircraft fire, watch out for the Luftwaffe and keep a sharp look out for any USAAF fighters. 4 USAAF P 51 pilots tried to shoot down one of these.  That is right, a Spitfire Mk XI in USAAF markings. They failed and the Spitfire pilot returned to base. ",
            "date": "Answered August 19, 2020",
            "views": "881",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Scott Bricker",
                    "user_href": "/profile/Scott-Bricker-1"
                },
                {
                    "user_id": "Daisy Cutter",
                    "user_href": "/profile/Daisy-Cutter-4"
                },
                {
                    "user_id": "Johan Rossouw",
                    "user_href": "/profile/Johan-Rossouw-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Clouse",
                "href": "/profile/Robert-Clouse"
            },
            "answer_text": "As far as I know, western allied aircraft were never in combat in the same airspace as Soviet aircraft. The Soviet aircraft were designed for short range and as ground attacks, not strategic bombing. August 7, 1941 with 15 Ilyushin DB-3 bombers was the date of only strategic bombing of Berlin by the Soviet air force! ",
            "date": "Answered August 20, 2020",
            "views": "807",
            "upvotes": " Answer requested by Scott Bricker",
            "upvoters": [
                {
                    "user_id": "Antonio Luiz Musa De Noronha",
                    "user_href": "/profile/Antonio-Luiz-Musa-De-Noronha-1"
                },
                {
                    "user_id": "Jacob Pulliam",
                    "user_href": "/profile/Jacob-Pulliam-4"
                },
                {
                    "user_id": "Gary Stinson",
                    "user_href": "/profile/Gary-Stinson-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Fletcher",
                "href": "/profile/Charles-Fletcher-5"
            },
            "answer_text": "There were a few “friendly fire” incidents between US and Soviet Aircraft. There are likely more than are reported since pilots might never realize they were fighting the “wrong enemy” and if they did would be motivated to keep it quiet. Air battle over Niš - Wikipedia. ",
            "date": "Answered August 20, 2020",
            "views": "733",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/AP-Round"
                }
            ]
        },
        {
            "author_info": {
                "name": "Balázs Molnár",
                "href": "/profile/Balázs-Molnár-28"
            },
            "answer_text": "Was one case on one of the last Eirch Hartmann’s sortie when they evade both sides and USAAF and Soviet planes started to fight with each other. But I have never read about this case beyond this. ",
            "date": "Answered August 20, 2020",
            "views": "333",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Brian Vaccher",
                "href": "/profile/Brian-Vaccher"
            },
            "answer_text": "Yes late in the war a couple of incidents happened over Romania. It was a case of mistaken Identity. P38s vs Yaks and another of Mustangs vs Yaks. It could happen over Yugoslavia where both sides operated. ",
            "date": "Answered August 20, 2020",
            "views": "132",
            "upvotes": " Answer requested by Scott Bricker"
        },
        {
            "author_info": {
                "name": "Carl Stidsen",
                "href": "/profile/Carl-Stidsen"
            },
            "answer_text": "Probably , during the Shuttle Missions of 1944. Usually , the Russians shot first , supposedly misidentifying US fighters and bombers. The US fired back ",
            "date": "Answered August 21, 2020",
            "views": "578",
            "upvotes": " Answer requested by Scott Bricker"
        }
    ]
}