{
    "title": "Has Israel ever lost a battle? - Quora",
    "tags": [
        "Historic Battles",
        "Israel",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Daryl Tew",
                "href": "/profile/Daryl-Tew"
            },
            "answer_text": "I remember hearing of an important saying that pretty much sums up how Israel cannot afford to lose. \"When Israel loses a battle, she loses soldiers but still fights on. When Israel loses a war, she loses her sovereignty and a home for Jews.\" Despite what measures Israel can take to recover her image, the other Arab countries will never trust Israel as she is forever a thorn in their side.  There was a pivotal moment in history where I feel contributed to the dire present day situation where Israel is still surrounded by hostile neighbours. During the Six-Day War, also known as the June War, 1967 Arab–Israeli War, or Third Arab–Israeli War, Israel came into conflict with the neighboring states of Egypt (known at the time as the United Arab Republic), Jordan, and Syria between June 5 and 10, 1967. BackgroundRelations between Israel and its neighbours had never fully normalised following the 1948 Arab–Israeli War. In the period leading up to June 1967, tensions became dangerously heightened. The Egyptian forces began mobilising along the Israeli border in the Sinai Peninsula.  War!Israel launched a series of preemptive airstrikes against Egyptian airfields. The Egyptians were caught by surprise, and nearly the entire Egyptian air force was destroyed with few Israeli losses, giving the Israelis air superiority. Simultaneously, the Israelis launched a ground offensive into the Gaza Strip and the Sinai, which again caught the Egyptians by surprise. After some initial resistance, Egyptian leader Gamal Abdel Nasser ordered the evacuation of the Sinai. Israeli forces rushed westward in pursuit of the Egyptians, inflicted heavy losses, and conquered the Sinai. Nasser induced Syria and Jordan to begin attacks on Israel by using the initially confused situation to claim that Egypt had defeated the Israeli air strike. Israeli counterattacks resulted in the seizure of East Jerusalem as well as the West Bank from the Jordanians, while Israel's retaliation against Syria resulted in its occupation of the Golan Heights. Outcome  ​On June 11, a ceasefire was signed. Arab casualties were far heavier than those of Israel: fewer than a thousand Israelis had been killed compared to over 20,000 from the Arab forces. Israel's military success was attributed to the element of surprise, an innovative and well-executed battle plan, and the poor quality and leadership of the Arab forces. Israel seized control of the Gaza Strip and the Sinai Peninsula from Egypt, the West Bank and East Jerusalem from Jordan, and the Golan Heights from Syria. Israeli morale and international prestige was greatly increased by the outcome of the war and the area under Israeli control tripled. However, the speed and ease of Israel's victory would lead to a dangerous overconfidence within the ranks of the IDF, contributing to initial Arab successes in the subsequent 1973 Yom Kippur War. The displacement of civilian populations resulting from the war would have long-term consequences, as 300,000 Palestinians fled the West Bank and about 100,000 Syrians left the Golan to become refugees. Across the Arab world, Jewish minority communities were expelled, with refugees going to Israel or Europe. Hence, even though they won the war, my opinion is that they lost the battle- the battle of ever redeeming themselves. ",
            "date": "Answered May 2, 2016",
            "views": "521",
            "upvotes": " View 124 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ohadr Dev",
                    "user_href": "/profile/Ohadr-Dev"
                },
                {
                    "user_id": "Shlomo Sokolinski",
                    "user_href": "/profile/Shlomo-Sokolinski"
                },
                {
                    "user_id": "Mark Belmont",
                    "user_href": "/profile/Mark-Belmont"
                },
                {
                    "user_id": "Lanson Brijesh Colaco",
                    "user_href": "/profile/Lanson-Brijesh-Colaco"
                },
                {
                    "user_id": "Andrew Laughton",
                    "user_href": "/profile/Andrew-Laughton"
                },
                {
                    "user_id": "Thomas Tan",
                    "user_href": "/profile/Thomas-Tan-3"
                },
                {
                    "user_id": "Shaun Simon",
                    "user_href": "/profile/Shaun-Simon"
                },
                {
                    "user_id": "Stephen Thomas",
                    "user_href": "/profile/Stephen-Thomas-5"
                },
                {
                    "user_id": "Michael Chan",
                    "user_href": "/profile/Michael-Chan-78"
                },
                {
                    "user_id": "Shantanu Hadgekar",
                    "user_href": "/profile/Shantanu-Hadgekar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Hogan",
                "href": "/profile/Matthew-Hogan-10"
            },
            "answer_text": "Yes, the Battle of Karameh (1968), described as a “debacle” for Israel by one of the special forces troops involved. I don’t see it mentioned in any other answers though it is probably the one engagement where it can be said that most partisans of each side agree that Israel suffered a major hit, at least politically, and one of its worst operationally. And as a direct result, the Palestinian national movement successfully asserted itself on the world stage, while the military forces of an Arab nation made a very effective performance against Israel. Partisans can have their usual fun deciding whether all of that is a Good Thing or a Bad Thing, but it can be reasonably agreed that at the very very best the Israelis achieved only a pyrrhic victory, of a minor tactical nature but with an unusually large number of losses taken, and at the price of a negative regional and possibly even geopolitical shift. The long and the short of it is that Israel attempted a cross-River raid into Jordan to destroy the Palestinian guerrilla base at Karameh, run by the Fatah organization, led by the rising figure, Yasser Arafat. This was in the context of post-1967 war border raids, which recently had included a presumed Palestinian-laid mine blowing up under an Israeli school bus, which incident was cited as a cause of the raid. While the goal was to teach a lesson, destroy the base, punish terrorists, kill opponents, and capture or eliminate Arafat, in actuality a reverse lesson was taught, Arafat was not caught, and the price for destroying the base was an unexpectedly large number of Israeli casualties, including equipment and dead left on the battlefield, and Israeli units evacuating in relative disorder, and a groundswell of recruits and funding for Fatah and the PLO. The event was described by one of its Special Forces (Sayeret Matkal) participants as a “debacle”. “Both military and political decision makers responsible for the operation worked to make sure the public never knew of the debacle. Instead, in newspaper interviews and speeches, the politicians and generals made Karameh sound like a smashing success.” Battle of Karameh - Wikipedia The key ingredient in the “debacle” was the unexpected and effective intervention by the Kingdom of Jordan’s regular military. Artillery units around Karameh opened up with effective fire on the attacking Israelis. While this did not stop the take over and destruction of the camp, it slowed it down. Jordanian units closed in. Palestinians evacuated and some stayed to put up a fight. (New Palestinian bases later emerged deeper in Jordan (to be effectively removed by the Jordanians two years later in “Black September”). Jordanian positions in green.  And there was also surprisingly effective resistance, including even an early appearance of tactical suicide bombing, by the specifically Palestinian fighter resisters. And an early escape of most fighters, including Arafat, was seen as success.  Why the Jordanians fought is uncertain, it was expected or “understood” they would stay out the way. Theories abound, including spontaneous defiance of the King’s orders to stand down, to secret US endorsement of Jordanian counteraction (multiple reports of US officials leaking early news of the attack to the Jordanians exist). Or simply, there was no “understanding” and the Jordanians were prepared sufficiently well to counter-attack. US public post-battle statements were highly critical of Israel hitting disproportionately what was also a civilian refugee camp but there was also a lot of US-Israel onsite tension in the immediately previous period with Israeli raids seen as disrupting a major US-Jordan aid projectdesigned to increase Palestinian/Jordanian agricultural development in that area as a way to reduce tensions and defuse the refugee issue. The biggest negative impact for Israel was that this moment, where credit for the dead and the paraded captured Israeli equipment was given to the Palestinian fighters (fedayeen), even by Jordan, began the acceleration of regional and worldwide publicity of a specifically Palestinian national cause, identified with a popularly-supported person and political organization, Fatah. (True, the PLO was older but that was a creation of the Arab states directly with less popular involvement.)  Gideon Rafael of the Israeli Foreign Ministry of the time: \"The [Karameh] operation gave an enormous lift to Yasser Arafat's Fatah organization and irrevocably implanted the Palestine problem onto the international agenda, no longer as a humanitarian issue of homeless refugees, but as a claim to Palestinian statehood.” Volunteers and funds poured in to Fatah. It probably helped Palestinian and general Arab publicity serendipitously that the name Karameh means “Dignity” in Arabic. The Israelis involved did not celebrate it as a victory despite some post-battle claims by the government of victory. “We didn't expect the Jordanian army to fight the way it did. I don't believe that the commander of the 7th Brigade thought that so many of his tanks would be hit. I'm sure that no one thought that the enemy would respond with artillery fire. You're allowed to make a mistake in assessing a situation but, it seems to me, there was a moment when the assessment could have been altered – when we saw that things weren't turning out as we had thought and that the Jordanians weren't fleeing to Amman.” — Lt. Col. Arik Regev, Central Command Opeations.  Israelis enter Karameh —  Jordanian surveys captured Israeli equipment —  Reportedly King Hussein looking over a captured/abandoned Israeli tank after the battle ",
            "date": "Updated November 6, 2019",
            "views": "192",
            "upvotes": " View 44 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ron Man",
                    "user_href": "/profile/Ron-Man-10"
                },
                {
                    "user_id": "Saraiki",
                    "user_href": "/profile/Saraiki-2"
                },
                {
                    "user_id": "Jack Isaac",
                    "user_href": "/profile/Jack-Isaac-6"
                },
                {
                    "user_id": "Joby James",
                    "user_href": "/profile/Joby-James-23"
                },
                {
                    "user_id": "Gareth James Lewis",
                    "user_href": "/profile/Gareth-James-Lewis"
                },
                {
                    "user_id": "Guru Prasad",
                    "user_href": "/profile/Guru-Prasad-1222"
                },
                {
                    "user_id": "Selver Krasniqi",
                    "user_href": "/profile/Selver-Krasniqi"
                },
                {
                    "user_id": "Hassan Sakaba",
                    "user_href": "/profile/Hassan-Sakaba"
                },
                {
                    "user_id": "Tomi Toivio",
                    "user_href": "/profile/Tomi-Toivio-2"
                },
                {
                    "user_id": "Nick Chiu",
                    "user_href": "/profile/Nick-Chiu-4"
                },
                {
                    "user_id": "Debjyoti Bardhan",
                    "user_href": "/profile/Debjyoti-Bardhan"
                },
                {
                    "user_id": "Sameer Chaprana",
                    "user_href": "/profile/Sameer-Chaprana"
                },
                {
                    "user_id": "Samee",
                    "user_href": "/profile/Samee-3"
                },
                {
                    "user_id": "Mohamed Iqbal",
                    "user_href": "/profile/Mohamed-Iqbal-149"
                },
                {
                    "user_id": "Himanshu Agarwal",
                    "user_href": "/profile/Himanshu-Agarwal-138"
                },
                {
                    "user_id": "Alejandro Gutiérrez",
                    "user_href": "/profile/Alejandro-Gutiérrez-5"
                },
                {
                    "user_id": "Hadi Sidaoui",
                    "user_href": "/profile/Hadi-Sidaoui"
                },
                {
                    "user_id": "Abdulsamad Abdul",
                    "user_href": "/profile/Abdulsamad-Abdul"
                },
                {
                    "user_id": "Ram Dayal",
                    "user_href": "/profile/Ram-Dayal-89"
                },
                {
                    "user_id": "Onur Danacı",
                    "user_href": "/profile/Onur-Danacı-1"
                },
                {
                    "user_id": "Mohammad Matarneh",
                    "user_href": "/profile/Mohammad-Matarneh-3"
                },
                {
                    "user_id": "Hafiz Hamid",
                    "user_href": "/profile/Hafiz-Hamid-3"
                },
                {
                    "user_id": "Muralidhar Vadhiraj",
                    "user_href": "/profile/Muralidhar-Vadhiraj"
                },
                {
                    "user_id": "Antony Masefield",
                    "user_href": "/profile/Antony-Masefield"
                },
                {
                    "user_id": "Caryn Wesner-Early",
                    "user_href": "/profile/Caryn-Wesner-Early"
                },
                {
                    "user_id": "Said Sode",
                    "user_href": "/profile/Said-Sode"
                },
                {
                    "user_id": "Kartik Gupta",
                    "user_href": "/profile/Kartik-Gupta-526"
                },
                {
                    "user_id": "Sushilkumar Sompur",
                    "user_href": "/profile/Sushilkumar-Sompur"
                },
                {
                    "user_id": "Raúl Roberto Villanueva Poot",
                    "user_href": "/profile/Raúl-Roberto-Villanueva-Poot"
                },
                {
                    "user_id": "Emmanuel Ori",
                    "user_href": "/profile/Emmanuel-Ori"
                },
                {
                    "user_id": "Kai Aschwanden",
                    "user_href": "/profile/Kai-Aschwanden"
                },
                {
                    "user_id": "Abhishek Bijjahalli Puttasiddaiah",
                    "user_href": "/profile/Abhishek-Bijjahalli-Puttasiddaiah"
                },
                {
                    "user_id": "Fredy Rivera",
                    "user_href": "/profile/Fredy-Rivera-2"
                },
                {
                    "user_id": "K. M. Thimaiah",
                    "user_href": "/profile/K-M-Thimaiah"
                },
                {
                    "user_id": "Waqas Zahid",
                    "user_href": "/profile/Waqas-Zahid-3"
                },
                {
                    "user_id": "Marco Curschellas",
                    "user_href": "/profile/Marco-Curschellas"
                },
                {
                    "user_id": "Harsh Mehta",
                    "user_href": "/profile/Harsh-Mehta-11"
                },
                {
                    "user_id": "Mahdy Obeidat",
                    "user_href": "/profile/Mahdy-Obeidat"
                },
                {
                    "user_id": "Aaron Johnson",
                    "user_href": "/profile/Aaron-Johnson-155"
                },
                {
                    "user_id": "Craig Howard",
                    "user_href": "/profile/Craig-Howard-2"
                },
                {
                    "user_id": "Alexander Ribakoff",
                    "user_href": "/profile/Alexander-Ribakoff"
                },
                {
                    "user_id": "Ashmede Asgarali",
                    "user_href": "/profile/Ashmede-Asgarali"
                },
                {
                    "user_id": "Stephen Fretz",
                    "user_href": "/profile/Stephen-Fretz"
                },
                {
                    "user_id": "Nicholas David Rosen",
                    "user_href": "/profile/Nicholas-David-Rosen"
                }
            ]
        }
    ]
}