{
    "title": "Have Russians been in Siberia before the 18th Century? - Quora",
    "tags": [
        "Siberia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Olaf Simons",
                "href": "/profile/Olaf-Simons"
            },
            "answer_text": "First Question is of course: what is a Russian? The descendant of Slavs of the Rus empire - which was to some extent Scandinavian, and which is to some extent a nationalistic construct… Read: Rus' people - Wikipedia The Russian Empire that evolved in the late Middle Ages struggled to spread eastwards - and these efforts began in the the 15th century with the help of Cossacks (Cossacks - Wikipedia). Tradesmen had, of course, traveled through the era for centuries - but that is probably not what you are looking for. So basically yes: The colonisation started in the 15th century and it came in waves of different organsational structures from Cossacks, to army to state and the attempts to found Russian cities in Siberia. The chapter you are looking for will be this one - my link goes directly into the subsection “Russian exploration and settlement”: History of Siberia - Wikipedia ",
            "date": "Updated December 12, 2016",
            "views": "226",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sergey Kalmikov",
                    "user_href": "/profile/Sergey-Kalmikov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Nikov",
                "href": "/profile/Alex-Nikov-3"
            },
            "answer_text": "Yes. Just shortly enough, it was there during the era of Ivan the Terrible Russians had started to conquest Siberia at 16th century and in 18th century majority of Siberia had been incorporated into the newly Russian Empire ",
            "date": "Answered November 28, 2016",
            "views": "173",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Alexis Alejandro Bueno Norambuena",
                    "user_href": "/profile/Alexis-Alejandro-Bueno-Norambuena"
                },
                {
                    "user_id": "Sergey Kalmikov",
                    "user_href": "/profile/Sergey-Kalmikov"
                }
            ]
        }
    ]
}