{
    "title": "Have you ever been in a survival situation? What was it like? - Quora",
    "tags": [
        "Survivalism",
        "Situations",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cybela Wolff",
                "href": "/profile/Cybela-Wolff"
            },
            "answer_text": "I was in my 20’s in NYC, I lived in a walk-up on 79th St. and lived with my sister in a studio. She was dating a young brown belt guy who also owned a comedy club and therefore was friendly with many police officers in his precinct. He gave us, for protection, a can of Police Mace, a police billy club, a taser and a switch blade he’d found somewhere. I was quite grateful. The one night I was alone in our apt. I was dreaming that a man’s arm was coming in thru my window on the fire escape. I woke up scared to death and jumped out of my skin as it was not a man’s arm, it was a man’s head on his way into my studio/bedroom! About 5 ft from my pillow! I looked at my 4 weapons, chose the billy club for expedience and started slamming his head while cursing like a sailor “Come in and die Muther f…er!! Come in and F’n DIE!!!” Pow, pow pow again and again on his head. He fell back. I lived on the 4th floor. I know he went over the fire escape and I’m pretty sure he fell down 4 flights. He had 2–3 friends with him because when I shut my window (with no lock on it) I heard them screaming. THEM screaming - imagine? What was their plan for me? It was 4am. I couldn’t call the police because I just played at a nightclub (I was a saxophone player) and my little studio smelled of weed really bad. I was afraid of the police coming, seeing I had their weapons, smelling the weed all over, and then asking if I knew anything about a body flying 4 flights over the fire escape. No one ever came. No police came around asking questions either. Is it possible to have your head smashed several times and fly down 4 flights and live? Only God knows. Believe it or not I was so stoned I went right back to sleep. I figured coming into my apt. looked painful. And will just get you thrown down 4 flights … , it was unbelievable what came out of my mouth before he “fell” back! So I survived again and ended up just fine! ",
            "date": "Answered June 12, 2019",
            "views": "11",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Daughtry",
                    "user_href": "/profile/Richard-Daughtry"
                },
                {
                    "user_id": "David Pegotty",
                    "user_href": "/profile/David-Pegotty"
                },
                {
                    "user_id": "Joan Peterson",
                    "user_href": "/profile/Joan-Peterson-3"
                },
                {
                    "user_id": "Amy Batth",
                    "user_href": "/profile/Amy-Batth"
                },
                {
                    "user_id": "Veronica Walker",
                    "user_href": "/profile/Veronica-Walker-29"
                },
                {
                    "user_id": "Paisley Blackburn",
                    "user_href": "/profile/Paisley-Blackburn-1"
                },
                {
                    "user_id": "Alice Sanford",
                    "user_href": "/profile/Alice-Sanford"
                },
                {
                    "user_id": "Reilly Dundon",
                    "user_href": "/profile/Reilly-Dundon"
                },
                {
                    "user_id": "Tim Bianchini",
                    "user_href": "/profile/Tim-Bianchini-1"
                },
                {
                    "user_id": "Nicole Baioretto",
                    "user_href": "/profile/Nicole-Baioretto"
                },
                {
                    "user_id": "James Johnson",
                    "user_href": "/profile/James-Johnson-682"
                },
                {
                    "user_id": "Skip Byrd",
                    "user_href": "/profile/Skip-Byrd"
                },
                {
                    "user_id": "Sandra Mullinnix",
                    "user_href": "/profile/Sandra-Mullinnix"
                },
                {
                    "user_id": "Sumner Callahan",
                    "user_href": "/profile/Sumner-Callahan"
                },
                {
                    "user_id": "Karen Hunniford",
                    "user_href": "/profile/Karen-Hunniford"
                },
                {
                    "user_id": "Rene Rockwell",
                    "user_href": "/profile/Rene-Rockwell"
                },
                {
                    "user_id": "Sameer",
                    "user_href": "/profile/Sameer-653"
                },
                {
                    "user_id": "Misty Stuart",
                    "user_href": "/profile/Misty-Stuart-1"
                },
                {
                    "user_id": "Stacy Sawastuk",
                    "user_href": "/profile/Stacy-Sawastuk"
                },
                {
                    "user_id": "Stuart Stremmelaar",
                    "user_href": "/profile/Stuart-Stremmelaar"
                },
                {
                    "user_id": "Evelyn Casto",
                    "user_href": "/profile/Evelyn-Casto"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Wolfe",
                "href": "/profile/David-Wolfe-37"
            },
            "answer_text": "While most survival situations are not a lot of fun, I did experience one that was. I was once stranded on an island in southeast Alaska when our commercial fishing boat burned and sank. It was absolutely a wonderful adventure for me as I was in my twenties! Our coastal island was bountiful. We hunted, gathered and built a ridiculously good shelter Because it did rain a lot. We obtained so much food that we started preserving and building up stores of it for leaner times possibly ahead in the winter. I even started tanning skins for future use. (A childhood hobby of mine) While I was sRory my captain lost so much money in this disaster, when I was rescued 14 days later I was kind of sad to leave our camp because going back to civilization meant finding a different job and facing other responsibilities like returning to college in the fall! I had fully hoped to live there throughout the Alaskan autumn and winter savoring the unexpected adventure and challenge. At that age we thought we were bullet proof. I didn't realize I was the very stereotype of a healthy young ignorant male. I don't think I ever even considered sickness or death as a serious option at that age. Most survival situations, however, are fraught with worry. That one was NOT! On the flipside of things to make this observation pertinent I will relate quite anther survival scenario I got myself into. I jumped at the chance to help sail a 40 foot boat from Cabo San Lucas, Mexico to The Marquesas islands of the South Pacific. Half way into our voyage, we lost all electrical generation when we lost our engine. (Long story-back ups did not work and I didn't think to check to see if back up options PROPERLY before agreeing to come on this trip) This was before wind and solar power became so common and this boat did not have either. GPS was in its infancy Butt I naively trusted it. Our GPS unit was the size of a suitcase and took a lot of time and power to get a location. All batteries were used up in no time. In those days there were only three satellites and it took a long time to get a fix. We were reduced to only sail power and the use of a sextant. Historically people have crossed oceans in this manner but I was sure that Christopher Columbus had a better grasp of dead reckoning and the use of the sextant that I did, When I learned how to use one I never dreamed my life would depend on it And I couldnt say that I EVER tested myself after I initially learned to use it in a fairly crash course with a friend. I reread the book that came with my plastic sextant with earnest. I spent too many days than I would like to remember bobbing around the equator (little wind in the doldrums) worrying over maritime charts trying to make the decision of continuing on to the very small island destination or try to head for a larger land mass with less favorable trade winds to contend with a finite supply of food and water on board. It weighed HEAVILY on my mind that if I missed the small archipelago of islands I was heading for, there was a chance I could continue sailing on towards open water possibly dying of thirst or starvation. I had agreed to be the navigator for our trip not truely comprehending the gravity that I was agreeing to be responsible for my life but I was responsible for other people As well! I was at the \"it wont ever happen me” stage of life. I figured how tough could that job be with a satellite navigator! Ignorance is bliss. How many people board a small private aircraft without knowing how good of a pilot they are flying with? My penance for this initial cavalier attitude was MANY hours studying ocean current charts and making meticulous notes regarding our progress to aid me in dead reckoning. I took shots (measurments) of the sun as often as I could (I didn't know how to shoot the stars) and prayed my mechanical clock was giving me close to Greenwich MeanTime for my calculations with the sextant. No ships ever came into sight, but never the less I worried about a large vessel simply running us over if one appeared at night on a collision course And we didn't have enough wind to move our boat out of their way. With no power we had no marker lights on our vessel. The Radios were useless without electricity and the only way I might get a large ships attention at night was with signal flares or fire. Flashlight batteries were used up (pre LED) and we were reduced to using a candle lantern at our binnicle (compass) during the night. After my experience in Alaska trying vainly to fight a fire aboard a boat I took anything requiring flame very serious. I had plentry of time at night while on watch to well imagine a deckhand in the wheelhouse of a large ship not paying attention to what was out there in the blackness. I imagined them dozing off or breaking the monotony of the night by reading a magazine. I imagined them having the alarm set on their radar with the sensitivity turned way down to reduce false positive signals. Who the heck runs without lights in the middle of the Pacific Ocean anyway? Fiberglass sailboats don't show up on radar that well on a good day. I learned one should better be careful when they wish for adventure for sometimes they get it. I got more of it then I bargained for on that voyage. I am alive to tell you about it here on quora so you know things ended well. Sometimes the world takes care of its fools. When we hit landfall we literally almost did hit it! It was on an inky black night because of an overcast of clouds, we kept from piling our boat right into the volcanic rocks of the island ( Fatu Hiva-neighbor to our destination) by the welcome sound of the breakers off the rock cliffs of the island! Way too close for comfort! Had this not happened and we missed the island we may have sailed past the archipelago of islands and off into oblivion that night. If that island was an atoll such as the nearby Tuamoto archipelago, we most likely would have wrecked on the reef before even hearing any breakers. What a relief it was to find land! In something the size of the Pacific ocean, a sailboat is a mighty slow form transportation and because of this fact it gave us/me plenty of time to worry. I tried to act fairly confident as though I had a reasonable idea of where I was so others did not worry so much but I was given far too much time to second guess and doubt myself. Moral of these stories? There are too many to list. Let's just say it is a good thing that some young people who never really think bad things will happen to them (seeking adrenaline/ adventure or not) live through this stage of life or we wouldn't survive very long as a species! ",
            "date": "Answered March 29, 2017",
            "views": "132",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rafael Winner Seganfredo",
                    "user_href": "/profile/Rafael-Winner-Seganfredo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Ebert",
                "href": "/profile/Andrew-Ebert-6"
            },
            "answer_text": "Define survival situation. Like a situation where you have to defend yourself, where you're lost or stuck in the wilderness? I've been through all 3 but I'm not sure which you want. ",
            "date": "Answered March 10, 2017",
            "views": "79",
            "upvotes": "0"
        }
    ]
}