{
    "title": "Historian Will Durant wrote that wars, famines and epidemics are Nature's way to keep the world population in check. Is that statement still correct? - Quora",
    "tags": [
        "Will & Ariel Durant",
        "Populations",
        "Demographics",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carla Berlusconi",
                "href": "/profile/Carla-Berlusconi"
            },
            "answer_text": "Well I would agree that wars at least definitely do seem to control populations and they are ruthlessly effective. Wars are horrific and extreme examples of cruelty and violence unequalled in the animal kingdom. Human beings have taken violence against their own kind to a whole new level. High levels of violence sadly seem to be hardwired into our DNA in exactly the same as creativity, communication and intelligence. We will use extreme aggression against anything or any group that challenges access to our own or desired resources. The facts are all there, our history shows us that this is the case, we just can’t help ourselves. Wars are triggered by various factors which we may only half understand but they definitely do cut population numbers. We all hope and pray it will be different in the future but it never is. This sounds overly pessimistic but I am simply painting a picture of homo sapiens in the 21st century with thousands of years of documented warfare behind us. High population densities seem to be a trigger and both world wars were centred around Europe which is relatively densely populated. Carla Berlusconi's answer to Why don't humans have population control? Wars are unfortunately a ‘normal’ part of being a member of the homo sapiens family. The fact that we try and fail to prevent them time after time tells us that this is true. It only seems to take one despot and times of hardship to trigger an extreme response just take a look at the history books. Even though there may not have been a war on American soil since WW2 the USA has been involved in many many wars to protect its ‘resources’ overseas. Wars are rarer where there are small hunting gathering societies who meet occasionally but flare ups do happen when resources become scarse and that is in a sense a population ontrol mechanism. There simply isn’t enough to go around. So yes wars do cull populations as a way of protecting or gaining resources. There is always a war going on somewhere every single day. If we recognise and acknowledge that this is true instead of pretending it just some abberation and not normal and really we are just angelic expressions of good ness in the world then we can try and finally do something about it. ",
            "date": "Answered January 10, 2017",
            "views": "299",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gary Ow",
                    "user_href": "/profile/Gary-Ow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harvey Ardman",
                "href": "/profile/Harvey-Ardman-1"
            },
            "answer_text": "It never was correct. This was the Malthusian idea that Earth can only support so many people and if you get too many, they die off in one way or another. The problem with this is that our ability to feed, cloth and house ourselves is growing even faster than our number. We don’t yet have a single colony on any planet or moon and there’s a whole universe out there just waiting for us. ",
            "date": "Answered January 10, 2017",
            "views": "82",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Wu",
                "href": "/profile/Adam-Wu-3"
            },
            "answer_text": "As a historian Will Durant has about as much expertise and credibility writing about “nature’s way” as I, a physician, might have writing about basketball. The statement was never correct, except as metaphor. ",
            "date": "Answered January 10, 2017",
            "views": "189",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ishita Roy",
                    "user_href": "/profile/Ishita-Roy-9"
                },
                {
                    "user_id": "Daniel Super",
                    "user_href": "/profile/Daniel-Super"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        }
    ]
}