{
    "title": "How did the media change over time? - Quora",
    "tags": [
        "Mass Media",
        "Commercial Media",
        "Media",
        "Newspapers",
        "Journalism",
        "World History",
        "Social Media",
        "History",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Rosenblum",
                "href": "/profile/Michael-Rosenblum"
            },
            "answer_text": "Gutenberg invented the printing press in 1450 and discovered that he could make money selling bibles, and later other kinds of mostly religious publications. Martin Luther grabbed the tech in 1537 and published a lot of Protestant pamphlets and books, making a small fortune as well, and also turning over the Christian world. Newspapers don't really arrive until the 17th century, and they are also made for a profit. Lots of opinions, lots of ‘fake news’. In the US, the newspaper business is a gold mine, and also a source of lots and lots of ‘fake news’ -see Pulitzer, Hearst, McCormick, etc… The advent of radio, courtesy of David Sarnoff in the 1920s, adds a whole new dimension to news as a money making business, but it does not really start to take off until TV in the 1950s. The arrival of the web, of course, only magnifies this once more and Facebook, Twitter etc.. make The NY Times look like your corner candy story. Media is a child of technology and it’s a money making business first, second and third. And last. ",
            "date": "Answered August 3, 2019",
            "views": "534",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chaudhry Mansur Khan",
                "href": "/profile/Chaudhry-Mansur-Khan"
            },
            "answer_text": "When a 30 second can impact the thinking of millions across the globe, then instead of rational, responsible people Who are answerable to some human, or institutions become insignificant. Society is on the fast lane to make a living,Instead of old times,they read less, think less, and depend too much for their awareness on media. Thus societal over dependence on media has empowered media beyond government control. Media houses now control elections and decide which bills be passed and which be thrown away. Media even decides what is good food and what is good for us.Thus over time, a institution created to in service people and become powerful and decider in chief in our countries. ",
            "date": "Answered April 24, 2020",
            "views": "265",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chandra Shekhar",
                "href": "/profile/Chandra-Shekhar-734"
            },
            "answer_text": "As the generation have evolved over the years, technology has made it easier for people to access the media in many different ways such as television, internet and newspapers etc.  Over the past few generation media has shifted from newspapers to the television.  Now day media has more versatile and very fast growing. Any news today very fast viral with in limited time with the help of social media and television media ",
            "date": "Answered July 15, 2019",
            "views": "246",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Neha Jha",
                    "user_href": "/profile/नेहा-झा-Neha-Jha"
                }
            ]
        }
    ]
}