{
    "title": "How did navigation develop in the ancient world? ‏‎ - Quora",
    "tags": [
        "Navigation Systems",
        "Navigation",
        "Ancient Civilizations",
        "Ancient History",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Deakin",
                "href": "/profile/Nick-Deakin-4"
            },
            "answer_text": "Ok, this is a complex story to tell and unfortunately somewhat patchy. Some stepping stones: A long, long time ago in a land far away, a system of a cardinal direction emerged… In Assyria, ca. 9,000BCE and confirmed at Göbekli Tepe - Wikipedia, ca. 7,500 BCE. We can see Draco (constellation) North on the first piece and Mother Earth in the second, top of the stone in both cases (upheld hands is associated in later iconography with Earth looking up to Draco or the polestar, the same underlying concept). Water and a fishing trident to the West (sea), and herds to the South (which would become the master of animals) and a snake to the East (an animal that could not be closer to the ground - inferring land to the East in these locations). These are two of the first stone stela to record ideas (there not in themselves writing). It is interesting that the first belief system may have a practical purpose rather than a spiritual one to assist in navigating and timekeeping, the cardinal directions seem to be associated with Solstice (Sun highest and lowest in the Sky at mid-day) and Equinox (equal length of Night associated with Mother Earth and North, and Day associated with her Son/Sun). Interesting the so-called bird-man seems to become the master of animals or Apollo, having many different names in later civilisations, the Sun/Son.    N.B. the so-called bird-man, seems to imply South, the cross on the neck and the largest Sun at mid-day being south. Interesting the hashed background seems to be the number of days in a year, which suggest an early interest and study of astronomy! These become deities over time, they are associated with seasons of the year and time of day, sunrise to East and the sunset in the West (longitude) and the main axis is from Mother to Son, North to South or in time latitude. I have never seen any early iconography where they get the rotationality incorrect for the entwined snakes, they seem to mean (main) axis North-South. A possible early form of trigonometry (sine and cosine) for orbital calculation, appears in the British Isles, 3,200BCE. Note the regularity of the marking on the circumference and the verticle and horizontal axis. In this way, an angle of incident (e.g. sunlight or a reference star) could be expressed as a fraction of opposite and adjacent. These are better known as Sine and Cosine and it is a non-linear relationship, they are particularly useful for performing orbital related calculations for timekeeping and to establish latitude. In any event, Plimpton 322 - Wikipedia articulates trigonometry tables by 1600BCE. These devices are likely multifunctional, the gold sun disc makes a reflection on the ground and casts a shadow behind (North), a possible explanation for the small apertures is to accommodate a thread to the ground, in this way you can check the level of the ground. When the reflection is of an equal distance to the thread and the length of the shadow gives time of day as a length, however, this changes over the year which the device itself can assist with to make compensation. These devices may have also been used for signalling (even though relatively small, a signal could be observed from a distance of around 5kms away).  An orbital calculator, Crete, 1700BCE. Note the same device as above is included. This device also shows many of the orbital periods of the Antikythera mechanism.  A very early sextant, called a Labyrs (double axe) is found Crete from around 2000BCE in huge quantities (critically with technology transfer to Phoenicia that picked up maritime trade after bronze age collapse). Interestingly the Minoans seem to use Ophiuchus: Facts about the Snake Bearer (her elbow) rather than Orion belt for navigation, both are about the equatorial plan and measuring the angle from the horizon to them allows latitude at sea to be determined.  The more sophisticated jacobs staff is ‘invented’ later, thought to be first used around 400BCE.  Natural birds may have been used, to establish longitude, when caged they have a propensity to face towards their homeport, in this way longitude can be estimated before the much later marine chronometer, longitude is hard. More generally, hunting birds are associated with the West and Doves East in early accounts and iconography (artwork). You can also see that Phoenicians use double axe as markers to references (star constellation in this case), the Minoans also use this symbol on buildings where shadows fall at solstice for example.   Before Labrys, notched staff seem to held at arm's length and the distance from the horizon to a reference-counted on the notches. The very first silver mines being on Sardinia and more generally are considered to be some of the earliest marines that setup colonies and trading ports eastward throughout the Mediterranean. They are related to Minoans according to the DNA.  Minoan seal.  You can call her Athena if you like, but the Minoans would call her the Mistress of Animals. More instrumentation and measurement!  Lodestones (leading stones or compass) are accredited to the Dactyl (mythology) - Wikipedia (fingers) from Mount Ida, Crete. Magnetite being available from Skyros, but I do note that Nebra sky disk - Wikipedia is using Minoan fractions to express magnetic declination using the lost rivets on the edge at the German site where magnetite is also available! Minoans would go to the end of the earth to find metal, a compass assists in finding iron deposits, iron is more valuable by weight than gold in the Bronze age! The Dactyls also accredited with the first iron forges. Minoan buildings being aligned to magnetic North from around 1800BCE, they record this as there is a large change in the magnetic field that will have affected their instruments around 1600BCE. There is a single example of a land base compass, showing the magnetic declination to true North using fractional angles (1/total).  The association of the Dactyls and Minoan priestess (bees) which rear Zeus in the caves is interesting in this regard, as Zeus has lightning bolts and you need lightning to magnetise iron for lodestone compass! Lightning translates as ‘star axe’, you can pretty much use axe interchangeably with angle. The Priestess manned peak sanctuaries on mountain tops as shown in the master seal above and likely have many duties, that possible include: observing the coastal approaches (noting all Minoan ships over 10 oars are white, so a foreign vessels in their territorial waters is easy to identify, potential communication using huge labrys that are mirrors, there is line-of-sight between peak sanctuaries and keeping fires at night that could have been used as by local mariners in the Cyclades to navigate to ports. Priestess may have observed where lightning strikes that is a potential site to explore for the MOST valuable resource of the age, lodestones. The only one trusted with Zeus lightning is the Mistress (Athena), which may mean this duty feel to the Priestess of the Mistress (Potnia Theron - the moon).   The minimal observable distance between peak sanctuaries are shown below (on a clear night) and fires will likely have assisted to guide mariners to home parts using their absolute reference positions (a lot of smaller ships, e.g. those of less than ten oars will have found this useful). If your thinking did these people have a C4ISTAR system up and running before 1628BCE, then all I can say is maybe, Minos (the ruler), is accredited with having the worlds first Navy.  Anemometer to establish crosswind, direction and magnitude, shown on the Thera flotilla fresco, note the wispy appendage on the captain's cabin (simple threads), various shaped veins suspended on wires on the ships bow that deflect under loading and what appear to be bells to give the crew (facing backwards an audible indication of wind intensity). Floats and line deployed from the rear of the ship to establish surface speed and currents, all things that can affect passage appear to be considered. The inference of Poseidon's laws is to NOT guess, but to measure, the lives of the passengers and crew depend on the navigator's ability to do so for high-sea voyages!  How good are these early navigational instruments? Well, it is generally accepted that Minoans regularly undertook trade across the Mediterranean to Egypt and Phoenicia. Tin is coming into the region from Iberia and Cornwall to make bronze which is powering this economy, Ivory and timber from Africa, copper from Cyprus to the East, silk from China, Lapis Lazuli from Afganistan through Phoenician ports. Three continents are connected in trade before the bronze age collapse, maritime trade is brisk and over some considerable distance. The Phoenicians went as far as Cornwall for Tin but so it would appear did the Minoans. Casting stones for Labyrs are found in Cumbria, Linear A found in a Scandinavian silver mine! This ringseal is telling. The Minoans use the same system of cardinal direction shown in the stone seals from prehistory shown above. In this case, the Sun (south) is shown highest in the sky and Mother Earth on her dragon boat is (at sea-level — but referring to North) so are vertically flipped in this case. Potnia Theron (the Mistress) is shown to the West and a minor deity Britomatis is shown floating above her. As in West to the Pillars (the straits of Gibraltar) and around the coast to the secret source of the Tin, Britomatis is known as Brigit in the British Isles and this is the earliest known use of the place name I’m aware of! There are very early Greek accounts of those from Hyperboria being invited to a festival on Delos (which is the destination in the above fresco), they did not return home on one occasion, so thereafter sent gift by exchange through neighbouring ports that passed them on to adjacent ports all the way to Delos, that implies an established trade network existed at this time. Note, the trident symbol used on the Draco boat, this is shown on the very first seal, this system of cardinal direction has endured for five millennia by oral tradition. I note the use of triskelion is common amongst the islands (all of them) that likely traded together, the islands have the advantage that they cannot be casually raided.  There is very little innovation for another three thousand years in navigational instrumentation! One can argue a case that everything including Lens existed in Minoan times and the astronomical and understanding of nature (physics) is comparable to the time of Newton, put plainly, not much technical development on navigation happens until around this time! John Harrison made this under the Royal Navy longitudinal prize. H1 shown and undertook sea trials in 1736. All the best navigational stuff comes from the islands, and Yorkshire!  Rockets were invented around 1100, but it took until 1978 to launch Navstar, a Global Position System with accurate timing devices, so an absolute position can be established anywhere on the planet with now handheld devices, which bring us up to date.  There are Defence Laboratories (on the islands) that are now developing quantum navigation that is not reliant on GPS satellites, which can occasionally be interrupted in solar storms. Interesting this was exploited by the first Mariners! We now know that birds exploit this quantum effect (like the two-slit experiment at school), cover one eye and Birds lose their natural ability to hone, the science behind this will not have been understood but birds natural ability to navigate is being exploited early on. ",
            "date": "Updated August 25, 2019",
            "views": "274",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Clark",
                    "user_href": "/profile/Jack-Clark-119"
                },
                {
                    "user_id": "Petr Titera",
                    "user_href": "/profile/Petr-Titera-1"
                },
                {
                    "user_id": "Gail Harry",
                    "user_href": "/profile/Gail-Harry"
                },
                {
                    "user_id": "Diane Sanders",
                    "user_href": "/profile/Diane-Sanders-27"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Colleen Anne Coyle",
                    "user_href": "/profile/Colleen-Anne-Coyle"
                },
                {
                    "user_id": "Paul Harrison",
                    "user_href": "/profile/Paul-Harrison-69"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc S. White",
                "href": "/profile/Marc-S-White"
            },
            "answer_text": "Take Sumeria It was a combination of location & observation of nature, insatiable curiosity for the night sky which led to astronomical navigation, engineering acumen i.e. irrigating to bolster development of agriculture emerging in the fertile crescent- then figuring out a way to use the rivers for transportation. Their early water worthy crafts were circular made from reeds then water proofed w/bitumen pitch which occured naturally in pools. At the same time cultures in the Mediterranean/Black sea /Asia learned about sails from kites which made open sea travel possible. ",
            "date": "Answered August 18, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Diane Sanders",
                    "user_href": "/profile/Diane-Sanders-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stratton Wayne St Clair",
                "href": "/profile/Stratton-Wayne-St-Clair"
            },
            "answer_text": "Navigation goes back past the last ice age and the old stone age. Up until the 19th century, it was the easiest and most effective way to travel. Overland was always more difficult before then with country roads at best and dense woodland and mountains. One of the theories about the colonizing of the Americas around 18,000 to 16,000 years ago is we skirted the ice via intercoastal waterways and it’s certainly plausible. We made it to Australia around 40,000 BCE and we made it as far as Easter island with little more than dugouts. ",
            "date": "Updated August 20, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Diane Sanders",
                    "user_href": "/profile/Diane-Sanders-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ferenc Nagy",
                "href": "/profile/Ferenc-Nagy-13"
            },
            "answer_text": "The captains did not dare to sail far from the shores. They navigated by the known objects on the seaside seen from the board. ",
            "date": "Answered August 18, 2019",
            "views": "6",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Diane Sanders",
                    "user_href": "/profile/Diane-Sanders-27"
                }
            ]
        }
    ]
}