{
    "title": "How to integrate my shadow - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Zeb Mattey",
                "href": "/profile/Zeb-Mattey"
            },
            "answer_text": "Anyone who answers this has probably got the secret to life itself! But I can tell you how I think Jung may have answered it, and how that answer would’ve changed over his life. Jung’s greatest period of illumination was after his break with Freud, when he was in his 40s, and most importantly, when he started to write Liber Novus, his red book. This book is an illumination of his own psyche, a dive into his own casket of archetypes, old submerged material, and of course the shadow. Most of Jung’s great works, at least the books that are taught about today and read widely, were written after the red book, and Jung writes in his essay ‘The Transcendent Function’ that most of the material for his later works came within this period of two years of intense visualisation and self analysis, which he partially recounts in Liber Novus, including his understanding of The Shadow archetype, of course. Jung takes great pains to remind us that when going through analytic work we must above all live. For instance, he admits the most important thing he had to do during his red book episode was to stay grounded, that is, committed to his family, spending time with his wife, doing manual work, in essence, to grow in all the normal ways a human might and to overcome challenges in everyday life. This Jung reveals is as important for integration as any analytic approach, and this becomes, in my eyes, more and more evident as he gets older. Jung spent a considerable portion of his later years constructing Bolingden, a stone house and tower. Because he saw how important action was to the psyche, for instance his reason for constructing Bolingden, or at least a motivation for it, was that during his breakdown after discarding his relationship with Freud Jung was frantically looking for something to light his inner spark, and he found playing with blocks as he did when a young boy somehow worked - ‘there was life in there still’, this is well explored in Claire Dunne’s biography of Jung. I suppose you get what I’m saying, Jung more and more urged his patients, and himself it seems, to take action in the real world based on analysis. To seek most of all to live, not to analyse. It’s part of the reason why he’s so well loved today, Jung wasn’t a stuffy psychoanalyst who spent his life perched beside a bookshelf, he was a vibrantly alive human being, and his methods are designed to guide others to that end. I mention this in relation to the Shadow because it’s so rarely mentioned in texts I’ve read, including the most well read ‘Meeting your Shadow’. We are meant to meet our shadow in the world, not in a boxed up room, and we learn to deal with it there. Analysis is just a tool to help you recognise where it’s popping up, the integration always happens within relationship and activity, it cannot happen without these things. It’s a subtle point, but an important one, it’s easy to find Jung and lock ones self up with his books and attempt a kind of inner remodeling project, but this would be going quite against what he recommended to his own patients, and how he conducted his own life. ",
            "date": "Answered April 19, 2019",
            "views": "351",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mike Tilley",
                    "user_href": "/profile/Mike-Tilley-16"
                },
                {
                    "user_id": "Sigbjørn Austefjord",
                    "user_href": "/profile/Sigbjørn-Austefjord"
                },
                {
                    "user_id": "Shad Azmi",
                    "user_href": "/profile/Shad-Azmi-1"
                },
                {
                    "user_id": "László Mester",
                    "user_href": "/profile/László-Mester"
                },
                {
                    "user_id": "Kiersten Pressfield",
                    "user_href": "/profile/Kiersten-Pressfield"
                },
                {
                    "user_id": "Martin Hauser",
                    "user_href": "/profile/Martin-Hauser"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Krausz",
                "href": "/profile/Eric-Krausz-2"
            },
            "answer_text": "Everyone must admit they have a dark side. The safest way to channel negative energy is to be fully aware of it. I know that I have had thoughts of extreme vengeance. I know I can be quite aggressive. I see my intolerant streak quite often. I hold up these traits in the light of day and make sure that these ideas and urges do not interfere with having a productive life. I integrate these feelings by directing them at people who cause harm to others. But I don’t simply direct rage at others. I also accept that they have a dark side. In a way, I have to feel some sympathy for those who cannot control their darkness. They ruin their own lives in addition to others’ lives. Once you understand that you are capable of evil you can catch yourself before doing something you regret. Most of my competitive nature is channeled into being a good worker. I fully realize that my extreme competence at work means that I get someone else’s raise. But that is perfectly fair. We all compete at work. I am doing good for myself and my company. I direct some of my aggression in my political thought. I have strong opinions on policies that I believe are evil. I resist those policies. The worst thing someone can do it completely ignore, suppress, rationalize, or deny one’s aggressive thoughts. The rage will express itself in unexpected and much more harmful ways than it would for a self-aware person. ",
            "date": "Answered August 18, 2019",
            "views": "115",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Crystal Dunasemant",
                    "user_href": "/profile/Crystal-Dunasemant-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John M. Switlik",
                "href": "/profile/John-M-Switlik"
            },
            "answer_text": "I did not and do not. I know and respect psychether. That explains the whole bit, albeit we have yet to establish a means to do this in a public sense. How did I get to such an operational frame of being? It is a long story, being told slowly. But, first, so everyone knows. This is not a bad description of affairs: Shadow (psychology). The context that motivates us might be the ‘assimilation’ part. As in, it is evident that we are more than we know. There is really no good explanation for our consciousness that is universal. Can there be one? And, given that we are conscious, it follows things that are outside of the consciousness. Why else any motivation for learning? But, are there things that we cannot know? You might say, this situation is an inverse of AI. Right now, I see no one pondering the limits of AI; rather, there is a lot of running amok. In fact, it is this gaga aspect that raises concern in the minds of some. I say that we will know the limits of AI as we (try to) understand the psychether. That would mean exploring humankind in new ways. Not probing (nor the proverbial pulling wings off of flies or other questionable schemes proposed, and done, under the name of psychology). But, we have a quandary. There was a point where people were putting ‘theoretical’ in front of some discipline and making a new viewpoint. Many times, this is interesting. It allows question of ‘why’ to come to fore. But, take the psychology variant of this, please: Theoretical psychology. There’s no mention of Jung. Following the link to the associated periodical (Journal of Theoretical and Philosophical Psychology), one sees that there has been an ongoing debate, including some references to topics such as psychology needing ‘a’ theology ;>). Seems little progress has taken place, even when this is so obvious. Methinks that we ought to hope that AI seduces a whole lot of people and gets us into terrible binds. Then, the real talents of humankind will have some opportunity to arise and show their power. But, why do we have to learn the hard way? ",
            "date": "Answered August 3, 2019",
            "views": "118",
            "upvotes": " Answer requested by Brenton Cherry and Matt R-B",
            "upvoters": [
                {
                    "user_id": "Shad Azmi",
                    "user_href": "/profile/Shad-Azmi-1"
                },
                {
                    "user_id": "Terry Constanti",
                    "user_href": "/profile/Terry-Constanti-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leah Francis",
                "href": "/profile/Leah-Francis-42"
            },
            "answer_text": "Try not to be indifferent. The best route is to accept these parts of yourself. Allow them to co exist and realize they are just as much who you are then the none shadow pieces you so beautifully display. The acceptance can begin the intertwining to eventually arrive at a WHOLE you, the good and the bad. Life is about balance. Trust yourself and begin to experience all you are. No one is judging you but you. Try to be kind to yourself and all your working pieces. I can tell you, its okay! You're okay! And once you accept that too, you can get closer to really understanding, being and knowing who you are. ",
            "date": "Answered January 16, 2020",
            "views": "73",
            "upvotes": " Not for Reproduction",
            "upvoters": [
                {
                    "user_id": "Brenton Cherry",
                    "user_href": "/profile/Brenton-Cherry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Heinowski",
                "href": "/profile/Paul-Heinowski"
            },
            "answer_text": "I have to take “you” literally, because I have studied Jung purely for my own edification and enjoyment. I integrate my shadow largely by making use of my own cynicism. When you meet someone who you feel is too good to be true, you sense negativities under the veneer of their personality. These negativities are usually the direct opposite of the surface characteristics. You find yourself wondering if that nice, warm, caring person will be the same in a crisis. Would they maybe turn on you, or betray you to your enemies. Eventually you learn how to turn this cynicism inwards and apply it to yourself. This is basically how I do it, but I personally believe there is also a good Shadow that we need to make friends with. I believe we suppress some of our noble characteristics, probably through what they call “false modesty”. This is the whole area of low self esteem, about which much has already been written. ",
            "date": "Answered April 19, 2019",
            "views": "177",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brenton Cherry",
                    "user_href": "/profile/Brenton-Cherry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Wood",
                "href": "/profile/Charles-Wood-68"
            },
            "answer_text": "By confessing that it already is incorporated in you. As Jung said in the quote I gave in the answer to your similar question “Christianity has show us the way, but, as the facts bear witness, it has not penetrated deeply enough below the surface. “ It’s only by confession that one’s heart may open to one’s self, and then ideally, to others. ",
            "date": "Answered August 2, 2019",
            "views": "92",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Brian Baulsom",
                "href": "/profile/Brian-Baulsom"
            },
            "answer_text": "I have answered similar questions here :- Brian Baulsom's answer to According to Jungian psychology, what is the best way to go about developing and integrating the shadow? Brian Baulsom's answer to What did Carl Jung mean when he said, \"In filth it shall be found\"? Brian Baulsom's answer to From a Jungian perspective, what was your experience like when you witnessed your shadow? Brian Baulsom's answer to What exactly did Carl Jung mean when he described Hitler as the shadow of the German people? ",
            "date": "Answered April 19, 2019",
            "views": "113",
            "upvotes": " Answer requested by Matt R-B"
        },
        {
            "author_info": {
                "name": "Terry Constanti",
                "href": "/profile/Terry-Constanti-1"
            },
            "answer_text": "Thanks for your A2A. I only recently answered a similar question here. Terry Constanti's answer to From a Jungian perspective, does incorporating your shadow just mean being honest with yourself? Or is it more complicated than that? Further, it is about acting on what is revealed about your shadow, it’s finding ways to “exercise” it in life, to give it the right time and place to express itself rather than shutting it out. ",
            "date": "Answered August 2, 2019",
            "views": "96",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Kemi Sogunle",
                "href": "/profile/Kemi-Sogunle"
            },
            "answer_text": "Your shadow-self is a mirage/illusion of your true self. Your focus should be on finding your true self and living your best life. Integrating your shadow-self will make you create a false persona that you live as and will make you lose yourself than find your true essence. ",
            "date": "Answered January 15, 2020",
            "views": "30",
            "upvotes": "0"
        }
    ]
}