{
    "title": "How did the 70s and 80s feel to live through compared to today? What was life like then and how was it the same or different from 2018? - Quora",
    "tags": [
        "1970s"
    ],
    "response": [
        {
            "author_info": {
                "name": "Douglas Dea",
                "href": "/profile/Douglas-Dea"
            },
            "answer_text": "Question: “How did the 70s and 80s feel to live through compared to today? What was life like then and how was it the same or different from 2018?” I was born in 1967 so I was mostly a kid in the 70s and a teenager in the 80s. Hard to compare the time period with the present. I’ll point out these details though: When a movie came out I had two choices. A. See it in the theater. B. Wait a year or two for it to be shown on TV. The movie would be shown once as a “special event” such as “NBC Movie of the Week” on Friday or Saturday night. It would have commercials and naughty words and bits would be edited out. After that the movie might go to an off-brand channel (38, 56) and play a few times. That was the 70s. In the 80s there were video stores where one could go and rent the movie a few months after it left the theater. VCR tapes were okay, but not the high quality we expect today. Today when a movie leaves the theater it is almost immediately available on DVD in the library. (I’ve seen a movie still playing at the theater and at the library on the same day.) Soon it will be on Netflix or Amazon. Of course, unedited and no commercials. A person has more options and doesn’t wait long for any movie. Sticking with the theme of movies, any information about the movie or actor or director had to be found in magazines or books, a long and laborious project. Today we have IMDb and thus can find just about anything we want quickly and easily. Not to mention dozens of other websites. In the 70s my parents were deathly afraid that if I used the phone I’d make a long distance phone call (which meant the neighboring town) and run up a large phone bill, a huge sin. There was one phone in the house, it was on the wall and in the earliest days had a rotary dial. (It was a big deal when we got push button.) Today everyone has a phone or you can use Skype to contact a person anywhere in the world, for free, with video. No more long distance fears. I can’t express what a huge change that is in just 40 years. Life in the 70s and 80s seemed fast enough, but slow compared to 2018. There was no “24 hour news cycle”, no Internet, no instant look-up. If you wanted to play a video game with a friend you invited him over and you sat together looking at the same TV screen. Today you can play an MMORPG with hundreds of people across the globe. When I was growing up every person I knew lived in town and (the kids at least) went to my school. Today I play on-line games and have acquaintances on every continent. What a vast difference that is. ",
            "date": "Answered January 25, 2018",
            "views": "53",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Esme Shelby",
                    "user_href": "/profile/Esme-Shelby"
                },
                {
                    "user_id": "Will Harper",
                    "user_href": "/profile/Will-Harper-15"
                },
                {
                    "user_id": "Maggie Herrera",
                    "user_href": "/profile/Maggie-Herrera-9"
                },
                {
                    "user_id": "Chris Diel",
                    "user_href": "/profile/Chris-Diel-4"
                },
                {
                    "user_id": "Jay Rock",
                    "user_href": "/profile/Jay-Rock-249"
                },
                {
                    "user_id": "Deep Das",
                    "user_href": "/profile/Deep-Das-14"
                },
                {
                    "user_id": "Reyaan Hasaan",
                    "user_href": "/profile/Reyaan-Hasaan-1"
                },
                {
                    "user_id": "Jerry Ferrell",
                    "user_href": "/profile/Jerry-Ferrell-18"
                },
                {
                    "user_id": "Arshaud Tillman",
                    "user_href": "/profile/Arshaud-Tillman-3"
                },
                {
                    "user_id": "Marilyn Hubbard",
                    "user_href": "/profile/Marilyn-Hubbard-1"
                },
                {
                    "user_id": "Frank Douglas",
                    "user_href": "/profile/Frank-Douglas-12"
                },
                {
                    "user_id": "Frank Anthony Caruso, Jr.",
                    "user_href": "/profile/Frank-Anthony-Caruso-Jr"
                },
                {
                    "user_id": "David Prince",
                    "user_href": "/profile/David-Prince-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Ballentine",
                "href": "/profile/Lee-Ballentine"
            },
            "answer_text": "It is extremely difficult to distinguish the times you are living through from your time of life. The decade of the 1970s coincided with my late teens and early twenties—heady years for a young man exploring the world for the first time. It's difficult, but I'll try.  The sun in the 1970s was brighter and the light clearer than today. The air was softer. Colors were more variegated. It was much cheaper to live well, and it was easier therefore to take chances and \"roll the dice\" on life choices. Not quite as easy and cheap a time to experiment as the 1960s but still economically friendlier to noncomformity than later eras. The 1970s were more politically and socially unsettled than the 1980s. In that sense they were like the present decade. But there was less anxiety than today. Today is the most fearful and anxious national period I have even seen. The resources were available in the 1970s to obtain in-depth knowledge about various subjects. Libraries and universities and journals were readily available, but it took work and skills to use them, so the people with knowledge tended to be serious and focused. Today, knowledge is easy to get but much harder to place in an appropriate context because many people using it lack seriousness. Knowledge in 2018 tends to be wide but very shallow. Relationships in the 1970s were comparatively uncomplicated compared to today. Not necessarily better. The emotional landscape of the 1970s had fewer obstacles but also fewer paths and trails. It was significantly cooler in the 1970s. Not in a metaphorical sense but in weather and climate. There was more snow in the winters. Less blistering heat in the summers. Clothing was different therefore. More warm coats and gloves and hats necessary in the winters. And in the summers it was cool enough to require light jackets and windbreakers even in warm climates—classes of clothing that are uncommon today. Television was more fun in the 1970s and more people shared the experience of watching the same programs. On the other hand, we are now in a golden age of television. Great things are out there now and they are easy to access but fewer people share your experience of watching them. The 1970s were also a time of social groups and gatherings. There were clubs for people who shared hobbies or interests. There were groups of people regularly playing chess in the parks, listening to free outdoor concerts in the summers, groups meeting at churches and community centers. Neighbors shared meals and had block parties. Political meetings were common and there were union meetings. Lots and lots of trade shows and conventions and professional meetings and junkets. Concerts were cheap. People got together to play record albums. Today, much of that social energy has been vacuumed up by the internet. That's a start on listing the differences of the 1970s from today. This could be a book. It could be a set of encyclopedias.  The 1980s were a jitterier, faster, more affluent, less organized, more expensive, and more ill-focused version of the 1970s. Greed began to assert itself more directly. There were spectacular crashes and failures, but people enthusiastically recovered from them. We were cynical but still engaged. We were cynical but in an innocent sort of way. We were just jaded enough. In the 1970s, as Tom Petty put it, the future was wide open, but we were still on the ground exploring the landscape. In the 1980s the rocket took off and we jolted from side to side a lot as the boosters kicked in. Today we are well out into space on our way to wherever the hell we are headed. Where that is, I have very little idea, and very little confidence that anyone else does either. ",
            "date": "Updated June 12, 2019",
            "views": "109",
            "upvotes": " View 55 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Benn Fisherr",
                    "user_href": "/profile/Benn-Fisherr"
                },
                {
                    "user_id": "Dui Banhii",
                    "user_href": "/profile/Dui-Banhii"
                },
                {
                    "user_id": "Andrea Mercadante",
                    "user_href": "/profile/Andrea-Mercadante"
                },
                {
                    "user_id": "Andy Roper",
                    "user_href": "/profile/Andy-Roper-6"
                },
                {
                    "user_id": "Sed Chapman",
                    "user_href": "/profile/Sed-Chapman"
                },
                {
                    "user_id": "Ffion Catrin",
                    "user_href": "/profile/Ffion-Catrin"
                },
                {
                    "user_id": "Dennis Mccowan",
                    "user_href": "/profile/Dennis-Mccowan"
                },
                {
                    "user_id": "Tiffany Williams",
                    "user_href": "/profile/Tiffany-Williams-77"
                },
                {
                    "user_id": "Penby Verein",
                    "user_href": "/profile/Penby-Verein-1"
                },
                {
                    "user_id": "Lorice Walker",
                    "user_href": "/profile/Lorice-Walker-1"
                },
                {
                    "user_id": "Melita Kozul",
                    "user_href": "/profile/Melita-Kozul"
                },
                {
                    "user_id": "Steve Marino",
                    "user_href": "/profile/Steve-Marino-31"
                },
                {
                    "user_id": "Nick Patel",
                    "user_href": "/profile/Nick-Patel-107"
                },
                {
                    "user_id": "Anna Kelman",
                    "user_href": "/profile/Anna-Kelman-3"
                },
                {
                    "user_id": "Reyna Wilson",
                    "user_href": "/profile/Reyna-Wilson-1"
                },
                {
                    "user_id": "Esme Shelby",
                    "user_href": "/profile/Esme-Shelby"
                },
                {
                    "user_id": "Ders Zuko",
                    "user_href": "/profile/Ders-Zuko"
                },
                {
                    "user_id": "Carolyn Renee Tavares",
                    "user_href": "/profile/Carolyn-Renee-Tavares"
                },
                {
                    "user_id": "Drew Najder",
                    "user_href": "/profile/Drew-Najder"
                },
                {
                    "user_id": "Will Harper",
                    "user_href": "/profile/Will-Harper-15"
                },
                {
                    "user_id": "Paul Mountfort",
                    "user_href": "/profile/Paul-Mountfort-1"
                },
                {
                    "user_id": "Chris Coriz",
                    "user_href": "/profile/勇気-滝山-Chris-Coriz"
                },
                {
                    "user_id": "Frank Anthony Caruso, Jr.",
                    "user_href": "/profile/Frank-Anthony-Caruso-Jr"
                },
                {
                    "user_id": "Joe Squillace",
                    "user_href": "/profile/Joe-Squillace-1"
                },
                {
                    "user_id": "Sam Joe",
                    "user_href": "/profile/Sam-Joe-97"
                },
                {
                    "user_id": "Robert Keith",
                    "user_href": "/profile/Robert-Keith-46"
                },
                {
                    "user_id": "Maggie Herrera",
                    "user_href": "/profile/Maggie-Herrera-9"
                },
                {
                    "user_id": "Tanner874 .",
                    "user_href": "/profile/Tanner874"
                },
                {
                    "user_id": "Sondra Soldati",
                    "user_href": "/profile/Sondra-Soldati"
                },
                {
                    "user_id": "Randall Torres",
                    "user_href": "/profile/Randall-Torres-4"
                },
                {
                    "user_id": "David Lincoln Brooks",
                    "user_href": "/profile/David-Lincoln-Brooks-1"
                },
                {
                    "user_id": "Pekir Ete",
                    "user_href": "/profile/Pekir-Ete"
                },
                {
                    "user_id": "Angel Hernandez",
                    "user_href": "/profile/Angel-Hernandez-8"
                },
                {
                    "user_id": "Jim Kotva",
                    "user_href": "/profile/Jim-Kotva-1"
                },
                {
                    "user_id": "James O'Connor",
                    "user_href": "/profile/James-OConnor-8"
                },
                {
                    "user_id": "Niko Jackson",
                    "user_href": "/profile/Niko-Jackson"
                },
                {
                    "user_id": "Jermell Howard",
                    "user_href": "/profile/Jermell-Howard"
                },
                {
                    "user_id": "Elizabeth Osondu",
                    "user_href": "/profile/Elizabeth-Osondu"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Outis-1"
                },
                {
                    "user_id": "Miguel Queiroz",
                    "user_href": "/profile/Miguel-Queiroz-1"
                },
                {
                    "user_id": "Mohit Chooramani",
                    "user_href": "/profile/Mohit-Chooramani-1"
                },
                {
                    "user_id": "Ivy A Nguyen",
                    "user_href": "/profile/Ivy-A-Nguyen"
                },
                {
                    "user_id": "Dée Michelle",
                    "user_href": "/profile/Dée-Michelle"
                },
                {
                    "user_id": "François Léonard",
                    "user_href": "/profile/François-Léonard"
                },
                {
                    "user_id": "C.J. Heck",
                    "user_href": "/profile/C-J-Heck"
                },
                {
                    "user_id": "Jo Lockwood",
                    "user_href": "/profile/Jo-Lockwood"
                },
                {
                    "user_id": "Terrance Donley",
                    "user_href": "/profile/Terrance-Donley"
                },
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                },
                {
                    "user_id": "Katie Blohm",
                    "user_href": "/profile/Katie-Blohm-1"
                },
                {
                    "user_id": "Michael Craven",
                    "user_href": "/profile/Michael-Craven-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lou Brock",
                "href": "/profile/Lou-Brock-3"
            },
            "answer_text": "It 's an I do have a learning disability, please read my profile. It will tell my story. Thank you The technology didn't change that much in 1970. They did start changing in 1980. Well, 1970 had the poster child for propaganda against marijuana. The hippies!!! The war on drugs started. President Nixon. The JFK conspiracy was is going strong. January 25, 1971, the Manson family was found guilty. Sentence to death. when California overturned the death penalty in 1972 There sentence was life. Cable tv just got off the ground in 1970. Cable didn't get all over American until around the mid-80s. We only had three stations. ABC, NBC CBS. That was it. Daytime tv was soap operas and game shows. On prime time was western and Detective show. Cartoon only come on Saturday morning. Sunday Night Walt Disney come on ABC. There was thought cartoons like Charlie Brown, Winnie the Pooh, Frosty the Snowman, Grinch Who Stole Christmas that only come on an ounce a year. We had Watergate in 1970. With President Nixon the leader. He resigned before he got impeached. President Ford pardon Nixon. We had President Carter. The music was a lot of hard rock and roll. Black Sabbath, Aerosmith, Styx, Judas Priest, Head East, AC/DC. Then you had your class band like. Fleetwood Mac, Foreigner, Boston. There was a southern rock. Lynyrd Skynyrd, Bachman-Turner Overdrive you had a pop rock. Pointer Sisters, Jackson 5, Lionel Richie and the Commodores. Then there was a disco. Bee Gees. Every Sunday Casey Kasem counting down the top 100. Pop-rock cart. County music was a whole lot different. It was crying in your beer. Type of music. Brian Jones, Jim Hendrix, Janis Joplin, and Jim Morrison all died at age 27. From 1969 to 1971. Elvis Presley dies in 1977. Lynyrd Skynyrd; Ronnie Van Zant, Steve Gaines and Cassie Gaines all die in a plane crash in 1977. There was no cellphone. Well, some of the rich mines of had some. As a kid, all the toys that I had were a baseball glove, baseball, bat, basketball ball and a goal. All kinds of fishing equipment. Also all kinds of guns. The laws were not near as strict. The cops could not lie to a person. Porn really took off. The big star was John Holmes. That was in the middle of a big murder investigation. There a movie calls Wonderland. Thats all about it. There were not very many movie theaters. There were a lot of driven inns. drugs were just as bad. There was a lot more Saloon and bars. They were all over the place. There was a lot more drinking and driving. Because DWI was not as common. 1980, what if fun. 1980 was when I first started being a DJ. My music was on cassette tape, 45 recorder, and albums. CDs technology was about 1988. There was still a lot of the same bands that were still around. AC/DC, Aerosmith, Black Sabbath, then the hair bands come in 1980. Gun and roses, motley Crue, Dokken. The classic rock was still around. Fleetwood Mac, Foreigner, Boston. Pop Rock was still around. Michael Jackson, Madonna, Cyndi Lauper. Disco died to think god. Lol. County music was still the same. We had beta tapes first. Then the VCR took over. There movie rental stores. The technology started getting better. We could watch movies at home. The movie theater was started to get big. The Drive inn movie was still big. That one part about the 1970 and 1980 I wish was still around. We had a lot of fun at the drive inn We could drink pretty much when we want to. We party a lot. President Reagan was the first in 1980. He was the first actor. Good President with the exception of the first lady. Nancy Reagan that got it started that marijuana was the gateway drug. Nancy saying to kids was just say no to kids. Cable tv was started to get all over America. I remember MTV was nothing but video. 24 /7. I miss that's. A cellphone was just started in about 1988 or 1989. DWI started getting rough. They started changing the law a little bit. There was still a lot of salon and bars. Just like 1970. The shopping mall was very big. Our next President was President George W Bush. Gas was at an all-time high. His campaign was. Read my lips no new taxes. What the first thing he did to raise taxes. We had a lot of good times in 1970 and 1980. We got away with a lot of things you can't today. 1980 there was a lot more technology than in 1970. ",
            "date": "Updated January 1, 2020",
            "views": "25",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Herbert Lorick",
                    "user_href": "/profile/Herbert-Lorick"
                },
                {
                    "user_id": "Frank Montano",
                    "user_href": "/profile/Frank-Montano-8"
                },
                {
                    "user_id": "William Bob Riegert",
                    "user_href": "/profile/William-Bob-Riegert"
                },
                {
                    "user_id": "Bob Riegert",
                    "user_href": "/profile/Bob-Riegert-3"
                },
                {
                    "user_id": "Steve Marino",
                    "user_href": "/profile/Steve-Marino-31"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Bo-Diddl"
                },
                {
                    "user_id": "Renee J Harris",
                    "user_href": "/profile/Renee-J-Harris-1"
                },
                {
                    "user_id": "Lou Brock",
                    "user_href": "/profile/Lou-Brock-6"
                },
                {
                    "user_id": "Lou Riegert",
                    "user_href": "/profile/Lou-Riegert"
                },
                {
                    "user_id": "Reyna Wilson",
                    "user_href": "/profile/Reyna-Wilson-1"
                },
                {
                    "user_id": "Ders Zuko",
                    "user_href": "/profile/Ders-Zuko"
                },
                {
                    "user_id": "Laura Sommer",
                    "user_href": "/profile/Laura-Sommer"
                },
                {
                    "user_id": "Will Roberts",
                    "user_href": "/profile/Will-Roberts-195"
                },
                {
                    "user_id": "Drek Brown",
                    "user_href": "/profile/Drek-Brown-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Miller",
                "href": "/profile/Mark-Miller-89"
            },
            "answer_text": "I wrote about how the ’70s felt at Mark Miller's answer to What was life like in the 70's in the United States? The ’80s felt ironically stable for me. I know it’s obligatory to talk about the fear of nuclear war in the ’80s experience, but it was a topic that came up occasionally at school, and otherwise I didn’t think about it that much. I think one reason for that was the general attitude was fatalistic, that if the worst happened, a lot of people would be dead no matter what you tried to do, and it would all be over in 15 minutes. Of course, none of us wanted that to happen, but it felt like if it did, there wasn’t going to be an opportunity to fret over it, anyway. I think another aspect to it is the way the situation was explained to us was that it was highly unlikely that either side would just “wake up one day” and decide to nuke the other side, because of the principle of mutually assured destruction: If one side launched, the other side would, too, and both would suffer. Neither side wanted that. The more likely scenario that was discussed, if nuclear war were to happen, would have been if a conventional war broke out between us and the Soviets, and one side was winning the conventional war. In other words, nukes would be used as a strategic weapon that could turn the tide of the war, as a last resort. That made me feel more comfortable, because we weren’t in a conventional war with the Soviets, and it didn’t look like things were heading in that direction. The fact that nukes were part of the equation sobered people up about that. Nobody wanted it to get to the point where either side felt tempted to use them. The challenge was how to get both sides to agree to reduce their arsenal; how to get out of this threat. The way I’ve talked about the ’80s in other answers is that it felt like an exciting time, because there was always something new, amazing around the corner. It could be a new video technology, a new computer (I was really into them back then), a new movie, a new song, a new TV series/mini-series, a new toy, etc. All of that stuff looks like a given today, ordinary. The reason it was exciting then it is was brand new. It didn’t seem like it had happened before. I wrote about differences in: Mark Miller's answer to Are the 2010s very similar to the 1980s? Mark Miller's answer to If someone was to travel in time to the 1980s, what would it be like? The big differences between now and then, and I’d say this even applies to a difference between now and the ‘90s, is that: A lot is done over the internet, as opposed to calling someone, or driving somewhere, going to the library, or mailing something to communicate, or to make an order.A lot more is socially verboten to talk about now than there was in the ’70s and ‘80s.",
            "date": "Answered May 18, 2018",
            "views": "27",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Will Harper",
                    "user_href": "/profile/Will-Harper-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Ferguson",
                "href": "/profile/Brian-Ferguson-103"
            },
            "answer_text": "The 80′s was a more idealistic time. The culture was far less cynical than today's and with idealism comes creativity. There was less technology and things moved very slowly, because communication was slower, and the world was less connected. As a kid or teen you had to come up with ways to entertain yourself. There were no cell phones and most kids didn't have their own phone. There was just the family Lan line that your parents didn't let you spend much time on because there was no way to catch missed phone calls then. No internet. MOST house holds didn't even have Cable T.V. for most of the 80′s. Even if you did, Cable had just started and there wasnt as much on it. If you missed a t.v. show that was it… they didn't have seasons of t.v. shows recorded that you could buy. Heck, you couldn't even listen to a particular song you wanted to hear unless you had the entire album, or they happened to play it on the radio. I think the lack of instant gratification taught us to relish things more.",
            "date": "Updated February 25, 2019",
            "views": "25",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benn Fisherr",
                    "user_href": "/profile/Benn-Fisherr"
                },
                {
                    "user_id": "Vinay Gireesh",
                    "user_href": "/profile/Vinay-Gireesh"
                },
                {
                    "user_id": "Rafael Garcia",
                    "user_href": "/profile/Rafael-Garcia-39"
                },
                {
                    "user_id": "Andrew Brown",
                    "user_href": "/profile/Andrew-Brown-183"
                },
                {
                    "user_id": "Esme Shelby",
                    "user_href": "/profile/Esme-Shelby"
                },
                {
                    "user_id": "Will Harper",
                    "user_href": "/profile/Will-Harper-15"
                },
                {
                    "user_id": "David Lincoln Brooks",
                    "user_href": "/profile/David-Lincoln-Brooks-1"
                },
                {
                    "user_id": "Jim Bailey",
                    "user_href": "/profile/Jim-Bailey-101"
                },
                {
                    "user_id": "Jay Rock",
                    "user_href": "/profile/Jay-Rock-249"
                },
                {
                    "user_id": "Mohit Chooramani",
                    "user_href": "/profile/Mohit-Chooramani-1"
                },
                {
                    "user_id": "Jennifer Armstrong",
                    "user_href": "/profile/Jennifer-Armstrong-115"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hamza Khan",
                "href": "/profile/Hamza-Khan-2188"
            },
            "answer_text": "If society can be less politically correct as they were in the past then yes you would be back in the 80’s. However being back in those times there were HD televisions, no smart phones, no internet/social media and cars had low fuel efficiency. In 2018 technology is advanced but society is too PC now and boring compared to then. ",
            "date": "Answered June 13, 2020",
            "views": "369",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bruce Coleman",
                    "user_href": "/profile/Bruce-Coleman-39"
                }
            ]
        }
    ]
}