{
    "title": "How old would George Washington be if he was still alive? - Quora",
    "tags": [
        "George Washington",
        "Presidents of the United States of America",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kristján Birnir Ívansson",
                "href": "/profile/Kristján-Birnir-Ívansson"
            },
            "answer_text": "He would be 287 years old. Considering that no human male has ever lived more than ca 116 years. Washington if he was alive, he would have now at this point in time lived 2 and 1/2 longer than Christian Mortensen the oldest ever American male. the oldest man is from japan Jiroemon Kimura. However consider what George Washington achieved during his life time we could argue he belongs to the ages…and that he still lives on in our memory. Washington might have lot of memorials dedicated to him in US, but human history is tought around the globe and only fool would fail to regonize George Washington’s greatest. He was offered the ultimate power of King only to turn it down…not once but twice.  ",
            "date": "Answered December 8, 2019",
            "views": "59",
            "upvotes": " Answer requested by Danny Margulies",
            "upvoters": [
                {
                    "user_id": "Le Sellers",
                    "user_href": "/profile/Le-Sellers"
                },
                {
                    "user_id": "Thies Schaper",
                    "user_href": "/profile/Thies-Schaper"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Katie Norris",
                    "user_href": "/profile/Katie-Norris-44"
                },
                {
                    "user_id": "Sean Brian Kirby",
                    "user_href": "/profile/Sean-Brian-Kirby"
                },
                {
                    "user_id": "Deepak Jain",
                    "user_href": "/profile/Deepak-Jain-118"
                },
                {
                    "user_id": "Roberto Martinez",
                    "user_href": "/profile/Roberto-Martinez-118"
                },
                {
                    "user_id": "Jimmy Rooks",
                    "user_href": "/profile/Jimmy-Rooks-1"
                },
                {
                    "user_id": "Ashlay Obispo",
                    "user_href": "/profile/Ashlay-Obispo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Borelli",
                "href": "/profile/Alex-Borelli-1"
            },
            "answer_text": "Let's see...he was born on February 22, 1732, 284 years ago, and since February 22, 2016 has already passed, he would be a little over 284 years and 2 months old today (May 1, 2016, when this answer was written). Although, it could be disputed that he was born on February 22, 1731. The reason his birthdate is set at February 22, 1732 is the fact that the British Empire, in which Washington (born in Virginia, at that time a British colony) was born, adopted the Gregorian calendar in 1752, after having used the Julian calendar for centuries.   Note: Much of Europe and Africa started using the Gregorian calendar in 1582, almost 200 years before the British Empire did.  Julian calendar George Washington ",
            "date": "Answered May 1, 2016",
            "views": "414",
            "upvotes": " View 9 Upvoters"
        }
    ]
}