{
    "title": "How was the Cuban Missile Crisis resolved? - Quora",
    "tags": [
        "Cuban Missile Crisis",
        "Cuba",
        "The Cold War"
    ],
    "response": [
        {
            "author_info": {
                "name": "Henry Louis Gomez",
                "href": "/profile/Henry-Louis-Gomez"
            },
            "answer_text": "The Soviet Union and the United States came to an agreement called the KENNEDY-KHRUSHCHEV UNDERSTANDINGS. The terms were secret but a bunch of the stuff has been declassified. In short, the Soviets had to remove all nukes (the long range ones and the tactical nukes) from Cuba and the United States had to remove missiles it had placed in Turkey. The United States agreed that it would not invade Cuba or allow an invasion of Cuba by Cuban exiles living in the United States. The agreement was never abrogated by either party and presumably is still in force between the US and Russia. More info here: http://www.latinamericanstudies.org/missile.htm ",
            "date": "Answered January 28, 2017",
            "views": "750",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eric Dodd",
                    "user_href": "/profile/Eric-Dodd-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vriti Vankani",
                "href": "/profile/Vriti-Vankani"
            },
            "answer_text": "Cuba missile crisis came to an end when Nikita Khrushchev agreed to remove nuclear weapons from Cuba territory and Kennedy agreed to respect Cuba’s territorial sovereignty. Also of the intensive diplomacy involved kennedy agreement to remove nuclear weapons from Turkey which Soviet considered security threat. Both presidents of two superpowers Khrushchev and Kennedy displayed characteristics of statesmanship in ending the crisis. ",
            "date": "Answered June 17, 2018",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shubham Singh",
                    "user_href": "/profile/Shubham-Singh-2262"
                }
            ]
        }
    ]
}