{
    "title": "How did the rich treat the poor? - Quora",
    "tags": [
        "Poor People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mya Maria",
                "href": "/profile/Mya-Maria-4"
            },
            "answer_text": "When rich beyon a certain point - I’ve seen a few reactions - the poor can seem like an unwanted shadow on the pretty canvas of their boxed reality. Like in “how ugly is that street market where people buy and sell local fruits, it ruins my view” - and the market is important for local people who are poorer. In this cases, the rich don’t care, and any virtual encounter is to be prevented by security people or law enforcement people, seen as being there to protect the rich. (less developed countries, corrupt statesand so on) More “civilised” rich people flock towards exclusively rich areas, from which they elegantly care about the poor via charity, donations and other philantrophical methods, but without troubling themselves really with all the inequities and unfairness in the world. As an exception, some (perhaps who have known both poverty and richness) understand (to some limits) what it means being one or another. Some get personally involved in charity work. They care in a different way because they feel the huge gap is a premise for an abyss, and having such a thing at the basis of any society cannot forecast good things. ",
            "date": "Answered October 31, 2019",
            "views": "129",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Blair",
                "href": "/profile/James-Blair-36"
            },
            "answer_text": "Generally, rich people don’t suddenly become “super good” or “super evil” when they get a lot of money, or even if they’re born into it. If a rich person is raised to be a miserly, greedy bastard, it is likely they will continue to be one when they get a lot of money. Or if they were once the sort of person who wished they could help people but couldn’t because they needed to take care of themselves first, it is likely they will help a lot of people when they get money. For the most part, rich people want other people to have money. The less poor people are, the more stuff they buy! Aside from that, anything that doesn’t make them not-rich is mostly okay. ",
            "date": "Answered April 16, 2018",
            "views": "626",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Denise Hiknee",
                "href": "/profile/Denise-Hiknee"
            },
            "answer_text": "A lot of rich have very strange ideas about what should and shouldn’t be done in life. Some rich are darn smart and think helping the poor is important. For the most part being rich tends to afford the luxury of not thinking too excessively about it. Dear poor if you want the rich to give you money at least make the effort to kiss up to them, that should not be asking too much. ",
            "date": "Answered March 13, 2019",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Sheridan",
                "href": "/profile/William-Sheridan-17"
            },
            "answer_text": "Those that have wealth care about people roughly equally. Only those that are Democrats are obsessed with classifying people into more categories now than I will bother to post. Democrats care only about those loyal to THE PARTY and pretend to care in order to get votes. The experience for many years has been that caring has produced zero and actually, caring never will. Never has their been a more pretentious bunch of people than the Democratic Party Leadership. Those that follow them either have been miseducated into thinking they will do something rational because they care or profit from saying they care. (Oscars, Grammys anyone?). ",
            "date": "Answered October 30, 2019",
            "views": "216",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jaffrey Harris",
                    "user_href": "/profile/Jaffrey-Harris"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mangapul Darmidi",
                "href": "/profile/Mangapul-Darmidi"
            },
            "answer_text": "Simply put.. by their financial decision / principle. I don’t care how much money you make / made. But if you are against usury or strongly believe that government should revert back to Gold standard. Then ahem… Note : Just to make sure that I don’t sound like hypocrite. There is a big difference between “against usury” vs “considering the danger of runaway consumer debt”. ",
            "date": "Answered October 24, 2018",
            "views": "54",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Santos Payama",
                    "user_href": "/profile/Santos-Payama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yevhen Hazha",
                "href": "/profile/Yevhen-Hazha"
            },
            "answer_text": "It gives to poor the opportunity to become rich. It is simple money flow. But only those ones who smart enough and know how to use them properly will become rich, another ones will stay where they were. ",
            "date": "Answered April 16, 2018",
            "views": "189",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Carl Wimmer",
                "href": "/profile/Carl-Wimmer-1"
            },
            "answer_text": "people are people, no matter how much or how little they have. Some people are nice and some are not. Money may magnify the intensity for good or bad but does not create the underlying cause of it. ",
            "date": "Answered March 14, 2019",
            "views": "19",
            "upvotes": " Answer requested by Gary Cook"
        },
        {
            "author_info": {
                "name": "Bill Lipton",
                "href": "/profile/W-Lawrence-Lipton-1"
            },
            "answer_text": "Does QUORA poster really want to use “DID” — if so, in what past time period? And what area of the world? ",
            "date": "Answered April 16, 2018",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jørgen Pallesen",
                "href": "/profile/Jørgen-Pallesen"
            },
            "answer_text": "some do, some don’tit’s a matter of culture and will greatly vary in different countriesin south korea they don’t care at all, and even their own family members are left in the dust, since their culture doesn’t have the compassionate teachings like in the west",
            "date": "Answered October 31, 2019",
            "views": "28",
            "upvotes": "0"
        }
    ]
}