{
    "title": "How did opium arrive in China in the first place? - Quora",
    "tags": [
        "History of Opium in China",
        "Opium Wars",
        "Opium",
        "Narcotics Trafficking, Distribution, and the Controlled Substance Trade",
        "History of China",
        "Culture of China",
        "Recreational Drugs",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Bartram",
                "href": "/profile/John-Bartram"
            },
            "answer_text": "Paul Harrison can make a good Answer; meanwhile we have: History of opium in China: “began with the use of opium for medicinal purposes during the 7th century. In the 17th century the practice of mixing opium with tobacco for smoking spread from Southeast Asia, creating a far greater demand.[1]” Historical accounts suggest that opium first arrived in China during the Tang dynasty (618–907) as part of the merchandise of Arab traders.[11] Later on, Song Dynasty (960–1279) poet and pharmacologist Su Dongpo recorded the use of opium as a medicinal herb: \"Daoists often persuade you to drink the jisu water, but even a child can prepare the yingsu[A] soup.\"[12] Initially used by medical practitioners to control bodily fluid and preserve qi or vital force, during the Ming dynasty (1368–1644), the drug also functioned as an aphrodisiac or chunyao (春药) as Xu Boling records in his mid-fifteenth century Yingjing Juan: “It is mainly used to treat masculinity, strengthen sperm, and regain vigour. It enhances the art of alchemists, sex and court ladies. Frequent use helps to cure the chronic diarrhea that causes the loss of energy ... Its price equals that of gold.[12]” Ming rulers obtained opium via the tributary system, when it was known as wuxiang (烏香) or \"black spice\". The Collected Statutes of the Ming Dynasty record gifts to successive Ming emperors of up to 100 kilograms (220 lb) of wuxiang amongst tribute from the Kingdom of Siam, which also included frankincense, costus root, pepper, ivory, rhino horn and peacock feathers. First listed as a taxable commodity in 1589, opium remained legal until the end of Ming dynasty, 1637. ",
            "date": "Answered November 12, 2019",
            "views": "156",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Halina Minadeo",
                    "user_href": "/profile/Halina-Minadeo"
                },
                {
                    "user_id": "Nevi Løvfelt",
                    "user_href": "/profile/Nevi-Løvfelt"
                },
                {
                    "user_id": "Tim Chiswell",
                    "user_href": "/profile/Tim-Chiswell"
                },
                {
                    "user_id": "Ian Holloway",
                    "user_href": "/profile/Ian-Holloway-8"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "George Rix",
                    "user_href": "/profile/George-Rix-1"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Paul Harrison",
                    "user_href": "/profile/Paul-Harrison-69"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Rumbaugh",
                "href": "/profile/James-Rumbaugh-1"
            },
            "answer_text": "The story is the Brits brought it. Maybe so.. but they certainly built up a monster trade in it. When the Chinese govt tried to curtail it, the Brits had the field and naval artillery, gatling, volley fire guns, repeating rifles and lotsa ammo. ",
            "date": "Answered November 12, 2019",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexander Rose",
                "href": "/profile/Alexander-Rose-6"
            },
            "answer_text": "It's probably always been there. No one Even knows were opoum poppies come from, but the come from somewhere in Eurasia, and they can grow just fine in China. Chinese people have extremely old records of opium poppies. ",
            "date": "Answered November 15, 2019",
            "views": "14",
            "upvotes": "0"
        }
    ]
}