{
    "title": "How does the Roman calendar compare to the Jewish calendar? - Quora",
    "tags": [
        "Jewish Calendar",
        "Calendars",
        "Judaism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arieh Kovler",
                "href": "/profile/Arieh-Kovler"
            },
            "answer_text": "There are different Roman calendars at different times, but the Republican Roman calendar was actually very similar to the Jewish calendar! Both calendars were based on a year of 12 lunar months, with the first month in the spring. Both were somewhat based on observing the moon, with a new moon meaning a new month. Both were 354 days long in a normal year, being 12 months of a lunar cycle of 29.5 days. Because of this, both tended to run ‘fast’ compared to the solar seasons, and needed to be regularly reset by adding an extra month in springtime, with the Romans adding a month called Mercedonius when needed, cutting February short at 23 days, and the Jews adding the month of Adar II after the first Adar. In Rome, the decision to add a month was in the hands of the High Priest. This led to corruption, because the extra month meant that people on annual contracts got paid less and people with annual appointments got to serve longer. So lots of powerful people could benefit from the extra month. Eventually this got so messed up that Julius Caesar reformed the calendar into the solar calendar with a 365-day year with a quadrennial leap day that we know today (more or less). In order to get things back into sync, the year 46 BC had 445 days, making it the longest year ever! In the Jewish calendar, the decision to add a leap month was in the hands of the Sanhedrin, the court. The Talmud says that this was to stop the High Priest or King messing with the year length for political reasons. It was originally decided in the spring, based on observations, whether to have a leap month. After the Sanhedrin ceased about 1600 years ago, the Jewish calendar was fixed. In a 19-year cycle there are leap months in years 3, 6, 8, 11, 14, 17 and 19 — so every 2 or 3 years. ",
            "date": "Answered June 20, 2019",
            "views": "342",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Oppenheimer-Crawford",
                "href": "/profile/James-Oppenheimer-Crawford"
            },
            "answer_text": "There are different “roman” calendars, called the Julian and Gregorian. I am going to assume that by Roman, you mean the calendar used by most of the world today. This is a solar calendar. Its divisions depend on the gradual travels of the earth around the sun, and the rotations of the earth. The time it takes for the earth to revolve once around the sun is just a bit over three hundred sixty five days. A quick fix by adding February 29th every four years almost brings the year into alignment. Now there is a little finagling at the beginning of each century. This, again, almost gets things just right. However, to make sure things are just right, astronomers talk among themselves and do a lot of careful calculations, and periodically add a leap second if needed. This brings the calendar year in sync with the travels of the earth around the sun to within a second. The Jewish calendar is a lunar calendar. This year is divided into months that phase with the lunar cycle. and at the end of each year, they kind of throw some stuff in to make things work out. It’s really all about combining the time elements of day (24 hours), month (28 and change days if lunar — whatever days we say if not), and year (365 and change days). Since these three things do not in any way coincide with one another, all we can do is invent strategies to try to get them into some kind of agreement. The problems with this were demonstrated by the calendar the West used for a long time, which allowed the year to slide very slowly around, to the point where well over a week of slippage had occurred when the powers that wanted to be decided to adopt a new calendar and at the same time fix the slippage. This happened at various times around the world as different authorities decided to adopt the new calendar. so around the time of the American colonies, you will find a person’s birthdate (and other dates) referred to by two dates — the old and the new calendar. You didn’t ask about the Islamic calendar, but, just for fun, this is a lunar calendar which simply utterly ignores slippage. The result is that it just merrily passes the seasons around the calendar without attempting to line them up with the year. A notable season of this calendar is Ramadan, which is significant because it involves not eating during day time — from sunrise to sunset. When Ramadan happens in the winter time, it is very easy, because the time between sunrise and sunset is short. However, if Ramadan happens in the summer, the sun is up a much longer period of time, and a lot of people have great difficulty carrying on with their activities when they are prevented from eating for such a long time during every day. Every calendar has its own way of dealing with the mix up between the length of the day, month and year. ",
            "date": "Answered June 18, 2019",
            "views": "236",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jacob Ningen",
                    "user_href": "/profile/Jacob-Ningen-1"
                }
            ]
        }
    ]
}