{
    "title": "How did North Macedonia become non-Greek? - Quora",
    "tags": [
        "History of Macedonia",
        "Greek Macedonians",
        "Macedonia (Greek Region)",
        "Ancient Macedonian Empire",
        "Republic of North Macedonia",
        "History of Greece",
        "Greek Ethnicity and People",
        "Greek (language)",
        "Ancient Greece"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dalibor Stanojevic",
                "href": "/profile/Dalibor-Stanojevic-1"
            },
            "answer_text": "Some people settled there is the answer ? How Greece become Greece ? Greeks came from River Don, Crimea, nowadays Turkey and ancient Egypt ? Ancient Hellenes and modern Greeks are the same people ? All other are newcomers? Greek genetcs is J2 mostly and is Asian by origins, so Greeks by origins are not European nation. Wow, most would said, well, most of so called Europeans are Asiatic nations by origin, Britain, French, Germans (R1b) and Poles, Czechs, Slovakian, Ukraine , Russia (R1a) are actually Indian by origin, because of this we use term Indo-Europeans. The proto Europeans are mostly exterminated by hostile Asiatic tribes that entered Europe in more waves . One of the first waves was Greek wave, Dorian, Ionians and Achaeans are Greek tribes that came from non european areas and populated nowadays Greece. Was Greece unpopulated before that ? NO. Many peoples and tribes lived at the Balkans before.Illyrians, Tribalians, Trachians, Dardans, Pelasgians…. Where the problem occurs ? Newly created nation, I like to say artificial nations, nations created in 20th century by politics and not in “natural” way, have to steal some history, to develop myths on the base of which they will identify own “nation” . Who are the nations that has history to be stolen ? The nations having the history, at first place Greeks, ancient history, a lot of artifacts , monuments etc, in the other place Serbs, medieval Empire, a lot of Churches, cathedrals, monasteries, letters of Kings etc. In the other hand, Demosthenes and other also say that “Greeks lie a lot”, which is nothing new, all nations having Empires, had also propaganda, Romans, Serbs, Ottomans, Austrians. Were the Greeks only nation at Balkans BC, of course not,but all documents we have are Greek sources, even today, in Greece you have to change the name ans say you are Greek, to get citizenship .Other nations also lived at Balkans, especially carrying I haplotype, since genetics says these people are FIRST inhabitants of Europe. Who has this genetics ? Swedish, Serbs, Norway, Croatia, Denmark, Romania.Despise genetics, every day we are getting being pushed to believe that we are newcomers to Balkans, at 6th century since Vatican claims that…. What is the solution ? You can claim that Macedonians in Macedonia, nowadays are descendants of Alexander the Great, but we need more then claims, we need proofs Also if Albanians claims they are the oldest nation in Balkans, ok , but we need some artifacts, we need some proofs, beside aggressive populism propaganda, paid by drug dealing money, we simply need historical proofs, since without it, we are just mumbling with ourselves. ",
            "date": "Answered May 5, 2020",
            "views": "202",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Evangelos Arkas",
                    "user_href": "/profile/Evangelos-Arkas-1"
                },
                {
                    "user_id": "George Nova",
                    "user_href": "/profile/George-Nova-2"
                },
                {
                    "user_id": "Theme Tracktor",
                    "user_href": "/profile/Theme-Tracktor"
                },
                {
                    "user_id": "Aleksandar Đorđević",
                    "user_href": "/profile/Aleksandar-Đorđević-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ioannis Manomenidis",
                "href": "/profile/Ioannis-Manomenidis"
            },
            "answer_text": "Easy answer but please focus on what I will say and avoid prejudiced “knowledge” you may already have and it is wrong. Ancient Macedonia was 100% Greece* and did not include the nowadays North Macedonia (it is already agreed with North Macedonia that Macedonia in Greece belongs to Greek culture from ancient times until today). Macedonians of Ancient Greece, have controlled the surrounding northern areas, but have never been inhabited by Macedonians (Greeks); they were only controlled so to protect (ancient) Macedonia from invasions from North. In Roman and Ottoman Empires, the North of (ancient) Macedonia had started being developed and inhabited by Greeks, Romans (after the Roman invasion to Greece), Slavs after the 6th century (the Byzantine period), Goths, and the Turks in the 14th century. During this period, both the Romans and the Ottomans have re-organized administrative the area according to their needs. The Slavs have started being a significant part of the population in all this area, including Macedonia for the additional reason that Macedonians (Greeks) had been fighting either in all Asia and North Africa, not only with the Greeks with Alexander, and his successors but also with the Byzantine Empire against Persians, Arabs, and Turks. In the same period, the Slavs have for long periods organized as Bulgarians and the whole Macedonia had been part of the Bulgarian kingdom during the Byzantine period, manned by those Slavs living in Macedonia and North Macedonia. So in the period before the liberation of the area from the Ottoman Empire, Bulgaria has raised the case of this area without any relation with whatever Macedonia, but only because Bulgaria tried to justify its national interest to include these lands with Slavic (Bulgarian according to Bulgaria) speaking populations, both Ancient Macedonia area and nowadays North Macedonia {which North, as explained above, was not inhabited by Macedonians(Greeks) in ancient times, but only after the Roman conquest}. After Greece had liberated Macedonia (not North Macedonia that was liberated by the Serbs) from the Ottoman Empire, there was a period of free exchange of Christian populations between the borders of respective countries (Greece and Serbia) which lasted until the cold war; therefore those Slavs of Macedonia (Greece) feeling Serbs moved to Serbia (nowadays North Macedonia) and those Slavs feeling Bulgarians moved to Bulgaria, while with the reverse direction feeling Greeks from Serbia (North Macedonia) or Bulgaria moved to Macedonia (Greece as Macedonia from ancient times). Conclusion those living in North Macedonia have never been anything else than Slavs and have no relation with ancient Macedonia. ",
            "date": "Updated May 12, 2020",
            "views": "325",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stratos Zachariadis",
                    "user_href": "/profile/Stratos-Zachariadis"
                },
                {
                    "user_id": "Alan Piersonn",
                    "user_href": "/profile/Alan-Piersonn"
                },
                {
                    "user_id": "Gregory Yama",
                    "user_href": "/profile/Gregory-Yama"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Beni-Ciko"
                },
                {
                    "user_id": "Terry Zaffer",
                    "user_href": "/profile/Terry-Zaffer"
                },
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                },
                {
                    "user_id": "Marcellus Nichols",
                    "user_href": "/profile/Marcellus-Nichols-1"
                }
            ]
        }
    ]
}