{
    "title": "How to run a successful bakery - Quora",
    "tags": [
        "Bakeries",
        "Entrepreneur Advice",
        "How-to Question",
        "Entrepreneurship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Atul Sankar",
                "href": "/profile/Atul-Sankar"
            },
            "answer_text": "Keeping the bakery cleanWell interior designedRespect to the customers. A proper customer relationship management shall be thereQuality concious, the products sold in the bakery shall be of premium quality and the taste shall be there . Taste is important. These is the most important core competency for a bakery to be successfulAir conditionedHIGH QUALITY PACKAGING, A GOOD packaging will always give us a good impression about the bakery and it creates a brand about the bakeryMore CHOICE of products and services in the bakery shall be there . So customers love more choice and customisation.Dummy cakes and items shall be kept in the bakery to attract more no. Of people.The TASTE is an important aspect. It should always be the tickling the taste buds.Price Should be reasonable and be affordable by the mob near by .THANK YOU READING !!! ",
            "date": "Answered February 23, 2017",
            "views": "719",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sanjana A",
                    "user_href": "/profile/Sanjana-A-2"
                },
                {
                    "user_id": "Amar",
                    "user_href": "/profile/Amar-215"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Lee",
                "href": "/profile/Greg-Lee-51"
            },
            "answer_text": "Let me ask you have you ever or are you currently working in a Bakery? Do you have any experience in management in food service? I do know for a fact that some companies will put inexperienced people in a bakery management role. If you really want to run a bakery the first thing I would want to know and not be afaird to try learn some basic baking skills. The company I work for has put 2 inexperience people in to run the bakery and it's not a good time when they actually think they know more then you or the other people that have been doing it for a long time. Just remember this your not the smartest person in the room at all times. I really didn't answer any questions here I more or less gave you some things to think about. I was a bakery manger for about 16 years and I had a great time doing it. ",
            "date": "Answered February 12, 2018",
            "views": "283",
            "upvotes": "0"
        }
    ]
}