{
    "title": "How old is the oldest tree, where can it be found and what type of tree is it? - Quora",
    "tags": [
        "How Old Is X?",
        "Nature",
        "Trees (plant)",
        "Plants",
        "Botany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wu Sujiao",
                "href": "/profile/Wu-Sujiao"
            },
            "answer_text": "There are actually two contenders to the title \"The Oldest Tree\". - The non-clonal contender for the title is of a Great Northern Bristlecone Pine aged 5'063. Bristlecones grow in scattered subalpine groves at high altitude in arid regions of the Western United States. The pines live in isolated groves above the tree line on dolomitic soils (very alkaline soil). Because of cold temperatures, dry soils, high winds, and short growing seasons, the trees grow very slowly. Even the tree's needles, which grow in bunches of five, can remain on the tree for forty years, which gives the tree's terminal branches the unique appearance of a long bottle brush.     The wood is very dense and resinous, and thus resistant to invasion by insects, fungi, and other potential pests. The tree's longevity is due in part to the wood's extreme durability. While other species of trees that grow nearby suffer rot, bare bristlecone pines can endure, even after death, often still standing on their roots, for many centuries. Rather than rot, exposed wood, on living and dead trees, erodes like stone due to wind, rain, and freezing, which creates unusual forms and shapes. - The clonal contender to the title is Pando, a colony of 0.5 km2 of quaking aspen. While the average age of the stems is 130, it is connected by a complex web of roots, estimated to be 80'000 years old. Pando considered also to be the heaviest and the oldest living organism.    Sources:   Bristlecone pineBristle Cone PinesPando (tree)File:AspenOverview0172.JPG ",
            "date": "Answered June 21, 2013",
            "views": "34",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barbra Reed",
                    "user_href": "/profile/Barbra-Reed-2"
                },
                {
                    "user_id": "Erik Danielsen",
                    "user_href": "/profile/Erik-Danielsen-5"
                },
                {
                    "user_id": "Corvi Zeman",
                    "user_href": "/profile/Corvi-Zeman"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nepal-Gateway-Trekking"
                },
                {
                    "user_id": "Saurabh Patel",
                    "user_href": "/profile/Saurabh-Patel-1"
                },
                {
                    "user_id": "Jason Rubin",
                    "user_href": "/profile/Jason-Rubin-13"
                },
                {
                    "user_id": "Anna Tulchinskaya",
                    "user_href": "/profile/Anna-Tulchinskaya"
                },
                {
                    "user_id": "Sukanya Rajan",
                    "user_href": "/profile/Sukanya-Rajan"
                },
                {
                    "user_id": "Kate Simmons",
                    "user_href": "/profile/Kate-Simmons"
                },
                {
                    "user_id": "Graeme Shimmin",
                    "user_href": "/profile/Graeme-Shimmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nik Gaffney",
                "href": "/profile/Nik-Gaffney"
            },
            "answer_text": "The oldest individual clonal tree has been dated to around 9500 years old, while the oldest non-clonal tree has been dated to around 4800 years old. A clonal tree may share roots, branches or trunks with other trees, creating colonies which may be up to 80,000 years old. \"Old Tjikko is a 9,550 year old Norway Spruce tree, located on Fulufjället Mountain of Dalarna province in Sweden\" [1] \"Methuselah is a 4,800 year old Great Basin Bristlecone Pine - Pinus longaeva tree growing high in the White Mountains of Inyo County in eastern California.\" [2] [1] http://en.wikipedia.org/wiki/Old_Tjikko[2] http://en.wikipedia.org/wiki/Methuselah_(tree)[3] http://longnow.org/seminars/02010/nov/15/worlds-oldest-living-organisms/ ",
            "date": "Answered April 8, 2011",
            "views": "477",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barbra Reed",
                    "user_href": "/profile/Barbra-Reed-2"
                },
                {
                    "user_id": "Birger Ekenstierna",
                    "user_href": "/profile/Birger-Ekenstierna"
                },
                {
                    "user_id": "Kris Haamer",
                    "user_href": "/profile/Kris-Haamer"
                },
                {
                    "user_id": "Thomas Kluyver",
                    "user_href": "/profile/Thomas-Kluyver"
                }
            ]
        }
    ]
}