{
    "title": "How were Red Army veterans of WW2 treated once they returned home following the war? - Quora",
    "tags": [
        "U.S. Veterans",
        "Military Veterans",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vijay Simha",
                "href": "/profile/Vijay-Simha-15"
            },
            "answer_text": "As long as you were not held as a prisoner of war by the Germans your chances of leading a good and privileged life after the war were pretty good. There was only one problem: During the opening stages of Operation Barbarossa from June to November 1941, and the summer offensive of the German Wehrmacht (June 1942-September 1942), the Germans won a large number of encirclement (Kesselschlacht) battles against the beleaguered Red Army at Brody, Bialystok-Minsk, Smolensk, Kyiv, Vyazma, Sevastopol, Kharkiv, and Mozhaisk. More than 4 million Red Army soldiers were taken prisoner of war by the Germans in these spectacular engagements where entire divisions and armies of the Red Army were surrounded and wiped out -- and this was solely due to the incompetent Generalship in the Red army whose Generals never had an inkling of how to deal with the Blitzkrieg tactics the German Panzers used so effectively and effortlessly. Only one out of one hundred such prisoners survived the forced marches back to Germany and the harsh conditions in the labor camps in Germany, Poland, and Czechoslovakia by 1945. When the Soviets overran Eastern Europe in 1945, they came upon a number of such POW camps - (Russenlager) as they were called, housing Russian POWs. Without exception, the Red Army Commissars treated all these Russian POWs as traitors to the motherland for allowing themselves to be captured by the Germans and the standard punishment for these hapless Russian soldiers was another journey to Siberia to be interned there in a Russian Gulag for life. These soldiers (almost half a million of them) never saw their loved ones or homes again and had very little to cheer about the Red Army winning WWII on the Eastern - front and their liberation from the POW camps in Germany. The last lines of this song by Al-Stewart captures this very beautifully and poignantly.. Here is that song for readers to listen: al stewart roads to moscow The worst thing that a Red Army soldier could do was to admit in his memoirs or to the authorities by a slip of the tongue, that he had been taken Prisoner of War by the Axis forces even for a day. If he ever did that, his fate was sealed and he was transported to life imprisonment in Siberia ",
            "date": "Updated May 21, 2020",
            "views": "38",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ayush Tiwari",
                    "user_href": "/profile/Ayush-Tiwari-380"
                },
                {
                    "user_id": "Michael Mclaughlin",
                    "user_href": "/profile/Michael-Mclaughlin-76"
                },
                {
                    "user_id": "Thomas Wythenshawe",
                    "user_href": "/profile/Thomas-Wythenshawe"
                },
                {
                    "user_id": "Mark Johnston",
                    "user_href": "/profile/Mark-Johnston-243"
                },
                {
                    "user_id": "Albert Widler",
                    "user_href": "/profile/Albert-Widler"
                },
                {
                    "user_id": "Sten Reiter",
                    "user_href": "/profile/Sten-Reiter"
                },
                {
                    "user_id": "Santino Martinez",
                    "user_href": "/profile/Santino-Martinez-7"
                },
                {
                    "user_id": "Kevin Harrison",
                    "user_href": "/profile/Kevin-Harrison-42"
                },
                {
                    "user_id": "Noah Adams",
                    "user_href": "/profile/Noah-Adams-23"
                },
                {
                    "user_id": "Marc Kerkmann",
                    "user_href": "/profile/Marc-Kerkmann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Desmond Ng",
                "href": "/profile/Desmond-Ng-23"
            },
            "answer_text": "As David here has said, they were treated with great respect, provided they weren't captured or MIA.* Many returned home heroes, and loaded with loot and goods, and became the pride of their communities. My Russian friend's grandparent suffered a heart attack. He survived cos every vehicle in the village moved out of his recognizable car's way as his wife drove him to the hospital. He also received gifts from the Jews in the village until his death. *The Soviet Union refused to pay benefit to the families of the 980,000 troops who were MIA since 'they obviously went missing since they had something to hide' If their remnants were discovered benefits still weren't paid, but i heard that they were properly buried(citation needed, if you can prove it wrong in the comments I'll gladly change it) ",
            "date": "Answered December 6, 2015",
            "views": "73",
            "upvotes": " View 47 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Wythenshawe",
                    "user_href": "/profile/Thomas-Wythenshawe"
                },
                {
                    "user_id": "Luis Gomez",
                    "user_href": "/profile/Luis-Gomez-54"
                },
                {
                    "user_id": "Maksim Gur",
                    "user_href": "/profile/Maksim-Gur"
                },
                {
                    "user_id": "Steve Glenn",
                    "user_href": "/profile/Steve-Glenn-2"
                },
                {
                    "user_id": "Aurobind Padayatchi",
                    "user_href": "/profile/Aurobind-Padayatchi"
                },
                {
                    "user_id": "Alejandro Solà",
                    "user_href": "/profile/Alejandro-Solà"
                },
                {
                    "user_id": "Anthony Powers",
                    "user_href": "/profile/Anthony-Powers-1"
                },
                {
                    "user_id": "Pranav Devarakonda",
                    "user_href": "/profile/Pranav-Devarakonda-2"
                },
                {
                    "user_id": "Nhật Minh Đoàn",
                    "user_href": "/profile/Nhật-Minh-Đoàn"
                },
                {
                    "user_id": "Elkan Choo",
                    "user_href": "/profile/Elkan-Choo"
                }
            ]
        }
    ]
}