{
    "title": "How did Finnish Air Force perform during the Winter War? - Quora",
    "tags": [
        "Finnish Defence Forces",
        "Military Aviation History",
        "Finnish (language)",
        "Finland",
        "Air Forces",
        "World War II",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matti Porkka",
                "href": "/profile/Matti-Porkka"
            },
            "answer_text": "How did Finnish Air Force perform during the Winter War? Finnish Air Forces  Founded 6th March 1918 as Army Corps of Aviation, independent service branch since 4th May 1928. motto: Qualitas Potentia Nostra Quality is our strength  Swastika I’ll start by addressing the huge blue swastika in the room. SKIP this section if you are easily upset and fear that you might get angry. At some point I’m going to claim that Soviet Union was an oppressive regime for instance, so if that offends your religious views - you’ve been warned.  First, note: it is horizontally-vertically aligned, not diagonal like the one Nazis used. It was the symbol of Eric von Rosen, a Swedish count who first carved swastika to all his belongings in 1901 on his trip to South America. Later as Finland gained it’s independence von Rosen gave the fresh republic it’s second aircraft, Thulin Typ D. This would mark the beginning of Finnish Air Forces and the plane carried von Rosen’s personal good luck charm - the swastika. It was adopted for Finnish Air Force’s use and yes it is still in use because it has no association with Nazis and our government managed to miraculously stay democratic and our country unoccupied through the entire Second World War. However on planes the swastika has been replaced with a bullseye targets so our enemies know where to aim:  It is also true that von Rosen became acquainted with Herman Göring, the huge Nazi. By the time that Göring noted to Hitler of seeing von Rosen’s swastika in 1920 Hitler had already adopted the Nazi swastika.  One of the most offensive and disgusting symbols ever known. At the same time it is obvious that these are not exactly the same symbol. For instance:  vs  Americans and Soviets clearly think that by merely changing the color of their pentagram star symbol it stands for very different things and kinds of regimes. Soviet one standing for ruthless oppression of hundreds of millions of people via military might and terror of secret police while the white one stood for democracy and freedom. Either way, neither Soviets or Americans would have considered abandoning their own version of pentagram just because it resembles this:  Anyway… now that the symbolism is out of the way and everyone is angry and upset I’ll continue to the answer part…  Equipment of Finnish Air Forces in 1939 Finnish Air Forces had 120 aircraft. Of these only 80 were considered suitable for use in war. There were 36 fighters, 29 recon and utility planes and 14 bombers all in all. Fighters  Fokker D.XXI was the mainstay of FAF with 36 aircraft. It had fixed gear and was outdated by the time of war.  Bristol Bulldog was the second type of fighter available, they were obsolete and there were only 10 available. Bombers  Bristol Blenheim I was a modern medium bomber and FAF had a mighty arsenal of 14 of them, clearly Soviet planners feared that their cities would be leveled by this armada of city killers which prompted their surprise attack to “secure territory around Leningrad”.  Fokker C X was a horribly outdated and slow reconnaissance and bomber plane with fixed landing gear, 29 were available when the war started. Other aircraft  There were some 24 planes in total of types that were used for transportation and reconnaissance such as the Junkers W 34 in this picture.  Soviet Air Forces in 1939 Soviet Air Forces were estimated to have roughly 5,000 aircraft in 1939. Of these it is estimated that 800 aircraft were given for Leningrad Military District for use against Republic of Finland. This force breaks up to 500 fighters, 200 bombers and 100 various reconnaissance and utility aircraft. Fighters  Polikarpov I-16 “Rata” was a commonly encountered and advanced Soviet fighter in Winter War, considered revolutionary a few years earlier when first introduced as being world’s first low-wing cantilever monoplane fighter with retractable landing gear to reach operational status.  Polikarpov I-15 and it’s many versions was also a common sight on Finnish skies but it was clearly inferior to I-16 and was already out of production and being phased out. Bombers  Tupolev SB-2 was a fast medium bomber and the mainstay of Soviet bomber fleet encountered during the war, when introduced in 1934 it was one of the best bombers in it’s class in the world.  Iljushin DB-3 was a long range medium bomber, it wasn’t as good as SB-2 but had 50% more range.  Iljushin TB-3 was an obsolete heavy bomber but it could carry more than three times the bomb load of SB-2.  Strength comparison Finnish Air Forces had a total of 80 aircraft suitable for war. Finns did not engage in any significant bombing with their bombers, the main non-fighter missions were reconnaissance of enemy movements. This meant that the 36 fighters and 10 biplanes of Finnish Air Forces had to face 500 Soviet fighters and 200 bombers as the war started. Yet the Soviet Air Forces under Leningrad Military District could rely on the more than 4,000 aircraft elsewhere in Soviet Union for reinforcements and indeed by the end of Winter War the bomber fleet involved was increased to 950 active bombers. Finnish reinforcements After the cowardly surprise attack by Soviet Air Forces against a number of Finnish cities and civilian targets Republic of Finland proceeded to purchase as much hardware as it could to fight the Soviet invasion, including fighters.  Brewster F2A-1 Buffalo. Because US federal law forbade them from selling aircraft that had been already delivered for their own units. The order for the planes was made as soon as Soviets attacked - before Finland was officially at war which meant that it was still possible for them to sell military hardware. Roosevelt himself became involved in trying to get the deal through and Finns were able to purchase planes that were already under assembly. 44 were ordered but Finns were surprised as the delivered planes had been stripped of weapons, gunsight, gauges and even the engine was downgraded as the original engine was banned from being exported. None of the aircraft managed to arrive in time to take part in actual fighting but later during Continuation War the Buffalos would score 32:1 ratio against Soviets.  Fiat G.50 started arriving into Finnish arsenal since 11th February - considering the war ended 13th March they barely managed to fight a month. A total of 34 aircraft would enter service with one being lost while the planes shot down 11 enemy aircraft.  Gloster Gladiator Mk. II - 20 aircraft were ordered from Great Britain during the war but Great Britain decided to gift 10 more aircraft when Finnish government requested for more aircraft, the planes arrived in January and February 1940. Another batch of 30 aircraft was ordered but the war ended and Great Britain needed those planes for itself. Gladiators flew more than 600 sorties downing 34 aircraft for the loss of 13. Swedish volunteer unit Flygflottilj 19 operated their own 12 Gladiators and 5 Hawker Hart bombers which were property of Swedish Air Forces - Flygvapnet. The unit was responsible for the defense of entire northern Finland. They shot down 8 aircraft.  Morane-Saulnier M.S.406 was a French fighter developed in 1935. France donated 50 aircraft of this type to Finland but only 30 ever arrived, arrival was in Ferbruary 1940, roughly a month before the war ended. The plane was reported to have excellent stability and turn rate but it suffered from unreliable weapons, shaking and twitching while firing and aiming. The engine was underpowered and there were issues with the radio. It was a good plane in 1935 but outdated by 1939. After Winter War the plane was upgraded to “Mörkö-Morane” or “Spook-Morane” by Finns to avoid abandoning it’s use due to high casualties, the results of engine upgrade were great but the final issues weren’t resolved until spring 1944. Finnish Air Forces strength at the end of Winter War Fighters 44 Brewster F2A-1 Buffalo 19 Bristol Bulldog 97 Fokker D.XXI 35 Fiat G.50 42 Gloster Gladiator 5 Hawker Hart 30 Morane-Saulnier M.S.406 12 Gloster Gladiators of Swedish Air Forces 5 Hawker Harts of Swedish Air Forces Total 272 Finnish Air Forces fighters and 17 Swedish Air Forces fighters for a total of 289 aircraft of which 225 were operational. Bombers 97 Bristol Blenheim Mk. I and IV 39 Fokker C.X Total 136 bombers.  Wartime performance Strategic performance Finnish Air Forces were completely unable to prevent Soviet Air Forces from bombing any target they wanted to. As a result they bombed urban centers, railroad junctions etc. with near impunity and with complete air superiority through the war. Soviet Air Forces committed to terror bombings of Finnish cities to break Finnish morale. Cities were bombed with massive air raids utilizing fire bombs. Especially Viipuri was badly damaged, eventually the city was evacuated as the damages grew too vast. Due to Soviet Air Forces having more than 500 fighters for escort and roughly a thousand bombers at their disposal the Finnish Air Forces could not protect the civilian population from Soviet air raids. What Finnish Air Forces were capable of doing was to challenge the Soviet Air Forces with their presence. Through the war they would be deployed and would typically engage enemy formations ranging from a handful of planes to more than hundred planes at a time. Sometimes Finnish fighter pilots might engage hundred enemy aircraft with only four fighters. It was noted that in the confusion they witnessed sometimes Soviet fighters accidentally chasing and firing their own aircraft. Finnish Air Forces did engage in small scale bombing of the enemy forces, especially when Soviet aircraft would be grounded due to poor weather. Fighters were used to strafe attacking Soviet infantry especially if they were trying to cross ice - the infantry had no cover, moved slowly in the snow and sometimes the ice might break. No proper protection could be offered for Finnish Army. The only protection ground forces had against Soviet aircraft were the few antiaircraft weapons they had. Even Finnish Navy was primarily dedicated for air defense duty, sitting in Turku harbor to relieve antiaircraft weaponry to other cities. Due to the contrast in numbers between Finnish and Soviet aircraft Finnish antiaircraft batteries had a tendency of firing at all aircraft they saw - they were most likely Soviet. This resulted in some unnecessary casualties for Finnish Air Forces. FAF constructed through the war a number of fake airfields with fake aircraft made of plywood. Soviet reconnaissance aircraft would locate these airfields and they would commit bomber resources to destroy the plywood planes. This reduced pressure against actual FAF airfields. Operative results According to Finnish Air Forces statistics they shot down 218 Soviet aircraft, some estimates claim up to 280 shot down. 165 of them were bombers, 42 fighters and 11 were reconnaissance aircraft. Finnish casualties amounted to 62 aircraft lost and 35 damaged with 72 deaths and 22 wounded. Soviet Air Forces shot down 35 aircraft and their antiaircraft fire scored 8 victories. In comparison Finnish antiaircraft fire claimed 314 aircraft shot down. So, in the air the victory to casualty ratio is 218 to 35 or roughly 6:1 in favor of Finnish Air Forces while facing more than 14 to 1 odds in the quantity of fighters.  Summary Considering the Finnish Air Forces maintained operative capacity and managed to grow in size despite crushing numeric opposition while fighting mostly with outdated and obsolete aircraft it would be a fair assessment that Finnish Air Forces did exceptionally well with what they had. They could not stop Soviet bombers from engaging any target they wanted to but throughout the war they rose up to the skies and engaged the Soviets regardless of odds. Qualitas Potentia Nostra Pilots and personnel of Finnish Air Forces are the bearers of a great legacy. I salute you!  ",
            "date": "Answered July 13, 2016",
            "views": "45",
            "upvotes": " View 55 Upvoters",
            "upvoters": [
                {
                    "user_id": "Per Ola Strömberg",
                    "user_href": "/profile/Per-Ola-Strömberg"
                },
                {
                    "user_id": "Susanna Luhtanen",
                    "user_href": "/profile/Susanna-Luhtanen"
                },
                {
                    "user_id": "Quinn Walker",
                    "user_href": "/profile/Quinn-Walker-6"
                },
                {
                    "user_id": "Joseph Kane",
                    "user_href": "/profile/Joseph-Kane-54"
                },
                {
                    "user_id": "Ville Hemmilä",
                    "user_href": "/profile/Ville-Hemmilä"
                },
                {
                    "user_id": "Jan Melart",
                    "user_href": "/profile/Jan-Melart"
                },
                {
                    "user_id": "Heikki Kultala",
                    "user_href": "/profile/Heikki-Kultala-1"
                },
                {
                    "user_id": "Markku Hänninen",
                    "user_href": "/profile/Markku-Hänninen-1"
                },
                {
                    "user_id": "Nick Pehar",
                    "user_href": "/profile/Nick-Pehar"
                },
                {
                    "user_id": "Hannu Mononen",
                    "user_href": "/profile/Hannu-Mononen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Moore",
                "href": "/profile/Alan-Moore-18"
            },
            "answer_text": "Finland produced more fighter aces (5 or more kills) per every 100 pilots than any other nation in WW2, not only in the Winter War but also in the Continuation War. Many countries donated aircraft to the Finns, planes from Italy, France, Britain and the USA during the Winter War and from Germany during the Continuation War and from the Soviet Union after Finland changed sides. Finland ended World War 2 with more foreign aircraft types in its service than any other nation.  (Lt J Sarvanto shot down six Soviet Db-3 bombers in one sortie whilst flying a Dutch Fokker XXI.. The XXI formed the bulk of the Finnish fighter strength on the eve of War. Finland had 90 of these aircraft at their disposal. The XXI was considered obsolete by some but it preformed well in the war against the Soviet Union. The DB-3 bomber would prove to be as obsolete as many of Finland’s aircraft, it suffered terrible casualties at the hands of Finnish and later after 1941 German fighters. The Blue Swastika has nothing to do with the Nazi party, the Swastika is a 3000 year old Hindu symbol that is supposed to bring good luck. Latvia also used a swastika, a red one and the American 45th infantry Division used a yellow swastika in a red background, (below) the 45th though changed their divisional sign when the Nazis rose to power in Germany . Painting by Sture Gripenberg.)   (Two Fokker XXIs await a mission in the snows of the Winter War. The Fokker XXI was poorly armed, with just four machine-guns but it was nimble and in the hands of a good pilot the XXI proved a deadly adversary. Painting by Karl Vertanen.)  (A Close up of the Fokker XXI in Winter War Markings.)  (One of the countries to send planes to Finland was Great Britain. Here a Gloster Gladiator fitted with skies from fighter Squadron F-19, a squadron of Swedish volunteers flows over the DB-3 it has shot down. The pilot of the Gladiator was Swede Gideon Karlsson went on to shot down another three Soviet bombers during that sortie. Finland received 30 Gladiator Mk IIs during the conflict. Painting by Sture Gripenberg)  (Some Gloster Gladiators went on to serve in the Continuation War as is evident on this Gladiator by the orange strips on the fuselage and yellow cowling used on Axis aircraft on the Eastern Front. Painting by Karl Vertanen.)  (Gloster Gladiator of the Swedish Voluntary Wing. These were mostly Mk IIs.)  (A number of Soviet aircraft were shot down or crashed landed in good condition behind Finnish lines and after being repaired were put into the service of the Finnish air force. Finland, always short of aircraft was happy to use them, this is a Polikarpov I-153 after shooting down a Soviet DB-3 bomber during the Continuation War. Painting by Sture Gripenberg.)  (France also donated aircraft. This fighter is a Morane-Saulnier MS 406 seen attacking a train on the Murmansk railway. Finland received 50 of these aircraft from France, 30 of which saw action in the 1939–1940 Winter War. The MS 406 was well liked by the Finnish pilots, a number of whom made it to ace flying this aircraft. Painting by Sture Gripenberg.)  (Yet another country that donated aircraft during World War Two was Italy. Finland received 25 of Fiat G.50s. However the G.50s arrived too late to see service during the Winter War they gave valuable service in the Continuation War, shooting down 88 Soviet aircraft for the loss of just three G.50s. Painting by Sture Gripenberg)  (Probably the most famous Finnish fighter of the Winter War and the Continuation War was the American Brewster Buffalo. This aircraft performed badly against the Japanese in the hands of British, American and Dutch pilots during the early weeks of the war in the Pacific but in Finnish hands against the Soviets it did extremely well. The Finns really liked the Buffalo and Buffalo pilots achieved a impressive kill ratio against more modern Soviet and Allied Lend-lease designs like this Soviet British built Hawker Hurricane shot down during the Continuation war by ace Sgt. Eino Ilmari Juutilainen {94} kills.} Painting by Sture Gripenberg)  (Along with the Gloster Gladiators Great Britain also sent Hawker Hurricane, like this one down a Soviet Polikarpov I-153 in the Continuation war. The Hurricane had only a modest success in Finland, because most only arrived in the country near the end of the Winter War and after the German invasion of the USSR on the 22nd June 1941 and the start of the Continuation War Britain along with Canada, New Zealand and Australia declared war on Finland so getting spares for their Hurricanes was a major problem for the Finns. Painting by Sture Gripenberg.)  (Finland also had a number of bombers, like this British Bristol Blenheim in Continuation War markings seen in Tikkakoski Finnish Aviation Museum.) ",
            "date": "Updated March 3, 2020",
            "views": "81",
            "upvotes": " View 89 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Laura Martin Wilkinson",
                    "user_href": "/profile/Laura-Martin-Wilkinson"
                },
                {
                    "user_id": "Miro R",
                    "user_href": "/profile/Miro-R"
                },
                {
                    "user_id": "Heikki Seppälä",
                    "user_href": "/profile/Heikki-Seppälä-1"
                },
                {
                    "user_id": "Sami Nikander",
                    "user_href": "/profile/Sami-Nikander"
                },
                {
                    "user_id": "Roy Tapio Kosonen",
                    "user_href": "/profile/Roy-Tapio-Kosonen"
                },
                {
                    "user_id": "Ilkka Liljander",
                    "user_href": "/profile/Ilkka-Liljander"
                },
                {
                    "user_id": "Nadir Luukkonen",
                    "user_href": "/profile/Nadir-Luukkonen"
                },
                {
                    "user_id": "Toni Alho",
                    "user_href": "/profile/Toni-Alho"
                },
                {
                    "user_id": "William Petrak",
                    "user_href": "/profile/William-Petrak"
                },
                {
                    "user_id": "Willem Ketelaars",
                    "user_href": "/profile/Willem-Ketelaars"
                }
            ]
        }
    ]
}