{
    "title": "How can we prove that a historical event really happened? - Quora",
    "tags": [
        "Historical Events",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Schnider",
                "href": "/profile/Jack-Schnider-1"
            },
            "answer_text": "Proving is hard, as you can interpret history pretty liberally. In many cases, an event is “proven” because no one disputes it. “You got a better idea of what happened?” While that statement may be fallacious, it is the philosophical basis of a lot of our historical assumption. No one disputes Alexander the Great existed as a real human, despite our evidence for him being for centuries after his death. Despite this standard of evidence, there are many people (on Quora) who want to dispute that Jesus of Nazareth existed, despite abundantly more evidence he did than Caesar or Alexander. Such reveals the state of archaeology, from poor and fringe examples of historians, and “history-buffs” who like to answer questions on websites. Genuine historians and archaeologists, of course, normally operate on much higher standards, rather on political whims. —————————————— If we ignore our political desires, archaeology and history is just a matter of working out what is most likely, and then going off that basis. It is more likely that Alexander the Great existed, than that he was a myth, for example, so we assume he did exist and most of the feats attributed to him happened, more or less. So, it’s just detective work to figure out what is the most likely explanation, the Occam's razor that doesn’t conflict with other histories. Writing is the best source, as it tells us, sometimes in much detail, what happened and why. Very often you can trust the sources, as archaeology has proven time and again. Many people scoffed at the idea of the Hittite Empire, one of the great empires of the ancient world, but today we have abundant evidence of it, and it was found that Egypt acknowledged it as an equal empire. They decided Troy was a mythical city, until someone decided to go to the place described, and checked—found a massive archaeological site within a mile of where the directions pointed him. They have similarly questioned other things, generally due to political inconvenience. But it’s hard to fool good archaeology. The last thing we have is theory and reconstruction. There have been some great examples of that, including people sailing around the world on little rafts to show how it was far easier to get around than we expected. If you can do it, there’s a good chance ancient people could. ——————————— That sums up all the methods, really. I could’ve gone into subsets of archaeology, like Art. I will get into Art, here: Don’t trust Hollywood too far. ",
            "date": "Answered January 19, 2020",
            "views": "50",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Anna Emdenborg",
                "href": "/profile/Anna-Emdenborg"
            },
            "answer_text": "Wow, this is the core. The core of epistemology. The latter is the subject within philosophy that examines (has been doing the last over 2000 years - which gav us also science) where the boundaries of HUMAN knowledge has to be drawn. You see the complex matter at hand is much more complex that people actually understand. And I will give you an example from real life that seems not have (at first glance) bearing on the case. But it does because it actually shows something important as to the issue. I will use the real life - very close in time to our own time - case of John Demjanjuk. Read more here: John Demjanjuk - Wikipedia He was not convicted in Israel, rightfully, because the judges found that the eyewitnesses were not correct and coherent in their statements. And given the accuracy and the correctness of the jewish judges - they simply found him (on the basis of the eyewitnesses)not possible, to convict guilty. But the German court ruled differently and convicted the man. On basis of papers. Not witnesses. Why is this case important? Well it is important due to the complexity of humans and their perceptions, their ability of correct memories, their abilities of logical thinking (or not), their intentions based on feelings etc. Papers are papers. They are there as a document of what was, how it was at that time and who did what, how and why and what for. Blunt. Now - depending on what sort of papers we are talking about we can find out about the passed. History. Because what took place often is written down - and the realm of the subject at hand will also give a context to “why” for what purpose. Let's take another example. We want to find out whether there is - or not - a truth in the claims of land of the Palestinian - ARABS. Because Palestinian means: christians, druses, jews and arabs. Due to the fact that before Israel (we know it existed and had that name from the documents of the Bible and the Quran) inhabited mostly by jews - re-emerged into existence as a country - the Roman empire had renamed the land into Palestina. We know this based on PAPERS - DOCUMENTS from that very time. We take the example of the claims of arabs stating that they are Palestinians - they are today more or less almost 6 million people. Are they Palestinians? Born from a line of arabs who had that land and lived there always? The documents of the British from 1920 show something else. They are documents of statistics and a inventory of population in Palestina. There were a hundred years ago some 600.000 arabs living in the country of, at that time, called Palestina. So - you make a small calculation and tell me how these (mostly beduins therefor not farmers living in one place) have managed to procreate in 100 years to become 6 millions? Does this show us something in relation to history? And the claims of land? Then we have the documents showing jews buying land in Palestina - already in the 1800, and we have the rest of all the documents that show different issues in regard to how Israel - re-emerged into existences. Funny enough this concrete happening was - ALREADY - described in the Quran and the Bibel - that this should take place (at that time it was written - in the future) - obviously the “future” is now. You might ask yourself how it can be such that documents of a certain kind seem to “predict the future”? Or you might just used them to prove that there was such a land - at the time when the documents were written - being a well known fact to people in that region. Either way - the documents prove something. Regardless of the retoriks of people of today and their “moderation of facts” to suite some sort of agenda. Now to the core of this “problem”. We want to know exactly what happened at a certain point in time in history. Then the detective work that has to be done has to be based on many sources - paperwork (if present) or other information verbally expressed in some ways from different involved people, facts we find that can be connected in some ways to statements or such as documents proving constructions etc. And letter people have written - common people - for instance. And then you will have to put all the pieces together and have a theory. Such a theory can then be falsified or proven when put into the context of what is actually and factually the case or not. Good old police-work. So what is this with epistemology? Well… you see the problem is here that the core problem stated is: we base our “knowledge” on FEASIBLE (not proven) facts based on theories or hypothesis that will guide our conclusions in regard to something. Therefor knowledge (regardless if it comes from this time or times long gone) is normally based on what is going on exterior of our minds - and within our minds. We have to understand information - which is an inner, interior, mechanism in humans that is based on the faculty of language… :o) And depending on the paradigm we hold true - PLEASE NOTE THAT IT DOES NOT HAVE TO BE —- TRUE —- within science (for the moment) we will use that as a filter to understand what we examine exterior of our own being. Do you follow? So - my recommendation is: read documents, there is even “grafitti” from the Vikings in Constantinople when they worked as mercenaries there once upon a time. And from that we can - with other sources of input - draw conclusions to some extent in regard to many issues there and then. ",
            "date": "Answered March 25, 2020",
            "views": "138",
            "upvotes": " Answer requested by Lawson Shepherd"
        }
    ]
}