{
    "title": "How advanced was the Islamic world during the Middle Ages? - Quora",
    "tags": [
        "Islamic World",
        "History of Islam",
        "History of Religion",
        "Middle Ages (era)",
        "Ancient History",
        "World History",
        "Muslims",
        "Islam",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Inshal Khan",
                "href": "/profile/Inshal-Khan-1"
            },
            "answer_text": "Throughout the Middle Ages, the Muslim world was more advanced and more civilised than Christian Western Europe, which learned a huge amount from its neighbour. The Islamic world - a more advanced civilization Islamic World stretched from India to Spain.Muslim traders travelled to places as far apart as the Sahara, South Africa, China, Scandinavia and Russia.Muslims traded high-quality goods such as silk, carpets, ivory and spices.Knowledge of science and medicine in the Islamic world was far more sophisticated than in Western Europe.Cordoba in Muslim Spain was a city of over half a million inhabitants with street lighting and running water. At the same time 10,000 Londoners lived in timber-framed houses and used the river as their sewer.Muslims were going to beauty parlors, using deodorants and drinking from glasses, at a time when English books of behavior were still telling page-boys not to pick their nose over their food, spit on the table, or throw uneaten food onto the floor.Fatima Al Fihri (A Woman) founded a madrasa and university, (which just so happens to be the oldest continually running university to date), later becoming a centre of advances in thought in the Islamic world.Islamic paper makers devised assembly-line methods of hand-copying manuscripts to turn out editions far larger than any available in Europe for centuries. It was from these countries that the rest of the world learned to make paper from linen.As the Dark Ages ravaged Europe, Islam produced countess works of art, science, literature, poetry and architecture. But you know what they say about all good things. In 1258, the Mongols sacked Baghdad and destroyed the House of Wisdom. Legend holds that so many books were thrown into the Tigris River that it ran black with ink. The Caliphate was demolished. Had history played out differently, Islam might look very different indeed today.  Reference Islamic world contributions to Medieval Europe - Wikipedia BBC Bitesize - The Islamic world in the Middle Ages List of inventions in the medieval Islamic world - Wikipedia The golden age of Islam ",
            "date": "Answered January 26, 2019",
            "views": "856",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Baraka Khidir",
                    "user_href": "/profile/Baraka-Khidir"
                },
                {
                    "user_id": "Mohamed Samir Alzohary",
                    "user_href": "/profile/Mohamed-Samir-Alzohary"
                },
                {
                    "user_id": "Jots Roest",
                    "user_href": "/profile/Jots-Roest"
                },
                {
                    "user_id": "Jeroen van Hasselt",
                    "user_href": "/profile/Jeroen-van-Hasselt-1"
                },
                {
                    "user_id": "Azzan Ullah",
                    "user_href": "/profile/Azzan-Ullah"
                },
                {
                    "user_id": "Yusuf Thompson",
                    "user_href": "/profile/Yusuf-Thompson"
                },
                {
                    "user_id": "Mohammad Sohel Karim",
                    "user_href": "/profile/Mohammad-Sohel-Karim"
                },
                {
                    "user_id": "Dhi Yazan Al-Asbahi",
                    "user_href": "/profile/Dhi-Yazan-Al-Asbahi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nizar Dassouki",
                "href": "/profile/Nizar-Dassouki-1"
            },
            "answer_text": "The Islamic civilization had once headed the march of science and knowledge during the Middle Ages which are considered in Europe as the age of darkness while they are an age of enlightenment for our civilization. In this respect, it is worth pointing out that George Sarton, in his book : \"Introduction to the History of Science\", classified scientific accomplishments throughout history into several periods, each lasting half a century, and identified with the name of a scientist at a world scale. From 750AD to 1100 AD, i.e. 350 years, all token scientists were from the Islamic world: Jaber Ibn Hayan, Al Khawarizmi, Al Razi, Al Massoudi, Abou Al Wafa, Al Bairouni and Omar Al Khayam who were all Arab, Turkish, Afghan or Persian Muslims who excelled in various domains such as Chemistry, Mathematics, Medicine, Geography, Natural Science and Astronomy. From 1100AD on, and over another 250 years, Europeans started to appear alongside Muslim scholars such as Averroes, Al Tossi and Ibn Annafis. At this juncture, and at the outset of the European renaissance, Europeans started to translate, study and develop sciences so far practiced by the Islamic world. This established historical fact was affirmed and emphasized by the Muslim scientist residing in Germany, Dr. Mohamed Mansour, who was chosen by the Cambridge University as a member of 2000 international personalities who marked human life throughout the last century. Generally speaking, civilization is the yield of all efforts made by humans to improve their living conditions, regardless of whether such effort is intentional or not or whether its outcomes are material or moral. Therefore, the Islamic civilization is the blessed fruit of the efforts made by the Islamic Ummah throughout different ages to improve life and improve human conditions. Civilization being a response to human needs, the Islamic civilization has met all these needs at different eras and had been, for many decades, the uncontested leading civilization of the world. The Islamic civilization has therefore the privilege of setting up the cornerstone of modern European civilization since it had contributed through its achievements in the areas of medical science, pharmacy, chemistry, mathematics and physics, to the acceleration of the advent of the renaissance and the ensuing revival of different sciences which continued, since then, to develop and yield. ",
            "date": "Answered August 30, 2019",
            "views": "165",
            "upvotes": "0"
        }
    ]
}