{
    "title": "How old is the Hindu religion? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Sureshrao S",
                "href": "/profile/Sureshrao-S"
            },
            "answer_text": "I disagree that Hinduism is the oldest religion of the World. Logically speaking Hindu is the youngest religion of the world and only 70 years old. You may give any other name for the religion followed by only Brahmins till independence of India. Most of the people reading might get angry on me if you are Hindu from India and others nationalities might get surprised. For them I just ask them to find what their ancestors worshiped three generations before i.e. before a century and what traditions they followed Let us see logically. In actual you have to get into reality and open mind to accept this truth. Around 80% of today's Hindus(88% of Indian population are Hindus) are descents of local tribes and have gods of their own. The numbers are told to the world according to categorization of people as Hindus as per Indian constitution during 1930s. Here I took the population of Buddhism, Sikh, Jain etc. under Hindus. For so called upper-cast people for their facility they themselves called Hinduism is old and looting other people traditions of India. Example they brought all tribal worshiping methods under one umbrella called Hindu after getting independence from British in 1947. Before what is the situation. We see logically with two different angles. I. First with the people who are called Hindus with their numbers based on Caste system People who were called as lower castes and backward classes were never allowed inside a Temple till 19th century for worshiping purposes. So you have to reduce their numbers. 70% of Indians are from Lower castes-SC,ST - 29% and backward classes-41%. They had their own god in their village or Taluk, worshiping traditions and ancestors worshiping. (according to survey in 2007). Even some argue 41% backward classes are allowed temple entry, yes they are allowed but not to the sanctum of Siva and Vishnu temple. Only Brahmins can go inside and touch the statue of God. Every caste own Deity of their own. OBCs form 41% of population: Survey - Times of India Now remaining 30% Population if you remove other two major Religions Viz. Islam, Christianity. We come to 18% of Indian population are of upper castes. So they are all called Hindus who are only 18% of the total Indian population. all other are categorized as Hindus since they dont know the other name to be given to them during Independence. Let us to the 18% Hindus. The 18% Hindus will never go to the temples of the remaining 70% lower caste Hindus temples. To be specific now we categorize as Hindus. Out of this 18% again we divide them into half for the easy understanding purpose.i.e. 9% each. One 9% group worship - Lord Shiva Another 9% Hindus worship - Lord Vishnu and its avatars Rama/Krishna etc. Either of these two categories will visit the others temple. I.e. One who worships Lord Shiva will not go to Lord Vishnu temples. So now I guess one who reads will totally confused and reluctant to accept this truth. So what is the percentage of Hindus I leave it to your guess. II. Gods of Non-Brahmins -see below link and if interested go to further readings. https://nirc.nanzan-u.ac.jp/nfile/759 The Village Gods of South India Village deities of Tamil Nadu - Wikipedia  The above picture is an example from South India. In the same way there are local gods of each states inside India. Brahmins - so called upper castes will never visit these temples. But the people of Lower castes go to Temples of Upper caste nowadays where they have no reservation in praying gods. Even some non-Brahmin Hindus go to church, Mosque etc. The temple entry to lower caste people is achieved due to enforced law by indian constitution and abolish of some practices by British under British India. Etymology. The word Hindu is derived from the Indo-Aryan/Sanskrit root Sindhu, the Indo-Aryan name for the Indus River in the northwestern part of the Indian subcontinent (modern day Pakistan and Northern India). This is what you will get answer when you google it. If we prove Sanskrit is not older than 3 century BC and the sanskrit vedic period is absurd we can find Hinduism age. Hence for conclusion, the religion is only So called Hinduism and it is not practiced by all who are all categorized as Hindus. We never find the writings/inscriptions of Sanskrit before Gupta period i.e. 3rd century BC. if somebody have the scripts let us discuss on it. Most people claim Hinduism it is from Vedic period. The definition of Vedic period and years what the propagandists claim is absurd. There is no archaeological evidence to prove. Simple what they are telling is Propaganda, I can prove with Ramayan one of the great epic -what upper caste Hindus claim. They claim Ramayan happened 7300BC. if so that time there no need to build bridge between Srilanka and India. Lanka was connected to India already by land in 7300BC i.e. 9300 years before.The bridge between India and Lanka had been built by south Indian Tamil kings(Cholas) to conquer Lanka some where in between 3rd Century AD to 7th century AD. Which North Indian propagandists never accept. 2. Ramayana happend in 7300BC, What they have done for 7300 years and only wrote Ramayana in 1st century AD that too by a lower caste person Valmiki. 3. If Ramayana was written by Valmiki in Sanskrit i.e. what the claim. Easily can be proved that itself a absurd claim. How? Sanskrit was language taught to only to Brahmins by Brahmins till 19th century and education is bared even to other three varna peoples. Kshatriyas: rulers, warriors and administrators.Vaishyas: agriculturalists and merchants.[6]Shudras: laborers and service providers.So Sanskrit never a common people language. Hence Ramayana or Mahabharata were not written in Sanskrit first. Next, The interesting thing is Valmiki belongs to lower caste -Vedan(categorized as Dalit in modern India) is not even covered under above varnas. He belong to the fifth category-Avarna where he was not even allowed inside the villages where other 4 varna people lived in those days and even now in modern India. Imagine the lower caste people are not even let to live inside the streets of the villages in India even in this 20th century and whether we have to believe Valmiki wrote Ramayana in 1st Century in Sanskrit? The epics might have been existed in other language preexisted in the society used by common people. My guess is Valmiki might have written Ramayan either in Tamil or Pali which was commonly used language among people in those days. The stories were looted by Brahmins and written in Sanskrit when Chandra Gupta mauria adopted Sanskrit and used under his rule. Brahmins fooled the world that it is written by Valmiki(a lower caste person) in Sanskrit. Think logically and ask for evidence who wrote Ramayan. But on contrary if you can find Tamil inscriptions in pottery go at least 3800 years in Athichanallur burial ground i.e. 1800BC is one of the example(see the links for other sites dating back to same Harappa and Mohenjadaro period). Adichanallur - Wikipedia Keeladi - Wikipedia   Since Indian government which is predominantly North Indians and Sanskrit propagandists don’t want to rewrite history based on the archaeological findings. In fact they stopped funding these archaeological works. You have key to find the history of the world only through Tamil. 2,500-year-old labyrinth discovered in Dharmapuri   In conclusion Hinduism is not practiced other than Brahmins till 19th century and the age of Hinduism is only 70 years, yes only when all people are categorized as Hindus under Indian constitution after Independence from British. Please suggest a new name for the religion what Brahmins followed before Independence. Edit-1-30-May-2019 There are more than 7 major religions even today present in India. and present Hinduism is clubbed one ofthese major and all minor religions which have different gods by different tribes. Even today this is continuing and people never went to others temples till 18–19th centuries, the following are major religions Saivam- Shaivism - People worshiping Lord SivanVainavam-Vaishnavism - People worshiping Lord Perumal - Vishnu in northKaumaaram - People worshiping Murugan - mainly in South IndiaGyanapathiyam - Whorsipping Ganapathy-PillaiyaarSaatham/Shaktism - People worshiping - Ammans, Sakthi - Durgai, meenatchi, visalatchi, chottanikari amman etc.Souram- சௌரம் - தமிழ் விக்கிப்பீடியா - Worshiping SunSanatanam/Braminism - people worshiping Brahma & saraswathietc. minor tribal worshiping methods -Sureshrao S's answer to What is the Altar used for?Apart from that each group formed by relatives of adjoining villages have different Kula deivams.- family deity. ",
            "date": "Updated May 30, 2019",
            "views": "162",
            "upvotes": " View 95 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Niranjan James",
                    "user_href": "/profile/Niranjan-James"
                },
                {
                    "user_id": "Munnu Rules",
                    "user_href": "/profile/Munnu-Rules"
                },
                {
                    "user_id": "Krutika Jadhav",
                    "user_href": "/profile/Krutika-Jadhav-25"
                },
                {
                    "user_id": "Kalyan Rockzz",
                    "user_href": "/profile/Kalyan-Rockzz-12"
                },
                {
                    "user_id": "Ali Kaif",
                    "user_href": "/profile/Ali-Kaif"
                },
                {
                    "user_id": "Marian Anugraha",
                    "user_href": "/profile/Marian-Anugraha"
                },
                {
                    "user_id": "Akshay J Dinesh",
                    "user_href": "/profile/Akshay-J-Dinesh"
                },
                {
                    "user_id": "Saqlain Mostaque",
                    "user_href": "/profile/Saqlain-Mostaque-1"
                },
                {
                    "user_id": "Aasiya Husain",
                    "user_href": "/profile/Aasiya-Husain"
                },
                {
                    "user_id": "Gohel Kamlesh",
                    "user_href": "/profile/Gohel-Kamlesh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ananthasegaram Rajasegaram",
                "href": "/profile/Ananthasegaram-Rajasegaram"
            },
            "answer_text": "Hindu -Wort brought by British in India ( 1850, year. The people who are not catholic: /Buddhist/ Muslims / anther Region/ they were -Hindus-, this word before-1000, years no one used, only Britain calling the people in India as (Hindus), if you say god sivan/ Siwas, was the main god, there was a problem- , sivan / Siwas Not not Born in India , he had born in Ancient Egypt, how could India say the Hindu religion belong to them, there was no evidences, Sanskrit Scholars say sivan lived in Himalaya, that was not true? How can Sivan live in Himalaya with his family?, what tape food he ate? my point-( Sivan:/ Siwas/ Pheru/ Pharos), lived in ancient Egypt, He and his family lived in Egypt, there were lot of evidence in ancient Sumerian cuneiform and Hieroglyphics signs, and Sivan/ Siwas food/(Te)/ is -Nithu. ( This Nithu Food was ancient Sumerian national food), only the present day-( Elam Tamils) cock it, ancient Egyptians religion was Oldest, But ancient Australian Aboriginal religion also oldest religion, by the way both religion closer to Tamil religion-( Tamils are not Hindus- Indian minister ( one fool) told, so ancient religion was not Hindu religion-  This was ancient a sumerian Hieroglyphics sign and it was older than (3,000, to 4,000) old hieroglyphics sign, this sign show - the Sivan/ Siwas Lingam In top, Türkey Professor-( Kaya. Pote), say about- ( Mar duk/ Mur ugu/ Murugan),,one Ancient King/ god, truly this god - was Tamil/ Sinhala/ Mayan/ Chinese/ African, god, but he was not a North Indian god, and North Indian never go to this temple, ( one religion) difference scripts/ different people/ different gods, so which Hindu god was old, ?, ",
            "date": "Answered December 11, 2019",
            "views": "15",
            "upvotes": "0"
        }
    ]
}