{
    "title": "How were slaves treated in ancient Greece? - Quora",
    "tags": [
        "History of Slavery",
        "Ancient Greece",
        "Slavery",
        "Greece",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Stafford",
                "href": "/profile/Greg-Stafford-7"
            },
            "answer_text": "Slaves have never been treated well. Most were considered to be like work animals in a society with little regard for animals and thus were treated with harshness and cruelty. Household servants were treated better than field workers, miners, and other laborers. Even the best slaves were allowed to do only what their masters said, and physical abuse was common, sexual exploitation common, they could be given away and sold for any or no reason, and they could be killed for no reason whatsoever. In legal cases the confession or a slave was acceptable only if if he or she was tortured first. Some slaves were extremely well educated and did important work for their masters. Many of them were freed and given wealth and land when their masters died. Such individuals would have been educated before being captured, of course—slaves were not given education but worked according to what they already knew. Sometimes children were given to the care of a slave who continued to serve that person for life, with bonds of affection and respect between owner and slave. These individuals were rare, treasured, and even cherished. But they were definitely the exceptional minority, being statistically insignificant among the thousands and thousands of others treated as chattel. ",
            "date": "Answered May 21, 2018",
            "views": "15",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sten Reiter",
                    "user_href": "/profile/Sten-Reiter"
                },
                {
                    "user_id": "Ahmad Syazani",
                    "user_href": "/profile/Ahmad-Syazani-2"
                },
                {
                    "user_id": "Murat Çelik",
                    "user_href": "/profile/Murat-Çelik-6"
                },
                {
                    "user_id": "Sri Sarma",
                    "user_href": "/profile/Sri-Sarma-4"
                },
                {
                    "user_id": "Christoph Kohring",
                    "user_href": "/profile/Christoph-Kohring"
                },
                {
                    "user_id": "Shekhar Chandra",
                    "user_href": "/profile/Shekhar-Chandra-26"
                },
                {
                    "user_id": "Jason Benze",
                    "user_href": "/profile/Jason-Benze"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-847"
                },
                {
                    "user_id": "Dana Beehr",
                    "user_href": "/profile/Dana-Beehr"
                },
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-235"
                }
            ]
        },
        {
            "author_info": {
                "name": "Spencer Alexander McDaniel",
                "href": "/profile/Spencer-Alexander-McDaniel"
            },
            "answer_text": "It seems like it should be obvious that slaves in ancient Greece did not like being enslaved. Unfortunately, things that seem like they should be obvious are often things that many people don’t find obvious at all. There is a disturbingly widespread claim that slaves in ancient Greece were happy to be enslaved and that they preferred slavery over freedom. This claim recently received attention among classicists due to a description for a lecture by an esteemed classics professor for The Great Courses Daily, which begins with the shocking assertion “Slavery was the ideal condition for some people in ancient Greece.” The claim has been around for a very long time, however. It has been widely disseminated through books and other media and, despite the valiant efforts of some classicists to point out that ancient slavery was cruel and unjust, many people continue to regard it as benign or at worst a necessary evil.  Robert Garland’s ancient slavery lecture First, let’s talk about how this claim most recently got brought to attention. Robert Garland is a respected professor of the classics who teaches at Colgate University, a private liberal arts college in the town of Hamilton, New York. He has written many books about daily life in ancient Greece, including The Greek Way of Life (published in 1990 by Cornell University Press), Daily Life of the Ancient Greeks (published in 1998 by Greenwood Press), and Ancient Greece: Everyday Life in the Birthplace of Western Civilization (published in 2013 by Sterling). On 11 August 2020, The Great Courses Daily released a lecture by him titled “Classification of Slaves in Ancient Greece.” Many classicists were horrified to see that the description for the lecture on The Great Courses Daily website begins: “Slavery was an ideal condition for some people in ancient Greece. Poverty and disease were so prevalent in those days that people preferred to be slaves so that they could survive those hardships. This gave them a level of economic security in that poverty-stricken world.” I’m not making this up. This is real.  ABOVE: Screenshot of the description for Robert Garland’s lecture on ancient Greek slavery for The Great Courses Daily Robert Garland on slavery in his book Ancient Greece: Everyday Life in the Birthplace of Western Civilization I do not have a subscription to The Great Courses Daily and I have not listened to Garland’s lecture, so I don’t know what he says in it. I also do not know if he wrote the description for the lecture himself or if someone at The Great Courses Daily did that. I have, however, read Garland’s book Ancient Greece: Everyday Life in the Birthplace of Western Civilization. In fact, Garland’s book was one of the very first books about ancient Greece I ever read; I got it along with a bunch of other books for Christmas one year. I think I was in middle school at the time. It played a vital role in shaping my view of what life in ancient Greece was like. It is quite apparent from Garland’s book that he does realize what a brutal, dehumanizing institution ancient Greek slavery was. Nonetheless, for some reason, he still says some extraordinarily bizarre things in defense of it. On page 116 of my edition, Garland says this: “Our understanding of slavery in the Greek world is bedeviled by both Christianity and Marxism. Each imposes value judgments upon the institution, and these value judgments tend to distort our investigation of its place in ancient society. Christianity deplores slavery as barbaric and inhumane. Marxist historians identify slaves with the subjugated European proletariat of the nineteenth century. Friedrich Engels went so far as to allege that the moral and political collapse of the ancient world was chiefly caused by slavery.” “Neither the Christian nor the Marxist viewpoint does full justice to the realities of life in the ancient world, however. Abhorrent and vicious though the institution of slavery was in so many respects, it nonetheless provided some measure of economic security in an otherwise dangerous and unpredictable world.” “It would, however, be quite wrong to give the impression that slavery was a benign institution. The fact that ‘more than 20,000 slaves deserted, most of them skilled laborers’ (Thucydides 7.27.5) when the Peloponnesians established a permanent base at Dekeleia in Attica in 413 B.C.E. is testimony to widespread discontent, even if many of the refugees were mine workers. Nor does it seem to have occurred to anyone that the existence of such a large servile labor force depressed the wages of the poor—or, if it did, no one did anything about it.” “With the exception of Spartan agriculture and Athenian silver mining, there is little evidence to suggest that the Greeks depended on slavery for what Marxists call their means of production. Overall, therefore, it remains questionable whether the achievements of Greek civilization were made possible by slavery.” Although Garland is relying on real historical sources, there is a lot wrong with what he says here about ancient Greek slavery.  ABOVE: Photograph from Wikimedia Commons of an Attic black-figure neck amphora by the Antimenes Painter dating to between c. 530 and c. 510 BC depicting people (probably slaves) gathering olives Ancient slavery and choice Let’s start out by addressing something that Garland himself does not actually say, but that someone could wrongly assume from reading his words. Garland never says that ancient slavery was a choice, but the wording of the description for his lecture on ancient slavery certainly makes it sound that way, with its claim that some people “preferred” to be slaves. I therefore want to be very clear about this: ancient slavery was not a choice in any sense whatsoever. There were lots of different ways you could become a slave in the ancient world. Some people became slaves because they owed debts that they couldn’t pay. Other people were captured by pirates and sold into slavery. Other people were captured by enemy forces in war and taken as slaves. Other people were born into slavery. No one in the ancient world ever chose to be a slave. Anytime anyone became a slave, it was because someone else forced them to become one.  ABOVE: Photograph from Wikimedia Commons of a marble relief carving from the Greek city of Smyrna in Asia Minor dated to c. 200 AD showing a Roman soldier leading two captives who are likely destined for enslavement The “ideal” of enslavement? Moreover, slavery has never been “an ideal condition” for anyone. Some people have suffered less under enslavement than others, but no one who has ever been enslaved has thought of it as “ideal.” The only person who might consider slavery “an ideal condition” is an slaveowner who enjoys exploiting his slaves. The general view regarding slavery in the ancient world—even among slaveowners—was that being a slave was deeply unfortunate. In the Odyssey, book 17, lines 322–332, Odysseus’s slave Eumaios laments: “ἥμισυ γάρ τ᾽ ἀρετῆς ἀποαίνυται εὐρύοπα Ζεὺς,ἀνέρος, εὖτ᾽ ἄν μιν κατὰ δούλιον ἦμαρ ἕλῃσιν.” Here is my own translation: “Half indeed of a man’s excellence does far-seeing Zeus take awayon that day when he goes into slavery.” We don’t know who wrote this passage and it’s impossible to say how many people would agree with this opinion. Nonetheless, there can be no doubt that Eumaios’s words are an expression of a widespread belief that being a slave was unpleasant and deeply humiliating.  ABOVE: Illustration by the German artist Bonaventura Genelli showing Odysseus and Eumaios in Eumaios’s home when Telemachos comes to the door The treatment of the enslaved There is no such thing as a kind slaveowner. Forcing another human being to be a slave is inherently cruel and inhumane. Even if a master does not beat his slaves and he treats them with some level of dignity, by holding them as slaves at all, he is still treating them inhumanely. The extent to which Greek slaves were abused, however, varied considerably. Some masters were less cruel than others. Oddly enough, Robert Garland actually gives a reasonably good description of the kind of brutality they often faced. He writes in Ancient Greece: Everyday Life in the Birthplace of Western Civilization, page 112: “Overall the treatment of slaves must have varied greatly from one household to the next, depending in large part on the temperament of the owner. A less complimentary term than oikêtês was andrapodon, which means ‘a thing with the feet of a man’—as a dehumanizing a definition as could be devised.” “Although Athenian slaves were protected by law against violent abuse, in practice it was virtually impossible for them to lodge a complaint against their masters, because they could not represent themselves in court. Starvation and flogging were likely regular punishments for bad behavior. A runaway slave was branded with a hot iron upon capture. If a slave was required to be a witness in a lawsuit, his or her testimony was only accepted under torture. There are no actual descriptions of slaves being tortured, however, so we do not know what methods were applied.” So, according to Garland himself, slaves in ancient Greece were, at least in many cases, starved, flogged, branded, and tortured. I don’t see how any sane person could consider this “an ideal condition.” Moreover, this completely undermines Garland’s assertion that slavery provided the enslaved with “economic security.” What is “economic security” even supposed to mean to a person when their master can punish them for “bad behavior” by depriving them of food or flogging them, when they can be branded for trying to run away, and when they can’t testify in court unless they are subjected to torture? Things get even worse, though, because Garland is actually sugarcoating things a bit here; the source for his claim that Athenian slaves were “protected by law against violent abuse” is Pseudo-Xenophon’s The Constitution of the Athenians 1.10. Garland makes it sound like it was illegal for anyone to do any kind of violence against a slave, but the actual source makes it sound like it was only illegal for someone to attack someone else’s slave, which is quite a bit different. This is what Pseudo-Xenophon writes, as translated by E. C. Marchant: “Now among the slaves and metics at Athens there is the greatest uncontrolled wantonness; you can’t hit them there, and a slave will not stand aside for you. I shall point out why this is their native practice: if it were customary for a slave (or metic or freedman) to be struck by one who is free, you would often hit an Athenian citizen by mistake on the assumption that he was a slave. For the people there are no better dressed than the slaves and metics, nor are they any more handsome.” Whatever the case may be, it was certainly at least moderately common for slaves to be starved, beaten, scourged, and so forth. The comedies of Aristophanes (lived c. 446 – c. 386 BC) are full of jokes about these kinds of brutal punishments. His play The Knights, which was first performed in 424 BC, opens with a scene of two slaves complaining about how brutally their new overseer beats them and tortures them. In his play The Frogs, which was first performed in 405 BC, there is a scene in which the characters Xanthias and Dionysos, who are both thought to be slaves, compete to see who can bear the most strokes of the whip. These kinds of jokes only make sense if ordinary people were accustomed to the idea of slaves being physically tortured.  ABOVE: Detail of an Attic vase painting showing a scene from a comedy of a master beating his slave Perhaps the most startling evidence for the brutal mistreatment of slaves in ancient Greece comes from the medical writer Galenos of Pergamon (lived 129 – c. 210 AD), who lived during the time of the Roman Empire. Galenos writes in his treatise On Passions and Errors of the Soul, as translated by Paul W. Harkins: “When I was a young man I imposed upon myself an injunction which I have observed through my whole life, namely, never to strike any slave of my household with my hand. My father practiced this same restraint. Many were the friends he reproved when they had bruised a tendon while striking their slaves in the teeth; he told them that they deserved to have a stroke and die in the fit of passion which had come upon them. They could have waited a little while, he said, and used a rod or whip to inflict as many blows as they wished and to accomplish the act with reflection.” “Other men, however, not only (strike) with their fists but kick and gouge out the eyes and stab with a stylus when they happen to have one in their hands. I saw a man, in his anger, strike a slave in the eye with a reed pen. The Emperor Hadrian, they say, struck one of his slaves in the eye with a stylus; and when he learned that the man had lost his eye because of this wound, he summoned the slave and allowed him to ask for a gift which would be equal to his pain and loss. When the slave who had suffered the loss remained silent, Hadrian again asked him to speak up and ask for whatever he might wish. But he asked for nothing else but another eye. For what gift could match in value the eye which had been destroyed?” In this passage, Galenos reveals so much about the nature of ancient slavery. On one hand, he remarks about the brutality of other slaveowners, while, on the other hand, his own opinion that it is acceptable for a master to beat his slaves as long as he does so “with reflection” reveals that even many people who saw themselves as “responsible” slaveowners still cruelly mistreated their slaves.  ABOVE: Illustration from the Vienna Dioskourides, a sixth-century AD Byzantine manuscript, of the Greek doctor Galenos of Pergamon The horrors of ancient slavery go far beyond just physical beatings, however; slaves also had no right to refuse their master if he demanded sexual favors from them. (Of course, wives had no right to refuse their husbands either.) Many young male and female slaves were forced to work as prostitutes. Probably the best-known example of an ancient Greek slave who was forced to work as a prostitute is Phaidon of Elis, a teenaged boy who, according to the biographer Diogenes Laërtios, was captured and sold into slavery in around 402 or 401 BC. He was forced to live in a brothel and have sex with adult men until he managed to come into contact with Socrates, who convinced some of his wealthy friends to purchase Phaidon and set him free. He thereafter became one of Socrates’s students. He appears as a prominent figure in the dialogues of Plato and eventually went on to found his own school of philosophy, known as the Elian school. A girl named Neaira was born into slavery sometime in around 395 BC or thereabouts. When she was still a small child, she was purchased by a brothel-owner named Nikarete, who forced her to work as a child prostitute and have sex with adult men for Nikarete’s personal enrichment. She continued to work in Nikarete’s brothel until she was purchased by two men named Timanoridas of Corinth and Eukrates of Lefkada in around 376 BC. They forced her to work for them as a prostitute until, at some point in the next few years, they allowed her buy her freedom for a price of twenty minae. There were certainly many other young enslaved people who were sexually exploited for profit just like Phaidon and Neaira; we just don’t know about them because there aren’t detailed records. After all, ancient sex traffickers weren’t meticulous about documenting the ways they abused and exploited people. The only reason why we only know about Neaira at all is because, sometime between 343 and 340 BC, while she was living in Athens, she was brought to court under the accusation of illegally marrying an Athenian citizen and a man named Apollodoros delivered a speech condemning her titled Against Neaira. This speech is traditionally said to have been written by the famous Athenian orator Demosthenes, but it is widely suspected to have actually been written by someone else, possibly Apollodoros himself.  ABOVE: Tondo from an Attic red-figure kylix dated to c. 490 BC or thereabouts depicting a female prostitute (who is probably a slave) untying or retying her himation while her male client watches Possibly the slaves who were the worst off, though, were the industrial slaves who worked in the silver mines, who were forced to perform exhausting manual labor all day in hot, cramped conditions. The Greek historian Diodoros Sikeliotes (lived c. 90 – c. 30 BC) describes in great detail the horrors that slaves who worked in the mines in his own time suffered in his Library of History 5.38.1. He writes, as translated by C. H. Oldfather for the Loeb Classical Library: “But to continue with the mines, the slaves who are engaged in the working of them produce for their masters revenues in sums defying belief, but they themselves wear out their bodies both by day and by night in the diggings under the earth, dying in large numbers because of the exceptional hardships they endure.” “For no respite or pause is granted them in their labours, but compelled beneath blows of the overseers to endure the severity of their plight, they throw away their lives in this wretched manner, although certain of them who can endure it, by virtue of their bodily strength and their persevering souls, suffer such hardships over a long period; indeed death in their eyes is more to be desired than life, because of the magnitude of the hardships they must bear.” We don’t have any direct testimony from the actual slaves who worked in the mines, but I can almost guarantee you that none of them ever thought that enslavement was “an ideal condition.”  ABOVE: Corinthian terra-cotta votive tablet dated to the late seventh century BC depicting slaves working in a mine Now, it is true that there were some slaves in ancient Greece who lived relatively comfortable lives and who worked decent jobs as scribes, tutors to their masters’ children, and even doctors. Some slaves were even allowed to own businesses and live separate from their masters, as long as they paid a portion of their earnings to them. These people, though, were still slaves and, even if they legitimately enjoyed their work and found it fulfilling, I’m sure they would have enjoyed it much more if they had been able to do it as free people rather than as slaves. Furthermore, these people were still subject to arbitrary punishment if their masters were displeased with them and they had very few legal rights.  ABOVE: Terra-cotta figurine from the site of Pella in Makedonia of a paidagogos, a slave whose job was to look after the master’s children and act as a tutor Epiktetos and “economic stability” Now, there are a few ancient sources that superficially might seem to support Robert Garland’s repeated assertion that slavery provided the enslaved with “economic stability.” The Greek philosopher Epiktetos of Hierapolis (lived c. 55 – 135 AD) was born into slavery and eventually acquired his freedom. Like Socrates before him, Epiktetos never wrote down any of his own teachings, but his student, the Greek historian Arrianos of Nikomedia, writes in his Discourses 4.1 that he once said this: “ὁ δοῦλος εὐθὺς εὔχεται ἀφεθῆναι ἐλεύθερος. διὰ τί; δοκεῖτε, ὅτι τοῖς εἰκοστώναις ἐπιθυμεῖ δοῦναι ἀργύριον; οὔ: ἀλλ᾽ ὅτι φαντάζεται μέχρι νῦν διὰ τὸ μὴ τετυχηκέναι τούτου ἐμποδίζεσθαι καὶ δυσροεῖν. ‘ἂν ἀφεθῶ,’ φησίν, ‘εὐθὺς πᾶσα εὔροια, οὐδενὸς ἐπιστρέφομαι, πᾶσιν ὡς ἴσος καὶ ὅμοιος λαλῶ, πορεύομαι ὅπου θέλω, ἔρχομαι ὅθεν θέλω καὶ ὅπου θέλω.’” “εἶτα ἀπηλευθέρωται καὶ εὐθὺς μὲν οὐκ ἔχων, ποῖ φάγῃ, ζητεῖ, τίνα κολακεύσῃ, παρὰ τίνι δειπνήσῃ: εἶτα ἢ ἐργάζεται τῷ σώματι καὶ πάσχει τὰ δεινότατα κἂν σχῇ τινα φάτνην, ἐμπέπτωκεν εἰς δουλείαν πολὺ τῆς προτέρας χαλεπω τέραν ἢ καὶ εὐπορήσας ἄνθρωπος ἀπειρόκαλος πεφίληκε παιδισκάριον καὶ δυστυχῶν ἀνακλαίεται καὶ τὴν δουλείαν ποθεῖ.” Here is my own translation of the passage: “Every slave wishes to be set free immediately. Why? Do you think he is eager to pay the price of his manumission to the tax administrator? No! It’s because he imagines that, until then, he has been held back and ill. ‘If I am set free,’ he says, ‘everything will be good right away; I will turn for no one, I will speak to all men as an equal and one of their standing, I will go wherever I want, I will come whenever I want and wherever I want.’” “Then he is emancipated and, straightaway, having nothing to eat, he goes searching for someone he can flatter and get food from. Then he either works with his body [i.e. prostitutes himself] and suffers the most terrible things and, if he finds a manger, then he has fallen into a slavery much harsher than the first. Or perhaps he gets rich and, being an utterly tasteless human being, he falls in love with some petty girl and, being miserable, he whines and pines for slavery.” There are serious problems with interpreting this passage as evidence that some people “preferred” enslavement over freedom, however. We should remember that Epiktetos was not by any means a typical freedman; he was a devotee of Stoic philosophy. Everything that Epiktetos says about slavery must be interpreted with his Stoic philosophical beliefs in mind. As I discuss in this article about Stoicism that I published in January 2020, the Stoics believed that a person’s happiness is not determined by their material circumstances, but rather by their mental state. In other words, they believed that anyone could be happy, regardless of whether they were a slave or a wealthy person. What Epiktetos is trying to say here isn’t that slavery is inherently preferable to being free, but rather that being free does not automatically make someone happy and that a free person is still subject to the commands of other. He’s not saying that slaves were treated well or that slavery was somehow beneficial to the enslaved, but rather observing that slaves who had been set free would often quickly discover that freedom didn’t make all their problems go away overnight. I think he’s also poking fun at wealthy freedmen who would get hurt over the slightest things and forget about the horrors that they suffered while they were enslaved. Ultimately, his purpose is to argue that people need to adopt a Stoic philosophical outlook.  ABOVE: Imaginative portrayal of the Greek philosopher Epiktetos from the frontispiece to a book printed at Oxford in 1715 Slavery and Greek achievement Now, near the end of the first passage I quoted from Garland’s book, he alludes to an argument that I have often heard trotted out by defenders of ancient Greek slavery, who claim that the existence of a large enslaved population made the achievements of the ancient Greeks possible and that slavery was therefore a necessary evil. These people insist that slaves did all the work, which gave the upper classes time to philosophize, write great works of literature, and make inventions. On an individual level, there may be some truth to this in the sense that most Greek writers, philosophers, and innovators were wealthy aristocrats who owned slaves and who were only able to do the things they did because they didn’t have to work for a living. On the other hand, when this argument is applied to Greek civilization as a whole and is used as a justification for slavery, it becomes mind-numbingly stupid, because it assumes that only the wealthy elites in ancient Greece were capable of doing these things. It is true that most ancient Greek writers, philosophers, and innovators whose names are known today were aristocrats, but this does not mean that most ancient Greek aristocrats were great writers and philosophers. The reason why so many Greek philosophers who are famous were also wealthy is not because wealthy people were inherently philosophical, but rather because philosophical people who were wealthy were more likely to be able to pursue their philosophical interests than philosophical people who were not wealthy. There is plenty of evidence that many enslaved individuals in ancient times were capable of doing great things, but were held back by their status. After all, anyone in ancient times could be a slave, even a certifiable genius. Plato himself was at point briefly sold into slavery by the tyrant Dion of Syracuse, but the Cyrenaic philosopher Annikeris bought him for twenty minae and set him free. If that hadn’t happened, it is entirely possible that Plato could have lived out the rest of his life as a slave and never written any of his later dialogues.  ABOVE: Photograph from Wikimedia Commons of a Roman marble portrait head of Plato, based on an earlier Greek original Likewise, Epiktetos is one of the most famous Greek philosophers today, but yet he was born into slavery. We only know about him because he was able to earn his freedom. We can imagine there must have been countless other people like Epiktetos who could have become great philosophers, but who had the misfortune of having been born into slavery and who were never able to purchase their own freedom. As I discuss in this article from November 2019, the playwright Terence (lived c. 185 – c. 159? BC), one of the founders of Latin literature, was a member of the Afri, a Berber people who lived in North Africa, but, when he was very young, he was captured and sold as a slave in Italy. The only reason we know about him today is because his master happened to recognize his literary talents, so he educated him and eventually set him free. Again, we have no idea how many other people there were like Terence who could have become great writers if they hadn’t been forced to work as slaves. I don’t see how any person could reasonably argue that slavery was a necessary evil because it made the achievements of Greek civilization possible. If anything, slavery may have held Greek civilization back because of all the people who were capable of accomplishing great things but who were stuck working as slaves.  ABOVE: Fictional illustration of the Latin playwright Terence from a ninth-century AD illustrated manuscript of his plays The trope of the “happy slave” in contemporary culture Sadly, it is not surprising that the idea that slaves in ancient Greece liked being enslaved keeps popping up. After all, the trope of the “happy slave” is absolutely ubiquitous in our own culture. This trope was famously the basis for blackface minstrel shows throughout the nineteenth century. It is also prominent in works from the early twentieth century, such as the 1936 novel Gone with the Wind by Margaret Mitchell and the 1939 blockbuster film based on it. American school textbooks up until the 1960s routinely claimed that black people in the American South prior to the Civil War were happy to be enslaved. For instance, the seventh-grade Virginia history textbook Virginia: History, Government, Geography, written by Dr. Francis Butler Simkins and published in 1957, declares: “Life among the Negroes of Virginia in slavery times was generally happy. The Negroes went about in a cheerful manner making a living for themselves and for those for whom they worked.” Anyone who knows anything about slavery in the United States can tell that this is completely false. You can laugh at this and say, “Well, that was the 1950s. Everyone was racist back then.” The problem is that most of the people who were taught using this textbook and others like it are still alive and there are many people who still think this book is an accurate history. A review of the book on Amazon published in August 2017 declares: “This book was both informative and correct in how the history was presented. I am not racist and never have been. All slaves were not mistreated, and I think that was also his [i.e. Dr. Simkins’s] perception. He spoke of carpetbaggers and scalawags, and I agree with Dr. Simkins that they were of ‘no use’ to the South after the end of the Civil War and during Reconstruction. My classes were integrated, and there were absolutely no problems using this text book. The book is clear and concise and was easy to use, especially for a first year teacher.” I think that, as a general rule, anytime you feel the instinctive urge to say “I am not racist and never have been,” chances are, you’re defending something that’s really racist. Thankfully, nowadays, slaves are generally no longer portrayed as happy about their enslavement in United States history textbooks. Unfortunately, they are still routinely portrayed this way in introductory Greek and Latin textbooks. For instance, the Cambridge Latin Course is a series of introductory Latin textbooks that were first published in 1970 and that are still among the most widely used Latin textbooks in the English-speaking world. The series seeks to teach students Latin through a continuing story about a Roman man named Caecilius and the other members of his household, including his slaves, who are portrayed as perpetually cheerful. Slavery is completely normalized and there is barely even the slightest hint at its cruelty.  ABOVE: Illustration from the Cambridge Latin Course of a couple smiling slaves with the caption “servi erant laeti,” which means “The slaves were happy.” I think that most students probably realize that the story presented in Cambridge Latin Course is fictional, but other textbooks explicitly state the happiness of slaves as though it were an established historical fact. For instance, the New Zealand classicist Peter Gainsford points out in this article from June 2020 that the third edition of the widely-used introductory Greek textbook Athenaze, published in 2016 by Oxford University Press, states in chapter two: “It would be wrong to assume that slaves were always treated inhumanely. […] Slaves and citizens often worked side by side and received the same wage, as we learn from inscriptions giving the accounts of public building works. Slaves might save enough money to buy their freedom from their masters, though this was not as common in Athens as in Rome.” “In the country, the slaves of farmers usually lived and ate with their masters. Aristophanes’ comedies depict them as lively and cheeky characters, by no means downtrodden.” Wait. What? These are the same plays I referenced earlier that are full of jokes about slaves being beaten and abused and, for some reason, Athenaze is saying that they are “by no means downtrodden”? This makes me wonder whether the authors of the textbook and I have been reading the same plays. Moreover, the fact that some slaves could earn money to buy their own freedom doesn’t mean they were treated fairly. If they had been treated fairly, they would never have been enslaved in the first place.  ABOVE: Front cover of the ancient Greek textbook Athenaze, which claims that ancient Greek slaves were “lively and cheeky characters, by no means downtrodden” Aside from Greek and Latin textbooks, the trope of the “happy slave” pops up in some of the strangest places in contemporary British and American popular culture. In traditional British folklore, there are spirits known as brownies, who are said to live in people’s homes and perform housework in exchange for offerings such as milk or cream. They are said to be fiercely loyal and to love their work, but it is said that, if they are presented with any kind of clothing, they will leave forever. That’s all well and good, but a rather disturbing reinterpretation of the brownie mythos can be found in the British writer J. K. Rowling’s Harry Potter books, which were written for children and published in a series between 1997 and 2007. In Rowling’s books, brownies are portrayed as slaves known as “house elves,” who enjoy their work and generally don’t want to be freed. Although the house elf Dobby is portrayed as wanting his freedom, this is portrayed as a being merely a result of the fact that his master, Lucius Malfoy, is violent and abusive and not a result of the fact that he instinctively wants to be free. Other house elves throughout the series are portrayed as having a strong disliking for freedom and a love for servitude. I’m not saying that Harry Potter endorses slavery, but it does present a version of slavery that feeds into the narrative of the “happy slave.” It may not come as a surprise, then, that J. K. Rowling earned a BA in classical studies from the University of Exeter in 1986. During her time studying the classics, she was almost certainly exposed to works that portray Greek and Roman slaves as happy with their enslavement. Indeed, for all I know, she may very well have learned Latin from the Cambridge Latin Course.  ABOVE: Scene from the film Harry Potter and the Chamber of Secrets of the house elf Dobby cowering at the feet of his master Lucius Malfoy. For some reason Dobby seems to be the only house elf in the series who actually wants his freedom. Possibly the most twisted and cringe-inducing high-profile iteration of the “happy slave” motif in recent years, however, comes from the 1999 movie Star Wars: The Phantom Menace, in the character Qui-Gon Jinn, a white man, saves the life of an alien named Jar Jar Binks, who bears a number of disturbing resemblances to racist caricatures of black people from the nineteenth and twentieth centuries. Jar Jar is portrayed as unintelligent, clumsy, and carefree—all traits associated with blackface characters in old minstrel shows. He speaks in a dialect of broken English that some people have compared to various dialects spoken by black people, including West African English, African American Vernacular, and Caribbean English. He even physically resembles the caricatures of black people from the late nineteenth and early twentieth centuries; he has dark skin except around his mouth, which is enormous and takes up half his face. He also has huge nostrils and long ears that look like dreadlocks. A common subject of jokes in blackface minstrel shows was the idea that black people were “uppity” and that they foolishly believed that were equal to white people just because they could walk and talk. Naturally, Star Wars indulges this trope as well; when Qui-Gon calls Jar Jar “brainless,” Jar Jar retorts, “I speak!” leading Qui-Gon to put him in his place, telling him, “The ability to speak does not make you intelligent.” Jar Jar insists on being Qui-Gon’s slave, telling him, “Mesa called Jar Jar Binks. Mesa your humble servant.” Qui-Gon tries to tell him he doesn’t want him as his slave, but Jar Jar insists that he must serve as Qui-Gon’s slave, saying “It’s demanded by da gods, it is.” I don’t think George Lucas made The Phantom Menace with the intention to promote racism and justify slavery; instead, I think he carelessly picked up elements of the racist culture in which he grew up and included them in his movie without thinking about the message they would send. The result is still the same, though; he’s promoting the false narrative that enslaved people like being enslaved and that they just offer themselves up for enslavement.  ABOVE: Image of Jar Jar Binks, a character from Star Wars who bears a disturbing resemblance to blackface characters in old minstrel shows. He is portrayed as dumb, clumsy, carefree, and happy to serve as a slave to the white man Qui-Gon Jinn. Conclusion The reason why the “happy slave” trope keeps recurring in our media is not because it is accurate; this trope was invented by enslavers in order to justify their enslavement of other human beings and it has absolutely no basis in reality. Nonetheless, it keeps getting recycled in all sorts of different forms. It appears in lectures by prominent scholars, in textbooks, in children’s novels, and in movies. It’s probably not accurate to say that all slaves in ancient Greece were always miserable, but whatever happiness they might have experienced certainly came not as a result of their enslavement, but rather in spite of it. (NOTE: I have also published a version of this article on my website titled “No, Ancient Greek Slaves Did Not Like Being Enslaved.” Here is a link to the version of the article on my website.) ",
            "date": "Updated August 21, 2020",
            "views": "84",
            "upvotes": " View 263 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wendy Weaver",
                    "user_href": "/profile/Wendy-Weaver-42"
                },
                {
                    "user_id": "Esther Joy Emesia",
                    "user_href": "/profile/Esther-Joy-Emesia"
                },
                {
                    "user_id": "Krishna Murthy",
                    "user_href": "/profile/Krishna-Murthy-405"
                },
                {
                    "user_id": "Charmaine Lemmie",
                    "user_href": "/profile/Charmaine-Lemmie"
                },
                {
                    "user_id": "Ivan Liong",
                    "user_href": "/profile/Ivan-Liong"
                },
                {
                    "user_id": "Jan Reggie Dela Cruz",
                    "user_href": "/profile/Jan-Reggie-Dela-Cruz"
                },
                {
                    "user_id": "Jessica Draper",
                    "user_href": "/profile/Jessica-Draper"
                },
                {
                    "user_id": "Jim Karpen",
                    "user_href": "/profile/Jim-Karpen"
                },
                {
                    "user_id": "Marius Iordache",
                    "user_href": "/profile/Marius-Iordache-1"
                },
                {
                    "user_id": "Jack Reynolds",
                    "user_href": "/profile/Jack-Reynolds-15"
                }
            ]
        }
    ]
}