{
    "title": "How strong was the Byzantine Empire? - Quora",
    "tags": [
        "Byzantines",
        "Empires",
        "Roman Empire",
        "Ancient Rome",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diptarka Hait",
                "href": "/profile/Diptarka-Hait"
            },
            "answer_text": "The Byzantine period of the Roman Empire lasted nearly a thousand years (285 AD -1453 AD by taking Diocletian’s partition date as the start point-though foundation of Constantinople in 330 AD or 395 AD are equally valid starting points) and as such its power waned and waxed (on both an absolute and relative basis) quite a bit. It was the strongest power on earth from whatever starting date you choose till the middle of the reign of Justinian[1]. The single reign of Heraclius (610–641) saw the Empire lose Egypt and Syria while nearly losing to the Persians, defeat the Persians decisively to recover all lost Eastern lands and lose all of it again to the Rashidun Caliphate. And the last Emperor in 1453 was left with defending the thousand year walls of a “city” of five thousand people, with no army save what Italian city states had given him. The animated gif here shows how the borders of the Empire fluctuated over time, as a crude approximation of military strength. https://en.wikipedia.org/wiki/Byzantine_Empire#/media/File:Byzantine_Empire_animated.gif We should also not equate strength with military power alone. The Roman Empire was always a military dictatorship and Byzantium had its fair share of soldier Emperors, but war was not particularly sought out for large periods of their history. Stephen Runciman went as far as to say: Ever since our rough crusading forefathers first saw Constantinople and met, to their contemptuous disgust, a society where everyone read and wrote, ate food with forks and preferred diplomacy to war, it has been fashionable to pass the Byzantines by with scorn and to use their name as synonymous with decadence. — Steven Runciman, The Emperor Romanus Lecapenus and His Reign: A Study of Tenth-Century Byzantium, 1988 (Taken from Wikipedia) There is some hyperbole in there (Byzantium was not a fully literate society-there was none before the modern era, but it was extremely literate-60% was the number I recall from the class) but the gist about them preferring diplomacy to war is true. Part of it was because overmighty generals mean civil wars (the list of such conflicts is loooong) and part was because war was not always economically profitable, compared to indirect vassalage and benefits (without actually having to deal with troublesome minorities). This, coupled with the general aversion Byzantine society had for the idea of Crusades meant that expansionism only occurred under aggressive Emperors, with ones like Constantine VII preaching “byzantine” diplomacy over conflict for the majority of the time-despite the Empire having substantially recovered by then (though he did let Nikepheros Phokas reconquer Crete, seeing the danger it posed to the Imperial navy in the Aegean). This may strike many to be a “weak” position-and indeed, the general trend of decay in the history of the Empire sort of supports this point. But we must also consider the fact that no one else had built an actual Thousand Year Reich-Vandal and Goth Kings, Persian Shahs and Arab Caliphs, Carolingian Emperors and Norman Lords, Seljuk Turks and Bulgarian Tsars-none had lived to see the demise of the Empire that they had fought, and often defeated in the field only to lose the peace. Byzantium was a survivor-even if that meant accepting weakness instead of going out with a bang (they did do that end, with Constantine XI’s last stand being epic material) at their height. Entropy ultimately brought it down like all other Empires, but it nonetheless lasted far longer than it had any right to, courtesy a combination of geography, diplomacy and war-instead of just using the latter. [1] Only because China was broken. It was also far beyond their power to conquer Persia or project substantial power beyond the Mediterranean and Black Seas. Within however, they remained supreme. ",
            "date": "Answered April 5, 2017",
            "views": "46",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mason Palmer",
                    "user_href": "/profile/Mason-Palmer-14"
                },
                {
                    "user_id": "Michael Joseph",
                    "user_href": "/profile/Michael-Joseph-375"
                },
                {
                    "user_id": "Alan Muldale",
                    "user_href": "/profile/Alan-Muldale"
                },
                {
                    "user_id": "Maitreya Bhoir",
                    "user_href": "/profile/Maitreya-Bhoir"
                },
                {
                    "user_id": "Moresh Poojari",
                    "user_href": "/profile/Moresh-Poojari"
                },
                {
                    "user_id": "Mitch Cohen",
                    "user_href": "/profile/Mitch-Cohen-20"
                },
                {
                    "user_id": "Rennie Wokpeh",
                    "user_href": "/profile/Rennie-Wokpeh"
                },
                {
                    "user_id": "Oscar Tercel",
                    "user_href": "/profile/Oscar-Tercel"
                },
                {
                    "user_id": "Kevin Lopez",
                    "user_href": "/profile/Kevin-Lopez-53"
                },
                {
                    "user_id": "Nick Van der Eijk",
                    "user_href": "/profile/Nick-Van-der-Eijk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roy Boss",
                "href": "/profile/Roy-Boss-1"
            },
            "answer_text": "We over estimate Byzantium because its historiography is accessible easily to Western historians from Gibbon onwards. It was not difficult to see Byzantium as the bulwark of the West against aggressive Islamic expansion . Moreover, in the nineteenth and early twentieth centuries the Byzantines with their well organised military with regiments and specialists and above all military manuals appealed to historians who saw the Byzantines as akin to ‘'modern’ colonial Western armies. Hence the Byzantines get a good press. They certainly, for periods, had an effective military force and a good system of extracting tax and recruits and the enormous advantage of the centrally situated superbly fortified capital as a refuge of last resort. However, this strong empire had oeriods of decay and resurgence. It lost its economically productive Levantine and Egyptian provinces and never recovered them. It lost the Balkan provinces to Bulgars and Serbs. It recovered them technically but faiked to integrate them into the Empire. In 554 it recovered Italy, but gradually list ground there, losing the last territory in the eleventh century. It recovered Africa in 534 but lost it again to the Arabs in the seventh century. In the Levant , in the seventh century, all the territory up to Anatolia was lost to tge Arabs. In the tenth century the Byzantines were in a much stronger position . They had an effective army and a series if good generals, in Europe the Bulgars were crushed. Even then the Byzantines did not sweep down into Syria and reestablish themselves. Their conquests were relatively insignificant. In Anatolia the Turks established themselves in the eleventh century and, with ebbs and flows gradually took over the entire land. Major Roman attempts to dislodge them ended in military disasters and the Byzantines lost the joint frontier with Armenia and the land that had been the mainstay of their manpower., territory that had been Roman since 50 BC. So, we have a false view of Byzantine strength. It very clearly could maintain its territory unless the Arabs ir Turks made a serious attack in which case it fell back to the capital. It could dominate the Balkans for a while, but coukd not convert the Valkan states into integral imperial territory. It levied tribute rather than troops or taxes. Faced in the East with territories full of Christians abd rich it could not reconquer them. In the West in Latin speaking former imperial territory it could not defeat relatively weak barbarian tribal monarchies in Spain, Gaul and Northern Italy. So, the Byzantines were strong enough to resist conquest and to periodically reassert authority over neighbouring territories they had once owned, but not strong enough to reestablish the wider Empire Rome had held. ",
            "date": "Answered February 13, 2020",
            "views": "864",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonas Lillelid",
                    "user_href": "/profile/Jonas-Lillelid"
                },
                {
                    "user_id": "David Austin",
                    "user_href": "/profile/David-Austin-109"
                }
            ]
        }
    ]
}