{
    "title": "How many siblings, wives and children did Genghis Khan have? - Quora",
    "tags": [
        "Genghis Khan",
        "Mongolian Ethnicity and People",
        "Mongol Empire"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Tisdale",
                "href": "/profile/David-Tisdale-7"
            },
            "answer_text": "Read a book om Mongol queens and princesses. It would seem that our Genghis had a policy of trading in wives to make more advantageous alliances and marrying his daughters off for the same reasons. The Mongol women and children lived a pretty separate life from the men and at one point, Mongol princesses were culled from Mongol history. So, we shall never know just how our Genghis became a direct ancestor of a quarter of the modern world. IMHO, it happened because the Mongols captured so much of the known world in such a short time. So, even though Genghis’ children were thin on the ground, they stretched from Siberia to Krakow in Europe and Asia and south all the way through Persia to what is now Pakistan. The Mongols were enthusiastically polygamous, and, for a couple of centuries were either the ruling families or close to them. This meant that they were choice selections in the marriage department, would have more wives, and more children who survived infancy and lived to reproduce. Congrats to Caleb. ",
            "date": "Answered August 2, 2020",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Caleb Lim Jia Qi",
                "href": "/profile/Caleb-Lim-Jia-Qi"
            },
            "answer_text": "Hmmmm, let's see…….. Siblings: 1. Qasar 2. Hachiun 3. Temüge 4. Belgutei 5. Behter Wives: 1. Börte Üjin Khatun 2. Yisui 3. Juerbiesu 4. Kunju Khatun 5. Khulan Khatun 6. Yesugen Khatun 7. Yesulun Khatun 8. Möge Khatun 9. Isukhan Khatun 10. Gunju Khatun 11. Abika Khatun 12. Gurbasu Khatun 13. Chaga Khatun Children: 1. Jochi 2. Chagatai 3. Ögedei 4. Alakhai Bekhi 5. Tolui It seems like Genghis Khan had 5 siblings, 13 wives and 5 children. However, it is believed that he has thousands of wives, as well as thousands of children. Sources: Yesugei - Wikipedia, Genghis Khan - Wikipedia Note: This is my 200th answer on Quora. ",
            "date": "Answered July 30, 2020",
            "views": "139",
            "upvotes": "0"
        }
    ]
}