{
    "title": "How long did it take for your country to repay their war debt after World War I and II compared to a potential World War III? - Quora",
    "tags": [
        "World War 3",
        "World Wars",
        "World War I",
        "Debt",
        "World War II",
        "World History",
        "Warfare",
        "Military History and Wars ",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Richards",
                "href": "/profile/Christopher-Richards-10"
            },
            "answer_text": "In the UK, I would dare to suggest that we were still paying the First World War Debt off in the 1960s, let alone Second World War debts ! Even in the 1980s were were still paying a substantial amount of money to the USA for their loans, not to mention the costs of disarming unexploded bombs dropped over the UK, particularly Londond and major cities. Certainly in London (which took most of the bombing from Germany) and because we had the massive Docklands areas which were of logistic importance, as well as commerce and industry generally, London took a hell of a lot of damage. Perhaps more to the point the number of unexploded bombs which hit the ground but did not detonate across the the whole of UK were significant. When the rebuilding programees started in 1950s onward and even today as we keep building roads and tall buiding needing deep foundations (notably again docklands) even in the 1980s and 90s Builders and Construction Engineers were comming across unexploded bombs, some several hundred pounds of explosive (and more to the point unstable) were being uncovered on a near daily basis. So I would imagine that many countries (UK included) are still paying off some of the loans 80 years later. As for WW III (if there is one) I doubt very much we will know anything about it. A couple of Atomic Warheads and hits should knock out most countries in the space of about a month. Not to menion planet Earth glowing in the Solar System with all the radio activity, perhaps even to out-rival the sun-:) Seriously I doubt there will be a WWIII; the political situations are vastly different. We face more problems from religious nutcases flying in to tall buildings, and other forms of terrorism than a global war. Chris R - London ",
            "date": "Answered October 24, 2020",
            "views": "54",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nate Kaufman",
                    "user_href": "/profile/Nate-Kaufman-6"
                },
                {
                    "user_id": "Antonio Tela",
                    "user_href": "/profile/Antonio-Tela"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Evill",
                "href": "/profile/Brett-Evill"
            },
            "answer_text": "It took until 1957 for Australia’s net public debt as a proportion of GDP to get back down to what it had been in 1938, the year before WWII started. ",
            "date": "Answered October 24, 2020",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Antonio Tela",
                    "user_href": "/profile/Antonio-Tela"
                }
            ]
        }
    ]
}