{
    "title": "How would history have been different without Martin Luther? - Quora",
    "tags": [
        "Martin Luther (historical figure)",
        "The Protestant Reformation",
        "History of Christianity",
        "Catholicism",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Christianity",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gareth Jones",
                "href": "/profile/Gareth-Jones-59"
            },
            "answer_text": "I love Eleanor Heaps’ answer. However, I’ll take a stab at a different answer, since nobody can prove me wrong: Reformers show up when it’s reformation time. Luther is often cited as the start of the reformation, but the Moravian Church is older than the Ninety-five Theses If Luther hadn’t been around, maybe Philip Melanchthon would have taken his historical place. Maybe we’d have to wait for John Calvin to make the first move. In fact, Lutheranism began with attempts to not split with the Catholic church (see https://en.wikipedia.org/wiki/Augsburg_Confession as an attempt to stay within the Catholic church and yet reform it), but the Catholic church at that time did not want to be reformed.I honestly think that something similar to the Thirty Years’ War would have been inevitable with about the same timetable as history records. ",
            "date": "Answered June 25, 2016",
            "views": "157",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Harrison",
                    "user_href": "/profile/Paul-Harrison-69"
                },
                {
                    "user_id": "Sean Leary",
                    "user_href": "/profile/Sean-Leary-1"
                },
                {
                    "user_id": "Markus C. Dehning",
                    "user_href": "/profile/Markus-C-Dehning"
                }
            ]
        },
        {
            "author_info": {
                "name": "Markus C. Dehning",
                "href": "/profile/Markus-C-Dehning"
            },
            "answer_text": "Another one would have been the chief reformer of the catholic faith, as Gareth Jones stated. Anyways, if Martin Luther would not have translated the bible, the development of the German language might have been quite different. In his days, the German regional accents were much stronger and much more divers than today. Using a lot of Bavarian words mixing it with his own North-Thuringian accent, he created the basics of what is now High-German. Today, accents are spoken mostly in southern Germany. That is because Bavarian is rather similar to High-German, the language of the bible. In Northern Germany, accents like “plattdeutsch” (lower German) are dying out, because they are so different from High-German. Just one advantage: It easier for non-native speakers to understand us. ",
            "date": "Answered June 26, 2016",
            "views": "711",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ezra Melchor",
                    "user_href": "/profile/Ezra-Melchor-1"
                },
                {
                    "user_id": "Robert Perreira",
                    "user_href": "/profile/Robert-Perreira-2"
                },
                {
                    "user_id": "Sean Leary",
                    "user_href": "/profile/Sean-Leary-1"
                }
            ]
        }
    ]
}