{
    "title": "How does the use of a round or rectangular parachute impact a jump? - Quora",
    "tags": [
        "Parachutes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Geoff Brown",
                "href": "/profile/Geoff-Brown-4"
            },
            "answer_text": "In practical terms, being under a round generally dumps you straight down and you have little choice of where you land and you come in like a ton of dung off a rooftop. You do have a small amount of forward movement to control your direction but very little compared to a square. Stand-up landings are very rare. I managed one once but but that was a fluke of circumstances. A decent landing under a square has you coming in exactly where you have decided you want to land and you come in dancing on your tippy toes with little to no actual impact. Massively more pleasant and one big reason sport skydivers won’t touch a round. The main reason for the difference is that a round drops straight down and relies solely on drag to slow your descent while the square is a wing that flies forward and therefore creates a certain amount of lift. This gives you far more control over your destination as well as allowing you to control the rate of descent at touchdown. On a non “swoop” or performance landing, simply applying the brakes or “flaring” the canopy at the correctly timed moment results in a beautiful soft and controlled touchdown. Of course when things go wrong under a square it can potentially result a far worse landing than you would ever have under a round. The round gives a way more unpleasant landing, but lack of control over where you land aside, the touchdown is more predictable (always a bit violent but seldom worse than that). Of course everything in life is more complicated than that and rounds range from non steerable to steerable (just) to ones with a higher forward speed such as the Para-commander. The steerability produced on rounds comes not from the principle of lift or flight of a wing but from controllable apertures or open panels in the canopy which allow higher pressure air to be directed. So essentially it’s still working by drag, but some of the air is allowed out the back to push the canopy forward. ",
            "date": "Answered January 11, 2020",
            "views": "500",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juan Miguel Hernandez",
                    "user_href": "/profile/Juan-Miguel-Hernandez-4"
                },
                {
                    "user_id": "Insan Siregar",
                    "user_href": "/profile/Insan-Siregar-1"
                },
                {
                    "user_id": "Odilio Castro",
                    "user_href": "/profile/Odilio-Castro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt McKeon",
                "href": "/profile/Matt-McKeon-4"
            },
            "answer_text": "As Sam mention round parachutes are used mostly by the military. Another point to that and reason for it, is the fact that you would not want to put a mass drop of troopers underneath steerable parachutes.  That would be a bad thing. In normal flight a round canopy will decent at a much faster rate than a square and will drift with the wind. A square can decent at a much faster rate in an agreesive turn, however requires the jumper to induce such turn. In the above photo you want every jumper doing the same thing. The round is best for that. Sport square parachutes are much more fun and can fly very fast.  This jumper was problaby going close to if not a little over 50 mph at the moment he stopped descending and started to fly horizontally. This cannot be done in a round parachute. Other square parachutes are designed for accuracy like this parachute.  This jumper is almost decending straight down, although much slower than a round. He is attempting to place his heel in the center of the target. This can not be done with a round parachute. This is me with my square parachute in a high speed spiral turn at about 1000 feet up.  Enjoy! ",
            "date": "Answered April 18, 2017",
            "views": "55",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juan Miguel Hernandez",
                    "user_href": "/profile/Juan-Miguel-Hernandez-4"
                },
                {
                    "user_id": "Zarif Chowdhury",
                    "user_href": "/profile/Zarif-Chowdhury-9"
                },
                {
                    "user_id": "Clint Lund",
                    "user_href": "/profile/Clint-Lund"
                },
                {
                    "user_id": "Syed Isamuddin",
                    "user_href": "/profile/Syed-Isamuddin-1"
                },
                {
                    "user_id": "John Peter Falconer",
                    "user_href": "/profile/John-Peter-Falconer"
                },
                {
                    "user_id": "Gerd Hoffmann",
                    "user_href": "/profile/Gerd-Hoffmann-2"
                },
                {
                    "user_id": "Rakshith Dasenahalli Lingaraju",
                    "user_href": "/profile/Rakshith-Dasenahalli-Lingaraju-1"
                },
                {
                    "user_id": "Matthew Cantrell",
                    "user_href": "/profile/Matthew-Cantrell"
                },
                {
                    "user_id": "Kevin McLauchlan",
                    "user_href": "/profile/Kevin-McLauchlan"
                }
            ]
        }
    ]
}