{
    "title": "How did the Romans count years before the introduction of AD (Anno Domini)? - Quora",
    "tags": [
        "Anno Domini (numbering system)",
        "Calendars",
        "Roman Empire",
        "Ancient Rome"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick VonderBrink",
                "href": "/profile/Rick-VonderBrink"
            },
            "answer_text": "The Romans had two dating systems: The more commonly used was by who the two consuls were for that year (eg “in the consulship of Quirinius and Ahenobarbus”). After the transition to the empire, this was replaced with the regnal year of the emperor (eg “in the fourth year of the principate of Trajan”) The other was dating by years since the legendary founding of Rome, which by our reckoning was in 753 BC. You will see this as expressed as a number of years AUC (ab urbe condita, “from the founding of the city”). This dating system was used mostly by writers and historians and would not have been used by the typical person in the street. The AD/BC system was a much later addition. It was first proposed in 525 but not widely adopted until around 300 years later. ",
            "date": "Answered November 2, 2019",
            "views": "112",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexey Kuchin",
                    "user_href": "/profile/Alexey-Kuchin"
                },
                {
                    "user_id": "Eric Wang",
                    "user_href": "/profile/Eric-Wang-434"
                },
                {
                    "user_id": "Camille Tirapelli",
                    "user_href": "/profile/Camille-Tirapelli"
                },
                {
                    "user_id": "Andre Engels",
                    "user_href": "/profile/Andre-Engels"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Steele",
                "href": "/profile/John-Steele-88"
            },
            "answer_text": "At the time the monk invented Anno Domini counting, the rest of the Romans were counting regnal years from the reign of Emperor Diocletian (although he was long dead). The monk set the first AD year, 532 Anno Domini, equal to 248 Anno Diocletian. It took another 200–300 years for his system to become widespread. All earlier years were not so counted by the citizens of the era, the counting rules were backcast after the fact. The years 1 - 531 did not exist in the minds of folks living them. Few ordinary Roman citizens would have used it, but Roman historians counted from the (legendary?) founding of Rome in 753 BC, labeled AUC, (Latin for from the founding of the city) 532 Anno Domini = 248 Anno Diocletian = 1285 AUC Had the monk not invented Anno Domini, Anno Diocletian would likely have continued, at least until somebody caused some change. ",
            "date": "Answered January 22, 2020",
            "views": "35",
            "upvotes": "0"
        }
    ]
}