{
    "title": "How far does black history go back before slavery? - Quora",
    "tags": [
        "Before Slavery (c3500 BCE)",
        "Black History",
        "African-American History",
        "History of Slavery",
        "Slavery",
        "African Americans",
        "Black People"
    ],
    "response": [
        {
            "author_info": {
                "name": "John McKay",
                "href": "/profile/John-McKay-17"
            },
            "answer_text": "Depends on what you mean by history. From paleontology and archaeology, we know that the first humans were African. Pre-human hominids also originated in Africa, though some lines went through considerable evolution in Eurasia. White humans are a very late evolutionary development happening after the peak of the last ice age. Are you talking about written history? The Egyptians in Africa were the second people to invent writing and only shortly after the Sumerians. They wrote about the black Nubians just up the Nile and several of their ruling dynasties were from Nubia. Basically, written history of black Africans predates everyone except Middle Easterners. tl;dr All the way. ",
            "date": "Answered June 9, 2020",
            "views": "60",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Charleston",
                    "user_href": "/profile/James-Charleston-1"
                },
                {
                    "user_id": "Conor Howard",
                    "user_href": "/profile/Conor-Howard-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Le Sellers",
                "href": "/profile/Le-Sellers"
            },
            "answer_text": "That’s hard to say, since slavery is older than recorded history, Black or any other. The question appears to assume, without evidence, that slavery is a more-or-less modern phenomenon. It’s ancient, and was ancient before Rome, before Greece, before China, and before Timbuktu. ",
            "date": "Answered June 12, 2020",
            "views": "29",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Hawkins",
                    "user_href": "/profile/David-Hawkins-96"
                },
                {
                    "user_id": "Quentin Stephens",
                    "user_href": "/profile/Quentin-Stephens-3"
                }
            ]
        }
    ]
}