{
    "title": "How many deaths were in World War I? - Quora",
    "tags": [
        "World War I",
        "Statistics (collected data)",
        "Warfare",
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlos Afif",
                "href": "/profile/Carlos-Afif"
            },
            "answer_text": "Here’s the thing. I personally think the death toll in WWI is significantly larger than 17 million. Artillery was widely used in the war, so much so that multiple French and Belgian cities were so utterly destroyed, they were never rebuilt. This means that any corpses left over by any given battle were either blown to bits, or swallowed in the mud caused by the amount of upended Earth. The poor living conditions of the trenches caused tons of diseases to run rampant, and it most definitely had a role in spreading the Spanish Flu, as soldiers returned to the homelands across the world and only spread the disease further. Artillery caused the most amount of deaths in WWI by far, and somewhat unsurprisingly, not a lot of those people were intact afterwards. Many millions of men died from disease caused by exposure to rotting corpses, rats, and poor quality food. Depending on how much you want to factor WWI’s role into the Spanish Flu’s spread, WWI (both directly and indirectly) is responsible for nearly 40–50 million deaths globally. Which is insanely more than the conservative 17 million that is often given. Including nationwide famines, both intentional (the British starving German civilians) and unintentional (natural consequences of war) that caused other cataclysmic events, the death toll from WWI is truly extreme and unknowable. Somewhere near 50–60 million. ",
            "date": "Answered July 19, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Curtis R. Emma",
                "href": "/profile/Curtis-R-Emma"
            },
            "answer_text": "No precise count will ever exist, but the consensus is between around 18 million (9 million military and 7 million civilians) killed between 1914-1918 less the Russian civil war, and over 100 million if the resulting flu pandemic is included and the inevitable 2nd world war (that was really only the conclusion of the 1st after a 20 year armistice). I first read this as WW2 for some reason. They are the same war really in most aspects and overarching analyses. The only main difference is the tactics in which they were fought and weapons introduced. ",
            "date": "Updated October 21, 2017",
            "views": "314",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Reuben Painter",
                    "user_href": "/profile/Reuben-Painter"
                }
            ]
        }
    ]
}