{
    "title": "How do intellectual revolutions transform societies? - Quora",
    "tags": [
        "Intellectualism",
        "Revolution",
        "Society"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arès Mars",
                "href": "/profile/Arès-Mars"
            },
            "answer_text": "    Intellectual revolutions or thought movements have had in recent centuries enormous weight in the transformation of Western societies, be it Friedrich Wilhelm Nietzsche for fascism, Karl Marx for communism / socialism, where Charles Darwin for atheism each of his ideologies to and continues to transform our perception of the world and of life in society. Believing that technology is the sole culprit is blatantly ignorant, because its ideologies are responsible for millions of deaths. The common point between all these ideologies is to have tried to fill the void produced by the revolutions, that have abolished theocracies and monarchies. Indeed up to 2 centuries, religion and politics were inseparable. The fact of being in agreement where not is the question, but once again each of ideologies have as common point to be secular, which marks a turning point in the history of the world, because since always the man since the antiquity to revolutions was governed both by the spiritual and the religious. The most recent revolutions are more concerned with the individual himself than with the system that governs him. Especially with the \"Frankfurt School\" which brought together from 1920 many intellectuals such as Erich Fromm, Herbert Marcuse etc ... Here again the role of these intellectuals will be demonstrated that the man is not born with predetermined values, ​​but that on the contrary it is to him of the created (I make short) it can be shaped to match the evolution of society. In truth when we look at the history we can see that at first the revolutions put an end to the power of the religious, then lack of landmarks of the ideologues promise that their new secular system, will be better for everyone and finally in a world that has found a balance of facade with democracy, where the law of the market reigns with little social assistance have sold idelologies at the individual level, that will jump all moral locks, allowing the market (capitalism ) to open on land still unexploited because considered immoral (pornography etc ...).    ",
            "date": "Updated October 5, 2018",
            "views": "19",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sebmar Amor",
                    "user_href": "/profile/Sebmar-Amor"
                },
                {
                    "user_id": "Wander Pets",
                    "user_href": "/profile/Wander-Pets"
                },
                {
                    "user_id": "Cris Bumakil",
                    "user_href": "/profile/Cris-Bumakil"
                },
                {
                    "user_id": "Jobelie Fabillano",
                    "user_href": "/profile/Jobelie-Fabillano"
                },
                {
                    "user_id": "Gwydion Madawc Williams",
                    "user_href": "/profile/Gwydion-Madawc-Williams"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "Zhang Seralrop",
                    "user_href": "/profile/Zhang-Seralrop"
                },
                {
                    "user_id": "Shahid Hussain Raja",
                    "user_href": "/profile/Shahid-Hussain-Raja"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Mann",
                "href": "/profile/Stephen-Mann-G"
            },
            "answer_text": "Doubtlessly, the West (the USA and northern Europe) went through a great revolution after the discovery of the Americas. After 1500, thinkers proposed increasingly secular versions of reality and they explored both nature and society. In the 1700′s this culminated in the French revolution. This event was the great divider in Western philosophical history. Then appeared the themes of natural and social evolution, philosophies of existence, and the various scientific revolutions. Especially important was the distinction between religious and philosophical thought. This secularism was important for the development of democracies and modern economies in which technical evolution was fostered and didn’t just happen by chance. ",
            "date": "Answered August 27, 2019",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jason Almendra",
                "href": "/profile/Jason-Almendra"
            },
            "answer_text": "The last intellectual conflict in Western Europe was between the socialists and the capitalists. Both have radical factions. Communism is socialism by violence. Fascism (Nazism) is capitalism by castor oil or concentration camps. If you use Hegelian Dialectic. The thesis and antithesis leads to the synthesis. Social democracy allows free enterprise but provides cradle to grave support provided by the state. ",
            "date": "Answered February 17, 2019",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Love Sunshine Macasulot Bancale",
                "href": "/profile/Love-Sunshine-Macasulot-Bancale"
            },
            "answer_text": "These revolutions contributed a lot to the people’s daily lives. The complicated tasks can be more easier and humans do their jobs with lesser effort because of the new technologies invented. ",
            "date": "Answered November 28, 2018",
            "views": "64",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "April Sano",
                    "user_href": "/profile/April-Sano-1"
                },
                {
                    "user_id": "Angelo Baja",
                    "user_href": "/profile/Angelo-Baja"
                },
                {
                    "user_id": "Em Uapal",
                    "user_href": "/profile/Em-Uapal"
                },
                {
                    "user_id": "Rose Mary Delorino",
                    "user_href": "/profile/Rose-Mary-Delorino"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Lang",
                "href": "/profile/Larry-Lang-8"
            },
            "answer_text": "I think technology and circumstance transform societies, not intellectual revolutions. The pill, agriculture, gunpowder all transform society, and so will robots and information technology. The thoughts of Karl Marx, Freud, and Darwin? Not so much. ",
            "date": "Answered September 6, 2018",
            "views": "75",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Philip Atkinson",
                "href": "/profile/Philip-Atkinson-16"
            },
            "answer_text": "Revolutions, intellectual or otherwise, cripple societies. Which is why is a ‘social war’ (a revolution) marks the start of a society’s/civilisation’s collapse. As explained by Arnold Toynbee in “A Study Of History” A Class war marks the start of social decline, Toynbee (1952) ",
            "date": "Answered July 20, 2019",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeremy De Vera",
                    "user_href": "/profile/Jeremy-De-Vera-5"
                }
            ]
        }
    ]
}