{
    "title": "How do black French identify themselves? - Quora",
    "tags": [
        "French Ethnicity and People",
        "French (language)",
        "Black People",
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pamela Sztyblewsky",
                "href": "/profile/Pamela-Sztyblewsky"
            },
            "answer_text": "I’m thinking simply “nous ne sommes pas les fuckin’ Américaines” will suffice. Because I’m black and French I’ve had all over the world just falling over myself proving I was NOT BORN IN THE STATES. The world is obsessed with treating me like “American” instead of French and they dig deep to prove their bullshit racist hypothesis. That because it’s “black” and speaking English it could not have been born in France. Hence, “not American.” So I don’t know how those who never left France (raised in Canada) identify themselves. Probably, and this is a wild guess, as FRENCH people. If one more racist asshole tells me to go to the “American” Embassy when I asked for the French one, or asked AT the French one to get IN for my appointment with Affaires Consulaires, or calls me an American after I tell them I was born in France, I think I will go to jail for murder. I guess I need to inform the French Embassy of that fact, then…. ",
            "date": "Answered November 2, 2019",
            "views": "538",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                },
                {
                    "user_id": "Jennifer Armstrong",
                    "user_href": "/profile/Jennifer-Armstrong-115"
                },
                {
                    "user_id": "Attman Kar",
                    "user_href": "/profile/Attman-Kar"
                },
                {
                    "user_id": "Hugo Durand-Mermet",
                    "user_href": "/profile/Hugo-Durand-Mermet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philbert de Zwart",
                "href": "/profile/Philbert-de-Zwart"
            },
            "answer_text": "There can't be a single answer for a group of millions of people with diversity in every thinkable dimension: 1st, 2nd and third generation, with historical roots all over Africa from countries that themselves are already diverse. All age groups. Christians, Muslims and other religions. Varying economic classes. There is just too much diversity to say anything sensible about this group as a whole. (I loved Trevor Noah's answer though. Why does one have to have a single national identity? People are too complex for that) ",
            "date": "Answered July 20, 2018",
            "views": "312",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alfredo Perozo",
                    "user_href": "/profile/Alfredo-Perozo"
                },
                {
                    "user_id": "Ava L. Wells-Quantrell",
                    "user_href": "/profile/Ava-L-Wells-Quantrell-1"
                },
                {
                    "user_id": "Cherif Elias",
                    "user_href": "/profile/Cherif-Elias"
                },
                {
                    "user_id": "Etienne Mourez",
                    "user_href": "/profile/Etienne-Mourez"
                },
                {
                    "user_id": "Daniel Aldridge",
                    "user_href": "/profile/Daniel-Aldridge-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Géal-Killy",
                "href": "/profile/George-Géal-Killy"
            },
            "answer_text": "They identify themselves the way they want. ",
            "date": "Answered July 21, 2018",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Delsa Tsirane",
                    "user_href": "/profile/Delsa-Tsirane"
                }
            ]
        }
    ]
}