{
    "title": "How many soldiers on both sides were killed during the Battle of Stalingrad? - Quora",
    "tags": [
        "Battle of Stalingrad",
        "Historic Battles",
        "Military Personnel",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ron S. Friedman",
                "href": "/profile/Ron-S-Friedman"
            },
            "answer_text": "There are different opinions, and probably both sides tried to manipulate the number, but from what I gathered in a quick internet search, it may be safe to say that more than 728,741 soldiers of both sides were killed during the battle, and possibly 100,000 or more were killed in the aftermath. (POWs and wounded.) Battle of Stalingrad - Wikipedia “The USSR, according to archival figures, suffered 1,129,619 total casualties; 478,741 personnel killed or missing, and 650,878 wounded or sick.” “The Axis suffered 627,899 total casualties (wounded, killed, captured) among all branches of the German armed forces and its allies” Battle of Stalingrad | Facts, Pictures, & Summary “The Soviets recovered 250,000 German and Romanian corpses in and around Stalingrad, and total Axis casualties (Germans, Romanians, Italians, and Hungarians) are believed to have been more than 800,000 dead, wounded, missing, or captured.” Note: Out of the proximate 100,000 captured Axis soldiers, about 5,000 survived the war. ",
            "date": "Answered December 18, 2017",
            "views": "24",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Peterson",
                    "user_href": "/profile/Matt-Peterson-40"
                },
                {
                    "user_id": "Nat Condit-Schultz",
                    "user_href": "/profile/Nat-Condit-Schultz"
                },
                {
                    "user_id": "Keegan Fredriken",
                    "user_href": "/profile/Keegan-Fredriken"
                },
                {
                    "user_id": "Dan Calvano",
                    "user_href": "/profile/Dan-Calvano"
                },
                {
                    "user_id": "Keith Schall",
                    "user_href": "/profile/Keith-Schall-1"
                }
            ]
        }
    ]
}