{
    "title": "How is the British government structured? How has this changed throughout history? - Quora",
    "tags": [
        "History of the United Kingdom",
        "Government of the United Kingdom",
        "World History",
        "Government",
        "The United Kingdom",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Patnick",
                "href": "/profile/Alex-Patnick"
            },
            "answer_text": "HM The Queen is the Head of State, and has powers similar to the US President, however, these are only exercised on the advice of ministers. The Queen appoints the Prime Minister, and this is almost always the person 'who can command a majority in the House of Commons.' Due to the Parliament Act 1911, the PM cannot be a member of the House of Lords. The Prime Minister then appoints all other members of the government who can belong to either House. Each minister is officially a 'Minister of the Crown' and the Cabinet is officially a part of the Privy Council amongst whose duties are to advise the monarch. All judges are appointed by the queen, but again she is advised on who to appoint by the Secretary of State of Justice, who is advised by the Judicial Appointments Committee. The Civil Service is has no political appointees, and there are strict rules about what exactly a civil servant can and cannot do (e.g. they can vote, but they are not allowed to take part in campaigning). When it comes to Parliament the Lower House (Commons) has more power than the Upper House (Lords). Each MP has been elected to the Commons, while the Lords are either appointed by a government in the past (Life Peers), inherited their position (Earl Marshall and Lord Great Chamberlain), or are one of 90 hereditary peers elected by other Peers (e.g. Dukes, Earls, Viscounts etc. who inherited the title). In the UK there is Parliamentary Supremacy, so whatever Parliament says goes, and cannot be overruled by the courts. The monarch can refuse Royal Assent, but by convention this is not used. There are occasions when the monarch advises the Speaker of the House that she does not agree to a bill, but this can only be done for certain things, and is only done on the advice of the appropriate minister. ",
            "date": "Answered November 21, 2015",
            "views": "504",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel James",
                "href": "/profile/Daniel-James-122"
            },
            "answer_text": "The Prime Minister is chosen by Parliament, and is usually the leader of the largest party in the elected House of Commons. They are then officially appointed to the position by the Queen, who acts as a sort of living embodiment of the constitution. The other ministers are then chosen by the PM. The government as a whole can be deposed and new elections called if Parliament passes a motion of no confidence. Executive power ultimately rests with the monarch. However, barring a major constitutional crisis (e.g. a military coup, or a government-controlled parliament proclaiming the PM Supreme Dictator for Life), she is not allowed to wield it except on the advice of the Prime Minister. Until about 300 years ago monarchs took a much more active role and effectively acted as their own prime ministers. This started to change with George I who, being German and unfamiliar with British politics, preferred to have someone else run the government for him. Over time this arrangement became permanent, and by the mid 19th century the monarch's everyday role had become mainly ceremonial.   ",
            "date": "Answered February 9, 2016",
            "views": "112",
            "upvotes": "0"
        }
    ]
}