{
    "title": "How powerful was the USSR? - Quora",
    "tags": [
        "History of USSR",
        "History of Russia",
        "Power (society)",
        "Soviet Union",
        "Russia"
    ],
    "response": [
        {
            "author_info": {
                "name": "JJ Hantsch",
                "href": "/profile/JJ-Hantsch"
            },
            "answer_text": "The Soviet Union was one of the two superpowers in the world. It had great strengths and great weaknesses. The Soviet Army was itself the greatest land force ever seen. In the 1950s and 1960s even the entire NATO alliance could not have stopped a full-scale Soviet invasion of Western Europe without resorting to nuclear weapons. The Soviets simply had more tanks, more artillery and more troops than could conceivably be stopped without nukes. One on one Soviet tanks were mostly slightly less powerful than the best Western tanks, but the Soviet Army was never about one on one.  The Soviet navy was probably over matched against Western forces, their surface ships and submarines were not the equal of individual Western ones but they were adequate to their assigned tasks.  Soviet bombers were well-designed but never envisioned to perform to the same requirements as their Western counterparts.  Soviet fighter aircraft never had the same generation of advanced avionics as Western aircraft, but they always possessed very significant power, speed and maneuverability. Several times Soviet fighter surpassed NATO fighters in capabilities, but that advantage was never held long-term. The Soviet command system of forward air controllers allowed their average pilots to be considerably less trained than their Western counterparts. Highly skilled Soviet aviators were modestly freed from this system and as good as their Western counterparts. Soviet attack helicopters were comparable or better to Western ones; lesser avionics, but more power.  Soviet air defense was never really tested.  Soviet missile force was a generation behind in accuracy, but how accurate do ICBM's have to be. The Soviet planning for doomsday was as advanced as the USA's.  During the 1950s and 1960s, the Soviet Union enjoyed the benefits of the communist system and a centrally planned economy. The Soviet military could rely on several firms to design tanks, accept and fix a production run and then build more tanks than the USA could ever afford, with each Soviet tank costing about half what an equivalent Western tank cost.  In the 1960s the USA was fixed on the space race. The technology developed for this, especially the portable computer launched generations of advancement which really tipped the balance. Central planning cannot expect or reward innovation as quickly and reliably as a capitalist system. In the Soviet Union top-notch designers and scientists are rewarded just as well as in the USA. But second- third-, fourth-, and even fifth-tier inventiveness in a free market system is rewarded with riches. Central planning just can't do that.  In the 1970s Western advances started to surpass the Soviets. For example, their submarines just became too vulnerable when the west launched the SOSUS net, a grid of buoys that relay passive sonar pickups from all across the oceans. Originally designed to track Soviet subs, it is now the premier source for whale tracking. The Soviets could not conceive of floating a network of literally thousands of passive sonar buoys which stayed in position for decades and coordinating their massive data outputs via satellite link up and producing read outs of the entire ocean.  By the 1980s, Soviet technology had fallen behind, never to catch up.  How powerful was the Soviet Union during it's prime? Probably capable of fielding the greatest military force in the world, but unable to keep the US and Western Allies from achieving their specific aims.           ",
            "date": "Answered March 26, 2016",
            "views": "41",
            "upvotes": " View 35 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Multi- Universe",
                    "user_href": "/profile/Multi-Universe-4"
                },
                {
                    "user_id": "Vandana Kumari",
                    "user_href": "/profile/Vandana-Kumari-719"
                },
                {
                    "user_id": "Quanghuy Tran",
                    "user_href": "/profile/Quanghuy-Tran"
                },
                {
                    "user_id": "Noah Emerson",
                    "user_href": "/profile/Noah-Emerson-3"
                },
                {
                    "user_id": "Fernando Soteras",
                    "user_href": "/profile/Fernando-Soteras"
                },
                {
                    "user_id": "A.B Singh",
                    "user_href": "/profile/A-B-Singh-21"
                },
                {
                    "user_id": "Jan Antoni",
                    "user_href": "/profile/Jan-Antoni"
                },
                {
                    "user_id": "Kyle Sheq",
                    "user_href": "/profile/Kyle-Sheq"
                },
                {
                    "user_id": "Carlos Acosta",
                    "user_href": "/profile/Carlos-Acosta-86"
                },
                {
                    "user_id": "Julien Boodts",
                    "user_href": "/profile/Julien-Boodts"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aravind Bachu",
                "href": "/profile/Aravind-Bachu"
            },
            "answer_text": "Quite Powerful. It was both it's Strength and Weakness.  Here's some stats :  Post World War II : USSR was left with 7 Million+ Infantry, 18000+Tanks and IS-2's and IS-3's and other tricks up it's sleeve. USA had 5 Million+ Infantry, 10000+ Tanks, Fission Bomb and an unending Military Industrial Complex.  Troops on both the sides were weary and a fight would only be a war of attrition, because it was Stalin on the USSR's side. Eastern Europe was annexed to counter the possible future US hegemony.  Rest all other countries were out of the Game. Fission Bomb : US dropped it in 1945. USSR got it by 1949. Fusion Bomb : US had it in 1952. USSR got it by 1953. ICBM Technology : USSR had it by 1957. US had it by 1958.  Anti- Ballistic Missile Systems : USSR and USA built them by 1970. ABM treaty limited further growth in 1972. MIRV : US had them by 1970 . USSR had a poorer version by 1977. and Stealth Bombers, Cruise Missiles, Nuclear Submarines, Aircraft Carriers, SLBM's etc followed suit. Both had them. In Plenty. No one else on planet had them before these two powers and These two never fought it till the death in a direct battle to decide who really was powerful, nor any Third Power from space descended to fight against these two.  Despite having all of them, USA lost in Vietnam and USSR lost in Afghanistan. So we will never know the tangible answer. USSR was Powerful enough to dictate a stalemate for many years. That itself was a good enough barter for the Rest of the World. ",
            "date": "Answered November 3, 2015",
            "views": "81",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vandana Kumari",
                    "user_href": "/profile/Vandana-Kumari-719"
                },
                {
                    "user_id": "Kalyan Raghava",
                    "user_href": "/profile/Kalyan-Raghava-7"
                },
                {
                    "user_id": "Sariel S Reigns",
                    "user_href": "/profile/Sariel-S-Reigns"
                },
                {
                    "user_id": "Jan Antoni",
                    "user_href": "/profile/Jan-Antoni"
                },
                {
                    "user_id": "Ega Siregar",
                    "user_href": "/profile/Ega-Siregar"
                },
                {
                    "user_id": "Kyle Sheq",
                    "user_href": "/profile/Kyle-Sheq"
                },
                {
                    "user_id": "Carlos Acosta",
                    "user_href": "/profile/Carlos-Acosta-86"
                },
                {
                    "user_id": "Anthony Thomas",
                    "user_href": "/profile/Anthony-Thomas-480"
                },
                {
                    "user_id": "Julien Boodts",
                    "user_href": "/profile/Julien-Boodts"
                },
                {
                    "user_id": "Alex Dobrovic",
                    "user_href": "/profile/Alex-Dobrovic"
                }
            ]
        }
    ]
}