{
    "title": "How were wealthy people affected during the Great Depression? - Quora",
    "tags": [
        "The Great Depression",
        "Wealthy People and Families",
        "Wealth"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry Howard Westfall",
                "href": "/profile/Barry-Howard-Westfall"
            },
            "answer_text": "Some of them were wiped out. But not many because most very wealthy people have more than the value of stocks and bonds on which they build their fortunes. There is a true story of how one of the richest men in the world at that time survived this stressful period. William Randolph Hearst was totally wiped out as far as his personal fortune was concerned. But he had a “lady friend” (Actress Marion Davies) who he had given a few million dollars to for her support without having to support her with money from his main family portfolio. SHE DECIDED TO PULL OUT OF THE MARKET IN TIME — JUST BEFORE THE CRASH. So she let him move in with her (when he was technically broke) until he could reinvest enough of her much smaller portfolio in mostly bank loans to rebuild his fortune once more. I just saw an estimate the other day where two of his grand daughters had a net worth of 250 Billion each. So as long as one has some money left, one can invest on the other side of the black hole when securities are dirt cheap and bound to come out the white hole (as they most certainly did). So some not so rich had their wealth significantly reduced because they sold out before the market started to really wobble and they had some money left, but not enough to stay among the most wealthy. Understand that the true old money rich have more diverse investments than just in the stock market. They also have networks of friends and relatives who were still wealthy enough to carry them partly. And this group could afford to lose all investments in stocks and bonds, yet still have enough cash to land on their feet. By 1934, DEFLATION had replaced all other financial worries — far worse short term than simple inflation. Anyone on a payroll had their salary cut because the products their money would buy also cost less simply because demand was sliced by as much as 50% in some industries. No buyers means no profit means less pay in the envelope on Friday. I did some research on a nationally known scholar. In his papers was a file containing all of his annual contracts from a nationally prominent university. In 1932 his salary was $6000 — a top notch salary at the time. But by 1934, due to deflation, it went down to $3500. Why? Because the “product” dried up: that university’s students! Losing capital investments in market companies usually translates to a greater percentage of the working class being laid off and not being rehired until the war industries started cranking out airplanes and tanks by about 1937. Most got by on “make work” jobs funded by the government such as the CCC, WPA, PWA and various government pensions that put printed paper money into circulation. But one of the iron laws of supply and demand is that the more artificial wealth floods into the economy, the less it will buy. Paper money is, in reality, an IOU from the government. During most times, that’s fine. Nobody really expects the government to knock on our door with a bd of something truly valuable and ask for their IOU’s in exchange. But when the economy is shrinking, it requires the bearer to find ways to turn those IOU’s into things with real value — like a car or a bag of groceries. And the more that becomes a problem the more the real value of those commodities goes up, not down. To say it another way: The quickest way to DEVALUE any commodity WHETHER A BETTER MOUSETRAP OR A COLLEGE DEGREE or a bag of groceries is to make it easy for everyone to obtain those things! When I was in college in the 1960’s, there were no student evaluations of faculty and there was no such thing as grade inflation where nearly everyone got a B or A. Today, those are problems because far more people have college degrees than in the 1960’s. So having one means far less and the colleges have to do something so their students don’t go elsewhere. But of the three American classes, the upper class were hurt the least and the working or chronically unemployed were literally on breadlines run out of charity soup kitchens. Most of the employed white collar class had enough savings to survive until the worst part of the Depression had rebounded. But the wealthy who had extra sources of income, were taxed as much as 95% of their earnings by the end of World War II just to soak up the excess cash. ",
            "date": "Answered August 21, 2020",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James McLean",
                    "user_href": "/profile/James-McLean-1"
                },
                {
                    "user_id": "James Morrison",
                    "user_href": "/profile/James-Morrison-427"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caleb Von Schloer",
                "href": "/profile/Caleb-Von-Schloer"
            },
            "answer_text": "I’ll give an interesting story that my maternal grandmother and some of her older siblings and in-laws have shared with me: My maternal grandmother’s father was a child of two untitled Spanish aristocrats. He and his brothers were both “cash-rich” and “land-rich.” Having been resettled in the Philippine Islands from northern Spain, they struck it big when the Americans moved in as the new colonial power because they apparently ended up buying influence (along with a band of other Spanish immigrant businessmen and “land barons”) having lobbyists in DC to help pass beneficial laws & sway obscure deals in their favour. The Great War was very good for my maternal grandmother’s father because he and the band of Spaniard immigrants were able to market their material as vital to the US War Effort. And the 1920s also were glory days. Even very very old housemaids who reached their 100s “remember how stacks of $100 and $500 bills were hidden in compartments under dining tables.” Having uncovered old records on my great-grandfather’s P&L statements from the mid-1930s he was making $400,000 net profit annually (US dollars, not silver pesos) - this was from 1933. They lobbied Democrats to favour buying raw food material from the colonies hence contributing to the food glut and causing a prolonged decrease in food prices in the mainland US - because they did too well! When tensions started with the Japanese in the 1940s, he and his brothers moved their deposits to Spanish and British banks. When they invaded, he was able to live comfortably and as a Spaniard, he was left untouched while almost everybody else around him suffered during the war. In fact my grandmother and her sisters told me of the dark days when their mother would even bring silver coins to pay for food but nothing was in the market because of the war and the severe food shortages. The band of successful Spaniard immigrants were able to continue to live their lives in extravagance, receive their more than fair share of imported food, vinyl records and film reels from Europe and the Americas because the Japanese officials loved bribes in dollars and jewellery. Of course you had a fair share of altruistic people who felt that they should help the other suffering the atrocities of the Japanese. They danced, they partied and they lavished themselves despite the dumpster fire they were in. Then the war ended and they remained somewhat on top despite some disgruntled people who decided burning their mansions was a way to express disgust for how they did not suffer during the war. So of course they responded by building bigger estates and women parading dripping in jewels post-war and travelling all over the world and sending their daughters to the best finishing schools and their sons to the best boarding schools money can buy. So basically, if you were smart and you had political connexions, you will survive an economic depression and a world war…. and later on raise a bunch of spoiled brat children who’ll blow through everything in 25 years 🤷🏼‍♂️ ",
            "date": "Answered August 29, 2020",
            "views": "414",
            "upvotes": "0"
        }
    ]
}