{
    "title": "How would you describe Victorian architecture in detail? - Quora",
    "tags": [
        "Victorian Era (1837-1901 AD)",
        "Architecture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shashank Bisht",
                "href": "/profile/Shashank-Bisht-6"
            },
            "answer_text": "A common mental image of a \"Victorian\" home looks much like a dollhouse with elaborate trim and bright colors, having tilted roofs. But the term \"Victorian architecture\" actually refers to styles that emerged in the period between 1830 and 1910, during the reign of Queen Victoria. The Victorian era spawned several well-known styles, including Gothic revival, Italianate, Second Empire, Queen Anne, stick style, Romanesque style and shingle style. Victorian architecture is mainly originated from UK and spread over Europe to a some extent. so most of its famous example can be seen in UK like Palace of Westminster, Manchester Town Hall, Barclays Bank building, Sutton, Greater London few examples can also be seen in countries like Australia and USA. Key Elements Two to three stories. Victorian homes are usually large and imposing.Wood or stone exterior. The majority of Victorian styles use wood siding, but the Second Empire and Romanesque styles almost always have outer walls made of stone.Complicated, asymmetrical shape. Unlike the boxy Greek revival style, Victorian homes have wings and bays in many directions.Decorative trim. Commonly called \"gingerbread,\" Victorian homes are usually decorated with elaborate wood or metal trim.Textured wall surfaces. Scalloped shingles, patterned masonry or half-timbering are commonly used to dress up Victorian siding.Steep, multi-faceted roof or Mansard roof. Victorian homes often have steep, imposing rooflines with many gables facing in different directions. The Second Empire Victorian style has a flat-topped Mansard roof with windows in the side to allow for maximum space inside the house.One-story porch. A large, wraparound porch with ornamental spindles and brackets is common, especially in the Queen Anne style.Towers. Some high-end Victorian homes are embellished with a round or octagonal tower with a steep, pointed roof.Vibrant colors. Before the Victorian era, most houses were painted all one color, usually white or beige. By 1887, bright earth tones like burnt sienna and mustard yellow were in vogue.",
            "date": "Answered October 17, 2016",
            "views": "75",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andi Evan",
                    "user_href": "/profile/Andi-Evan"
                },
                {
                    "user_id": "Mark Murphy",
                    "user_href": "/profile/Mark-Murphy-455"
                },
                {
                    "user_id": "John Elder",
                    "user_href": "/profile/John-Elder-47"
                },
                {
                    "user_id": "Jackie McMillan",
                    "user_href": "/profile/Jackie-McMillan-17"
                },
                {
                    "user_id": "Farah Shamsee",
                    "user_href": "/profile/Farah-Shamsee"
                },
                {
                    "user_id": "J.T. Sange",
                    "user_href": "/profile/J-T-Sange"
                },
                {
                    "user_id": "William John Muzzarelli Vann",
                    "user_href": "/profile/William-John-Muzzarelli-Vann"
                },
                {
                    "user_id": "Stella Sim",
                    "user_href": "/profile/Stella-Sim-6"
                },
                {
                    "user_id": "Kristin",
                    "user_href": "/profile/Kristin-78"
                }
            ]
        }
    ]
}