{
    "title": "How did Mesopotamia end? - Quora",
    "tags": [
        "Ancient Mesopotamians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Sowmy",
                "href": "/profile/Peter-Sowmy"
            },
            "answer_text": "Mesopotamia is a geographic region and did not end, it´s there; just like Europe or Africa or America etc. But, if you are thinking abou the empires that were there and the people, then the question makes sense. First the Sumerians and Assyrians (or Akadians) who were there, Sumerians in the South and Assyrians in the North of Mesopotamia since many millenia before Christ (or CE), had there government replaced by invaders from the sea (perhaps the Ionians and relatives e.g. Hitites) which in time were driven away and the Assyrians took control of all; then these which had a civil government that respected the local religious authorities were replaced by a central religious authority, the Chaldeans who made an alliance with the Medes (from Persia). Afterwards the Medes governed and were replaced by the Macedonians (Alexandre the Great and his generals) which weakened and left a vacuum of power for sometime until the Romans came and took Mesopotamia. They governed it for 7 centuries always having some skirmishes with the persians until there came the islamic arabs and took it. From the islamic arabs it went to the hands of the islamic Seldjuks and Otomans who were tribes that came from Central Asia; until the end of the islamic arab reign there was some unrest but persecutions and genocides it seems that there wasn´t because the arabs were tribes from the desertic plains but when the Seldjuks and Otomans took things in their hands, systematic religious persecutions to the Mesopotamian people began and went on until the end of the Otoman Sultanate in 1918 when they lost WWI to the British and French. At that time, these two European nations who had a different idea about nation, formed many small republics or kingdoms, Syria, Irak, Iran and what rested from the Otoman Sultanate now called Turkey. Religious persecution stopped for a while but since the independence of Syria and Irak (in the ´40s and ´30s) it began again while in Turkey and Iran it would seem to go away but never went away, just continued disguised. What about the original people, the Assyrians, in Mesopotamia? They continued there, in Mesopotamia, until the end of the islamic Arab government. These Assyrians retained their culture and language but when the Seldjuks and Otomans took the power, they began to force the islamic language (arabic language) and their nomadic culture (e.g. women are sexual subjects to serve the male population, no lawful judgements, the tribal chief called sheik would judge as per his knowledge etc). If you compare this to old Sumerian laws (codex of Ur-Nammub; c. 2400 b.C. ) or Babylonian Codex (Hamurabi, c.1800 b.C.) you´ll see that there was a backward travel in civilization there. By now, Mesopotamia is getting depleted from the Assyrian people because of constant persecutions and genocides being such persecutions backed by western powers like France and UK and USA who want to install there another iranian people (kurds) and all this because such powers are only looking for the petroleum interests in the region. ",
            "date": "Answered February 23, 2018",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juli Phukan",
                    "user_href": "/profile/Juli-Phukan"
                },
                {
                    "user_id": "Chara Kiera",
                    "user_href": "/profile/Chara-Kiera"
                },
                {
                    "user_id": "Brian Parham",
                    "user_href": "/profile/Brian-Parham-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Womack",
                "href": "/profile/Andy-Womack"
            },
            "answer_text": "I would rephrase that and ask “Did Mesopotamia end? The answer would be no. Mesopotamia has been the the home of succession of Empires. Mesopotamia (Land between the rivers) is a geographical region and still very much functioning as the core of a Nation State called Iraq. Empires are temporary. Geographical Regions are, in human terms, permanent. ",
            "date": "Answered December 10, 2017",
            "views": "498",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zackary Savage",
                    "user_href": "/profile/Zackary-Savage-1"
                },
                {
                    "user_id": "Chara Kiera",
                    "user_href": "/profile/Chara-Kiera"
                },
                {
                    "user_id": "Sandra Davis",
                    "user_href": "/profile/Sandra-Davis-444"
                },
                {
                    "user_id": "Mariam Nis",
                    "user_href": "/profile/Mariam-Nis"
                },
                {
                    "user_id": "Rashad Najeeb",
                    "user_href": "/profile/Rashad-Najeeb"
                },
                {
                    "user_id": "Aditya Devlash",
                    "user_href": "/profile/Aditya-Devlash"
                },
                {
                    "user_id": "Terry Jones",
                    "user_href": "/profile/Terry-Jones-43"
                },
                {
                    "user_id": "Sophia Bland",
                    "user_href": "/profile/Sophia-Bland-1"
                },
                {
                    "user_id": "James Bundy",
                    "user_href": "/profile/James-Bundy-3"
                },
                {
                    "user_id": "Lucky Wamanker",
                    "user_href": "/profile/Lucky-Wamanker-1"
                }
            ]
        }
    ]
}