{
    "title": "How would a modern day Nazi soldier look like? - Quora",
    "tags": [
        "Nazi Soldier",
        "Nazism",
        "Military Personnel",
        "Nazi Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaron Bosen",
                "href": "/profile/Aaron-Bosen"
            },
            "answer_text": "Statistically speaking? Like what they were. A buried, and mostly rotted away corpse. You have to realize that right now, the absolute *youngest* possible Nazi child soldier who could’ve begun military service the day the war ended is realistically, *at least* 87 years old. That’s if you assume they got conscripted at *10* by the way, as some children were by the Nazis in the very last weeks of the war. In reality, a Nazi soldier who was 20 at war’s end would be about 94 years old. Anyone who’d likely been physically old enough to have participated in say, any of the battles of 1938 to 1942, would literally be over a century old. And on the average, people don’t very often live to a hundred even right now. Much less in post war Germany, where simply put, much of the eastern side of the country’s population was starving under Soviet rule, disease and shortages of medical supplies and personnel were common despite a great number of wounded soldiers. But if you were assuming against all logic, a modern Nazi controlled nation with a military, then the closest anywhere on earth post 1945 would allow would that to potentially be a thing would be in Argentina, which actively and knowingly sheltered some Nazi war criminals post war, some of whom later naturalized, and took up government jobs in their new nation. In fact, there was a scandal they had in the 70’s about an actual Nzi war criminal being elected mayor of a city. Assuming a Nazi controlled descendant state formed in Argentina post war, the vast bulk of the “modern” Nazis would be ethnic hispanics armed with some of the worst guns humanity has ever manufactured (seriously, Taurus supplies most of the Argentinan military’s weapons, and they’re almost legendarily bad quality guns) using decades old equipment, and frrankly, having given up on most of what we’d currently recognize as Nazi ideology simply out of simple necessity to be able to raise an army at all. ",
            "date": "Answered September 28, 2019",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Rochford",
                    "user_href": "/profile/Alexander-Rochford-1"
                },
                {
                    "user_id": "Cooper Mills",
                    "user_href": "/profile/Cooper-Mills-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suttichart Denpreuktham",
                "href": "/profile/Suttichart-The-Cat"
            },
            "answer_text": "Probably look like one of these  Now before you bring out your pitchfork and touches let me explain myself.. One of the most iconic symbol of Nazi German uniform is their helmet.  The helmet is called Stalheim (Steel Helmet), it was designed to be compact, relatively light, yet offer protection to both the hearing and fragment. It was highly celebrated for a its time and have been used by both the German, South American, and Chinese Nationalist during the war. Now let’s take a look at modern American helmet  Look some what similar? That’s because it is similar This American Advanced Combat Helmet which took a lot of basic from the German Stalheim to accommodate modern battlefield need. Most of these changes are very logical like improved material that reduced the weight and enhanced the helmet effectiveness, improved field of vision and other things that can be done today and not in 1945. Now, if the Nazi Germany survived the WWII they will become essentially the EU with one single authoritarian government. Their GDP will be will set well above modern American economy and their level of militarisation will most likely put the USA today to shame. Thus, I think it’s quite logical that the modern Greater Germany will make similar improvement to their famous Stalheim rather than abandon it. Their solder will also likely armed to the teeth in the similar fashion to the American today. In fact, most military today also look like that so it isn’t that they will be a big exception anyway. Now, if you want to assume that the German would have been left undeveloped due to whatever reason (most likely decades long international sanction), then there is also some more appropriate comparison. Chile Army!  The Chilean military is one of the few nations on this planet who preserve the military traditions of Prussia/Kaiser Reich , the Chilean military foundations were established by the German. Since the modern Germany had all but abandon those traditions for the sake of their new de-Nazified identity, the Chilean is left arguably the only nation the planet who still maintain these, including the use of the original Stalheim helmet.  Chilean military in field uniform ",
            "date": "Updated March 19, 2018",
            "views": "108",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harvey Asuela",
                    "user_href": "/profile/Harvey-Asuela"
                },
                {
                    "user_id": "Sten Reiter",
                    "user_href": "/profile/Sten-Reiter"
                },
                {
                    "user_id": "Roland Rollerdore Jr.",
                    "user_href": "/profile/Roland-Rollerdore-Jr"
                },
                {
                    "user_id": "Preston Thompson",
                    "user_href": "/profile/Preston-Thompson-44"
                },
                {
                    "user_id": "Melchior Lamort de Gail",
                    "user_href": "/profile/Melchior-Lamort-de-Gail"
                },
                {
                    "user_id": "Eren Kenar",
                    "user_href": "/profile/Eren-Kenar"
                },
                {
                    "user_id": "Crystal Gandrud",
                    "user_href": "/profile/Crystal-Gandrud"
                },
                {
                    "user_id": "Taylor Moss",
                    "user_href": "/profile/Taylor-Moss-5"
                },
                {
                    "user_id": "Alex Krieg",
                    "user_href": "/profile/Alex-Krieg-3"
                },
                {
                    "user_id": "David Reinhart",
                    "user_href": "/profile/David-Reinhart-5"
                }
            ]
        }
    ]
}