{
    "title": "How did the 7 ancient wonders get built? - Quora",
    "tags": [
        "7 Wonders (board game)",
        "Wonders",
        "Seven Wonders of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Lund",
                "href": "/profile/Erik-Lund-1"
            },
            "answer_text": " People build things. It’s a thing they do. If you want a deeper answer, I invite attention to the idea of “potlach,” a celebration in which goods are redistributed and social relations created by gift exchange. The gifts exchanged or consumed in a potlach are created by human labour, and the currently fashionable argument explaining large monuments is that they are the potlach. Or, “labour is potlach.” To take the example of Maiden Castle in southern Dorset, the argument is that people came from around the region to build this massive, hilltop enclosure. Whatever they thought they were doing, in terms of the function that this Early Iron Age hillfort performed in their minds, the very collective, social act of building it created social relationships that made a larger society possible. ",
            "date": "Answered March 22, 2018",
            "views": "136",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cameron Sullivan",
                    "user_href": "/profile/Cameron-Sullivan-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clarence Sherrick",
                "href": "/profile/Clarence-Sherrick"
            },
            "answer_text": "The 7 wonders of the ancient World (all in the western world) were built by various peoples. Egyptians, Greeks, Babylonians, etc. Some of whom used technologies, we are still unsure of as to how these structures were actually built. There is only one of those 7 ancient wonders of the World still standing. And it remained the tallest structure built by man for several thousand years. However, there were also many ancient wonders of the Eastern World. Some of which still actually exist. One is the only ancient structure built by man that can be viewed from space. ",
            "date": "Answered March 22, 2018",
            "views": "31",
            "upvotes": " Answer requested by Anthony Lewis",
            "upvoters": [
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stuart McClain",
                "href": "/profile/Stuart-McClain-1"
            },
            "answer_text": "With a lot of hard labor, much of it slave labor. And a lot of ingenuity and engineering techniques. ",
            "date": "Answered April 2, 2018",
            "views": "32",
            "upvotes": " View 1 Upvoter "
        }
    ]
}