{
    "title": "How did the Muslim religion come? Who created this religion? - Quora",
    "tags": [
        "Origin of Muslim"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prithvi Singh",
                "href": "/profile/Prithvi-Singh-125"
            },
            "answer_text": "Muslims believe that the first person on this earth, Adam, was the first Muslim. They also believe that this earth was never devoid of a ‘Divine Guide’ (Nabi / Prophet) from God to guide the mankind. The Islam that you see today is the evolved version of ‘first Islam’ of ‘Adam’. Every few years (decades / centuries) it got mixed with customs and cultures of other religions and societies and thus got corrupted. So, God renewed it by sending new Prophets in every era. The last of these prophets was Mohammed who left this world some 1400 years ago. Sunni Muslims believe that he appointed no successor after him and Shia Muslims believe that he appointed Ali (his cousin and son-in-law and) to succeed him on God’s command, thus providing divine guidance even after the demise of Mohammed. So, Muslims believe that the creator of this religion is Allah and He has ‘created’ only one religion and that is Islam. Surah Ali 'Imran [3:19] ",
            "date": "Answered February 19, 2018",
            "views": "283",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ram Sharma",
                    "user_href": "/profile/Ram-Sharma-1619"
                },
                {
                    "user_id": "Samantha Fernandes",
                    "user_href": "/profile/Samantha-Fernandes-35"
                },
                {
                    "user_id": "John Grey",
                    "user_href": "/profile/John-Grey-100"
                },
                {
                    "user_id": "Yasir Khan",
                    "user_href": "/profile/Yasir-Khan-82"
                },
                {
                    "user_id": "Jack Promin",
                    "user_href": "/profile/Jack-Promin"
                },
                {
                    "user_id": "Aryan Saxena",
                    "user_href": "/profile/Aryan-Saxena-30"
                },
                {
                    "user_id": "Sayed Seemab Zehra",
                    "user_href": "/profile/Sayed-Seemab-Zehra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohammad Khaja Shaik",
                "href": "/profile/Mohammad-Khaja-Shaik"
            },
            "answer_text": "The first human Adam as is a Muslim. The Creator gave only one religion. It is Islam. All other religions are man made or modified versions of Islam. ",
            "date": "Answered February 19, 2018",
            "views": "40",
            "upvotes": "0"
        }
    ]
}