{
    "title": "How does modern France view the French Revolution? - Quora",
    "tags": [
        "French Revolution",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "elisheva",
                "href": "/profile/elisheva-2"
            },
            "answer_text": "Hey ! I’m a French person, so I think I can give you both a personal and a more general point of view on the French Revolution. Most of the French don’t really mind the French Revolution, but are glad it happened. When we talk about the French Revolution we think “overthrowing the monarchy” and not really the reign of Terror. But when we do talk about the reign of Terror, most of the people think of an era in which “evil, blood-thirsty” Robespierre became an awful dictator, and with the help of his allies, condamned anyone and everyone to death. Yes, unfortunately, the post-thermidor propaganda is deeply ingrained in our culture and minds. We are taught in school that the French Revolution was a good thing until 1793, where it became wicked and how all the “good guys” died (Danton, Desmoulins) at the hands of the “evil” Robespierre. The reign of Terror is treated the way we learn about dictatorships, without nuances at first, but if you follow more specific History studies, then (some) professors might add nuances to it. But generally speaking, we appreaciate the overthrowing of monarchy, but not what ensued of it. Although most people believe Robespierre was a bad guy, today we have what we call “roberpierristes” who are more sympathetic to him. And despite a majority being happy without a king, we still have royalists (royalistes in French) who are politically active today ! In French schools, we usually don’t evoke the reign of Terror that much when introduced to the French Revolution, but as we grow older, they teach us that the reign of Terror was a really bad thing and that everyone lived in fear (which is not true, even if the context was extremely tense). We really are taught the details of the Revolution because even now, some characters/events are subject to controversy and some are even totally unknown to us. The French Revolution was an important part of our History that we are proud of, even if we don’t glamorize the reign of Terror. French Revolution rhythms with Freedom, Equality and Fraternity for us, with rights, new living conditions. And although it is not essentially true, it is still the heritage we believe we had from that period. And I have to say that the view on the French Revolution also depends on where you are in France. In vendée for example, people usually associate the FR with the terrible massacres that happened here. Vendéens are still renowned to be royalists, even now haha. As for me, and for studying relentlessly the French Revolution for more than two years, I can assure you that the French Revolution is a complexe, complicated mess. It is more than just pissed French people killing the King and falling into a dictatorship. ;) ",
            "date": "Answered January 20, 2017",
            "views": "943",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michel Gehin",
                    "user_href": "/profile/Michel-Gehin"
                },
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "Conor Kelly",
                    "user_href": "/profile/Conor-Kelly-116"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rachel Guibert",
                "href": "/profile/Rachel-Guibert"
            },
            "answer_text": "Actually… French Revolution is honestly seen as a huge progress against obscurantism and absolutism and Terror is often quite undermined as a terrible but negligible consequence. I think it's mainly due to the fact that French history is not really teach with as many shades as it should at least in middle school. I think I did have to wait until high school aka age 15 to learn about things that my country is’t proud of such as colonialism or collaboration with nazis during WWII so it's not really surprising Et that Terror isn't emphasized. Moreover, I come from a well-educated republican atheist family and while they know the many shades of French Revolution, they seem to think that it wasn't that bad because it was a period of trouble and everything and because people like Robespierre did many great things. I personally disagree, especially after reading Quatrevingtreize by Victor Hugo, but it's hard to change their mind! ",
            "date": "Answered November 20, 2016",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "James Flynn",
                    "user_href": "/profile/James-Flynn-184"
                },
                {
                    "user_id": "Gary D. St John",
                    "user_href": "/profile/Gary-D-St-John"
                },
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-2"
                },
                {
                    "user_id": "Mathieu Ravaut",
                    "user_href": "/profile/Mathieu-Ravaut-1"
                },
                {
                    "user_id": "Ash Evans",
                    "user_href": "/profile/Ash-Evans-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yvan Testu",
                "href": "/profile/Yvan-Testu"
            },
            "answer_text": "French mainly think about the french revolution as it is teached at school, a huge propaganda machine emphasing Liberté Egalité Fraternité, the beauty of the République and the french exceptionnalism ( Droits de l’ Homme et des Citoyens giving to french intellectuals and politics the right to make the lesson to the entire world ). If you can’t change the facts, just write History In this process they totally discard any reference to the reforms done by Louis XVI, to the counter revolution of Napoleon, to the geopolitical conflicts with the austrian Empire, to the almost full century of political turmoils that France experienced before it entered finally around 1880 the Group of colonist nations ( heirs of the Concert of Europe What is the Entente and the Alliance in historical perspective? ), all crimes against its own population ( Bretons and Chouands during the Révolution, Jews during the Pétain régime ), against external population ( north Africa, Morroco but mainly Algeria, Indochina ) and all corruption affairs which ultimately crushed the 4th republic but had continued with the France Afrique, the commissions on armement contract… All of that is overlooked. Despite Révolution, laîcité, the french republic apologized to the Hugenots only in … 1985 Protestantism was eradicated after the abolition of the Edict of Nantes by the Edict of Fontainebleau and the following persecution of Hugenots. In October 1985, to commemorate the tricentenary of the Revocation of the Edict of Nantes, Mitterrand gave a formal apology to the descendants of Huguenots around the world, he recognized that France is the home of the Huguenots (\"Accueil des Huguenots\"). The crime towards the Harkis ( muslim pro french algerians who were left in Algeria and faced the brutality of the algerian nationalists, the Harkis that managed to migrate to France were stocked into shantytowns and faced the brutality of Charles de Gaulle’s police ) has been recognized only in 2016 Harkis : Hollande reconnaît la responsabilité de la France Now people are starting to sort the facts and the myths, another myth is the Résistance leading to Réconciliation Nationale, it was important to reorganize the french political élite since this élite divided itself in two camps, the one of Treason ( witness the incredible Bullitt story left as the mayor of Paris ), the one of Collaboration, moreover since de Gaulle needed the communists to organize his industry he had to make people forget the trouble waters of the pact Ribbentrop Molotov, Résistance was the tool. ",
            "date": "Answered December 5, 2016",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George Thomas (Ted) McNabb",
                "href": "/profile/George-Thomas-Ted-McNabb"
            },
            "answer_text": "In many ways the French regard “The French Revolution” in a manner similar to the way that the Americans regard “The American Revolution” and that is to say that there is a “myth” that generally interpreted in a specific manner and that “myth” is taught as “fact” but there are also people who interpret the “myth” differently and teach THAT interpretation as “fact”. At least the French recognize that there were injustices and horrors perpetrated (by the winners) during “The French Revolution” while the Americans will only acknowledge the injustices and horrors perpetrated by the losers during “The American Revolution” ",
            "date": "Answered December 4, 2016",
            "views": "631",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "Suzanne Fortin",
                    "user_href": "/profile/Suzanne-Fortin"
                },
                {
                    "user_id": "Kaustubh Sivalenka",
                    "user_href": "/profile/Kaustubh-Sivalenka"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Géal-Killy",
                "href": "/profile/George-Géal-Killy"
            },
            "answer_text": "The Revolution is not glamorized. It is simply taught, described as it was. The simple facts. There is no liking it or being against it. It just happened. Nowhere you will see a debate asking people to take position. It's viewed as one of the most important events in the History of France. The keystone of modern France. People accept the entire heritage, the good and the bad. ",
            "date": "Answered November 20, 2016",
            "views": "549",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "Andrew Shoring",
                    "user_href": "/profile/Andrew-Shoring"
                },
                {
                    "user_id": "Faisal Aburemsh",
                    "user_href": "/profile/Faisal-Aburemsh"
                },
                {
                    "user_id": "Gil Anderson",
                    "user_href": "/profile/Gil-Anderson-5"
                },
                {
                    "user_id": "Yves Granger",
                    "user_href": "/profile/Yves-Granger"
                },
                {
                    "user_id": "Ash Evans",
                    "user_href": "/profile/Ash-Evans-16"
                },
                {
                    "user_id": "Jacques Dupont",
                    "user_href": "/profile/Jacques-Dupont-3"
                },
                {
                    "user_id": "Matthew Sutton",
                    "user_href": "/profile/Matthew-Sutton-3"
                }
            ]
        }
    ]
}