{
    "title": "How is it that Russia and the USSR have been such military threats to America with such relatively small economies? - Quora",
    "tags": [
        "Russia and the United States of America",
        "Russia",
        "Military",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pablo Djankowicz Ruizinowitz",
                "href": "/profile/Pablo-Djankowicz-Ruizinowitz"
            },
            "answer_text": "Russia has an economy $1 trillion dollars smaller than the California economy. So it’s a very modest nation, economically-speaking, especially when one considers its population size (about 143 million in Russia vs. 39 million in California) and its land size (about 6.6 million square miles for Russia vs. 163,000 square miles for California). That being said, that’s precisely the reason why the USSR collapsed in the first place—a huge portion of its much smaller GDP (like 15% to 20% at its peak during the Cold War) was funneled to support the military. That stood in stark contrast to the US where, throughout the Cold War, only around 4% to 6% of the US GDP was going to fund the military simply because the US economy was way larger. Such massive military spending squeezed out all other forms of investment in the USSR in the long run—especially for consumer goods and housing for most Soviet citizens. This led to widespread discontent among the Soviet citizenry, and mortally ate away at the legitimacy of the Communist Party. It also led to all sorts of enormous economic distortions, which slowed down and then stagnated the USSR economy in the 1970s and 1980s. Suffice to say, if the USSR had had a much bigger economy to support its huge military expenditures, there’s no doubt that it would still be around. Nowadays the Russian economy is even smaller than the USSR economy (partly because the USSR had 250 million people and Russia now only has 143 million people). If it seeks to project military power in the way the USSR did back in the day, Russia would have to more or less devote 25% to 35% of its GDP to military expenditure. This would drive out all other sorts of investment from the economy, further impoverishing normal Russian citizens as there would be no resources left for consumer goods and housing. (This is precisely what happens in North Korea, where roughly 30% of the GDP is spent on the military, leaving average North Koreans dirt poor.) This, in turn, would lead to so much mass unrest that Putin would probably be toppled through a very bloody rebellion. So, in the long run Russia will still lose to the US—because its economy is much smaller and weaker. And before anyone says that having a huge nuclear arsenal makes Russia strong—one must remember that most of its nuclear weapons are strictly defensive in nature. In other words, the only way Russia can use its nuclear weapons is if it is attacked first and with nuclear weapons. It cannot project power outside its borders with nuclear weapons alone. Otherwise, if Russia opts to utilize atomic bombs in offensive measures—like in a small war—it is likely to invite massive retaliation from the Western nuclear powers—the US, the UK and France. So Russia would rather not do this, for obvious reasons. ",
            "date": "Answered February 13, 2017",
            "views": "585",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darren Kowalski",
                    "user_href": "/profile/Darren-Kowalski-2"
                },
                {
                    "user_id": "Thanu V",
                    "user_href": "/profile/Thanu-V"
                },
                {
                    "user_id": "Chris Potts",
                    "user_href": "/profile/Chris-Potts-15"
                },
                {
                    "user_id": "Raymond T. Frost",
                    "user_href": "/profile/Raymond-T-Frost"
                },
                {
                    "user_id": "Dmitriy Sintsov",
                    "user_href": "/profile/Dmitriy-Sintsov"
                },
                {
                    "user_id": "Olga Petrova",
                    "user_href": "/profile/Olga-Petrova-13"
                },
                {
                    "user_id": "Oleg Goncharuk",
                    "user_href": "/profile/Oleg-Goncharuk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Collins",
                "href": "/profile/Brian-Collins-56"
            },
            "answer_text": "“We’re hearing a lot about a possible new cold war on the horizon these days with how Russia was speaking about a possible Clinton administration and Obama putting troops in Eastern Europe, but I was looking at country ranks by total GDP and Russia is below even Italy and Canada.” Yes…. current Russia. Currently Russia has a smaller economy than California in terms of nominal GDP. Current Russia does not equal the USSR. The USSR had one of the largest economies on earth. At the end of WWII the USSR had an economy about 30% the size of the US, but it grew faster than the US economy for the next few decades. In 1975 the USSR was 57% the economy of the US. https://www.cia.gov/library/readingroom/docs/DOC_0000497165.pdf After then however, they and their Warsaw Pact allies ran into serious problems, to say the least. That segues into my next point: the USSR had a bunch of puppet-state allies. Their loyalty is dubious in hindsight (I mean… the Romanian Army shot the Soviet-backed dictator as soon as the wall came down and government after government fell to civil unrest), but on paper at least, they had about 350,000,000 people in their sphere of influence. In 1949 about 1/3 of the world’s population, or 800,000,000 people, lived in the Soviet sphere of influence (prior to the Sino-Soviet split). That is a large reason of how the USSR was threatening. At the end of WWII, they had troops all over Europe and Central Asia and occupied dozens of countries. In most of those countries they installed a government that would support Soviet interests. ",
            "date": "Updated February 25, 2017",
            "views": "503",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Błażej Seremak",
                    "user_href": "/profile/Błażej-Seremak"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Chris Potts",
                    "user_href": "/profile/Chris-Potts-15"
                },
                {
                    "user_id": "Nick Haldon",
                    "user_href": "/profile/Nick-Haldon-1"
                },
                {
                    "user_id": "Emlyn Shen",
                    "user_href": "/profile/Emlyn-Shen"
                },
                {
                    "user_id": "Saad Khan",
                    "user_href": "/profile/Saad-Khan-466"
                },
                {
                    "user_id": "Dillan Porter",
                    "user_href": "/profile/Dillan-Porter"
                },
                {
                    "user_id": "Akshat Prakash",
                    "user_href": "/profile/Akshat-Prakash-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Aspesi",
                "href": "/profile/Steve-Aspesi"
            },
            "answer_text": "Not only is the Russian economy smaller, but their military budget and size is about a tenth the size of the US, yet the US has a way of defining “threat” like no other. Have a missile that can hit Israel? You’re a threat. Are you selling arms to someone we don’t like? That’s a threat. Are you moving your borders into other sovereign nations? That’s a threat. Is your country run by a dictator or communism? that’s a threat. Does your country have an energy source vital to our economy or a US corporation doing business there? that’s a threat. President Obama once mentioned that Russia is a threat to it’s neighboring countries and a region of the world. He called them a “regional threat”. By and large he’s right. And since the US is bent on policing the world and keeping their military complex ever increasingly funded, we can find threats like no other country. Growing up in the 60’s, I can remember practicing ‘duck and cover’ in the class room. Sirens would go off and we would pretend we were under an attack from the Soviet Union. It was paranoia at it’s worst in the US. Anyone accused of being a communist or even a sympathizer to a communist could be black listed. Conformity was the norm until Vietnam revealed a dark side to the war on communism. Many people attended church in those days out of fear of being seen as some kind of godless commie. The US sent 60,000 young men to their death in Vietnam out of a fear that if that country would fall to the communists, it could become what was described as a domino effect. Today Vietnam is one of a few communist ruled countries left on the planet and they are trading partner with the US along with China. I guess you could say corporate profit won over the fear of communism. ",
            "date": "Answered February 25, 2017",
            "views": "833",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Santino Beretta",
                    "user_href": "/profile/Santino-Beretta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victor Volkov",
                "href": "/profile/Victor-Volkov-3"
            },
            "answer_text": "The issue is two-fold. Having an “enemy” is convenient. Basically, a politician could decide that from now on this country is going to be the “enemy”, and said enemy could be blamed for many things, and could be used to distract populace from internal problems. It also could be used to justify military spending. So, the threat of Russia was greatly exaggerated, and as I mentioned many times, back in the last summer there was an incredibly powerful wave of anti-russian propaganda, to the point where it felt that the nukes are gonna fly tomorrow. The thing stopped at the last moment. On other hand… Russia still has the nukes and there’s a military. While nukes were inherited from USSR, there’s enough of them to wipe all the life on the planet several times over. Meaning the country is not harmless. Then again, USA has similar amount of nuclear weapons. So, basically.. the country is not harmless and is capable of dealing damage if provoked or attacked. However, it is often being portrayed as a villain for propaganda purposes. Same thing as this:   Only using newer methods and materials. ",
            "date": "Answered February 13, 2017",
            "views": "685",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexandr Bitsadze",
                    "user_href": "/profile/Alexandr-Bitsadze"
                },
                {
                    "user_id": "Pavel Velikhov",
                    "user_href": "/profile/Pavel-Velikhov"
                },
                {
                    "user_id": "Frank Wang",
                    "user_href": "/profile/Frank-Wang-193"
                },
                {
                    "user_id": "Alexander Gazarov",
                    "user_href": "/profile/Alexander-Gazarov"
                },
                {
                    "user_id": "Ken Paul",
                    "user_href": "/profile/Ken-Paul-5"
                },
                {
                    "user_id": "Jamie Daniels",
                    "user_href": "/profile/Jamie-Daniels-13"
                },
                {
                    "user_id": "Raymond T. Frost",
                    "user_href": "/profile/Raymond-T-Frost"
                },
                {
                    "user_id": "Rainer Rodrigues",
                    "user_href": "/profile/Rainer-Rodrigues"
                },
                {
                    "user_id": "Ryan Serrato",
                    "user_href": "/profile/Ryan-Serrato-1"
                },
                {
                    "user_id": "Yifei Li",
                    "user_href": "/profile/Yifei-Li-29"
                },
                {
                    "user_id": "Olga Petrova",
                    "user_href": "/profile/Olga-Petrova-13"
                },
                {
                    "user_id": "Sergey Kalmikov",
                    "user_href": "/profile/Sergey-Kalmikov"
                },
                {
                    "user_id": "Vladimir Makarenko",
                    "user_href": "/profile/Vladimir-Makarenko"
                },
                {
                    "user_id": "Tom Kitta",
                    "user_href": "/profile/Tom-Kitta"
                },
                {
                    "user_id": "Ajith Madhav",
                    "user_href": "/profile/Ajith-Madhav"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maciej Pas",
                "href": "/profile/Maciej-Pas"
            },
            "answer_text": "GDP may not be the best measure here. It’s not only about how much money you have or create, but also how you spend it. I’ll give you an example. At the end of the 1980s, Poland was still part of the Warsaw Pact. A country of around 35 million people (around 15% of the US population) had an army of almost 350,000 soldiers (with reserves going in millions, being that army service was compulsory for all men above the age of 18), with over 3,300 tanks, 4,800 armored vehicles and 480 F&A planes. That was just one Poland, whose army’s target in case of WW3 was taking over Denmark. The total forces of the Warsaw Pact included over 3.5 million soldiers in active duty, almost 60k tanks and over 70k armored vehicles. Now, they may not have been the most modern models, but the sheer numbers are scary. On top of that, many countries of the Warsaw Pact had tactical nuclear weapons deployed on their territories; the scary thing about it was, that Russians were thought to be crazy enough to actually use them. You can top it with the fact, that for the longest time after WW2, Russians had an advantage over the US with regard to their space program. They were the first ones to place a satellite above the Earth, first to shoot a man into space, and first ones to develop a successful ICBM. And again, they were thought to be crazy enough to actually use them. In the end, the small economy vs. large military spending turned out bad for the Soviet Bloc and resulted with its fall. But at least for some time there, in posed a real threat. If not to the US directly, then surely for Western Europe. ",
            "date": "Answered February 13, 2017",
            "views": "306",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Xinxin Sun",
                    "user_href": "/profile/Xinxin-Sun"
                },
                {
                    "user_id": "Jamie Daniels",
                    "user_href": "/profile/Jamie-Daniels-13"
                },
                {
                    "user_id": "Todd McGraw",
                    "user_href": "/profile/Todd-McGraw"
                }
            ]
        },
        {
            "author_info": {
                "name": "Viktor Ygorov",
                "href": "/profile/Viktor-Ygorov"
            },
            "answer_text": "Because to support US military industries functioning at such high rate and output there needs to be a threat to its host nation peace and its allies. Real or fake is secondory to the panic it causes. Having lost Soviet UNion in early 90s US had honestly attempted to find a new global enemy to fight. This quest eventually produced a war on terror. A seemingly brilliant invention, with a host of new technology deployed to monitor its own population, increase the measures that can be used to subdue it if needs be all while spending like maniacs on wars no one has even tried to explain to this day. As for AQ and it's activity it's convenient presence where ever we needed to level something out was not long lived. Too soon too much, as more people started to notice at least some disconnect in its backstory it was abandoned as a defeated enemy(only a year after it was proposed to be an undefeatable idiology). Damn thing proved to be so fragile that having built up its cousin ISIS 2–3 years ago we are yet to get any good war spending done fighting if , as they seem to be barely hanging in with just Russian Syrian and Iraq forces fighting them. Which brought us full circle, having found no one else to fight in 15 years, almost 30 nations NATO had to settle for Russian Federation yet again outmatching it in military strength 10 to 1 and at least 30–1 in economic. As I said, to US’s credit it did try and spent a ton of money looking for someone new giving Russia some breathing room. It's truly unfortunate that no one else could be found. Hopes this helps ",
            "date": "Answered February 13, 2017",
            "views": "450",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maleesha Lakshan",
                    "user_href": "/profile/Maleesha-Lakshan-1"
                },
                {
                    "user_id": "Hersh Bortman",
                    "user_href": "/profile/Hersh-Bortman"
                },
                {
                    "user_id": "Cass Dean",
                    "user_href": "/profile/Cass-Dean"
                },
                {
                    "user_id": "Boerge Rahbech Jensen",
                    "user_href": "/profile/Boerge-Rahbech-Jensen"
                },
                {
                    "user_id": "Janna Jurkash",
                    "user_href": "/profile/Janna-Jurkash"
                },
                {
                    "user_id": "Olga Petrova",
                    "user_href": "/profile/Olga-Petrova-13"
                },
                {
                    "user_id": "Sergey Kalmikov",
                    "user_href": "/profile/Sergey-Kalmikov"
                },
                {
                    "user_id": "Vladimir Makarenko",
                    "user_href": "/profile/Vladimir-Makarenko"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frederic Ulric",
                "href": "/profile/Frederic-Ulric"
            },
            "answer_text": "The threats are largely made up, because that’s part and parcel of american propaganda. Just look at how they’re turning China into a military adversary, even though it hasn’t been in a war for nearly half a century, has a very peaceful population, no military bases abroad almost, very little comparative military expenditure and no stated intentions for war or conflict - despite a few disagreements with neighbours. Yet China is being turned into an enemy. It’s just more american terrorism. Don’t believe it. Next you’ll hear Iran is a threat. It isn’t. The US just doesn’t like independent countries. ",
            "date": "Answered February 13, 2017",
            "views": "229",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Gunner",
                    "user_href": "/profile/Andrew-Gunner-2"
                },
                {
                    "user_id": "Dingqi Zhang",
                    "user_href": "/profile/Dingqi-Zhang-1"
                },
                {
                    "user_id": "Naval RezaF",
                    "user_href": "/profile/Naval-RezaF"
                },
                {
                    "user_id": "Naresh Kumar",
                    "user_href": "/profile/Naresh-Kumar-1451"
                },
                {
                    "user_id": "Kyle Zhang",
                    "user_href": "/profile/Kyle-Zhang-19"
                },
                {
                    "user_id": "Sergey Kalmikov",
                    "user_href": "/profile/Sergey-Kalmikov"
                },
                {
                    "user_id": "Vladimir Makarenko",
                    "user_href": "/profile/Vladimir-Makarenko"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamie Daniels",
                "href": "/profile/Jamie-Daniels-13"
            },
            "answer_text": "The problem is when the Russian economy is still on weak role, its money is mostly used focusing on military drills and upgrading its military weapons and reorganizing military structures. This might be weird, but it explains how ridiculous this theory could’ve become true like this. Most of Russian leaders often contribute to its military since Russia is somewhat a kind of half-military society just like South Korea and Israel, with the exception being Israel and South Korea are more industrialized than Russia. Since Russia spends money for military when they have a growth GDP significantly, they can set up military weaponry and even nuclear weapons. Remember today, Russia still keeps over 7.000 thousand nuclear bombs as the result of Soviet military legacy encountering the US. No wonder why the US feels scared. Because of Russia’s capability, even economic development of Russia is slow. ",
            "date": "Answered February 14, 2017",
            "views": "268",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ziaddinè Chahoudi",
                    "user_href": "/profile/Ziaddinè-Chahoudi"
                },
                {
                    "user_id": "Fernando Dorarinho",
                    "user_href": "/profile/Fernando-Dorarinho"
                }
            ]
        },
        {
            "author_info": {
                "name": "Babs Rahman",
                "href": "/profile/Babs-Rahman"
            },
            "answer_text": "I will just add to what others have already said. Despite the inefficiency of the Soviet economy, it was still very large by worldwide standards and the USSR had vast natural resources that the centrally planned economy could direct towards pressing matters namely heavy industry. This is why a backward empire like Czarist Russia was able to rapidly industrialise under its USSR guise and why the USSR could send people to space and develop MIRV SLBM and ICBM nukes yet couldn't produce a decent car or feed it's people well. ",
            "date": "Answered February 13, 2017",
            "views": "128",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tom Kitta",
                    "user_href": "/profile/Tom-Kitta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Boris Ezomo",
                "href": "/profile/Boris-Ezomo"
            },
            "answer_text": "In short. The GDP is not a true representation of the buying power. Let me simplify it with an example. In Nigeria a packet of cigarettes costs about 40 cents. The same packet in all aspects in the UK costs $10. So the buying power is different in Russia too. Same pack of fags is 50cents there. Another factor is the difference in manfacturing costs. During the Soviet times, the military industry was owned by the government. All supplies to the industry also government owned. Now the government has commanding shares in the industry and a special purchasing prices for the military. In the U.S. it is a profit orientation business full of middlemen each making a profit. In short for what the USA pays for a single fighter, Russia would had manufactured three. ",
            "date": "Answered February 13, 2017",
            "views": "410",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Aspesi",
                    "user_href": "/profile/Steve-Aspesi"
                },
                {
                    "user_id": "Alexis Alejandro Bueno Norambuena",
                    "user_href": "/profile/Alexis-Alejandro-Bueno-Norambuena"
                },
                {
                    "user_id": "Jacques Văn Khải",
                    "user_href": "/profile/Jacques-Văn-Khải"
                },
                {
                    "user_id": "Jamie Daniels",
                    "user_href": "/profile/Jamie-Daniels-13"
                },
                {
                    "user_id": "Ashif Istiak Anik",
                    "user_href": "/profile/Ashif-Istiak-Anik"
                },
                {
                    "user_id": "Ryan Serrato",
                    "user_href": "/profile/Ryan-Serrato-1"
                },
                {
                    "user_id": "Sergey Kalmikov",
                    "user_href": "/profile/Sergey-Kalmikov"
                },
                {
                    "user_id": "Tom Kitta",
                    "user_href": "/profile/Tom-Kitta"
                },
                {
                    "user_id": "Cristian A. Rodriguez",
                    "user_href": "/profile/Cristian-A-Rodriguez"
                },
                {
                    "user_id": "Evangelos Lolos",
                    "user_href": "/profile/Evangelos-Lolos"
                },
                {
                    "user_id": "Victor Volkov",
                    "user_href": "/profile/Victor-Volkov-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louis Vaught",
                "href": "/profile/Louis-Vaught"
            },
            "answer_text": "I would say that, given historical and current context, military presence isn’t tightly coupled to economic size. Countries can afford to invest disproportionate amounts of money in their military (at least in the short term), and sometimes the military of a country can be more efficient than other countries. For a good example of strong investment, see North Korea, which has a weak economy but a relevant military on the global stage. For a good example of efficient military, see the history of Great Britain’s navy, which has held off significantly larger and better-funded forces repeatedly. Over-investment in military might with a weak economy can lead to instability in the long-term though. North Korea is in a shambles, and the cold war ended when the USSR collapsed. ",
            "date": "Answered February 13, 2017",
            "views": "219",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Todd McGraw",
                    "user_href": "/profile/Todd-McGraw"
                },
                {
                    "user_id": "Evangelos Lolos",
                    "user_href": "/profile/Evangelos-Lolos"
                },
                {
                    "user_id": "Victor Volkov",
                    "user_href": "/profile/Victor-Volkov-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Hutson",
                "href": "/profile/Michael-Hutson-8"
            },
            "answer_text": "Except for its nuclear weapons, Russia is not really a military threat to the United States. It is however a significant threat to the rest of eastern Europe. Ukraine, Belarus, the Baltic republics and even possibly Poland would be hard pressed to resist a Russian invasion without assistance from NATO. Hence the USA is involved in eastern European affairs by alliance. ",
            "date": "Answered February 13, 2017",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Stein",
                "href": "/profile/Gary-Stein-6"
            },
            "answer_text": "Russia and the USSR are serious threats to USA. All one has to do is look at their strong military fighting and cyber defense force. It is even stronger than USA in capability. ",
            "date": "Answered February 13, 2017",
            "views": "99",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fred Lamb",
                "href": "/profile/Fred-Lamb-2"
            },
            "answer_text": "The USSR as you say was not an economically poor country after WWII. It became very powerful and developed a huge nuclear arsenal and sub fleet of Boomers and a huge military. Their economic collapse at the end of the cold war and becoming the RUSSIA we know today is a weaker nation compared to the past only economically. The weapons they created haven't gone anywhere nor the skill. They still spend a lot to maintain it and advance. ",
            "date": "Answered February 13, 2017",
            "views": "77",
            "upvotes": "0"
        }
    ]
}