{
    "title": "How will the GOP change if Trump loses to Biden? - Quora",
    "tags": [
        "Grand Old Party (GOP)",
        "Joe Biden (politician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Nary",
                "href": "/profile/Sam-Nary"
            },
            "answer_text": "A lot of this will depend on the results of the election and the nature of the Republican defeat… If the defeat is narrow… This would include any scenario in which the popular vote difference is by 3 million votes or less, Biden only just clears 270 electoral votes, and Congress remains divided… Here the Republican Party will change very little. Politicians like McConnell might claim that they tried to hold Trump back over the course of his four years from the “worst” of his mistakes, but the Republican voter base will likely remain firmly in a very Trump-like state… And most of this would be because the election was close. Remember that Trump claimed to have won the popular vote in 2016 if it weren’t for Democratic voter fraud… and that was in an election where he won the electoral college and narrowly won the states that gave him the electoral college victory. He has already stated he might not accept the election results and claim them to be fraudulent if he loses. And in 2018 in the state wide elections (Senate races) the Republicans GAINED seats on “defend Trump” platforms. In this, while a defeat for Trump may hurt… because the difference would marginal, that’s not going to change anything. For in this situation the Republicans would likely retain the Senate and while they may not win the House, they’d at least cut into the Democratic lead a bit. And while Trump may be gone… the politicians that supported him for four years and relied on the partisanship used during Obama’s Presidency to get Trump elected in the first place are not going to suddenly admit their mistakes or that they went to far. Particularly while the things that have shifted much of America’s attention away from Trump in 2020 are not things that Trump can control or respond to. Thus, Biden would take the white house, get a begrudging congratulations from McConnell and then be told that the Republican driven gridlock of 2011–2017 will return to business as normal in the hopes of getting Trump elected to a non-consecutive term in 2024… or if not Trump, then some one like him. If the defeat is clear… but not decisive… This would include Biden easily clearing 270 electoral votes and wins the swing states in Pennsylvania, Michigan, and Wisconsin and the popular vote difference is greater than 3 million and Trump holds in Arizona, Texas, and Florida… This would also include that the Democrats retain the House and at the very least cut into the Republican lead in the Senate, if not gaining the bare minimum they need to gain a Democratic majority, counting the Democratic VP… This would then depend on the states in question. Trump might well still complain, and his wing of the party will vocally charge Biden and the Democrats with some kind of cheating… but some of the states, particularly those that Trump ended up dragging down Republican turnout in could well lead to some of the present divisions within the Republican Party, that have already been appearing, will continue. And I would imagine that men like McConnell and Graham would be among the GOP survivors in the Senate in such a scenario that would be among the group that ends up claiming to have tried to “moderate” Trump but was unsuccessful… Much of this would be used to try and set up what the Republican Party would have to go through to prepare for 2024. Support for Trump’s brand of conservatism might have fallen, but this does NOT mean that men like McConnell are not going to suddenly turn away from the tactics they used to win power in 2010, 2012, and 2014 in congressional and governor’s races. They are still going to rely on a view of the political spectrum as something that treats the political Right as the ONLY part of the spectrum that believes in freedom and that Trump was an aberration to that interpretation… Thus Biden would take office and would have some window to get one or two things done, but the Republican Party will return to the exact same tactics they used from 2010 onward and with the party leadership claiming that THIS time their tactics won’t lead to someone that would fail as much as Trump… For yes, the Republican Party would have taken a hard hit… but it would be a hit that could be easily blamed on Trump and that many of the principle actors that helped Trump win in 2016 would remain in key positions in the Senate, in the governor’s mansions, and the state legislature. Thus the defeat would be a defeat for Trump as an individual… but not so much for the Republican party… If it’s a landslide Democratic win… This would include Democrats gaining seats in the House, gaining a clear majority in the Senate and defeating both McConnell and Graham… and taking Arizona, Montana, and at least one of the seats in Georgia in addition to Maine and Colorado. In the Presidential race… Biden would not only clearly win the electoral college, but would also win various states that he shouldn’t be competitive in… like Florida, Texas, Georgia, and North Carolina. At the same time, the vote count in these states would also be by such a margin that there can be no believable claim of voter fraud by anyone. Trump might still make the claim… but the margin would be such that no one believes it… This would be the one that would truly shake the Republican Party and its ideology. For it would show a clear rejection of Trump and his divisive rhetoric and the management style that has lead to the present health crisis. It probably won’t mean that most Republicans will suddenly become fans of Democratic Party policies… BUT because the electoral shift would be such that Trump and many of the key actors that have enabled Trump would be removed, including at least 7 Republican Senators that have backed Trump on EVERYTHING he did… there would have to be some measure of finding a way to rethink things moving forward. They can’t just return to their old policies that were used before, because by now… it’s likely the Democrats won’t wait two or three years to charge them with being overly partisan in them. And in the wake of such an electoral defeat… and with many of the GOP leaders also being defeated, a fair number of Republicans may not ever come back to the Republican Party, especially if the party leadership ends up deciding to keep Trump… or someone like him… in a leadership role in opposing what Biden would do as President. Though in such a situation, this sort of defeat might give the Republicans to move back toward the center and try again with Romney in 2024… using the fact that he had clearly turned against Trump in various respects. ",
            "date": "Answered July 26, 2020",
            "views": "323",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pete Tittl",
                    "user_href": "/profile/Pete-Tittl-1"
                },
                {
                    "user_id": "Jack Scott",
                    "user_href": "/profile/Jack-Scott-174"
                },
                {
                    "user_id": "Leo McDevitt",
                    "user_href": "/profile/Leo-McDevitt"
                },
                {
                    "user_id": "Brian Hope",
                    "user_href": "/profile/Brian-Hope-17"
                },
                {
                    "user_id": "Josh Rendell",
                    "user_href": "/profile/Josh-Rendell"
                },
                {
                    "user_id": "Dennis O'Brien",
                    "user_href": "/profile/Dennis-OBrien-60"
                },
                {
                    "user_id": "Lewis Hussey",
                    "user_href": "/profile/Lewis-Hussey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg McGiffney",
                "href": "/profile/Greg-McGiffney"
            },
            "answer_text": "It depends on how things go afterward. If it goes downhill, lots of “see, I told you so!” The GOP would double down. But if things miraculously turn around, most of the establishment GOP will bail out and cash out, as they won’t have a future. But conservatives and libertarians won’t go away - they will likely regroup into something else. The dirty little secret inside the Dems is that many (if not most) of their voters are cultural conservatives. Most Hispanics and Blacks do not support their cultural agenda. But the Dems have these groups convinced that “rich white guys” In the GOP are keeping them down. The reality is that “rich woke libs” prop up the Dems and just pander for minority votes on economic issues. In a “blind taste test” of positions, GOP positions would win in “minority” communities. Dems just have their base conditioned to vote “D” and not “R”, and white libs stay in power this way. The GOP would very likely do a lot more outreach at that point if they lost and start recruiting “minority” candidates who are not cultural fits inside the construct of the Dems. Hispanic business owners would be ready target as they would benefit most from a ““low tax, minimal regulations” policy. ",
            "date": "Answered July 26, 2020",
            "views": "187",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Wilson",
                    "user_href": "/profile/Jim-Wilson-586"
                },
                {
                    "user_id": "Lewis Hussey",
                    "user_href": "/profile/Lewis-Hussey"
                }
            ]
        }
    ]
}