{
    "title": "How were zweihander swords made? How much did they cost? Who could afford to buy them and actually use them? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Vernon Bender",
                "href": "/profile/Vernon-Bender"
            },
            "answer_text": "How were zweihander swords made? How much did they cost? Who could afford to buy them and actually use them? Zwiehanders were built like any other sword: lots of hammering on a steel bar until it's roughly swordlike. Then it's off to the grinding wheel to true up the shape, and finally the fittings are attached. These were big, expensive weapons, and represented the final form of the greatsword that may have first appeared as early as the 10th century. The only troops to use them in any volume were German mercenaries, known as Landskenechts, in the late 15th century. The zwiehander is so oversized, it's occasinaly lumped in with polearms. I have personally handled an example with a legnth in excess of 7 feet. The weapon continues to be in use today for ceremonial purposes; I've seen them carried by honor guards in period wedding ceremonies. ",
            "date": "Answered November 22, 2018",
            "views": "349",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yixin Li",
                    "user_href": "/profile/Yixin-Li-2"
                },
                {
                    "user_id": "Simeon Overbo",
                    "user_href": "/profile/Simeon-Overbo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gyles Hawkins",
                "href": "/profile/Gyles-Hawkins"
            },
            "answer_text": "Two-handed swords were more expensive than smaller swords but required no special techniques to make, so we’re just proportionately more expensive than a single-handed sword. They were typically used in conjunction with soldiers armed with pikes and halbards. Pike (very long spears) operated in tight formations, and two-handed swordsmen and halbadiers worked to either defend the formation or create openings in opposition formations their comrades could exploit - for example by knocking a few pikes aside with a two-hander, so a pike man or halbadier could kill or injure opponents allowing a breach in the opposing pike square that could be exploited to break the formation. So they were at one point pretty common - like you have a machine gunner for every 8–12 riflemen in a military unit today. A intermediate length sword called the long sword or bastard sword and that could be used one or two handed was a weapon used by soldiers acting in open battle or single combat rather than formations. It was far more versatile. ",
            "date": "Answered November 22, 2018",
            "views": "406",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lior Shmurak",
                    "user_href": "/profile/Lior-Shmurak"
                },
                {
                    "user_id": "John McEwan",
                    "user_href": "/profile/John-McEwan-13"
                },
                {
                    "user_id": "Simeon Overbo",
                    "user_href": "/profile/Simeon-Overbo"
                }
            ]
        }
    ]
}