{
    "title": "How did the loss of British soldiers in WW2 impact the working-class population (workforce) of the UK? - Quora",
    "tags": [
        "British Army",
        "World War II",
        "The United Kingdom",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Bier",
                "href": "/profile/Chris-Bier-5"
            },
            "answer_text": "Clearly there was an impact when troops volunteered or were called up to fight in WW2. Certain roles required the men to remain in their jobs or men were moved to necessary work such as mining, water works, etc. Women became more involved in essential production and non essential production slowed or ceased. Following the war where 384,000 service personnel were killed (not just soldiers as asked in the question), men returned to jobs they held as it was a legal obligation by the company or many of those that hadn’t worked before the War took up employment for the first time. Although there was a ‘man power’ shortage in the country, there was a shift in a lot less luxury goods being produced and more work to rebuild the country. But, there was a real threat that another War would start due to the spread of communism and so a lot of younger men were kept in the forces and conscription continued until 1960. Rationing continued until 1954 which indicates the country took a long time to recover. Large numbers of immigrants came to the U.K. from 1948 initially from Cyprus and the W.Indies and to a lesser extent India although following partition in 1947 immigration increased in the 50’s and 60’s. So the short answer to your question, the loss of life impacted post war production but the continued employment of women, the next generation of employable men, men returning from the War and immigration filled the void. A change in what was being produced, sold or built due to economic restraints created a move in certain sectors and the workforce shifted to a small extent. Also, to note, the U.K. was basically bankrupt as we used all our resources to fight the War and the US helped us financially. (We were still paying this back to the USA until 2006 although Germany and Japan prospered economically post War). Lastly, although the question was asked specifically about the impact to the working class work force population, the loss of middle and upper class men also impacted our workforce post war. ",
            "date": "Answered October 24, 2020",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Doyle",
                "href": "/profile/Michael-Doyle-296"
            },
            "answer_text": "There was three varieties of British soldier in WW2, the career officer, the career NCO and the grunt or to say the foot soldier. The foot soldier was the common man of the working class in the UK however, as much British industry was effected by the loss of such men one truley needs to understand the full impact that WW1 had on the British industry as both wars are linked together as there are Siamese twins. WW1, was devastating that as much as an entire generation was wiped out. It would take the years between the wars for the British population to recover and contribute toward industry. This was in fact the major concern for Chamberlin while in negotiating peace accords with Adolph Hitler, the hit on British industry! ",
            "date": "Answered October 24, 2020",
            "views": "129",
            "upvotes": " Answer requested by Mohammed Faheem"
        }
    ]
}