{
    "title": "How far has West Germany helped and is helping East Germany in its development after the unification of Germany? - Quora",
    "tags": [
        "Unification of Germany",
        "East German",
        "Reunification of Germany",
        "Unification",
        "West Germany",
        "German Democratic Republic (DDR)",
        "Historical Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guido Müller",
                "href": "/profile/Guido-Müller"
            },
            "answer_text": "Thanks for asking - this question is not easy to answer. And the question suggests that the GDR was a kind of “underdeveloped” country, like being on a different continent. That was not the case; given the same resources and a more competitive environment, at least a good part of the GDR industry would have been capable of delivering good products or to develop in that direction. One reason the industry has not been developed but mostly split or closed down was the predominant over-production of the Westen industry. There was simply no need for more or nearly the same products; the West was able to supply the East without much effort.  (source: Danke, dass ihr den Mut hattet!) 30 years ago, Germany was reunited, the wall had fallen some month before after a longstanding, peaceful protest. This protest movement has been one of the few in history, which was powerful enough to spark a revolution, without any violence, and to wipe away a socialist dictatorship. But as often, also in this case the old saying of Georg Büchner fulfilled itself: “The revolution eats it’s children” (said by Danton in the drama “Danton’s dead”). For the people in the West of Germany, the old “Bundesrepublik” (Federal republic), the reunification didn’t change much. Friends of mine went to Berlin to party, one of them scratched his own painting from a few years ago off the wall. The only change was the introduction of a “solidarity tax”, used for the restoration of the Eastern Gerrman cities. For the people in the East of Germany, the old “DDR” (German Democratic Republic), everything changed. Their political system - obviously inferior, gone. Their industries - technically inferior or in competition to the established industries in the West, closed over the next few years, the jobs gone. Their values, adapted to the needs of the GDR, like solidarity, equality - devalued, not of much use in the new liberal economy. There was and still is an enormous flow of financial aid from West to East, estimated 1600 billion Euro, following an article in the Tagesspiegel (Wie es um Deutschlands Einheit bestellt ist). Much of the money was used to rebuild and renovate the beautiful old cities of East Germany (Leipzig, Erfurt, Magdeburg, Dresden, Rostock etc.). Often by building companies from the West. Unfortunately, only a few companies like Jenoptik survived, most of the companies were closed, and unemployment rose among those, who stayed in the East. Millions migrated to West-Germany, mostly the younger ones, the flexible ones (women more then men), those with a good education. And the difference is still clearly visible in many parameters; the mentioned article stated, that according to a study of the Bundesbank the median of the net wealth per household is 23.400 € in the “new” parts of Germany, compared to 92,500€ in the old parts. ",
            "date": "Answered October 9, 2020",
            "views": "93",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Haruko Akiyoshi",
                    "user_href": "/profile/Haruko-Akiyoshi"
                },
                {
                    "user_id": "Raul Castro",
                    "user_href": "/profile/Raul-Castro"
                },
                {
                    "user_id": "Rukhsana Rasheed",
                    "user_href": "/profile/Rukhsana-Rasheed"
                },
                {
                    "user_id": "Suraj Srivatsa",
                    "user_href": "/profile/Suraj-Srivatsa"
                },
                {
                    "user_id": "Steven Snyder",
                    "user_href": "/profile/Steven-Snyder-1"
                }
            ]
        }
    ]
}