{
    "title": "How to resist girls - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Kates David",
                "href": "/profile/Kates-David"
            },
            "answer_text": "You do not give much away, but you imply an urgency to resist. This tends to suggest to me that your impulses are governing your actions, or at least to a point, and that you are an adult and they are children, or at least supposedly so - Eighteen year old girls, some of them, have had several full on relationships by this time, whereas, a guy twenty or thirty years her senior might still be a virgin. I leave you to figure out which one likely has the most experience. Circumstances, circumstances, circumstances, individuals, individuals, individuals, and once a girl is sixteen anything and everything sexual, taking it that it is normal, is entirely legal in the UK. In my opinion it should be treated as a criminal offence should she fall pregnant however, and any girl under the age of eighteen. The legal responsibility here being with the guy. Find flaw, and focus entirely on that flaw. Tell yourself over and over that you do not find the girl attractive, she is too fat, too thin, not sufficiently pretty, become a perfectionist, but more than this, see to it that no girl born a women is sufficiently attractive that you are sexually attracted to them. This should tend you in the direction of becoming effectively asexual, and that is the whole idea. Arrive here and they no longer exist as commodities, you might well love their company but are totally unable to take anything from them, including their bodies, your love has become entirely pure. You gain their respect, likely in considerable number, and you gain self respect too. There is nothing wrong with pure love, it is even highly exceptional for an environment such as this. The process taking you there is a very tough one but you are an incredibly special person in their eyes by the end of it, and a person that for every good reason that they trust. I trust this helps a tag? ",
            "date": "Answered May 2, 2019",
            "views": "735",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ROHIT-RAJ-747"
                },
                {
                    "user_id": "Shashi Kanth Dhulipala",
                    "user_href": "/profile/Shashi-Kanth-Dhulipala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marek Cieslik",
                "href": "/profile/Marek-Cieslik"
            },
            "answer_text": "Are you controlled by your impulses or do you control them? We all have feelings & inclinations yet if we only ever pursue gratifying them we are no better than animals - of the girls you might find attractive - think what they are made of - skin, hair, bones, flesh, blood, organs - separate all these things from each other - do you find them attractive by themselves? People all contain several kg of unexpelled urine, faeces, sweat, saliva - do you find all these things attractive? People age, get out of shape, lose their teeth, their sight & their hearing, go grey, go bald, go senile - do they still seem attractive then? If unwashed people stink - is that attractive? ",
            "date": "Answered June 24, 2017",
            "views": "870",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ROHIT-RAJ-747"
                },
                {
                    "user_id": "Shashi Kanth Dhulipala",
                    "user_href": "/profile/Shashi-Kanth-Dhulipala"
                },
                {
                    "user_id": "Douho Crédo",
                    "user_href": "/profile/Douho-Crédo"
                },
                {
                    "user_id": "Joaquin Cazares",
                    "user_href": "/profile/Joaquin-Cazares"
                }
            ]
        }
    ]
}