{
    "title": "How different would history have played out if in World War 2, atomic bombs were used on Germany? - Quora",
    "tags": [
        "World War II",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Mantle",
                "href": "/profile/Jonathan-Mantle"
            },
            "answer_text": "This has to be one of the most interesting questions that we could ask. Before we go any further I am going to talk about the dropped, not about the process that would lead to the bomb being dropped (Which is another question entirely).  Lets ask a couple of questions about this before we go any further, for clarification: 1)When would the bombs be dropped? Dependant upon when the bombs were dropped, it would have been the difference between the war being stopped immediately OR a punishment against a weakened nation. Let us explore three different time periods: Beginning – lets say the bomb was dropped in 1939 between May to September. The Nazi would void their bowels at the superior fire-power of what they were seeing. They would see the most devastating bomb that the world had developed. Before this period the world was most scared of airplane bombs. A nuclear weapons would have been scary to say the least and a quantum leap forward in offensive weapons. The Nazi would have spent every penny they had into developing the weapons and then developing the bomb themselves (Or stealing it from us). At which point the Nazi would have had no issue dropping one on the allies, once they had developed the bomb... What this would to do the world, is another matter. Mid war – For simplicity sake we will say 1943 – If the bomb had been dropped then, the Nazi's would have again voided their bowels, BUT they would have had rumblings about this before hand. As a result the Germans would have been prepared for this eventually. They would have had SOMEHING in place to make the effects of the bomb. During this time of the war, the Nazi were already feeling the brunt of The Russian Wrath. This bomb would have been a DEVISTATING effect upon German Moral after seeing their forces being attack. It would have shortened the war, but again the Germans may have been able to steal the intelligence needed to get this. End of the War – Germany was already on its knees in 1945 and in the final death throws of the war. There is NO WAY that this would have been looked at as a kick to a man what was already down. During this time, the Death camps were starting to be discovered too. With the dropping of the bomb at this time period, the world would have been as shocked at us as they were at the Nazi's. 2) Where the bomb was Dropped. Again this question need to know where the bomb was dropped, too. Lets think of three different locations and see what would happen: Berlin – If the bomb was dropped on here, the war would have been over. Simple and pure. The whole head of the Beat would have been cut off in one go. That being said, Hitler would have to be there at the time. If he wasn't there, then Hitler would have been mad. He would have IMMEDIATELY ordered the invasion of Britain and would have immediately order huge amount of resources into developed the weapons for themselves and star working towards a defence of it.  Stalingrad – this was the battle that change the direction of WW2. If this had dropped on this location, the Russian would have been out of their minds. It would have also made it a LOT easier for the Russians to be able to attack. The Russian would have had a MUCH easier time of taking the fight to the Germans. As a result they would have reached Berlin much quicker.  Normandy – If this had happened before D-Day, then DAY would have been a LOT easier. The fact is that the troops would have rolled up the beach and walked into France. That being said, the fall out on the troops and the sea would have been horrific. Not only that but the fall out would have blown back to Dover, too.  3) Who Dropped the Bomb – Dependant upon who dropped the bomb, the outcome would be different. Let's explain - Britain – If Britain dropped the bomb, they would have pushed huge amount of technology into the development of the bomb. The aircraft and power courses for the place would have tremendous. The amount of morale that would have been boosted by the dropping of the bomb would have radically increased the amount of people joining the war effort and would have kept the home fires burning longer.  Russia – They would have developed a HUGE amount arrogance over the top of what they already had. Stalin would have used it to bully the rest of the allies as he would have been happy to get control over America through the use of the bomb  France – If France had the bomb then they would have dropped it sooner into their country to rid the German menace. They would have made initial threat to start with, but the fact remains that they would have used it to get rid the Nazi's  Realistically, the dropping of the bomb in continental Europe, would have RADICALLY changed everything that we know about the war. ",
            "date": "Answered September 2, 2016",
            "views": "370",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Omar RodriguezMartinez",
                    "user_href": "/profile/Omar-RodriguezMartinez"
                },
                {
                    "user_id": "Joshua May",
                    "user_href": "/profile/Joshua-May-6"
                },
                {
                    "user_id": "Cosmin Tudor",
                    "user_href": "/profile/Cosmin-Tudor-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Burchstead",
                "href": "/profile/Paul-Burchstead"
            },
            "answer_text": "Not much. Towards the end of the war, we were firebombing German cities with about the same effect as an atomic bomb. During the war, atomic bomb production never got passed the prototype stage, and each was painstakingly assembled in a lab by a group of experts over a 4 day period. Then, due to the batteries, they had a shelf life of 3 days. At the end of the war, we had bomb parts, but no bombs. Worse still, all the experts packed up and went home and back to the universities. And since the B-29 was the only delivery system, it was woefully obsolete due to the introduction of jet fighters. This is why the A-Bomb had limited influence over the US policy in the years immediately following WW2. ",
            "date": "Answered August 27, 2016",
            "views": "178",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua May",
                    "user_href": "/profile/Joshua-May-6"
                },
                {
                    "user_id": "Mitchell Gonzales",
                    "user_href": "/profile/Mitchell-Gonzales"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Lee Ka Hoe",
                "href": "/profile/Nicholas-Lee-Ka-Hoe"
            },
            "answer_text": "That would be quite ironic because Albert Einstein was born in Germany. He worked on the Manhattan Project after he came to the U.S. Nothing much will happen really, if you mean that the U.S. dropped the nukes after Germany was almost defeated. However, if you are saying that the bombs were dropped before the end of the war, say, in the middle of it, there would only be one outcome. Total surrender. Unless Hitler could create the atomic bomb in a short timeframe. Come to think of it, it might be possible, the outcome is uncertain because the first atomic bomb tests were from the Germans. They just did not make full sized ones. Had they known the potential of the atomic bomb, they wouldn't have shunned the project and focus on developing fighter jets. ",
            "date": "Answered August 27, 2016",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "S. Patrick Maiorca",
                "href": "/profile/S-Patrick-Maiorca"
            },
            "answer_text": "There are only two reasons this would have happened- either the atomic bombs were developed some time before May 1945 or the war in Europe had lasted longer. If the first happened- basically history would be the same except the Dresdin would have been nuked and Germany and Japan would have surrendered earlier . the alternative the war in Europe would have lasted until August and more people would have died due to the months of fighting. ",
            "date": "Answered August 27, 2016",
            "views": "144",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Marty Grof",
                    "user_href": "/profile/Marty-Grof"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Smith",
                "href": "/profile/Rick-Smith-102"
            },
            "answer_text": "I’ve read that the original intention was that the first two atomic bombs were to be dropped on Berlin and Hamburg in early 1945. I wish I could remember where I saw this, but apparently a fair amount of U-235 was lost because of mishandling at the Oak Ridge facility, and this delayed the Manhattan Project by several months. By the time the first bombs were available, the Reich had already surrendered, so Hiroshima and Nagasaki were the first (and so far the only) cities to experience atomic bombing. ",
            "date": "Answered February 12, 2017",
            "views": "90",
            "upvotes": "0"
        }
    ]
}