{
    "title": "How effective was the Italian Air Force during WWII? - Quora",
    "tags": [
        "U.S. Air Force",
        "Air Forces",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alberto Rebellato",
                "href": "/profile/Alberto-Rebellato"
            },
            "answer_text": "In the ’30s the Italian Air Force was one of the most powerful air forces of the world, that fielded high quality planes that scored many world records (some of them are still unbeated) and was able to deploy in far theaters like Ethiopia and Spain.  At the beginning of WW2, the Italian Air Force was still operating the biplanes CR42, and even if Italy managed to develop new planes during the war, the weary economy never allowed to start a mass production. The first operations started on the French front: the Italian Air Force launched bombing missions on Corsica and Tunisia, while facing only some skirmishes with the French fighters. At the end of the offensive, the Italian Air Force had scored 10 French fighters destroyed and 11 bombing missions. Next came Operation Sea Lion. The Italian Air Force sended some planes to launch bombing missions with the Germans. The Italian Air Force had to deal with bad weather conditions, low fuel and the superior British planes. In the end, the Italian Air Force dropped 54 tonnes of bombs, while the fighters launched 883 missions, losing 9 planes.  Italian fighter G50 flying with German planes The Greek campaign saw the introduction of new the Italian fighter MC200, and clashed with the joint Greek and British Air Forces. On this theater, the Italian Air Force pulled its most successful operation during the battle of Ponte Perati, bombing the retreating Greek army and destroying hundreds of vehicles, leaving a trail of destruction that the Italian pilots nicknamed “the Highway of Death”. At the end of the campaign, the Italian Air Force lost 79 planes and 400 more were damaged, while claiming 218 destroyed or damaged Allied planes. In East Africa, things were not going better: the Italian colonies were completely isolated from Italy, and this was a big issue for an Air Force already short on supplies. The Italian Air Force enjoyed some initial victories, during the conquest of British Somaliland, destroying many Allied planes on the soil, but the lack of supplies hampered the Italian Air Force so much, that when the British counter-attacked, only 6 Italian fighters were still able to fly. During the campaign, 7 Italian pilots became aces. The situation was also difficult in North Africa, where the Italian Air Force struggled against the better supplied British RAF. The Italian Air Force became obsessed with the destruction of Malta: at the end of 1940, 7400 raids had been launched of the island, dropping 550 tonnes of bombs.  Italian propaganda in 1942: a bombing mission on Malta filmed not only by the Italian bombers point of view, but also the British thanks to a “rare document of enemy origin” as the speaker described it. And about the Italian raids on Malta, this is a quote from George Beurling, the most successful Canadian fighter pilot of the war: “The Jerrie are probably better over-all pilots than the Italians, but they certainly let the Eyeties do their fighting for them when the going got tough. When we get around to adding the final score for this show I hope somebody thinks of that\". The Italian naval bombers also launched many missions on the Allied convoys, sinking many ships. In Russia the Italian Air Force managed to operate successfully, destroying more Russian planes than their own, until the Axis force were overrun by the massive Soviet counter-attack. Between the February and September of 1942 the Italian Air Force destroyed 47 enemy planes, while suffering 10 losses. But the most incredible operation was made by a transport plane: the Italian Air Force tried to create a link with the Japanese forces by sending a lone plane across Mongolia and part of Soviet territory. The Italian planes was targeted by Soviet AA fire, and even had to deal with sandstorms above the Gobi desert, but it managed to land behind Japanese lines in China, and then came back. In 1943, Sicily was invaded. The Allied bombers targeted the Italian airports, destroying many planes on the ground. With such heavy losses, the Italian Air Force was unable to put a dent on the Allied armies, and was forced to abandon Sicily when Italy signed an armistice. After that, the Italian Air Force splitted in two factions: the National Republic Air Force that fough with the Italian Social Republic until 1945, and the co-belligerant Air Force that fought with the Allies. Between 1940 and 1943, the Italian Air Force destroyed 2520 enemy planes. The Italian Air Force lost 12.000 men during the war. Italy lacked the industrial power to mass produce modern planes, so it was forced to resont on outdated models. However, Italy developed good planes both during the ’30s and WW2. Some of them are: Campini Caproni CC2: the 2nd jet in the world S.M. 79: a naval bomber that scored 26 world records between 1937 and 1939. It sunk 196 transport ships during the war. G55 Centauro: the most advanced fighter deployed by Italy during the war. Some Luftwaffe officers regarded it as the “best Axis fighter of the war”. P108 A: the only Axis bomber with 4 engines. It could be equipped with remote controlled turrents mounted behind the engines, and a 120mm cannon. Only 24 planes were produced. ",
            "date": "Updated April 16, 2019",
            "views": "34",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Riccardo Sciolti",
                    "user_href": "/profile/Riccardo-Sciolti"
                },
                {
                    "user_id": "Peter Yazak",
                    "user_href": "/profile/Peter-Yazak"
                },
                {
                    "user_id": "Serge Zarantonello",
                    "user_href": "/profile/Serge-Zarantonello"
                },
                {
                    "user_id": "Random Purple Puppet",
                    "user_href": "/profile/Random-Purple-Puppet"
                },
                {
                    "user_id": "Li Jianxi 黎建熙",
                    "user_href": "/profile/Li-Jianxi-黎建熙"
                },
                {
                    "user_id": "Bob Delaney",
                    "user_href": "/profile/Bob-Delaney-13"
                },
                {
                    "user_id": "Fernando Corona",
                    "user_href": "/profile/Fernando-Corona-7"
                },
                {
                    "user_id": "Allan Southern",
                    "user_href": "/profile/Allan-Southern"
                },
                {
                    "user_id": "Joe Powell",
                    "user_href": "/profile/Joe-Powell-4"
                },
                {
                    "user_id": "Jack Holland",
                    "user_href": "/profile/Jack-Holland-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Round",
                "href": "/profile/Stephen-Round-2"
            },
            "answer_text": "Their hearts were never in the conflict with America or Britain who had been their Allies in The First World War so they lacked the killer instinct of The German …Allies they were in an impossible moral position? They had some extremely good aircraft in particular the outstanding Reggiani Falco 1 and 2 and the superb Macchi 202–5.. Their bombers were less effective probably because they were generally used in unescorted penny packets in daytime but they performed superbly when manned with peace time trained crews, while they survived. It is widely accepted that they were excellent aviators but most of the Regia Aeronautica felt that this terrible conflict was not in Italy’s best interests. What would we mean by the word - effective - the Italians were cursed with an unearned reputation for cowardice because of their sense of honour was compromised. They were expected to serve their Country regardless of their beliefs. Even if they were committed to do their best they all knew that their own military medical facilities were criminally insufficient..charnel houses. This was true even for their Officers and The Fascist … overprivileged! ",
            "date": "Answered September 30, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Riccardo Sciolti",
                    "user_href": "/profile/Riccardo-Sciolti"
                },
                {
                    "user_id": "Peter Yazak",
                    "user_href": "/profile/Peter-Yazak"
                },
                {
                    "user_id": "Joe Powell",
                    "user_href": "/profile/Joe-Powell-4"
                }
            ]
        }
    ]
}