{
    "title": "How many years was it between Moses and Jesus? How many years now since Jesus died? - Quora",
    "tags": [
        "Moses (biblical figure)",
        "Jesus",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian Sawyer",
                "href": "/profile/Ian-Sawyer"
            },
            "answer_text": "Original Question: How many years was it between Moses and Jesus? How many years now since Jesus died? The person on whom the biblical figure of Jesus was probably based - there is no evidence Jesus as portrayed in the Bible actually existed - was supposedly crucified around the year 30 CE. Moses is an entirely fictional character, the stories which included him being written during the 6th century BCE, but were set during the 13th century BCE. So all you can say is that the time between when the story containing the fictional Moses was set, and time when the person on whom the biblical figure of Jesus was based, supposedly died, is around 1,400 years. ",
            "date": "Answered June 12, 2019",
            "views": "94",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajeev Ratna",
                    "user_href": "/profile/Rajeev-Ratna-5"
                },
                {
                    "user_id": "Georgette Wolf",
                    "user_href": "/profile/Georgette-Wolf"
                },
                {
                    "user_id": "Tom Monk",
                    "user_href": "/profile/Tom-Monk-2"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seventh-day Adventist Church",
                "href": "/profile/Seventh-day-Adventist-Church-1"
            },
            "answer_text": "The Exodus (AM 2666) occurs exactly two-thirds of the way through the 4,000 years, marking it as the pivotal event of the chronology. It is also two-thirds of the way through the 40 notional \"generations\" of 100 years each, with Aaron, the first High Priest of Israel, representing the 26th generation from Adam. History places Jesus’ death anywhere between 30A.D and 32 A.D, making it around1990 years now since His Crucifixion. ",
            "date": "Answered February 22, 2020",
            "views": "4",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Martin",
                    "user_href": "/profile/Laura-Martin-151"
                },
                {
                    "user_id": "Seeme Haider",
                    "user_href": "/profile/Seeme-Haider"
                },
                {
                    "user_id": "Georgiana Darcy",
                    "user_href": "/profile/Georgiana-Darcy-2"
                }
            ]
        }
    ]
}