{
    "title": "How was slavery institutionalized? - Quora",
    "tags": [
        "Institutionalized",
        "Institutionalization"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Dewar Gleissner",
                "href": "/profile/John-Dewar-Gleissner"
            },
            "answer_text": " Transatlantic slavery was institutionalized by European slave traders obtaining slaves from the slave markets in Africa, transporting them to the New World, and then carrying goods from the New World back to their European ports. This was the triangular trading pattern. It was big business. Within the destination New World countries, slaves were sold at regular markets. Laws were passed to regulate and protect slavery. Legal authorities enforced the slave-owners’ rights in slaves and to some extent their treatment of slaves. In the USA, Northern industries manufactured goods and issued insurance policies to support the plantation regime.  ",
            "date": "Updated July 17, 2017",
            "views": "11",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhanesh War",
                    "user_href": "/profile/Dhanesh-War"
                },
                {
                    "user_id": "Robert Ryan",
                    "user_href": "/profile/Robert-Ryan-35"
                },
                {
                    "user_id": "Trey Carrazána",
                    "user_href": "/profile/Trey-Carrazána"
                },
                {
                    "user_id": "Jan Kowalsky",
                    "user_href": "/profile/Jan-Kowalsky-6"
                },
                {
                    "user_id": "Nathan Garcia",
                    "user_href": "/profile/Nathan-Garcia-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Whitney Hope",
                "href": "/profile/Whitney-Hope-2"
            },
            "answer_text": "Well, even if you were a free man, you could be kidnapped back into slavery (ala Solomon Northrup, true story) which was perfectly legal. Jim Crow laws, separate but equal is another example. Those laws pretty much-kept blacks separate on the notion of blacks not really being people or less so than whites. House market discrimination, failing and 2nd rate schooling, police brutality we still see today, the penal system, all examples of legal and socially justifiable ways of keeping blacks (and browns) “in their place” - THAT is instutionalized bigotry all stemming from slavery. Now, I’m no expert so this is just a list of things to think of to help show you the way. ",
            "date": "Answered October 23, 2018",
            "views": "397",
            "upvotes": "0"
        }
    ]
}