{
    "title": "How were medieval swords sharpened? - Quora",
    "tags": [
        "Sharpening",
        "Swords",
        "Middle Ages (era)",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muhammad Zohaib",
                "href": "/profile/Muhammad-Zohaib-302"
            },
            "answer_text": "Swords can be shaped by a variety of metalworking techniques. In some times and places, one technique has been used exclusively, in others a combination of techniques has been used. The primary techniques are forging and stock removal. Forging uses heat to bring the material to a malleable state. The material is then hammered to shape, typically using hammer and anvil together with specialized set and fuller tools depending on the particular technique. There is a variety of forging techniques for sword making and many variations upon those.  Stock removal shapes the sword from prepared stock that is larger in all dimensions than the finished sword by filing, grinding, and cutting. While the technique has been available for centuries it was not widely used for making swords until the 19th or 20th century as it is wasteful of the raw material. Where iron and steel are plentiful this method is frequently used as it requires less time. In places and times where iron and steel have been more rare and valuable stock removal has not been used except as part of the finishing process. In most techniques, the basic materials, generally iron and/or steel, are shaped into a bar or billet first. At this stage, if several metals are to be used they will be combined by welding to form the billet. In some techniques, notably the traditional folded steel blades of China, Korea, and Japan, the billet might be drawn, folded, and welded back on itself creating layers of steel of different types. In other longer bars or rods of steel and iron might be welded together, edge to edge, to create the basic billet placing the softer iron inside with the steel at the core and edges. Once the billet is created it is drawn out farther, generally tapering to the edge(s) and point. The technique of fullering might be used to create a ridge or ridges down the length of the blade. Whether single or multiple, the ridge's primary purpose to give the blade greater structural strength relative to its mass.  During fabrication, the metal might be annealed to relieve stresses built up from forging and differential heating and to make the metal easier to file, engrave or polish. ",
            "date": "Answered July 27, 2020",
            "views": "342",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Lidstone",
                "href": "/profile/Bob-Lidstone"
            },
            "answer_text": "“How were medieval swords sharpened?”, is the question. If you mean from a technical point of view, then not much differently than blades are sharpened today. Have you ever seen someone sharpen an axe or a scythe or a knife on a wheel? If so, you’ve seen pretty much how it was done 7 centuries or so ago. The materials haven’t changed all that much and neither have the laws of physics. If you are asking about the circumstances, then, again, not much differently than today. Every army has, somewhere within it, the wherewithal to repair and maintain its weapons and equipment. In medieval times, that description would have included the ability to actually make weapons from scratch, if necessary. Even today, that capability is still to be found starting at unit level, at least in my army, in the form of a maintenance platoon or company. So someone with the necessary skills and equipment to sharpen blades (amongst many other things) would have been part of any organization from the household of sword-bearing men up to an army, of course. The skill would also have been fairly wide-spread just in every day society. The fabled “tinkers” of Ireland were really just knife-sharpeners and metal-workers who wandered about and sold their skills. ",
            "date": "Answered April 23, 2020",
            "views": "292",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Kieswetter",
                    "user_href": "/profile/Chris-Kieswetter-1"
                }
            ]
        }
    ]
}