{
    "title": "How is chinese history? - Quora",
    "tags": [
        "History of China",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terry Fung",
                "href": "/profile/Terry-Fung-6"
            },
            "answer_text": "Chinese history can be extremely complicated in certain way in the same time it is very simple. It has more than 2000 years of written history with one major historical document after the end of each dynasty talking about the previous dynasty. Chinese History is just basicly the generation and decay of multiple dynasty. But in specific, it is extremely long and each dynasty decay in a similar way- corruption. But each time decay in a slightly different way. In general, you may say Chinese History is quite democracy and liberal in some way that when the peasant unlike the emperor due to corruption or high tax. Peasants would tend to rebel and form a new government. (all dynasty have it tendency) Now as the old dynasty was taken off, new one came and most likely will go like a mountain and eventually(which is a couple months to 100 years) decay. (the kingdom that formed between the east and west Han dynasty and dang dynasty) As it decay taxes are being raised and governor are too corrupt, usually a natural disaster will trigger the rebellion. The rebellion might success or not depending how unsuccessful the dynasty was. Rebellion is only the finally option. Sometime if a emperor gets the power and reform, the dynasty then will last at least one century. (west Han dynasty) But since Chinese history is too long there are exceptions and weird cases. But it is basically generation and decay. ",
            "date": "Answered June 1, 2016",
            "views": "413",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zam Mu",
                    "user_href": "/profile/Zam-Mu"
                },
                {
                    "user_id": "Amit Jadhav",
                    "user_href": "/profile/अमित-जाधव-Amit-Jadhav"
                },
                {
                    "user_id": "WLizzieW",
                    "user_href": "/profile/WLizzieW"
                },
                {
                    "user_id": "DEEMO",
                    "user_href": "/profile/DEEMO-4"
                },
                {
                    "user_id": "Jarhead Jiang",
                    "user_href": "/profile/Jarhead-Jiang"
                },
                {
                    "user_id": "Shouxin",
                    "user_href": "/profile/Shouxin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ping Zhang",
                "href": "/profile/Ping-Zhang-40"
            },
            "answer_text": "Similar to other countries Chinese history is full of war, natural disaster, famine and death. many powerful dynasties rise and fall in this beautiful and fertile land one after another and left a lot of untold stories… special things：It is one of the longest history in the world, even recorded from 841 BC and have never interrupted. it is the focus of East Asian histories, which the ancient histories of many countries can only be found from. if you wanna learn the histories of West European, you might need to learn about Greece, Rome, France, Britain, Germany, etc. if you wanna learn the histories of East Asian, you just need to learn about several countries and Chinese history is the first . ",
            "date": "Answered June 4, 2016",
            "views": "137",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sanskriti Karanth",
                    "user_href": "/profile/Sanskriti-Karanth"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishnu Murali",
                "href": "/profile/Vishnu-Murali-27"
            },
            "answer_text": "Just like any other history. It depends on what you like. If you like to learn about inventions, dynasties, and rise of communism, great stuff to learn. ",
            "date": "Answered May 31, 2016",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ai XiaoMeng",
                "href": "/profile/Ai-XiaoMeng"
            },
            "answer_text": "I’ll show you the Chinese history in a simple way: we conquered the barbarians，new barbarians came，we fight with each other,we were conquered by the barbarians,the barbarians became us,than new barbarians came,we fight with each other…… ",
            "date": "Answered June 6, 2016",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Hennigan",
                "href": "/profile/William-Hennigan"
            },
            "answer_text": "As mentioned earlier - long. Complex, but it underlies the Chinese culture, so it is worth understanding at least the key points. ",
            "date": "Answered May 31, 2016",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Xianglu Zhao",
                "href": "/profile/Xianglu-Zhao"
            },
            "answer_text": "The history of China is very very long, which include many dynastic changes. Most Chinese dynasty is longer than the history of American, with an enlightened first emperor and a corrupt endings. ",
            "date": "Answered June 1, 2016",
            "views": "152",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yangd",
                "href": "/profile/Yangd"
            },
            "answer_text": "China on the ground a brick, have 2000 years of history！ ",
            "date": "Answered June 1, 2016",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Basil Fondu",
                "href": "/profile/Basil-Fondu"
            },
            "answer_text": "It’s well, thank you. ",
            "date": "Answered June 3, 2016",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leonell Valderama",
                "href": "/profile/Leonell-Valderama"
            },
            "answer_text": "Dynasty > Rebellion > Dynasty > Rebellion > Dynasty > Rebellion > Dynasty > Rebellion ",
            "date": "Answered June 1, 2016",
            "views": "25",
            "upvotes": "0"
        }
    ]
}