{
    "title": "How were goods for trade transported in ancient times? - Quora",
    "tags": [
        "Ancient Civilizations",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Almendra",
                "href": "/profile/Jason-Almendra"
            },
            "answer_text": "By ship was and is the cheapest mode of transportation. The Phoenicians used open wooden ships made from the cedars of Lebanon. These were propelled by square sails and 2 steering oars and were the first people to establish shipping routes and colonies throughout the Mediterranean. The colonies were repair and replenishing depots. They even went beyond Gibraltar and shipped tin from Cornwall and Wales. They were followed by the Greeks and Romans. The Romans had developed massive sailing ships with covered decks to keep out water. On land it's a bit more expensive because you have to buy food. So cargo was carried on pack donkeys and oxen, castrated bulls. Then Sumeria invented the wheel so they had 2 wheeled carts and 4 wheeled wagons. Another innovation was the spoked wheel which made it lighter. Then the Hyksos invaded Egypt and introduced horses. So they must have brought it to the Mediterranean. They figured they could combine the speed of a horse with the strength of a donkey. So mules became much favored. Finally the Arabs brought camels. ",
            "date": "Answered October 5, 2018",
            "views": "641",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Deakin",
                "href": "/profile/Nick-Deakin-4"
            },
            "answer_text": "Maritime trade started around modern-day Sardina, around 4000BCE, spreading East through a network of islands, becoming the Minoan trading thalassocracy 3000–1626BCE. Greeks invaded and took control of Crete around 1400BCE, some navigational technology transferred to Troy, but seems mostly preserved by the Phoenicians. Forget carts, you could carry around 1 ton which came about in the Steps around 2000BCE, but by very rough track subject to weather which made tracks impassible and tolls at every city-states border, it is a terrible way to move things about. International trade between three continents was brisk before bronze age collapse (1200BCE - Troy). ",
            "date": "Answered October 6, 2018",
            "views": "450",
            "upvotes": "0"
        }
    ]
}