{
    "title": "How does baroque music influence the current music? - Quora",
    "tags": [
        "Baroque Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kajsa Makarainen",
                "href": "/profile/Kajsa-Makarainen"
            },
            "answer_text": "First of all the system of functional harmony was fully developed during the Baroque. Before 1600 composers were still writing polyphonic music in the church modes (Dorian, Phrygian etc.). After 1600 monophonic music and the major-minor tonal system became more dominant. Rameau wrote his Treatise on Harmony in 1722. The chords of a pop song today are still indebted to the harmonic developments of that era. Classical composers of the twentieth century were often influenced by Bach. Heitor Villa-Lobos combined Brazilian folk music with Baroque in his Bachianas Brasileiras. Dmitri Shostakovich wrote fugues in a neoclassical style. Sometimes songwriters can choose to use instruments or progressions that were typical of the Baroque. In the late 1960s there was a genre Baroque pop. George Harrison’s piano solo in In My Life (1965) was played at double speed to sound a bit like a harpsichord. An actual harpsichord was used in Donovan’s Sunshine Superman (1966) and Van Morrison’s Cyprus Avenue (1968). The introduction to Procol Harum’s A Whiter Shade of Pale, played on a Hammond organ, is reminiscent of Bach’s Air on the G -String. A more recent example is the album Foreverland (2016) by The Divine Comedy. The song Catherine the Great evokes the 18th century with harpsichord and brass instruments. So the influence of Baroque on today’s music is bigger than you might expect.  ",
            "date": "Answered December 18, 2017",
            "views": "5",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                },
                {
                    "user_id": "Skyla Brooks",
                    "user_href": "/profile/Skyla-Brooks-2"
                },
                {
                    "user_id": "Zeibura S. Kathau",
                    "user_href": "/profile/Zeibura-S-Kathau"
                },
                {
                    "user_id": "Curtis Lindsay",
                    "user_href": "/profile/Curtis-Lindsay-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zeibura S. Kathau",
                "href": "/profile/Zeibura-S-Kathau"
            },
            "answer_text": "I’m not a musicologist so I’m not going to embarrass myself by trying to give you a technical answer, but I hear baroque music in modern popular music a lot. Firstly roughly one in ten pop songs is just Pachelbel’s Canon in D. Including the Village People – Go West, and the Pet Shop Boys cover of it and the football chant adaptations of that prevalent throughout English football stadiums (“one nil to the ing-er-land”)… when people turn your music into football chants, the influence can’t go much further. I’ll hand the floor to Rob Paravonian here:  I also can’t listen to this or the Stevie Wonder song it sampled without hearing Bach’s prelude in C minor from WTC book 1:  And of course there are parts of the legacy which are less cryptic. Henry Purcell’s march for the funeral of Queen Mary II was revived in the Clockwork Orange soundtrack by Wendy Carlos, which deadmau5 paid tribute to with this:  I’m sure there are countless more examples, but those are the ones that always come to mind first. ",
            "date": "Answered September 6, 2018",
            "views": "18",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Philip Newton",
                    "user_href": "/profile/Philip-Newton"
                },
                {
                    "user_id": "Shakilur Rahman",
                    "user_href": "/profile/Shakilur-Rahman-29"
                },
                {
                    "user_id": "Kajsa Makarainen",
                    "user_href": "/profile/Kajsa-Makarainen"
                },
                {
                    "user_id": "Michael Masiello",
                    "user_href": "/profile/Michael-Masiello-1"
                },
                {
                    "user_id": "Lance LaSalle",
                    "user_href": "/profile/Lance-LaSalle"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Ehle",
                "href": "/profile/Robert-Ehle"
            },
            "answer_text": "Around 1900 Modernism introduced a new world of scales, chords and sound effects, leading to such revolutionary works as Stravinsky’s Petrushka and The Rite of Spring. After Stravinsky had exhausted the possibilities of using these new compositional resources, he turned to a style now called Neoclassicism in which he rewrote Baroque musical styles with modern dissonances. This approach became popular first in France and then all over the Western world. Stravinsky did not invent musical Neoclassicism. It had been used occasionally by Debussy, Erik Satie, even Richard Strauss, but Stravinsky pursued it more intensely than they did. It seems that he needed it badly. He was a world-famous professional composer who could sell everything that he wrote. As a result, he needed a technique that allowed him to compose a lot of music fast. Rewriting the Brandenburg Concertos and Vivaldi Concertos gave him this. Stravinsky was not earning any royalties from his early masterpieces because the Russian Revolution cut them off from Western copyrights. A point to make here is that a piece such as The Rite of Spring took much longer to compose than a Neo-Baroque work. So Stravinsky composed the Concerto in d, Concerto for Piano and Winds, Dumbarton Oaks Concerto, Violin Concerto, Concerto for Two Solo Pianos, and other similar works, many of which he played himself. He also traveled all over, conducting his new works. Baroque music was his primary influence but also was Haydn, Pergolesi, and Boccherini. Entertainment music suited him well. Most of these works featured bitonality and polytonality which he had pioneered. Stravinsky’s influence and model continues to influence composers today. If you want to compose a concerto today, copying Stravinsky’s approach is attractive and almost unavoidable. ",
            "date": "Answered August 13, 2020",
            "views": "663",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Andrews",
                "href": "/profile/Mark-Andrews-56"
            },
            "answer_text": "Music from the past, be it Baroque, classical or Romantic periods continues to influence some composers in a number of ways. Film and tv composers who are trying to create a “period” feel may write pastiche type music broadly in the style of the age they are trying to evoke. There are composers today who are quite shamelessly writing in a Neo- Romantic idiom because it makes big bucks and is very easy to ape, be it said. However, your question primarily refers to the Baroque era and this is a broad period spanning approximately from 1600 (birth of opera) to 1759 (Death of Handel). Some composers have reverted to the various tuning methods (or “temperaments”) in use at the time as a potential composition resource. Others have utilised pared down baroque type orchestral forces and the contrapuntal skill seen at its apex in the works of J.S. Bach is regularly taught in University degree courses, a training which continues to bear fruit in composers’ own work. ",
            "date": "Answered December 16, 2017",
            "views": "23",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kajsa Makarainen",
                    "user_href": "/profile/Kajsa-Makarainen"
                },
                {
                    "user_id": "Victor Eijkhout",
                    "user_href": "/profile/Victor-Eijkhout"
                },
                {
                    "user_id": "Lee Mwangi",
                    "user_href": "/profile/リー-ムアンギ-Lee-Mwangi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Lazarow",
                "href": "/profile/Malcolm-Lazarow"
            },
            "answer_text": "I think the other answers cover some good points. There are two things that I want to add: Music from every period of history has directly impacted the subsequent period. Therefore, it might be true that music made today is not directly influenced by the Baroque period, but the music of today would not be what it is if the Baroque period were different or did not happen. In my opinion, that is the most important way that Baroque music influences the music of today.One of the trends of Baroque music was to describe affect and scenery. Take, for example, Vivaldi’s attempt to sonify the seasons in his Four Seasons. This was not really present Renaissance music (or any other precious period of music); however, we see this sort of thing all the time in modern music, so you can easily attribute that to the Baroque period.",
            "date": "Answered December 19, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anna Foo",
                    "user_href": "/profile/Anna-Foo-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bei Xiao",
                "href": "/profile/Bei-Xiao-1"
            },
            "answer_text": "I would say the most important influence is common practice tonality, which is the structure for the subsequent classical, romantic,impressionist period and still dominate the current popular music. ",
            "date": "Answered September 30, 2018",
            "views": "244",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sal Credo",
                    "user_href": "/profile/Sal-Credo"
                },
                {
                    "user_id": "Zeibura S. Kathau",
                    "user_href": "/profile/Zeibura-S-Kathau"
                }
            ]
        },
        {
            "author_info": {
                "name": "Klaus Miehling",
                "href": "/profile/Klaus-Miehling"
            },
            "answer_text": "It depends what you mean with “modern” music. In and since the 20th century there were: Orchestrations (Bach’s “Kunst der Fuge” by Schönberg)Adaptations (Bach’s Prelude in e minor for Solo violin, adapted for orchestra by Stokowski / the Chaconne in d minor, adapted for piano by Busoni / Harpsichord pieces by Couperin, adapted for Orchestra by Respighi, or his “Antiche danze ed arie”)Alienations (Strawinsky: Pulcinella, after Pergolesi)Popularizations (Jazz- and Pop-Versions of Bach)Newly composed Pop-Baroque (the group “Rondo Veneziano”)New compositions in baroque style (“Neobaroque”) by many composers, some of them organized in the group “vox saeculorum”",
            "date": "Answered September 6, 2018",
            "views": "715",
            "upvotes": "0"
        }
    ]
}