{
    "title": "How intelligent was Elvis Presley? - Quora",
    "tags": [
        "Elvis Presley (musician, actor)",
        "Intelligence Quotient"
    ],
    "response": [
        {
            "author_info": {
                "name": "Azza Paterson",
                "href": "/profile/Azza-Paterson"
            },
            "answer_text": " ELVIS 1977. There are many good answers to this question, my view is that history tells us Elvis went to High School, had no college education but his intelligence was more inwards than outwardly evident.  To watch Elvis give interviews, he didn't come across as overly intelligent sometimes stumbling in his answers, he possessed a nervous stutter when talking even in his latter years in Vegas, but his charisma got him across the line and the ladies saw absolutely no hint or fault in his mannerisms.  Inwardly, it is known that Elvis was quite spiritual, his love of factual books, religions, why are we here, how did God make us, what is our/my purpose in life shows that Elvis was keenly aware of life's continual search to better one's standing and have inner peace.  He hung out with men, some of the Memphis Mafia who seem dim-witted in my view and who were sceptical of his hairdresser guru who introduced him to other interesting facets of life, happiness, soul-searching which Elvis obviously gravitated towards leaving them on the outer. Col. Tom Parker had his spies always watching what Elvis was doing, who he was talking to and reported back to Parker who didn't want outside influences pushing Elvis into other directions that would hinder his and his manager's contractual obligations.  Elvis was no man's idiot, he searched, he thought about many diverse things, he tried to work out what direction he should go in. His devotion to his parents Vernon and Gladys and religion are well documented. Celebrities quite often noted how extremely polite, friendly and courteous he was when they met him. This stems from his mother's early life lessons. The poverty Elvis grew up stayed in his mind and was mentioned as one of his biggest fears, to lose everything, with that in mind wherever possible Elvis looked after friends, family and total strangers financially, something another former poor superstar did, Bob Marley who cared less about his nett worth and more about making other people's lives better in small ways. Elvis was intelligent, let's say smart enough to leave the financial planning to his manager Tom Parker who took advsntage of his fortunes. On the homefront, Elvis left the home finances to his resident livein dad, Vernon Elvis Presley who was by no means an accountant whizz! Frugality wasn't one of Elvis's concerns, make money, keep people happy and taking care of business (his style) was good enough for him. Elvis I can only guess tried to live up to a standard that he thought his mother would be proud of, and it is this personal commitment to better himself and provide for his family, friends and industry associates who were in daily contact with him.  Elvis was a smart guy, the only dumb thing about him was his way of counteracting his drug addictions by using drugs that could have less side affects when used together, these decisions and the neglect in my view of his doctor Nicopoulas's medical advice put him in the grave much earlier then should have. The world misses out on many more years of entertainment, music and celebrity that was Elvis Presley ",
            "date": "Updated May 15, 2018",
            "views": "177",
            "upvotes": " View 45 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vivek Anuragi",
                    "user_href": "/profile/Vivek-Anuragi"
                },
                {
                    "user_id": "Andy Ivanisevic",
                    "user_href": "/profile/Andy-Ivanisevic"
                },
                {
                    "user_id": "Tom Brock",
                    "user_href": "/profile/Tom-Brock-41"
                },
                {
                    "user_id": "Seth Brubaker",
                    "user_href": "/profile/Seth-Brubaker-1"
                },
                {
                    "user_id": "John Olson",
                    "user_href": "/profile/John-Olson-297"
                },
                {
                    "user_id": "Mary Meek",
                    "user_href": "/profile/Mary-Meek-14"
                },
                {
                    "user_id": "Xkingston",
                    "user_href": "/profile/Xkingston"
                },
                {
                    "user_id": "Ted Lienert",
                    "user_href": "/profile/Ted-Lienert"
                },
                {
                    "user_id": "Melissa Mcbride",
                    "user_href": "/profile/Melissa-Mcbride-49"
                },
                {
                    "user_id": "Yu Serizawa",
                    "user_href": "/profile/Yu-Serizawa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hninzi Lwin",
                "href": "/profile/Hninzi-Lwin-1"
            },
            "answer_text": "I don’t understand why he stayed with Tom Parker. That is retarded level. Many many successful pop stars had to sue their managers who always try to rip them off. Elvis’ case was major. Not only did Parker rip him off he made a sweet deal with RCA that benefited him more than Elvis. Because Parker was a Dutch illegal alien he didn’t have a passport, so Elvis never had a concert outside North America or the US. This was at a time when Great Britain and Europe were just dying to see him. Elvis wanted to be in better grade movies but Parker didn’t care and didn’t try. Another dumb decision. Elvis left his father as executor of his will. Parker promptly renegotiated his contract so he was getting 75 % and Elvis’ estate only 22%. Fortunately Vernon died in 2 years and Priscilla took care of that and got Parker OUT of any more dividends. Elvis was not smart at all and didn’t even try. I think he wanted to be smart but didn’t know how because he was cloistered by people of similar intellect and experience. His Memphis mafia. That restricted his growth. When he joined the army his IQ was in the average range. So this is a highly talented man who didn’t know how to make the best use he can from his talent. ",
            "date": "Updated May 25, 2020",
            "views": "49",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rita Corrêa da Silva",
                    "user_href": "/profile/Rita-Corrêa-da-Silva"
                },
                {
                    "user_id": "Michael Perks",
                    "user_href": "/profile/Michael-Perks-9"
                },
                {
                    "user_id": "John Leo",
                    "user_href": "/profile/John-Leo-77"
                },
                {
                    "user_id": "Sarah Katherine Renzetti",
                    "user_href": "/profile/Sarah-Katherine-Renzetti"
                },
                {
                    "user_id": "Darren Sharrocks",
                    "user_href": "/profile/Darren-Sharrocks"
                },
                {
                    "user_id": "Ellen Barr-Smith",
                    "user_href": "/profile/Ellen-Barr-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Mackenzie",
                "href": "/profile/Ian-Mackenzie-47"
            },
            "answer_text": "In school, Elvis did not do exceptionally well but this was not reflective of his innate intelligence. He was born with a high intellectual capacity reflected in how he learned songs. He could take a piece of sheet music put it aside and actually see the lyrics in his mind. This was indicative of a photographic memory. The statistic for a photographic memory is approximately one in a million. In later years he read widely and expanded his range of knowledge far beyond his initial upbringing. He never stopped learning. Elvis was special in more ways than his singing talent. ",
            "date": "Updated February 25, 2020",
            "views": "24",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yu Serizawa",
                    "user_href": "/profile/Yu-Serizawa"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Michael Perks",
                    "user_href": "/profile/Michael-Perks-9"
                },
                {
                    "user_id": "JoEllen Vinton",
                    "user_href": "/profile/JoEllen-Vinton"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/How-Gro"
                },
                {
                    "user_id": "Jagua Nana",
                    "user_href": "/profile/Jagua-Nana"
                },
                {
                    "user_id": "Sara Ali",
                    "user_href": "/profile/Sara-Ali-486"
                },
                {
                    "user_id": "Andrea Watts",
                    "user_href": "/profile/Andrea-Watts-23"
                },
                {
                    "user_id": "Connie Mccormick",
                    "user_href": "/profile/Connie-Mccormick-8"
                },
                {
                    "user_id": "Susan Davis",
                    "user_href": "/profile/Susan-Davis-209"
                },
                {
                    "user_id": "Julia Kelley",
                    "user_href": "/profile/Julia-Kelley-28"
                },
                {
                    "user_id": "Patricia Hanson",
                    "user_href": "/profile/Patricia-Hanson"
                },
                {
                    "user_id": "Teresa Dobbs",
                    "user_href": "/profile/Teresa-Dobbs-8"
                },
                {
                    "user_id": "Sabrina Michelle",
                    "user_href": "/profile/Sabrina-Michelle-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Lubowitz",
                "href": "/profile/Bob-Lubowitz"
            },
            "answer_text": "Elvis had an encyclopedic knowledge of music, from Blues, Gospel, Rock n’ Roll, and Rhythm and Blues to Broadway (“It’s Easy For You”) and Opera (“It’s Now Or Never” and “Surrender”). He was very well-read, mainly enjoying spiritual, numerology, and Eastern Religious texts. He also memorized the PDR (Physician’s Desk Reference). Though he was only an average student, he had an ability to read people and was very much in tune with the feelings of others. Leiber and Stoller referred to Elvis as a “savant” based upon his breadth of music history. ",
            "date": "Answered August 22, 2019",
            "views": "17",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Zlatu-M"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "JoEllen Vinton",
                    "user_href": "/profile/JoEllen-Vinton"
                },
                {
                    "user_id": "Sarah Katherine Renzetti",
                    "user_href": "/profile/Sarah-Katherine-Renzetti"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/How-Gro"
                },
                {
                    "user_id": "Yu Serizawa",
                    "user_href": "/profile/Yu-Serizawa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Albert",
                "href": "/profile/Frank-Albert-1"
            },
            "answer_text": "Exceptionally so. An autodidact, he read for hours each day, alone and aloud as his fiancé Ginger Alden recounts in her memoir. He was particularly interested in spiritual texts, often very difficult ones more suited to scholarship than nighttime reading. Even his own Lex Luther, Albert Goldman, grudgingly attests to the complexity of the work he studied, to its range and to Presley’s assiduous dedication. More informally, his intelligence shines in his wit, through his impatience with the shmaltz and tackiness of “fuckn Vegas!” and in his dirt-poor teenager’s dedicated ambition to conquer his art, and life. ",
            "date": "Updated July 29, 2019",
            "views": "26",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alan",
                    "user_href": "/profile/Alan-1106"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Sarah Katherine Renzetti",
                    "user_href": "/profile/Sarah-Katherine-Renzetti"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/How-Gro"
                },
                {
                    "user_id": "Andrea Watts",
                    "user_href": "/profile/Andrea-Watts-23"
                },
                {
                    "user_id": "Yu Serizawa",
                    "user_href": "/profile/Yu-Serizawa"
                },
                {
                    "user_id": "Patricia Hanson",
                    "user_href": "/profile/Patricia-Hanson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alice Graeber",
                "href": "/profile/Alice-Graeber"
            },
            "answer_text": "Your answer went on forever yet you never answered the question. The question was how intelligent was Elvis Presley and you danced and dodged all the way around that question and talked everything but how intelligent he was. The question wasn't about his dad or about Colonel , the question was about Elvis Presley, how intelligent is he. Can you answer just that question? ",
            "date": "Answered January 29, 2019",
            "views": "17",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Mangham",
                    "user_href": "/profile/Kevin-Mangham-2"
                },
                {
                    "user_id": "Yu Serizawa",
                    "user_href": "/profile/Yu-Serizawa"
                },
                {
                    "user_id": "Michael Perks",
                    "user_href": "/profile/Michael-Perks-9"
                },
                {
                    "user_id": "JoEllen Vinton",
                    "user_href": "/profile/JoEllen-Vinton"
                },
                {
                    "user_id": "Patricia Hanson",
                    "user_href": "/profile/Patricia-Hanson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinny Presley",
                "href": "/profile/Vinny-Presley"
            },
            "answer_text": "Elvis was very smart. How do you think someone would go from driving a truck in 1954, to become a Rockstar in 1956 and a Hollywood superstar in 1957? On top of it he did a fantastic job in the army and became a top army official in 1959. How many people in the world do you know that had such a progress in just under 5 years? ",
            "date": "Answered September 18, 2020",
            "views": "207",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Neal Bracken",
                "href": "/profile/Neal-Bracken"
            },
            "answer_text": "Although Elvis was an average student in high school he had a lot of native intelligence when it came to his music and his acting. For example, he could memorize not only his role in scripts but those of the other actors/actresses. He had no difficulty memorizing lyrics to his songs until the end of his life. ",
            "date": "Answered February 23, 2020",
            "views": "766",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yu Serizawa",
                    "user_href": "/profile/Yu-Serizawa"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Stull",
                "href": "/profile/Terry-Stull"
            },
            "answer_text": "I knew two people who knew him very well. According to them both, he was very sharp, very smart and incredibly generous. ",
            "date": "Answered April 2, 2020",
            "views": "393",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yu Serizawa",
                    "user_href": "/profile/Yu-Serizawa"
                },
                {
                    "user_id": "Derrin Gottlieb",
                    "user_href": "/profile/Derrin-Gottlieb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jose Ortiz",
                "href": "/profile/Jose-Ortiz-136"
            },
            "answer_text": "Regular intelligence. But growing up in rural Southern USA I don’t think he was ‘too smart or too intellectual’. That’s the only thing I can say. ",
            "date": "Answered June 26, 2019",
            "views": "375",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Stewart",
                "href": "/profile/Scott-Stewart-360"
            },
            "answer_text": "i would say he was intelligent, not and Einstein but he enjoyed reading and could pick up on things that some others couldnt. ",
            "date": "Answered August 21, 2020",
            "views": "181",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carla Anders",
                "href": "/profile/Carla-Anders-1"
            },
            "answer_text": "Not very ",
            "date": "Answered October 7, 2017",
            "views": "345",
            "upvotes": "0"
        }
    ]
}