{
    "title": "How did Edward VIII meet Wallis Simpson? - Quora",
    "tags": [
        "Wallis Simpson",
        "King Edward VIII",
        "History of Great Britain",
        "The British Royal Family",
        "British Monarchy",
        "England",
        "Great Britain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diane Black",
                "href": "/profile/Diane-Black-2"
            },
            "answer_text": "They first met on Saturday, January 10, 1931. Edward and his mistress, Thelma Furness, were to spend a weekend together at Melton Mowbray in Leicestershire. To maintain appearances, Thelma’s sister, Consuelo “Connie” Thaw and her husband Ben Thaw (the First Secretary at the American Embassy) were to accompany them as chaperones. But Connie couldn’t make it at the last minute due to an illness in the family, and Wallis and her then-husband, Ernest Simpson, was asked to take her place, along with Ben. Even though she had a savage cold, she spent most of Friday getting her hair and nails done, and she and Ernest left London on the train at 3:30 pm. While on the train, Wallis practiced her curtsey and arrived at Melton Mowbray at 6:30. Prince Edward and Lady Furness arrived at 7:30, along with Prince George and P.E.’s equerry General Trotter. It was all very informal Saturday, and she had an opportunity to chat with HRH, who asked her about life in America. There was a formal dinner for 10 Sunday evening. They returned to London on Monday, and she was quite smug at having met both Princes in one swoop, that having been one of things on her “bucket list” — she wrote to relatives in America to tell them that she had met HRH, and that there were plans for he to be presented at court (divorced people could be presented, as long as they were not at fault.) HRH left for a tour of South America and returned in April, and Wallis and Ernest met him again at a welcome home party given by Lady Furness. Wallis caught HRH nudging Lady Furness and, referring to Wallis, whispering, “Haven’t I met her before?” before greeting her familiarly and exchanging a few observations about his recent trip and moving on. Wallis was presented at Court on June 10th by Thelma Furness, and attended a celebration dinner that evening; afterwards, HRH drove Wallis and Edward home, and that was the last time she saw him for six months. After that, they became part of the fasionable “set” of people who spent weekends with HRH, etc. By January 1934, she and Ernest were firmly established as part of the fashionable crowd. Then Lady Furness had to return to America to support her sister Gloria Morgan Vanderbilt, during the famous hearings about her desire for custody of her daughter, Gloria Vanderbilt. She asked Wallis to look out for the Prince, and by the time she returned in March, Prince Edward was already captivated by Wallis Simpson. ",
            "date": "Updated March 18, 2019",
            "views": "8",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janet Smith",
                    "user_href": "/profile/Janet-Smith-46"
                },
                {
                    "user_id": "Janet Day",
                    "user_href": "/profile/Janet-Day-5"
                },
                {
                    "user_id": "Bill Bennett",
                    "user_href": "/profile/Bill-Bennett-16"
                },
                {
                    "user_id": "Eric Griggs",
                    "user_href": "/profile/Eric-Griggs-1"
                },
                {
                    "user_id": "Victoria Kidd-Cromis",
                    "user_href": "/profile/Victoria-Kidd-Cromis"
                },
                {
                    "user_id": "Sara Craig",
                    "user_href": "/profile/Sara-Craig-1"
                },
                {
                    "user_id": "Thomas Lyall",
                    "user_href": "/profile/Thomas-Lyall"
                },
                {
                    "user_id": "Judy Tallman",
                    "user_href": "/profile/Judy-Tallman"
                },
                {
                    "user_id": "Celeste Showyin",
                    "user_href": "/profile/Celeste-Showyin"
                },
                {
                    "user_id": "Debra Wright",
                    "user_href": "/profile/Debra-Wright-35"
                }
            ]
        }
    ]
}