{
    "title": "How does one become a historian? - Quora",
    "tags": [
        "Historians",
        "How-to Become Question",
        "How-to Question",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ricky D Phillips",
                "href": "/profile/Ricky-D-Phillips"
            },
            "answer_text": "There are really two routes to this; academia, which is always useful, and self study. Academia will teach you the basics of higher research and quantifying sources as well as being objective and testing theories. However, there is a danger here that you could end up with any pre-conceived ideas handed down by a tutor or simply knowing about as much as everyone else to a greater or lesser degree. Still, academia gives you those fundamentals and hopes, if you take history seriously, that you will do honour to history and tell it straight. It doesn't always happen, because people are always a variable. Self study is the second route. As a historian, I'm fortunate to be friends with so many of the historians I grew up reading, and ironically, most of the best have no formal qualifications. Ian Fletcher, the best man you'll find on the Peninsular War, once told me, “We're the guys who write the books which academics get their degrees from”, Angus Konstam, another great friend and excellent historian with 102 books to his name, says the same, “Oh no, I wouldn't lower myself to academia!” (he said with a laugh) and even Professor Tony Pollard (the top academic in the UK) told me, “You don't need academia to be a historian… you just need to be right. You don't need it, because it couldn't teach you anything!” This is not to tread on academia at all, but there is an element of “I've got a degree so I know more than you” and of course, this sense of entitlement can go to damage what history does. Ultimately, by whichever route, what you need is respect and diligence to the subject. If you find yourself trying to use the history or the evidence to “prove” a case, or deliberately change or omit other evidence because it's inconvenient, then it's opinion, not history. History is the truth and it doesn't belong to anyone, not even us historians. You can be wrong, we all can be, but you must never be false, whichever route you take. If you can present all of the available evidence and weigh it evenly and without bias, you're a historian. ",
            "date": "Answered January 5, 2019",
            "views": "454",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ariel Lederman",
                    "user_href": "/profile/Ariel-Lederman-1"
                },
                {
                    "user_id": "K Mantey",
                    "user_href": "/profile/K-Mantey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel Goldstein",
                "href": "/profile/Joel-Goldstein-7"
            },
            "answer_text": "I am much more familiar with academic historical writing, than with popular history. the process begins with learning the basics about a period.  One then wants to review recent writings with an eye for gaps.  Look for interesting historical topics.that have not been studies -- at least not recently. Then the real fun begins. These are some issues which distinguish successful History PhD.'s from want-to-bes: Can you frame a specific answerable question that addresses at least part of the general topics?Are there any primary historical documents that help address your question?  For my dissertation, I had planned to consult diaries by famous math educators among Dissenting ministers.  Most of their diaries, however, did not address their math educaiton. Luckily, I could start with lists of textbooks consulted and work from these.Can you organize your work into a realistic study plan?  I ended up with eight chapters that took longer than I should have.  If I had better grad advising I would have finished earlier.  Some people never really get started, and others never find a realistic stopping point.Thanks for the A2A ",
            "date": "Answered February 27, 2016",
            "views": "14",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ariel Lederman",
                    "user_href": "/profile/Ariel-Lederman-1"
                },
                {
                    "user_id": "Harry Hou",
                    "user_href": "/profile/Harry-Hou-5"
                },
                {
                    "user_id": "Ricky D Phillips",
                    "user_href": "/profile/Ricky-D-Phillips"
                },
                {
                    "user_id": "Sierra Jades",
                    "user_href": "/profile/Sierra-Jades"
                },
                {
                    "user_id": "SUBHAM THAKUR",
                    "user_href": "/profile/SUBHAM-THAKUR-22"
                },
                {
                    "user_id": "Eugene Mandolo",
                    "user_href": "/profile/Eugene-Mandolo"
                },
                {
                    "user_id": "Michael Nakhiengchanh",
                    "user_href": "/profile/Michael-Nakhiengchanh"
                },
                {
                    "user_id": "Stephen Lee",
                    "user_href": "/profile/Stephen-Lee-116"
                },
                {
                    "user_id": "Benjamin Boman",
                    "user_href": "/profile/Benjamin-Boman"
                },
                {
                    "user_id": "Johannes Musch",
                    "user_href": "/profile/Johannes-Musch"
                },
                {
                    "user_id": "Arpit Kubadia",
                    "user_href": "/profile/Arpit-Kubadia-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Javed Mukhtar",
                "href": "/profile/Javed-Mukhtar-1"
            },
            "answer_text": "There are two types of historians ; the ones who pen contemporary events, and others who delve deep into the past by comparative study for penning bygone events. In both the cases, a natural flair for writing is necessary. The task demands: High intellectual calibre to differentiate between superficiality and substance.Impartiality, and unbiased approach to contemporary happenings and their correlation with past events.To deal with facts, analysis, and opinions as the situation asks for, separately.The ability to observe minute details, followed by effective synthesis.The above requirements for writing history, don't appear handy in equal measure for all. Therefore, an aspiring historian is expected to be his/her own critic and judge, Further growth in the chosen field is possible by continuous honing for required skills consciously/honestly. ",
            "date": "Answered October 6, 2017",
            "views": "11",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ariel Lederman",
                    "user_href": "/profile/Ariel-Lederman-1"
                },
                {
                    "user_id": "J S",
                    "user_href": "/profile/J-S-2119"
                },
                {
                    "user_id": "Sapphira Nuttall",
                    "user_href": "/profile/Sapphira-Nuttall"
                },
                {
                    "user_id": "Will Taylor",
                    "user_href": "/profile/Will-Taylor-287"
                },
                {
                    "user_id": "John Blake",
                    "user_href": "/profile/John-Blake-140"
                },
                {
                    "user_id": "Bernadette Green",
                    "user_href": "/profile/Bernadette-Green-2"
                },
                {
                    "user_id": "Hamza Sadeeq",
                    "user_href": "/profile/Hamza-Sadeeq-1"
                },
                {
                    "user_id": "Guadalupe Luna",
                    "user_href": "/profile/Guadalupe-Luna-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johannes Musch",
                "href": "/profile/Johannes-Musch"
            },
            "answer_text": "By reading a lot!! And before all texts from the period you're interested in. All kinds of texts. Not just by one writer showing one viewpoint, but from as many writers as possible. And also newspapers, religious texts, commercials etc. etc. in order to have an idea of the context of the period you're interested in. Lessons in history are valuable too. You can follow history courses in university ofcourse, but there are many more ways to follow lectures. There are even online history courses available now Online History Courses - AcademicEarth.org  ",
            "date": "Answered February 27, 2016",
            "views": "826",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ariel Lederman",
                    "user_href": "/profile/Ariel-Lederman-1"
                },
                {
                    "user_id": "Sapphira Nuttall",
                    "user_href": "/profile/Sapphira-Nuttall"
                },
                {
                    "user_id": "Lijo John",
                    "user_href": "/profile/Lijo-John-56"
                },
                {
                    "user_id": "Michael Nakhiengchanh",
                    "user_href": "/profile/Michael-Nakhiengchanh"
                },
                {
                    "user_id": "Fábio Loppes",
                    "user_href": "/profile/Fábio-Loppes"
                },
                {
                    "user_id": "Sophie Hudson",
                    "user_href": "/profile/Sophie-Hudson-2"
                },
                {
                    "user_id": "Tyler Bouma",
                    "user_href": "/profile/Tyler-Bouma"
                },
                {
                    "user_id": "Ben Allen",
                    "user_href": "/profile/Ben-Allen-233"
                },
                {
                    "user_id": "Ayu Nazrah",
                    "user_href": "/profile/Ayu-Nazrah"
                },
                {
                    "user_id": "Assaph Mehr",
                    "user_href": "/profile/Assaph-Mehr"
                },
                {
                    "user_id": "Miriam Alek",
                    "user_href": "/profile/Miriam-Alek"
                },
                {
                    "user_id": "Bina Cotye",
                    "user_href": "/profile/Bina-Cotye"
                },
                {
                    "user_id": "Arpit Kubadia",
                    "user_href": "/profile/Arpit-Kubadia-1"
                }
            ]
        }
    ]
}