{
    "title": "How was the power of Mongols who ruled a major part of Asia once reduced to what it is today? - Quora",
    "tags": [
        "History of Mongolia",
        "History of Asia",
        "Mongolian Ethnicity and People",
        "Mongol Empire",
        "Mongolia",
        "Empires",
        "Southeast Asia",
        "Asia",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chandra Shekhar A.K.",
                "href": "/profile/Chandra-Shekhar-A-K"
            },
            "answer_text": "The rise of the Mongols during the rule of Genghiz Khan was due to his unprecedented unification of several mutually warring Mongol tribes scattered over the vast steppes of Central Asia. Though he married an adversary tribe’s woman by the the then prevailing traditional Mongolian method of abducting her against her will, which was a major cause for rampant inter-tribal conflicts, he had the good sense to stop this practice. His inherent curiosity about people and places made him open in knowing about the life, faith and lifestyles of people from various parts of the then known world and even accepting various faiths and marriage with other ethnic groups without distinction or discrimination to be adopted by his tribes. His appeal to the good sense of all Mongolian tribes in suing mutual peace and unification for extending their control over a much larger terrain than their then existing limits was a master strategy for expansion of Mongol invasions to distant6 parts of Central Asia, Middle East and Europe and to become the largest empire to be ruled by one ethnic group and potentate in the history of the world till his time. Incentives for the loyalty and unity of his men under his command was ensured in his practice of liberal sharing of the booty from his invasions with them. His success in his invasions was largely due to his exceptional cruelty in ravaging the lands of kingdoms whose leaders either ignored his warnings, killed/injured his messengers or played treachery in agreements with him that easily spread terror about his imminent invasions in the vicinity and sparing the lives of the subjects and rulers of kingdoms that surrendered to his forces. However, the success of Genghiz Khan ended with his lifetime, as the large empire built by nomadic campaigns without establishing his rule over the conquered kingdoms did not continue for long as parts of an empire with the exception of part of people of Mongolian descent spreading to the Chinese, Kyrghyz and Uzbeks nearer to their own homelands. With the end of the Mongol rule over China in the 14th century at the hands of the Han Chinese rulers, relations between the Mongols and the Chinese in the roles of rulers and ruled reversed with large parts of Mongolia brought under Chinese rule/cultural influence while the other conquered parts of the Mongol empire became free again under their local rulers. Mongols in their traditional homelands of Central Asian steppes and highlands continued as before with their traditional occupations as shepherds, cameleers and horse herders in their semi-nomadic lifestyles retaining Buddhism as their main religion taming their past warlike instincts. Russia, China and other Central Asian kingdoms/empires left them alone in their harsh and vast homelands as long as they remained neutral with their other neighbours. Moghuls of Uzbekistan alone among all the descendants of Mongols had a golden period after the fall of the Mongol empire initially as invaders under Timur and later as rulers of India for 200 years from the time of Babur to that of Aurangazeb before it fell to British hands during the reign of Shah Alam and Bahadur Shah Zaffar. ",
            "date": "Answered October 19, 2020",
            "views": "118",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhinav Ashish",
                    "user_href": "/profile/Abhinav-Ashish-12"
                },
                {
                    "user_id": "Soham Athavale",
                    "user_href": "/profile/Soham-Athavale-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lorenzo Casati",
                "href": "/profile/Lorenzo-Casati-1"
            },
            "answer_text": "The Chinese rebelled against their Mongol overlords, the Mongol leaders (descendants of Genghis Khan) fought for power among themselves and their empire, and in an age without modern means of communication was too big to stay united and eventually broke apart. ",
            "date": "Answered October 19, 2020",
            "views": "383",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ferenc Nagy",
                    "user_href": "/profile/Ferenc-Nagy-13"
                },
                {
                    "user_id": "Soham Athavale",
                    "user_href": "/profile/Soham-Athavale-1"
                }
            ]
        }
    ]
}