{
    "title": "How effective is a Makarov Pistol? - Quora",
    "tags": [
        "Makarov Pistol",
        "Pistols",
        "Handguns",
        "Rifles",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Martin",
                "href": "/profile/Tom-Martin-160"
            },
            "answer_text": "How effective is a Makarov Pistol?  I owned one, I didn’t like it because of safety reasons, as when I put the weapon on safe, I’d get a light primer strike, and I’d not thought much about them, and dismissed them but they can be accurate and deadly, and cheap. I think that given the right circumstances, and a skilled, determined shooter, or a clusterfuck and an unfortunate shot, the Makarov, like almost all other firearms can be deadly and tragically effective. One interesting thing about Makarov pistols is someone in Washington State assassinated a Federal Prosecutor and there was mention in some articles that the shooter took what some called a difficult shot, while other reports give the impression it was a simple as putting rounds through a window at close range, but it was a Makarov with a replacement barrel. Tracing gun barrel is next hurdle in probe of federal prosecutor Thomas Wales’ death What’s fascinating to me about this case is there’s a belief that is correct, that if someone was to kill a Federal Prosecutor, not only would extensive efforts be made, but the Feds would approach it repeatedly and there’s an assumption that the killer would be caught, eventually. ",
            "date": "Answered June 30, 2019",
            "views": "93",
            "upvotes": " View 63 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hayden Carlson",
                    "user_href": "/profile/Hayden-Carlson-9"
                },
                {
                    "user_id": "Jeffery Jones",
                    "user_href": "/profile/Jeffery-Jones-104"
                },
                {
                    "user_id": "Georgy Konstantinovich Zhukov",
                    "user_href": "/profile/Georgy-Konstantinovich-Zhukov"
                },
                {
                    "user_id": "Mohammad Noor",
                    "user_href": "/profile/Mohammad-Noor-92"
                },
                {
                    "user_id": "Ej Rivera",
                    "user_href": "/profile/Ej-Rivera-9"
                },
                {
                    "user_id": "Ronald Tambunan",
                    "user_href": "/profile/Ronald-Tambunan"
                },
                {
                    "user_id": "Raines Whitehill",
                    "user_href": "/profile/Raines-Whitehill-1"
                },
                {
                    "user_id": "Michael McGourty",
                    "user_href": "/profile/Michael-McGourty-3"
                },
                {
                    "user_id": "Eugene Fedushenko",
                    "user_href": "/profile/Eugene-Fedushenko"
                },
                {
                    "user_id": "Joshua Nguyen",
                    "user_href": "/profile/Joshua-Nguyen-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Waliser",
                "href": "/profile/Mark-Waliser"
            },
            "answer_text": "Very effective for its intended purpose. Most military and police officers in the old Eastern Bloc carried these pistols as much as a symbol of office as a practical weapon. They were easy to carry although not very light due to all steel construction. The mechanism is very well designed and quite rugged. Maintenance is easy. The cartridge it fires is marginal by today’s standards of stopping power but should be adequate if well placed. It is very much like the 9x17K (.380 auto). The pistols tend to be accurate due to a well designed fixed barrel. However, this means the gun is a straight blowback action which gives a sharp, snappy recoil. Replacing the original grip with a rubber one (made by Houge if memory serves) should be the first thing anyone wishing to shoot the pistol should do. The front sight is way too small. The Baikal guns imported into the US many years ago had a nice adjustable rear sight but the rest of them had a fixed rear sight which was as marginal as the front sight. The magazine release is on the pistol butt, which is inconvenient but was mandated after the Soviet experiences with their previous pistol (TT-31?) tending to drop the magazine prematurely. All in all, this is a very satisfactory pistol for its time and will likely soldier on for quite some years to come. ",
            "date": "Answered February 29, 2020",
            "views": "563",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve Kincer",
                    "user_href": "/profile/Steve-Kincer"
                }
            ]
        }
    ]
}