{
    "title": "How was England controlled back in 1840-1850? - Quora",
    "tags": [
        "Nashville Convention",
        "Compromise of 1850",
        "England"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean McHugh",
                "href": "/profile/Sean-McHugh-9"
            },
            "answer_text": "“How was England controlled back in 1840-1850?” In the English language, ‘control’ is a very strong word. This question is an inappropriate use of the word ‘control’. You control a car (automobile) using the controls. But an auto does not have any will of its own. You control a dog or a horse by training it to obey. But the dog or thew horse can in a crisis run out of control. As for people. you cannot even control yourself all the time since you may lose control of yourself. When it comes to millions of people, it is simply wrong to talk about controlling them. You may govern them, you may rule them, and you may even reign over them. But you cannot control them. All this applies especially to the era 1840 - 1850 in England. (I don’t know why Wales, Scotland and Ireland were left out. At this period these islands were all grouped together under Queen Victoria as Great Britain. Not England.) This was the era of the Great Railway building, of the Workshop of the World with shipbuilding yard lining the great rivers, of the Chartists, of little wars with Imperial armies, of Young Europe movements across the continent in the run up to 1848, of the peak of Industrial Revolution in the run up to The Great Exhibition before improvements in the steam engine efficiency meant all nations could start using them, I could go on but the last word I would think of using would be control. ",
            "date": "Answered April 4, 2018",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ted England",
                "href": "/profile/Ted-England"
            },
            "answer_text": "The United Kingdom has been ruled by an elected parliament for more than 300 years. No monarch has been permitted to rule since 1688, the last one who really tried was kicked out in the “Glorious Revolution” out and not long before that another had his head removed at the end of the English Civil War in 1649. An Eyewitness Representation Of The Execution Of King Charles I In 1649 Oil On Canvas Detail by John Weesop ",
            "date": "Answered April 1, 2018",
            "views": "92",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anna Smith",
                    "user_href": "/profile/Anna-Smith-433"
                },
                {
                    "user_id": "Jasmine Kanaan",
                    "user_href": "/profile/Jasmine-Kanaan"
                },
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                }
            ]
        }
    ]
}