{
    "title": "How many stock traders are there worldwide? - Quora",
    "tags": [
        "How Many X Are There In The World?",
        "Stock Traders",
        "Stock Trading",
        "Trading (finance)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hermann J. Stern",
                "href": "/profile/Hermann-J-Stern"
            },
            "answer_text": "We have analysed that a couple of years back when we decided to start our stock investor portal (Stock and Index Ratings for long-term stock investing). We found the following information:  That's 60 million in the US. Not all of them trade in stocks directly. 33.6% hold stocks directly, 37.8% in retirement accounts which can be funds, too. If we assume 33.6% of the 37.8% in retirement accounts, we come up with around half of the 60 million families holding stocks. That's 30 million in the US. The rest of the world is a lot less keen on stocks. Let's assume they hold another 30 million. That makes 70 million people who hold publicly traded stocks directly in 2009. It's probably near 80-90 million today. ",
            "date": "Answered January 20, 2016",
            "views": "104",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jan Pajić",
                    "user_href": "/profile/Jan-Pajić"
                },
                {
                    "user_id": "Vincent Arrogancia",
                    "user_href": "/profile/Vincent-Arrogancia"
                },
                {
                    "user_id": "Saif",
                    "user_href": "/profile/Saif-180"
                },
                {
                    "user_id": "Eugene Kagan",
                    "user_href": "/profile/Eugene-Kagan-1"
                },
                {
                    "user_id": "Sam",
                    "user_href": "/profile/Sam-766"
                },
                {
                    "user_id": "Braden Anderson",
                    "user_href": "/profile/Braden-Anderson"
                },
                {
                    "user_id": "Raf Everest",
                    "user_href": "/profile/Raf-Everest"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zairi Yasser",
                "href": "/profile/Zairi-Yasser"
            },
            "answer_text": "eToro which is the world leading platform for social trading has more than 4 Million trader. Trading is not an elite activity anymore. you can join a whole community with as little as 200$ investment as first deposit. Moreover, you don’t have to be an experienced trader to earn money, eToro allows you to copy someone else strategy with just one click. I’ve been using it for more than 3 years now, and i can tell you that it is a good chance for average people toward more financial freedom. Good luck. — CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 65% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money. ",
            "date": "Updated October 31, 2018",
            "views": "24",
            "upvotes": "0"
        }
    ]
}