{
    "title": "How did the invention of the camera change history? - Quora",
    "tags": [
        "History of Inventions",
        "Invention and Inventions",
        "Cameras"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daisy Rothschild",
                "href": "/profile/Daisy-Rothschild"
            },
            "answer_text": "Significantly! Specifically, it was camera photography that changed history, early 1820s!  Before that, artists primarily had to draw, paint, or etch portraits, landscapes, or representations of people or events. So, in the art community, photography was very controversial, can you imagine? Also, before there were photo-journalists, writers and artists had to go out 'in the field' to war, to document battles. Explorers could now photograph places and people (picture the Old West and the cowboys, and the often-staged portraits of Native American Indians-- some tribes of which no longer exist) or exotic animals like giraffes, or penguins... far-away locations like the Rocky Mountains, or Africa, Polynesia... anything! could be captured and shared with others back home. Plus, art works, except for etchings, prints and posters, generally were a 'one-off'. But... when printing became popular and Photography could be reproduced and shared more quickly with the masses,  newspapers and print couldn't get enough. The sharing of information-- and accurate visual information- exploded. Portraits became popular too; ordinary folks could get family pictures. (Centuries before, you had to be very rich to have a portrait painted by a court artist.) Photography could now capture the exact and precise details of an event, without any interpretation by the artist. It took many decades before the process became easy or inexpensive. To really enjoy and explore truly old photographs, search on photos of the Civil War, for example, or the old West at your local library online.  If you can't find one, let me know and I'll look up our Western museum. It's a great place to start. Also look up photography in the Wikipedia, there is a wonderful and detailed article there... with pictures. ",
            "date": "Answered March 22, 2014",
            "views": "93",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olufemi Obadina",
                    "user_href": "/profile/Olufemi-Obadina"
                },
                {
                    "user_id": "Cloris Tang",
                    "user_href": "/profile/Cloris-Tang-1"
                },
                {
                    "user_id": "Renan Akamine",
                    "user_href": "/profile/Renan-Akamine"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esmat Morshedy",
                "href": "/profile/Esmat-Morshedy"
            },
            "answer_text": "   The invention of Camera added a great value as an evidence and proof to not only any important event, but also every thing in life, in other words it enabled normal people to document their moments and share it with others, opening a new era of documentation. From invasions, wars, human disasters, victories social events, an endless list of  other events. Created a demand on the new product “photos”, where a demand there is is a supply, so an entire industry started to meet new demands where they used new technology to meet that demands. Box cameras, small cameras, espionage cameras, thermal cameras…etc.  With the invention of cameras, a new industry is born, chemicals, papers, films and most of all glass and lenses. Manufactures needed better quality all the time.    With grow of population societies and authorities needed to use the “personal” ID photo and passports photos.      Led to invention of Movie Cameras, as the movie camera is sequenced still shots, when displaying causes the sense of movement   Allowed many ordinary people to become sort of \"reporters\" and sort of \"artists\" as drawing was limited to skilled artists As you can see, it helped us to take a good look at the past and keeping it as a reference for the future generations. Here is a link to Explore 679,225 items digitized from The New York Public Library's collections; it is free to access and completely free to download any of them.   NYPL Digital Collections (NYPL Digital Collections)  ",
            "date": "Answered April 4, 2016",
            "views": "24",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Allison Arita",
                    "user_href": "/profile/Allison-Arita"
                },
                {
                    "user_id": "Ngọc Sinh Phan",
                    "user_href": "/profile/Ngọc-Sinh-Phan"
                },
                {
                    "user_id": "MaiAnh Dong",
                    "user_href": "/profile/MaiAnh-Dong"
                },
                {
                    "user_id": "Sam D'Amico",
                    "user_href": "/profile/Sam-DAmico-10"
                },
                {
                    "user_id": "Olufemi Obadina",
                    "user_href": "/profile/Olufemi-Obadina"
                },
                {
                    "user_id": "Gerald Jerico Velayo",
                    "user_href": "/profile/Gerald-Jerico-Velayo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Strehlow",
                "href": "/profile/Mike-Strehlow-1"
            },
            "answer_text": "It vastly changed art. Prior to the camera, art’s job was as much visual information as it was art. But since the most talented painter in the world cannot hope to match the accuracy in rendering a portrait or a landscape as even a mediocre camera can, art changed from realistic to impressionistic/ abstract within a couple of generations of the invention of photography.As an educational tool the camera has no equal. It is one thing to read in the paper that the Battle of Antietam was the bloodiest single day of warfare in American history, with 26,000 casualties on both sides; it is another to see one of these by Matthew Brady. The glamorous knight-errant view of warfare could not stand up to photos like this. Of course, photos of Hitler’s death camps or the mushroom cloud of the first A-bomb dropped on Hiroshima also have incredible impact, more than words alone could ever convey. ",
            "date": "Answered November 20, 2017",
            "views": "26",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Louis Mastrangelo",
                    "user_href": "/profile/Louis-Mastrangelo"
                },
                {
                    "user_id": "Pratijit Podder",
                    "user_href": "/profile/Pratijit-Podder"
                },
                {
                    "user_id": "Monirul Islam",
                    "user_href": "/profile/Monirul-Islam-181"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Ballai",
                "href": "/profile/Michael-Ballai"
            },
            "answer_text": "I don’t consider the camera as something changing history. It has changed our observation of history. In doing so, it has also changed us as observers of history. From the first cameras straight through to motion pictures and television, we have become a much more visually oriented society. We read less, think less, and observe more. I grew up with a generation that carried protest signs. Now they post memes on Facebook. Our attention span has dropped to an emotional reflex. I really love photography. But I believe that we have become pawns to be manipulated if we fail to become more responsible. Visual lies are just as easy as verbal ones. And we rarely hold the visual liars up for reproach. It’s time we start thinking about we accept as true in a relativistic ethical society. Tweets and memes are a lousy foundation for a worldview. ",
            "date": "Answered October 6, 2017",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alex Johnson",
                "href": "/profile/Alex-Johnson-123"
            },
            "answer_text": "Cameras have given future generations the capability to see into the past. Before cameras history had to be passed on by written descriptions and word of mouth. Due to cameras, future generations will be able to look back and see how people lived, find out personal information about their ancestors, and watch as historical events unfold that changed the world. ",
            "date": "Answered March 28, 2014",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shayaanamin Khan",
                    "user_href": "/profile/Shayaanamin-Khan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Chapman",
                "href": "/profile/Sam-Chapman-19"
            },
            "answer_text": "I would wholeheartedly agree with the points which your 4 other replies you have received and add to that by saying that if you wonder how big an impact it has made, consider the effect that the internet, telephones and smartphones has had on people’s lives; possibly the only thing that has affected more people than anything else, is that of of the discovery of Penicillin, but the camera is up there with those listed. ",
            "date": "Answered November 3, 2017",
            "views": "12",
            "upvotes": " Answer requested by Whitney Williams"
        },
        {
            "author_info": {
                "name": "Dominique Dallemagne",
                "href": "/profile/Dominique-Dallemagne"
            },
            "answer_text": "It hasn’t finished changing history. It may, as George Orwell feared, become a major instrument of the totalitarian state. Hidden web cams in television sets, the core of state spying on citizens in 1984, his novel, are now pretty standard we are told and it’s not easy to turn them off unless you’re some electronics expert. These can be used to observe you as can the camera built into your smart phone or computer. We are observed increasingly by several street cameras whenever we leave our homes to drive or walk. All these new developments are perfect for totalitarians. ",
            "date": "Answered November 26, 2016",
            "views": "23",
            "upvotes": "0"
        }
    ]
}