{
    "title": "How many languages were spoken in antiquity? - Quora",
    "tags": [
        "Antiquity",
        "Spoken Language",
        "Linguistics"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Sánchez",
                "href": "/profile/David-Sánchez-20"
            },
            "answer_text": "It is a difficult question. I have tried to make an estimation examining closely what happened region by region (in some areas the number of languages diminished while in other areas clearly it grew). I will take as an approximate reference the year 1 A.D. for my estimations. First we need to note some difficulties in estimations: We do not know exactly the World Population around the year 1 A.D., there are estimations ranging from 170 million people up to 250 million people. In my estimations, I will assume around 200 million people for the World Population around 1 A.D. [the current population of the World is about 35 times the population it had 2000 years ago).Many parts of the Earth were very poorly documented in the year 1 A.D. We have much better information for Eurasia than for other regions of the planet. Fortunately, Eurasia was the most populated continent at that time, unfortunately we do not have precise information about many hunter-gatherer people in less developed areas of the planet 2000 years ago. Archeological evidence tells us about the material culture of these latter areas, but not so much about the ethnic and linguistic diversity.Currently, the world population is about 7500 million people and we have around 6500 living languages, and we know that the number of languages is not proportional to population. For these reasons, the number of languages when the population was 35 times smaller is not so different from the current number of languages. In the last five centuries, only a handful of languages have increased their number of speakers by “a lot”, by extinguishing some nearby languages. Currently, the 10 most widely spoken languages have together around 3125 million speakers (in 2010, and as a first language), so only 10 languages account for around 45% of the total population. The 25 most widely spoken languages (only 0.38% of the total number of languages) include most of the population (60%). This implies that the number of speakers per language has a very unequal distribution. Around year 1 A.D., due to difficulties in transportation and the communications between distant areas, there was a huge political fragmentation in the World, so probably the most widely spoken languages were under 40 million. I have estimated that the number of Latin speakers was only about 30 or 35 million (from a total population in the Roman Empire of about 60 million). This implies that Latin was spoken by around 18% of the total population of the World in the year 1 AD, similarly Old Chinese had a similar number of speakers, perhaps 15% to 20% of the World Population (modern Chinese includes only 13% of the World Population).  Estimation of the number of languages (region by region). Europe. Many changes have occurred in this continent in the last 2000 years: many different great Empires politically unified large areas that were previously not linguistically related. The unifications produced by these empires probably reduced the number of languages. In the Roman Empire (south of Europe, east of Near East, north of Africa), we have attested about 65 different languages, between 3th century BC and 5th century AD. In pre-Roman Italy we have 23 attested languages, this gives around 13000 km2 per language. This figure is similar to temperate and tropical areas in Pre-Columbian America where: we had one language for every 12000 km2 (near the equator) and one language for every 40000 km2 in the colder areas in the north of the USA/Canada. Using a similar extrapolation for ancient Europe, my estimation is that in ancient Europe, we had around 150 or 230 languages (currently we have only 125 living languages). I will assume the number of languages in Europe was around 200.Africa, in this region the main change was the Bantu expansion and the expansion of Islam. The Islamic expansion happened only 1300 years ago, so we have good documentation about the languages of the pre-Islamic period in north Africa (there was about fifteen Berber languages and Coptic dialects in Egypt). Currently, there are about 2000 different languages in Africa, we can assume that Islamic expansion did not change very much that figure, but only changed the number of speakers in favour of Arabic linguistic varieties. The Bantu expansion is a more difficult case, currently, we have about 700 Bantoid languages (roughly a third of the languages of Africa). 2000 years ago, perhaps there were only 25 or 30 Bantoid languages, being fragmented in different languages only later. On the other hand, the current territory occupied now by Bantu languages was populated by pygmies and other people that were “swept” by Bantu peoples. Because of the extension of the Bantu language, my estimation is that it was about 400 non-Bantu languages, so my estimation for the number of languages in Africa, around the year 1 AD, is about 1600 languages.America, the two main historical empires in Pre-Columbian era (Incas and Aztecs) only emerged between 13th and 15th centuries. Previously, most America was divided in small kingdoms (chiefdoms and “cacicazgos”) that did not change in significant way the number of languages. Currently, we have about 875 attested languages in America between 1492 and today (about 520 native/indigenous languages are spoken in the present). Given the highly stationary conditions in the Americas, I will assume that, around the year 1 A.D., there were about 800 languages in the Americas.Oceania, Australia seems to have had more or less the same number of languages, for millennia. Currently, we have 270 attested languages, son my estimation is that in Australia we had around 250 languages in the year 1 AD (one language per every 25000 km2, compatible with figures for desert areas in other regions). One important problem in Oceania is the estimation of the number of Oceanic languages, currently we have about 500 Oceanic languages, 1500 years ago Oceanic languages were completing its expansion. Due to its degree of current differentiation I will assume that 2000 years ago, there was probably around 200 Oceanic languages only [Pascua Island was colonized for the first time in the 2nd or 3rd century AD, and Hawai’i was reached only in the 5th century AD]. New Guinea is the most difficult region, currently we have about 1200 attested languages, this implies one language for every 1000 km2 (the greatest linguistic diversity in the planet!). I will assume that 2000 year ago the situation was similar, because until the 18th century this island was basically a set of Neolithic agricultural economies, and we do not have any piece of news about the existence of great Empires in the past. So I will assume that the number of Papuan languages was around 1200. Then the complete figure for Oceania, in my estimation is about 1650 languages (only a bit lesser than the actual number).Asia, is, without any doubt, the most difficult continent for my estimation. A great number of changes have been occurred in the last 2000 years in Asia, where great empires have arisen and collapsed. Currently, we have about 2200 attested languages in Asia, and because of this, Asia is the continent with most attested languages (there is one language for every 20000 km2). In the past, the most densely populated probably areas showed a higher linguistic fragmentation than in the present, for this reason, I suggest that the number of languages, in the year 1 A.D. could be around 2500 languages.So my estimation is that, 2000 years ago, there was around 5700 y 6300 languages, [with a huge incertitude about the number of languages in Africa, Asia and New Guinea]. Most parts of the planet were not occupied by countries or centralized Empires, 2000 years ago. The cultural and geo-political situation of the World in the year 1 AD was approximately this one:  ",
            "date": "Answered September 6, 2017",
            "views": "1",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mimo Prohodil",
                    "user_href": "/profile/Mimo-Prohodil"
                },
                {
                    "user_id": "Jeffrey Spencer",
                    "user_href": "/profile/Jeffrey-Spencer-24"
                },
                {
                    "user_id": "Lucas López Santibáñez",
                    "user_href": "/profile/Lucas-López-Santibáñez"
                },
                {
                    "user_id": "Jordi Barceló Gómez",
                    "user_href": "/profile/Jordi-Barceló-Gómez"
                },
                {
                    "user_id": "Aurelio Germes",
                    "user_href": "/profile/Aurelio-Germes"
                },
                {
                    "user_id": "Sudarshan Srinivasan",
                    "user_href": "/profile/Sudarshan-Srinivasan-11"
                },
                {
                    "user_id": "Rodrigo Alvarez",
                    "user_href": "/profile/Rodrigo-Alvarez-3"
                },
                {
                    "user_id": "Irakli Berdzenishvili",
                    "user_href": "/profile/Irakli-Berdzenishvili"
                },
                {
                    "user_id": "Jose Pineda",
                    "user_href": "/profile/Jose-Pineda-6"
                },
                {
                    "user_id": "Michael Morrison",
                    "user_href": "/profile/Michael-Morrison-118"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Minnich",
                "href": "/profile/Michael-Minnich-1"
            },
            "answer_text": "Nobody has a clue. The primary reason for this is that historical linguistics has fabricated a huge amount of ‘data’ in order to preserve various narratives of European history. For instance, the idea that Scythian was Indo-European is based on absolutely nothing more than the fact that one day a Lithuanian linguist suggested that IE originated in Lithuania and damn near everyone accepted his argument unquestioningly. And this is related to another problem, which is that a lot of unrelated things that we have well documented and which exist today have been called Indo-European, obscuring the true diversity historically present in Eurasia, affecting estimates of natural rate of change in languages, informing insane philosophies of syntax, etc. It’s quite a major problem, which essentially invalidates much of linguistics in general. ",
            "date": "Answered July 21, 2017",
            "views": "219",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kutluk Ozguven",
                    "user_href": "/profile/Kutluk-Ozguven"
                },
                {
                    "user_id": "Daniel Brockert",
                    "user_href": "/profile/Daniel-Brockert"
                }
            ]
        }
    ]
}