{
    "title": "How did King Louis XIV of France die? - Quora",
    "tags": [
        "Louis XIV (historical figure)",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shatrughna Prasad",
                "href": "/profile/Shatrughna-Prasad-2"
            },
            "answer_text": "The story of Louis xiv’s death is worthy of a Shakespearean tragedy. His health started to decline on 10 August 1715 upon his return from a hunting trip in Marly, when he felt sharp pains in his leg. Fagon, his doctor, diagnosed sciatica. But the pain was always in the same place, and shortly afterwards black marks appeared, indicating senile gangrene. Despite excruciating pain, the king carried on with his daily routine without flinching, fully intending to do his duty to the end. The veteran monarch seemed unshakeable, to the great admiration of all the courtiers. However, on 25 August, the day of Saint Louis, he was forced to remain in bed, and thereafter never left his bedchamber. After a week of agonising pain, four days before his 77th birthday, Louis XIV died in Versailles just after 8.15 am on 1 September. He had been king for 72 years, the longest reign in the history of France. ",
            "date": "Answered October 24, 2017",
            "views": "853",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Gill",
                    "user_href": "/profile/John-Gill-70"
                },
                {
                    "user_id": "Veronique Bertrand",
                    "user_href": "/profile/Veronique-Bertrand"
                },
                {
                    "user_id": "Pramod Singh",
                    "user_href": "/profile/Pramod-Singh-134"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yassir Khalid",
                "href": "/profile/Yassir-Khalid"
            },
            "answer_text": "He died old, 4 days before his 77th birthday, of senile gangrene (a blood infection) on 1 September 1715 in Versailles. Since he became king at 5, his reign is the longest of any monarch not only in France but in Europe. He outlived his legitimate sons and grandsons, with the exception of Philippe (king of Spain, henceforth excluded from the French line of succession). He had a number of bastard sons who survived him. He was successed by his great-grandson, who became Louis XV (and also died old). But since Louis XV was also 5 when he became king, his uncle Philippe (another Philippe, not the King of Spain…) became Regent. ",
            "date": "Answered October 6, 2017",
            "views": "21",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Veronique Bertrand",
                    "user_href": "/profile/Veronique-Bertrand"
                },
                {
                    "user_id": "James Carter",
                    "user_href": "/profile/James-Carter-406"
                },
                {
                    "user_id": "Randy McDonald",
                    "user_href": "/profile/Randy-McDonald"
                },
                {
                    "user_id": "Bruce Downing",
                    "user_href": "/profile/Bruce-Downing-1"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                },
                {
                    "user_id": "Jérémie Boussand",
                    "user_href": "/profile/Jérémie-Boussand"
                },
                {
                    "user_id": "George Géal-Killy",
                    "user_href": "/profile/George-Géal-Killy"
                }
            ]
        }
    ]
}