{
    "title": "How is Chinese history divided? - Quora",
    "tags": [
        "History of China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hanson Sun",
                "href": "/profile/Hanson-Sun"
            },
            "answer_text": "Chinese history can be generally divided into two parts: A 5000 years of “ word-of-mouth” history which combines stories and legends, and a 5000 years of history that recorded by characters. The later 5000 years of history can also be divided into two parts: An official history written by government which is all about the empires and its bureaucratic system, and an in-formal history spread among civil society. The official history is very reliable, while the informal one are more inclusive. ",
            "date": "Answered July 4, 2019",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gabrielle Valérie de Bellefeuille-Jurajuria",
                "href": "/profile/Gabrielle-Valérie-de-Bellefeuille-Jurajuria"
            },
            "answer_text": "By dynasties, mostly, and then it is followed by the period of the Republic of China and the period of the People’s Republic of China (current period). The only exception to this is the period between the Zhou dynasty and the Qin dynasty. ",
            "date": "Answered January 15, 2018",
            "views": "214",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Grant Hartlage",
                    "user_href": "/profile/Grant-Hartlage-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "QiFei Min",
                "href": "/profile/QiFei-Min-1"
            },
            "answer_text": "Don’t quite understand your term ‘what’. Well history is just history. If you need the definition of the term itself, I recommend that you go ask google, it’s more pofessional. Well for the actual content of Chinese history, you can go find some books on it to get to know it as the first step. Me being native Chinese think it’s far better to visit historical sites and museums, the best way to know any regional history. Chinese history it’s too long and too much to tell on quora, so you can find some documentary to know something. If you are interested , then study further. Hope my answer helps! :) ",
            "date": "Answered February 15, 2018",
            "views": "168",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tan Yong Han",
                    "user_href": "/profile/Tan-Yong-Han"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yifan Wang",
                "href": "/profile/Yifan-Wang-82"
            },
            "answer_text": "Divided into Dynasties  ",
            "date": "Answered February 24, 2020",
            "views": "273",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vitor Lee",
                    "user_href": "/profile/Vitor-Lee-2"
                }
            ]
        }
    ]
}