{
    "title": "How does the USA have systemic racism? - Quora",
    "tags": [
        "Racism",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Wetzel",
                "href": "/profile/Tom-Wetzel-4"
            },
            "answer_text": "Here it’s necessary to know what “systemic racism” is. It’s a group to group power relation where people in positions of power — managers, bank loan officers, landlords and real estate agents, police and prosecutors — tend to act in ways that limit or deny equality of access to resources to the racialized group — a group treated in practice as an “inferior race” who can be treated worse — even if the persona making the relevant decisions — about hiring, loans, whatever — isn’t necessarily explicitly aware in their own thinking that their decision fits in with this pattern. So it’s a situation where power is exercized by people who belong to one group over members of another group, in ways that disadvantage the subordinate group. Managers, landlords, judges, prosecutors tend to be overwhelmingly white. This practice in the USA can be traced back to the campaigns of the colonial elite in North America to justify the introduction of the institution of life-time slavery for people of African ancestry — which involved major campaigns referring to blacks as inferiors and thus their worse status being justified. There are various studies that show these patterns still exist — race discrimination in hiring, in bank lending, in renting or selling houses, in sentencing practices by judges, in behavior of cops and prosecutors, such as racial profiling in traffic stops. These practices tend to sustain an unequal situation for the African-American population, which started out in a propertyless situation after liberation from slavery, and then were subjected to a century of official racial segregation and discrimination policies. Although some gains were made during the civil rights era. Various laws were passed making certain forms of discrimination illegal (but often without effective forms of enforcement), and popular attitudes towards the black population by the white population changed significantly — with declines in support for a variety of racist stereotypes, declines in things like wanting your kids to not be in schools with blacks, declines in opposition to inter-racial marriage. Also, there was the emergence since the ’60s of a sizeable black professional-managerial class and black celebrities and athletes are more visible than in the past. But this hasn’t ended the pattern of racial inequality, such as blacks having twice the unemployment rate as whites. So systemic racism is revealed in racial inequality still being a major fact of life. Blacks are three times more likely to be poor than whites. Average income of blacks is about 40 percent less than whites. On average, blacks have about one-eighth of the net worth of whites. The pattern of power I referred to earlier helps to explain the persistence of this inequality. The question asks about where this pattern persists. It persists throughout the USA. To look at where it would be worse, you’d have to look at various statistics, such as degree of racial segregation (worse probably in places like Chicago and Milwaukee) or other statistical evidence to get an idea of the real circumstances faced by the black population in that area. There are other groups in USA who experience forms of systemic racism, to one degree or another — it affects American Indians and some Latino groups also. But black Americans are the “canary in the mine” as far as this pattern in USA is concerned. ",
            "date": "Answered January 12, 2019",
            "views": "627",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Savage",
                    "user_href": "/profile/Mike-Savage-41"
                },
                {
                    "user_id": "Junior Garcia",
                    "user_href": "/profile/Junior-Garcia-46"
                },
                {
                    "user_id": "Sydney MacDuffey",
                    "user_href": "/profile/Sydney-MacDuffey"
                },
                {
                    "user_id": "Don Tracy",
                    "user_href": "/profile/Don-Tracy-2"
                },
                {
                    "user_id": "Rachel Turner",
                    "user_href": "/profile/Rachel-Turner-173"
                },
                {
                    "user_id": "Matthew Moppett",
                    "user_href": "/profile/Matthew-Moppett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stuart Bennett",
                "href": "/profile/Stuart-Bennett-16"
            },
            "answer_text": "Between the ears of every single human being - who has ever lived on planet Earth …. in one form or another - racism exists … from culture to culture to culture … ad finitum, ad naseum - welcome to the club. Currently - “political racism “ is “in”, and making the rounds at universities (ie Ben Shapiro’s speeches at Berkeley being under assault - the bastion of “free speech “)- so make up a sign promoting your social justice cause, knock on George Soros’s door for sponsorship, organize a protest, and elevate your racism… above everyone else’s, and learn how the game of “SYSTEMIC RACISM “ is successfully promulgated, and managed. Here is a tip for your cause - I understand that the boyscouts of America have not been forcefully penetrated enough … by girls as a demographic, particularly those girls of the Islamic faith. If the boyscouts can be penetrated forcefully enough by non traditional niches, other than actual traditional American boys - it’ll help lessen the problem of acute masculinity problems in your society, for if the left is going to continue to be successful - like they have been in … via actually lessening the new generations of American men’s testosterone production, well, times like these call … for social justice, because if you have not identified a victim of some form of oppression just yet - you’re simply not looking hard enough for potential victims. Listen Up: If you want an important example of “GLOBAL SYSTEMIC RACISM “ - fix your attention on the Buddhist nation of Tibet, and their leader, the Dalai Lama. The heavy handed communist government of China has been subjugating/killing the Buddhist Tibetans, since approximately 1950 , to keep Tibet under Chinese rule, as opposed to allowing Tibetans their sovereignty, like they want. Should it not piss-off freedom loving people everywhere - when they communicate on their smartphones - that are actually made in China? Every time a person who has freedom, actually uses a product made in China - your partronage benefits the tyrannical nation of China, as it also does American tech companies (ie Apple, Facebook, etc). And though many of our purchases will unfortunately continue to be Chinese made products/services , due to their price point and dominate prevalence - sometimes it is not good to be too aware of the “inter-connectedness “ of your world, for the water is deep, not blameless, and sometimes, the “enemy “, is us. The world is an intricate, interconnected “row of dominos “, where if you’re not at least vaguely mindful of what you buy, where it is made, or how you feel about something - you may be inadvertently contributing towards, something akin to - “SYSTEMIC RACISM “, genocide ( in the case of the Tibetans), or … not. Lastly - every time you use your phone, your computer, your television, or any product made in China … think about where your money goes, and what your money is used for, and what’s okay with you? As a side note: One of the most bizarre, disingenuousness elements to America’s “social justice warriors “ is - the dichotomy between labeling a border wall “racist “ - while they worship their Chinese made communication tools - oblivious to how the money that was spent on those products … is “used”. ",
            "date": "Updated January 13, 2019",
            "views": "306",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Junior Garcia",
                    "user_href": "/profile/Junior-Garcia-46"
                },
                {
                    "user_id": "Mark Azarcon",
                    "user_href": "/profile/Mark-Azarcon-1"
                }
            ]
        }
    ]
}