{
    "title": "How many years did it take for the population to recover from the Black Death plague? - Quora",
    "tags": [
        "Plagues",
        "Bubonic Plague",
        "Middle Ages (era)",
        "Populations",
        "Demographics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alice Twain",
                "href": "/profile/Alice-Twain"
            },
            "answer_text": "It is very hard to answer because of several factors. The first is that the Black Death didn’t kill the same percentage of people everywhere. In some areas deaths were up to the 75% of the population, but in others they were below the 20%. It is worth noticing that bad weather had already caused a big famine starting in 1315, approximately 30–35 years before the Black Death, and food production only resumed in earnest in 1322. Another important famine occurred in 1330–34 and again in 1349–51 (immediately after the main outbreak of the Black Death ended). Overall, though, the whole XIV century massive famines, plague outbreaks and other epidemics and pandemics occurred. Indeed, the Black Death is often considered the first outbreak of a massive pandemics of plague (the second pandemics, the first one was Justinian’s plague started in 541; a third one started in the late XIX century and is going on at the moment, the one reason why we don’t hear about massive carnage due to it is that we now have antibiotics that can cure it). This is also the period when the Medieval Warm period ended, putting an end also, for instance, to grapes’ cultivation and wine production in southern England. Despite these coincidental causes for massive death (famines, plague outbreaks, other epidemics, to which we can add wars), the dent in population caused by these events does not seem to have been huge. European population in 1300 is estimated at 78.7 million people. By 1350 it had falled (also according to esteems) to just over 70 million people. But by the year 1400 population had already soared to almost the 1300 levels, and by 1450 the European population is estimated at 83 million people. (Urlanis, B T︠S︡ (1941). Rost naselenii︠a︡ v Evrope : opyt ischislenii︠a︡ [Population growth in Europe] (in Russian). Moskva: OGIZ-Gospolitizdat.) The population balance, though, does not tell us the whole story. Europe rapidly recovered its population, but its political, economic, social, and religious scenery was forever changed. The XIV century chrisis put a definitive end to the Arab presence in Europe, opened the doors to the religious reform, to a deep change in economy with the start of the enclosures and of a different way to manage the land, opened up the route to a number of technological innovations, reduce the relevance of the Mediterranean countries and therefore to the Mediterranean commercial routes, which in turn pushed the countries who facend the Atlantic Ocean into looking for new commercial routes (and this mean the start of the imperalist run to control the American, Africa, and Asia), the political evolution from the Medieval power system to absolutism, etc. Europe rapidly recovered its population, but it emerged deeply changed from the XIV chrisis. ",
            "date": "Answered December 11, 2019",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Beth Goldowitz",
                    "user_href": "/profile/Beth-Goldowitz"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Erii Mascar",
                    "user_href": "/profile/Erii-Mascar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gawain Llewellyn",
                "href": "/profile/Gawain-Llewellyn"
            },
            "answer_text": "The Black killed a lot of people. And I mean a lot. Half of Europe a lot. The population of Europe was reduced by about half. So let’s take a look.  As we can see, there is a huge drop of the population in England on the graph at the time of the plague in the mid-1300s, which the time of the outbreak of the plague. We can also see that the population didn’t return to pre-plague levels until around 200 years later in the mid-1500s. Similarly, the world followed a similar trend after WW2, in which the population rose dramatically.  TL;DR: It took a few centuries to recover to pre-plague levels. ",
            "date": "Answered May 4, 2019",
            "views": "19",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Colin Andrew",
                    "user_href": "/profile/Colin-Andrew-9"
                },
                {
                    "user_id": "Aditya Sharma",
                    "user_href": "/profile/Aditya-Sharma-1280"
                },
                {
                    "user_id": "Wazih Tausif",
                    "user_href": "/profile/Wazih-Tausif"
                },
                {
                    "user_id": "Max Halbrecht",
                    "user_href": "/profile/Max-Halbrecht-1"
                },
                {
                    "user_id": "Lee Savarese",
                    "user_href": "/profile/Lee-Savarese"
                }
            ]
        }
    ]
}