{
    "title": "How was the book 'Guns, Germs, and Steel' received among academics and serious scholars? - Quora",
    "tags": [
        "Guns, Germs, and Steel (1997 book)",
        "Germs",
        "History Books",
        "Book Reviews",
        "Political Science",
        "World History",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Altom",
                "href": "/profile/Tim-Altom"
            },
            "answer_text": "By and large, scholars are a predatory lot, always on the lookout for a victim. Those bespectacled, mild-mannered milksops are in actuality stern and rapacious when it comes to critiquing others’ works. So take their condemnation with a good deal of salt. In general, anything that challenges the mainstream is in for a good lashing. And to be frank, Diamond’s heady array of hypotheses and evidence is large but rather tenuous. Scholars can tell instantly that it’s not aimed at them. Most scholars seem to have found it either simplistic or downright fraudulent. Some have been more measured. In Diamond’s case, there is an additional layer of irritation that he ventured out of his narrow specialty and into the fields of history, sociology, and anthropology. Specialists don’t like being poached. One writer described it as “academic porn”. Real History versus Guns Germs and Steel by Jared Diamond A more thorough and reasonable review is here: Guns, Germs and Steel: The Fates of Human Societies ",
            "date": "Answered September 16, 2016",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Souryatanu Saha",
                    "user_href": "/profile/Souryatanu-Saha"
                },
                {
                    "user_id": "Ludovico Altana",
                    "user_href": "/profile/Ludovico-Altana-1"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Ashutosh Mehndiratta",
                    "user_href": "/profile/Ashutosh-Mehndiratta"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Lynx-Kepler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean R. Wilson",
                "href": "/profile/Sean-R-Wilson"
            },
            "answer_text": "I’m not an academic and sure ‘aint no scholar but I do dabble… Guns, Germs & Steel is one of my favorite books of all time. It’s fairly dense but certainly readable but the astounding thing is, like only a few other authors I’ve read, Diamond takes a mammoth & multidimensional topic and breaks it down into a few very understandable concepts. I mean if I asked you why did Western Civilization flourish and develop all this technology & come to dominate the world, how do you answer that? So many factors, interconnected, so many different paths to explore, so many disparate fields of science & history that all contribute to the answer. Personally, I’d recommend it to anyone interested in learning a bit about the world and how we all came to be where we are today. Granted, in today’s environment, many of the factors Diamond explores in his book are no longer as relavant because we are now truly a global society, interconnected by trade, commerce and communications BUT it is still a very important (in my opinion) book that really sheds light on our collective history. ",
            "date": "Answered January 10, 2017",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andras Boros-Kazai",
                    "user_href": "/profile/Andras-Boros-Kazai"
                },
                {
                    "user_id": "Mark Hutchison",
                    "user_href": "/profile/Mark-Hutchison-31"
                },
                {
                    "user_id": "Christienne Woods",
                    "user_href": "/profile/Christienne-Woods-1"
                },
                {
                    "user_id": "Moises Braun Wollenstein",
                    "user_href": "/profile/Moises-Braun-Wollenstein"
                },
                {
                    "user_id": "Mohammed Zameer",
                    "user_href": "/profile/Mohammed-Zameer"
                }
            ]
        }
    ]
}