{
    "title": "How did the French and Indian War end? What happened after it ended? - Quora",
    "tags": [
        "The French-Indian War",
        "The French and Indian War (Known commonly as the 7 Year's War)",
        "World History",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Sumit Mishra",
                "href": "/profile/Sumit-Mishra-40"
            },
            "answer_text": "Let's have a look of the war first before coming to it's end. The French and Indian War resulted from ongoing frontier tensions in North America as both French and British imperial officials and colonists sought to extend each country’s sphere of influence in frontier regions.  In the early 1750s, France’s expansion into the Ohio River valley repeatedly brought it into conflict with the claims of the British colonies, especially Virginia. During 1754 and 1755, the French defeated in quick succession the young George Washington, Gen. Edward Braddock, and Braddock’s successor, Governor William Shirley of Massachusetts.  In 1756 the British formally declared war (marking the official beginning of the Seven Years’ War). But initially they were on the losing side.Things changed in 1757 because William Pitt, the new British leader, saw the colonial conflicts as the key to building a vast British empire. Borrowing heavily to finance the war, he paid Prussia to fight in Europe and reimbursed the colonies for raising troops in North America. In July 1758, the British won their first great victory at Louisbourg, near the mouth of the St. Lawrence River. A month later, they took Fort Frontenac at the western end of the river. Then they closed in on Quebec, where Gen. James Wolfe won a spectacular victory on the Plains of Abraham, September 1759 (though both he and the French commander, the Marquis de Montcalm, were fatally wounded). With the fall of Montreal in September 1760, the French lost their last foothold in Canada.  France tried to come to peace agreement with Britain after these losses and to force this there was a Family Pact signed. But, Britain was in no mood to lose the advances it has made. Thus by the Family Pact, Spain joined France against England, and for the rest of the war Britain concentrated on seizing French and Spanish territories in other parts of the world. End to the war came with the Treaty of Paris (1763), the British received Canada from France and Florida from Spain, but permitted France to keep its West Indian sugar islands and gave Louisiana to Spain. The treaty strengthened the American colonies significantly by removing their European rivals to the north and south and opening the Mississippi Valley to westward expansion. ",
            "date": "Answered November 4, 2015",
            "views": "58",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajarshee Mukhopadhyay",
                    "user_href": "/profile/Rajarshee-Mukhopadhyay"
                },
                {
                    "user_id": "Emma Johnson",
                    "user_href": "/profile/Emma-Johnson-775"
                }
            ]
        }
    ]
}