{
    "title": "How reliable are archaeological dating technologies? - Quora",
    "tags": [
        "Archaeology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ernest W. Adams",
                "href": "/profile/Ernest-W-Adams"
            },
            "answer_text": "Very, very, if it's tree-ring dating. We can date a piece of wood to an exact year by comparing the rings in it from the rings of trees of a known age from the same region. The width of each ring records the amount of growth in a year, and that reliably correlates with the weather. All the trees from the same region will show the same pattern. Radiocarbon dating works on samples up to about 50,000 years old. It's accurate to a few decades either way, but the bigger the sample and the longer you measure, the better the results. My father could determine the age of a provenience in medieval Nubia to +/- 50 years based on the broken pottery found in it. Pottery styles changed back then just as they do now. ",
            "date": "Answered March 6, 2020",
            "views": "315",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roberto Eduardo",
                    "user_href": "/profile/Roberto-Eduardo-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Michael-Adu-25"
                },
                {
                    "user_id": "Jeff Gerckens",
                    "user_href": "/profile/Jeff-Gerckens"
                },
                {
                    "user_id": "Ulf Osterberg",
                    "user_href": "/profile/Ulf-Osterberg"
                },
                {
                    "user_id": "Jim Gibson",
                    "user_href": "/profile/Jim-Gibson-5"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Nigel Titley",
                    "user_href": "/profile/Nigel-Titley"
                },
                {
                    "user_id": "Scott Lumry",
                    "user_href": "/profile/Scott-Lumry"
                },
                {
                    "user_id": "Alexis Arblaster",
                    "user_href": "/profile/Alexis-Arblaster"
                },
                {
                    "user_id": "M Markus Harrison",
                    "user_href": "/profile/M-Markus-Harrison"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Gumerman III",
                "href": "/profile/George-Gumerman-III"
            },
            "answer_text": "Depends on the method. Dendrochonology - tree ring dating - can sometimes even date to within a season of a year. C 14 often within 25 - 50 years. Then there are other types of dating that fall within these ranges. For example, in the U S Southwest certain pottery styles have been dated as occurring within a 50 year period using tree rings. So when these pottery styles show up at a nearby site u can date it to within 50 years even if u don’t have tree ring dates. ",
            "date": "Answered March 6, 2020",
            "views": "32",
            "upvotes": "0"
        }
    ]
}