{
    "title": "How did USA became more powerful than UK? - Quora",
    "tags": [
        "United States-United Kingdom Relations",
        "Power (society)",
        "The United Kingdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tristan Bowen",
                "href": "/profile/Tristan-Bowen"
            },
            "answer_text": "There is a long and short answer to this question, as there are with many questions. In short, the U.S.A. circa 1930, was a weak power due to The Great Depression. They boosted their economy significantly by expanding their industry to support their total war plan for W.W.II. This launched them into a position to convert those factories that we're churning out tanks into Coca-Cola Plants, etc. In Britain, we have a better off, healthier economy, but their continued involvement in WW II slowly ground on them, with constant bombings, aimed at their industrial centers, making it difficult for them to continue supplying jobs at the rate they had prior. This is a very simplified answer. if we compound in this, and take into account the MIC (military-industrial complex), something America has used to its advantage for years now, or the difference in the size of these two nations, we can see the overwhelming differences that arise. And when we take into account the loss of Britains many annexed (and I use that term in the loosest of senses), nations, Britains sovereign territory decreases immensely. With this, comes a significant increase in reliance on foreign materials, which wasnt a problem for the U.S.A, as their large size provided vast tracts of resources to enable a vast expansion of its industry, which, through it's later interactions around the globe, led to the U.S.A becoming the world power we know it as today. ",
            "date": "Answered May 24, 2016",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shailen Patel",
                    "user_href": "/profile/Shailen-Patel-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sudan Rijal",
                "href": "/profile/Sudan-Rijal"
            },
            "answer_text": "Usa and uk In my opinion usa become powerful than uk beacuse of many reasons . Usa is the largest economy in the world and it is the richest country in the world . Usa (united states of america) has high military strenght and power . It is the most powerful country in the world because of it richness. In the year usa pay 772 billion for it military to be increased .But uk pay only 62 billion which is very low than usa . Usa become powerful than uk in world war 1 because in that period france was very powerful than other countries and in world war 1 noone can beat france but america establish friend ship with france in that case maerica can know the technique of how they make bombs and other things . And many yrs world war 1 was happening sudeen america was incresing the milatary and it has enough power to stop the war between countries in ww1 . And throughthat america stop the war and all the country were afraid and america become the most powerful country in the worlld.. ",
            "date": "Answered February 27, 2017",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ajijola Olalekan",
                    "user_href": "/profile/Ajijola-Olalekan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aman Anghaa",
                "href": "/profile/Aman-Anghaa"
            },
            "answer_text": "USA build up her foundation after she got her independence from the imperial control. It is said that countries who took part during the WW-1 and WW-II had great impact resulting in economic crisis, social problems, political instability and other issued problems making the Nation weaker. Thus, during the era of WW, the US didn't took part in the competition. Moreover, she loaned many nations who needed help during the war in terms of financial aids, producing weapons etc. The wealth and control of the Great Britain loses its credibility as she was too busy indulging in world War. All countries under her control got independence and the Royal treasury exhausted as the result of the world war. Therefore, the impact of the world war made the UK less important. It is noticed that the USA was fox during the era of the world war. She didn't took part in the war except for the revenge against the attack over the Pearl Harbour by the Japanese. All the loans taken by the countries during the World War had to give it back to the US. Thus it made huge profit in the long run. ",
            "date": "Answered May 28, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shubham Bisht",
                    "user_href": "/profile/Shubham-Bisht-101"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Awuku",
                "href": "/profile/Christopher-Awuku-1"
            },
            "answer_text": "The USA is physically larger, with more natural resources. Once the USA defeated the CSA, and major westward movements happened, it was inevitable that the USA would have become richer. And after WWII, it was primed to be the superpower, as Britain was bankrupt, and about to give up its Empire. ",
            "date": "Answered November 27, 2016",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sameer Iyer",
                    "user_href": "/profile/Sameer-Iyer-5"
                }
            ]
        }
    ]
}