{
    "title": "How would people who live in Tibet or have visited Tibet recently, describe what Tibet is like today? - Quora",
    "tags": [
        "Tibetan Culture",
        "COT (Chinese Occupied Tibet)",
        "Visiting and Travel in Tibet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dhondrup Dorje",
                "href": "/profile/Dhondrup-Dorje"
            },
            "answer_text": "Tibet is a police state devoid of human rights, centered on sinicizing its civilians by any means necessary. To understand why China always needs to keep a soldier’s boot stamped on a Tibetan face, you need to see the history of the Chinese occupation in Tibet with all its grisly details. Simply looking at the present state is to ignore Tibet as a whole. Soon after winning the civil war with the Republic of China, the People’s Republic of China made an unprovoked invasion of independent Tibet in 1950 and quickly overwhelmed the small Tibetan army in the Battle of Chamdho. The Chinese promised cultural preservation, autonomy, and the retaining of the liberties and welfare for the people. This was all outlined the 17 point agreement that China voluntold Tibet to sign, or further face military violence on its civilian populace. However, China would go on to culturally rape Tibet in the 1960s during the Chinese cultural revolution. Tibetan monasteries were looted, burned, bombed, and pillaged, and the thousands of monks and nuns across Tibet were forced to renounce religion and often marry and have children to prove they had renounced their monastic vows of celibacy, all due to Mao Zedong’s campaigns to modernize his empire. Nuns and lay women were often raped by Chinese soldiers. Any people or group deemed as “rebels” or “aristocrat sympathizers” were massacred. In the Golog region, in the north east of historical Tibet, the population was cut down to half its original number through starvations and massacres. The bodies were dumped in mass graves and family members of the dead were forced to dance on the corpses before being gunned down themselves. Jamyang Norbu, a Tibetan writer, recounts many of the abhorrent crimes the Chinese have done to the Tibetan citizens during the occupation in his article “March Winds”, which I highly encourage you to read.  Before and after photos of Gandhen Monastery. During the Cultural Revolution, the entire monastery complex, with all its centers for worship and living areas for the monks was almost entirely wiped out. Buddha statues and Buddhist scriptures and texts were burned and destroyed en mass. It is only one example of the nearly 7,000 monasteries that were almost all razed to the ground. It’s hard to imagine the depth of the cultural Tibet went through, but the best analogy I can liken it to if the Kaaba in Mecca was bombed over and over again hundreds of times by the United States. The Kaaba is the holiest structure in Islam and you can imagine that the Muslims across the world would not forgive America so easily, to put it in slight. This is not taking into account how the Chinese continue to demonize His Holiness the Dalai Lama, who has been the spiritual leader of Tibet for centuries. If you governed a country of Catholics, do you think you’d be well liked by your people if you called the Pope a “wolf in monk’s clothes” and his followers the “scum of Christianity”? That is what China actively calls the Dalai Lama and his Tibetan followers, who actively seek dialogue with the Beijing despots. This history of killings, cultural genocide, rape, and violence is unforgettable to a people still occupied by the same foreign entity. To this day China actively tries to erode the distinct culture in Tibet, in order to one day take away the source of Tibetan Nationalism. One of the paths they take is to target the next generation. As we speak, the Chinese are robbing the Tibetan youth of learning their own native language by enforcing Mandarin as the main curriculum for Tibetan schools. Tibetan is only provided as a peripheral class for grade school children. Many people have come forward to protest, petition, and argue against this move. Tashi Wangchuk is one such example of trying to protest Chinese laws against Tibetans learning their own language. Wangchuk traveled to Beijing to try to make an appeal to the courts in favor of a Tibetan curriculum. He was jailed for having spoken out and was given a 5 year sentence for separatism.  Tashi Wangchuk shown above. Another example of Chinese attempts at breaking Tibetan culture in recent times is the destruction of Larung Gar, another great monastic complex. This nunnery serves as an academic center for Buddhist study, and is one of the largest in the world. This great population size of religious women is hard to control and monitor, however, and the Chinese government enforced a destruction of many of the nuns’ living quarters, kicking out hundreds of nuns and leaving them no where to go. This is all in the pursuit of reducing the population.  Hundreds forced to leave Larung Gar, others face threats and intimidation Clearly, the CCP (Chinese Communist Party, AKA the Chinese government) is unhinged and beyond delirious about even the most subtle signs of Tibetan nationalism. They beyond afraid that Tibetans will revolt or uprise again. Tibet is not as stable as the Chinese pawns on the internet and in Quora demand you believe. And China is right to be afraid, in 2008 the Olympics were held in China, and a new opportunity to show the world how bad life was for Tibetans came. Riots blew up and there was fighting in the streets of the capital city of Lhasa. Chinese governmental establishments were main targets. It has only been 11 years since then and the government fears the instability of the region. Since 2009, over 150 Tibetans have self immolated, or set themselves on fire, to protest the government in the same way of the famous Thích Quảng Đức, the Viet Buddhist monk who set himself on fire to protest the South Vietnamese government’s persecution of Buddhists. Unlike him, however, more and more Tibetan self immolaters trying to send a message to Beijing have sadly been taking more drastic measures, doing things like drinking gasoline instead of pouring it on their bodies, or wrapping themselves in barbed wire in order to deter or impede the police from putting them out and arresting them.  A map of self immolations in Tibet, not up to date. The Olympics are being held in 2022 again in Beijing. If Tibet was so happy, why do people riot when more publicity is shown on China? Do be on the look out in winter 2022 for any news from Tibet, it won’t be all sunshine and rainbows like the Wu Maos wish you’d believe. Even today, China fears the Tibetans and therefore keeps a huge military presence everywhere to stop any uprisings that could surface. These fascist Chinese policies only create more suffering, AKA fuel for more instability. Simply traveling to Tibet doesn’t mean anything. Traveling to Tibet as a tourist and “seeing how it is” means you walk around a city constantly in the presence of a Chinese tour guide in the midst of the Chinese police. You are never free to talk with a Tibetan one on one, as it would give the opportunity to exchange “unhealthy thoughts” like independence or the return of His Holiness.  That’s right, Tibet has always belonged to China. The Deli Llama is a separatist American puppet on the CIA payroll. Say otherwise and you’re a brainwashed Westerner who knows nothing about the great Chinese motherland and needs to mind their own business, or you’re a Dumb-Lier Lama aristocrat Tibetan who wants to institutionalize slavery in Tibet. War is peace, freedom is slavery, ignorance is strength. Big Brother Mao is ALWAYS watching. ",
            "date": "Answered June 23, 2019",
            "views": "718",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tufshin Dash",
                    "user_href": "/profile/Tufshin-Dash"
                },
                {
                    "user_id": "Tenzin Cramper",
                    "user_href": "/profile/Tenzin-Cramper"
                },
                {
                    "user_id": "Vincent Tang",
                    "user_href": "/profile/Vincent-Tang-34"
                },
                {
                    "user_id": "Wes Hansen",
                    "user_href": "/profile/Wes-Hansen-1"
                },
                {
                    "user_id": "Tsering Dhondup",
                    "user_href": "/profile/Tsering-Dhondup-26"
                },
                {
                    "user_id": "Balthazar Sforza-Krasinski",
                    "user_href": "/profile/Balthazar-Sforza-Krasinski"
                },
                {
                    "user_id": "R D Miller",
                    "user_href": "/profile/R-D-Miller"
                },
                {
                    "user_id": "Alan Chiu",
                    "user_href": "/profile/Alan-Chiu-10"
                },
                {
                    "user_id": "Bhu Tenzin",
                    "user_href": "/profile/Bhu-Tenzin-2"
                },
                {
                    "user_id": "Vir Gupta",
                    "user_href": "/profile/Vir-Gupta-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Balthazar Sforza-Krasinski",
                "href": "/profile/Balthazar-Sforza-Krasinski"
            },
            "answer_text": "According to their experiences - many have said it has been reduced to nothing more than a theme park for gawping tourist morons who have no interest in anything other than confirming their own biases. Knowing this about Tibet - I don’t really think I’d want to go - as well as poor security, bad weather conditions, crime, poverty, dereliction etc. Bhutan or Nepal appeal to me more. ",
            "date": "Answered June 24, 2019",
            "views": "85",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dhondrup Dorje",
                    "user_href": "/profile/Dhondrup-Dorje"
                }
            ]
        }
    ]
}