{
    "title": "How can one start a bakery? - Quora",
    "tags": [
        "Pastries",
        "Bakeries",
        "Culinary Arts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Hurewitz",
                "href": "/profile/Matthew-Hurewitz"
            },
            "answer_text": "Figure out who buys from bakeries. Who buys from bakeries: commuters, stay-at-home parents, retirees, restaurants, etc. Figure out if they’ll buy from you. One by one, figure out why they buy and if they’ll buy from you. If not, figure out how to make your offering so compelling that they’ll buy. Start selling. Make samples, pound pavement and sell. Setup a stand. Sell via social media. Sell to small businesses. Just bring samples and sell order. Then Bake. I’m not talking about renting a space, leasing commercial ovens, staffing, etc. Use your kitchen, your neighbors and friends’ kitchens, buy from wherever you can get stuff NOW and start baking. Start Learning. Now that you know how to acquire customers, the amount of work involved, what you can charge and what things cost, you have a baseline. You know what your costs are, what you’d need to scale, and if you have the customers to support that growth (and if not, how to acquire them). That’s a great baseline. Estimate. Make informed decisions about how changing certain parameters impact your business. How does increasing production affect fixed and variable costs? How does foot traffic in a location affect sales (do comps against competitors)? How can you acquire new customers (paid / unpaid)? How much can you afford to invest? Make a plan. You can change it often and you don’t even have to write it down. But, you should always know what your next move is and have line of sight into your next 5–10 moves. Get Started. Good luck! ",
            "date": "Answered November 30, 2017",
            "views": "27",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nadira",
                    "user_href": "/profile/Nadira-22"
                },
                {
                    "user_id": "Yatin Sharma",
                    "user_href": "/profile/Yatin-Sharma-74"
                },
                {
                    "user_id": "Ekta Singh",
                    "user_href": "/profile/Ekta-Singh-879"
                },
                {
                    "user_id": "Desy Chairani",
                    "user_href": "/profile/Desy-Chairani-1"
                },
                {
                    "user_id": "Patricia Everard",
                    "user_href": "/profile/Patricia-Everard"
                },
                {
                    "user_id": "Akhil Les",
                    "user_href": "/profile/Akhil-Les"
                },
                {
                    "user_id": "Jason Huang",
                    "user_href": "/profile/Jason-Huang-121"
                },
                {
                    "user_id": "Bharat Goreja",
                    "user_href": "/profile/Bharat-Goreja"
                },
                {
                    "user_id": "John Hornung",
                    "user_href": "/profile/John-Hornung"
                },
                {
                    "user_id": "Venkat Mallela",
                    "user_href": "/profile/Venkat-Mallela-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Agarwal",
                "href": "/profile/Akash-Agarwal-355"
            },
            "answer_text": "BAKERY BUSINESS There are some common elements of business like Raw materialMachineryLabourFundMarketingOutputRaw material = I think in a bakery like business ,the raw material is not a big issue . Raw material is basically a flour ,oil etc which can be easily purchased from a wholesale supplier in cheap rates .Machinery= you have to buy the furnace or other machinesLabour= you can contact to some already working labour's in some other bakery to get the labour for your bakery.Fund= It is a essential need . You should have fund to start Any kind of business .Marketing = If I talk about the general person starting the bakery, then they perform all the above task very efficiently . They falls in this task because they thinks that this task is useless and not required so they do not give priority to it .Now in bakery , the things you can do for marketing is that you can open a bakery shop itself of your baked items in your bakery . How the general public get to know your product I realises the normal baked biscuit packet that is available in the market is of 55 /- So it seems to be some expensive . Now what you have to do is that place your product on general merchant shop with the rates as cheap as possible and give the shop keeper the commission more than anyone so that the shop keeper will mention your product in front of every customer he attended so as to sell your product and to get the high commission . Now after 1–2 years ,the general public will be aware of your product and have faith in your quality . The time comes when you can increase some rates and earn a high profit and increase your bakery quantity and expand your business in the other cities or other states also . Thank you so much for reading it… Plz upvote if you like it ",
            "date": "Answered January 31, 2017",
            "views": "15",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yatin Sharma",
                    "user_href": "/profile/Yatin-Sharma-74"
                },
                {
                    "user_id": "Hari Kishan Chandak",
                    "user_href": "/profile/Hari-Kishan-Chandak"
                },
                {
                    "user_id": "Vishal Kakkar",
                    "user_href": "/profile/Vishal-Kakkar-48"
                },
                {
                    "user_id": "Darien Tan",
                    "user_href": "/profile/Darien-Tan-5"
                },
                {
                    "user_id": "Patricia Everard",
                    "user_href": "/profile/Patricia-Everard"
                },
                {
                    "user_id": "Jason Huang",
                    "user_href": "/profile/Jason-Huang-121"
                },
                {
                    "user_id": "Venkat Mallela",
                    "user_href": "/profile/Venkat-Mallela-9"
                },
                {
                    "user_id": "Sandeep Ahlawat",
                    "user_href": "/profile/Sandeep-Ahlawat-31"
                },
                {
                    "user_id": "Vishnu Vardhan",
                    "user_href": "/profile/Vishnu-Vardhan-1312"
                }
            ]
        }
    ]
}