{
    "title": "How did world war 2 shape our world today? - Quora",
    "tags": [
        "World War II",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Schmidt",
                "href": "/profile/Chris-Schmidt-28"
            },
            "answer_text": "Decolonialism occured due to the weakening of the European colonial powers. The United Nations were formed, and learned the lessons of the League of Nations folly. The nuclear age was ushered in after the Americans detonated 3 nuclear weapons, and for the first time since the human population was below 10,000 people in prehistory, mankind was capable of being wiped off the earth. The rise of communism in eastern Europe, the Balkans, Latin America, Africa, China and Korea. America emerged from isolation and became the primary player in world affairs. The rise and fall of the Berlin Wall, and the Korean split. The decline of the traditional powers(France, Germany, UK) of Europe, and the rise of overwhelming Soviet and American supremacy. The European Union's creation, as well as its predecessor organizations, created among powers who had been fighting each other for a millennium. The advance in technology such as radar, weapons, jet engines, nuclear power, rockets and missiles, and tons of others. The beginning of the cold war between the communist Warsaw Pact states, and the capitalist NATO and non NATO Allies. Germany becoming a peaceful country, after centuries of being on the cutting edge in warfare technology and doctrine. Japan formally renouncing war in its constitution, the only country to do so. Vast systems of alliances not seen since the dawn of World War 1. The creation of the non aligned movement. America landing on the moon with help from former Nazi rocket scientists. A great wave of immigration and refuges to western Europe and North America. The creation of Israel as a Jewish state. The eradication of fascism. The slower eradication of communism(still ongoing) The US Navy replacing the Royal Navy as the dominant seafaring power on the planet. The rise of Pax Americana. The revolution of warfare doctrine on land, sea, and air. This list can go on and on for days. ",
            "date": "Updated January 5, 2017",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Baker",
                    "user_href": "/profile/Daniel-Baker-37"
                },
                {
                    "user_id": "Anthony Saab",
                    "user_href": "/profile/Anthony-Saab-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Russo",
                "href": "/profile/Peter-Russo-24"
            },
            "answer_text": "Politically, WWII shaped the world’s prioritising political structures. In fact, WWII was rich in diverse structures, such as: Democratic republics, authoritarian governments and fascist governments. After the result of WWII, the world was taught how fascist governments will always crumble, despite its support or hype. ",
            "date": "Answered December 25, 2016",
            "views": "267",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Franklin",
                "href": "/profile/David-Franklin-45"
            },
            "answer_text": "For the United States, it allowed all of those men and women in the military to go to college on the GI Bill and get a college education. The economic boost from all these men getting higher paying degrees transformed this country. The doctors, lawyers, and other professional degrees raised the standard of living as well as allowed the government to recoup the initial investment. ",
            "date": "Answered December 25, 2016",
            "views": "298",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Baker",
                    "user_href": "/profile/Daniel-Baker-37"
                }
            ]
        }
    ]
}