{
    "title": "How did Japan benefit from the Treaty of Kanagawa? - Quora",
    "tags": [
        "Treaties",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Itzy Uchino",
                "href": "/profile/Itzy-Uchino"
            },
            "answer_text": "I don’t profess to be an expert on the treaty of Kanagawa. It did open up Japan from self induced lockdown , SAKOKU, NO FOREIGN CONTACT , to the open foreign trade with the US. It ensured the US, coal refueling ports in Japan ,safety of the American whalers and extraterritoriality in some cities. For the Japanese no immediate benefit was achieved in having done so as it was forced by the US. However it caused the severe conflicts with arms pitting Tokugawa samurai government vs the progressive antigovernment faction. But the big picture is that the treaty of Kanagawa was the moment Japan turned to modern, militarily aggressive Japan culminating WW2. The benefit of modern Japan with aggressive nature is debatable but the Kanagawa treaty was the beginning of that. ",
            "date": "Answered October 6, 2020",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Christopher",
                    "user_href": "/profile/David-Christopher-171"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Christopher",
                "href": "/profile/David-Christopher-171"
            },
            "answer_text": "I don't think anyone benefited from it. Japan was forced to open their nation to foriegn influence and domination. Other nations were exposed to a hungry, aggressive, and pissed off Japan. They opened a dangerous and deadly Pandora's box. Looking at it now. Nobody benefited from this treaty. ",
            "date": "Answered October 7, 2020",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        }
    ]
}