{
    "title": "How strong was the Soviet Union during the 1930s? - Quora",
    "tags": [
        "1930s",
        "History of USSR",
        "Soviet Union",
        "Russia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Igor Markov",
                "href": "/profile/Igor-Markov"
            },
            "answer_text": "In the 1930s, the Soviet economy was comparable to the German economy in size — smaller than the Chinese and the American economies, but somewhat larger than the British economy. However, its strengh depended on raw materials,energy production, andnascent (very inefficient) heavy industry.It was considerably weaker than Western economies in terms of technology, but catching up quickly. The Soviet military was very strong on paper and growing — by 1940, it had more tanks and airplanes than the Wehrmacht. However, it had profound deficiencies in the highest and mid-level command structures, both in terms of outdated theories of war and in terms of who got promoted. Some of the most creative generals were killed by Stalin because they were considered politically unreliable. In many ways, Soviet propaganda was harmful to the defense effort because the Soviet military and the Soviet way of life were viewed as far superior to everything else, and any armed conflict was expected to be a walk in the park. Therefore, the 1939 Winter war with the much smaller Finland came as a shock — the USSR failed to achieve initial objectives, suffered heavy casualties, and ended up annexing only a small fraction of Finnish territory. In the Spring of 1941, Stalin was apparently planning a short victorious war of aggression against Germany — troops were streaming westward, tanks and airplanes were based within 30km of the border, etc. No in-depth defense was planned. Hitler convinced Stalin he was not going to attack, and then exploited this weakness by attacking swiftly with a very large force (3M troops) across the entire frontline in June 1941. The Wehrmacht destroyed large numbers of Soviet planes on the ground and captured more tanks than it deployed initially. This was accomplished through the use of novel tactics, especially close air support (developed during the Spanish war in 1936),positioning officers close to the troops (which resulted in higher casualties among officers), andstrategic use of heavy armor to cut Soviet supply lines to surround entire armies.Neither Germany nor the USSR had heavy bombers in the 1930s or early 1940s. In 1940, the German military pioneered massive use of metamphetamines to keep soldiers alert for days and press on with offensives. This effectively multiplied troop strength without increasing their footprint. Despite the advantaged enjoyed by the German military, the Blitzkrieg could only be sustained for about a year due to limited supplies of raw materials and the reliance on horse-drawn supply lines (horses grazed on their own, but also died and could not be mass-produced). Also, Germany was much less successful in a defensive role. In contrast, the USSR had a massive advantage in population size (with high literacy), strategic depth of its territory, and natural resources. This latent strenghth was multiplied by fast ramp-up of defense R&D, by help from the US through lend-lease, and through an economic blockade of Germany by the British and American Navies. ",
            "date": "Answered October 2, 2017",
            "views": "37",
            "upvotes": " View 66 Upvoters",
            "upvoters": [
                {
                    "user_id": "Caleb Kim",
                    "user_href": "/profile/Caleb-Kim-18"
                },
                {
                    "user_id": "Jaroslav Liska",
                    "user_href": "/profile/Jaroslav-Liska"
                },
                {
                    "user_id": "Arūnas Aleksandravičius",
                    "user_href": "/profile/Arūnas-Aleksandravičius"
                },
                {
                    "user_id": "Hajan Farhan",
                    "user_href": "/profile/Hajan-Farhan"
                },
                {
                    "user_id": "Slav Kachaev",
                    "user_href": "/profile/Slav-Kachaev"
                },
                {
                    "user_id": "Nidhi Singhal",
                    "user_href": "/profile/Nidhi-Singhal-32"
                },
                {
                    "user_id": "Ishan Hegde",
                    "user_href": "/profile/Ishan-Hegde-1"
                },
                {
                    "user_id": "Chris Maddock",
                    "user_href": "/profile/Chris-Maddock-4"
                },
                {
                    "user_id": "Daniel Ptashny",
                    "user_href": "/profile/Daniel-Ptashny-1"
                },
                {
                    "user_id": "Jonathan Crichlow",
                    "user_href": "/profile/Jonathan-Crichlow-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "David M Browne",
                "href": "/profile/David-M-Browne-1"
            },
            "answer_text": "It was in a weakened state. Stalin and the communist government were still consolidating power. The 30s consisted of the Great Terror, which included the purges of the military. It was also the enforced collectivization of agriculture, and the anti Kulak campaign which resulted in mass genocide in the Ukraine. The USSR had suffered horribly from WWI and the subsequent Russian Civil War, and was recovering from that wreckage. One of the reasons from the Soviet point of view for the Ribbentrop Molotov pact in 1939 was to buy time for the USSR to continue to strengthen itself. ",
            "date": "Answered October 2, 2017",
            "views": "276",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Douglas L Acker",
                    "user_href": "/profile/Douglas-L-Acker"
                },
                {
                    "user_id": "Wladik Derevianko",
                    "user_href": "/profile/Wladik-Derevianko"
                }
            ]
        }
    ]
}