{
    "title": "How much of British cultural heritage is left in America? - Quora",
    "tags": [
        "British Influence",
        "Culture of Great Britain",
        "Great Britain",
        "Culture of the United States of America",
        "Culture (social science)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Exstein",
                "href": "/profile/Ted-Exstein"
            },
            "answer_text": "First of all let's define America - that is more ambiguous than it appears at first glance - there is South America, Central America, and North America.  South America tends to have strong affinity with Spain and Portugal.  The same could be said of Central America; however, Belize was a former British Colony and its official language is still English. North America includes Mexico, the United States, and Canada.  Of course, only people from the United States identify themselves as \"Americans\" first and foremost.  So, for argument's sake, let's stick to the United States since Canada is still part of the UK and has a government system deeply embedded in the British Parliament model, still considers the British monarchy their monarchy, etc.  - Which answers that aspect of the question. The United Sates continues to feel a strong affinity for the British as well.  When most English speaking Americans identify a generic \"old country\" generally it is Merry Olde England - as opposed to any other country - except wherever a specific person's family emigrated from.  I know lots of people who are completely entranced with anything that the British Royal family does. Naturally, American laws are embedded in English models - many of the basic tenents of American freedoms can be - and are - traced to the Featured Document: The Magna Carta - you can one of the four original copies in the National Archives and Records Administration in Washington, DC. The obvious relationship is language - while there are pronounciation and spelling differences (words too:  I lived in an apartment in New York City, but people live in flats in London; cargo is delivered by truck in the United States that have hoods and trunks, but the lorries in the UK have bonnets and boots, for example.) Fashion is still in large defined by standards laid down by the British - that covers anything from home furnishings, automobiles, to clothing - although the latter seems to be shifting to the British having a lot of American influence in how they dress informally - baseball caps and jeans have become the ubiquitous American exports.  But dressing for work - suits, ties, etc. are definitely pulled from well-established British standards. Banking and finance are also based on the British models - from the earliest days of Wall Street and the 1 Month Libor 3 Rate 6 Month Rates Bond Index Current One 90 day 30 Day still dominates the international Exchange rates.  The the definition of bicameral legislature of the American Congress is based on the British house of Lords and the House of Commons - so it is ingrained in American politics as well. ",
            "date": "Answered May 18, 2015",
            "views": "15",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Thomas Smith",
                    "user_href": "/profile/James-Thomas-Smith"
                },
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Tudor Sfătosu",
                    "user_href": "/profile/Tudor-Sfătosu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhay Saini",
                "href": "/profile/Abhay-Saini-1"
            },
            "answer_text": "There are 2 major pockets in the United States where you would find isolated extremities of British culture than the mixed European culture of the rest of the states. The First is the New England area, with it getting more British as you go farther North-East (Vermont and New Hampshire are almost wholly English or Scotch Irish) while Massachusetts is as much English as a “cosmopolitan” state can get.) The Second is the South, with highest concentrations in the North-Carolina-Virginia areas and some rural areas of Texas. These areas have the Southern, Norman-Cavalier ancestry of the Southern English aristocracy. Apart from that, the Midwest is populated by Continental Germanics and Eastern Europeans, who came here for better agricultural prospects. East Coast is full of Irish/Italian catholic immigrants fleeing poverty and persecution. West Coast has British, Chinese and Hispanic mixed heritage with most everything replaced by Hollywood and beach themes. There is a growing Asian (Indian, Taiwanese and Chinese) presence in the Silicon Valley. All in All, America took the best parts of English culture (law and mercantilism) and left some of the harsh and cruel parts out, like the classism prevalent in Urban England, the harsh Victorian discipline and capital punishment, the brutal treatment of colonial subjects etc. ",
            "date": "Answered November 9, 2017",
            "views": "31",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pam Ryan",
                    "user_href": "/profile/Pam-Ryan-27"
                },
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Tudor Sfătosu",
                    "user_href": "/profile/Tudor-Sfătosu"
                },
                {
                    "user_id": "Abhay Saini",
                    "user_href": "/profile/Abhay-Saini-14"
                },
                {
                    "user_id": "Hans Konrad",
                    "user_href": "/profile/Hans-Konrad-2"
                },
                {
                    "user_id": "Everett Mechem",
                    "user_href": "/profile/Everett-Mechem"
                }
            ]
        }
    ]
}