{
    "title": "How to Analyse primary source history - Quora",
    "tags": [
        "Primary Sources",
        "Sources"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Coomber",
                "href": "/profile/Rob-Coomber"
            },
            "answer_text": "Simple. Read the two manuscripts that describe the history and genealogy of Mankind since Adam. You will see family names by generation. You will see the laws provided and the punishment for not following those laws. You will read of the punishments delivered and great conquests with supernatural assistance when law was followed. We are told not to judge others. History, invention, science and offering to the building of the modern World is precisely in aligned to Genesis 12 verse 3. Then we had the historical sharing of that law 2000 years ago with all nations. That went according to what was written 2000 years ago. And what was written is taking shape today. We are taught to prepare only our own minds for eternity. My good friend Matthew wrote of his conversation with the Prince of Peace, 15 “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves. 16 By their fruit you will recognize them.” Then he asked a question and this is what he was told; Matthew. ““‘Love the Lord your God with all your heart and with all your soul and with all your mind.’ 38 This is the first and greatest commandment. 39 And the second is like it: ‘Love your neighbor as yourself. 40 All the Law and the Prophets hang on these two commandments.” My good friend, John transcribed his conversation with the Prince of Peace who warned us “29 I have told you now before it happens, so that when it does happen you will believe. 30 I will not say much more to you, for the prince of this world is coming. He has no hold over me, 31 but he comes so that the world may learn that I love the Father and do exactly what my Father has commanded me.” And so, a few centuries later we have the changed law that seeks to rule Earth, not prepare us for an Earth “as it is in Heaven”. Law that teaches deception, hate and humiliation of all other people who refuse to hate. Antichrist law. There is no more accurate source of history than these three scripts as they are all of supernatural inspiration. ",
            "date": "Answered May 12, 2020",
            "views": "64",
            "upvotes": "0"
        }
    ]
}