{
    "title": "How did people learn languages in the middle ages? - Quora",
    "tags": [
        "Middle Aged",
        "Middle Ages (era)",
        "History of Europe",
        "Learning Languages",
        "Learning New Things",
        "Europe",
        "Linguistics",
        "Learning",
        "Language"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mikalai Shydlouski",
                "href": "/profile/Mikalai-Shydlouski"
            },
            "answer_text": "Ability to learn languages is different for different people. Someone takes it quick and easy. On the other side is people who would never learn it. My own way to learn English being 30 yo is little bit different. Having linguistics background and speak 3 languages before I know that any language is a system and learning how it works and how to use it led to that I can still speak better than understand (speaking I use words I know, while listening I can miss some words I don’t know). For most people, who don’t know language as a system, understanding is easier than speaking. I used English grammar books to understand principles of language. But best way is to work and live (I been wised to get American girlfriend to get it quick, but didn’t follow this wise :)) with Americans. Watching TV with subtitles (it’s shame, but I still watch most american movies in my native language), karaoke (yes, I think it helped), reading books (you check almost every word’s meaning at first page and just read it at last one). But everyday using language at work or life - best way to learn it. Don’t feel shame if you speak with mistakes. Just speak!!! And remember, it’s impossible to learn language quick! It takes time until it would get into you and may take few years or even rest of your life. P.S. Google Translate is always open on my PC and smartphone! :) ",
            "date": "Answered September 12, 2019",
            "views": "313",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zahrah Murdock",
                "href": "/profile/Zahrah-Murdock"
            },
            "answer_text": "Simple: exposure. You learned the language your parents spoke. Sometimes you learned enough of another language through exposure due to things like trade. You might pick up enough to haggle over the price of something. Or perhaps large scale newcomers to your country were living closer and closer and you needed to be able to talk business with them or you even attended the same markets. If you were very rich, you had a tutor to teach you the important languages of the day, like Latin, and maybe French (if you were, say, English during the French rule) If you were born at the right time and in the right circumstances, you might have been educated in a monastery, or gone to a grammar school or other local school-type institution. The grammar you were being taught, incidentally, was Latin, not your country’s native language. ",
            "date": "Answered September 14, 2019",
            "views": "175",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jon Kenneth Guardo",
                    "user_href": "/profile/Jon-Kenneth-Guardo-1"
                },
                {
                    "user_id": "Louise Murray",
                    "user_href": "/profile/Louise-Murray-17"
                }
            ]
        }
    ]
}