{
    "title": "How was China divided into spheres of influence? - Quora",
    "tags": [
        "Li Hongzhang",
        "Sphere of Influence",
        "Empress Dowager Cixi (慈禧太后)",
        "Boxer Rebellion (拳亂/义和团运动)",
        "Kaiser Wilhelm II",
        "Manchuria",
        "Great Qing Dynasty (清朝)",
        "History of China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Boyle",
                "href": "/profile/Joseph-Boyle"
            },
            "answer_text": "China was not divided into the spheres of influence depicted in French hypothetical maps and cartoons during the 1897–1901 partition and Boxer crisis. The Triple Intervention - Wikipedia had just blocked Japanese imperialism but then developed into a raging continental European imperialism, principally Germany and Russia but with France also a partner. Germany, in spite of its Kulturkampf - Wikipedia against German and Polish Catholics, adopted the longtime French tactic of deploying Catholic missionaries then demanding huge reparations after they were attacked, which had worked to facilitate colonial advance in Vietnam and elsewhere. German missionaries were attacked in the 1897 Juye Incident - Wikipedia and Kaiser Wilhelm II demanded dominance over Shandong, fulminating about a Yellow Peril - Wikipedia to Western civilization. The talk of a French sphere of influence in the two provinces bordering Vietnam (Guangxi and Yunnan) was supposed to parallel the German and Russian demands for whole provinces in the north and persuade France she was benefiting comparably. In fact little happened there and the French did almost nothing with the small leased port of Guangzhouwan - Wikipedia. France did complete a Kunming–Haiphong railway - Wikipedia in 1910 and although this was Kunming’s main transport outlet for a while, it did not leave any strong French influence on Yunnan. Talk of a Japanese sphere of influence in Fujian seemed to be based just on proximity to Taiwan. Italy also made a belated request to lease Sanmen Bay, which the Qing government flatly refused. The momentum towards partition was based on each power fearing the others would seize territory shutting it out, and on recent examples like the Scramble for Africa - Wikipedia from 1884 on. The American Open Door note stalled the momentum, it became more apparent that partition was a bad idea, and eventually the US announced all great powers had agreed even though they hadn’t actually responded. The 1900 Russian invasion of Manchuria - Wikipedia was the main example of actually establishing a sphere of influence consisting of whole province-sized territories rather than small port concessions, however it seesawed between Russian and Japanese domination several times over half a century, and arguably the conflicts over Manchuria and Korea led to the downfall of both Chinese and Russian empires, rearrangements of alliances, the World Wars, and the rise of totalitarian Communist and Fascist states and finally the Cold War not over until 1990. The Russian ability to hold Manchuria at least initially was aided by land continuity as well as the still only partially settled state of northern Manchuria allowing Harbin to be founded as a Russian city. The German and French colonial ventures were dependent on sea routes, and serious opposition from the Anglo-Americans would have made these difficult. The French media hypothetical partition maps showed the Yangtze Valley as the British sphere all the way up to Sichuan. Again, this needs to be examined critically. The British were the largest influence in Shanghai but not the only one. The Americans still would have opposed division into closed colonies, and the British had long supported the Qing state. Even if the other European empires had managed to obtain rule over some provinces, it is likely that the remainder would continue to be known as China with its own government and own ambitions to undo partition. ",
            "date": "Answered July 24, 2020",
            "views": "192",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Muhammad Bagoes Bachtiar",
                    "user_href": "/profile/Muhammad-Bagoes-Bachtiar"
                },
                {
                    "user_id": "George Tait Edwards",
                    "user_href": "/profile/George-Tait-Edwards"
                },
                {
                    "user_id": "Ben Jackson",
                    "user_href": "/profile/Ben-Jackson-431"
                }
            ]
        }
    ]
}