{
    "title": "How was it like to grow up in the 50s and 60s? - Quora",
    "tags": [
        "1950s",
        "1960s",
        "Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen Marie Shelton",
                "href": "/profile/Karen-Marie-Shelton"
            },
            "answer_text": "Hi Kelly, Thank you so much for your question. Growing up in the 50s and 60s, especially in the Midwest, where I grew up, was like living on an alien planet compared to current times. Black And White TV Only In The Mid-1950s I vaguely remember the first black and white television set my parents scrimped and saved to buy in 1955. One of the first TV programs we watched was My Little Margie starring Gale Storm as Margie Albright.  Image of Gale Storm As Margie Albright in My Little Margie - By NBC Television (eBay item photo front photo back) [Public domain], via Wikimedia Commons My parents used to bribe me with the show. When I was being “good” I was allowed to watch it on the TV. When I wasn’t being “good” I was punished by not being allowed to watch it. During the era of the 50s and 60s Lucille (Désirée) Ball Morton was very popular and was a pioneer in many of her TV shows. Baseball Games On The Radio I also remember my father spending time in the Summer sitting in his favorite chair in the living room listening to the St. Louis Cardinals baseball team on the radio. Baseball was a huge past time in those days. Going to a St. Louis Cardinals game was considered a special outing. Not only did I go to a lot of games with my family, when I started dating in my early teens, a Cardinals ballgame and their stadium was a hot destination for an evening or weekend date. Sitting On The Front Porch Drinking Iced Tea My parents were devout Catholics and we lived in a small all brick house with a big front porch right across the street from Our Lady of Sorrows parish church and school. When the weather was nice our entire family and the neighboring families would sit out on the porch drinking iced tea, made from Nestea, and watching the world go by. Sometimes we would have fresh fruit, mostly watermelon, or fresh baked (from scratch) Nestle Toll House chocolate chip cookies when my parents had discount coupons for the ingredients. There was no pizza at that point or other food delivery options. Everything was cooked at home and purchased mostly fresh from the corner grocery store. My parents had a small vegetable garden out back where they grew fresh tomatoes, rhubarb, cucumbers and zucchini to supplement our food supplies which sometimes were very limited depending upon the family income. Old Fashioned Wringer Washing Machines Eventually my father built a bedroom addition onto the house upstairs and the basement was partially finished for an additional spare bedroom. The basement had the old fashioned wringer washing machine (before a clothes dryer) and clothes were usually hung out on the clothing line outside in the sunshine. Our family was one of the last to be able to afford a modern washer and dryer. Large Freezer For Freezing Meat And Bread We also had a large upright freezer for storing all the meat, bread and other food items my parents would buy on sale and freeze for super budget meals. My mother canned in the basement every summer and we would eat canned green beans, squash and zucchini all winter long. She also made her own jams and jelly as well as ice cream and fruit pies she would freeze for a “rainy day”. When we finally got air conditioning to replace the big clunky window fans, it was the gigantic window units. Central air conditioning didn’t exist for many houses in our neighborhood until well into the 1960s. Life Centered Around Church, School And Work Life in the 50s for me revolved around school, church and doing chores around the house. As I’ve shared in the past, my mother had undiagnosed mental health issues which made our house chaotic and traumatic on the inside. From the outside looking in, we were a typical blue collar family. My father worked as a meat cutter for Kroger and my mother worked part time as a bookkeeper at an accessory manufacturer outside our home.  Image of Karen Marie Shelton (Right next to blackboard in the 2nd row on left) in Bishop Du Bourg Band Photo - 1967 - Photo from the private collection of Karen Marie Shelton - All Rights Reserved My mother was rare phenomen in our neighborhood where the vast majority of mothers did not work outside the home. The husbands were the primary breadwinners back in my neighborhood. A majority of my friends had stay-at-home moms who made them home cooked lunches and dinners. We had one car, a Chevy, and rarely went outside the home to eat, except at other family gatherings. Life Was Relatively Simple Compared To 2018 Life was relatively simple, at least as I remember it, in the 1950s and 60s. Even when I went to Bishop Du Bourg high school in the mid to late 60s, life was still relatively simple. I walked or took the bus the majority of places and my life was completely centered around school and work. I ran away from home when I was 15, which was in the mid-1960s. That was considered shocking and scandalous. My exit from the family home was the talk of the neighborhood gossips. The majority of my teachers in my Catholic grade school and high school were nuns and priests. Religion classes were the cornerstone of our curriculum along with band and physical education. Hidden Society Problems Although alcohol was common, recreational drugs were virtually unheard of, at least where I grew up. Teen pregnancies occurred, but the young woman who got pregnant out of wedlock was quietly removed from school and the general public view. Or she hastily got married in a very quiet ceremony and moved in with family. Back in the 1950s and 1960s, life was not perfect but it was different. Yes, there were school bullies, mean girls and abusive teachers. It didn’t seem like anything we have in 2019. School shootings? Not even imaginable back when I was growing up. Since there was no Internet, intelligent devices, computers of any kind (mainframes didn’t really become popular until the early 1960s), technology played almost no part of that era. Sock Hops, CYO Dances and Swim Parties Bands were big back during my high school years and we had sock hops, Catholic Youth Organization dances, picnics and swim parties, but almost no signs of tattoos, wildly hued hair or excessive piercings. Hair extensions were non-existent and even wigs were rare, except fun wigs at Halloween. I got my ears pierced when I was 16 and that was considered racy back in those days. A Different Family Unit Then In 2019 Don’t get me wrong. It wasn’t an idyllic existence. I struggled with a very abusive family of origin. I was also forced to start working as soon as I could get part time work raking leaves, cutting grass or babysitting. The family unit was just different then. At least in the Midwest where I grew up. Although my father, in private, could not manage my mother and her mental and emotional issues, from the outside looking in, our family seemed like the normal unit. Dark Family Secrets Except we weren’t normal in many way. There were lots of dark secrets in our family of five, but we conformed to the norm out in public and performed the expected behaviors for those times. People seemed to have better manners and in my opinion, lying was less prevalent than it is for 2019. Fake news? Maybe there was some, but certainly not like there is in 2019. It’s hard for me at least, to ever take anything at face value. I have to have multiple sources before I’ll believe someone or something. The World Has Changed In Many Ways Since The 1950s Looking back it’s amazing how much the world has changed over the past 50+ years. Many of the advantages we have in 2019 couldn’t even be imagined back in the 1950s and 1960s. Although I wouldn’t trade some of the technological advances we currently have in the world in 2019, I might trade for some of the old fashioned values, ethics, manners, truth,honesty, sincerity and kindness which seems to have gotten lost in current times. Do I have any regrets? Not at all, although I wish I could burn all the photos of me with the bad 60s hairstyles. Best wishes to all. ",
            "date": "Answered December 15, 2019",
            "views": "6",
            "upvotes": " View 103 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Taylor Lauson",
                    "user_href": "/profile/Taylor-Lauson"
                },
                {
                    "user_id": "Jimmy Gant",
                    "user_href": "/profile/Jimmy-Gant"
                },
                {
                    "user_id": "Diana Weissend",
                    "user_href": "/profile/Diana-Weissend"
                },
                {
                    "user_id": "Michael Wilder",
                    "user_href": "/profile/Michael-Wilder-18"
                },
                {
                    "user_id": "Claire Evans",
                    "user_href": "/profile/Claire-Evans-142"
                },
                {
                    "user_id": "Wajh Al Krim",
                    "user_href": "/profile/Wajh-Al-Krim"
                },
                {
                    "user_id": "John Orthmeyer",
                    "user_href": "/profile/John-Orthmeyer-1"
                },
                {
                    "user_id": "Sandra Kraft",
                    "user_href": "/profile/Sandra-Kraft-1"
                },
                {
                    "user_id": "Justin William",
                    "user_href": "/profile/Justin-William-3"
                },
                {
                    "user_id": "Marilyn Hubbard",
                    "user_href": "/profile/Marilyn-Hubbard-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Hill",
                "href": "/profile/Joshua-Hill-396"
            },
            "answer_text": "It was I think a very wonderful time to grow up. In the fifties, we had a solid, traditional family structure — no fear that our parents would get divorced, mom didn’t work so had plenty of time for us, and we benefited from the postwar prosperity that had given blue collar workers a middle class income for the first time in history. There was of course a dark side of this, too — rampant and legal discrimination against black people, women, and LGBT people:  We were the first television generation — we kids crowded around the TV to watch Captain Kangaroo and Saturday morning cartoons. We had a long TV, sort of like this:  Rotary dial telephones like this:  Our families didn’t have anything like the possessions that families have today, but it was a very comfortable existence, and as children, we were still unaware of the threats that concerned our parents. We were also typically unaware of the imperfections behind the family facade — the affairs, the drinking, the abuse. It was a time of great social trust. In the country, you could leave your car and front door unlocked. Children weren’t prisoners in their own homes — we were free range kids, free to wander in the city or the country. We’d get into scrapes, we’d walk around shooting things with BB guns and rifles, and playing with our knives. Playgrounds were genuinely challenging with jungle gyms and slides and swings over concrete, rather than the stupidly safe affairs we have today. That all meant that we learned to be independent and confident in a way that kids today do not. Politics was also a lot saner and more congenial. The country hadn’t divided into two camps that hated one another, and the equal time provision mandated balanced news coverage on the radio and TV. Comic books were big, and we kids loved them; Superman taught me how to read. Church played a bigger role in life than it does today, when fewer people go. I remember being dragged each summer to the church supper by my grandparents, and eating strawberry shortcake — and what a church it was, white steeple and everything:  Which of course was lost on us kids. Food was better — we had real home cooked meals every night, and fruit and chicken still had taste. “TV dinners” had been introduced, but prepackaged meals weren’t yet standard fare. And the nation wasn’t yet overpopulated. The growth of the suburbs had just begun, but there were still farms and towns where today there is suburban sprawl. The interstate highway system was built, and before Reagan reduced highway funding, they were virtually empty by today’s standards, so you could tool down them at full speed in your overpowered gas guzzling car without seat belts. Air conditioning was the exception rather than the rule — my Dad put it in in our house in the country, but we never had it in New York, so on hot days we just sweated. Microwave ovens existed, but were rare, and we often ate canned vegetables, even though frozen vegetables had become a thing; I remember being surprised when I realized that string beans didn’t taste like they did from the can. Half the grownups smoked, so we grew up in a cloud of it. I hated it, particularly when both my parents were smoking in the car with the windows rolled up (and cars didn’t have air conditioning in those days). But illegal drugs were rare. Manhattan was pretty much as it is today, but in the country, we still had a traditional main street, with a bank, a barber, a Woolworth’s, and a drugstore that still had a soda fountain in it. We had supermarkets by then, but no malls or big box stores — everything was still in town. Air travel was becoming popular, but I remember going to the old Penn Station, taking the train to visit my grandparents in Florida and sleeping in the sleeping car, and later flying there in a prop plane (commercial jets were introduced in I think 1959). And we were more likely to be spanked, though my own parents weren’t strict disciplinarians. Polio was a thing — my mother told me once of how scared they were each time one of us got sick — and then the Salk vaccine came along. I still remember taking the Sabin vaccine on a sugar cube when it first came out. And we were vaccinated for smallpox, too. But there were no vaccines for measles or mumps, so we all got them — I remember the weird feeling in my swollen lymph nodes as I ate some Sugar Pops. We did, however, have penicillin, still a wonder drug before overuse reduced its efficacy. And then the sixties. Early sixties, pretty much a continuation of the fifties, but with the assassination of Kennedy, and the civil rights struggle in the south, of which we were very much aware. I remember watching Lee Harvey Oswald being shot live on TV — I would have been nine at the time. In 1961, Alan Shepard became the first American in space, and the space race was on:  We kids would gather around the TV watching the countdowns and launches and recoveries raptly — each launch was full of anticipation and excitement. Computers were around, but they were mainframes and all we saw of them was the punch cards that came with utility bills. Xerox machines, too, but most duplicating was with ditto machines or mimeograph. It was great fun to type mimeograph stencils on a big old manual typewriter:  The Beatles came here in 1964 — we watched their first performances on the Ed Sullivan show, itself a staple of every family’s weekend. Every other song on the radio was a Beatles song, and we kids got Beatles haircuts. But when I entered junior high in 1966, things were still pretty tame. But we were beginning to wear “mod” clothes — my mom brought back some clothes from Carnaby Street in London, then the center of mod fashions, and I had a pair of velour bell bottoms that I loved, as well as a paisley shirt. The Surgeon General’s report on smoking and health had come out in 1964, so we knew smoking was bad for you, but beginning in junior high many of us started anyway. It was OK for teens to smoke — high schools had smoking areas. Needless to say, we experimented with alcohol as well — that hasn’t changed. But what did change was that marijuana became a thing: I smoked my first joint when I think I was 14. It was still quite illegal — we’d all heard of people who got five years in prison for a single seed — and some of us got busted. By 1965 color TV was becoming the norm, and NBC became the first network to broadcast all of its shows in color. (It had been around since 1954, but the sets were expensive with poor pictures, and there was very little color programming.) But TV reception was still very iffy, with ghosts and snow — cable would become popular only in the early 70’s. Then everything busted loose! The Vietnam War was becoming unpopular, and we marched against it. In 1967, when I was in eighth grade, one of my friends went down to the big march on the Pentagon, from which this is a famous image:  The government used tear gas and claimed that the protesters had used it; it was then that I understood for the first time that our government could lie. And that same year — Sergeant Pepper!  I still remember the day it came out — the artwork alone was enough to astonish, but when the music came on — there had never been anything like it, and really, never has been since. Even our parents started to take rock seriously. Music was central to who we were, the vehicle by which the counterculture was disseminated. What had been a carefully-managed affair of tuneful 16 bar pop 40 tunes suddenly exploded with psychedelic creativity. So pretty much did everything else. Divorce was suddenly OK. The Stonewall riots began the gay rights movement. Hair got ever longer, dress ever more playful and less formal. The staid censorship of Hollywood’s Hays Office gave way to sexual freedom. Thing went from married couples being shown with separate beds to, well, anything — and there were no ratings to discourage X-rated films. On Broadway, the musical “Hair” had a scene in which everyone got naked. Attempts to enforce obscenity laws were futile, and the establishment soon gave up. Art became psychedelic:  Everything was up for grabs — water beds, lava lamps, inflatable furniture (and hot plastic boots and miniskirts), you name it:  Underground comics:  Society changed dramatically in a few short years, and we kids were at the center of it. Premarital sex (thank the pill for that) meant that we could have sex for the first time (without skulking off to Lover’s Lane and praying that the condom didn’t break, anyway). Dorms became coed. Free love — casual sex with just about any girl you met. And lots of pot and acid. It was an innocent time for drugs; heroin was rare, cocaine was still considered a rich man’s drug, meth was just coming on the scene. And of course there were hippies:  It all culminated in 1969, with Woodstock:  And then:  It was the most exciting time ever for a kid to be alive. ",
            "date": "Answered June 9, 2020",
            "views": "592",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ron Kolinie",
                    "user_href": "/profile/Ron-Kolinie"
                },
                {
                    "user_id": "Nila Wafer",
                    "user_href": "/profile/Nila-Wafer"
                },
                {
                    "user_id": "Kevin Lloyd",
                    "user_href": "/profile/Kevin-Lloyd-55"
                },
                {
                    "user_id": "Henry Griffin",
                    "user_href": "/profile/Henry-Griffin-3"
                },
                {
                    "user_id": "Steph Morales",
                    "user_href": "/profile/Steph-Morales-6"
                },
                {
                    "user_id": "Zach Valentine",
                    "user_href": "/profile/Zach-Valentine"
                },
                {
                    "user_id": "Garth Petruk",
                    "user_href": "/profile/Garth-Petruk"
                },
                {
                    "user_id": "Ben Gazda",
                    "user_href": "/profile/Ben-Gazda"
                },
                {
                    "user_id": "Jennifer Armstrong",
                    "user_href": "/profile/Jennifer-Armstrong-115"
                },
                {
                    "user_id": "Adam Reisman",
                    "user_href": "/profile/Adam-Reisman"
                }
            ]
        }
    ]
}