{
    "title": "How long do spices last before going bad? - Quora",
    "tags": [
        "Spices",
        "Expiration Dates and Product Expiration",
        "Cooking"
    ],
    "response": [
        {
            "author_info": {
                "name": "Burma Spice",
                "href": "/profile/Burma-Spice"
            },
            "answer_text": "As a spice expert, I’ve been asked this question so many times. People who have short to none experience in the matter, buy spices in bulk without knowing that they might be making a mistake if they’re not a restaurant which uses these great amounts in a short time. One thing you may be surprised to learn is that when you buy a supermarket spice, it may already be as much as a year old before you even take it home and use it for the first time. Normally they last in between one to two years before they go bad; the key is to check for vibrant colors and strong aroma. If your spice is washed out and barely releases a hint of smell it might be time to throw it out or repurpose it. If you want to have more tips to identify the freshness of your spices, check out our take on this matter in this link Have your spices gone bad? 5 ways to find out. What we do to offer our customers the best quality, is to harvest the product, immediately start the drying process, pack it, and send it to our clients in the shortest possible time, practically from farm to table.  ",
            "date": "Answered June 26, 2019",
            "views": "504",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Caudill",
                "href": "/profile/John-Caudill-2"
            },
            "answer_text": "It Varys with the spice: aromatic spices, basil, oregano, thyme the fragrant spices use oil to transfer scent and flavor. (Remember, scent is half of taste) ground spices: pepper, cinnamon and other hard spices may be useable up to a year but fragrant spices, rarely past 6 months. If one is a conscious cook, fresh is always best. I grind my own coffee, peppers, cinnamon. Cloves and most ‘Hard’ spices, at ‘use time’. Oil based I chop fresh. Once this becomes habit, you’ll wonder why you ever bought prepared spices. For one, horse radish… freshly minced will enhance so many homemade sauces you’ll never buy bottled again. Vanilla, the most abused flavor in the world, comes from??? You won’t believe it: México! Always secure tightly and keep in a cool dark place, just a drop or two will send your senses soaring! Cumin or Chinese Parsley, fresh only! Always wash and dry leaf spices, they carry other flavors not genuine to their intent. Spice of life? Surely nature developed taste buds to be used! ",
            "date": "Answered July 19, 2019",
            "views": "13",
            "upvotes": "0"
        }
    ]
}