{
    "title": "How is abortion in Russia illegal when Russia has the highest number of abortions? - Quora",
    "tags": [
        "Abortion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrey Yanovski",
                "href": "/profile/Andrey-Yanovski"
            },
            "answer_text": "Both parts of the question are bullshit. Abortion is legal in Russia and can be performed on the basis of express desire of the woman, even in the absence of medical necessity before 12th week of pregnancy. At 12–22 weeks in case the pregnancy is the result of rape. In case of medical recomendation, abortion can be done at any stage of pregnancy. Moreover, abortions in Russia are covered by mandatory medical insurance and thus are free for all citizens.Russia does not have the highest number of abortions by far. Especially, considering the fact that rather liberal legislation on the subject and social insurance allows women to perform abortions legally and free of charge, and thus the statistics are fairly full and accurate, while for countries with stricter regulations the homemade illegal abortions do not hit the stats. In 2015 Russia had ~20 abortions per 1000 women, which is equal to the number of abortions in Estonia and Sweden. Countries of South America and Africa likely have vastly higher abortions rates, but no reliable statistics is available.Just a sidenote: Russian Soviet Federal Socialist Republic was the first country in the world to legalize abortions: in 1920, 50 years before the next country - great Britain in 1967. ",
            "date": "Answered September 4, 2017",
            "views": "11",
            "upvotes": " View 58 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kristi Nochka",
                    "user_href": "/profile/Kristi-Nochka"
                },
                {
                    "user_id": "Maxim Sidorov",
                    "user_href": "/profile/Maxim-Sidorov-1"
                },
                {
                    "user_id": "Debra Downing",
                    "user_href": "/profile/Debra-Downing-2"
                },
                {
                    "user_id": "Pavel Tolstov",
                    "user_href": "/profile/Pavel-Tolstov"
                },
                {
                    "user_id": "Vladimir Lebedev-Schmidthof",
                    "user_href": "/profile/Vladimir-Lebedev-Schmidthof"
                },
                {
                    "user_id": "Vera Gastv",
                    "user_href": "/profile/Vera-Gastv"
                },
                {
                    "user_id": "Vadim Dmitriev",
                    "user_href": "/profile/Vadim-Dmitriev-5"
                },
                {
                    "user_id": "Pavel Morava",
                    "user_href": "/profile/Pavel-Morava"
                },
                {
                    "user_id": "N Maccallan",
                    "user_href": "/profile/N-Maccallan"
                },
                {
                    "user_id": "Dimitri Scholz",
                    "user_href": "/profile/Dimitri-Scholz"
                }
            ]
        }
    ]
}