{
    "title": "How many knights were there in Medieval times? - Quora",
    "tags": [
        "Medieval Knights",
        "Knights",
        "Middle Ages (era)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan True",
                "href": "/profile/Dan-True-1"
            },
            "answer_text": "This is impossible to answer in general, as it would wary from decade to decade and from locality to locality. One thing to bear in mind is: Knights were a title. You were made a knight by being knighted. There were plenty of people (squires, nobles, upper middle-class) who could afford full knight kit and went to war, but who were never knighted. The catch-all term for a man with full war gear (including armour, horse, weapons and likely a few soldiers/squires/followers - his “banner”) was a man-at-arms. The ratio between “just” men-at-arms and knights varied wildly throughout the period. So when we are discussing knights, we’re discussing men-at-arms who have also been knighted - there may be knights who have lost their wealth and can no longer afford their horse, armour etc. and these shouldn’t really count. To take an example, according to “Feudal Assessments and the Political Community Under Henry II and His Sons” by Thomas K. Keefe, sources indicate that Henry the 2nd of England in the later half of the 12th century could call upon somewhere between 6.000 and 7.000 in his domain. Henry also had some possessions in France, but for simplicity let’s go with the rough estimate of the 3.5 million inhabitants of england at that time. This gives us: 7000 / 3.500.000 = 0.002% of the population were knights at that specific time. A tiny minority. In the high middle ages and early renaissance this number would likely grow, as the knightly role lost its importance and its use inflated, especially at the court. ",
            "date": "Answered June 19, 2019",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guy Thomas",
                    "user_href": "/profile/Guy-Thomas-58"
                },
                {
                    "user_id": "Barış Abdulazizoğlu",
                    "user_href": "/profile/Barış-Abdulazizoğlu"
                },
                {
                    "user_id": "Richard Walker",
                    "user_href": "/profile/Richard-Walker-237"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zhao Lin Tan",
                "href": "/profile/Zhao-Lin-Tan-3"
            },
            "answer_text": "Let's talk about medieval England. Basically we would never know the exact number of knights since these actual records could not be found. We could know through speculation and analysis. For medieval England, the land mainly consists of manorial land. There were about 45000 pieces of manorial lands which is also known as manors. The king, church and noblemen would own 1/3 of these manors. The manors are the source of income for the nobles and they use the income to sustain their career as knights. Since they owned about 1/3 of the manors, so about 15000 manors are theirs. Among the 15000 manors, they would keep some of the manors for their personal usage and others would be granted to other knights as fiefs. So maybe 10000 manors would be given to the knights. Each knight would need one to two manors to sustain their career as a knight. Thus, it is estimated that there were about 5000 to 10000 knights or more (I yet to include the knights directly under the kings) at any given times during medieval England. Reference:- England Manors Vassals ",
            "date": "Answered September 17, 2020",
            "views": "120",
            "upvotes": "0"
        }
    ]
}