{
    "title": "How many years do we have to study to become an archaeologist? - Quora",
    "tags": [
        "Archaeologists",
        "Archaeology",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Shirar",
                "href": "/profile/Ben-Shirar"
            },
            "answer_text": "If you want to work in archaeology, there are a few different tracks involved. To perform fieldwork (excavating, recording sites, surveying) you’ll need to be, at a bare minimum, over 18 and have attended a field school. Most contract/commercial archaeology employers- which are the most common employers, by far- will prefer you to have at least an associates degree and a field school. Work at this level is performing archaeology, although very rarely will you be referred to as an “archaeologist”- mostly you’ll be called an “archaeological technician”. Achieving this level generally requires a minimum of 2 years past high school for an associates’ degree To hold a job where your actual job title is “archaeologist”, you’ll require a master’s degree- likely this job will be as a mid-level employee with a private firm or government agency. At this point, you’re looking at 4 years of undergraduate education, plus 2 years of graduate school, for 6 hours total post high school. If you want to be a project manager or principal investigator, a high-level archaeologist (GS-11 and higher) in the government, or a college professor, you’ll need a PhD. Depending on the program and the person involved, this can mean 4 years of undergrad+7 years of graduate work. This would be for a program where you earn a Master’s on your way to your PhD. Some PhD programs don’t work that way though, and require even master’s holders to take the full curriculum. For someone who took this path, that could mean 4 years of undergrad+ 3 for a masters+7 for PhD, for a total of 14 years of post-secondary education before you’re starting your career ",
            "date": "Answered December 19, 2018",
            "views": "258",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Judith Purcell",
                    "user_href": "/profile/Judith-Purcell"
                },
                {
                    "user_id": "Tristan Dolciano",
                    "user_href": "/profile/Tristan-Dolciano"
                },
                {
                    "user_id": "Floyd Aranyosi",
                    "user_href": "/profile/Floyd-Aranyosi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Ballai",
                "href": "/profile/Michael-Ballai"
            },
            "answer_text": "Figure about six to eight years if you are destined for academia. The amount of fieldwork can be daunting. It all depends on what your goals are and the specialties you wish to pursue. ",
            "date": "Answered December 19, 2018",
            "views": "44",
            "upvotes": "0"
        }
    ]
}