{
    "title": "How did Europe recover after the Plague? - Quora",
    "tags": [
        "Plagues",
        "Bubonic Plague",
        "Middle Ages (era)",
        "History of Europe",
        "Infectious Diseases",
        "World History",
        "Europe",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michel Vandevoorde",
                "href": "/profile/Michel-Vandevoorde"
            },
            "answer_text": "Simply: by starting to work again, re-marry, make children again (in fact during the Plague some people prayed while other went an a fucking spree - “everyday could be the last” and the rich and mighty died as well as the poor and socially weak) to replace the lost ones or simply as the survivors were young enough to restart living normal again. Humane nature make us to go on after disaster. After the Plague had passed: there came much more arable lands at the disposion of the surviving labourers and farmers, the houses of the dead came vacant, there were lesser workers for the existing jobs, so wages went up - “work has to be done” - there was much to herit, so the survivors wer at one stroke much richer. Serfs escaped en masse the countryside and were welcome to fill the gaps in urban population. (Serfdom in Western Europe ended there). The recovery was quite quick - and even wars went on - the Hundred Years War). After the fall of population - up to one third in some parts of Europe died - risk of contamination dwindled - and people went into seclusion or turned to the countryside for self-isolation when there were rumors of new starts of bubonic plague. Survivors had also some immunity (survival of the stronger - women!). ",
            "date": "Answered October 9, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jonas Hellberg Hellberg",
                    "user_href": "/profile/Jonas-Hellberg-Hellberg"
                }
            ]
        }
    ]
}