{
    "title": "How did Sicily become part of Italy in the Italian unification? - Quora",
    "tags": [
        "Sicily, Italy",
        "Italian Ethnicity and People",
        "Italian (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlo Tedesco",
                "href": "/profile/Carlo-Tedesco"
            },
            "answer_text": "At the beginning of April 1860, Garibaldi gathered about a thousand volunteers – called i Mille (the Thousand), or, as popularly known, the Redshirts – in two ships named Piemonte and Lombardo, left from Genoa on 5 May in the evening and landed at Marsala, on the westernmost point of Sicily, on 11 May. Swelling the ranks of his army with scattered bands of local rebels, Garibaldi led 800 volunteers to victory over an enemy force of 1500 on the hill of Calatafimi on 15 May. An apocryphal but realistic story had him say to his lieutenant Nino Bixio, Qui si fa l'Italia o si muore, that is, Here we either make Italy, or we die. Six weeks later, he marched against Messina in the east of the island, winning a ferocious and difficult battle at Milazzo. Having conquered Sicily, he crossed the Strait of Messina and marched north. Garibaldi's progress was met with more celebration than resistance, and on 7 September he entered the capital city of Naples, by train. Despite taking Naples, however, he had not to this point defeated the Neapolitan army. Garibaldi's volunteer army of 24,000 was not able to defeat conclusively the reorganized Neapolitan army (about 25,000 men) on 30 September at the Battle of Volturno. This was the largest battle he ever fought, but its outcome was effectively decided by the arrival of the Piedmontese Army. Following this, Garibaldi's plans to march on to Rome were jeopardized by the Piedmontese, technically his ally but unwilling to risk war with France, whose army protected the Pope. (The Piedmontese themselves had conquered most of the Pope's territories in their march south to meet Garibaldi, but they had deliberately avoided Rome, his capital.) Garibaldi chose to hand over all his territorial gains in the south to the Piedmontese and withdrew to Caprera and temporary retirement. ",
            "date": "Answered November 12, 2017",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aldo Cristoni",
                    "user_href": "/profile/Aldo-Cristoni"
                },
                {
                    "user_id": "Torrey Stephen Whitman",
                    "user_href": "/profile/Torrey-Stephen-Whitman"
                },
                {
                    "user_id": "Manuel Driggs",
                    "user_href": "/profile/Manuel-Driggs"
                },
                {
                    "user_id": "Nicolas Zapata",
                    "user_href": "/profile/Nicolas-Zapata"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bart Fava",
                "href": "/profile/Bart-Fava"
            },
            "answer_text": "Sicily was part of the Kingdome of southern Italy, known = Regno delle due Sicilie = In 1860 the varies city principalities united under one Kingdome of Piemonte, the Savoia royal Family become the official royals of the united Italy: of course whit the military intervention of Garibaldi !further a major political role was played by Camille DE, COUVUR as well the Church in Rome a member of the college of the Cardinals < a close descended of HIS HIGHNESS' CESERE BARONIO ; ",
            "date": "Answered November 10, 2017",
            "views": "434",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gary Keith",
                    "user_href": "/profile/Gary-Keith-42"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Alberti",
                "href": "/profile/Simon-Alberti-1"
            },
            "answer_text": "In 1860/1861 Giuseppe Garibaldi with his ““one thousand” militians invaded Sicily ( that belonged to the Napolitan kingdom called ““kingdom of the two Sicilies”) and annexed it to the kingdom of Piedemont and Sardinia that changed its name in kingdom of Italy after the anexion of all the other Italian states . ",
            "date": "Answered November 11, 2017",
            "views": "314",
            "upvotes": "0"
        }
    ]
}