{
    "title": "How much better was life in the 80s or 90s than it is today? - Quora",
    "tags": [
        "1980s",
        "1990s"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joel Dills",
                "href": "/profile/Joel-Dills"
            },
            "answer_text": "It was totally better!! Sure we had our problems, but terrorist were only TV bad guys on Macgyver not a part of our collective experience watching the towers fall. School kids had to worry about getting caught sluffing, not getting shot. The news was only on at 5 and 10, not all day everyday even if there was no real news to report. Mad Magazine made fun of every body and nobody got offended. Being a republican or Democrat was similar to being a Cowboys or Steelers fan, you razzed each other, but it wasn’t your whole identity. Godfather’s Pizza… nuff said. Movies were more fun and full of hope with corny magic like Xanadu… okay, maybe that wasnt a good thing :-) Your parents home was what you aspired to someday have, not an immediate need with more, more, more built into it to prove your worth. Don’t get me started on the damage HGTV did with expectations. Stupid Chip and Joanne making me spend my weekends putting in stupid shiplap for my wife! I don’t want to go to the silos… You could literally do anything you wanted to your hair. Huge cans of hair spray, some bleach or koolaid color and your moms scissors… oh yeah baby… You could ride your bicycle without a helmet, knee pads and body armor; and no one judged you for it!!! Meat and potatoes was for diner and there was no Food Network to make you feel like an under achiever or Dr Oz to tell me its unhealthy. Madonna was a sexy little street kitten, now she’s a slutty cougar. MTV played videos, HBO played movies and Late night talk shows were just there to entertain you enough to fall asleep to. NO CELL PHONES!! Ah the life, just because someone wants to get a hold of you, doesn’t mean they should. No caller ID, you could call the girl you had a crush on and hang up after you heard her voice say hello… true romance. Now that would just be creepy. The list goes on, but if I had to just narrow it down to one thing that was better about life in the 80’s it was that for the most part, we all believed life and the world was getting better, closer and more caring. We grew up believing we had learned from the mistakes of the previous generations and we were going to do it better. maybe its just me getting old, but I don’t see that optimism for the future anymore. All I hear is how bad it is and every “solution” is about anger and violence. The news constantly tells us how bad we are and how we are only making it worse. …yep, I miss the 80’s ",
            "date": "Answered August 15, 2018",
            "views": "71",
            "upvotes": " View 47 Upvoters",
            "upvoters": [
                {
                    "user_id": "Susanna Viljanen",
                    "user_href": "/profile/Susanna-Viljanen"
                },
                {
                    "user_id": "Tomasz Sowa",
                    "user_href": "/profile/Tomasz-Sowa-7"
                },
                {
                    "user_id": "Tzeni Kavlidou",
                    "user_href": "/profile/Tzeni-Kavlidou"
                },
                {
                    "user_id": "Robin Doherty",
                    "user_href": "/profile/Robin-Doherty-16"
                },
                {
                    "user_id": "Don P",
                    "user_href": "/profile/Don-P-129"
                },
                {
                    "user_id": "Rena Qhali",
                    "user_href": "/profile/Rena-Qhali"
                },
                {
                    "user_id": "Ankit Raja",
                    "user_href": "/profile/Ankit-Raja"
                },
                {
                    "user_id": "Monica Johnson",
                    "user_href": "/profile/Monica-Johnson-461"
                },
                {
                    "user_id": "Crashannah Smith",
                    "user_href": "/profile/Crashannah-Smith"
                },
                {
                    "user_id": "Mohammed Ali Mani",
                    "user_href": "/profile/Mohammed-Ali-Mani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rich Thomas",
                "href": "/profile/Rich-Thomas-54"
            },
            "answer_text": "every thing was better by a long shot. Schools were unquestionably safer. the worst thing that happened in schools was the security cop on duty at school would bust some kids possessing or smoking weed. Occasionally fights would break out on school property but ended quickly. Nowadays schools have mass shootings . Some kid decides he’s not gonna take the bullying any more and goes on a potentially suicidal rampage shooting people at will. today’s kids also gotta deal with something called cyber bullying. That’s using a computer to spread vicious lies and track their prey down. Un heard of in the 80s/90s. Back then a bully at worst would beat up someone and take their lunch money. That would stop with one good smack to the bully by the victim. Back then the music of choice was good time rock n roll with anthemic lyrics and awesome guitar work and a pleasure to listen too. nowadays music of choice is gangsta hip hop and rap with vulgar racist lyrics. The music is made not played. It’s all computer driven special effects and altered voices. in the early eighties drinking age was 18. Getting into bars was easy and parties were full of energy good times and rock n roll. plenty of good beer and good weed was available and we all relaxed and had a great time then helped each other up when the last keg tapped. Now it’s all about rap, techno, as well as coke and ecstasy. kids at parties often get in gang style fights too. people used to actually talked to each other in person. Now it’s like everyone’s glued to their phones. back then an admission ticket to an amusement park was only about $25 on average. Now tickets average $60+. back then it was possible to go to a bar at 7:00 with $25 in your pocket and leave at 2am totally trashed with enough change left to get some late night food to satisfy the munchies. Now if you go to a bar with $25 at 9:00 your wallet will likely be empty by 1am 1:30 at latest and you’ll be wanting some more to drink as you’ll feel as if you’ve barely got started. also video games were great cause they were simple to learn and fun to play cause you didn’t really need to think about what you were doing while playing. now a days the video games today almost require you to take special class to get certified to learn how to play and only high tech super smart people are able enjoy cause they’re so complicated. these things I’ve written here are but a minute amount of ways the 80–90s were better. Oh by the way 9/11 was no where possible and we didn’t have to walk around all distant with masks on our faces fearing some virus was gonna get us back then. ",
            "date": "Answered September 18, 2020",
            "views": "498",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jerel Minter",
                    "user_href": "/profile/Jerel-Minter"
                }
            ]
        }
    ]
}