{
    "title": "How did battle work in the middle ages? - Quora",
    "tags": [
        "Medieval Warfare",
        "Middle Ages (era)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ariel Marveli Marbun",
                "href": "/profile/Ariel-Marveli-Marbun"
            },
            "answer_text": "Both sides would usually send scouting parties to their surroundings. Since armies were large and often sends scouting parties along with food-gathering parties of their own both sides were usually aware of each others presence in the area. If both commanders decided meet their adversaries in a battle rather than avoiding them (which is a very sound decision, battles are risky; it often results in a win all or lose all situation) then both armies would march from their camp and meet each other. Both commanders may agreed upon a chosen battlefield, but a commander that had the initiative might as well marched to their enemy encampment. If he was lucky, he might have surprised the enemy and started the battle before they formed proper formations. A battle will typical starts with a skirmish. Light infantry and cavalry will harry each other while heavy infantry and cavalry positioned themselves. A standard practice was to deploy infantry in the center and cavalry in the flanks. The course of a battle would vary but since most armies are composed of infantry with fewer cavalry the scenario I will be presenting would be based on that assumption. The heavy infantry on the center will clash with each other while the flanks tried to drive each other from the field. One of the flanks might than be defeated, if this happens it will allow the winner to outflank their foe. The outflanked force might then panic and rout (the simple fact is , most human wouldn’t simply stand and die as often depicted in popular media). Or perhaps both sides simply batter each other until some of the men on one side decided that they simply didn't want to die like the people in front of them and quit, which was follow suit by their compatriots. Once a rout start, the battle itself was practically won. It was possible for the routed man to rallied but it rarely happens. The victors would then pursue and cut down their fleeing adversaries, a task which was easier since they were usually unable to give organized resistance (one or two might decided to stand up and fight, but they would be easily overwhelmed). As a result most casualties usually happens during a rout, not many would actually died because of the actual fighting. This was why the Roman Legions was really famous. They doesn’t necessarily always have better generals or equipment. Their men was simply highly disciplined and stayed fighting despite suffering heavy casualties, which means that their more undisciplined enemies usually rout before they do. Also, this would explains why heavy cavalry was so effective. Imagine standing with your friends at the very front during a battle, then the enemy cavalry charged with their long lances and heavy horses, very few ordinary man would stay calm and remain firm. The sight of heavy cavalry charging alone would sometimes be enough to rout their enemies. Disciplined soldiers that remained firm however can easily repelled such charges with appropriate formations and weapons (spear and pike typically), robbing the charge of their momentum There were much more regarding how medieval battles was fought but I believe this answers your question. ",
            "date": "Answered April 21, 2018",
            "views": "15",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ilham Lutfi",
                    "user_href": "/profile/Ilham-Lutfi"
                },
                {
                    "user_id": "Jacob Beddingfield",
                    "user_href": "/profile/Jacob-Beddingfield"
                },
                {
                    "user_id": "Jan Kukla",
                    "user_href": "/profile/Jan-Kukla-1"
                },
                {
                    "user_id": "Harvey Paveley",
                    "user_href": "/profile/Harvey-Paveley"
                },
                {
                    "user_id": "Kristin Talia",
                    "user_href": "/profile/Kristin-Talia"
                },
                {
                    "user_id": "Todd Maggiore",
                    "user_href": "/profile/Todd-Maggiore"
                },
                {
                    "user_id": "V.S",
                    "user_href": "/profile/V-S-1016"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jackson Miller",
                "href": "/profile/Jackson-Miller-60"
            },
            "answer_text": "There are so many answers I can give to this in just Eroupe alone, but I’ll give it a try. Medieval battles could be caused by complex reasons but the execution of battle was far from complex. I’ll talk mostly about the traditional battle of two armies facing off. Scouts were uncommon but still used, the common causes were 1. because an army raised by the king or a marshal marched out to meet an invading army, 2. It was not rare for lords and kings to challenge each other to battle, an invitation would be sent and if the receiver agreed, a battle would take place. These battles were not just between two lords an example is the battle of Boulivines in 1214. An army lead by the Holy Roman Emperor, Otto of Brunswick, his allies included lords from the empire, English lords, and French rebel lords. Opposing them was king Phillip of France and his army which was reinforced by soldiers sent by the pope (the cause of this battle is very complex and I don’t know all the details. P.s. Phillip won). And 3. Because an army marched out to break the siege of a castle or town. Or a combination of two. When the battle started it was basically just ranged units wearing down the enemy until someone charged. I think Muslim warriors may have had scrimmages at the beginning but in eroupe that rarely happened. There were typically three types of soldiers infantry, cavalry, and ranged soldiers. The infantry was composed of peasants and professional soldiers. The peasants were ussaly self armed with farming tools but some wealthy lords gave the peasants basic equipment. The peasants couldn’t do much against anyone but other peasants and were just there to make up the numbers. The cavalry was composed of knights, nobles, and professional soldiers. The ranged units were composed of professional soldiers. I just want to point this out, nobles always fought in battle, if they didn’t they were considered a coward. Once one side charged that was typically it for any kind of planing. Complicated flanking maneuvers and other battles tactics were not really used. If you seemed reluctant to order your men to charge or you were seen holding a reserve( if you could convince your men to stay in reserve) you were a coward, if you suggested a flanking maneuver your knights would stare at you like you’re an idiot. The cavalry would charge in lances first and cause large amount of casualties. A good horse charge could make the enemies moral weak, making them more likely to flee. The infantry would follow and a melee would take place. This could last for about a hour before someone ran. Lastly I want to bring your attention to the knight, the knight was like the class clown, always looking for attention even if it meant doing something incredibly stupid, like leaving a large group of peasants to charge after an enemy noble, yea that happened a lot. What would have been a decisive victory, turned into s terrible defeat because half the knights would charge after the enemy commander, all hope of to capture or kill him and gain fame and glory, but In doing so they would leave a pissed off crowd of peasants that would run up and stab the knights in the back. During battle knights were not controlled by army commander, so the commander just had to unleash the bloodthirsty monsters and hope for the best. I hope that helped a little, if you have any other questions just leave a comment and I’ll try to answer it. P.S. I’m using my phone to right this and I’m bad at seeing any mistakes I made, if you see any thing please suggest an edit thank you. ",
            "date": "Answered January 9, 2018",
            "views": "304",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kelly Borgman",
                    "user_href": "/profile/Kelly-Borgman-1"
                },
                {
                    "user_id": "Manthan Shah",
                    "user_href": "/profile/Manthan-Shah-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Knight",
                "href": "/profile/Alexander-Knight-7"
            },
            "answer_text": "Most were fought until about 20–30% of the men died or were captured. This does not mean that once a group of ten guy saw two guys get hit by arrows they would flee, it just means that in any staged battle, natural leaders, veterans and the best fighters would be the first to die since they would be fighting the hardest. And once the rest of the army was without their leadership, they would flee. Tactics and maneuvers can be found in any medieval battle game, like Medieval 2, Warband, etc. All those games are very realistic to actual combat strategy. ",
            "date": "Answered April 21, 2018",
            "views": "626",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Don Lott",
                    "user_href": "/profile/Don-Lott-9"
                },
                {
                    "user_id": "Brian Mayer",
                    "user_href": "/profile/Brian-Mayer-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chloe Fasano",
                "href": "/profile/Chloe-Fasano-1"
            },
            "answer_text": "With swords. And lots of death and bloodshed ",
            "date": "Answered April 21, 2018",
            "views": "329",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Howell Dale",
                "href": "/profile/Howell-Dale"
            },
            "answer_text": "1.arguements for the better plans and the future plans for the defeated kingdoms 2.Propaganda for the high morals of the soldiers for both party ",
            "date": "Answered April 21, 2018",
            "views": "406",
            "upvotes": "0"
        }
    ]
}