{
    "title": "How many blacks had slaves? - Quora",
    "tags": [
        "History of Slavery",
        "Slavery",
        "African Americans",
        "Black People",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Brecht",
                "href": "/profile/Greg-Brecht"
            },
            "answer_text": "The numbers are controversial. The best estimate is that around 1860 there were about 3,500 black slaveholders with perhaps 10,000 slaves. This needs some explanation. There are two important regional variations: in Louisiana, there was a tradition of whites marrying mixed-race women and their mixed-race children were free, they were often well educated and some were wealthy, and some owned plantations. A variation was plantation owners freeing their slave lovers and emancipating the children, who could legally inherit property, including slaves and plantations. In Virginia, in about 1830 the state legislature required that any newly freed slave had to leave the state in one year, or be re-enslaved. People free before that law took place were exempted. So a fair number of freed black men bought their wives and children, but kept them formally as slaves so they did not have to leave the state. These were technically slaveholders, but it can hardly be called slavery. This odd situation likely accounts for the majority of black slaveholders. The fact that some free black people owned slaves is often sort of a ‘Gotcha!!” moment among apologists for slavery. A closer look makes that claim a little simplistic. There were about 398,000 slaveholding households in the US in 1860 ",
            "date": "Answered June 21, 2020",
            "views": "494",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denise Randel",
                    "user_href": "/profile/Denise-Randel"
                },
                {
                    "user_id": "Linda Lawson",
                    "user_href": "/profile/Linda-Lawson-40"
                },
                {
                    "user_id": "Gabriel J. Ferrer",
                    "user_href": "/profile/Gabriel-J-Ferrer"
                },
                {
                    "user_id": "Wendy Veith",
                    "user_href": "/profile/Wendy-Veith"
                },
                {
                    "user_id": "Bobby Rupe",
                    "user_href": "/profile/Bobby-Rupe-1"
                },
                {
                    "user_id": "Hamda Mehmood",
                    "user_href": "/profile/Hamda-Mehmood-1"
                },
                {
                    "user_id": "Bob Powell",
                    "user_href": "/profile/Bob-Powell-38"
                },
                {
                    "user_id": "Karen Hemphill",
                    "user_href": "/profile/Karen-Hemphill-3"
                },
                {
                    "user_id": "Clay Elam",
                    "user_href": "/profile/Clay-Elam"
                },
                {
                    "user_id": "Micha Roded",
                    "user_href": "/profile/Micha-Roded"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debbie Redington",
                "href": "/profile/Debbie-Redington"
            },
            "answer_text": "At the beginning of the War between the states, there were as many free people of color in New Orleans and Richmond as there were slaves in those cities. Not all free people of color owned slaves of course, but there was a small percentage that did , likely close to the same percentage of free blacks owned slaves as whites. Some were actually relatives of the slaves they held, just as some whites were relatives of their slaves. ",
            "date": "Answered March 31, 2019",
            "views": "134",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark McCain",
                    "user_href": "/profile/Mark-McCain-13"
                }
            ]
        }
    ]
}