{
    "title": "How often do Catholic monks regret or second-guess taking vows and becoming monks? What do such monks usually do? - Quora",
    "tags": [
        "Monasticism",
        "Monks",
        "Priests",
        "Catholics",
        "Catholicism",
        "Spirituality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Boniface Muggli",
                "href": "/profile/Boniface-Muggli"
            },
            "answer_text": "To answer a slightly different question: About half of those who come seeking to test a monastic vocation will leave before final vows; about half will stay to make vows. This is why it takes several years, and several stages (typically candidacy, novitiate--a year or two, and junior professed--temporary vows for at least three years, before final vows are even possible. And at each stage the new monk must petition, and the chapter vote to accept.  After that, there are still some monks who find they need that \"goal\" of the next stage to have a reason to continue. This is not many--I'd guess 5% at most?--but there are some. Also, some find, even after many years, that they did not have adequate reason to be monks. Perhaps they sought holiness, or a stable, secure life rather than seeking God. Again, this is a small percentage, if the initial formation was well done: teaching what monasticism is about, and faith, and how to be prayerful and have an active prayer life, and so on.  Another truism: the reasons you come to a monastery and join it are not  often the reasons you stay. You discover, once in the life, a deeper  meaning and new, lasting reasons to be committed. You may come in a  spirit of running away from the world, but that will not sustain you.  You may come for an education, or for time to read and study, but that  is not what monastic life is about. It is, ultimately, about seeking  God. All in all, I'd estimate that well over 90% of monks now are faithful to their vows. There was a period, especially in the 1970s, when a greater number left. I ascribe it to monks who entered in the 1950s and 1960s when formation was not so developed, and there was greater cultural pressure to be holy through monastic life. Once the reforms of Vatican II began to spread, many monks questioned why they were there, and decided to leave. As for what those monks who regret taking vows do, many of them leave. If in temporary vows, they can be dispensed by the Abbot (the local superior). If in final vows, they can be dispensed by the Abbot President of the monastic congregation. If they are also ordained, then either they need another community or a diocese to join, or they need to be laicized, which can only be approved by Rome. They may receive permission to check out other monasteries or orders, hoping to find a group or community more conducive to their spirit.  And then there are some who simply walk away, and don't worry about the legalities.  Also, some will \"tough it out,\" remaining in the monastery but perhaps alienated from the community or not really living the life and spirit. It is sad, but it happens. ",
            "date": "Updated August 21, 2015",
            "views": "25",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Smith",
                    "user_href": "/profile/Andrew-Smith-825"
                },
                {
                    "user_id": "Chris Zewe",
                    "user_href": "/profile/Chris-Zewe"
                },
                {
                    "user_id": "Scott Gosnell",
                    "user_href": "/profile/Scott-Gosnell"
                },
                {
                    "user_id": "Floyd Williams",
                    "user_href": "/profile/Floyd-Williams-18"
                },
                {
                    "user_id": "Jose' Arroyo",
                    "user_href": "/profile/Jose-Arroyo-207"
                },
                {
                    "user_id": "John Corrigan",
                    "user_href": "/profile/John-Corrigan-40"
                },
                {
                    "user_id": "Julie Nickell",
                    "user_href": "/profile/Julie-Nickell-1"
                },
                {
                    "user_id": "Joshua Chen (陳祈安)",
                    "user_href": "/profile/Joshua-Chen-陳祈安"
                },
                {
                    "user_id": "Layan Yunis",
                    "user_href": "/profile/Layan-Yunis"
                },
                {
                    "user_id": "Namaji Srinivasan",
                    "user_href": "/profile/Namaji-Srinivasan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christian Ortmann",
                "href": "/profile/Christian-Ortmann"
            },
            "answer_text": "The regret from ordaining comes from a will to arrive somewhere or become something other than what they are.  Either they want to arrive at enlightenment, or they want to save souls, or they want to become a great teacher, or they want to become Godly, or anything else you can imagine.  This mind momentum to become, to arrive somewhere, or to  be something else, eventually runs out of steam because the rewards will at some point not meet expectations or what one hoped for. Even the most subtle hope for recognition or personal joy or the attainment of something will lead to this dark night of the soul...given enough time.  Because this motivation has essentially tainted all of one's actions that occur after ordination. So regret arrives as a result of tainted motivation, and the mind compares other paths it might have taken to arrive at the same goals (personal joy, peace, and so forth).  This dark night is yet one more stepping stone on the way to liberation.  The way out of this darkness can be made possible through a good mentor, or enough personally-acquired wisdom and wholesome habits that do allow a breakthrough back out of the dark pit. As with any tendencies of mind we try to overcome, the strategies are all similar.  Introspection.  Meditation.  Equanimity.  Compassion, even for oneself. ",
            "date": "Answered December 27, 2014",
            "views": "14",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joshua Chen (陳祈安)",
                    "user_href": "/profile/Joshua-Chen-陳祈安"
                },
                {
                    "user_id": "Namaji Srinivasan",
                    "user_href": "/profile/Namaji-Srinivasan"
                },
                {
                    "user_id": "Matteo Sanesi",
                    "user_href": "/profile/Matteo-Sanesi"
                },
                {
                    "user_id": "James Boll",
                    "user_href": "/profile/James-Boll"
                },
                {
                    "user_id": "Matan Shelomi",
                    "user_href": "/profile/Matan-Shelomi"
                },
                {
                    "user_id": "James P Gilbert",
                    "user_href": "/profile/James-P-Gilbert"
                },
                {
                    "user_id": "Marcus Ford",
                    "user_href": "/profile/Marcus-Ford"
                }
            ]
        }
    ]
}