{
    "title": "How did the Kargil War end? - Quora",
    "tags": [
        "Kargil War",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajiv Vadera",
                "href": "/profile/Rajiv-Vadera"
            },
            "answer_text": "Pakistan had to withdraw unconditiinally. War ended on India’s terms. When things started turning around in India’s favour towards end of June, General Musharraf made Shariff go to US and meet Clinton on 4th July (please note it was a holiday in US due to American Independence day). Clinton knew the purpose of Shariff’s visit and he told Sharif not to come, if Pakistan does not want to withdraw unconditionally. Inspite of refusal to meet, Shariff went there. Musharraf just wanted to have an excuse to pull back his army. Initially Shariff told Clinton that we are ready to pull back our army, if India agrees to resolve Kashmir Issue in a time bound manner. Clinton told him you cant keep a gun on their head and ask them to agree to you. Clinton told him, it wont work. A little later, Shariff softened his stand and told Clinton that an unconditional withdrawal would be a big embarassement for Pakistan and he would lose his position as prime minister of Pakistan. But to disappointment of General Musharraf, Shariff had to return empty handed. Prolonging war would have just resulted in more casualties for Pakistan. So finally Shariff officially asked General Musharraf to withdraw the troops. Meanwhile Clinton managed to convince Vajpayee to allow safe passage for withdrawal of Pakistani troops. ",
            "date": "Answered August 5, 2018",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "SHRUTHEE B",
                    "user_href": "/profile/SHRUTHEE-B"
                },
                {
                    "user_id": "Shreya Prajapati",
                    "user_href": "/profile/Shreya-Prajapati-3"
                },
                {
                    "user_id": "Nirmal Vachhani",
                    "user_href": "/profile/Nirmal-Vachhani"
                },
                {
                    "user_id": "Santhosh Gowda",
                    "user_href": "/profile/Santhosh-Gowda-6"
                },
                {
                    "user_id": "Simran Kapoor",
                    "user_href": "/profile/Simran-Kapoor-56"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anurag Anand",
                "href": "/profile/Anurag-Anand-15"
            },
            "answer_text": "The war started with a lie - that the Pakistan Army is not involved in infiltration. As the war progressed, the truth came out and the world got to know that the Pakistan army was involved in the attack. Here’s why the war came to an end: The Indian Army re-captured the positions in Batalic, Tololing, Tiger Hill, Jubar Heights, among others. The Pakistanis were completely evicted from all posts they had capturedPakistan’s economy could not sustain a war for more than what was already fought. Any more, and their economy would have taken a severe hit. India’s economy took a hit too, but it was more manageable given the latter’s size and scaleLosses on both sides. India claimed about 500 souls lost to the war, Pakistan claimed about 4000. (Link: Over 4,000 soldiers killed in Kargil: Sharif)International pressure: While many claim that international pressure did the trick, it was hardly a significant factor; if at all, it may only have had the effect of dousing the last flame.",
            "date": "Updated July 31, 2018",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anshuman Sharma",
                    "user_href": "/profile/Anshuman-Sharma-272"
                },
                {
                    "user_id": "Vivek Sivasamy",
                    "user_href": "/profile/Vivek-Sivasamy"
                },
                {
                    "user_id": "Ruhan Jain",
                    "user_href": "/profile/Ruhan-Jain"
                },
                {
                    "user_id": "Sanjeev Dhariwal",
                    "user_href": "/profile/Sanjeev-Dhariwal"
                },
                {
                    "user_id": "Vivek Sapru",
                    "user_href": "/profile/Vivek-Sapru-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Wilkie",
                "href": "/profile/Kevin-Wilkie-2"
            },
            "answer_text": "The Kargil War came to an end on July 26th 1999 with the aid of international diplomatic intervention, due to which Pakistani troops exited Indian territories. ",
            "date": "Answered July 13, 2018",
            "views": "550",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asad Sethi",
                    "user_href": "/profile/Asad-Sethi"
                },
                {
                    "user_id": "Thorsten Braun",
                    "user_href": "/profile/Thorsten-Braun"
                },
                {
                    "user_id": "Philipp Nagel",
                    "user_href": "/profile/Philipp-Nagel-1"
                },
                {
                    "user_id": "Mohammad Zamin",
                    "user_href": "/profile/Mohammad-Zamin-3"
                }
            ]
        }
    ]
}