{
    "title": "How did Hinduism survive in Mughal period? - Quora",
    "tags": [
        "History in India",
        "Mughal Empire (1526–1857)",
        "Religion in India",
        "Hinduism in India",
        "History of Religion",
        "History of India",
        "Survival",
        "Hinduism",
        "Religion",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chetan Rattan",
                "href": "/profile/Chetan-Rattan"
            },
            "answer_text": "The question is wrong and betrays the questionor understanding of Indian history, Mughal period was the last of series of Muslim dynasties ruling from Delhi. The actual Muslim rules started in 1193 after defeat of Prithviraj Chauhan . The question also betray the real understanding of Indian history during this period , let me state few facts : A. It is a misconception that Islam arrived in India through invaders from north-west India IE across Khyber pass. B. Islam came to India through Traders and long before these invasions took place Muslims settlement were present in India on West coast from Kerala to GUJARAT.since the time of Prophet, the Cheraman masjid in Cochin can trace its history to 630 AD which makes it 2nd masjid of Islam after Madina and before Mecca. C. Islam did not come to India with Mohmaad bin Qasim in 711 AD, and this invasion's importance is nothing more than a foot note in history. D. Muslims kingdoms never ruled over large geography of India directly. E. Throughout the Muslim dynasty rule large geography of India was only under their nominal rule. F. Large geography like Rajputana, Eastern UP, Bihar, Bengal, Assam, Kerala, Tamilnadu, coastal Andhra Pradesh, Karnatka, Bundelkhand , Orissa, Jharkhand, Chattisgarh , even East Punjab including Present day Haryana and Himachal Pradesh were never under direct rule of dynasties from Delhi. Most of the lands in east Punjab were under Rajput Jagirdars who later in history converted to Sikhism and were known as PHULKIAN princes another example when Ahmad Shah Abdali was returning after winning 3rd battle of Panipat, he built JAGADARI GATE in AMBAWALA ( (present day AMBALA) to commemorate or thanks for support extended to him by local Jagirdars who were living in geography around the settlement of JAGADARI which is far older than settlement of Ambala, during the rule of Ranjit Singh a mint was present here ) Liaqat Ali Khan the first PM of Pakistan belonged to JAGIRDARI family of Panipat ) G. after defeating Hindu kings most of the Muslim kings did not usurp the lands but got into treaty with defeated King, recognising his soveirnity over his lands in exchange for annual tribute and support of army . H. Few of the Muslim kings of Delhi had such control that they could Proselytize with use of power. I. The most important was their unequal treatment of native Muslims; the converts did not enjoy any special treatment from the rulers , none could rise to seat of importance, most of the important position were occupied by imports from Iran, Turkey, Afghanistan and central Asian,. Even a traveller like Iban Batuta could become a member of inner circle of Mohmaad Bin Tughlaq J. Shahjahan when he built Jama Masjid could not find a single Muslim in India to be appointed as its official IMAM, he imported him from Bhukhara, and created a WAQF guaranteeing control to him and his family for all time to come, the present imam Bukhari and his family is direct descendants from the import by Shahjahan K. The most bigoted of Mughal ruler Aurangzeb offered Re.5 for every male and Re.3 to woman who converted to Islam ,Reference : http://www.aurangzeb.info/ L. Yes most were very prolific in destroying temples and most of it were political so as to subdue Hindu, put Hindu in his place, or show who has power to rule over Hindus, even Jajiya was an attempt to show Hindus their place in scheme of things under their rule but the best reason is \" destruction of temples was act of frustration and acceptance of defeat to the most religious of duty and vast majority of population rejected their religion and refused to convert \". M.this was a biggest failure in Islamic history of the globe as India is only place where after claiming to have ruled over for 1000 years Muslims were always a MINORITY, and never numbered more than 25% of total population.In other geographies they took less than 100years to convert 85% to 90%of population to new religion, example is Iran, Egypt, Afghanistan, Balochistan , Central Asia Turkey , even Iberian peninsula Malaya peninsula, Indonesia etc. N. The other reason which most historians and commentators forget to mention that despite their long rule the business, industry, trading ,banking never went out of control of Hindus, and the biggest of these is banking and AADAAT who are part of Indian culture more older than any other process , the GADDI and control of AADAAT in funding seeds, animal of burden, raw material , buying finished goods, agriculture produce and making it available to retail network has been so entrenched in India that they give very little space to newcomers and even in peak of Muslim rule more than 85% of the trade and banking was in the hands of Hindus . And this continued till end of British rule in 1947. O. And another fact which is always overlooked by most historians is that most of these Muslim kings from north to south were dependent on these bankers cum moneylenders for availibity of easy finance in case of emergency or shortage of revenue also........ I hope I have described how Hinduism survived during Muslim rule... ",
            "date": "Answered October 26, 2016",
            "views": "5",
            "upvotes": " View 66 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manthan Sharma",
                    "user_href": "/profile/Manthan-Sharma-163"
                },
                {
                    "user_id": "Jitendra Patil",
                    "user_href": "/profile/Jitendra-Patil-116"
                },
                {
                    "user_id": "Todd Stevens",
                    "user_href": "/profile/Todd-Stevens-63"
                },
                {
                    "user_id": "Vishnu Vardhan",
                    "user_href": "/profile/Vishnu-Vardhan-1016"
                },
                {
                    "user_id": "Panda Lima Pepe",
                    "user_href": "/profile/Panda-Lima-Pepe"
                },
                {
                    "user_id": "Ansuman Kumar",
                    "user_href": "/profile/Ansuman-Kumar-13"
                },
                {
                    "user_id": "David Fletz",
                    "user_href": "/profile/David-Fletz"
                },
                {
                    "user_id": "Isha Chaturvedi",
                    "user_href": "/profile/Isha-Chaturvedi-4"
                },
                {
                    "user_id": "Saurabh Gupta",
                    "user_href": "/profile/Saurabh-Gupta-1046"
                },
                {
                    "user_id": "Jatin Arora",
                    "user_href": "/profile/Jatin-Arora-98"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maulana Oraf",
                "href": "/profile/Maulana-Oraf"
            },
            "answer_text": "Aurangazeb aside, most imperial guards were Hindu. Babor didn't come to India seeking to blow up Temple's. That's not how emperor's operate. Only galli rajas to that cheap stuff. Not Babor. Babor was invited here first by daulat Khan, then by Janjua Rajputs Confederacy to lead them against the Sultanate. So Babor was coming here to dispose off an Islamic kingdom already , one that was paying tribute to Persia. Mughals didn't pay tribute to anyone. Babor servered that tax he paid. Before Aurangazeb, Hinduism wasn't a core ideology in India. Mughal history is usually a fight between Pathans and Uzbeks as far as who is top dawg goes. A Hindu faction became big (Maratas) for 80 years after formation. Then Desi's preferred giving leadership to British. Different Hindu factions supported different sidez. Maharana Pratap made alliance w Hakim Shah Sur while Akbar made alliance with Sultan Man Singh I. Whose the Hindu side and Muslim side here ? Emperor's , unlike galli goonda captains, don't care what religion u follow. Babor came here to rule. To rule anything / anyone. As long as sqkm is there to govern, and as long as people paying taxes to it regularly and as long as hafeem bowls keep coming, ain't NO Mughalai, except Aurangazeb, gonna complain. Timur was perhaps more of the raider type leader u have in mind but his weath in India was directed at Muslims at Delhi over some low caste joke they made about Timor earlier on. He didn't find that funny. ",
            "date": "Answered October 13, 2019",
            "views": "66",
            "upvotes": " View 47 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marek Jones",
                    "user_href": "/profile/Marek-Jones"
                },
                {
                    "user_id": "Todd Stevens",
                    "user_href": "/profile/Todd-Stevens-63"
                },
                {
                    "user_id": "Faisal Khan",
                    "user_href": "/profile/Faisal-Khan-770"
                },
                {
                    "user_id": "Arish Qureshi",
                    "user_href": "/profile/Arish-Qureshi-4"
                },
                {
                    "user_id": "Sakshi Shingote",
                    "user_href": "/profile/Sakshi-Shingote-1"
                },
                {
                    "user_id": "Rohan",
                    "user_href": "/profile/Rohan-1106"
                },
                {
                    "user_id": "Syed Khalid",
                    "user_href": "/profile/Syed-Khalid-23"
                },
                {
                    "user_id": "Pratyush Adhikary",
                    "user_href": "/profile/Pratyush-Adhikary-1"
                },
                {
                    "user_id": "Abdulla Sharafuddeen",
                    "user_href": "/profile/Abdulla-Sharafuddeen-1"
                },
                {
                    "user_id": "Sujan Vijayaraj",
                    "user_href": "/profile/Sujan-Vijayaraj"
                }
            ]
        }
    ]
}