{
    "title": "How popular was German reunification in East Germany? - Quora",
    "tags": [
        "Reunification of Germany",
        "German Democratic Republic (DDR)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guido Bollue",
                "href": "/profile/Guido-Bollue"
            },
            "answer_text": "Reunification was highly popular before and during the proper execution. Once this was consumed, disenchantment kicked in and did persist to a certain degree until today. This is due to a lot of misconceptions that the inhabitants of the German Democratic Republic had about life in the capitalist West and their own ability to cope with it. They naively thought that a reunited Germany was going to provide them with all advantages of the (mildly capitalist) West German economy without confronting them with the prerequisites, disadvantages, and restrictions inherent to such a system. Job security in Eastern Germany was almost absolute. Incompetence, low qualification, and laziness were no reasons to be fired, only criticizing the regime could put your job in jeopardy. After reunification there was much emphasis on retraining/requalification, flexibility, and mobility. After the partial collapse of the East German economy (see below), the best jobs went to the few East Germans that were able to cope (a minority!) and “imported” West Germans, soon to be hated by their East German co-workers calling them “BesserWessies” (western persons always knowing everything better). The complaining East Germans were in turn scolded by the West Germans as “JammerOssies” (eastern persons always bitterly complaining). Housing in the GDR was lousy (crumbling old buildings or newer, crappy build concrete rabbit boxes) but cheap. When the housing was much improved by an influx of western capital, the costs of housing (rents, utilities, auxiliary costs) started going up and put a strain on the budget of many, now unemployed or low-wage, inhabitants of Eastern Germany. Paying their rent to, in many cases, “western” owners, they felt exploited and ripped off. The East German economy collapsed to a great extent immediately after reunification. This came as a big surprise to the GDR inhabitants and even some people in the West. The East German industry was in a bunch (not all) of manufactured goods better than most of the Eastern Block countries. Staying within this “market”, the manufacturers were competitive in price and quality and very much touted as such by the GDR nomenclature. At the other side, the East Germans had been fed through decades a lot of lies concerning the equal quality (or even superiority) of the GDR industrial products compared to the Western ones. The common worker (and her/his family) had no idea how outdated industrial production really was and how much it lagged in efficiency. After reunification, there was a common currency (DM) and a level of pay, although still inferior to the west, that was compatible with the, now higher, costs of living. Both decisions were made by the government for understandable political reasons. Not spreading the (originally west) DM to the East would have fueled the already dramatic defection of a qualified workforce to the West still more. Not raising the pay level would have left the East Germans as “working poor” in their own, now reunited, country. Under social aspects these measures were wise and justified, under an economic aspect they were a complete disaster for the ex-GDR manufacturers. The common currency, through the elimination of exchange rate changes and devaluations, brutally exposed their blatant lack of competitiveness on the, now accessible, Western markets. At the same time, the higher pay level combined with inefficient production capacities and partially low qualification caused a surge in the production costs that completely outpriced the East German products on their established ex Eastern Block markets. In a nutshell, the Western markets did not want the unattractive production, the Eastern market could not afford it. There were indeed some good East German products that would have “made it” if they had been marketed in a decent way. East Germans manufacturers had no skills whatever in Sales and Marketing. They had just delivered their products to internal units that needed them dearly or to an Import/Export state institution that shipped them to a foreign country. In most cases, they did not even know their customers. When they entered the, now westernized, competitive market they were completely lost. A businessman at that time quipped: “It is like a junior amateur bantam-weight boxer slugging it out in the ring with a heavyweight world champion”. The eastern Germans customers at first completely dropped their own durable consumer goods and groceries brands and flocked to the well-advertised and fancily packaged Western makes. Later, there would be a revival; this was however too little too late to save the original manufacturers. In the meantime, the former east Block countries had gradually opened their markets and there too, the aggressive western branding and marketing eclipsed the indigenous and Easter German brands. Only the Soviet Union still existed but was in such a political and economic turmoil that it stopped to be a customer for East German products too. Some East German products were not fancy or technically advanced but were known for their rugged stamina in daily use. Unfortunately, they often did not meet long established Western German or EU requirements. As an example; it was a long established standard that the innards of meat-processing machines in contact with fresh grounded material need to be made out of stainless steel; the East German machines were not and a conversion was not possible without replacing all lathes and all tooling. This was prohibitive costly and lead to the collapse of the manufacturer. Later, all this was declared by many East Germans as a deliberate deindustrialization of the East of Germany. After the fall of the wall and the collapse of the East/West border, about two millions (a sizeable part of the 16 million GDR citizens) flocked to the better paid and more rewarding jobs as well as to the more fancy living conditions in Western Germany. Those people were the younger, better skilled, and more agile part of the workforce. Most of them succeeded in the West and never looked back. This however deprived Eastern Germany of the people most apt to “push the wagon” and left behind a score of disgruntled folks that were harder to mobilize for change but prone to complain. The newer generation has now understood that there is also a future in, at least part of, the Eastern Counties and the economy of Eastern Germany is now closing in on the West. All is not yet rosy though. After the collapse of the existing industry, it was replaced by local plants of Western German and international companies. This is a boost to employment, however there are no HQ of big companies in the East and the top jobs (even in politics) are held by folks originating from Western Germany (or even from abroad). This combination of old grudge and still missing complete equality is a fertile ground for both left-wing and right-wing zealots and conspiration theory lunatics. The revised history as narrated by the left: The demise of the communist Eastern Germany economy is no proof that communism does not work. The gullible GDR citizens were lured by the skilled propaganda of “the West” into a huge trap and turned away from their leaders, that had made some minor mistakes and therefore lacked popularity. After the reunification, the Western Capitalists on purpose deindustrialized the East to avoid competition from these highly efficient manufacturers, churning out superior products made by motivated, dedicated and overall happy workers. This narrative sits well with the now frustrated beneficiaries of the old system, the workers that “did not make it” after the reunification and a younger generation that has been told by the first mentioned ones how nice life in the GDR was. It is quite understandable that in many cases grandpa is not telling his grandchildren that he served a crooked, Soviet Union controlled, regime or churned out products nobody wanted with the help of outdated, inefficient and extremely polluting production methods. Russian and some other East European trolls just love this story; you can read it on social media and even on Quora. The revised history as narrated by the right: Communism was lousy, and you bravely put it down. The reunification did put you at the mercy of a left leaning bunch of Western politicians that want to import cheap and sleazy foreign workers and rapist immigrants to replace the valuable “true German” populace of these counties. You need to hate and fight those leftist West Germans, like chancellor Merkel, and keep your blood clean. We will help you with that. It is interesting to note that most of these right-wing self-proclaimed saviors of the East Germans are originating from the West and the much hated “leftist” chancellor lived and was educated in the East. This narrative is also quite welcome to the same Russian and Eastern European trolls as well as to the far right everywhere in the world that predict the complete decline of Germany in a wave of knife-yielding Muslim foreigners killing all “true Germans”. Again, you can witness this on social media. Conclusion. Most East Germans did favor and were happy with the reunification; not all of them. Disenchantment with some occurrences continues to foster discontent and political extremism. It will take another decade, or more, to weed this out completely. ",
            "date": "Answered June 28, 2020",
            "views": "89",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Klupp",
                    "user_href": "/profile/Jeff-Klupp"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                },
                {
                    "user_id": "Johannes Walter",
                    "user_href": "/profile/Johannes-Walter-5"
                },
                {
                    "user_id": "Frank Jürke",
                    "user_href": "/profile/Frank-Jürke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Oyonami Rui",
                "href": "/profile/Oyonami-Rui"
            },
            "answer_text": "The idea of it was really popular, but the way it happened was barbaric. Germans on east side in GDR wanted integration, peaceful reunification, but not the annexation. And they even could not imagine, what deindustrialisation is, when this horrible process started. ",
            "date": "Answered June 28, 2020",
            "views": "106",
            "upvotes": "0"
        }
    ]
}