{
    "title": "How much do Hungarians and Romanians actually hate each other? - Quora",
    "tags": [
        "Romanian Ethnicities and People",
        "Hungarian People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabriella Alesi",
                "href": "/profile/Gabriella-Alesi"
            },
            "answer_text": "It depends… I am a Hungarian from Romania. My stepfather’s half brother married a Romanian woman who we do not really like. Then again, she is nuts (literally). However, there are plenty of Romanians I met in the US who happened to be nice people. One was a former classmate (who married an Indian man in the US, who treats her like a queen) who was really nice. Another was a not so smart (but very in need of a friend) woman who married a much older (half- Romanian, half - Italian) man who was cheating on her husband, and every time she went out with one of her other men, told her hubby that she was with me. Needless to say, her hubby thought I was a lesbian at the time and wanted to take her from him. The third one was a psychologist in Romania… very nice woman, but a babysitter/ nanny in the US. The fourth one was a former manager of mine… as soon as I found out she was Romanian, I blurted out EVERYTHING I could think of in Romanian (the neutral, the rude, the ugly… all ending with the Romanian translation of “I pooped on myself!”). I am not great with people, but each time I messed up, she defended me. In the US, most of the times a Hungarian meets another, they will either ignore you or think, “How can I use this idiot to benefit me?” ",
            "date": "Answered August 31, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cristian Malide",
                    "user_href": "/profile/Cristian-Malide"
                },
                {
                    "user_id": "Adrian Dragodan",
                    "user_href": "/profile/Adrian-Dragodan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Clings",
                "href": "/profile/Peter-Clings"
            },
            "answer_text": "I am coming from a mixed Romanian Hungarian background but acquired a Canadian perspective over my decades of living abroad. I still have family, friends back and a host of memories to be able to share my perspective on the matter During the long duration of cohabitation between the two people, the interrelationships shifted dramatically over time. It seems to me that in the newer generations ignoring each other would be a better description of their feelings. A few generations prior of them the sentiment of hatred was fuel by the conscious efforts to build national states and a national mythology based on history presented in heroic and rosy terms. But if one looks at the historical events, say at the times of King Matthias and before that, people of the two ethnicity were quote friendly so the shift must have been ignited by actions coming after. I cannot pinpoint an exact cause, just maybe to associate the hatred to the shift in approach in the Hungarian Kingdom that also caused the Peasant Rebellion of György Dozsa in 1512, and later the spread of the Tripartitum - Wikipedia (a set of laws meant to quell the rights of the peasants in Transylvania) It is still good that both Hungarians and Romanians took a moderate stands and things moved on quite peacefully in contemporary times though (compared that to Bosnia or Kosovo). But the animosity transpire to this day in the debates regarding historical events, and I am not happy with that ",
            "date": "Answered July 16, 2019",
            "views": "451",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marius Filip",
                    "user_href": "/profile/Marius-Filip-1"
                },
                {
                    "user_id": "Cristian Malide",
                    "user_href": "/profile/Cristian-Malide"
                },
                {
                    "user_id": "Viktor Madar",
                    "user_href": "/profile/Viktor-Madar"
                },
                {
                    "user_id": "Adrian Dragodan",
                    "user_href": "/profile/Adrian-Dragodan"
                },
                {
                    "user_id": "Karmanoczki Gábor",
                    "user_href": "/profile/Karmanoczki-Gábor"
                }
            ]
        }
    ]
}