{
    "title": "How is Lawrence of Arabia viewed in Muslim community? - Quora",
    "tags": [
        "T. E. Lawrence",
        "Lawrence of Arabia (1962 movie)",
        "Muslim Community",
        "Saudi Arabia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rachid Haroune",
                "href": "/profile/Rachid-Haroune"
            },
            "answer_text": "Before 1908, people traveled from Levante to Mecca by caravans in an exhausted long journey; many died on the way as the heat was unbearable especially old people, and water was scarce as the caravans went through the desert. It was hard not only for pilgrims but for businessmen as well, who used to suffer as the sand dune was a real obstacle for their commerce. Then the Hejaz railway came to rescue. the long journey of forty days became a journey of 5 days. Things were not easy at first, the empire was suffering financially and such a huge project required a substantial budget. Thus, official and popular committees were formed in most Islamic countries to collect donations for its construction. Muslims received this project with great enthusiasm because it would offer pilgrims to Mecca comfort and security in their journey, and spare them time and money.  The railway was a great deal; the train made a significant social transformation wherever it passed. Economic life along the route thrived; the railway stations became vital social centers, trade and transport between Al Hijaz and the Levant increased significantly, the number of pilgrims increased to 300000 passengers a year. Lawerence and his Arab allies led by Prince Faisal had a different view; they saw the railway as a real danger to their rebellion. Lawerence was after all a British officer he did what he was ordered to do. The blame was upon those they followed his instructions blindly. For a long time, Lawerence was portrayed in the media as a legend, and his daring raids in destructing the infrastructures were heroic acts, not terrorist ones. Today, In the Middle East the desert warrior’s legacy is written in sand. He is no longer a hero and \"The Great Arab Revolt\" is no longer considered as a real revolt but a disgraceful act led by impressionable and greedy opportunists. After all, the end justifies the means; the Arab world splintered apart. ",
            "date": "Answered July 29, 2020",
            "views": "31",
            "upvotes": " View 74 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Waleed Khalid Shaikh",
                    "user_href": "/profile/Waleed-Khalid-Shaikh-2"
                },
                {
                    "user_id": "Atang-Wabonê Mālik",
                    "user_href": "/profile/Atang-Wabonê-Mālik"
                },
                {
                    "user_id": "Ossamah Farhi",
                    "user_href": "/profile/Ossamah-Farhi"
                },
                {
                    "user_id": "Sharanya Narayanan",
                    "user_href": "/profile/Sharanya-Narayanan-1"
                },
                {
                    "user_id": "Sandeep Kumar",
                    "user_href": "/profile/Sandeep-Kumar-25023"
                },
                {
                    "user_id": "Autumn Lynch",
                    "user_href": "/profile/Autumn-Lynch-6"
                },
                {
                    "user_id": "Mahmoud Elfar",
                    "user_href": "/profile/Mahmoud-Elfar-1"
                },
                {
                    "user_id": "MS Radityo",
                    "user_href": "/profile/MS-Radityo"
                },
                {
                    "user_id": "Ayesha Ahmed",
                    "user_href": "/profile/Ayesha-Ahmed-495"
                },
                {
                    "user_id": "Yusha Southpaw",
                    "user_href": "/profile/Yusha-Southpaw"
                },
                {
                    "user_id": "Mohammed Kalam",
                    "user_href": "/profile/Mohammed-Kalam-1"
                },
                {
                    "user_id": "Mohammad Saiful Alam",
                    "user_href": "/profile/Mohammad-Saiful-Alam-2"
                },
                {
                    "user_id": "Asad Akram",
                    "user_href": "/profile/Asad-Akram-1"
                },
                {
                    "user_id": "Azharali Zaini",
                    "user_href": "/profile/Azharali-Zaini"
                },
                {
                    "user_id": "Momtaj Alam",
                    "user_href": "/profile/Momtaj-Alam-2"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Suryanarayanan Radhakrishnan",
                    "user_href": "/profile/Suryanarayanan-Radhakrishnan"
                },
                {
                    "user_id": "Alon Poleg-Polsky",
                    "user_href": "/profile/Alon-Poleg-Polsky-1"
                },
                {
                    "user_id": "Jonas Hellberg Hellberg",
                    "user_href": "/profile/Jonas-Hellberg-Hellberg"
                },
                {
                    "user_id": "Bouachrine Abdelkrim",
                    "user_href": "/profile/Bouachrine-Abdelkrim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Osama Albayti",
                "href": "/profile/Osama-Albayti"
            },
            "answer_text": "I don’t speak for all of the Muslim community, but I hope my answer adds to the diversity of views expressed on this topic. This is what I believe. Lawrence was not two-faced, and he didn’t scheme against Arabs. He was involved in way too many things to have been in control of what he was doing. He wanted to serve his country by making Arabs a united front against the Turks, but he didn’t want the Arab unity to dissolve into the arbitrary borders drawn by the English and the French. I know it seems as though I agree with the premise of the movie but I had this opinion of Lawrence before watching it. The only thing the movie misses is that many Arabs were not Badu. The movie completely failed on that point. It should be known that Awrence (with out the L) was a common name among some Badu, which speaks to the popularity of the man. This is important since Arabs were able to distinguish him from the British government. This is the government responsible for a lot of division in the Middle East. This is the government that has on its hand the deaths of Arabs and Jews in Palestine from the day they deceived both until the day the conflict is resolved. Yet, many Arabs were still able to see Lawrence of Britain as a good person. ",
            "date": "Answered October 11, 2017",
            "views": "39",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Regal Bastard",
                    "user_href": "/profile/Regal-Bastard"
                },
                {
                    "user_id": "Aggelos",
                    "user_href": "/profile/Aggelos-7"
                },
                {
                    "user_id": "Avery Evans",
                    "user_href": "/profile/Avery-Evans-2"
                },
                {
                    "user_id": "Richard Stephen",
                    "user_href": "/profile/Richard-Stephen-10"
                },
                {
                    "user_id": "James Quinonez",
                    "user_href": "/profile/James-Quinonez"
                },
                {
                    "user_id": "Daniel Siegfried Traver",
                    "user_href": "/profile/Daniel-Siegfried-Traver"
                },
                {
                    "user_id": "Jack Doyle",
                    "user_href": "/profile/Jack-Doyle-40"
                },
                {
                    "user_id": "Steve Perry",
                    "user_href": "/profile/Steve-Perry-1"
                },
                {
                    "user_id": "Joe Cooper",
                    "user_href": "/profile/Joe-Cooper-52"
                },
                {
                    "user_id": "Vasu Jaganath",
                    "user_href": "/profile/Vasu-Jaganath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Utku Aras",
                "href": "/profile/Utku-Aras"
            },
            "answer_text": "He is MI6.. MI5 whatever you call it. We Turks hate him. He turned Arabs against us. Quite a massacra. I forgot how many gold had been paid to Arabs per a Turk’s head by him and his goverment. He caused a riot to dissolve ottoman empire. Definetely his british MI6 woman rival at the time at the same geography was better with all her causes and things she created… bastard yes thats what he is. Did brits colonized there no they couldnt. So he was incaple of doing any good. Just evil. Thats the bottomline. Thanks to british documentary on TV ",
            "date": "Answered February 3, 2020",
            "views": "516",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yasmin Patel",
                    "user_href": "/profile/Yasmin-Patel-64"
                },
                {
                    "user_id": "Khan Javed",
                    "user_href": "/profile/Khan-Javed-8"
                },
                {
                    "user_id": "Ilias",
                    "user_href": "/profile/Ilias-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "M. Talha Ilhan",
                "href": "/profile/M-Talha-Ilhan"
            },
            "answer_text": "I am from Turkey and as you may be aware when Lawrence doing his thing (^^), those lands where under Ottoman Empire’s jurisdiction. So for Turkish people’s view on Lawrence of Arabia is mostly, he was a very smart person, dedicated, we were careless to fall his ploys etc. Mostly mix of respect, regret, sadness… ",
            "date": "Answered October 6, 2016",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sermet Bekiroğlu",
                    "user_href": "/profile/Sermet-Bekiroğlu"
                },
                {
                    "user_id": "Michael Mclaughlin",
                    "user_href": "/profile/Michael-Mclaughlin-76"
                },
                {
                    "user_id": "Jonri Purwak",
                    "user_href": "/profile/Jonri-Purwak"
                }
            ]
        }
    ]
}