{
    "title": "How did Joanna in the New Testament die? - Quora",
    "tags": [
        "The New Testament"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Christian Hansen",
                "href": "/profile/Eric-Christian-Hansen"
            },
            "answer_text": "Joanna was strangled to death by Cornelius the Roman Centurion, who the Apostle Peter later baptized in the name of the Father, Son, and Holy Spirit. “You did WHAT ?” — James, brother of Jesus - referring to Peter’s baptism of Cornelius [If I remember correctly, this may have been the last line in the mini-series.] She was strangled to death of her own choosing. She was given the choice of death by strangulation or death by crucifixion. Those were the 2 choices Governor Pontius Pilate offered her for penalty for converting Tabitha to Jesus. Tabitha was the servant of Herodias, wife of King Herod Antipas. Joanna was also the servant of Herodias. Her husband had a good job as King Herod’s steward. Mary Magdalene was the servant of Pilate’s wife Claudia. Mary was largely to blame for Joanna’s death and Tabitha’s death. Tabitha was flogged by Cornelius, and soon she died from the blood loss, but Simon Peter raised her from death (in her home village) in the name of Jesus. No mention is made of what happened to the body of Joanna. It was likely too dangerous at this point for the followers of Jesus to request her body from Pilate. So Simon Peter really had no opportunity to attempt to raise her from death. Joanna’s husband, steward of King Herod Antipas, quite possibly was given her dead body for proper burial, but we can only imagine. source: A.D. The Bible Continues, a 12-part made for t.v. mini-series produced by Roma Downey (Touched By An Angel’s, Monica character) and her husband. Available on DVD and Blue Ray. PIC: Joanna   PIC: Roman Centurion Cornelius PIC: Herodias and King Herod Antipas  ",
            "date": "Answered July 27, 2020",
            "views": "107",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Rowley",
                "href": "/profile/Philip-Rowley"
            },
            "answer_text": "Who Knows when any of the women who went to our Lord’s tomb after His Resurrection, actually died. (Luke 24:10) Mary Magdalene was also in this company and there are many conspiracy theories of what happened to her! Probably died of old age. ",
            "date": "Answered July 31, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        }
    ]
}