{
    "title": "How long does human memory take to record important events? - Quora",
    "tags": [
        "Cognitive Science",
        "Memories",
        "Memory (information storage)",
        "Human Memory",
        "Human Brain",
        "Neuroscience",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natali Jakarian",
                "href": "/profile/Natali-Jakarian"
            },
            "answer_text": "Not long. Not long at all. Our memory is divided into short-term and long-term memory. The short term is the first 15–30 seconds, while the long term memory (aka where important events are stored) anything more than 30 seconds of remembering. Thing is, our memories are not a videotape in our brain, it’s rather an activity reconstruction form elements that are in many parts of the brain. Memory storage is an ongoing process of reclassifications from changes in our neural pathways. Encoding any event starts with perceptions from our senses, whether we want to learn something we’re seeing, listening or touching. but attention is usually the start of a process. The attention is regulated by our thalamus and frontal lobe. When an event happens, neurons start to fire more. And the more intense the firing frequency is, the more likely an event is going to be remembered. We have several parts that help us in our memory storage, such as the amygdala, hippocampus, medial temporal lobe and so on. It’s a very complicated system and the speed is quite impressive. Forgetting can result from incorrect or incomplete codes of memory, or there could be a mismatch between retrieval cues and original encoding of the memory. The latter happens when you try to remember something at some specific time and don’t, only to remember it later. It’s your brain’s f**k you system. Forgetting follows what’s called a logarithmic curve; information loss may be rapid in the start but as time goes on, it’s slower. Meaning, you learn a piece of new information, but that information is unstable, therefore, you forget it fast. If you relearned it and read through the piece of information again, then there’s more resistant to forgetting. ",
            "date": "Answered October 11, 2019",
            "views": "15",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arun K Shukla",
                    "user_href": "/profile/Arun-K-Shukla"
                },
                {
                    "user_id": "Tamar Te",
                    "user_href": "/profile/Tamar-Te"
                },
                {
                    "user_id": "Aquino Marky",
                    "user_href": "/profile/Aquino-Marky"
                },
                {
                    "user_id": "B.A. Dick",
                    "user_href": "/profile/B-A-Dick"
                },
                {
                    "user_id": "Jeremiah D. Seitz",
                    "user_href": "/profile/Jeremiah-D-Seitz"
                },
                {
                    "user_id": "David Shen",
                    "user_href": "/profile/David-Shen-19"
                },
                {
                    "user_id": "Atullkhan Khan",
                    "user_href": "/profile/Atullkhan-Khan"
                }
            ]
        }
    ]
}