{
    "title": "How does Impossible Foods make meat from plants? - Quora",
    "tags": [
        "Veganism",
        "Meat",
        "Cell Biology",
        "Plants"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jenny Hamilton",
                "href": "/profile/Jenny-Hamilton-1"
            },
            "answer_text": "From this page: The veggie burger that bleeds like real meat - CNET Meet the Impossible Cheeseburger. Its creator, Stanford biochemistry professor Patrick Brown, developed the burger out of nothing but plant ingredients, and looks just like the real thing. Apparently, it also tastes like real meat -- and has a similar texture, according to the Wall Street Journal, which described it as a flavour cross between beef and turkey, leaving a blood-like moisture  on the plate. It is also \"slightly lighter, perhaps even fluffier, than a  typical burger and it tastes less bloody. But the bites still have the  consistency of animal tissue. It isn't overly spongy like tofu. Instead,  the meat granules cling together, as one would expect in a burger.\" This is achieved using a chemical compound known as heme -- a protein that can both be found in haemoglobin, the red pigment in blood, and the roots of nitrogen-fixing plants.  These plants -- which include legumes -- are unable to extract nitrogen  from the air on their own, so they enlist the aid of symbiotic bacteria  called rhizobia, which live in their root nodules. These bacteria help  the plants extract and store nitrogen.  Heme also contains iron which, when exposed to oxygen, turns red -- just like blood -- and also creates those meat flavours. \"[Heme]  is basically 99 percent of the secret to meat flavor. Heme is the  molecule that makes meat taste like meat. It's the reason meat tastes  like nothing else. It's the reason why red meat, which has more heme,  tastes meatier to people than white meat,\" Brown said. ",
            "date": "Answered November 10, 2014",
            "views": "26",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Pilger",
                    "user_href": "/profile/John-Pilger-4"
                },
                {
                    "user_id": "Neel Vashisht",
                    "user_href": "/profile/Neel-Vashisht"
                },
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "Cynthia Chan",
                    "user_href": "/profile/Cynthia-Chan-10"
                },
                {
                    "user_id": "Shaun Haney",
                    "user_href": "/profile/Shaun-Haney"
                },
                {
                    "user_id": "Sorin Platon",
                    "user_href": "/profile/Sorin-Platon"
                },
                {
                    "user_id": "Adina Cappell",
                    "user_href": "/profile/Adina-Cappell"
                },
                {
                    "user_id": "Manish Dev Vishwakarma",
                    "user_href": "/profile/Manish-Dev-Vishwakarma-1"
                },
                {
                    "user_id": "Iris Tu",
                    "user_href": "/profile/Iris-Tu"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Barak",
                "href": "/profile/David-Barak-3"
            },
            "answer_text": "It’s not actually meat, but one of the core factors is the clever genetic modification of pea plants, I believe. Whatever plant they’ve worked with has been engineered to produce heme, an iron-containing compound in meat, which is what gives it that very slight metallic/blood taste. I think, too, the manufacturer adds coconut oil, which stays solid at room temperature. When cooked, the coconut oil melts and oozes like the fats in meat. I’m sure there are other things they do that I’ve forgotten, but as I understand it, their product is about as close as you can get to real meat so far. ",
            "date": "Answered February 2, 2018",
            "views": "571",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Joe",
                    "user_href": "/profile/Bob-Joe-982"
                },
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ellen Kessler",
                "href": "/profile/Ellen-Kessler-8"
            },
            "answer_text": "A combination of plants and chemicals make the Impossible Burger. But it was only possible after it was tested on animals who were later slaughtered and biopsied. Please don’t think this GMO-laden “thing” is vegan because it’s not. Even Impossible Foods admits it.  ",
            "date": "Answered July 11, 2018",
            "views": "227",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cynthia Chan",
                    "user_href": "/profile/Cynthia-Chan-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brad Mitchell",
                "href": "/profile/Brad-Mitchell-35"
            },
            "answer_text": "They don’t. They make a substance that resembles and (depending who you talk to) tastes like meat. ",
            "date": "Answered September 17, 2019",
            "views": "9",
            "upvotes": " Answer requested by Mike Castrova"
        }
    ]
}