{
    "title": "How has the original recipe for ketchup changed since it was first invented in 1876? - Quora",
    "tags": [
        "Ketchup",
        "Condiments",
        "History of Food",
        "Invention and Inventions",
        "Recipes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Malcolm Minchin",
                "href": "/profile/Malcolm-Minchin"
            },
            "answer_text": "Ketchup wasn’t invented in 1876. Heinz created it’s own version of Tomato Ketchup in 1876. And their recipe has certainly changed. Instead of sugar, they’ve moved to use Corn Syrup and High Fructose Corn Syrup. This naturally made a lot of people very angry. So you can get the version with Sugar again. But, ignoring the green and purple versions, the spicy ones, all the variations on the theme, doubt the basic recipe of Tomato, Vinegar, Sugar, Salt has changed that much. Levels of spices and seasonings ain’t gonna change except incrementally. Or to taste. Is there a Heinz Ketchup taster? Probably. The original recipe for Ketchup is buried in the swamps of time, the product of a thousand people fermenting fish, pureeing walnuts, roasting mushrooms. Heinz’s original is theirs, not the worlds. Ketchup is simply a word for Sauce. See: Ketchup - Wikipedia Heinz Tomato Ketchup - Wikipedia ",
            "date": "Answered July 20, 2019",
            "views": "82",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karen Nordhus",
                    "user_href": "/profile/Karen-Nordhus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tricia Kavanagh",
                "href": "/profile/Tricia-Kavanagh"
            },
            "answer_text": "First off ketchup is not an American creation plus it was a valued condiment clear back to the ancient rulers of Chinese dynasties [ the hokkien word - ke-tsiap -which is a type of fish sauce], who used various mixtures including fish. A farmer named Yerxa was the fist to sell tomato ketchup in a bottle. The earliest recipe I know about is from 1732- Richard Bradley’s Ketchup Paste. But UK old concoctions included such things as wild mushrooms, walnuts, oysters etc. The advent of the tomatoe most likely did not make it’s appearance in a big way until 1812- Mr Mease calling tomatoes “love apples” Of course, all recipes get changed over the years. The only time I do not deviate from a recipe is in baking,where even the smallest “screw up” can cause you to have a failure. I make my own tomato paste from Roma tomatoes and other non-juicy tomato pulp and I do not always use the same spicing regimen ",
            "date": "Answered July 20, 2019",
            "views": "66",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Karen Nordhus",
                    "user_href": "/profile/Karen-Nordhus"
                }
            ]
        }
    ]
}