{
    "title": "How did people talk in 16th century England? - Quora",
    "tags": [
        "16th Century"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gill Bullen",
                "href": "/profile/Gill-Bullen"
            },
            "answer_text": "There are several good answers here saying, just look at Shakespeare, Sir Philip Sidney and the rest, which are perfectly right, but… They were writing poetry, or poetic drama, and this should not be mistaken for the ordinary, everyday speech of Elizabethan England. Don't look at the grand speeches in iambic pentametres, full of imagery and literary devices for your picture of this, but at the prose dialogue of the uneducated, working class characters — Henry V's soldiers, the Rude Mechanicals producing an amateur performance of Pyramus and Thisbe, people like that. And look at the Authorised Version of the Bible, the King James edition. This is a little bit later, but not much, and is probably a much better guide to everyday Elizabethan English than Hamlet — unless, of course, you are looking at the gravediggers. ",
            "date": "Answered January 26, 2018",
            "views": "32",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diana Aulicino",
                    "user_href": "/profile/Diana-Aulicino-1"
                },
                {
                    "user_id": "Robert Cameron",
                    "user_href": "/profile/Robert-Cameron-16"
                },
                {
                    "user_id": "Elizabeth Coates",
                    "user_href": "/profile/Elizabeth-Coates"
                },
                {
                    "user_id": "Barry Blatt",
                    "user_href": "/profile/Barry-Blatt-1"
                },
                {
                    "user_id": "Will Busby",
                    "user_href": "/profile/Will-Busby-1"
                },
                {
                    "user_id": "Eamon O'Kelly",
                    "user_href": "/profile/Eamon-OKelly"
                },
                {
                    "user_id": "John McEwan",
                    "user_href": "/profile/John-McEwan-13"
                },
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-1"
                },
                {
                    "user_id": "Reena Venkataraman",
                    "user_href": "/profile/Reena-Venkataraman"
                },
                {
                    "user_id": "Adora F",
                    "user_href": "/profile/Adora-F"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Talmage",
                "href": "/profile/Philip-Talmage"
            },
            "answer_text": "As I wrote just now in answer to What were mannerisms used when talking in 16th century England? You have to wonder why the OP wanted to remain anonymous. Maybe he never heard of Shakespeare? Or just couldn’t be bothered to try reading any of his plays. Or those of Christopher Marlowe and other Elizabethan playwrights. Or of course, he might try finding something posted on YouTube during 1500–1599.So it’s pleasing that Adora didn’t write this question anonymously. ",
            "date": "Answered January 26, 2018",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ditch Abbott",
                "href": "/profile/Ditch-Abbott"
            },
            "answer_text": "It was something of a mess in that the 16th century was the culminating period of the Great Vowel Shift - Wikipedia. By Shakespeare’s time, and in London itself, this had largely been completed and so pronunciations, though still sounding different, were not crazy different from modern English. Depending on where and how early in the 16th century, an English speaker might be talking with a very exaggerated pirate accent. ",
            "date": "Answered February 7, 2018",
            "views": "15",
            "upvotes": "0"
        }
    ]
}