{
    "title": "How cruel were the Japanese in WW2? - Quora",
    "tags": [
        "Military History and Wars of Japan",
        "Historical Japan",
        "Cruelty",
        "Japan in World War II",
        "Japanese Ethnicity and People",
        "Japan",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Tait MacDonald",
                "href": "/profile/William-Tait-MacDonald"
            },
            "answer_text": "Have you seen the movie “The Bridge on the River Kwai”? Well, it is incorrect in almost every detail. Firstly, the most senior allied officer was British, not an American, and he was no collaborator, and instead did everything possible to delay, sabotage and undermine the railway construction in Burma. Secondly, the Japanese officers were harsh, but nowhere near as the movie shows, or as shown in most other depictions. I know this because my great-uncle Eddie was there. He was a Jesuit Catholic priest who was a POW working on the Burmese railway. I won’t sugar-coat this - the Japanese officers were under tremendous pressure to complete the railway to supply the Japanese offensive, and were brutal with the prisoners. Beatings with bamboo canes were common, and the workers often worked at bayonet-point. The rations were grossly insufficient, and my great-uncle talked about finding maggots in his rice being a bonus because they were the only source of protein. My great-uncle also noted that the Japanese troops were also very poorly provisioned too. Their supply lines were constantly harassed - they were badly over-extended and feeding themselves was a constant challenge, this was a big part of the reason why the railway was so critical to the Japanese war effort. Throw into this the fact that the Japanese knew that the allied POWs were actively sabotaging the bridge every chance they got. They had a thousand tricks, from seeding the wooden supports with termites to mixing the concrete in the wrong ratios. Given that the Japanese troops were starving themselves it is hardly surprising that one day one of the Japanese officers got the bright idea of yanking out a random POW and threatening to chop off his head if they didn’t cut it out. … so my great-uncle Eddie stepped forward and volunteered to take the random POW’s place. The Japanese officer knew that Eddie was a priest, and refused to execute him - it would have been very bad form to execute a priest. And so the next day the officer tried the same thing, and my great-uncle stepped forward again. This time he was beaten for his repeated interference with the Japanese officer’s scheme, but the next day he stepped forward again. This went on for about a week. The Japanese officer would threaten to execute someone, my great-uncle would step forward, and he would be beaten. Eventually the Japanese office gave up on this tactic because it was just making him look impotent in front of his men. Again, it is necessary to bear in mind that everyone was malnourished, and the Japanese saw the POWs as actively stopping them getting the food they desperately needed. This story has a happy ending though. My great-uncle eventually escaped from the camp with a group of other POWs, but was separated from the group when he fell down a hole. He took a nasty tumble and some rocks collapsed on him, and he was separated from the rest of the POWs. He managed to dig himself out, and made his way to Allied lines (if I recall correctly he said that he was rescued by a French unit). His uniform was stripped off him and dumped in a bag and mailed back to his home address while he was in the hospital. When he finally got home months later he was in for a surprise. In the pockets of uniform he found some stones - greenish stones… it turns out that “hole” he fell into was a Burmese emerald mine, and the staff at the hospital had just cut his rotting uniform off him and dumped it into a bag without washing it or emptying the pockets. One of those emeralds is in my wife’s engagement ring. ",
            "date": "Answered July 1, 2018",
            "views": "2875",
            "upvotes": " View 2.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jinjia H",
                    "user_href": "/profile/Jinjia-H"
                },
                {
                    "user_id": "Hannah Lilian Smith",
                    "user_href": "/profile/Hannah-Lilian-Smith"
                },
                {
                    "user_id": "Ganesh Ram",
                    "user_href": "/profile/Ganesh-Ram-26"
                },
                {
                    "user_id": "Brandon Max",
                    "user_href": "/profile/Brandon-Max-11"
                },
                {
                    "user_id": "Kenton Taulbee",
                    "user_href": "/profile/Kenton-Taulbee-1"
                },
                {
                    "user_id": "Erwin Lee",
                    "user_href": "/profile/Erwin-Lee-2"
                },
                {
                    "user_id": "Amil Fathullah",
                    "user_href": "/profile/Amil-Fathullah-1"
                },
                {
                    "user_id": "Mitchell Jones",
                    "user_href": "/profile/Mitchell-Jones-127"
                },
                {
                    "user_id": "J J",
                    "user_href": "/profile/J-J-1195"
                },
                {
                    "user_id": "Shashank Shekhar",
                    "user_href": "/profile/Shashank-Shekhar-493"
                }
            ]
        },
        {
            "author_info": {
                "name": "JDF 989",
                "href": "/profile/JDF-989"
            },
            "answer_text": "Cruel is far from a word to describe what they were back in WW2. Of course i am not talking about the entire Japanese race, but the soldiers who fought that time. While many of them showed an astounding amount of bravery while at war they were equally blood thirsty and sadistic. The officers were always the cruelest ones on a level beside the SS of Nazi Germany. There were also equally sadistic soldiers in the army although many others weren’t and were just there to serve their country. The amount of brutality they showed towards soldiers and civilians a like would even disgust the Nazis. These were beasts in human skin. There were stories about how a Japanese soldier was saved from drowning by a US soldier and how did he repay him he stabbed him with his bayonet. They were extremely traitorous as well faking surrender and pleading mercy to soldiers and once they had them fooled murdered them in cold blood. Honor was highly regarded during that period, yet the only honor practiced was honor in dying, They pillaged and plundered every land they invaded treating no one with the slightest ounce of mercy. They raped women and tortured or killed them afterwards its even said that they ate the victims they killed even an SS officer wouldn’t stoop to that level of inhuman. They were megalomaniacs. God complexes demanding absolute obedience towards them. The slightest act of defiance would earn you a beating. They did extremely brutal thing to people soldiers and citizens a like that would have them wish for a quick death. They didn’t even care for their own as officers would force pilots to suicide bomb ships through kamikaze attacks. Suicide was also a thing they forced into soldiers. Of course not all of them were evil. There were decent ones, bad ones but not on the scale of cruelty as mentioned above and many didn’t want to fight probably empathizing with their enemies as they also didn’t want to go to war. They wanted go back to their families and live a normal life. I am sure many of them were disgusted by the atrocities committed their fellow comrades. In the end the Japanese Army got what it deserved complete and utter defeat and the shattering of a mighty but evil empire. Everything from the rape of Nanking to Pearl Harbor was avenged. For all of you saying the Japanese deserved the atomic bombings of Hiroshima and Nagasaki you are wrong. The military is the one that should deserve justice of course the bombings were needed to end the war. Now after that the Japanese are more civilized with peace everywhere and a very low crime rate. Pray for all the victims that have suffered not only under the Japanese, but all that suffered in the war ",
            "date": "Answered April 6, 2018",
            "views": "82",
            "upvotes": " View 40 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Who Ami",
                    "user_href": "/profile/Who-Ami-4"
                },
                {
                    "user_id": "Roger Lim",
                    "user_href": "/profile/Roger-Lim-72"
                },
                {
                    "user_id": "Ben Woodlock",
                    "user_href": "/profile/Ben-Woodlock"
                },
                {
                    "user_id": "Berg Wiht",
                    "user_href": "/profile/Berg-Wiht"
                },
                {
                    "user_id": "Erwin Lee",
                    "user_href": "/profile/Erwin-Lee-2"
                },
                {
                    "user_id": "Amil Fathullah",
                    "user_href": "/profile/Amil-Fathullah-1"
                },
                {
                    "user_id": "Madhurima Chakraborty",
                    "user_href": "/profile/Madhurima-Chakraborty-41"
                },
                {
                    "user_id": "Guy Malfait",
                    "user_href": "/profile/Guy-Malfait"
                },
                {
                    "user_id": "Craig Day",
                    "user_href": "/profile/Craig-Day-13"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ruby-728"
                }
            ]
        }
    ]
}