{
    "title": "How well is the Euro currency doing? - Quora",
    "tags": [
        "Euro (currency)",
        "Economic History",
        "Currencies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Fair",
                "href": "/profile/Erik-Fair"
            },
            "answer_text": "The Euro (currency) is doing quite remarkably well. Its successes include: elimination of Currency Exchanges and thus Currency Exchange Fees throughout the Eurozone.elimination of national governments’ Currency Devaluation malfeasance - national governments have to run Fiscal Policy clean operations wherein they budget honestly, and pay back debts they incur honestly. This has caused severe indigestion in nations which have not been run this way historically (looking at you, Italy & Greece).See also the Stability and Growth Pact which limits Eurozone national governments to no more than 3% of GDP annual budget deficit, and no more than 60% of GDP sovereign Debt to GDP Ratio.facilitated International Trade throughout the Eurozone, resulting in increased wealth & Standard of Living throughout the Eurozone.The main thing the Eurozone needs to work better is a banking union (a Eurozone-wide equivalent of the U.S. FDIC to provide both Bank Deposit Insurance and Banking Supervision), so as to remove banking from the corrupting influence of national and local politicians. This involves an additional diminution of National Sovereignty and the privileges of political power, which is why this is being resisted - politicians love to hand out money as political favors, and international supervision of bank lending would preclude handing out money as political favors from banks; politicians would be forced to take money from people directly by taxation in order to hand it out again to their political clients. The one thing that the Eurozone does not need is a common EU budget & Fiscal Policy, despite all the clamoring for it from Keynesian Economists - this is the major condition that the Germans quite reasonably (and perhaps presciently) insisted on when they consented to join the currency union: that “currency union” never become a “transfer union” which is what “common fiscal policy” is really all about. ",
            "date": "Answered October 12, 2020",
            "views": "91",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhanu Kiran Peringanji",
                    "user_href": "/profile/Bhanu-Kiran-Peringanji"
                },
                {
                    "user_id": "Tony Li",
                    "user_href": "/profile/Tony-Li-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Hills",
                "href": "/profile/Chris-Hills-29"
            },
            "answer_text": "Germany could still tumble into recession as the threat of a no-deal Brexit and trade wars smash Europe’s biggest economy. The country’s economy just escaped entering recession territory last month, with GDP growing at just zero percent following a 0.4 percent contraction in the previous three-month period. But Germany could be just weeks away from a recession-threatening double whammy as a potential no-deal Brexit and Donald Trump’s warning to hike car tariffs by up to 25 percent could send the economy tumbling. Chancellor Angela Merkel’s ministers have entered into a frantic plan to avert an economic catastrophe which could end Europe’s biggest economy’s golden growth for a decade. Span’s manufacturing activity plummeted into negative territory for the first time in more than five years, sparking fears the economy could soon slip into recession. Purchasing Managers' Index (PMI) figures, which indicate of economic health for manufacturing and service sectors, show Spain’s production fell from a positive 52.4 in January to 49.9 in February. Readings above 50 indicates an economic expansion, while a reading below 50 indicates a reduction. A higher than expected reading should be considered positive/bullish for the eurozone, while a lower than expected reading is considered negative/bearish for Europe. The euro is the official currency of 19 nations. Roughly 339 million people harness the euro on a daily basis, and more than 175 million people across the world use currencies with an exchange rate tied to the euro. While member nations began using the common currency for accounting purposes in 1999, the citizens of the eurozone did not start trading euro bills and coins until 2002.[1] By using a common currency, nations, businesses and individuals can derive many benefits. One such perk is easier cross-border trade. By removing exchange expenses and fluctuating exchange rates, market participants have greater stability and a lower cost of business. The euro makes it easier for travelers to visit the nations that use the currency, and consumers can access a wider range of options because of the aforementioned benefits. Through the Economic and Monetary Union, the 19 nations of the eurozone can work together to coordinate economic and fiscal policy.[2] While the EMU includes the 28 nations of the European Union, not all countries in the EU belong to the eurozone. Euro Volatility While the common currency may come with numerous benefits, it has encountered some strong volatility in the aftermath of the 2008 financial crisis. Its price fluctuations have garnered a lot of media attention, so there is substantial information available on the factors credited with prompting this volatility. Global Risk Aversion The rise and fall in the euro's exchange rate has repeatedly been tied to global risk aversion. When investors are willing to incur risk in exchange for a greater chance of compelling returns, they might opt to purchase the common currency. Global market participants frequently flock to riskier assets en masse in hopes that doing so will generate strong returns. This phenomenon is known as risk-on trading. In September 2015, for example, the euro hit an eight-month high against the Swiss franc, considered by many to be a safe-haven currency, when global investors flocked to riskier assets.[3] The other side of the coin is risk-off trading, which is when investors buy up safe assets because of their desire to protect their principal. An example of this occurred on October 18, 2015, when the common currency fell to its lowest in more than two weeks against the yen, a safe currency, as global investors fled riskier assets.[4] It is worth noting that if global investors want to participate in either risk-on or risk-off trading, there are many other ways they can do so besides buying or selling the euro. When traders are confident in economic conditions and want to invest in riskier assets, they purchase emerging market currencies such as the yuan or rupee. Others may opt for another asset class entirely, choosing to buy either equities or commodities such as oil. Trader Speculation The speculative activity of traders makes up a large portion of the global forex markets, in which market participants trade more than US$5 trillion in notional value a day.[5] The euro has generated substantial attention from global investors. Net euro shorts hit an all-time high in March 2015, according to data provided by the U.S. Commodity Futures Trading Commission and Thomson Reuters.[6] As a result, net euro shorts rose to more than 200,000 contracts. ECB Policy These bets that the currency would fall in value surged to this level as the ECB began a new program of quantitative easing. Pursuant to this initiative, the eurozone's central bank planned to buy US$3 billion worth of bonds every day.[7] By making these transactions, the financial institution aimed to ignite stagnant economic growth and increase inflation. One consequence of expanding the money supply was placing downward pressure on the euro. Such a move could help bolster economic conditions of European nations by making goods denominated in the euro cheaper for market participants using other currencies. The ECB's interest rate policy is another factor that has affected the euro. In June 2014, the financial institution began imposing negative 0.1% rates on deposits it was holding.[8] During September 2014, the ECB lowered this rate to negative 0.2%. By cutting interest rates, central banks can help affect the economies of their respective jurisdictions. By pushing the rates below zero, the ECB has aimed to give people greater reason to borrow and less incentive to save. Additionally, the move might motivate banks to offer more money to businesses and consumers at lower interest rates. Greek Crisis Greece has been struggling with financial challenges for years.[9] As a result, its continued membership in the eurozone has been brought into question. The nation has requested multiple bailout packages in order to avoiding defaulting on its obligations, and these cash infusions have come in exchange for austerity measures. The country's parliament approved the 2016 budget in early December 2015, which cuts €5.7 billion from public spending.[10] In spite of these sharp reductions, which include €500 million from defense and €1.8 billion from pensions, Greece is still forecasting that its 2016 budget deficit will surpass that of 2015. The euro's value has encountered headwinds when concerns have flared up about Greece leaving the eurozone.[7] Fed Policy The Federal Reserve announced its first interest rate hike on December 16, 2015, declaring that it was increasing its target for the federal funds rate to a range of 0.25% to 0.5% from the previous range of 0.00% to 0.25%.[11] In addition, the Fed ceased its bond purchases in late 2014.[12] These two policies contrast sharply with those used by the ECB, which could result in downward pressure being placed on the euro relative to the U.S. dollar. Any opinions, news, research, analyses, prices, other information, or links to third-party sites are provided as general market commentary and do not constitute investment advice. FXCM will not accept liability for any loss or damage including, without limitation, to any loss of profit which may arise directly or indirectly from use of or reliance on such information. ",
            "date": "Answered March 3, 2019",
            "views": "649",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Valeriy Velchev",
                    "user_href": "/profile/Valeriy-Velchev"
                },
                {
                    "user_id": "James Fogge",
                    "user_href": "/profile/James-Fogge"
                }
            ]
        }
    ]
}