{
    "title": "How did the French Revolution affect Napoleon? - Quora",
    "tags": [
        "French Revolution",
        "Napoleon Bonaparte",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Guerrieri",
                "href": "/profile/Chris-Guerrieri-3"
            },
            "answer_text": "The French Revolution and it's meritocracy allowed Napoleon's rise from captain in the artillery to the Brigadier General who sweeps away the royalists in Paris with his wiff of grapeshot. He then rose to full General and commander of the Army of Italy. He led these 40,000, give or take, ill supplied and ragged French soldiers to victory after victory defeating Piedmont and Austria and crushing armies much larger than his own. His rise to commanding general of a French field army at age 26 was only possible due to the revolution. Under the monarchy a Corsican from minor and poor nobility would never rise so high. The revolution also is what influenced him to eventually become an emporer with near absolute power. Napoleon was in Paris when the kings Swiss guard was brutally massacred by the Parisians. He had a fear of crowds and disorder after witnessing this and years later would make a comment that basically said “The average peasant is not meant to be free. They need a stronger, more enlightened man to tell them what to do. Freedom is only for the enlightened few. It is not for the common people. Most men were not meant to be free”. I most likely got the wording wrong there but basically the French Revolution enabled Napoleon to rise up and become the absolute ruler of France and most of Western Europe. The violence and madness of the Parisians during the terror however, showed him that the people need a monarch and restraints on their freedoms to maintain order. ",
            "date": "Answered November 3, 2017",
            "views": "962",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Franck Aime",
                    "user_href": "/profile/Franck-Aime"
                },
                {
                    "user_id": "Jesse O'Connor",
                    "user_href": "/profile/Jesse-OConnor-7"
                },
                {
                    "user_id": "Isaac McPherson",
                    "user_href": "/profile/Isaac-McPherson"
                },
                {
                    "user_id": "Mohammad Hasan",
                    "user_href": "/profile/Mohammad-Hasan-416"
                },
                {
                    "user_id": "Matthew Sutton",
                    "user_href": "/profile/Matthew-Sutton-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tycis Aughticy",
                "href": "/profile/Tycis-Aughticy"
            },
            "answer_text": "It created the Napoleon we know and love today. Before the French Revolution, he was just an army captain. (Now, I feel this is important to mention. The French Revolution was fighting AGAINST monarchies and persons of absolute power.) After numerous battles, Napoleon earned the rank of commander. Another important thing to remember is that France suffered through 4 failed governments, the National Assembly, the Legislative Assembly, the First Republic and the Directory. This is really where Napoleon begins to shine, as he rose to power, with him and his followers performing a coup d'etat in favour of his party. This resulted in him becoming a dictator. Closing thought: The French Revolution fought against monarchs and eventually settled with a dictator. Was all of that bloodshed worth it? Edit: Napoleon rose to power AFTER the Directory. Also, those four governments were instituted DURING the Revolution. ",
            "date": "Answered November 2, 2017",
            "views": "351",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pras G",
                    "user_href": "/profile/Pras-G-6"
                },
                {
                    "user_id": "Isaac McPherson",
                    "user_href": "/profile/Isaac-McPherson"
                }
            ]
        }
    ]
}