{
    "title": "How did the Great Depression affect minorities? - Quora",
    "tags": [
        "The Great Depression",
        "Economic History",
        "Minorities",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dixie Schafir",
                "href": "/profile/Dixie-Schafir"
            },
            "answer_text": "Everyone suffered in the Great Depression. Color didn’t matter. People in OK, TX etc, black and white had to migrate as there was simply no food at all. A fictitious read about this is Steinbeck’s ‘Grapes Of Wrath’. There was more immigration out of USA than in. The mid west was hit especially hard because the farmers were ignorant of the great winds which carried off the plowed up ground. They were reduced to starvation.    This is a picture of the black community from that era. While poor, they kept their spirits up.  Migrant workers picking cranberries.  These folk wait all day for a job  not everybody got a job  This was the start of the great migration. WWII not Roosevelt ended the Great Depression. Americans of all colors were tough, didn’t want charity or Big Brother, they wanted opportunity and work. I know because my Mom was part of the Great Migration to CA. ",
            "date": "Answered February 1, 2020",
            "views": "162",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jacquelyne Ricco",
                    "user_href": "/profile/Jacquelyne-Ricco"
                },
                {
                    "user_id": "Henri Lesage",
                    "user_href": "/profile/Henri-Lesage-1"
                },
                {
                    "user_id": "Dee Danel",
                    "user_href": "/profile/Dee-Danel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Hemingway",
                "href": "/profile/Steve-SL-Hemingway"
            },
            "answer_text": "The Great Depression was what saved America. America tumbled into the 1930s flushed with excess and greed. Most of the white working class finally got to know how it was like to be Black. The African American remained in a state of depression since slavery. The mass discrimination in the work force was shameful. In the mid 30s with the advent of the WPA things changed. The government put 8.8 million people to work. Among them 2 million black workers, working side by side with white workers thanks to the efforts of Eleanor Roosevelt and her close friend Mary McLeod Cookman.  The Roosevelt Administration instituted the first affirmative action program of racial and enthic equality and called it the New Deal.  . My mother told me there was a new sense of hope in the black community. ",
            "date": "Answered February 7, 2020",
            "views": "346",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miksalmina",
                    "user_href": "/profile/Miksalmina"
                },
                {
                    "user_id": "Timothy Paul Haines",
                    "user_href": "/profile/Timothy-Paul-Haines"
                },
                {
                    "user_id": "George Wucher-King",
                    "user_href": "/profile/George-Wucher-King"
                },
                {
                    "user_id": "James Bundy",
                    "user_href": "/profile/James-Bundy-3"
                },
                {
                    "user_id": "Dominic Gallagher",
                    "user_href": "/profile/Dominic-Gallagher-9"
                }
            ]
        }
    ]
}