{
    "title": "How does the base-excision and nucleotide-excision repair mechanism identify mutations and repairs it? - Quora",
    "tags": [
        "Nucleotide",
        "Mutation and Mutations (genetics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harsh Oza",
                "href": "/profile/Harsh-Oza-13"
            },
            "answer_text": "Base-excision and nucleotide-excision repair mechanisms are used to repair the damaged base-pairs. In Base-excision repair mechanism, a single nucleotide is removed and replaced with a correct one. While in Nucleotide-excision repair mechanism, a stretch of the nucleotide sequence is removed. The mechanisms for both are explained below. Base-excision repair mechanism In this process, the defective base is recognised and removed by the glycosylase enzyme. This enzyme hydrolysis the glycosidic linkage between the nitrogenous base and the sugar and generates an abasic site. Endonulceotic cleavage by AP endo/exo-nuclease would remove the abasic sugar from the DNA backbone, hence forming a gap of missing nucleotide. AP endonuclease would cut at the 5′end of the AP site and leaves the 3′OH of the adjacent nucleotide while exonuclease cuts at the 3′end of the AP site and leaves 5′ phosphate of the adjacent nucleotide. DNA polymerase and DNA ligase fill this gap using the undamaged strand as a template.  Image adapted from Watson et al. (2014) Pg 327. The enzyme glycosylase would diffuse in the minor grooves of the DNA and flips the defective bases. It has been found that DNA bases can be flipped with very slight distortion in the DNA structure, thus the energy required for the same is negligible. The mechanism by which the enzyme detects the defective base is unknown. Nucleotide Excision Repair Mechanism In this process, the enzymes do not recognise the defective base pairs by flipping it, instead, they detect the lesion due to the distortion in the DNA structure. This distortion may occur due to thymine-thymine dimers, bulky chemical adduct on a base. There are four major enzymes in E. coli required for the detection and removal of the DNA lesion namely- UvrA, UvrB, UvrC and UvrD. Two subunits of UvrA and UvrB would form a tetrameric complex that scans the DNA for lesions. Two subunits of UvrA detects the defective portion of the DNA. On detection, the UvrA subunits would separate and UvrB would melt and bent the DNA strand.  Another protein UvrC is recruited which would make a nick at 8 nucleotides away from the lesion in the 3′ direction and 5–6 nucleotide in the 5′ direction. UvrD which is basically a helicase would separate the nicked strand. After that, DNA polymerase and ligase which would fill up the gap formed due to the removal of the defective strand.  Image adapted from Watson et al. (2014) Pg 329. In higher cells, the mechanism is similar but complicated. Enzymes such as XPC, XPA, XPD and RPA are involved in the repair mechanism.  Reference Books Watson, J. D., Baker, T. A., Bell, S. P., Gann, A., & Levine, M. (2014). Richard. Losick. Molecular biology of the gene, seventh ed., COLD SPRING HARBOR LABORATORY PRESS.Lewin, B., Krebs, J. E., Goldstein, E. S., & Kilpatrick, S. T. (2014). Lewin's Genes XI. Jones & Bartlett Publishers.",
            "date": "Answered July 20, 2019",
            "views": "152",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amal Guptan",
                    "user_href": "/profile/Amal-Guptan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marie Godfrey",
                "href": "/profile/Marie-Godfrey-2"
            },
            "answer_text": "If you’re talking CRISPR, the vector carries the correct nucleotide sequence to match the one in the DNA to be repaired. That allows the necessary get-together. That doesn’t always work just right, though. It’s one of the reasons gene-editing is still being continually refined. ",
            "date": "Answered July 21, 2019",
            "views": "32",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Dennis",
                    "user_href": "/profile/David-Dennis-12"
                }
            ]
        }
    ]
}