{
    "title": "How was Hitler able to brainwash a nation? - Quora",
    "tags": [
        "Mind Control",
        "Nazism",
        "Adolf Hitler",
        "Nazi Germany",
        "World War II",
        "Psychology",
        "Military History and Wars ",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lance Dillinger",
                "href": "/profile/Lance-Dillinger-1"
            },
            "answer_text": "The same reason that all genocide and war exists ….IGNORANCE….one man's ignorance and his extreme talent to hypnotize a mob of other ignorant people is what ALLOWED him to...that's what motivated him,people need to remember or don't realize that as evil as Hitler was his subordanates were just as evil if not worst…Hitler had a twisted ideology of how he wanted the world to be,the guys like himmler,eichmann,heydrich, ext. were the ones that said “this is how you make it happen “ They are the ones that came up with the plans and ways to make hitler's twisted dreams a REALITY…Hitler had the ideas ..they are the ones that put it in to ACTION….everything from himmler's SS gestapo ..to eichmann's planning of deportations ,emptying of ghettos ,ext. all the way down to the average citizen who was either finatical,indifferent or just to afraid to stand up to it. You have to remember this was a dictatorship where his word was /above all law. You could be imprisoned ,killed, put in a camp yourself with your whole family just for whispering bad thing about there regime…Himmler made sure that the secret police instilled fear…eichmann made sure the trains kept coming and going ,hoss made sure that austwitch kept running “smooth” and so on and so on…. It was all planned maticulously ….every thing they did had a motive,rhyme or reason .. ..the amount of planning and implementation of these methods was not/ could not be carried out by Hitler ALONE from his second in command down to the local paper boy who threw rocks at jews. These were not a bunch of disorganized street thugs,but mostly highly educated intelligent people who just didn't have the COMMON SENSE to not follow him. Hitler was able to do what he did because of the amount of people /a nation who was also willing / unwilling or forced to follow him…..so that was what kept him “ motivated\" but as human nature goes they didn't realize the IGNORANCE of all there actions until the vengeful RED ARMY was at there door step to give them a dose of reality …… ",
            "date": "Updated October 26, 2020",
            "views": "327",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Barker",
                "href": "/profile/Steve-Barker-171"
            },
            "answer_text": "They wanted to be “brainwashed\"; they wanted to be told that their mighty army didn't lose WWI but instead were stabbed in the back by Jews and Communists who betrayed the men at the front. They wanted to be told that that their savings that had evaporated in the hyperinflation was the fault of Jewish bankers like the Rothschilds The Allies didn't help by treating the Versailles ‘negotiations’ as a chance to put Germany on trial, excluding them from the talks until the end when the German delegation were wheeled in to hear the judgement. Germany was held solely responsible for the War despite Britain, France and Russia being equally keen to show the Hun who's in charge, a demilitarized the Rhineland, which France invaded the first chance it got, confiscation of East Prussia for the re-establishment of Poland and the transfer of the coal producing areas of Silesia and the Saar Basin to Poland and France and massive reparations to the victors, which France continued to enforce long after the US and UK had accepted that Germany was incapable of paying particularly as they had no coal to export. They wanted someone to explain to them why they had Soviet style councils running the country and civil war in the streets Anyone could have stood on a soap box and told them it was the Communists, within which Jews were over represented, that betrayed them and the Treaty of Versailles which had robbed the country of it's means to recover and imposed the chaotic Weimar Republic on them and the people would listen And they did, unfortunately ",
            "date": "Answered October 20, 2020",
            "views": "225",
            "upvotes": "0"
        }
    ]
}