{
    "title": "How is weed farming destroying the planet? - Quora",
    "tags": [
        "Destruction",
        "Organic Farming",
        "Farming",
        "Agriculture",
        "Cannabis"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Miranda",
                "href": "/profile/Jason-Miranda-48"
            },
            "answer_text": "LMFAO. Are you serious? The cannabis plant rejuvenates soil. What is destroying our planet is industrial-scaled agriculture and livestock farming for the last 100 years or so. What that “Michael Bichard” said, describes exactly what industrial agriculture/livestock farming has been doing for decades, not “cannabis” that has only been commercially grown in the last decade or so. Most cannabis producers are generally environmentally conscious, unlike profiteering industrial dirtbags destroying habitats/ecosystems/environment to expand farming operations and gain more profit. Cannabis growers do not use “bio-sludge” fertilizers (made from human sewage and whatever gets flushed down toilets). But do you know who does? Industrial agriculture farms. ",
            "date": "Answered September 27, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Bichard",
                "href": "/profile/Michael-Bichard-1"
            },
            "answer_text": "What pot farmers legal and illegal and the cartels that use our forest land are doing is using fertilizers and grow chemicals that arent properly deposed of in most cases which could get into the rivers by runoff during the rains and damage the water supply Now destroying the planet no that's not happing just damaging the local environment. The Mexican that grow in the US forest leave the worst mess imaginable and that's causing harm to the environment ",
            "date": "Answered September 27, 2020",
            "views": "37",
            "upvotes": "0"
        }
    ]
}