{
    "title": "How would Elvis Presley's life have been different if he never met Colonel Tom Parker? - Quora",
    "tags": [
        "Colonel Tom Parker (musician)",
        "Elvis Presley (musician, actor)",
        "Music History",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Musicians",
        "Hypothetical Scenarios",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lyle Fales",
                "href": "/profile/Lyle-Fales"
            },
            "answer_text": "He would have been discovered by someone else. He was making big waves in the south. He was causing a sensation on The Louisiana Hayride and on the Sun tours. He would have got a break. And perhaps it would have been by a reputable agent instead of a Carnival hack who was only interested in selling Presley merchandise. Perhaps he would have had a real supporter who would have guided him into a real acting career sans singing. Therefore making much more money in the long run. But the colonel was never into the long run, he was just into the next quick buck because he had a serious gambling problem. Perhaps Elvis would have been able to tour globally and make much more money. But the Colonel was an illegal alien that knew if he left the country he may not be able to get back in. And that leads us to the fact that had Elvis never met Colonel Tom Parker he would have been much wealthier. Most agents get 10% of what they can negotiate. Near the end The Colonel was taking 60%, again to feed his gambling indiscretions. ",
            "date": "Answered October 23, 2020",
            "views": "108",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Randy Fisher",
                    "user_href": "/profile/Randy-Fisher-18"
                },
                {
                    "user_id": "Jim Roland",
                    "user_href": "/profile/Jim-Roland-4"
                },
                {
                    "user_id": "Ted McCartin",
                    "user_href": "/profile/Ted-McCartin"
                },
                {
                    "user_id": "Steve Hall",
                    "user_href": "/profile/Steve-Hall-413"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Smith",
                "href": "/profile/Bill-Smith-1408"
            },
            "answer_text": "Hard to speculate because he might have found someone else who did the same things Parker did, or worse. But say he found a good reputable manager who didn’t take every offer thrown at him when the price was right (or there was something lucrative for them in the deal). If this had happened Elvis probably wouldn’t have made most of those horrible movies and he probably wouldn’t have released all those hokey rush job albums from the late 60s until his death (in Elvis’ defense, when he put his foot down, he was capable of greatness, like the Memphis albums, but stuff like “Having Fun With Elvis On Stage”—forty minutes of Elvis babbling between songs live—has Parker’s stamp all over it). . ",
            "date": "Answered October 23, 2020",
            "views": "117",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephen Fretz",
                    "user_href": "/profile/Stephen-Fretz"
                },
                {
                    "user_id": "Steve Hall",
                    "user_href": "/profile/Steve-Hall-413"
                }
            ]
        }
    ]
}