{
    "title": "How is abortion different from murder? - Quora",
    "tags": [
        "Abortion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diego Mercier",
                "href": "/profile/Diego-Mercier"
            },
            "answer_text": "MURDER: In common law, murder was defined as killing another human being with malice aforethought. Malice aforethought is a legal term of art, that encompasses the following types of murder: \"Intent-to-kill murder\" \"Grievous-bodily-harm murder\" -Killing someone in an attack intended to cause them grievous bodily harm - Wex Legal Dictionary. In normal common talking, we would say that murder is to kill somebody with premeditation. This usually excludes exceptions like self-defense and also some cases of homicide in which there is no premeditation. Therefore, in order to commit murder one must, at least: Know that you are killing someone, andWant to kill someone.Otherwise, the death of a person by another one is not murder, but culpable homicide, for example. In the case of abortion, a vast number of mothers who undergo abortion do not think that they are killing a human being (although they are doing so). The reason, in one word, is IGNORANCE. That ignorance is kept alive in society by the following: Poor understanding of Biology (particularly basic genetics and basic embryology) and poor understanding of basic Philosophy (principle of ‘causality’, substance vs accidents): This ignorance is an obstacle to understand that the embryo as a FULL human being (not a person in ‘potency’, but in ‘act’, from conception).The fact that abortion is legal: Being legal, many people who are in doubt about the humanity of the embryo, TRUST that the law actually is guiding society with morally acceptable principles —but it doesn’t. For many centuries, good people who had slaves did not oppose slavery… because it was legal - therefore it was considered okay.There is an incredible well-oiled machinery (oiled with millions of dollars) dedicated to promote the idea that abortion is not just ‘a valid choice’, but actually something ‘good’: a ‘right’. These efforts are being amplified by a politically motivated Media, generating more and more confusion about what abortion really is.Most mothers who undergo an abortion really have serious problems with carrying on with their pregnancies: financial, social and professional difficulties; and abortion gives a quick, painless and relatively cheap solution to all their problems (or most of them). It is only natural to sympathize with those women and support abortion as a massive reliever of pressure for so many people— we just need to overlook or ignore the details about the morality of the procedure.Due to all of the above, which feed the generalized ignorance about the nature of the embryo, I don’t think is fair at present to charge those mothers (or at least a good number of them) with murder, strictly speaking. Many might feel some hint at the back of their minds in their conscience, warning them about the immorality of abortion; but in general they just don’t know what they are doing, and the pressure is enormous. Having said that, the same criterion should not apply to the Service Provider (like Planned Parenthood): they should have the biological and philosophical formation to know better. They do have the time to research properly, they do not have the pressures associated with unwanted pregnancy. They are fully liable for the crime committed. In my opinion: A number of things should happen before we can point fingers towards those mothers saying “murderer”: First and foremost, the law has to clearly be on the side of Justice. Apart from that, the following will help: Education has to get better at school level. A culture of respect for human life has to be seen everywhere: in movies, in songs, in magazines, etc. The Media has to have a fair standpoint on the debate… ",
            "date": "Updated August 5, 2020",
            "views": "770",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Mondesire",
                    "user_href": "/profile/Daniel-Mondesire"
                },
                {
                    "user_id": "Judy Bavuso",
                    "user_href": "/profile/Judy-Bavuso"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                },
                {
                    "user_id": "Val Tebbitts",
                    "user_href": "/profile/Val-Tebbitts"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Kehoe",
                "href": "/profile/Tom-Kehoe-1"
            },
            "answer_text": "The question is, “Why isn’t abortion considered murder?” There are several ways to approach this. Let’s start with the definition of murder: “The unlawful premeditated killing of one human being by another.” 1.) Murder is the illegal killing of one human being by another. Abortion isn’t murder because, within certain bounds, it is allowed by law. 2.) Abortion isn’t murder because the fetus isn’t legally a human being. In the landmark case Roe vs. Wade, the Supremes issued a Solomon-like ruling that a fetus is not a person until it is capable of surviving on it’s own outside the womb, which occurs sometime in the third trimester. Then there is the philosophical perspective. 1.) The essence of personhood is self-determination — the ability to chart the course of your own life. If a person cannot make fundamental decisions about what happens inside their own body, he or she is being denied self-determination and is no longer a free person. 2.) A person’s organs belong to them in perpetuity and cannot be seized by the government. This principal is so clearly enshrined in the law that a person’s organs cannot be used even after their death unless the person had signed an explicit waiver prior to death. 3.) Childbirth is an intensively painful, debilitating and dangerous process. It is essentially torture for a government to force a woman to undergo childbirth if she chooses not to. 4.) The unborn fetus is at best a “potential” human; the mother is a fully-formed and sentient being. The rights of the mother must always take precedence over those of the fetus. There are scientific reasons. 1.) “Life” is difficult to define. While some claim that life begins at conception, medical science tells us that as many as 60% of pregnancies spontaneously abort, often within days of beginning. And the question is not whether an embryo represents “life,” but whether it represents human life. 2.) While you might accept that all fetus are “alive,” they certainly do not have consciousness for most of the time in the womb. If any lump of human cells were considered a human being, then it would be murder to cut off somone’s toe. Then there are the pragmatic reasons. Childbirth has lifelong consequences, and unwanted childbirth has lifelong consequences that are significantly negative. 1.) One study showed that women who are denied abortions were four times more likely to have an income bellow the poverty level. 2.) The woman who is forced to raise an unwanted child is likely not to be a very good mother. 3.) Raising a child is an expensive, difficult and all-consuming activity that requires significant preparation in the modern world. Women are physically capable of giving birth long before they are mentally, emotionally and economically capable of raising the child properly. There are religious and cultural reasons as well. 1.) The ancient Hebrew texts clearly do not treat an unborn child as if it were a human being. 2.) The ancient Christian text sometimes used to justify the view that all unborn are humans is based on a mistranslation of an ancient Hebrew text. 3.) Abortion was not considered murder in colonial America or England. Abortion was considered perfectly acceptable up to the point of the “the quickening” — the point at which the baby started kicking. Women denied abortions are significantly more likely to experience poverty Why Abortion isn't Murder Abortion, History, and the Beginning of Life A scientist weighs up the five main anti-abortion arguments Jewish Perspectives ",
            "date": "Updated October 2, 2019",
            "views": "5",
            "upvotes": " View 119 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hendrik Daendels",
                    "user_href": "/profile/Hendrik-Daendels"
                },
                {
                    "user_id": "Bonnie Warner",
                    "user_href": "/profile/Bonnie-Warner-5"
                },
                {
                    "user_id": "Tristan Nguyen",
                    "user_href": "/profile/Tristan-Nguyen-45"
                },
                {
                    "user_id": "Theresa Aslin",
                    "user_href": "/profile/Theresa-Aslin"
                },
                {
                    "user_id": "Caryn O'Connor",
                    "user_href": "/profile/Caryn-OConnor"
                },
                {
                    "user_id": "Fernando Teruel",
                    "user_href": "/profile/Fernando-Teruel"
                },
                {
                    "user_id": "Bob Myers",
                    "user_href": "/profile/Bob-Myers-27"
                },
                {
                    "user_id": "Samarth Srinivasa",
                    "user_href": "/profile/Samarth-Srinivasa-1"
                },
                {
                    "user_id": "Daniel Kelly",
                    "user_href": "/profile/Daniel-Kelly-29"
                },
                {
                    "user_id": "Will Engel",
                    "user_href": "/profile/Will-Engel-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "Because we say so. A ‘murder’ is by definition an illicit killing. For a homicide to become a murder, it must be premeditated, planned, cruel and/or subjected to an officer or civil servant in office. Death penalty, euthanasia, abortion and withdrawal of care all are acts which cause the deliberate death of a Homo sapiens. Whether they are murders or not, is a matter of opinion. If killing is made legal, it is no more a murder. Simple as that. But there is no question abortion is about slaying a Homo sapiens. It is a truism. You cannot perform an abortion without killing a Homo sapiens in the process. The big thing is that while a foetus undeniable is a Homo sapiens - and an individual organism since the beginning, never a part of mother’s organism system - it is not considered a ‘person’ in judicial system. Most grounds we apply for abortion really do not hold water. “Right to one’s own body” is hogwash. As long as there is conscription, the bodies of all male citizen belong to the state, they have the value of mincemeat and the state can have its male citizens to be killed like flies. Actually the state may execute you if you are a man and refuse to go to war - see Arndt Pekurinen case. “Inability to survive individually” is neither a good argument. The same argument could be used on imposed euthanasia on seriously paralyzed, ALS patients, terminally ill, severly demented or seriously injured people. This is actually a real concern among ALS patients - will they be euthanasized forcibly? Certainly many are imposed to agree to give up treatment “to die dignifiedly”. “No personhood and self-awareness” does not hold water either. We could just as well euthanasize severly disabled people, severly demented or comatose patients. Philosophers have actually contemplated with this. See After-birth abortion: why should the baby live? and Killing babies no different from abortion, experts say. “It is only a clump of cells”. Well, not exactly. The foetus ceases to be a clump of cells on the 44th day of pregnancy and begins to resemble a miniature figurine each day afterwards. If the morphology is an argument, should we terminate horribly mutilated soldiers or accident survivors? The big question rather is: where does life begin? It can only be defined by the same way we define how life ends. Death was once defined as “cessation of signs of life”. As such, beginning of life would be the infertilization. Not a good definition. Then it was defined as “cessation of heartbeat”. On such definition, the beginning would be “heart birth” - beginning of heartbeat, which begins usually at 40th day of pregnancy. Today death is defined as “cessation of cerebral functions” (brain death). As such, “brain birth” (beginning of the EEG activity on the foetus) ought to be considered as the beginning of the life. This usually happens on the 45th day of pregnancy. By using brain birth as the yardstick, an individual Homo sapiens begins to exist when his or her EEG can be determined. See Fetal EEG - Wikipedia. This is, of course, problematic. This is so early on pregnancy that most women never even realize they are pregnant. They just wonder why they have missed their period. If a foetus isn’t a Homo sapiens before brain birth, it would justify “day after” and RU-466 pills and intrauterine contraception devices (which prevent the zygote from attaching on uterine wall). But if it is after the brain birth, it would make most abortions either outright murders, or euthanasias at best. And be incredibly problematic. On illegal abortions and back alley jobs: Most illegal abortions are not performed by crass amateurs with crude instruments, but the same professionals who perform legal abortions. And no, they don’t use wire coat hangers, but very sophisticated tools. See the Grantham Collection - world’s largest collection of abortion instruments. I mean, someone has really sat down and thought and looked at millimetres on a celluloid ruler when designing the tools of the trade. ",
            "date": "Answered June 12, 2019",
            "views": "85",
            "upvotes": " View 359 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ted Östgärde",
                    "user_href": "/profile/Ted-Östgärde-1"
                },
                {
                    "user_id": "Marcos Ignacio",
                    "user_href": "/profile/Marcos-Ignacio-1"
                },
                {
                    "user_id": "Kurt Nicholson",
                    "user_href": "/profile/Kurt-Nicholson-8"
                },
                {
                    "user_id": "Alan Sanchez",
                    "user_href": "/profile/Alan-Sanchez-28"
                },
                {
                    "user_id": "Nikki Menestrina",
                    "user_href": "/profile/Nikki-Menestrina"
                },
                {
                    "user_id": "Chaitanya Gaur",
                    "user_href": "/profile/Chaitanya-Gaur"
                },
                {
                    "user_id": "Laurence Fraser",
                    "user_href": "/profile/Laurence-Fraser-3"
                },
                {
                    "user_id": "Łukasz Starczyński",
                    "user_href": "/profile/Łukasz-Starczyński"
                },
                {
                    "user_id": "Shannon Williams",
                    "user_href": "/profile/Shannon-Williams-157"
                },
                {
                    "user_id": "Luka Radinovic",
                    "user_href": "/profile/Luka-Radinovic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregg Bambo",
                "href": "/profile/Gregg-Bambo"
            },
            "answer_text": "You make several erroneous statements. Murder uncommonly carries a life sentence. A babies body is a women’s property. Nothing you have identified is hypocritical. People ask why abortion is not considered murder. There is no definitive answer, because different legal theories prevail in different countries. In America, the right not to be murdered is contained in the Constitution, which only applies to persons. But SCOTUS says the unborn are not persons. Why? Well one reason they gave was the fact that historically abortion was not considered murder. A more general reason in my view is that rights are things constructed by people to make society livable and yet the unborn are not yet members of society. A better question is why abortion should be considered murder when that is a minority view in history, if it was a view held at all. For example, the Catholic Church considers abortion to be wrong, but do they call for murder convictions? I have never heard that. A bigger problem is that nearly all opponents of abortion believe abortion is wrong for religious reasons. Yet the Constitution sets forth the US as a secular society in which church and state, or church and law, are to be separate from each other. If you want women getting abortions to be convicted of murder, you need to understand that people like me will then want to see people like you jailed for believing imposing the views of a rambling bronze age document on the rest of us. If you want to talk about hypocrisy, then explain to me why when clinics try to destroy unwanted frozen fetuses the right to life faction objects strenuously on moral grounds, but they do not object one whit to people being held hostage in a frozen state in the absence of charges and a trial. How do you explain that? ",
            "date": "Answered June 1, 2016",
            "views": "35",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Berg",
                    "user_href": "/profile/Richard-Berg-10"
                },
                {
                    "user_id": "Laura Hurt",
                    "user_href": "/profile/Laura-Hurt"
                },
                {
                    "user_id": "Shannon Shadman",
                    "user_href": "/profile/Shannon-Shadman"
                },
                {
                    "user_id": "Alexander Cherry",
                    "user_href": "/profile/Alexander-Cherry-1"
                },
                {
                    "user_id": "Harry Zitzelberger",
                    "user_href": "/profile/Harry-Zitzelberger"
                },
                {
                    "user_id": "Maggie Martel",
                    "user_href": "/profile/Maggie-Martel-2"
                },
                {
                    "user_id": "Beth Garfinkel",
                    "user_href": "/profile/Beth-Garfinkel"
                },
                {
                    "user_id": "Gary Miles",
                    "user_href": "/profile/Gary-Miles-1"
                },
                {
                    "user_id": "Peanutlegs",
                    "user_href": "/profile/Peanutlegs"
                },
                {
                    "user_id": "Lisa Hofmann",
                    "user_href": "/profile/Lisa-Hofmann-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sindhu Mahadevan",
                "href": "/profile/Sindhu-Mahadevan-1"
            },
            "answer_text": "Abortions, end pregnancies. That’s the goal. The expulsion of the foetus, is a consequence of that. It is an unfortunate consequence, but with the technology we currently have, terminating pregnancies while retaining foetuses is not an option. The way I see it, abortions have nothing to do with the personhood debate. No human being may be compelled legally, to donate blood or any organs to any another individual. Not even their own child. Not even if receiving a donation from the parents is the only way for the child to survive. If Ted Bundy were alive, a condemned serial killer and rapist no less, and he was the only person on earth who was a match to an innocent baby boy, no one would be legally entitled to even a drop of his blood. In fact, not even a dead person’s organs may be harvested before their prior consent. If you consider abortions murder, you are giving a dead person and a convicted serial killer, more autonomy over their bodies than living, pregnant, women. Let that sink in for a minute. The reason abortion is not murder, is that no human being has the legal right to forcefully utilize another’s bodily resources, in order to remain alive. Why should a foetus be an exception? If we make abortions illegal, we are effectively saying that pregnant women are required to relinquish their rights and place themselves in service of the foetus. There’s a term for that- slavery. Gestational servitude is as immoral as any other form of slavery. ",
            "date": "Answered March 27, 2018",
            "views": "23",
            "upvotes": " View 48 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bonnie Warner",
                    "user_href": "/profile/Bonnie-Warner-5"
                },
                {
                    "user_id": "Lisa Newall",
                    "user_href": "/profile/Lisa-Newall-4"
                },
                {
                    "user_id": "Meghan Stanley",
                    "user_href": "/profile/Meghan-Stanley-5"
                },
                {
                    "user_id": "Virginia Duperre",
                    "user_href": "/profile/Virginia-Duperre"
                },
                {
                    "user_id": "Oolan Zimmer",
                    "user_href": "/profile/Oolan-Zimmer"
                },
                {
                    "user_id": "Martina Den",
                    "user_href": "/profile/Martina-Den"
                },
                {
                    "user_id": "Terry Warrick",
                    "user_href": "/profile/Terry-Warrick-1"
                },
                {
                    "user_id": "Lin Joah",
                    "user_href": "/profile/Lin-Joah"
                },
                {
                    "user_id": "Pallav Sarkar",
                    "user_href": "/profile/Pallav-Sarkar-7"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kari Frydenlund",
                "href": "/profile/Kari-Frydenlund"
            },
            "answer_text": "Because at the time when an abortion is preformed, we are talking about terminating a pregnancy. The fetus is at that point not a baby in any anatomical, physiological, medical or meaningful sense of the word. It is not an independent life. It is quite literally a collection of cells multiplying and forming. Granted, that collection of cells has the potential to become a baby in the future, but at the time of the abortion, it is a collection of cells. I know pro lifers hate that fact being mentioned, but it is still a physiological fact, and facts matter. When I have my Sunday breakfast with eggs fresh from my neighbors henhouse, I don't consider the egg yolk to be an animal. It has no consciousness, and it doesn't mourn the loss of a life that has yet to be formed. How do you kill an egg yolk? You don't. If I had given that fertilized egg the time and warmth it needed to hatch, it might have become a chicken if all went well. And if I wanted to eat it for breakfast at that point, I would have to kill it. An egg yolk is not a chicken at the time I have it for breakfast. Caviar is not fish babies. It's roe. When I see a sunflower seed, I don't think of it as a flower, because it's not. It's a seed when I chew and swallow it with the rest of my homemade breakfast cereal. I don't swallow a sunflower. I swallow the future potential of one. Preventing the potential of a future human being to come to life is something very different from murdering an independent, fully formed human life. The difference between the two is as big as the difference between an egg yolk and a chicken. And again: How do you kill an egg yolk? ",
            "date": "Answered March 27, 2018",
            "views": "1",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bonnie Warner",
                    "user_href": "/profile/Bonnie-Warner-5"
                },
                {
                    "user_id": "Ken Smith",
                    "user_href": "/profile/Ken-Smith-279"
                },
                {
                    "user_id": "Theresa Aslin",
                    "user_href": "/profile/Theresa-Aslin"
                },
                {
                    "user_id": "Virginia Duperre",
                    "user_href": "/profile/Virginia-Duperre"
                },
                {
                    "user_id": "Peggy Watts",
                    "user_href": "/profile/Peggy-Watts"
                },
                {
                    "user_id": "Harry Zitzelberger",
                    "user_href": "/profile/Harry-Zitzelberger"
                },
                {
                    "user_id": "Gary Miles",
                    "user_href": "/profile/Gary-Miles-1"
                },
                {
                    "user_id": "Tamara Silva",
                    "user_href": "/profile/Tamara-Silva-9"
                },
                {
                    "user_id": "Lisa Hofmann",
                    "user_href": "/profile/Lisa-Hofmann-14"
                },
                {
                    "user_id": "Jennifer Davis",
                    "user_href": "/profile/Jennifer-Davis-181"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Dauenhauer",
                "href": "/profile/Frank-Dauenhauer"
            },
            "answer_text": "Why is abortion not murder? In order for there to be a murder, one person must kill another person. In abortion, the existence of a fetus is terminated. But a fetus is not a person, because in order to be a person, it must have the ability to breathe air on its own. Therefore, abortion is not murder. Abortion: deliberate termination of pregnancy Murder: Unlawful premeditated killing of a human being by a human being Person: a human being Human being: a living being having the ability to speak Born: brought forth by birth Birth: the emergence of a baby or other young from the body of its mother; the start of life as a physically separate being. Fetus: an unborn vertebrate Baby: a very young child Child: a young person New York law defines when a fetus is considered a person Under Public Health Law, live birth is defined as \"the complete expulsion or extraction from its mother of a product of conception, irrespective of the duration of pregnancy, which, after such separation, breathes or shows any other evidence of life such as beating of the heart, pulsation of the umbilical cord, or definite movement of voluntary muscles, whether or not the umbilical cord has been cut or the placenta is attached; each product of such a birth is considered live born.\" It is up to a medical professional to determine if there is evidence of life in the infant. If the medical professional finds evidence, it is legally considered the birth of a person. \"The reality is that if they are born and alive they are a person and have full rights,\" Glick said in a phone interview. \"And that is the determination of a medical person at the time.\" Our ruling Glick said during an Assembly debate that \"New York state law says you are alive when you begin to breathe.\" ",
            "date": "Answered August 20, 2019",
            "views": "385",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bonnie Warner",
                    "user_href": "/profile/Bonnie-Warner-5"
                },
                {
                    "user_id": "Efron Berlian",
                    "user_href": "/profile/Efron-Berlian"
                },
                {
                    "user_id": "Ron Carne",
                    "user_href": "/profile/Ron-Carne"
                },
                {
                    "user_id": "Peter Aleff",
                    "user_href": "/profile/Peter-Aleff-1"
                },
                {
                    "user_id": "Nazir Haffar",
                    "user_href": "/profile/Nazir-Haffar"
                },
                {
                    "user_id": "Rudi Pan",
                    "user_href": "/profile/Rudi-Pan"
                },
                {
                    "user_id": "Arlene Duke",
                    "user_href": "/profile/Arlene-Duke"
                },
                {
                    "user_id": "Pamela Wallace",
                    "user_href": "/profile/Pamela-Wallace-21"
                },
                {
                    "user_id": "David Lewis",
                    "user_href": "/profile/David-Lewis-641"
                },
                {
                    "user_id": "Krister Sundelin",
                    "user_href": "/profile/Krister-Sundelin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elliott Mason",
                "href": "/profile/Elliott-Mason-1"
            },
            "answer_text": "Not all homicides (deaths of human beings caused by human beings) are murder. For example, self-defense is always recognized as a legitimate mitigating factor in the killing of another human by a human. Also, not everyone agrees that from the instant the egg and sperm touch, that the object produced instantly becomes human. Obviously, when exactly one draws the \"now, it is a person\" distinction is going to affect whether you think a given terminated pregnancy is murder or just the disposal of some medical waste. There is some logic to the common historical choice to put that changeover at the time when the gestator can first feel the child moving around (in modern terms, usually between weeks 16 and 25 of the pregnancy). By then, her body is well and truly into its pregnancy changes, and spontaneous miscarriage is much less likely. Also, that's often when, psychologically, one starts getting attached and beginning to impute a personality and actions upon the child. Modern medical imaging techniques and modern pregnancy tests have changed a lot of how we perceive unborn children. In the US, virtually all abortions after week 22 are for serious life-risking medical reasons or because the fetus is nonviable. And yet, I have a cousin who had to drive six hours and stay overnight in a motel in a strange city to get her dead and rotting fetus removed because of abortion bans in her home state, so I am perhaps jaundiced about using some outsider's morality to override the judgment of a parent and their doctor. ",
            "date": "Answered January 18, 2015",
            "views": "39",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bonnie Warner",
                    "user_href": "/profile/Bonnie-Warner-5"
                },
                {
                    "user_id": "Grneyes Ca",
                    "user_href": "/profile/Grneyes-Ca"
                },
                {
                    "user_id": "Padkirsch",
                    "user_href": "/profile/Padkirsch"
                },
                {
                    "user_id": "Andrew SaVann",
                    "user_href": "/profile/Andrew-SaVann-1"
                },
                {
                    "user_id": "Luna Brazz",
                    "user_href": "/profile/Luna-Brazz"
                },
                {
                    "user_id": "Debbie Pendry",
                    "user_href": "/profile/Debbie-Pendry"
                },
                {
                    "user_id": "Elena Freeman",
                    "user_href": "/profile/Elena-Freeman"
                },
                {
                    "user_id": "Cheryl Fisher",
                    "user_href": "/profile/Cheryl-Fisher-7"
                },
                {
                    "user_id": "Samantha Bean",
                    "user_href": "/profile/Samantha-Bean-7"
                },
                {
                    "user_id": "Rune Smith",
                    "user_href": "/profile/Rune-Smith-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carmela Chavez",
                "href": "/profile/Carmela-Chavez"
            },
            "answer_text": "Different jurisdictions and governments explain and support the right to choose between abortion and maternity, and this answer addresses my own view on the right to choose. Some people think women should be subservient to patriarchal, dogmatic, authoritarian religions that expect women to be submissive to narrow, parochial rules of conduct. In an effort to control the bodies and sexuality and identity of women, they try to use government to force women to accept the assault of forced motherhood and bear an unwanted pregnancy by criminalizing a woman’s right to choose abortion. Killing a fetus to prevent physical or emotional harm to the mother is JUSTIFIED. Her private decision about her own body is not to be violated by outside religious dogma. The body is the ultimate sacred space and a woman has the right to protect it from threatening intrusion by anyone, including an unplanned and unwanted pregnancy. Rape by the male takes two forms. He forces his penis into her body and, with the encouragement of fanatically obstinate women, he forces his sperm into her egg and womb. Forcing contact and motherhood is beyond evil. It is beyond breaking and entering. It is beyond violation of privacy. It is violent imposition of absolute power over the body and soul of a human being. Justifiable homicide is a well-established legal principle that protects us all in a case of direct physical intrusion and potentially deadly assault. Forcing motherhood can be as lethal as a knife to the heart, and no one has the right to force either sexual intercourse or maternity on anyone. To protect her own life and her own sacred will, a woman is absolutely justified in taking a life. Forcing a penis into a vagina and forcing a fetus upon a womb is rape, a violation of the heart and home of a woman’s soul. Women who support the men who commit rape are traitors to humanity, to life and to the God who honors free will and values women as much as men. ",
            "date": "Updated October 8, 2019",
            "views": "687",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Conlin",
                    "user_href": "/profile/Dan-Conlin-1"
                },
                {
                    "user_id": "Virginia Duperre",
                    "user_href": "/profile/Virginia-Duperre"
                },
                {
                    "user_id": "Tom Kehoe",
                    "user_href": "/profile/Tom-Kehoe-1"
                },
                {
                    "user_id": "Penelope Schoeffel",
                    "user_href": "/profile/Penelope-Schoeffel"
                },
                {
                    "user_id": "Rose Justice",
                    "user_href": "/profile/Rose-Justice-2"
                },
                {
                    "user_id": "Matilda",
                    "user_href": "/profile/Matilda-87"
                },
                {
                    "user_id": "Alexandra Wolf",
                    "user_href": "/profile/Alexandra-Wolf-9"
                },
                {
                    "user_id": "Victor Croasdale",
                    "user_href": "/profile/Victor-Croasdale"
                },
                {
                    "user_id": "Harry Zitzelberger",
                    "user_href": "/profile/Harry-Zitzelberger"
                },
                {
                    "user_id": "Gary Miles",
                    "user_href": "/profile/Gary-Miles-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Meredith",
                "href": "/profile/Ian-Meredith-21"
            },
            "answer_text": "A seemingly complex question but once broken down is actually not so hard to answer: Chauvinism I am not sure it still true in 2020 but in recent years an Irish girl, potentially by fertility nature’s idea of an adult but still culturally a child herself had to find a path to the UK mainland to have her rapist’s child aborted. That position of the church is indefensible as is the past claim that no child could be conceived unless the female was enjoying it. Ignorance comes in many forms but I still hold that mindset to be one of the most offensive. Life as sacrosanct The first thing we must do with such a question is differentiate between “life” as conception and a sentient living creature. To any who take a stance that life is innately precious and that we have no right to terminate it; that the termination of life is inherently murder, then what am I supposed to think? I am either directing this to hypocrites, people guilty of intellectually dishonest Orwellian “Doublethink”, or people who: would live with a tapeworm as host rather than going to a doctor to get a prescription to kill it and have it cease to be a life that is ultimately parasitic and potentially harmful to your healthhave neither soap nor any antibacterial cleaning products in their homes house and never ever take antibiotics?Next we must look at the rights of the host and the parasitic life. If the parasitic lifeform and (however much you may not like the term is absolutely the reality) becomes a threat to the life of its host, the host must have the right to protect their own life over any rights of the parasitic life. The parasite has no overriding right over over the host’s body. The host has complete right’s over their body. Now we come to the more complex questionTerminating the life of the below is not murder of a human in any way shape or form except to those of certain religious positions who believe claims that do not hold up to any critical analysis. Terminating the life of the below is only terminating that which left to develop would at some point become a human, and autonomous entity reasonably deemed a human… An egg is not a chicken  BUT The above is not remotely an honest portrayal of the full scope of pregnancy termination. To a person with no medical training (such as me) , late terminations are almost indistinguishable from a severely premature baby who may go on to enjoy a full life. I have chosen not to paste in any images of such as I think only the most heartless would not find them distressing. If any respond to this reply at all, some may claim my not showing such images is deliberate and they trigger an emotional response unhelpful to my position that termination of a pregnancy is not “murder”. That I do not show such images is because I would not only deem such images as gratuitous but distressing for many and disrespectful of the mothers and families involved. If a human embryo had developed to within days of viable autonomous life but was now threatening to kill its mother, its host, I absolutely believe the adult human host still has the right to make their own determination on whether they value their own lives over the parasitic human they have built. Human in Utero If the human embryo has developed to the level where it can be medically identified to be at a stage of development where it is self aware and ‘thinking’, well now we are in whole different territory. If its birth risks the life of the host, I maintain the host has a right to life that surpasses that of the parasitic life. In reality many females choose to accept the risk and some allegedly knowingly to die to give their child life. I have no view on this - it is their call whether they do or do not. Death or life - for benefit of the baby/parents concerned rather than the rants of the rabble. I used to live in Texas. Texas is a state where a great many will proclaim that life is a god given wonder and no human has a right to abort a proteus of a human life, some might suggest far fewer able to discern the difference but I loved my days in Texas; mostly.They would say “Shucks! If God has created a life - no human, male or female has a right to end it.” I my experience, the very same people often endorse and embrace the Texas penal code. Just since 2000, 389 people have had their lives terminated as part of what Texans votes in every year as their representatives supporting a ‘legal system’ completely contrary to their claims the ten commandments are sacrosanct and which state to not murder as their primary position (even if it also lists a vast range of people it orders its followers should murder, including the genocidal wipe out of any town’s population, old, female, infant, goat, if a single person should remark - I am quite interested in this other bunch of people and they have this different god that I rather buy into…” These are often again the very same people who are anti-abortion. So it would appear that “life” is not sacrosanct at all to these people who claim it is regardless of whether they live in sparkling homes they are so proud of - with every surface sprayed and wiped with very life killer they can find; the house being enveloped once every few years in a fumigation tent to kill every living insect it might have become host to. Conclusion To terminate a pregnancy without apparent medical reason must have a cut off date. I do not know if that date has been revised but certainly in the past I would totally embrace the view of those who felt it over extended. As it stood, there is no question in my mind that it was terminating a human, but a parasitic human. So my position still stands - the host’s right over their own body overrides the parasitic entity within - up to a point. That is already the reality and only a fool would claim that society should dictate, given a health condition they should still give the parasitic human life priority over their own. So there is no issue. The only issue is that Full term Pregnancy is 40 weeks - a long time to not make a decision, but we know sometimes the mother - a potential victim in herself, is not in a position to make that decision or have it recognized as timely. Just as we in our educated middle class and above secular lives, not driven by religious guilt are blind to how a young girl in a religious social group/community would be forever treated as as a pariah for her right to make the decisions we consider her human right. ",
            "date": "Answered September 23, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ekaterina Kova",
                "href": "/profile/Ekaterina-Kova"
            },
            "answer_text": "It’s not legally murder, but it seems that the question is based on being morally comparable to murder such as infanticide. Depends. At what age was the Fetus terminated? Are we talking about a couple weeks from birth? Or very early one before the brain, let alone consciousness even arises? Killing it for example on the 40th week is certainly deeply immoral, but terminating the pregancy at the 12th week? I’d say no. The answer is not straight forward as some will like you to believe. There are some black and white areas, like 6 weeks old for example is perfectly acceptable while 40 week old for example would be completely unacceptable, but what about 20? 24? Where should the cutoff be when it’s considered unethical? You can read more here, it really is quite messy and somewhat arbitrary at this point. I’d like to see science play much more of a role in determining the moral cut-off point. What can science add to the abortion debate? ",
            "date": "Answered January 12, 2020",
            "views": "153",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alex Pismenny",
                "href": "/profile/Alex-Pismenny"
            },
            "answer_text": "Question: “How is abortion different from murder?” Comment: “I understand many unique reasons for why women and/or couples feel the need to terminate pregnancies, but also see many similarities between the two.” Short answer: there is no practical difference between abortion and murder. There is, as others noted, a legal difference: the purposeful killing of innocent human beings after they were born is against the law in all countries. Abortion is purposeful killing of innocent human beings before they are born and that is not against the law in some unfortunate countries. So, if by “murder” we mean “legally recognized murder”, then that is the difference: it is fictional. If a law doesn’t recognize abortion as murder, the law has to change. Till such time that it is changed, it should be ignored. The other distinction is likewise fictional: one victim is pre-born, the other post-born. But the pre-born is just as much a human being as post-born. So these are your “similarities”. As to why people might have “unique reasons” to commit abortion: make killing you parent legal and not murder under the law and people will have, every now and then, “unique reasons” to terminate their elder care expenses that way. I understand that pregnancy can be a severe burden, but it is no excuse to go around murdering people. ",
            "date": "Answered May 4, 2018",
            "views": "955",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julie Norberg",
                    "user_href": "/profile/Julie-Norberg"
                },
                {
                    "user_id": "Samuel McNair",
                    "user_href": "/profile/Samuel-McNair-5"
                },
                {
                    "user_id": "Sreeram Unnithan",
                    "user_href": "/profile/Sreeram-Unnithan"
                },
                {
                    "user_id": "Christina Byrum",
                    "user_href": "/profile/Christina-Byrum"
                },
                {
                    "user_id": "Joe Lammers",
                    "user_href": "/profile/Joe-Lammers"
                },
                {
                    "user_id": "Stephanie Zielke",
                    "user_href": "/profile/Stephanie-Zielke-3"
                },
                {
                    "user_id": "William Lawyer",
                    "user_href": "/profile/William-Lawyer-1"
                },
                {
                    "user_id": "Dan Sharff",
                    "user_href": "/profile/Dan-Sharff"
                },
                {
                    "user_id": "Kyle Gimple",
                    "user_href": "/profile/Kyle-Gimple-1"
                },
                {
                    "user_id": "Mauro Spatari",
                    "user_href": "/profile/Mauro-Spatari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pippi M. R. Groving",
                "href": "/profile/Pippi-M-R-Groving"
            },
            "answer_text": "In many places of the world, a foetus is not considered a person. A person has a birth certificate, a civil registration number and civil rights. Before the foetus is born, it is not a member of the society. The woman is a person and a citizen and in her medical journal it is noted that she is pregnant. But he foetus isn't an individual part of the pregnancy, it's a feature of the citizens pregnancy. In most countries all their citizens have a right to protection. Protection against being hurt and murdered. A feature of a pregnancy aren't considered a citizen and therefore have no such rights. Where I come from a miscarriage don't even have the right to be buried. Don't misunderstand me, of course mourning would-be parents can get their lost potential child burried. But unless they ask for it, a miscarriage is considered medical waste. Whereas any born and registered citizen will be treated with respect, given a minor service and then cremated and burried in a churchyard, even if no one knows them. A foetus can't be murdered. It is it not a person. That said. I am pro-choice, but I do think that my country's decision about a limit for abortion is ok. If you need to wait more than 4 months to decide, you might as well go through with it, if it's a healthy pregnancy. We have tax-payed health care. You'll get an abortion paid by the state if you want. But we also have tax-payed health care for pregnant women, rights to 18 weeks maternity leave, possibility for help with adoption, help with postpartum depression, free health care for babies, monetary help with day care and kindergarten and free education up to and included a master degree. And a family with children can get a general allowance if needed. But all the rights, are first given to the child after it is born. And before that it only have the rights it's mother decide to give it. So. A person can be murdered A foetus can't be murdered. ",
            "date": "Answered March 27, 2018",
            "views": "26",
            "upvotes": " View 41 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bonnie Warner",
                    "user_href": "/profile/Bonnie-Warner-5"
                },
                {
                    "user_id": "Yasmine Metayer",
                    "user_href": "/profile/Yasmine-Metayer"
                },
                {
                    "user_id": "Marideth Bridges",
                    "user_href": "/profile/Marideth-Bridges-1"
                },
                {
                    "user_id": "Penelope Greenfield",
                    "user_href": "/profile/Penelope-Greenfield"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Francisco Zafra",
                    "user_href": "/profile/Francisco-Zafra-1"
                },
                {
                    "user_id": "John Filmore",
                    "user_href": "/profile/John-Filmore-4"
                },
                {
                    "user_id": "Maggie Martel",
                    "user_href": "/profile/Maggie-Martel-2"
                },
                {
                    "user_id": "Phil Boettge",
                    "user_href": "/profile/Phil-Boettge"
                },
                {
                    "user_id": "Arlene Hemphill",
                    "user_href": "/profile/Arlene-Hemphill"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christina Hu",
                "href": "/profile/Christina-Hu-13"
            },
            "answer_text": "Because otherwise, every other refusal to donate an organ to save a life is now a murder. The uterus is an organ. If, as you say, a fetus is a person, than that person is completely dependent on another person’s organ to survive. At this point, you may say that it is the parent’s moral responsibility to give a child use of their organs. But what if it was a kidney, instead? If a parent refuses to give a child a kidney, without which the child would die, is that murder? And what about those unfortunate siblings whose parents decide that they must donate tissues to another child, regardless of eithe Continue Reading",
            "date": "Answered March 26, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oliver James",
                "href": "/profile/Oliver-James-12"
            },
            "answer_text": "I am not a legal scholar and cannot speak for the interpretation of abortion under the law. I can however take a wider more philosophical view about how abortion is now legal in many secular countries. It is due to Moral Relativism. Moral relativism describes the difference in beliefs of what is moral and immoral between peoples and cultures. Proponents argue that there is no Universal moral system or morality that exists for the human race. Moral Relativism in essence is anti-theist. This is because generally religions come with pre-packaged morals that serve to direct the moral compasses of ad Continue Reading",
            "date": "Answered March 5, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Debbie Pendry",
                "href": "/profile/Debbie-Pendry"
            },
            "answer_text": "I see quite a few people labeling abortion as murder based on dictionary definitions which is technically true but somewhat disingenuous. To do so you also have to define “person” as well. According to the dictionary a person is: a human being, whether an adult or child the actual self or individual personality of a human being[1] Living and/or person status is someone already born. Ok, so now off to the Bible. There is no passage in the Bible referring to abortion being a sin. We know based on other texts that abortion was common and referenced back to the earliest histories. Abortion is referenced  Continue ReadingFootnotes[1] the definition of person",
            "date": "Answered May 4, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Morris",
                "href": "/profile/Tom-Morris-3"
            },
            "answer_text": "Under English law, a somewhat simplified definition of murder is when someone unlawfully kills another person with malice aforethought—that is, they intend to kill or seriously wound the other person. The key word there is ‘unlawfully’. Under s1 of the Abortion Act 1967, “a person shall not be guilty of an offence under the law relating to abortion when a pregnancy is terminated by a registered medical practitioner” subject to the conditions laid out in the Act. It cannot be murder since murder must be unlawful, and the Abortion Act specifically notes that it is lawful—“a person shall not be gui Continue Reading",
            "date": "Updated May 3, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "André Teixeira",
                "href": "/profile/André-Teixeira-20"
            },
            "answer_text": "Ia m not a legal expert, but here is my view based on conflicts between fundamental rights.  In my view, the reason why abortion (within certain bounds, namely until viability) is not illegal comes this: The abortion of an unwanted pregnancy puts into conflict two fundamental rights (not in any order): right to life of the fetusright to freedom of the woman (bodily autonomy)Fundamental rights are individual. Fornone same person, different fundamental rights may be ordered (right to life > right to freedom). But fundamental rights of different people are on equal grounds (right to life of fetus = r Continue Reading",
            "date": "Answered May 29, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Potter",
                "href": "/profile/Richard-Potter-17"
            },
            "answer_text": "I have known many women who have had an abortion after giving it a great deal of thought. Not one of these women is a criminal, much less someone who would murder her own or anyone else’s child. There is something qualitatively different about ending a pregnancy than killing a person. Obviously, there is less of an attachment to a fetus than an infant. About one-third of fetuses spontaneously abort. Generally, couples don’t name the lost fetus or have a funeral, although a miscarriage can certainly bring a feeling of loss and sadness. A fetus has never been perceived to be equivalent to a perso Continue Reading",
            "date": "Updated February 25, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jen Gronroos",
                "href": "/profile/Jen-Gronroos"
            },
            "answer_text": "Abortion is not done to \"kill\" or to \"murder\" the fetus. It is done to expel the pregnancy, to prevent the possibly fatal consequences of the unwanted pregnancy. If the fetus is too young to survive without relying on someone's body it will die. If it is advanced enough to have a chance it is resuscitated in NICU.  If you want to treat the fetus like you would treat a grown man, abortion is self defense. If someone poses a threat to your health and safety, who may lead you to lose your job, be scorned by your family, be abused by your partner, lead you to financial ruin unable to feed your chil Continue Reading",
            "date": "Answered April 23, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Uebersax",
                "href": "/profile/John-Uebersax-1"
            },
            "answer_text": "Let’s look at this using a traditional philosophical perspective — one consistent with our legal framework. What defines a human being? How is a human being different from other biological organisms? Aristotle, one of the pillars of Western thought, famously argued that while other organisms have a physical (nutritive) soul and an emotional soul, human beings have, in addition, a rational soul. If a fetus has not yet developed a rational soul, then this might suggest it is not a full human being with all associated rights. But is a fetus a ‘potential’ human being? Let’s try a thought experiment.  Continue Reading",
            "date": "Answered November 2, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Natasja Rose",
                "href": "/profile/Natasja-Rose"
            },
            "answer_text": "I’m hoping that this is a troll question, but just in case… A crime, by definition, is something known to be wrong and inexcusable, without justification. (Although milage may vary on minor crimes committed out of desperation) Abortion is not a crime, because their are valid, justifiable reasons to have one. Said reasons include, but are not limited to: Stillbirth: The baby has died in the womb, and rather than forcing the mother to endure the rest of the pregnancy, with possible serious side effects due to dead tissue, the doctors recommend an abortion or induced labor to get it out.Non-viable: Continue Reading",
            "date": "Answered September 28, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "D. Brown",
                "href": "/profile/D-Brown-176"
            },
            "answer_text": "If this question were to be rephrased as “Is Abortion ending a life?” instead of “Is abortion murder?’ I believe it would elicit a different response from many and would circumvent the legal semantics. By legal definition, no it is not murder because the fetus is not yet considered a human. I think the real question at hand is asking, “is having an abortion ending a life?” and I think everyone knows deep down with a heavy heart that it is. This day in age you can hear the heart beat from as early as six weeks. It is 100% guaranteed to turn into a human being. How are we to determine when we ha Continue Reading",
            "date": "Answered July 14, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barry Goldberg",
                "href": "/profile/Barry-Goldberg-1"
            },
            "answer_text": "Why isn't abortion considered to be murder? Hmmmm… Let me try to explain this using a religious example. The Sixth Commandment states, “Thou Shalt Not Kill,” which seems to be a pretty clear statement saying it is wrong to kill anybody at any time for any reason, right? Except, of course, the Bible is filled with other instances where people are told it’s perfectly OK to stone people to death for things like having homosexual relations, being a disobedient child, being a “witch,” etc. Not only that, but there are many, many different occasions where God is said to have specifically ordered his f Continue Reading",
            "date": "Updated September 23, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tyler Pasco",
                "href": "/profile/Tyler-Pasco"
            },
            "answer_text": "I'm likely a strong kidney match for my son. If he needed a kidney, I would give one up in a heartbeat. But if I chose not to, it wouldn't be murder. It would be a decision to keep my body intact. Dead people still have the right not to donate tissues. Why should women have no right to decide if they want to donate 30% of their energy, undergo nervous system and hormone changes, risk gestational diabetes, risk preeclampsia, risk death in about 17 different ways, and squeeze a ten pound human out of their quarter-size vagina if a dead person can choose to keep their organs? ",
            "date": "Answered March 27, 2018",
            "views": "53",
            "upvotes": " View 471 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angeline Kirsten Abutan",
                    "user_href": "/profile/Angeline-Kirsten-Abutan"
                },
                {
                    "user_id": "Bonnie Warner",
                    "user_href": "/profile/Bonnie-Warner-5"
                },
                {
                    "user_id": "Anamika Narzary",
                    "user_href": "/profile/Anamika-Narzary-4"
                },
                {
                    "user_id": "Brendan Johnson",
                    "user_href": "/profile/Brendan-Johnson-1"
                },
                {
                    "user_id": "Aletheia Kong",
                    "user_href": "/profile/Aletheia-Kong"
                },
                {
                    "user_id": "Jaya Swathi",
                    "user_href": "/profile/Jaya-Swathi"
                },
                {
                    "user_id": "Niki M Bush",
                    "user_href": "/profile/Niki-M-Bush"
                },
                {
                    "user_id": "Mari Adkins",
                    "user_href": "/profile/Mari-Adkins"
                },
                {
                    "user_id": "Sandy Peaks",
                    "user_href": "/profile/Sandy-Peaks"
                },
                {
                    "user_id": "Angel Ferrer",
                    "user_href": "/profile/Angel-Ferrer-6"
                }
            ]
        }
    ]
}