{
    "title": "How long did the Byzantine Empire prosper? - Quora",
    "tags": [
        "Byzantines",
        "Roman Empire",
        "Ancient Rome",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christos Antoniadis",
                "href": "/profile/Christos-Antoniadis-1"
            },
            "answer_text": "For a very long time. From 284 (when Diocletian first divided the Empire into East and West) to 602 (when Phocas came to the throne), the Byzantine Empire was the wealthiest, largest and most powerful state in the world. Although the Western Roman Empire declined and collapsed, the Eastern Empire managed to retain its wealth and prosperity despite the fact that it too faced barbarian invasions (for example, see the catastrophic Battle of Adrianople) and the Sassanid Empire (Persians) in the East. The Byzantines were lucky to have capable rulers such as Constantine the Great, Constantius II, Theodosius the Great and Anastasius I. Unlike the Western Empire, which was dominated by military officers who subverted the power of the Emperor, the Byzantine Empire was dominated by civil officials. In 500 AD, thanks to the careful fiscal administration of Emperor Anastasius, Byzantium was stable, at peace and with a huge fiscal surplus.  -World map in 500 AD Justinian (527 - 565) managed to reconquer Italy, North Africa and Southern Spain for the Empire. Constantinople, capital of the Empire, became the wealthiest and most populous city in the world. Despite the plague and some further barbarian invasions during the last part of his reign, the Empire remained prosperous. In 565, the Empire is estimated to have had a population of 26,000,000 people. The only region that could hope to rival the Byzantines was China but at that time period it was fragmented and as such until the rise of the Sui Dynasty, the Byzantine Empire was undisputedly the most powerful state on earth.  -Justinian’s Empire The reign of Phocas ushered an era of decline. During his reign and the first years of his successor, Heraclius, the Empire suffered one defeat after the other by the Sassanids. The Persians overtook the Eastern provinces, Avars and Slavs flooded the Balkans and Lombards invaded Italy. Although Heraclius was able to beat the Persians thanks to his military genius, he was not able to restore control over the Balkans or most of Italy. In the 630’s and 640’s the Empire suffered even more defeats at the hands of the Arabs who rapidly conquered the Persian Empire and the Eastern provinces (Egypt, Palestine, Syria) of the Byzantine Empire. By the year 717, the Byzantines had also lost North Africa and the capital itself was under siege. Thankfully, that was the year when Leo III became Emperor and saved Constantinople from Arab conquest. From Leo’s time, the Empire began to fight back against the Arabs and restore control in the Balkans, where Slavic tribes and the Bulgarian Kingdom dominated.  -The Byzantine Empire in 717 As it can be seen from the map, this Empire looks tiny in comparison to Justinian’s superpower that dominated the entire Mediterranean. It was an Anatolian state with a few footholds in Greece and Italy. The only really prosperous regions were Constantinople and Sicily. Yet, this reversal had its advantages too: it made the Empire more cohesive as it was limited to the Greek heartland where Greek civilization and Orthodoxy dominated. One of the reasons the Empire managed to survive is because during the time of Heraclius’ successors, the ‘Theme System’ was established. According to this system, the General of a province had command of both its civil and military affairs. This made response to Arab invasions more rapid and militarized the provinces. Slowly but gradually, the Empire began recovering its lost provinces in the Balkans and going on the offensive against the Arabs in Syria and Mesopotamia. The beginnings of this epoch can be placed in 820 with the establishment of the Amorian Dynasty. During this time, the Slavs were being Christianized by Byzantine missionaries, the Empire was expanding and the economy began to recover. The establishment of the Macedonian Dynasty in 867 by Basil I ushered a new Golden Age in Byzantium. Thanks to efforts of Emperors like Romanos Lekapenos, Nikiphoros Phocas, Ioannis Tzimiskes and Basil II (the ‘Bulgar-Slayer’) Byzantium became the dominant power in the Mediterranean: it placed all the Balkans under its control, restored Byzantine control over Southern Italy and pushed back the Arabs in Syria and Mesopotamia. Constantinople became the wealthiest and most populous city in all of Europe and both Christians and Muslims marveled at its prosperity.  -The Byzantine Empire in 1025 From 1025 to about the 1060’s the Empire remain prosperous, its economy continued to grow and philosophers like Michael Psellus ushered an era of learning in Byzantium. Yet, despite all this wealth and prosperity, the position of the Empire increasingly worsened. The Emperors succeeding Basil II were indecisive, had little military experience or talent in fighting wars and relied mainly on the civil officials, setting aside the military officers who had brought the Empire to such heights of power. The Empire also began relying on mercenaries for its defense. Some historians have also blamed Basil II for this, as his measures against the military aristocracy of Anatolia may have weakened the defense of the Empire in the East. By the 1060’s, the Turks were making increasingly more threatening raids in Anatolia. In the Battle of Manzikert (1071), the Emperor Romanos Diogenes suffered a crushing defeat at the hands of the Turks. In the ensuing civil war, the Turks managed to conquer most of Anatolia. Thankfully for the Empire, almost a century of capable Emperors followed. Alexios Komnenos founded the Komnenos Dynasty in 1081. His successors, John II and Manuel I, managed to push back the Turks with the aid of the crusaders. Although they did not manage to push the Turks out of all of Anatolia, they secured the wealthy coastal areas; the Turks were left with the barren highlands. The Balkans were also completely secure after the Komnenoi pushed back nomadic invaders from the north. At that time, the Empire was more urbanized than during Justinian’s time. Its wealth was also comparable to that of the Justinianic Empire, which says a lot since the Byzantine Empire at this time was far smaller than the huge Empire Justinian commanded. Constantinople had about 400,000 people, making it the largest and wealthiest European city.  -The Byzantine Empire under the Komnenoi Yet, despite the fact that the Empire was prosperous, it soon entered a period of decline. In the 1190’s, incapable Emperors ruled the Empire. Regionalism and corruption became endemic and the Emperors suffered military defeats. In 1204, Constantinople was taken over by the Western Crusaders and the Empire fragmented. Although the Empire of Nicaea in Asia Minor was somewhat prosperous and the restored Byzantine Empire after 1261 did manage for a century to be the hegemonic power of Greece, I would argue that the Empire at this time was only a minor regional power and will thus end my answer here since the question is about how long the Empire was prosperous. From 284 to 602, Byzantium was a superpower. From 717 to 1204, it was the wealthiest and most powerful state in all of Europe. So, from 284 to 1204, the Empire was prosperous for about 920 years. This is pretty impressive considering the fact that most Empires usually prosper for only two or three hundred years. ",
            "date": "Answered June 14, 2017",
            "views": "83",
            "upvotes": " View 94 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Curley",
                    "user_href": "/profile/Mark-Curley-3"
                },
                {
                    "user_id": "Dan Vasii",
                    "user_href": "/profile/Dan-Vasii"
                },
                {
                    "user_id": "Shakil Neve",
                    "user_href": "/profile/Shakil-Neve"
                },
                {
                    "user_id": "Alexandre Stefanov",
                    "user_href": "/profile/Alexandre-Stefanov"
                },
                {
                    "user_id": "Sergei Polovin",
                    "user_href": "/profile/Sergei-Polovin-1"
                },
                {
                    "user_id": "Cipi Steia",
                    "user_href": "/profile/Cipi-Steia"
                },
                {
                    "user_id": "Frank Fariello",
                    "user_href": "/profile/Frank-Fariello"
                },
                {
                    "user_id": "Allen Maddox",
                    "user_href": "/profile/Allen-Maddox-5"
                },
                {
                    "user_id": "Stephen Hinchey",
                    "user_href": "/profile/Stephen-Hinchey"
                },
                {
                    "user_id": "Mike Leech",
                    "user_href": "/profile/Mike-Leech-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Wang",
                "href": "/profile/Eric-Wang-434"
            },
            "answer_text": "It definitely depends on what you mean by “prosper.” Pink: Byzantine Empire Blue: Despotate of Epirus Maroon: Empire of Nicaea Orange: Empire of Trebizond The first period of Byzantine prosperity lasted approximately from the start of the reign of Anastasius I in 491, up to the overthrow of Maurice by Phocas in 602. From this point on, the eastern provinces of the Empire would be conquered by the Persians in the 610s, and then the Arabs in the 640s, while the Balkans would be conquered by the Avars, Slavs, and Bulgars. The loss of 70% of its territory/population was a crippling blow to the Empire’s economy and military. The Byzantines then had to endure centuries of Arab raids, and continued loss of territory to the Bulgars and the Muslims.  Byzantine Empire in 491  Byzantine Empire in 565  Byzantine Empire in 702 The period of recovery began after the Caliphate began splintering along divides within Islam. This recovery would culminate with Basil II retaking Antioch, and pushing the borders in the West to the Danube for the first time in centuries. This could be called the second period of Byzantine prosperity.  Byzantine Empire in 800  Byzantine Empire in 905  Byzantine Empire in 1025 This renewed Empire, however, would be quickly knocked off its feet again by the Seljuk Turks, who invaded Anatolia following the Battle of Manzikert. By the time of the First Crusade, the Byzantines had lost all of Anatolia. By the 1150s, the Byzantines had recovered decent portions of Anatolia, but the Fourth Crusade and the Sack of Constantinople, coupled with revolts in Bulgaria, toppled the Empire for a half century.  Byzantine Empire in 1095  Byzantine Empire in 1150  Byzantine rump states in 1206 The loss of its capital, however, did not doom the Byzantine Empire, for one of its successor states would recapture New Rome in 1261. The period from 1261 to roughly 1330 can be called the third period of Byzantine prosperity, until the Ottomans conquered the Empire’s remaining land over the course of a century, finally capturing Constantinople in 1453.  Byzantine Empire (with successor states) in 1261  Byzantine Empire (with successor states) in 1348  Byzantine Empire (with successor states) in 1453  Byzantine successor states in 1479 All credits for these amazing maps go to EmperorTigerstar. He makes high-quality animated maps that have been a great resource for me in the past. Check his videos out! Here is the video where I found these maps in particular:  ",
            "date": "Answered April 8, 2017",
            "views": "21",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonio Mayorga",
                    "user_href": "/profile/Antonio-Mayorga-4"
                },
                {
                    "user_id": "Aidan Turner",
                    "user_href": "/profile/Aidan-Turner-20"
                },
                {
                    "user_id": "Scott Young",
                    "user_href": "/profile/Scott-Young-124"
                },
                {
                    "user_id": "Akis Tolis",
                    "user_href": "/profile/Akis-Tolis"
                },
                {
                    "user_id": "Richard Bischoff",
                    "user_href": "/profile/Richard-Bischoff-1"
                },
                {
                    "user_id": "Om Herekar",
                    "user_href": "/profile/Om-Herekar"
                },
                {
                    "user_id": "Zach Norman",
                    "user_href": "/profile/Zach-Norman-5"
                },
                {
                    "user_id": "Mohammad Alsafran",
                    "user_href": "/profile/Mohammad-Alsafran"
                },
                {
                    "user_id": "Ygor Coelho",
                    "user_href": "/profile/Ygor-Coelho"
                },
                {
                    "user_id": "Leo Söderberg",
                    "user_href": "/profile/Leo-Söderberg"
                }
            ]
        }
    ]
}