{
    "title": "How accurate were medieval archers? - Quora",
    "tags": [
        "Medieval Archers",
        "Archery",
        "Middle Ages (era)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Reed",
                "href": "/profile/Brian-Reed-56"
            },
            "answer_text": "Except at short range, accuracy mattered very little. What was important was to be able to draw a heavy bow repeatedly in order to shoot arrows at the rate of around 10 per minute for maybe 10 minutes at a time. Archers were the medieval artillery & did most damage by indirect fire ie they did not aim at a particular enemy soldier & expect to hit them. Instead, the idea was to produce a cloud of arrows in the air such that the enemy had to try to avoid being hit from above while also trying to advance towards the fight. The more random the flight of these arrows, the better to a large degree. The archers used heavy, long arrows tipped with broad, often barbed, heads to inflict maximum damage to the enemy rank & file foot soldiers. The arrows were fired at a high trajectory & gained considerable energy on the way down to their intended targets. If the archers were on the winning side, they could collect arrows easily enough for re-use as their side advanced. It was when the enemy approached more closely that accuracy became a factor & the penetrating power of the longbow could be used to devastating effect. Some arches were reputed to be able to fire their bodkin(sharp, narrow head) arrows through the visors or joints of suits of armour. Even if the arrows could not penetrate good armour at short range, archers would certainly impede the enemies’ progress by shooting their horses. It is likely that horses would be armoured in front but vulnerable to attack from the sides. A warhorse presents a big target so it would not require a great deal of accuracy to damage one. It is impossible for us to comprehend the full horror of a medieval battlefield, with dead & dying horses & men creating obstacles. The freshly-churned mud would have been a huge impediment to surviving heavily-clad knights, making them easy prey to archers. French knights, in particular, used to regard it as unfair that a peasant archer could inflict so much damage on an expensively-trained & equipped noble warrior. There may be an accidental (or not so accidental) element of biological warfare at work too. Arrows were delivered to the archers in bundles & to maintain a high rate of fire, a convenient number of arrows would be pushed into the ground in front of each archer. The arrows inevitably collected soil on their warheads & when this soil was driven into the body of an enemy by a successful arrow strike, the resultant infection would most likely seriously or fatally damage the enemy. This infection would not act quickly so it was not an effective battlefield weapon but it would have added to the toll of dead or injured after the battle. ",
            "date": "Updated March 17, 2018",
            "views": "43",
            "upvotes": " View 37 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Rawn",
                    "user_href": "/profile/Bob-Rawn"
                },
                {
                    "user_id": "Alyssa Tavis",
                    "user_href": "/profile/Alyssa-Tavis"
                },
                {
                    "user_id": "Daniel Serene",
                    "user_href": "/profile/Daniel-Serene"
                },
                {
                    "user_id": "Gil Haselberger",
                    "user_href": "/profile/Gil-Haselberger"
                },
                {
                    "user_id": "Michael Röschter",
                    "user_href": "/profile/Michael-Röschter-1"
                },
                {
                    "user_id": "Boo Plisetsky",
                    "user_href": "/profile/Boo-Plisetsky"
                },
                {
                    "user_id": "Sigmund Engeset",
                    "user_href": "/profile/Sigmund-Engeset"
                },
                {
                    "user_id": "Elizabeth Wohlauer",
                    "user_href": "/profile/Elizabeth-Wohlauer"
                },
                {
                    "user_id": "Ak Smith",
                    "user_href": "/profile/Ak-Smith"
                },
                {
                    "user_id": "Lee Jerry",
                    "user_href": "/profile/Lee-Jerry-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Blyth",
                "href": "/profile/Steve-Blyth-1"
            },
            "answer_text": "This is an pretty odd question to be posed by someone whose country has no medieval history. During the medieval period, it was law that all men between the ages of 8 and 55 were to practice archery each Sunday, failure to do so would incur a pretty severe punishment. Archery was not a pastime of the nobility, the bow was considered a peasant weapon. Even when the nobility hunted, they rode down the prey and used a spear for the kill. The Bow was the domain of the common folk and they alone became the force to be reckoned with when facing the combined armies of England. At Crecy a hugely outnumbered English Army laid down so much fire it was reported that the arrows in flight hid the sun. Similarly at Agincourt 5000 archers are reported in contemporary records to have run out of arrows within 5 minutes. The advancing Knights were faced with a storm of 40 to 50000 arrows falling upon them. The target was the horses, dismount the heavily armoured knights and in the mud and thrashing of wounded horses kill them before they could recover. Recent acheological finds indicate that English Archers had hugely developed upper bodies Arm and shoulder bones and the attatchment points for sinew and muscle vastly increased. It is also reported that yew bows had draw strengths of up to 150lbs thus increasing initial velocity significantly. Bodkins often were composite arrows made partly of oak to add weight and then with hazel or willow scarfed in to make the complete arrow. Annual Archery contests were held in most market towns in England, its recorded that very often several archers could hit bull at 100 paces with a full sheaf of arrows. In which case the bull was reduced until a single winner was found. Based upon this and only comparing modern archery to medieval England I would suggest whilst the modern archer may be more accurate, he would not stand a chance against the power of the medieval bow in the hands of a war hardened medieval archer(rate of fire, simplicity of the weapon and decades of practice. ",
            "date": "Updated April 8, 2018",
            "views": "325",
            "upvotes": " View 222 Upvoters",
            "upvoters": [
                {
                    "user_id": "Philip Wiseman",
                    "user_href": "/profile/Philip-Wiseman-12"
                },
                {
                    "user_id": "Lance Knuth",
                    "user_href": "/profile/Lance-Knuth"
                },
                {
                    "user_id": "Treve Stoddern",
                    "user_href": "/profile/Treve-Stoddern"
                },
                {
                    "user_id": "Stephen Thomas",
                    "user_href": "/profile/Stephen-Thomas-58"
                },
                {
                    "user_id": "Dean Oliver",
                    "user_href": "/profile/Dean-Oliver-31"
                },
                {
                    "user_id": "James Preston",
                    "user_href": "/profile/James-Preston-142"
                },
                {
                    "user_id": "Hayley More",
                    "user_href": "/profile/Hayley-More"
                },
                {
                    "user_id": "Aditya Rajagopal",
                    "user_href": "/profile/Aditya-Rajagopal-2"
                },
                {
                    "user_id": "Alexander Thomson",
                    "user_href": "/profile/Alexander-Thomson-10"
                },
                {
                    "user_id": "Thomas Burns",
                    "user_href": "/profile/Thomas-Burns-131"
                }
            ]
        }
    ]
}