{
    "title": "How did Justinian's war with Ostrogothic Italy cripple the peninsula more than the collapse of the Western Empire? - Quora",
    "tags": [
        "Roman Empire",
        "Ancient Rome",
        "Italy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Lubbers",
                "href": "/profile/Patrick-Lubbers"
            },
            "answer_text": "Justinians first intentions were to reunite the East and West of the former Roman Empire under his rule, his conquest of Italy however turned out to take much longer than expected. During the decade-long struggle for Italy, the peninsula suffered from many hardships and was a shadow of its former self by the end of the 550’s. The long fighting took the lives of many people in Italy. As the conflict dragged on for many years, there was a constant reduction of people able to work the fields or rebuild. It led to a huge number of refugees, most of which chose to settle in other lands, rather than to return to a country which was devastated. The destruction and decrease in population ultimately led to economic collapse. Most of Italy’s wealth came from the fields and lands at that time, land owners thrived under the reign of the Goths actually, but of course the war left most of those land owners with ruined property. Again too little people to work the land, land which was too devastated to grow anything on anyway. Under the new reign of the Byzantines, Pope Pelagius actually had to request financial aid from other lands like Africa because of the great decrease of wealth. Also, Justinians rebuilding efforts included keeping his new lands as a mere addition of his Empire, meaning that there would be no more “Western” Emperor in Italy. He also appointed his own officials to more important positions instead of Italians, to decrease the chances of a rebellion breaking out. These officials would answer and report to Constantinople, not Rome, this all meant that Italy lost importance. Furthermore, the war led to a huge braindrain, as intellectual life came to a standstill, and the men able to teach newer generation had either died, moved away or shifted to more vital occupations. People weren’t able to spell their own name by the time Justinian was done with fighting his wars in Italy! Because of the reasons above, a power vacuum was created in Italy which was to be greedily filled by neighbouring barbarian tribes, as Justinian wasn’t able to consolidate his newly acquired territories. In the end Italy suffered because of his ambitions, and threw the land over the edge into the Dark ages. ",
            "date": "Answered June 25, 2017",
            "views": "800",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harry Hudson",
                    "user_href": "/profile/Harry-Hudson-5"
                },
                {
                    "user_id": "Shir Zad",
                    "user_href": "/profile/Shir-Zad-1"
                },
                {
                    "user_id": "Giustino Carbone",
                    "user_href": "/profile/Giustino-Carbone"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jumpin-Jack-O-Lantern"
                },
                {
                    "user_id": "Tasin Al-Hassan",
                    "user_href": "/profile/Tasin-Al-Hassan"
                },
                {
                    "user_id": "Corinna Vahtera",
                    "user_href": "/profile/Corinna-Vahtera"
                },
                {
                    "user_id": "Stuart Campbell",
                    "user_href": "/profile/Stuart-Campbell-46"
                },
                {
                    "user_id": "Muhammad Fauzi",
                    "user_href": "/profile/Muhammad-Fauzi-39"
                },
                {
                    "user_id": "Steve Speidel",
                    "user_href": "/profile/Steve-Speidel"
                },
                {
                    "user_id": "Toby David Low",
                    "user_href": "/profile/Toby-David-Low"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ludovico Altana",
                "href": "/profile/Ludovico-Altana-1"
            },
            "answer_text": "The two events aren’t really comparable. The “fall of Rome” was a rather bloodless affair as far as empires falling go; the Western Empire lost its power by “delegating itself out of existance”, parceling out all of its territory out of Italy to “military governors” who were loyal “barbarian” kings. But in theory, they were all still subordinates to the emperor. In practice, the emperor was usually a puppet for some general. When Odoacer dissolved the empire and seized power in Italy, he didn’t do so as an invader; he had control of the military, and preferred to pay lip service to someone in Constantinople than to someone in Ravenna. So he disbanded the previous system and effectively made the Eastern emperor the single overlord of the whole thing. In reality, local kings ruled. When Emperor Anastasius felt there was a need for a regime change, he sent in his own man Theoderic and his Ostrogoths to invade Italy and rule as a friendlier local representative of Rome. The Goths fought a textbook Roman civil war, defeating Odoacer’s army and occupying the country without much struggle. Having the emperor’s backing probably helped smooth out the transition. The Gothic wars were a different story; an attempt at imposing direct rule from a faraway capital. The Roman army was an alien, invading force, imposing martial law and destroying local institutions. This was no regime change, this was a war for survival. So both sides fought tooth and nail for twenty years. This permanently drove apart East and West; this is why “Byzantium” is still seen as something different from Rome. Because “Byzantium” invaded Rome and tore apart its monuments… Italy has been in relative decline ever since. ",
            "date": "Answered June 26, 2017",
            "views": "955",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gonzalo Astudillo",
                    "user_href": "/profile/Gonzalo-Astudillo-1"
                },
                {
                    "user_id": "Shir Zad",
                    "user_href": "/profile/Shir-Zad-1"
                },
                {
                    "user_id": "Tom Jacobs",
                    "user_href": "/profile/Tom-Jacobs-53"
                },
                {
                    "user_id": "Daniel Aldridge",
                    "user_href": "/profile/Daniel-Aldridge-8"
                },
                {
                    "user_id": "Giustino Carbone",
                    "user_href": "/profile/Giustino-Carbone"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Joachim Pense",
                    "user_href": "/profile/Joachim-Pense"
                },
                {
                    "user_id": "Martin Daly",
                    "user_href": "/profile/Martin-Daly"
                },
                {
                    "user_id": "Christian Roy",
                    "user_href": "/profile/Christian-Roy-18"
                },
                {
                    "user_id": "Nathan Donaldson",
                    "user_href": "/profile/Nathan-Donaldson-4"
                }
            ]
        }
    ]
}