{
    "title": "How did tools help early humans? - Quora",
    "tags": [
        "Prehistoric Humans",
        "Archaeology",
        "Anthropology",
        "Humans ",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Howden",
                "href": "/profile/Patrick-Howden"
            },
            "answer_text": "Depends when you mean “Early”: `` I saw a 1st century Museum near Reading UK decades ago & was amazed at how typical were wood-working tools then during the time of Christ - as if they had virtually never changed: saws, files, planes, needles, pliers, hammers, scissors, nails which Vikings had soon etc. Crossing the Pacific in my 1965 Schooner with sail self-steering, enabled me to read the Bible thoroughly & mark hundreds of green & technical references. Iron-work was exceptional including chains, & Locks etc!!! Metal jewellery too + gemstones grinding. Chariots were a work of genius, as were Roman roads on British Mountains!!! Here’s a tiny sample of TECH & GREEN BIBLE QUOTES= God’s Gardeners & Doctor: The leaves of the trees were for the curing of nations.\" Revelation - \"Woe to her that is rebelling & polluting herself, the oppressive city\" Zephania - \"And now there will be gathered against you many nations, saying let her be polluted\" Micah - \"Therefore the land will mourn; & everyone who dwells there will waste away with the beasts of the field & the birds; even the fish will be taken away\" Hosea - \"As they will have to beat their swords into ploughshares & their spears into pruning shears\" Isaiah - \"A nation whose land the rivers have washed away\" Isaiah - \"The productive land has gone to mourning, has faded away & the land has been polluted under its inhabitants, for they have by-passed the law, changed the regulation\" Isaiah - \"The pasture grounds of the wilderness have dried up\"- Jeremiah - \"And you must not pollute the land in which you are\" Numbers - \"Master, let the [tree] alone until I dig around it & put on manure\" Luke - \"I have learned in whatever circumstances I am to be self-sufficient. I know how to have abundance. In everything I have learned the secret of both how to be full & how to hunger\" Philippians - \"To be sure it is a means of great gain, this godly devotion along with self-sufficiency\" Timothy. To bring to ruin those ruining the earth\" Romans - \"And they will certainly build houses & have occupancy; & they will certainly plant vineyards & eat their fruitage. They will not build & someone else has occupancy; they will not plant & someone else do the eating - the work of their own hands my chosen ones will use to the full - \"The wolf & the lamb will feed as one, & the lion will eat straw just like the bull. They will do no harm nor cause any ruin in my entire holy mountain\" Isaiah - \"There is a time to prepare, a time to plant, a time to harvest & a time to rejoice in the fruit of your labour\" Ecclesiastes - \"Land that drinks in the rain after falling on it & that produces a crop useful to those for whom it is farmed receives the blessing of God. But land that produces thorns & thistles (desert produced by overpopulated goats) is worthless & is in danger of being cursed. In the end it will be burned\" Hebrews - “Praise the LORD from the earth.. mountains, fruit trees & all cedars.” Psalm 148 - He turned the desert into pools of water & the parched ground into flowing springs Psalm 107 - “There will be an abundance of grain on the earth; on top of the mountains it will overflow” Psalm 72:16. Farmers disobeying many of these Laws account for most Australian deserts as well as Sahara. 100s more. The second half of final Proverbs is phenomenal in describing Women’s role in being ideally highly Self-Sufficient. You will be very lucky to ever hear a preacher chatting about these as they are too busy trying to misinterpret them.. ",
            "date": "Answered April 17, 2020",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Parker",
                "href": "/profile/Michael-Parker-710"
            },
            "answer_text": "Let us consider the humble rock. Say that an early human managed to bring down a primitive gazelle, and after consuming the flesh it arrives at the bones of the beast. Curiosity being a strong trait of the human it wonders what the bone is and if it is edible. Smacking it with a hand or pounding it with a fist has no effect. So a lonely rock, minding it's own business, is enlisted in the effort. One or two blows reveals that marrow is at the center of this prehistoric “tootsie pop\". Voila! A tasty treat courtesy of the most simple of tools. ",
            "date": "Answered April 17, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Neil Sherman",
                "href": "/profile/Neil-Sherman-6"
            },
            "answer_text": "email sez: “Bhavin Patel wants an answer to: How did tools help early humans?” simply by Attracting Other Humans in the area; So there ya’d be, digging your food  and the thuksh, thuksh sound of Archimedes Lever working the dirt would be detected by your neighbors who’d just HAVE to Come Kibbitz How You’re Doing It ALL Wrong!  ",
            "date": "Answered April 17, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Fulginiti",
                "href": "/profile/Joseph-Fulginiti-2"
            },
            "answer_text": "Homo Habilis is believed to be the first man to use tools. Their name literally means ““handy man”. Once simple tools and hand axes were used, our ancestors were much more efficient at hunting, they could cut off pieces of meat from their kill and skin their prey for clothing. Studies have shown that as we increased our meat intake brain size increased, and our survival rate and infant mortality rate improved. ",
            "date": "Answered April 17, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Babson",
                    "user_href": "/profile/Tim-Babson"
                }
            ]
        }
    ]
}