{
    "title": "How was the wine quality 100 years ago? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Ravi Deshpande",
                "href": "/profile/Ravi-Deshpande-8"
            },
            "answer_text": "This is an interesting question. From what we know these were the differences. it was much lower in alcohol. Even as recently as the 70s the alcohol levels in red wines were 11% or less vs today’s 15%+. This has happened for various reasons: global warming, better viticulture, use of more ripe and concentrated grapes a result of grape yield reduction and global taste for more fruity and extracted wines (the so called Parkerization of wines, due to the tastes of the influential wine critic Robert Parker).Because of the above it was much lighter, and likely more tannic and acidic - more likely to be drank with food than as a drink itself. If you look at Renoir’s paintings, wine looks almost transparent and light pink vs today’s deep red, almost black colour for red wine.It was more likely to be spoiled or “corked”. As recently as the 70s up to 10% of older wines were flawed upon opening. Now it’s probaly 1% because of better hygiene and cork sterilization.For the reasons above it was likely wine was not as fresh or “clean” tasting as today’s wines.It had a cork - vs screw top or other closure. It might also be sold in a barrel vs a bottle.It was more cloudy and less clear. Because of less inclusion of stems and seeds in the winemaking as well as better filtering today.If it was champagne, it was sweeter. Champagne has become consistently drier throughout the years.",
            "date": "Answered April 4, 2019",
            "views": "249",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Murray H.G. Paterson",
                    "user_href": "/profile/Murray-H-G-Paterson"
                },
                {
                    "user_id": "Paul Lazule",
                    "user_href": "/profile/Paul-Lazule"
                },
                {
                    "user_id": "Robert Klute",
                    "user_href": "/profile/Robert-Klute"
                },
                {
                    "user_id": "LL Canales",
                    "user_href": "/profile/LL-Canales"
                }
            ]
        },
        {
            "author_info": {
                "name": "Murray H.G. Paterson",
                "href": "/profile/Murray-H-G-Paterson"
            },
            "answer_text": "The quality of the premium level wines (greateer than $US 20.00), would have been close to that of today - perhaps not quite as “clean” and they might well have thrown more sediment in the bottom of the bottle (reds) or tartrate crystals (whites), than today, but neither of those two things is detrimental to the wine. Back in 1920, they drew on the best fruit and took great care with their making - as they still do today. In difficult years, modern sprays allow cleaner fruit to be harvested so that might be the only significant advantage in 2020. The middle level wine ($US 6.00 to $US 20), has seen significant improvement in winemaking with more modern growiing methods evening out the seasons and modern winery techniques doing the same for the wine. There will be an improvement as a result - but not as dramatic as that of the lower level. However, the variation from year to year will be less and you’d be able to buy with more confidence. At the bottom end - far, far worse than the same level today. Acid, out-of-balance and often sour. Modern winemaking techniques have benefitted this level of the wine market to the greatest extent ……. to a huge extent. But then that depends on where you buy this cheap wine. In 2013, in Spain the $US1.60 wines were not only palatable but enjoyable - the same wine in France (vins ordinaire) was drain-cleaner and the quality had not improved since 1968, when I first tasted it as an impoverished student. ",
            "date": "Answered April 4, 2019",
            "views": "91",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Paul Lazule",
                    "user_href": "/profile/Paul-Lazule"
                }
            ]
        }
    ]
}