{
    "title": "How did most people in the Middle Ages determine if something was true? - Quora",
    "tags": [
        "Middle Ages (era)",
        "History of Europe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Chandos",
                "href": "/profile/Mark-Chandos"
            },
            "answer_text": "Did you say…. most people ..right? Then the scholastic method did not apply data all….maybe 100 Churchmen even knew what scholasticism was….which was basically circular logic. No Most 99.99 of all peoel never even had that question. What is true is modern question..because there's no answer for them except science and science fails, lies or is found corrupted in every decade. Scientism is a modern church where 99% of the people cant read a mathematical scientific paper…FACT!…. Therefore the message is this: “Trust us, let us do the thinking for you.” Most people in the Medieval age were on the land..deeply in agricultural communities where there was and ancient potion and a remedy with urbs for every illness. There was a way to fix almost any problem at the agricultural level. No one even bothered to ask the priest about the truth…since it was not a question that entered their heads…the universe was fixed, secure and under the will of God…who questions that…or why should they? People of the land have a technology appropriate to their needs. And they had every need met with their customs and traditions. They did not get up each morning and say…darn, I wish modernism would arrive with its pollution, toxins, overpopulations, and poisonous big pharma. All I have here is clean air and water…darn it! And no emails to answer 24/7..darn it..give me modernism or die. They did not have to worry about Global Warming …due to science..thank you science and industry. And since people worked all day.. hard…very hard…there was no time for depression and saying the color yellow made them sad. Modernism is arrogant to think we are the only age that has a good like…we are just delusional. In fact we are very nervous, worried, angry, and live in ghettos of our unhinged minds….where there are only unsolvable questions…and no final answers at all. Can you dig it? ",
            "date": "Answered April 2, 2020",
            "views": "528",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael M. Ross",
                "href": "/profile/Michael-M-Ross"
            },
            "answer_text": "There was “Truth by Ordeal” - great fun for all involved….  If you were accused of a crime, you either confessed or were subjected to a test such as drowning. This was the judicial method of determining innocence or guilt - truth or falsehood - before there were judges, juries, and evidence. In trial by ordeal, the expectation - or pretense - was that God would intervene in the outcome if the accused were innocent. The most common test was ordeal by hot water, in which the accused had to reach into a pot of perhaps boiling water and retrieve an object. It was up to the priest to determine how hot the water was, so the verdict could be a forgone conclusion. (You know the expression “in hot water”.)  In the ordeal by hot iron, the accused person would carry a burning hot iron so many paces without being burned to prove their innocence. Again the priest could rig the outcome. Alternatively, there was trial by fire - a familiar expression. This required the accused to walk a certain distance over red-hot plowshares (metal blades). In ordeal by cold water if the person were innocent they would sink, and if they were guilty they would float - that’s not the wrong way round. If the priest considered you innocent, you might be instructed to struggle in order to ensure sinking. The sinking individual was not left to drown (which would have made it a “heads you're guilty, tails you're dead” test). [1] Of course, there were other ordeals that were as sadistic as they sound, such as by cross (actually not crucifixion), by burning oil, and by poison.  Monty Python: ''How do you know she is a witch?'' Footnotes[1] https://study.com/academy/lesson/medieval-trial-by-ordeal-definition-lesson.html ",
            "date": "Answered May 13, 2020",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Syed Saad",
                    "user_href": "/profile/Syed-Saad-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger Hayes",
                "href": "/profile/Roger-Hayes-18"
            },
            "answer_text": "Universities existed as they were all founded & run by Catholic Jesuits & Cathusians. They were not as backward as some might imagine. Apothecary was out of its infancy. Most hospitals & infirmaries were run by & located at monasteries. Is where the names 'nurse' & ward 'sister' came from, because sisters were literally religious sisters. Scientific research was well under way (like to see the monk priest defrocked who turned gun-powder into expellents). The scientific method: if a theory could be replicated then it was held to be true. Experimentation with mixing ferrous & non-ferrous metals & testing for tensile strength. Principles later to be used in the construction of canon barrels & printing presses. Heavy iron carriage wheels became light but more durable wheels. Non- ferrous alloys for intricate engineering, the principles later used in making clockwork mechanisms & coaching suspensions were being researched, well ahead of industrial revolution. Principles of ballistics, were modelled.wight to range ratios of shot & distance to calibre ratios. Straight v spinning projectiles was becoming a science in its own right. Mixing antimony with tin & lead (other materials) to make solder. They discovered that a 40% tin content gave the longest period of placisity so the materials had longer to be worked, particularly useful for leading around glass for large church, school & manor windows. Chemistry & pesticides were being discovered & Grinding glass for opthalmics albeit primitive was well under way. Even primitive principles of flight were being discovered. How naturally occuring colours in nature long since used for dyes, mixing in other naturally occuring substances to improve durability & improve longevity of dyes. Evolving scientific methods of experimentation. So they were not as primitive as many would like to think. Peace & All Good ",
            "date": "Answered May 13, 2020",
            "views": "628",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diamone Cromer",
                    "user_href": "/profile/Diamone-Cromer"
                },
                {
                    "user_id": "Chris Meadows",
                    "user_href": "/profile/Chris-Meadows-77"
                },
                {
                    "user_id": "Robert Levitt",
                    "user_href": "/profile/Robert-Levitt"
                },
                {
                    "user_id": "Mike Walker",
                    "user_href": "/profile/Mike-Walker-101"
                },
                {
                    "user_id": "Kins Gabil",
                    "user_href": "/profile/Kins-Gabil"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Kleid",
                "href": "/profile/Matthew-Kleid"
            },
            "answer_text": "Truth was discovered through the scholastic method, that is ultimately derived from some authority, e.g. a renowned author, church father, one’s priest, lord, father, husband, etc. Empiricism did not yet exist and it wouldn’t be allowed anyway - too threatening to the medieval social order. ",
            "date": "Answered September 19, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lisa Marie Ambrose",
                    "user_href": "/profile/Lisa-Marie-Ambrose"
                }
            ]
        }
    ]
}