{
    "title": "How does Moses convince Pharaoh to release the Israelites? - Quora",
    "tags": [
        "Pharaohs",
        "Israelites",
        "Moses (biblical figure)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Ruis",
                "href": "/profile/Steve-Ruis"
            },
            "answer_text": "According to that story, the Egyptian king was willing to let them go a number of times but Moses’s god kept hardening his heart to prevent him from doing so. Do the people who believe such stories represent reality actually read them? Old Yahweh had Moses jumping through hoops on a task he set and then prevented him from succeeding time and again, so that, what, Yahweh could be the big hero helping the Hebrews escape? This god is supposed to be all-powerful. If I were such an entity and I wanted a group of people elsewhere I would just teleport them there. After such an event, there would hardly be nay sayers in that crowd of Hebrews so the 40 years in the wilderness to tame the stiff-necked would have been unneeded. Heck Yahweh could have just teleported the Hebrews into their promised land and teleported anyone in the way of that relocation back over to Egypt to take their place, no? And, doesn’t anyone else think that Yahweh is being a dick for favoring his Chosen People over other peoples? What does he have against all of the people living peacefully in Canaan that he orders the Hebrews to “Kill them all, and their little dogs, too!” Isn’t Yahweh the god of all? Doesn’t He love all of his children? Apparently not. ",
            "date": "Answered July 10, 2020",
            "views": "119",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Foster",
                    "user_href": "/profile/Peter-Foster-10"
                },
                {
                    "user_id": "Gerardo Pillado",
                    "user_href": "/profile/Gerardo-Pillado"
                },
                {
                    "user_id": "Mitch Claassen",
                    "user_href": "/profile/Mitch-Claassen-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Lawrence",
                "href": "/profile/Marc-Lawrence-23"
            },
            "answer_text": "Moses himself didn’t convince anybody. If it had been just Moses and Aaron demanding the release of the Israelites, it would have been a resounding failure and the Jews would probably still be slaves in Egypt today, or have been assimilated into Egyptians over time.  No, it was the God of Moses, Aaron and the Israelites, who identified himself at Exodus 3:13–15 as “’Jehovah the God of your forefathers, the God of Abraham, the God of Isaac and the the God of Jacob…This is my name forever, and this is how I am to be remembered from generation to generation”’” who convinced Pharaoh to release the Israelites, by means of ten devastating plagues of supernatural origin. These plagues humiliated the gods of Egypt, demonstrating their impotence to protect their worshippers and, finally, even the heir of Pharaoh, himself considered a god.  This was in part to facilitate the release of the Israelites from Egyptian slavery, and partly to make His name known. As Exodus 7:5 records, God said to Moses: “The Egyptians will certainly know that I am Jehovah when I stretch out my hand against Egypt and bring the Israelites out from among them.”   Pharaoh’s refusal to acknowledge Jehovah and to obey his commands, is recorded at Exodus 5:2 - “But Pharaoh said: “Who is Jehovah, that I should obey his voice to send Israel away? I do not know Jehovah at all, and what is more, I will not send Israel away.” God’s intervention is matters was at least partly to answer this challenge of Pharaoh - he would have to know that God was, and is, Jehovah. The sanctification of God’s name is a primary issue, and one that Jesus taught his followers to pray for, when in the model or Lord’s prayer, he instructed them to pray for the hallowing, or making holy, or sanctifying of God’s name, Jehovah. That that remains an issue is indicated by God’s words to Ezekiel: “I shall no more let my holy name be profaned; and the nations will have to know that I am Jehovah.”​ Ezekiel 39:7 https://www.jw.org/en/bible-teachings/questions/gods-name/ ",
            "date": "Answered July 10, 2020",
            "views": "131",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kathy Terwilliger",
                    "user_href": "/profile/Kathy-Terwilliger-1"
                },
                {
                    "user_id": "Rick Gutbrod",
                    "user_href": "/profile/Rick-Gutbrod"
                },
                {
                    "user_id": "Joseph Latney",
                    "user_href": "/profile/Joseph-Latney-1"
                },
                {
                    "user_id": "David Conklin",
                    "user_href": "/profile/David-Conklin-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Srock",
                "href": "/profile/Jonathan-Srock"
            },
            "answer_text": "It was actually God who forced Pharaoh to let the people of Israel go. Through ten plagues he challenged the Egyptian deities, their false gods, and brought his people out of the house of slavery. Moses was only the hand of God for deliverance. In fact, the Israelites wouldn’t even listen to Moses until he and his brother Aaron showed signs that God told him to show them (Exodus 4:29-31). Moses himself didn’t even want to face Pharaoh. Four times he asks the Lord to choose someone else (Exodus 3:10-4:13). God’s power in these plagues showed the Egyptian gods and Pharaoh that God is the true God. Each one of the plagues affected one of the Egyptian deities. It was an immediate challenge to their false gods and idols, their magicians who tried to copy some of the plagues, and Pharaoh whose stubborn heart hardened against the Lord. It took the death of his firstborn son for him to finally stop playing around with the Israelites and letting them go. Even then, he chased them into the Red Sea and lost his own life and army. He was never truly convinced that the Israelites should be let go. He was so hardened to Moses’ message from God and all of the signs and plagues that it cost him everything. The whole drama began with Israel only asking for a few days in the wilderness to worship the Lord. He refused to grant even that, and it turned into God freeing Israel completely. ",
            "date": "Answered August 8, 2020",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Ploeg",
                "href": "/profile/Mark-Ploeg"
            },
            "answer_text": "It was Gods doing that got Pharoah to release the Isrealites. He was very obstinate…..who is this Jehovah that I need to listen to. But each plague that God brought upon Pharoah made him see he was not high and mighty as he thought neither were his Gods because each plague was against an Egyptian God…..until the final one which was against Pharoah himself. Surely as a God which he thought he was he could protect his son from harm. But he couldnt every firstborn of every Egyptian man or animal died. Finally he let the Isrealites go to worship God in the wilderness…..but he changed his mind and took off in pursuit of them. He and his army died when they pursued Moses and the Isrealites into the miraculously parted Red Sea. ",
            "date": "Answered July 10, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kathy Terwilliger",
                    "user_href": "/profile/Kathy-Terwilliger-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Antony Waithaka",
                "href": "/profile/Antony-Waithaka"
            },
            "answer_text": "In real sense Moses didn't convince Pharaoh in anyway. It was as what the magicians finally admitted— “This is a finger of God “( Exodus 8:19) Moses was just a tool used by God as human to finish the project. If we think of Moses as the main character why then didn't he succeed before when he killed an Egyptian under the same move to free the Israelites? Remember that He God had told Moses how the heart of Pharaoh will be hard so that His power will be manifested over the whole mission (Exodus 9:12). All these boil down to the truth that God was the power in the mission not Moses. ",
            "date": "Answered July 10, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kim Guenther",
                "href": "/profile/Kim-Guenther-3"
            },
            "answer_text": "Marc Lawrence has a good answer. I would add: Moses had a speech impediment, so the guy doing the talking to Pharaoh is his brother, Aaron. Oh, god tried to kill Moses when he entered Egypt as an 80 year old man, because Moses was not circumcised. The tenth plague was the killing of the firstborn of Egypt, most of whom had nothing to do with enslaving the Jews, it was god getting revenge on the Jew’s behalf. It was the tenth plague that god had in mind all along, as he regularly hardened Pharaoh's heart against Moses’s requests. A non-literal reading of the tenth plague is that god did not want the Jews to kill Egyptians in revenge, so god did it, except that god did not really do so, he was demanding a higher moral behavior of humanity. Since it was people who wrote the Bible, it was people demanding moral behavior of people. Of course, none of this happened, it is a fable, there is no evidence of a large Jewish presence (much less enslaved presence) in Egypt during the presumed time periods or any time before Jews were well-established in Israel. Many of the events (such as talking bushes, some of the plagues, especially the tenth plague, the parting of the Red Sea) are impossible. ",
            "date": "Answered July 10, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajay Abraham",
                "href": "/profile/Ajay-Abraham-4"
            },
            "answer_text": "Thanks for the A2A Roksana Parvin Yasmin. It was the demonstration of Jehovah’s power that convinced the Pharaoh to release the Israelites. Before bringing the plagues on Egypt and delivering the Israelites from slavery, Jehovah told the Israelites what he was about to do. They would see Jehovah’s power demonstrated in ways that they had not previously witnessed, and the Egyptians would certainly know who Jehovah is. When God’s promises came true, the faith of the Israelites was strengthened, and this helped to counteract the false religious influences they had been exposed to in Egypt. By means of the plagues he visited upon the Egyptians, Jehovah humiliated and executed judgment upon their gods. (Exo 12:12) The first plague, the turning of the Nile and all the waters of Egypt into blood, brought disgrace to the Nile-god Hapi. The death of the fish in the Nile was also a blow to Egypt’s religion, for certain kinds of fish were actually venerated and even mummified. (Ex 7:19–21) The frog, regarded as a symbol of fertility and the Egyptian concept of resurrection, was considered sacred to the frog-goddess Heqt. Hence, the plague of frogs brought disgrace to this goddess. (Ex 8:5–14) The third plague saw the magic-practicing priests acknowledging defeat when they proved to be unable by means of their secret arts to turn dust into gnats. (Ex 8:16–19) The god Thoth was credited with the invention of magic or secret arts, but even this god could not help the magic-practicing priests to duplicate the third plague. The line of demarcation between the Egyptians and the worshipers of the true God came to be sharply drawn from the fourth plague onward. While swarms of gadflies invaded the homes of the Egyptians, the Israelites in the land of Goshen were not affected. (Ex 8:23.24) The next plague, the pestilence upon the livestock, humiliated such deities as the cow-goddess Hathor, Apis, and the sky goddess Nut, who was conceived of as a cow having the stars affixed to her belly. (Ex 9:1–6) The plague of boils brought disgrace to the gods and goddesses regarded as possessing healing abilities, such as Thoth, Isis, and Ptah. (Ex 9:8–11) The severe hailstorm put to shame the gods who were considered to have control of the natural elements; for example, Reshpu, who, it appears, was believed to control lightning, and Thoth, who was said to have power over the rain and thunder. (Ex9:22–26) The locust plague spelled defeat for the gods thought to ensure a bountiful harvest, one of these being the fertility god Min, who was viewed as a protector of the crops. (Ex 10:12–15) Among the deities disgraced by the plague of darkness were sun-gods, such as Ra and Horus, and also Thoth the god of the moon and believed to be the systematizer of sun, moon, and stars.​— Ex 10:21–23 The death of the firstborn resulted in the greatest humiliation for the Egyptian gods and goddesses. (Ex 12:12) The rulers of Egypt actually styled themselves as gods, the sons of Ra, or Amon-Ra. It was claimed that Ra, or Amon-Ra, had intercourse with the queen. The son born was, therefore, viewed as a god incarnate and was dedicated to Ra, or Amon-Ra, at his temple. Hence, the death of Pharaoh’s firstborn, in effect, actually meant the death of a god. (Ex 12:29) This in itself would have been a severe blow to Egypt’s religion, and the complete impotence of all the deities was manifested in their being unable to save the firstborn of the Egyptians from death.​ Finally, the Pharaoh had enough and he let the Israelites go. According to some estimates, three million people, including Israelites and “a vast mixed company” of non-Israelites and Egyptians, were spared God’s judgment and left Egypt.​— Ex 12:38. Thank you for reading. Please respond in case of further queries. ",
            "date": "Answered July 10, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony - Antonakis Maritis",
                "href": "/profile/Tony-Antonakis-Maritis"
            },
            "answer_text": " Moses does no such thing!! There are 20 accounts covering the hardening of Pharaohs heart, ten Gods doing an 10 Pharaoh did himself, consequently, Mose had nothing to do with the actual release. “And I have said, I will bring you up out of the affliction of Egypt unto the land of the Canaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and the Jebusites, unto a land flowing with milk and honey. And they shall hearken to thy voice: and thou shalt come, thou and the elders of Israel, unto the king of Egypt, and ye shall say unto him, The Lord God of the Hebrews hath met with us: and now let us go, we beseech thee, three days' journey into the wilderness, that we may sacrifice to the Lord our God. And I am sure that the king of Egypt will not let you go, no, not by a mighty hand. And I will stretch out my hand, and smite Egypt with all my wonders which I will do in the midst thereof: and after that he will let you go. And I will give this people favour in the sight of the Egyptians: and it shall come to pass, that, when ye go, ye shall not go empty.” Exodus 3:17-21 “And I will harden Pharaoh's heart, and multiply my signs and my wonders in the land of Egypt. But Pharaoh shall not hearken unto you, that I may lay my hand upon Egypt, and bring forth mine armies, and my people the children of Israel, out of the land of Egypt by great judgments.” Exodus 7:3-4 “And the Lord said unto Moses, Pharaoh shall not hearken unto you; that my wonders may be multiplied in the land of Egypt. And Moses and Aaron did all these wonders before Pharaoh: and the Lordhardened Pharaoh's heart, so that he would not let the children of Israel go out of his land.” Exodus 11:9–10 It seems unjust for God to harden Pharaoh’s heart and then to punish Pharaoh and Egypt for what Pharaoh decided when his heart was hardened. Why would God harden Pharaoh’s heart just so He could judge Egypt more severely with additional plagues? First, Pharaoh was not an innocent or godly man. He was a brutal dictator overseeing the terrible abuse and oppression of the Israelites, who likely numbered over 2.0 million people at that time. The Egyptian pharaohs had enslaved the Israelites for 400 years. A previous pharaoh—ordered that male Israelite babies be killed at birth. “And the king of Egypt spake to the Hebrew midwives, of which the name of the one was Shiphrah, and the name of the other Puah: And he said, When ye do the office of a midwife to the Hebrew women, and see them upon the stools; if it be a son, then ye shall kill him: but if it be a daughter, then she shall live.” Exodus 1:15-16 The pharaoh (Tutmose II) God hardened was an evil man, and the nation he ruled agreed with, or at least did not oppose, his evil actions. Second, on least a couple occasions, Pharaoh hardened his own heart against letting the Israelites go: “But when Pharaoh saw that there was respite, he hardened his heart, and hearkened not unto them; as the Lord had said.” Exodus 8:15 “And Pharaoh hardened his heart at this time also, neither would he let the people go.” Exodus 8:32 God and Pharaoh were both active in one way or another in the hardening of Pharaoh’s heart. As the plagues continued, God gave Pharaoh increasingly severe warnings of the final judgment to come. Pharaoh chose to bring further judgment on himself and his nation by hardening his own heart against God’s commands. As a result of Pharaoh’s hard-heartedness, God hardened Pharaoh’s heart even further, allowing for the last few plagues and bringing God’s full glory into view (Exodus 9:12; 10:20, 27). Pharaoh and Egypt had brought these judgments on themselves with 400 years of slavery and mass murder. Since the wages of sin is death (Romans 6:23), and Pharaoh and Egypt had horribly sinned against God, it would have been just if God had completely annihilated Egypt. Therefore, God’s hardening Pharaoh’s heart was not unjust, and His bringing additional plagues against Egypt was not unjust. The plagues, as terrible as they were, actually demonstrate God’s mercy in not completely destroying Egypt, which would have been a perfectly just penalty. “For the scripture saith unto Pharaoh, Even for this same purpose have I raised thee up, that I might shew my power in thee, and that my name might be declared throughout all the earth. Therefore hath he mercy on whom he will have mercy, and whom he will he hardeneth.” Romans 9:17-18 ",
            "date": "Answered July 15, 2020",
            "views": "145",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Peter Foster",
                    "user_href": "/profile/Peter-Foster-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amos Sykes",
                "href": "/profile/Amos-Sykes"
            },
            "answer_text": "Moses was an instrument of God sent back to Egypt after a forty year absence. He went to get Israel freed from bondage/slavery. Moses asked the Pharaoh to release Israel. The Pharaoh refused to release his property/slaves. Moses used the power of God ten times on the Pharaoh with each power getting more severe against Egypt and the Pharaoh. The final power of God was the death of all first born male children and first born male animals in the land of Egypt. It happened by the power of God through a death angel. Pharaoh let them go. ",
            "date": "Answered July 10, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sandy Sommers",
                "href": "/profile/Sandy-Sommers-3"
            },
            "answer_text": "In the mythical story, Moses did not convince pharaoh to release the Jews. The evil god forced pharaoh through a series of plagues. Then the whole bunch wandered around lost for decades, according to the fictional story. ",
            "date": "Answered July 10, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter Foster",
                    "user_href": "/profile/Peter-Foster-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Jeffery",
                "href": "/profile/Larry-Jeffery"
            },
            "answer_text": "The story goes that the powerful but loving god murdered the eldest Egyptian son in every family. Now these innocent boys didnt have to die a powerful god could as just as easily changed Pharaohs mind, Herod picks up the same idea when Jesus is born all evidence the Bible is folk tales. As we know Exodus never happened either. ",
            "date": "Answered July 10, 2020",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Hirst",
                "href": "/profile/Chris-Hirst-21"
            },
            "answer_text": "Moses never existed and the ‘Israelites’ were never in ‘captivity’ in Egypt. Therefore it never actually happened. It is ‘historical fiction’, a story that uses some known aspects of reality in order to give the narrative more credibility. ",
            "date": "Answered July 10, 2020",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Raj",
                    "user_href": "/profile/Paul-Raj-442"
                },
                {
                    "user_id": "Evangeline Anthuvan",
                    "user_href": "/profile/Evangeline-Anthuvan"
                },
                {
                    "user_id": "Evangeline Janita",
                    "user_href": "/profile/Evangeline-Janita"
                },
                {
                    "user_id": "David Conklin",
                    "user_href": "/profile/David-Conklin-41"
                },
                {
                    "user_id": "Rae Stoddart",
                    "user_href": "/profile/Rae-Stoddart-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charisma Israeline",
                "href": "/profile/Charisma-Israeline"
            },
            "answer_text": "Though Moses performed many signs and wonders, the Lord hardened the heart of Pharoah. It was after the death of the firstborn of the Egyptians, that Pharoah allowed the Israelites to go to worship their Lord God. But soon Pharoah changed his mind and it was when the Red sea was parted and Pharoah's chariots & horsemen were drowned. It was truly the Work of YHWH. Moses tried to convince, but the Lord's Will was established to perform all 10 plagues & to redeem Israel. He used Moses as His servant man & a leader of Israel. ",
            "date": "Answered July 10, 2020",
            "views": "78",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Hines",
                "href": "/profile/Chris-Hines-88"
            },
            "answer_text": "God finally made Pharaoh an offer he couldn't refuse - every first born child of the Egyptians died as a final warning before he would let the children of Israel go. God had planned this to also teach the Egyptians something that would ultimately help their character in the long run. We cannot enter into the family of God until our character and nature is that of Christ, and everything we learn from life can help us with this task. ",
            "date": "Answered July 13, 2020",
            "views": "10",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Clark Lindsay",
                "href": "/profile/Clark-Lindsay-2"
            },
            "answer_text": "Mosers really didn’t convince Pharaoh God did by sending A Series of plagues and relation of Egypt. This culminated in the death of the firstborn at which time the Israelites were thrust out of Egypt. ",
            "date": "Answered July 17, 2020",
            "views": "5",
            "upvotes": " Answer requested by Roksana Parvin Yasmin"
        },
        {
            "author_info": {
                "name": "Jonathan Gerard",
                "href": "/profile/Jonathan-Gerard"
            },
            "answer_text": "He failed for 9 times. Only when he shows Pharaoh (who claims divinity) that God (who controls life and death) is superior to Pharaoh, does the Egyptian leader assent to Moses’ request to Let his people go (into the wilderness for a celebration of their spring holiday). ",
            "date": "Answered July 30, 2020",
            "views": "5",
            "upvotes": " Answer requested by Roksana Parvin Yasmin"
        },
        {
            "author_info": {
                "name": "Terri King",
                "href": "/profile/Terri-King-50"
            },
            "answer_text": "By means of the plagues Pharaoh’s heart was hardened until the final plague which was the death of the first born (Exodus 11:1–10) then he released the Israelites. ",
            "date": "Answered July 16, 2020",
            "views": "3",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Delaney",
                "href": "/profile/Michael-Delaney-163"
            },
            "answer_text": "All the answers you have received have been good to understand how Pharaoh was obstinate but the tenth plague hit him personally the loss of his first born son and all the Egyptian families. Jehovah knew this when he told Moses to prepare his people to be ready to leave before Pharaoh would regret his decision. ",
            "date": "Answered July 11, 2020",
            "views": "9",
            "upvotes": " Answer requested by Roksana Parvin Yasmin"
        },
        {
            "author_info": {
                "name": "Lucha Tijuanera",
                "href": "/profile/Lucha-Tijuanera"
            },
            "answer_text": "How does Moses convince Pharaoh to release the Israelites? Moses just spoke for God, God warned and killed every firstborn of the Egyptians. ",
            "date": "Answered July 10, 2020",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hersh Starck",
                "href": "/profile/Hersh-Starck"
            },
            "answer_text": "Moses let G-d do the convincing. ",
            "date": "Answered July 31, 2020",
            "views": "6",
            "upvotes": " Answer requested by Roksana Parvin Yasmin"
        }
    ]
}