{
    "title": "How common were medieval archers? - Quora",
    "tags": [
        "Archery",
        "Middle Ages (era)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marcell Rába",
                "href": "/profile/Marcell-Rába"
            },
            "answer_text": "Not that common, archery takes a lot of training of strength to be able to shoot bows powerful enough that they have a place on a battlefield. Note that arxhery was much more common in ancient times but by the high medieval period we see armour technology making all but the most powerful bows redundant, by the time of plate armour bows were completely redundant save for specific circumstances (shooting point blank volleys for a long time from the back/sides). Only England could amass so many archers that it was considered being worth it. Most countries used crossbows as it takes less training (a week or 2) compared to the years that it takes an archer. In Eastern Europe it was the warrior elite who trained with bows and did horse archery up until around the mid-13th century. BTW the Golden Horde was mainly in Eastern Europe archery there remained popular. In China crossows largely took over bows by the start of the European middle ages. In the Middle East during and after the crusades crossbows became very popular. To put a point at the end of it I shall mention that, yes bows shoot farther and have better rate of fire but it doesn’t outweigh the fact that crossbows do not require too much strength and are way more accurate in their shooting range, also 800 lbs crossbows are around 20% more powerful than any bow that can be used by an avarage archers. And crossbows can go over 1200 lbs in drawweight. But it still doesn’t mean a lot since good quality medieval armour was able to stop even the mightiest crossbows. But not everyone was using good quality equipment. ",
            "date": "Answered November 26, 2016",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benjamin Jillali",
                    "user_href": "/profile/Benjamin-Jillali"
                },
                {
                    "user_id": "Daniel Aldridge",
                    "user_href": "/profile/Daniel-Aldridge-8"
                },
                {
                    "user_id": "Julian Eddie Frias",
                    "user_href": "/profile/Julian-Eddie-Frias"
                },
                {
                    "user_id": "Daan Kuhlemaijer",
                    "user_href": "/profile/Daan-Kuhlemaijer"
                },
                {
                    "user_id": "Alisdair Gaston",
                    "user_href": "/profile/Alisdair-Gaston"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Roberts",
                "href": "/profile/Andrew-Roberts-11"
            },
            "answer_text": "Depends were you are, as every able bodied male in the World's largest land empire (Mongolian), and a fair proportion of the females, were archers. There were often a million archers riding at a target army or town. On a far smaller scale every able bodied male, apart from the clergy, were required to practice archery each Sunday in England and Wales, from the 14th century to supposedly 1998, on threat of a fine for anyone failing to produce and loose at least half a dozen twigs, at a butt. Though the punishment was suspended under Oliver Cromwell, and again in the 1830’s. So the majority of males in the World's two largest empires were nominally archers. The lesser peoples only had a smattering, or opted for the expensive and slower, but point and shoot crossbow. See: Mongol military tactics and organization - Wikipedia ",
            "date": "Answered November 26, 2016",
            "views": "942",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phidippus",
                    "user_href": "/profile/Phidippus"
                },
                {
                    "user_id": "Dustin Grenko",
                    "user_href": "/profile/Dustin-Grenko"
                }
            ]
        }
    ]
}