{
    "title": "How long would a tyrannosaurus rex survive after being teleported to the present? - Quora",
    "tags": [
        "Tyrannosaurus Rex",
        "Dinosaurs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allen Jones",
                "href": "/profile/Allen-Jones-174"
            },
            "answer_text": "They lived right where I live now, a skull was found just 3 miles from here, but it was a vast inland saltwater sea and marshes then (the Northern Plains). So it would depend where you time traveled AND teleported the T Rex to. It’d need to have firm enough footing for his weight yet enough plant foliage to keep lots of tasty herbivores around him. So a cattle, sheep, or bison ranch would be the most straightforward in the American West, Argentina, New Zealand, Australia, Hawaii, Florida, or Indonesia. The 1969 film about this, “Valley of the Gwangi” has a lot of useful tips on how to do this other than the oddness of a thousand pound horse and 400 lb. test lariat rope somehow managing a many ton T-Rex…oh that’s right it was several horses, yeah that’d work…. Living on livestock, I’d assume several cattle per day, would get very costly (sheep are pretty cheap though…) and not even a bison ranch builds fencing that would deter a T-Rex. Maybe review “King Kong” films for fence ideas since Kong deals with T-Rex’s on Skull Island too so clearly there’s been a learning curve by the natives on that topic. Texas ranches plagued by 3 million wild hogs would be a good fit too as dryland ranches are routinely tens of thousands of contiguous acres while the hogs might be too small and quick for the T Rex’s arms and neck muscles to succeed with. Africa would have the widest wildlife buffet, hippos and Cape Buffalo would be particularly satisfying. On the other hand a rhino, especially a rhino herd, would probably be a fatal encounter for the T Rex, getting disemboweled by that huge horn. On many college campuses savvy faculty could keep it there, dining on students wandering across the quad oblivious to anything but their smart phone screens and easy to list as “dropped out, reason unknown” while campus’s avoidance of “negative information” would probably let it continue for years. If you were doing a dark comedy, this would fit well along the lines of “Little Shop of Horrors”. ",
            "date": "Answered November 14, 2016",
            "views": "492",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Sauve",
                    "user_href": "/profile/Aaron-Sauve"
                },
                {
                    "user_id": "Johnny Yelnats",
                    "user_href": "/profile/Johnny-Yelnats"
                },
                {
                    "user_id": "Eric Samuel Olson",
                    "user_href": "/profile/Eric-Samuel-Olson"
                },
                {
                    "user_id": "Ellen Hasselmann",
                    "user_href": "/profile/Ellen-Hasselmann"
                },
                {
                    "user_id": "Enrique Perez Jaimes",
                    "user_href": "/profile/Enrique-Perez-Jaimes"
                },
                {
                    "user_id": "Lo Sang",
                    "user_href": "/profile/Lo-Sang"
                },
                {
                    "user_id": "Gordon Wentworth Brown",
                    "user_href": "/profile/Gordon-Wentworth-Brown"
                },
                {
                    "user_id": "Fredrick Wheatley",
                    "user_href": "/profile/Fredrick-Wheatley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacob Barnes",
                "href": "/profile/Jacob-Barnes-24"
            },
            "answer_text": "As entertaining as Al’s answer is, as long as it would take to succumb to one of our modern bacterial or viral infections to which it would have no immunity. Provided it wasn’t put down by the first armed humans it encountered (which wouldn’t take as much as TV would lead you to believe) or mortally injured by a semi or a train. ",
            "date": "Answered November 14, 2016",
            "views": "411",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johnny Yelnats",
                    "user_href": "/profile/Johnny-Yelnats"
                },
                {
                    "user_id": "Ellen Hasselmann",
                    "user_href": "/profile/Ellen-Hasselmann"
                },
                {
                    "user_id": "David M. Prus",
                    "user_href": "/profile/David-M-Prus"
                },
                {
                    "user_id": "Heather Corey",
                    "user_href": "/profile/Heather-Corey-2"
                },
                {
                    "user_id": "Apurv Kanth",
                    "user_href": "/profile/Apurv-Kanth"
                },
                {
                    "user_id": "Lo Sang",
                    "user_href": "/profile/Lo-Sang"
                },
                {
                    "user_id": "Enrique Perez Jaimes",
                    "user_href": "/profile/Enrique-Perez-Jaimes"
                },
                {
                    "user_id": "Gordon Wentworth Brown",
                    "user_href": "/profile/Gordon-Wentworth-Brown"
                }
            ]
        }
    ]
}