{
    "title": "How was the black plague spread from person to person? - Quora",
    "tags": [
        "Plagues",
        "Bubonic Plague",
        "Epidemiology",
        "Infectious Diseases",
        "World History",
        "Medical Conditions and Diseases",
        "History",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Predrag Maksimovich",
                "href": "/profile/Predrag-Maksimovich"
            },
            "answer_text": "How was the black plague spread from person to person? The disease called black death or plague or pestis is caused by a bacterium called Pasteurella pestis after famous scientist Louis Pasteur.It lives in fleas which in turn live on a particular rat. Rats also can get sick and die and before that they go out of hiding and start moving around in a funny way. People used to notice that rat’s play and understood that the plague is coming.Fleas jump to humans and infect them. Thereafter disease can follow one of several clinical pictures. Bubonic with large black lymph nodes (hence the name black death!), pulmonary with coughing of blood and secretions and septicaemic where the bacteria multiply in the blood. All three forms can evolve or exist in the same time. Secretions from perforated buboes, expectorated sputum and various body secretions are all infectious and people get infected (and not just by fleas). ",
            "date": "Answered April 19, 2019",
            "views": "587",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michel Vandevoorde",
                    "user_href": "/profile/Michel-Vandevoorde"
                },
                {
                    "user_id": "Veronique Helmridge-Marsillian",
                    "user_href": "/profile/Veronique-Helmridge-Marsillian"
                },
                {
                    "user_id": "Doug Freyburger",
                    "user_href": "/profile/Doug-Freyburger"
                },
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                },
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                },
                {
                    "user_id": "Mark Clemons",
                    "user_href": "/profile/Mark-Clemons-3"
                },
                {
                    "user_id": "Liang-Hai Sie",
                    "user_href": "/profile/Liang-Hai-Sie"
                },
                {
                    "user_id": "Jeffrey Dixon",
                    "user_href": "/profile/Jeffrey-Dixon-21"
                },
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-235"
                },
                {
                    "user_id": "Edward Leahy",
                    "user_href": "/profile/Edward-Leahy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Gutbrod",
                "href": "/profile/Rick-Gutbrod"
            },
            "answer_text": "Originally it was spread by the fleas that the rats carried. As we know today, the world of that time didn’t have a very hygienic practices, and as the conquering hordes in the east came west, the rats and fleas followed. So the early carriers traveled the trades routes. The plague can change forms. From bites by fleas, to a pneumonic form[1] in which the breath of the sick person carries it to the next human. So similar to the current measles outbreak, that if an ill person passes through an area, the infectious agent hangs on for hours. Footnotes[1] Pneumonic plague - Wikipedia",
            "date": "Answered April 22, 2019",
            "views": "141",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aaron Anthony",
                    "user_href": "/profile/Aaron-Anthony-18"
                }
            ]
        }
    ]
}