{
    "title": "How does Urban Outfitters justify the high cost of its clothing? - Quora",
    "tags": [
        "Urban Outfitters (retail brand)",
        "Costs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julia Reece",
                "href": "/profile/Julia-Reece-2"
            },
            "answer_text": " Urban Outfitters charges a lot of money for its clothing because the company is in decline and they need to charge more just to survive at this point. From BusinessInsider.com —  These Bleulab Reversible Zebra Print Detour Skinny Jeans retail for $265. The other side is a subtle, solid purple.  Here's an Alkemie Snake Triple-Wrap leather bracelet. It's $200. That serpent's head is not gold, it's mixed-metal. Urban Outfitters has had a rough couple of years. Once the go-to spot for the young and hip, the chain has faced declining sales in recent years. The company's former CEO even said last year that the products were not good enough to attract customers. On top of that, it's overpriced, according to Eric Beder at Brean Murray Carret & Co. Beder writes that the chain's pricey clothes are driving away the teen customers they're so desperate to attract. And from the Huffington Post — 5 Reasons Why Urban Outfitters Is Disgusting With over 170 locations on Earth and $774 million in revenue, Urban Outfitters has become a popular store among those wanting to express a hip, edgy lifestyle. Ok, so they have Reservoir Dogs shirts, Sunn O))) and Sleep on vinyl — and a Bill Murray coloring book. But Urban Outfitters still sucks and here’s [the number one reason] why: 1. Overpriced. While roaming around one of their stores, I came across an accessory that was, to put it in the most clear and simple terms, a bandana tied into the form of a headband. I don’t believe this was some rare form of bandana or was sweated into by Grimes, but it cost $12. That’s like taking a Post-It, wrapping it around your finger like a ring and calling it jewelry. And then charging $12 for it. In the famous words of Jack Handey, “Forgive me, but that’s just too much.” Urban Outfitters justifies their pricing because they believe they are catering to a niche audience of young, hip people. This hardly justifies the prices I see online on their website and people who write about fashion evidently agree. ",
            "date": "Answered March 18, 2018",
            "views": "245",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sofiya Jaramillo",
                    "user_href": "/profile/Sofiya-Jaramillo"
                },
                {
                    "user_id": "Lucie Budge",
                    "user_href": "/profile/Lucie-Budge-1"
                },
                {
                    "user_id": "Mary Walsh",
                    "user_href": "/profile/Mary-Walsh-166"
                },
                {
                    "user_id": "Madeline Cooper",
                    "user_href": "/profile/Madeline-Cooper-23"
                },
                {
                    "user_id": "Hited Yukus",
                    "user_href": "/profile/Hited-Yukus"
                },
                {
                    "user_id": "Juliana Navia",
                    "user_href": "/profile/Juliana-Navia"
                },
                {
                    "user_id": "Makayla Hixon",
                    "user_href": "/profile/Makayla-Hixon"
                },
                {
                    "user_id": "Ivy Fox",
                    "user_href": "/profile/Ivy-Fox-10"
                },
                {
                    "user_id": "Rey Porrett",
                    "user_href": "/profile/Rey-Porrett"
                },
                {
                    "user_id": "Marlene Oliveira",
                    "user_href": "/profile/Marlene-Oliveira-3"
                },
                {
                    "user_id": "Razvan Baba",
                    "user_href": "/profile/Razvan-Baba"
                },
                {
                    "user_id": "Diana Pl'",
                    "user_href": "/profile/Diana-Pl-2"
                },
                {
                    "user_id": "Tayoh Dey",
                    "user_href": "/profile/Tayoh-Dey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Garrison",
                "href": "/profile/Adam-Garrison-1"
            },
            "answer_text": "How does Urban Outfitters justify the high cost of its clothing? It’s a little thing called “what the market will allow”. If people are willing to pay the price they’re charging, then the price is justified. Unfortunately for Urban Outfitters, people aren’t willing to pay their high prices (quite possibly because the quality of their products is going down), so they’re losing business. They now have to choose between lowering their prices to try to reclaim their lost customer base, or they keep their prices high until they drive away all of their customers entirely. The first option gives them at least a chance of survival. The second option guarantees that they will go out of business. ",
            "date": "Answered June 14, 2020",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tate Van Patten",
                    "user_href": "/profile/Tate-Van-Patten"
                },
                {
                    "user_id": "Sofiya Jaramillo",
                    "user_href": "/profile/Sofiya-Jaramillo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Barrick",
                "href": "/profile/Adam-Barrick-2"
            },
            "answer_text": "The same way most high-end stores do. If it was accessible to everyone, it would lose prestige and the “exclusive” and “cool” factor, and no one would want to shop there. They also carry a lot of branded collections that set their own MSRP like Champion, I.am.Gia, Adidas, Calvin Klein, etc…. Contrary to the other answer (featuring an article from 7 years ago that is no longer correct), the prices are not reflective of the business’ profits. ",
            "date": "Answered July 22, 2019",
            "views": "33",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Cohen",
                    "user_href": "/profile/Jennifer-Cohen-76"
                },
                {
                    "user_id": "Michela Gerardin",
                    "user_href": "/profile/Michela-Gerardin"
                }
            ]
        }
    ]
}