{
    "title": "How will the internet change over the years? - Quora",
    "tags": [
        "Future of the Internet",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Bronson",
                "href": "/profile/James-Bronson-4"
            },
            "answer_text": "Actually it depends on where you are located. Interestingly Korea, Japan and even Vietnam have better systems than we do. Why? In part because in the US we already had most houses wired for power and telephone with old copper wires. And in urban and suburban areas cable for television. So we used those older wired systems for DSL and Cable. Newer hoods sometimes get fiber but most new installs still use copper. Or worce yet aluminum cables. Tbe other countries decided to have phones internet and cable so they put everything on fiber for all installs as there was not already a connection. For several reasons they pay a fraction of what we pay for these services. I read where in the USA the cost to connect each house was on average $842. In other countries it was as low as $22 . I have seen the hardware at the houses. A fiber from the suppliers connects to a box about the size of a pack of smokes or deck of playing cards. That little box has an RJ 11 , RJ45 and F connectors and of course the fiber going to the supplier. It's simple. It's fast and it's cheap. They pay about $14 per month for phone internet and cable TV. The net at speeds faster than most have in the US. Also in the 90s a tax was added by Always gore to the phone lines. That was supposed to help cover the cost of folks living in the countryside to be able to get a connection at the same price we all pay. But it never happened. The tax is still there. But not all homes are connected that want to be as was promist when the tax was added. We still pay the tax though. So I do not know what happens next. As long as politicians are involved it could keep us in last place or close to it in performance and close to the bigest cost. My point. We have and have had the technology for many years. But only other countries use the better technology. Jim ",
            "date": "Answered December 23, 2016",
            "views": "527",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gísli Magnússon",
                    "user_href": "/profile/Gísli-Magnússon-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "René Chiquete",
                "href": "/profile/René-Chiquete"
            },
            "answer_text": "After witnessing (consciously) how the internet has been changing for the last 15 years, these are my predictions: Criminalization of activities in the grey zone (at least the ones that prevent earnings on governments).Wider use of online currencies and much more control over them by the big brother.Entertainers will have a harder time making money purely out of internet due to the incredibly high competition.Higher demand of on-cloud services.Better looking, more inmersive, sites, quite possibly related to techs like VR and higher resolutions being available.Supported Video and Audio streaming services of double/quadruple quality (if we are thinking on short or mid term).Much more current ‘TV’ content shifted to be done online only.",
            "date": "Answered December 21, 2016",
            "views": "223",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Helge Kåre Fauskanger",
                    "user_href": "/profile/Helge-Kåre-Fauskanger"
                },
                {
                    "user_id": "Stan Harris",
                    "user_href": "/profile/Stan-Harris-3"
                }
            ]
        }
    ]
}