{
    "title": "How responsible was Louis XVI for the French revolution? - Quora",
    "tags": [
        "Louis XVI (historical figure)",
        "French Revolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Vanderhaeghe",
                "href": "/profile/Thomas-Vanderhaeghe"
            },
            "answer_text": "He is the sole responsible since he truly had absolute power. Because he was above criticism (the whole system eliminated all but the sycophants around him) he was hopelessly out of touch with the reality of his people and very little was invested in it. He lived in a bubble in Versailles and was at heart spoiled to the bone, lazy, lacked even the most basic insight in the thinking of the time and rigorously demanded praise and obedience around him using a ridiculously strict method of selection of those he wanted to see and hear based upon title entertainment value and capability of flattering him using esprit or a pseudo intelligent wit. Gossip told people about his life and that of the nobility in France. The royals were mocked and disliked and especially the queen was the victim of social media of the time hate campaign. Hatred brewed as people were hungry and nothing was done about it. He made very stupid mistakes that directly provoked an uprising. He got France deep into debt to help the American colonists and somehow managed to learn nothing from their ideals. For him it was about revenge for the seven years war. He neglected investment in infrastructure and manufacturing limping behind at the early dawn of industrialization still relying on the divine right as a justification for his power. People in France didn't buy it anymore and wanted the whole charade to end and to have equal rights in America. When he was asked to end feudality and introduce a construction he h presented a bill and demanded it to be paid or else and refused a constitution. After causing public outrage but without arresting the most likely leaders of an uprising and setting them free in the city while taking ridiculously long to gather troops which by the way was the most provocative thing he could do. All he had to do was sign a constitution and he would have lived a long healthy life instead he managed to provoke his people up to a point they removed him from power and took out the only one he favored the nobility as well. ",
            "date": "Answered May 19, 2018",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lucy O'Reilly",
                    "user_href": "/profile/Lucy-OReilly-9"
                },
                {
                    "user_id": "Cool Destroyer",
                    "user_href": "/profile/Cool-Destroyer"
                },
                {
                    "user_id": "Fernando Martinez Arauxo",
                    "user_href": "/profile/Fernando-Martinez-Arauxo"
                },
                {
                    "user_id": "Innocent Chitambira",
                    "user_href": "/profile/Innocent-Chitambira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefan Hill",
                "href": "/profile/Stefan-Hill-1"
            },
            "answer_text": "Totaly —-/ What he did/—- France was looking for leadership. He was a king. He had enourmous prestige. He was supposed to be a leader, but he was not. He could have taken up the leadership and solved the problem of France. Instead, he did nothing. He did not make an alliance with any of the fractions. He did not give the any direction to the Estates General. He took no initiative. He acted as an idiot in the words original meaning. A major crises and an idiot king, a recipe for disaster. S  Lous XVI. He does not look bright. —-/ What could he have done/—- Look at his contemporary Gustav III of Sweden. He was born to be a king but with absolutely no power. All political power in Sweden was in the hand of the Riksdag (the Parlament)  Gustav III Gustav was determined to rule as a king and to solve the same kind of problems that France had. Gustav III actually made revolution twice. The first revolution was in 1772. An ordinary military coup which succeded. The revolutionaries had a white scarf tied to their arm. After the revolution this became compulsory for all Swedish men. A sign of solidarity with the royal revolution that reestablished a shared rule between king and parlament.  The king with the white scarf Than in 1789 the king made a second revolution. This time to rule alone as an autocrate. To accompish this he made an allience with the farmers (one of the four estates). The king would be autocratic and the nobilities would lose their priviliges. To abolish the priviliges of an estate the decision had to be approved by the estate itself. The king accomplished this in a most vigorous way. The king forced himself into the nobilities estates session of the parlament declaring that he, as a king, was a nobleman and had the right to be present at the meeting of the parlament (he had not, it was a crime for him to enter the session). Than when the meeting started he said that he as the most senior nobleman so he should be chairman from the meeting. He than declared that all the votings was in favour of his own proposals to reduce the priviligies of the nobility. Why did the noblemen accept this? Mayby because the parlament was surronded by a militia of commoners who were strictly pro-king and anti nobility. The votings toke place with the background noice of the angry militia. Could a more vigorous king of France have done the same thing in France? Possible, but then he might have ended his life in the same way as Gustav III  Killed by angry nobelmen. The murder took place at a masquerade. ",
            "date": "Answered November 16, 2016",
            "views": "49",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Li-Hao-Nan-Christopher"
                },
                {
                    "user_id": "Reina Inoue",
                    "user_href": "/profile/Reina-Inoue-2"
                },
                {
                    "user_id": "Arian Rachmat",
                    "user_href": "/profile/Arian-Rachmat"
                },
                {
                    "user_id": "Pontus Rudholm",
                    "user_href": "/profile/Pontus-Rudholm"
                },
                {
                    "user_id": "Eden Shobeiry",
                    "user_href": "/profile/Eden-Shobeiry"
                },
                {
                    "user_id": "Garrett Wayne",
                    "user_href": "/profile/Garrett-Wayne-1"
                },
                {
                    "user_id": "Lyonel Perabo",
                    "user_href": "/profile/Lyonel-Perabo"
                },
                {
                    "user_id": "Hari Iyer",
                    "user_href": "/profile/Hari-Iyer-79"
                },
                {
                    "user_id": "Vicenzo Tsai",
                    "user_href": "/profile/Vicenzo-Tsai"
                },
                {
                    "user_id": "Martin Racz",
                    "user_href": "/profile/Martin-Racz"
                }
            ]
        }
    ]
}