{
    "title": "How severe is racism in the US today? - Quora",
    "tags": [
        "Racism in the United States of America",
        "Race Relations",
        "United States Armed Forces",
        "Racism",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeremy Markeith Thompson",
                "href": "/profile/Jeremy-Markeith-Thompson"
            },
            "answer_text": "I think that racism is definitely a problem in the USA. But I am not going to only provide you with anecdotal evidence. I will first give you something directly from the United Nations. They very recently warned the United States for “alarming racism”. A UN committee charged with tackling racism has issued an “early warning” over conditions in the US and urged the Trump administration to “unequivocally and unconditionally” reject discrimination. Charlottesville: United Nations warns US over 'alarming' racism, UN issues rare warning over 'alarming' racism in USOverall, 58% of Americans say racism is a “big problem in our society,” while 29% say it is “somewhat of a problem.” Just 12% say racism in the U.S. is a small problem or not a problem, according to a new Pew Research Center survey, conducted Aug. 15-21, 2017 among 1,893 adults. Views of racism as a major problem increase sharply, especially among DemocratsI see racism from a very different perspective. Many white Americans will tell me that I am making things up and that it really isn’t that bad. But the truth is that they will never know what I experience or how it affects me. Being Black means that I keep up with statistics and information that affect me. It doesn’t matter that I have a Master in Public Administration and lived and traveled abroad. I am still seen first as a Black man in the USA. Why do I say this? Even though The Economist states Racist behaviour is declining in America, they still admit in the same article: similarly qualified Black job applicants have to apply an average of 15 times to get a job compared to 10 times for their white counterparts.Black Americans are subject to tighter enforcement of dress codes and higher prices in bars.Airbnb requests from guests with distinctively Black names are about 16% less likely to be accepted than identical guests with distinctively white names.But I must state that Blacks and whites see racism in the United States very, very differently. I prefer to look at racism in the USA from other perspectives to inform my knowledge and understanding. To answer your question, please check out these articles. KING: Charlottesville is an ugly reminder racism thrives in 2017 and Charlottesville and the Effort to Downplay Racism in America and In America, bias, hate and racism move from the margins to the mainstream | Al Sharpton Since the election of President Trump, hatred has been going crazy! According to a Quinnipiac Poll, 63% of all voters surveyed believe the level of hatred and prejudice in the U.S. has increased since Trump's election in November. The survey also found that those surveyed believe prejudice against minority groups and Jewish people in the U.S. are serious problems. On the issue of prejudice against minority groups, results from the poll show 77% of those surveyed believe prejudice against minority groups are either a very serious or a somewhat serious problem.Within 10 days of Donald Trump’s election, the Southern Poverty Law Center tracked 900 bias-related incidents against minorities. Post-election spike in hate crimes persists in 2017Poll: Hatred in US on Rise Since President Trump's ElectionHere Are 28 Reported Racist And Violent Incidents After Donald Trump's VictoryHere is a Hate Map so that you can see for yourself where the 917 Hate Groups are currently operating in the USA. Hate Map These stories posted below all happened within the last 30 days. 'Go back to India' — Chicago CEO goes public with racist taunts he receivesRacist Rant On Q Train: 'Get The F**k Out Of My Country'Irvine man faces hate crime charges after yelling slur, throwing coins at two Muslim women, officials sayMinnesota governor denounces mosque bombing as ‘dastardly, cowardly’ hate crime and Analysis | American mosques — and American Muslims — are being targeted for hate like never beforeGeorgia officer who said 'We only kill black people' to retireMapleton Woman Fired After Viral Racist Rant, Community Rally Scheduled in Fargo - KVRR Local NewsBurton family victims of possible hate crime for third time",
            "date": "Updated September 3, 2017",
            "views": "63",
            "upvotes": " View 51 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michaela Quinones",
                    "user_href": "/profile/Michaela-Quinones"
                },
                {
                    "user_id": "Jacob Shelton",
                    "user_href": "/profile/Jacob-Shelton-8"
                },
                {
                    "user_id": "Nan Walker",
                    "user_href": "/profile/Nan-Walker"
                },
                {
                    "user_id": "Bret Vollmer",
                    "user_href": "/profile/Bret-Vollmer"
                },
                {
                    "user_id": "Badru Alagond",
                    "user_href": "/profile/Badru-Alagond"
                },
                {
                    "user_id": "Amer Salah",
                    "user_href": "/profile/Amer-Salah-4"
                },
                {
                    "user_id": "Keeth Eirmet",
                    "user_href": "/profile/Keeth-Eirmet"
                },
                {
                    "user_id": "Ryan Alder",
                    "user_href": "/profile/Ryan-Alder-3"
                },
                {
                    "user_id": "John Matthews",
                    "user_href": "/profile/John-Matthews-497"
                },
                {
                    "user_id": "Ashwini Gurjari",
                    "user_href": "/profile/Ashwini-Gurjari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "Not as bad as our news and Trump would have you think. What’s more a lot of us are horrified by what Trump says about our country. He is proof we still have a problem but we’re not ignoring it, Trump has sparked a debate. The “problem” is America is possibly the most diverse society on Earth with many races, nationalities, and cultures living side by side. Tensions are inevitable and in the case of the black population often serious. But we know that. The US is leading the rest of the world in confronting the issue and we are way out front of most of the globe. I'll address the minority issue since that's where the reality/perception gap seems to be widest. There is a popular perception of the US as a highly racist country when in reality it isn't. That we have a race problem is absolutely and without question true but it's not as bad as the problem is in many, maybe most, other countries. Other countries are more homogeneous so their racism is less obvious. The reality is racism is global. Racism is a human condition. Most countries are fairly homogenous compared to the US so the tensions between the main group and minorities are contained. In the US this is not the case. Media attention within the US of our racist heritage and some highly publicized crimes committed by rogue cops leaves the impression we are out of control. These shootings represent the actions of a very small percentage of police officers. What many observers fail to recognize is this publicity, almost all of which is generated from within our borders by our own News Media, is the result of a powerful desire within this country to overcome these problems. In other words most people are not deeply racist and they want our minorities to be able to stand on an equal footings with our white majority. Our famous PC, or political correctness, is an attempt to challenge discrimination. Trump has brought our racism to the surface and it’s there but there is much greater opportunity for racial tension here than in most countries. We are not unique, we just have a higher profile. Here racism is in our face and we cannot sweep it under the rug. America is still a melting pot with immigrants from all over the world coming here to live. We have a diverse population and a walk down the street or through a Wal Mart makes this obvious. I commonly hear English, Spanish, and Asian languages when I’m out shopping. In the US we are accustomed to living and working beside a lot of different races. I see other races every time I go out because people move here from other countries daily. I generally don't even notice anymore. My acupuncturist is Indian, my herbalist Chinese, my doctor Vietnamese, when I go to the local 7–11 I am served by Chinese clerks. I have hired many Hispanics and blacks in my business. I have worked alongside blacks, Hispanics, El Salvadorians, Europeans, Australians, French, Swiss, Swedes, and Canadians. I have had Chinese, Korean, Black, Indian, Vietnamese, and Hispanic customers. I doubt there are many other countries where someone can say that. I also doubt there are many countries outside of Africa that would elect a Black president. Countries like India and Japan have a far greater problem with racism than the US but don't get the same publicity because they are not addressing the problem to nearly the same extent if indeed they even believe there is a problem. Anti-Arab, anti-Semitism, anti-Roma racism, and neo-Nazism is on the increase in Europe. http://www.euronews.com/2014/05/06/racism-in-europe-at-its-worst-since-the-1980s---claim The African genocides are well publicized and still taking place. http://www.reuters.com/article/us-centralafrica-inquiry-idUSKBN0KH2BM20150108 Japan: https://www.pri.org/stories/2015-05-12/how-japanese-american-burst-japans-bubble-racism Even China, a largely homogeneous country is racist. https://www.chinafile.com/reporting-opinion/media/minority-middle-kingdom-my-experience-being-black-china Mexico: http://www.cnn.com/2012/11/20/opinion/navarrette-mexico-racism/ Canada: http://www.macleans.ca/news/canada/out-of-sight-out-of-mind-2/ The following article goes into the subject in greater depth: http://www.globalissues.org/article/165/racism ",
            "date": "Updated March 23, 2020",
            "views": "2",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Dami",
                    "user_href": "/profile/Aaron-Dami"
                },
                {
                    "user_id": "Marta Stankiewicz",
                    "user_href": "/profile/Marta-Stankiewicz-4"
                },
                {
                    "user_id": "Barry Day",
                    "user_href": "/profile/Barry-Day-7"
                },
                {
                    "user_id": "Roger Henn",
                    "user_href": "/profile/Roger-Henn-3"
                },
                {
                    "user_id": "Nan Walker",
                    "user_href": "/profile/Nan-Walker"
                },
                {
                    "user_id": "Jonathan Lau",
                    "user_href": "/profile/Jonathan-Lau-40"
                },
                {
                    "user_id": "Mark Krause",
                    "user_href": "/profile/Mark-Krause-24"
                },
                {
                    "user_id": "Olivia Paniagua",
                    "user_href": "/profile/Olivia-Paniagua-1"
                },
                {
                    "user_id": "Jonathan Jones",
                    "user_href": "/profile/Jonathan-Jones-824"
                },
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                }
            ]
        }
    ]
}