{
    "title": "How many countries did the Roman Empire conquer? - Quora",
    "tags": [
        "Roman Empire",
        "Ancient Rome",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rui Zhang",
                "href": "/profile/Rui-Zhang-477"
            },
            "answer_text": "The Roman Empire wiped out at least about 50 countries. Including Carthage, Macedonia, Bendu Kingdom, Seleucid Empire, Ptolemy Egypt, Gauls, Germans, Britons, Greek city-states. Let me talk about the territory of the next Roman Empire: Roman Empire: including Europe today: Italy, Vatican, San Marino, Andorra, Malta, Cyprus, Greece, Macedonia, Serbia and Montenegro, Croatia, Slovenia, Albania, Bulgaria, Spain, Portugal, Liechtenstein, Switzerland, Belgium, France, Monaco , The whole of Luxembourg, most of Austria, Bosnia and Herzegovina, Hungary, Germany, Romania, the United Kingdom, the Netherlands, Asia: Lebanon, Syria, Israel, Palestine, Turkey, most of Jordan Africa: across Tunisia, Egypt, Libya, Morocco Ancient Rome usually refers to the civilization that began in the central part of the Italian peninsula in the early 9th century BC. During the Roman period and the Roman Republic, it expanded around the 1st century into a huge Roman empire that spanned Europe, Asia, and Africa. By 395, the Roman Empire was divided into two parts. The Western Roman Empire died in 476. The Eastern Roman Empire (that is, the Byzantine Empire) became a feudal country and was destroyed by the Ottoman Empire in 1453. When Rome was founded, it was still a small country. Since the beginning of the 5th century BC, it has defeated some cities in the Latin League and the neighbors such as the Etruscans, and conquered the indigenous and Greek city-states in the southern part of the Italian peninsula and became a large country in the western Mediterranean. Rome waged three Punic wars, conquering Carthage and making it a province of Rome in the first 146 years. From 215 BC to 168 BC, three Macedonian wars were launched, conquering Macedonia and controlling the entire Greece. And through the Syrian war and diplomatic means, they controlled some parts of West Asia and built a large country that spanned Africa, Europe, and Asia, and dominated the Mediterranean. The economy developed rapidly during this period, but it also intensified social conflicts. From the 1930s to the 1930s, the history called the Civil War era, the Sicilian uprising and the Spartak uprising broke out successively. The struggle between the bankrupt peasants and the big landlords, the struggle between the powerless and the power, and the struggle between the cavaliers and the elders were formed. And during the period from 133 BC to 123 BC, the Gragu Brothers reform took place. In 107 BC, with the support of the Democrats, Gaius Marius was elected as the governor and began to implement military reforms. He promoted a system of recruiting soldiers, which caused a large number of citizens to land into the army. In the first 90 years, in order to fight for the citizenship of Rome, the Italians revolted and historically called the Allied War. In the first 82 years, Cornelius Sulla, supported by the nobility, led the army to occupy Rome. The following year, he forced the Civic Assembly to elect him as a lifelong dictator, setting a precedent for military dictatorship in Roman history. In the first 60 years, Marcus Crassus, Gaius Julius Caesar, and Pompey allied secretly to jointly control the political situation in Rome, known as the top three politics in history. In the first 48 years, Julius Caesar defeated the other two, and was declared a lifelong dictator, integrating military and political power. He pursued reforms, but incurred hatred for political enemies due to dictatorship and was assassinated by noble conspirators on March 15, 44 BC. After Caesar's death, the Roman Civil War started again. In the first 43 years, Anthony, Li Bida, and Octavian openly formed an alliance to obtain the legal power to rule the country for 5 years, known as the last three heads of politics. Then Octavian defeated the other two. In the first 27 years, the Senate gave Octavian the title of \"Augustus\" to establish the politics of the head of state. The republic declared its demise. Rome has since entered the era of the Roman Empire. Roman Empire The political system created by Augustus, known in history as the head system, is actually the imperial system in the name of the Republic. During his reign, he implemented a series of active reforms and promoted economic and social development. And the external expansion made the northern border of the empire reach the Rhine and Danube. After the death of Augustus, his adopted son Tiberius succeeded to the throne and created the succession system of the throne. The period from the first 27 years to 192 years is called the pre-empire period and includes three dynasties: the Claudius dynasty, the Flavi dynasty, and the Anthony dynasty. During this period, society was relatively stable. When the emperor Anthony Trajan (98-117) reigned, the territory of the empire reached its maximum: starting from Spain and Britain in the west, the Euphrates in the east, Egypt and Carthage in the south, the Rhine and the Danube in the north, the Mediterranean became the empire Inland sea. The economy has flourished unprecedentedly. In 192, the last emperor of the Anthony dynasty was killed, and Rome had a chaotic period of nearly a century. Historians referred to the establishment of the Severus dynasty in 193, and the period from 235 to the late imperial period. The social, economic, and military crises that began in the late Anthony dynasty reached an unprecedented scale in the 3rd century AD, so that some historians marked another period of crisis in the third century (193-284). During this period, the war was still frequent, the emperor changed frequently, and the uprisings of slaves and slave farmers spread all over the country. The Bagada movement that started in Gaul in the 1960s posed a great threat to the ruling class. In 284, the Chief of the Guards, Diocletian, was first supported by the army as an emperor, and obtained the imperial power. The head system was changed to the Domina special system (that is, the monarchy), and the form and ceremonies of the Eastern monarch were officially adopted. And implemented many reforms, historically known as Diocletian reform. His successor Constantine I abolished the rule of the four emperors and became the sole monarch in 324, and the imperial power was strengthened. In 330 moved to Byzantium, renamed Constantinople. In 313, the Milan Decree was issued to recognize the legal status of Christianity. After his death, war broke out again. Theodosius I once achieved the reunification of the empire. After the death of Theodosius I in 395, the empire split into two parts, the Eastern Roman Empire and the Western Roman Empire. In the Western Roman Empire, the economy was in constant crisis, population was reduced, fields were barren, and urban and rural depression. In 410, the Visigoths occupied Rome. In 452, Attila the King of the Huns entered Italy. In 455, the Vandals fell into Rome again. Barbarian countries such as the Visigoth Kingdom, Vandal-Aran Kingdom, Burgundy Kingdom, and East Gothic Kingdom have been established successively. In September 476, the Germans invaded, and the mercenary leader Odoyak deposed the last monarch, Romulus Augustus, and the Western Roman Empire declared its demise. The Eastern Roman Empire continued until 1453, when it was destroyed by the Ottoman Empire ",
            "date": "Answered April 29, 2020",
            "views": "34",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ngiea",
                    "user_href": "/profile/Ngiea"
                },
                {
                    "user_id": "Sullivan Ouellette",
                    "user_href": "/profile/Sullivan-Ouellette"
                },
                {
                    "user_id": "Marie Thomas",
                    "user_href": "/profile/Marie-Thomas-79"
                },
                {
                    "user_id": "Shortt Alan",
                    "user_href": "/profile/Shortt-Alan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Tan",
                "href": "/profile/Michael-Tan-71"
            },
            "answer_text": "Here’s the Roman Empire at its greatest extent, in 117AD during the reign of Trajan.  Now, let’s see how that translates with modern-day countries:  This is a slightly different map of the Empire overlayed on modern-day country borders. So let’s see which countries are covered! Starting from Western Europe in the Iberian Peninsula moving towards Asia Minor and then snaking around down the Levant to Africa and finishing up back at Gibraltar and the Iberian, we have, if my geography serves me correctly: PortugalSpainAndorraFranceUnited Kingdom (only England and Wales)BelgiumThe NetherlandsLuxembourgSwitzerlandSmall parts of GermanyLichtensteinItaly (obviously)MonacoSan MarinoVatican CityAustriaHungaryRomaniaUkraine or Russia (Crimea) touchy subjectCroatiaAlbaniaMacedoniaKosovoSerbiaMontenegroBulgariaBosnia and HerzegovinaSloveniaGreeceCyprusMaltaTurkeyArmeniaGeorgiaAzerbaijanSyriaLebanonIsraelJordanIraqKuwaitEgyptLibyaTunisiaAlgeriaMoroccoYour answer is 46 countries, partly or wholly. ",
            "date": "Answered April 1, 2018",
            "views": "268",
            "upvotes": " View 253 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Roderick White",
                    "user_href": "/profile/Roderick-White-6"
                },
                {
                    "user_id": "Samuel Gara",
                    "user_href": "/profile/Samuel-Gara-3"
                },
                {
                    "user_id": "Dhyey Patel",
                    "user_href": "/profile/Dhyey-Patel-107"
                },
                {
                    "user_id": "Eddi Ferry",
                    "user_href": "/profile/Eddi-Ferry"
                },
                {
                    "user_id": "Oliver Zinn",
                    "user_href": "/profile/Oliver-Zinn-1"
                },
                {
                    "user_id": "Shortt Alan",
                    "user_href": "/profile/Shortt-Alan"
                },
                {
                    "user_id": "Kalpesh Manna",
                    "user_href": "/profile/Kalpesh-Manna"
                },
                {
                    "user_id": "Michael Röschter",
                    "user_href": "/profile/Michael-Röschter-1"
                },
                {
                    "user_id": "Lucifr Varii",
                    "user_href": "/profile/Lucifr-Varii"
                },
                {
                    "user_id": "Taka To",
                    "user_href": "/profile/Taka-To-2"
                }
            ]
        }
    ]
}