{
    "title": "How many losses did France suffer during the Hundred Years' War? - Quora",
    "tags": [
        "Hundred Years' War",
        "France",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Haddock",
                "href": "/profile/Steven-Haddock"
            },
            "answer_text": "Back in the day, casualties were far smaller as the forces that opposed each other in battles were puny by modern standards. For example, at the Battle of Agincourt, there were probably no more than 13,000 people involved on both sides. Moreover, at the beginning of the war, casualties were rare. It was difficult to kill a knight so, if the odds were against you, you surrendered, were captured, then were ransomed back.  In a really fierce battle, you might lose a handful of knights and a few hundred unarmoured supporters. Civilians were generally not at risk. However, as the war went on, the troops tended not to be from the nobility, but were instead trained archers and infantrymen. Once the armies started changing, the logistics of taking prisoners became less entrancing and prisoners were killed instead of being ransomed. For example, at Agincourt, there were actually very few casualties from wounds suffered during battle. On the English side, only three of the armoured men were killed (including Henry's brother, the Duke of York) and fewer than 100 archers and infantry were killed. The 5,000 French casualties, largely men-at-arms, were largely those who were literally stuck in the mud and were unable to defend themselves. They probably expected to be marched off for ransom, but instead, the English systematically killed them, usually by running daggers through the holes in the armor.  So despite the fact the war went on for 115-116 years, the total number of actual battle casualties on both sides were probably no more than a few tens of thousands. ",
            "date": "Answered September 13, 2014",
            "views": "44",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Altuğ Mert Mısırlıoğlu",
                    "user_href": "/profile/Altuğ-Mert-Mısırlıoğlu-1"
                },
                {
                    "user_id": "Joel Shibu",
                    "user_href": "/profile/Joel-Shibu-8"
                },
                {
                    "user_id": "Niklas Nolte",
                    "user_href": "/profile/Niklas-Nolte"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Spencer",
                "href": "/profile/Chris-Spencer-120"
            },
            "answer_text": "There is a telling phrase in the Wikipedia article on the Hundred Years’ war - “France lost half its population during the Hundred Years' War.” That isn’t battle casualties - but shows the effect on the overall population - including deaths due to the plague during that period. The English population only dropped by about 25% (mainly due to plague) - so the difference can be reasonably linked to the effects of prolonged warfare (as all of the fighting took place in France. ",
            "date": "Answered April 21, 2018",
            "views": "828",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Altuğ Mert Mısırlıoğlu",
                    "user_href": "/profile/Altuğ-Mert-Mısırlıoğlu-1"
                },
                {
                    "user_id": "Havoc Parker",
                    "user_href": "/profile/Havoc-Parker"
                },
                {
                    "user_id": "Peter Lynch",
                    "user_href": "/profile/Peter-Lynch-74"
                },
                {
                    "user_id": "Steve B",
                    "user_href": "/profile/Steve-B-110"
                }
            ]
        }
    ]
}