{
    "title": "How did the relationship between Mary Boleyn and King Henry VIII affect the relationship between Mary and her sister, Anne? - Quora",
    "tags": [
        "Mary Boleyn",
        "Anne Boleyn (historical figure)",
        "King Henry VIII (historical figure)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lissa Bryan",
                "href": "/profile/Lissa-Bryan"
            },
            "answer_text": "According to writer M.L. Bruce, Mary Boleyn was disliked by her parents because of the shame her affair with Henry brought down on the family. Her sister, Anne, doesn’t seem to have felt that way. When Mary fell into poverty after the death of her husband, Anne appealed to the king to urge Thomas Boleyn to support her. During her reign at court, Anne placed Mary in positions of honor and prominence in her train, indicating there was no ill-feeling between the sisters. After Mary enraged the family again by marrying William Stafford, Anne quietly sent her sister a gold cup and some much-needed funds. Mary Boleyn’s relationship with Henry was very short-lived, and was over by the time she married William Carey in 1520. Though Henry has been often blamed in fiction for breaking up Anne’s romance with Henry Percy in 1522, there is no evidence the king had any romantic interest in Anne at the time. It was Wolsey who’d arranged marriages for both parties to solve some pesky inheritance issues that would be disrupted by the Percy/Boleyn affair, and Wolsey who intervened to crush the budding love match. Anne wasn’t at court for at least a year after that. Henry showed no interest in Anne Boleyn until 1525 at the earliest. (He declared his love for her at Shrovetide in February, 1526.) ",
            "date": "Answered February 7, 2019",
            "views": "377",
            "upvotes": " View 189 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amber Symonds",
                    "user_href": "/profile/Amber-Symonds-1"
                },
                {
                    "user_id": "Malvina Kehle",
                    "user_href": "/profile/Malvina-Kehle"
                },
                {
                    "user_id": "Leanne Joanisse",
                    "user_href": "/profile/Leanne-Joanisse"
                },
                {
                    "user_id": "John Beal",
                    "user_href": "/profile/John-Beal-43"
                },
                {
                    "user_id": "Giovanna Vallerotondo",
                    "user_href": "/profile/Giovanna-Vallerotondo-1"
                },
                {
                    "user_id": "Marnie Bell",
                    "user_href": "/profile/Marnie-Bell"
                },
                {
                    "user_id": "Phyllis Campbell",
                    "user_href": "/profile/Phyllis-Campbell-28"
                },
                {
                    "user_id": "Karen Cecil",
                    "user_href": "/profile/Karen-Cecil-7"
                },
                {
                    "user_id": "Eihlan O’Connor",
                    "user_href": "/profile/Eihlan-O-Connor"
                },
                {
                    "user_id": "Deborah Hymes",
                    "user_href": "/profile/Deborah-Hymes-1"
                },
                {
                    "user_id": "Kathleen Brogan",
                    "user_href": "/profile/Kathleen-Brogan-1"
                },
                {
                    "user_id": "Pamela Greeno Campbell",
                    "user_href": "/profile/Pamela-Greeno-Campbell"
                },
                {
                    "user_id": "Danette Roark",
                    "user_href": "/profile/Danette-Roark"
                },
                {
                    "user_id": "Laura Cavazos",
                    "user_href": "/profile/Laura-Cavazos-5"
                },
                {
                    "user_id": "Jim Suggs",
                    "user_href": "/profile/Jim-Suggs-2"
                },
                {
                    "user_id": "Cambrie Elle Hall",
                    "user_href": "/profile/Cambrie-Elle-Hall"
                },
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Alice Lemos",
                    "user_href": "/profile/Alice-Lemos-1"
                },
                {
                    "user_id": "Suzi Macgregor",
                    "user_href": "/profile/Suzi-Macgregor"
                },
                {
                    "user_id": "Eva Pawlowski",
                    "user_href": "/profile/Eva-Pawlowski"
                },
                {
                    "user_id": "Janet Gerber",
                    "user_href": "/profile/Janet-Gerber-3"
                },
                {
                    "user_id": "Karen",
                    "user_href": "/profile/Karen-1642"
                },
                {
                    "user_id": "Peg Murray",
                    "user_href": "/profile/Peg-Murray"
                },
                {
                    "user_id": "Gisella Camoriano",
                    "user_href": "/profile/Gisella-Camoriano-1"
                },
                {
                    "user_id": "Jodie Robinson",
                    "user_href": "/profile/Jodie-Robinson-2"
                },
                {
                    "user_id": "Linda Laberge",
                    "user_href": "/profile/Linda-Laberge-1"
                },
                {
                    "user_id": "Shirley-Louise Daniels",
                    "user_href": "/profile/Shirley-Louise-Daniels"
                },
                {
                    "user_id": "Marija Vicic",
                    "user_href": "/profile/Marija-Vicic"
                },
                {
                    "user_id": "Marieanne Blount",
                    "user_href": "/profile/Marieanne-Blount"
                },
                {
                    "user_id": "Feifei Wang",
                    "user_href": "/profile/Feifei-Wang-6"
                },
                {
                    "user_id": "Brenda Foubert",
                    "user_href": "/profile/Brenda-Foubert"
                },
                {
                    "user_id": "Sadie Mah",
                    "user_href": "/profile/Sadie-Mah"
                },
                {
                    "user_id": "Else Cederborg",
                    "user_href": "/profile/Else-Cederborg"
                },
                {
                    "user_id": "Dayna Railton",
                    "user_href": "/profile/Dayna-Railton-1"
                },
                {
                    "user_id": "Joelis Alejandro",
                    "user_href": "/profile/Joelis-Alejandro"
                },
                {
                    "user_id": "Candace Dunn-Kosusnik",
                    "user_href": "/profile/Candace-Dunn-Kosusnik"
                },
                {
                    "user_id": "Nancy Seils",
                    "user_href": "/profile/Nancy-Seils"
                },
                {
                    "user_id": "Alicia Heller",
                    "user_href": "/profile/Alicia-Heller-2"
                },
                {
                    "user_id": "Raffael Garcia Marquez",
                    "user_href": "/profile/Raffael-Garcia-Marquez"
                },
                {
                    "user_id": "Mary Choromokos",
                    "user_href": "/profile/Mary-Choromokos"
                },
                {
                    "user_id": "Holly Adams",
                    "user_href": "/profile/Holly-Adams-125"
                },
                {
                    "user_id": "Alfred Jones",
                    "user_href": "/profile/Alfred-Jones-90"
                },
                {
                    "user_id": "Julie Alexander",
                    "user_href": "/profile/Julie-Alexander-91"
                },
                {
                    "user_id": "Heather Straker",
                    "user_href": "/profile/Heather-Straker"
                },
                {
                    "user_id": "Erin Smith",
                    "user_href": "/profile/Erin-Smith-74"
                },
                {
                    "user_id": "Marte McKenna",
                    "user_href": "/profile/Marte-McKenna"
                },
                {
                    "user_id": "Alissa Rogers",
                    "user_href": "/profile/Alissa-Rogers-6"
                },
                {
                    "user_id": "Amber Burrows",
                    "user_href": "/profile/Amber-Burrows-2"
                },
                {
                    "user_id": "Brittney Rahming",
                    "user_href": "/profile/Brittney-Rahming"
                },
                {
                    "user_id": "Christin Cowin",
                    "user_href": "/profile/Christin-Cowin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leslie Colleen Friedrich",
                "href": "/profile/Leslie-Colleen-Friedrich"
            },
            "answer_text": "How did the relationship between Mary Boleyn and King Henry VIII affect the relationship between Mary and her sister, Anne? Portrait of Mary Boleyn  I don’t believe it had any real impact on their relationship. These pictures of the sisters are available on Wikipedia: Anne Boleyn, Marchioness of Pembroke, Queen consort of England  Late Elizabethan portrait, possibly derived from a lost original of 1533–3 [1] We do know their father, Thomas Boleyn 1st Earl of Wiltshire and Ormond (extensive diplomatic career) was very ambitious for both of his daughters in order to increase his power and influence with the King. In fact, the Boleyn family had considerable influence for some time before their fall from grace. To this end, both Mary and Anne spent time in the French royal court where their father served as Henry VIII’s ambassador. There was power and influence to gain whether your daughter was a mistress or wife of a king. The French king at the time, Francis I, was said to call Mary his “English mare”. Women of the day knew and understood these arrangements; they accepted them as the customs of their day. They had no choice but to deal with them. Many may have played this game as well as, or better than, their fathers. When the girls returned to England, Henry VIII first took Mary as his mistress and had one or more illegitimate children with her that he did not acknowledge. Perhaps this is the reason Anne resisted Henry VIII’s advances and refused to become his mistress; she insisted on marriage instead. She artfully refused his sexual advances. It drove him crazy, and it worked. I think the sisters remained close, for the most part, regardless of their relationships with King Henry VIII. It was Mary’s 2nd marriage without permission to a soldier beneath her station that caused her problems with her sister, Queen Anne, and her husband, Henry VIII. Here are some references from Mary Boleyn - Wikipedia regarding the sisters: Mary was one of the mistresses of Henry VIII for an unknown period of time. It has been rumoured that she bore two of the king's children, though Henry did not acknowledge either of them as he had acknowledged Henry FitzRoy, his son by another mistress, Elizabeth Blount. Mary was also rumoured to have been a mistress of Henry VIII's rival, King Francis I of France, for some period between 1515 and 1519. [2]Mary Boleyn was married twice: in 1520 to William Carey, and again, secretly, in 1534, to William Stafford, a soldier from a good family but with few prospects. This secret marriage to a man considered beneath her station angered both King Henry VIII and her sister, Queen Anne, and resulted in Mary's banishment from the royal court. She died seven years later, having spent the remainder of her life in obscurity.Although Mary was said to have been more attractive than her sister, Anne seems to have been more ambitious and intelligent. When the king took an interest in Anne, she refused to become his mistress, being shrewd enough not to give in to his sexual advances and returning his gifts. [15] By the middle of 1527, Henry was determined to marry her. This gave him further incentive to seek the annulment of his marriage to Catherine of AragonMary remained in England for most of her childhood, until she was sent abroad in 1514 around the age of fifteen when her father secured her a place as maid-of-honour to the King's sister, Princess Mary, who was going to Paris to marry King Louis XII of France.Mary was joined in Paris by her father, Sir Thomas, and her sister, Anne, who had been studying in France for the previous year. During this time Mary is supposed to have embarked on several affairs, including one with King Francis himself. Although some historians believe that the reports of her sexual affairs are exaggerated, the French king referred to her as \"The English Mare\", \"my hackney\", [9] and as \"una grandissima ribalda, infame sopra tutte\" (\"a very great whore, the most infamous of all\").[10] [11] She returned to England in 1519, where she was appointed a maid-of-honour to Catherine of Aragon, the queen consort of Henry VIII. [12]A year later, when Mary's (1st) husband died during an outbreak of sweating sickness, Henry granted Anne Boleyn the wardship of her nephew, Henry Carey. Mary's husband had left her with considerable debts, and Anne arranged for her nephew to be educated at a respectable Cistercian monastery. Anne also interceded to secure her widowed sister an annual pension of £100. [16]In 1532, when Anne accompanied Henry to the English Pale of Calais on his way to a state visit to France, Mary was one of her companions. Anne was crowned queen on 1 June 1533 and on 7 September gave birth to Henry's daughter Elizabeth, who later became Queen Elizabeth I. In 1534, Mary secretly married an Essex landowner's younger son: William Stafford (later Sir William Stafford). Since Stafford was a soldier, his prospects as a second son so slight, and his income so small, many believed the union was a love match. When Mary became pregnant, the marriage was discovered. Queen Anne was furious, and the Boleyn family disowned Mary. The couple were banished from court.Mary's financial circumstances became so desperate that she was reduced to begging the king's adviser Thomas Cromwell to speak to Henry and Anne on her behalf. She admitted that she might have chosen \"a greater man of birth\" but never one that should have loved her so well, nor a more honest man. And she went on, \"I had rather beg my bread with him than to be the greatest queen in Christendom. And I believe verily ... he would not forsake me to be a king\". Henry, however, seems to have been indifferent to her plight. Mary asked Cromwell to speak to her father, her uncle, and her brother, but to no avail. It was Anne who relented, sending Mary a magnificent golden cup and some money, but still refused to reinstate her position at court. This partial reconciliation was the closest the two sisters attained; it is not thought that they met after Mary's exile from the king's court.Mary's life between 1534 and her sister's execution on 19 May 1536 is difficult to trace. There is no record of her visiting her parents, and no evidence of any correspondence with, or visits to, her sister Anne or her brother George when they were imprisoned in the Tower of London. Like their uncle, Thomas Howard, 3rd Duke of Norfolk, she may have thought it wise to avoid association with her now-disgraced relatives [citation needed]Based on this account of Mary Boleyn’s life, it was not Mary’s relationship with Henry VIII that caused a problem with the sisters. In fact, Mary’s relationship with Henry was used by Anne to her advantage and helped her become Queen. Instead, it was Mary’s secret marriage to William Stafford that enfuriated Anne and caused a rift in their relationship. (Quora A2A) ",
            "date": "Answered February 9, 2019",
            "views": "2",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leanne Joanisse",
                    "user_href": "/profile/Leanne-Joanisse"
                },
                {
                    "user_id": "Dave Crompton",
                    "user_href": "/profile/Dave-Crompton"
                },
                {
                    "user_id": "Carol Hudson",
                    "user_href": "/profile/Carol-Hudson-63"
                },
                {
                    "user_id": "Whitney Bravo",
                    "user_href": "/profile/Whitney-Bravo-1"
                },
                {
                    "user_id": "Alissa Rogers",
                    "user_href": "/profile/Alissa-Rogers-6"
                },
                {
                    "user_id": "Vicki Bartz",
                    "user_href": "/profile/Vicki-Bartz"
                },
                {
                    "user_id": "Kat Mill",
                    "user_href": "/profile/Kat-Mill-2"
                },
                {
                    "user_id": "Faira Ammadea",
                    "user_href": "/profile/Faira-Ammadea"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Lauchlin Divine",
                    "user_href": "/profile/Lauchlin-Divine"
                }
            ]
        }
    ]
}