{
    "title": "How did the Roman Empire rise and fall? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Alex Mann",
                "href": "/profile/Alex-Mann-32"
            },
            "answer_text": "Rome first was a Republic and then became an empire. ————————————--The Rise of an Empire——————————————  Many people will say the Empire started with Julius Caesar or Augustus but this is not the truth I am afraid. The Empire truly began when Tiberius Gracchus assumed the office of Tribune of the Plebs in 133 BC. Gracchus was the son of the legendary Tiberius Gracchus the elder and the even more legendary Cornelia Africana. Tiberius the elder: This man was a legend in his time. Twice made consul and twice awarded a Triumph his career was uncontested as the greatest so far in Roman history. During his stellar career, he married Cornelia Africana, daughter of the most famous Roman yet- Scipio Africanas. This was as good of a match as any man could ask for in Rome. The Scipios were riding high after their defeat of Hannibal in the second Punic war and Scipio Africanas had risen to the absolute top of Roman politics. By connecting himself to his notable family Tiberius the Elder himself rose to the top of Roman politics. It was noted that there was general affection between the Elder Gracchus who was in his 40s and the younger Cornelia who was in her late teens.Cornelia Africanas: This is the grand matron of Rome. The daughter of the savior of Rome, the wife of a 2-time consul, and the mother of 2 great politicians- she was seen as the picture of womanhood in Rome. Women in Rome had no rights at all. They were seen as mothers and wives only and were judged based on the accomplishments of their family. Cornelia was thus seen as the perfect Roman women and her image would be the standard that all future Roman women judged themselves by.Tiberius Gracchus the younger would serve with the legions in Spain where he brokered a peace deal and saved the legions. Back in Rome, he was elected Tribune of the Plebs. The office of Tribune of the plebs was an extremely important office. Tribunes could veto any legislation at all and propose legislation as well. A Tribune’s veto was absolute and was meant to be a check to the aristocratic Senate. If a Tribune vetoed something it was meant to make the Senators realize how their actions were affecting the everyman.Tiberius had a goal in this Tribuneship. Roman citizens traditionally each held a plot of land that they worked on. The ideal of the Roman Republic was the idea of the agrarian state where everyman grew his own food and had his own home. As Romes wars took her legions further from Italy and for longer periods of time the land belonging to these citizen soldiers went unuse. When they returned home they found it impossible to compete with massive slave run estates operated by the rich and would end up selling their land for cheap. Rome became overcrowded with poor ex-landowners looking for work. This was all illegal too as a Roman was not allowed to own a lot larger than 500 achers. The rich were ignoring this law and Tiberius aimed to reinforce it. His idea was simple- buy back the illegally held land and distribute it to the poor. The Senate- is made up of rich men- HATED this idea and did everything they could to veto it. They had another Tribune of the plebs veto Tiberius’s proposal again and again. Tiberius responded by forcefully removing the Tribune from office (highly illegal) and then vetoing every single proposal and action taken by the Senate (totally unheard of to this point). Thus Tiberius got his way and his land proposal went through but the cost was too high. Tiberius had broken 2 major laws and abused his powers. To top this off he decided to run for a second term as Tribune- this too was HIGHLY illegal and the furious Senate marched out and killed Tiberius Gracchus. The doors to the empire were opened here. Men were abusing their power and violence became normal. The class struggle between rich and poor was now amplified and the once Peaceful Republic was engulfed in political struggle. ——————————————Sulla and Marius———————————————  After the chapter of the Gracchi came the chapter of Sula and Marius. Marius was a reformer and he reformed the enitre military. His position was populistic in nature and he favored extending the rights of the poor and the landless.Sula was a hyper-conservative and favored the rule of the Senate and the aristocracy.In the interest of time, I will sum this up. Following the example of the Gracchi Marius took control of the army, won some wars, and then made himself consul 7 times. The law was that a consul could serve 1 term for a year and then had to wait 10 years before running again. Marius ignored this law and illegally took power. Sulla was the foil to Marius being a conservative aristocrat and a similarly brilliant commander. Eventually, war broke out between them and Marius being in control of Rome began purging and killing all of Sula’s supporters. This included citizens, Senators, slaves, and freedmen. This was beyond illegal- it would be tantamount to Trump just outright killing democratic politicians and citizens in the streets. Sulla eventually won the civil war and took back Rome where he too began purging everyone. Sulla would then be made dictator for life. Sula had seen the corruption of Marius and the Gracchi and reform the system to give all the powers back to the senate. The office of Tribune lost all its power and the supporters of Marius and the Gracchi were hunted and killed. After Sulla felt the Roman Republic was restored to its rightful place he left the office and retired. See what has happened here- 2 men took total control of Rome and began illegally killing everyone who opposed them. Under this reign of terror, Caesar and Pompey would grow up. Forever after these men wondered “If Sulla could do it why can’t I?” This is were the Republic broke. The line was crossed and the rules were broken forever. Sula and Marius did these things because the legions supported them. In Rome the law didn’t matter- only the legions did. Might now made right and this was the new standard. It is very easy to move from democratic to authoritarian but much harder to do the opposite. Here we are at the collapse. The Garcci made everyone realize that power could be abused if the mob supported you and they brought the class struggle to the forefront of Rome society. Sulla and Marius then extended this further taking control of Rome and doing away with democracy because they could. ———————————————The Caesars————————————————  Julius Caesar learned from Sulla and Marius and after gaining the support of the people and the legions embarked on a civil war against the Senate. He won this war and made himself dictator for life. He ignored the example of Sulla and Marius though and did not purge his opposition and this opposition would assassinate him. Caesar left everything he had in his will t his grand-nephew Octavian. Octavian would follow the example of Marius and Sula better than Caesar and remove all threats to his power. He stacked the Senate with loyal supporters and took total control of Rome. Where Sulla reigned his power after a couple of years and Caesar was killed Octavian kept his power and reigned for 40 more years. The people by this point were fine with this. They had been through 100 years of constant civil war, economic strife, fearing for their lives, and total instability. Octavian brought stability back to Rome and everyone was just happy to be safe again. By the time of his death, everyone had lived through the 40 prosperous years of Octavian and forgot all about the Republic. ——————————————-—-Summary————————————————— It was a combination of factors that lead to the rise The Gracchi create the class struggle and begin the process of abusing power for political gain. They showed Rome that taboos can be broken and laws can be ignored if you have the mob with you.Sulla and Marius continue this trend and add the violent purging of political opponents. They are able to take their abuses of power further by adding control of the legions to the mixCaesar follows the standards of the Gracchi by getting the mob on his side and the example of Sulla by getting the legions on his side. He makes the mistake of not purging his opposition though and is assassinatedOctavian learns from everyone. He gets the mob on his side, he gets the legions on his side, he purges his opposition, and he rules for 40 years. His long and unchallenged reign allows the imperial government to settle in and by the time of his death, the idea of the Republic was long dead.———————————————The first fall————————————————  Mike Duncan who created the 178 part “History of Rome” series said, “the empire fell for 276 reasons”. While he is exaggerating a little bit he honestly is not far off. It was not one factor that leads to the collapse of the Western Rome Empire but many. I will list out some- but it is no way a totally comprehensive list Rome was invaded: The Roman Empire faced invasions by the Goths, Vandals, Huns, Franks, Saxons, and many more. At first, they tried to settle these peoples on Roman land but that failed completely. Rome had faced Germanic invasions its entire history though so why was this an issue? Well…..The Romans failed to assimilate the new Germanic arrivals: Rome’s greatest strength was assimilating new peoples into the empire making them loyal subjects. In the end of the Empire, they failed to do this and outright abuse these new immigrants. Rome settled these new arrivals on crappy land and forced them into the army. It is reported that these people were so hungry that they sold their children for dog meat. Eventually, these people revolted and even sacked the city of Rome. There were multiple tribes of people who fled into Roman lands and instead of assimilating them Rome just sorta granted them land in the empire. By the time of the collapse in 476 most of Gaul and Spain was divided into a bunch of Roman vassal states that paid little more than lip service to the emperor in Revanna or Milan.Rome split into 2 parts, East and West: Obviously when 1 empire becomes 2 each of these empires is weaker for it.They ran out of money: The East was rich with food, resources, population, and trade routes while the West was not. Cut off from these resources the West could not support itselfThe legions became a joke: Romans no longer wanted to join the army at all. So the legions were staffed with immigrants. When there were not enough immigrants to man the legions the Roman paid for Mercenary armies to do their fighting. The troops Rome did raise were poorly equipped, not at all loyal to Rome, and poorly paid as a result of Rome’s money issues. The mercenaries were also cut-rate troops and were leagues behind the hardened barbarian tribes they were facing. Simply put the Roman army was no longer a feared force and could not hope to match the flood of hostile tribes.Rome ran out of good men: There were a couple of good emperors that served in the end for short stints but overall the Roman Emperors of the final years were terrible, paranoid, and clueless. When all the power is in 1 man's hands and this 1 man sucks at his job things tend to go badly.There are many more reasons but these are some of my favorite. ——————————————-The Fall: Take 2———————————————  Where the Western Roman Empire fell the Eastern Roman Empire maintained for another 1000 years. They too would fall but where the Western fell with a bang the East fell slowly over centuries. The lost wars against the Persians and new Islamic tribes, plague ravaged the major cities of the empire, and inept leadership leading them to defeat after defeat. Century by century and war by war the Eastern Roman Empire lost more and more land. Eventually, they lost Egypt and Syria and the rich trades routes along with it. Then they lost Anaoltia and their population base with it. Now- confined to Greece alone- the grand City of Constantinople was taken by angry Crusaders and the Eastern Romans lost their hold on Greece. They would recover their capital in time but the empire was permanently weakened by this. They would never really recover and by the 1400s the Romans held onto only Constantinople alone. When this great city was taken by the Turks in 1453 it marked the end of the Eastern Roman Empire forever. So why did they fall? They lost wars and their valuable territory. Once this territory was lost their ability to make enough money to raise a big enough army to take back the territory was lost. There was no great weakness that leads to their collapse like in the Western Roman Empire- instead, they were simply outmatched by the new Islamic empires and caught up between the Latin Christians the Islamic Empires. They held on for a long time and that alone took serious effort and skill but in the end, their days were numbered as soon as they lost Egypt and Anatolia. ",
            "date": "Answered August 31, 2019",
            "views": "584",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vineet Varma",
                    "user_href": "/profile/Vineet-Varma"
                },
                {
                    "user_id": "Sayan Dutta",
                    "user_href": "/profile/Sayan-Dutta-24"
                },
                {
                    "user_id": "Hamza Malakzay",
                    "user_href": "/profile/Hamza-Malakzay"
                },
                {
                    "user_id": "Matthias Haavel",
                    "user_href": "/profile/Matthias-Haavel"
                },
                {
                    "user_id": "Mick Dones",
                    "user_href": "/profile/Mike-Doomer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julian Diamond",
                "href": "/profile/Julian-Diamond-1"
            },
            "answer_text": "When Did the Roman Empire collapse?476 Really?Well, kinda Umm, okay. What do you mean?Well, that was when the last Roman Emperor, Romulus Augustus, was deposed Hmm, like deposed after a war?No, deposed by the person that was in power, Odoacer  So Odoacer was the Roman Emperor?No, he was a Germanic warlord Wait... what?Yea, Germanic tribes had slowly taken power of the Roman military So Rome fell before 476?No, well... yea kinda Oh so ....Wait.. No, actually it didn't because the Eastern half of the Empire still had power So it was the Eastern Empire that fell in 476?Dammit! Aren't you listening?!?! The Eastern Empire fell in 1453! Oh, sorry did you tell me that already? What happened in 1453?The Turks conquered Constantinople Constantinople?Yes, dammit! The capital of the Byzantine Empire! The Byzantine Empire?Yea, the Eastern Roman Empire Oh I get it, so the reason that they say 476 is because that's when the Empire centered in Rome was ended?Yea, wait no, the capital of the Western Roman Empire was Ravenna Umm...?It was more defensible So after 476 there was no more Western Roman Empire?Are you stupid? There was a guy in Dalmatia, Julius Nespos! Oh sorry, what happened to him?He was assassinated in 480 Then no more Rome?No idiot, after that, the Ostrogoths under Theodoric the Great overthrew Odoacer in the name of the Roman Emperor in Constantinople. The Ostrogoths actually started rebuilding the city of Rome. It was awesome. Umm... The Ostrogoths? What happened to them?Ughhh!! Duh, they were overthrown by the Romans by the order of Justinian So the Roman people got tired of the Goths?No!! The Romans loved Theordoric, didn't you read Cassiodorus? That whole thing with Boethius was a misunderstanding. So who overthrew the Goths?The Romans! So after all that there was no more Roman emperor except the one in Constantinople?Duh, Charlemagne was crowned emperor, he ruled most of Modern day France and large parts of western Europe. He was the first Holy Roman Emperor Oh he founded the Holy Roman Empire?No, you moron, that was Otto I! So that Holy Roman Empire ruled the city of Rome?Umm, kinda.. sometimes So when did that collapse?Napoleon ended it in 1806, but it was irrelevant by then So when did it really collap.... actually I don't want to know. So then there was no Roman Emperor?Are you soft in the head? Heard of the word Czar?  So the Roman Empire collapsed in 1917?No, haven't you been to Liechtenstein?  No, but I don't see your point.Duh Liechtenstein is the Roman Empire and it is still around So the Roman Empire still exists?Yes, in all of us my friend. ",
            "date": "Answered June 8, 2015",
            "views": "27",
            "upvotes": " View 35 Upvoters",
            "upvoters": [
                {
                    "user_id": "Javanese Panislamist",
                    "user_href": "/profile/Javanese-Panislamist"
                },
                {
                    "user_id": "Matthew Turner",
                    "user_href": "/profile/Matthew-Turner-38"
                },
                {
                    "user_id": "Harold Migias",
                    "user_href": "/profile/Harold-Migias"
                },
                {
                    "user_id": "Marco Bucella",
                    "user_href": "/profile/Marco-Bucella"
                },
                {
                    "user_id": "Abigail Slade",
                    "user_href": "/profile/Abigail-Slade-3"
                },
                {
                    "user_id": "Ivo Alpuim",
                    "user_href": "/profile/Ivo-Alpuim"
                },
                {
                    "user_id": "Deepak Kumar",
                    "user_href": "/profile/Deepak-Kumar-7290"
                },
                {
                    "user_id": "Jakub Zarębski",
                    "user_href": "/profile/Jakub-Zarębski"
                },
                {
                    "user_id": "Robby Shima",
                    "user_href": "/profile/Robby-Shima"
                },
                {
                    "user_id": "William Merritt",
                    "user_href": "/profile/William-Merritt-11"
                },
                {
                    "user_id": "Gabriel Suarez",
                    "user_href": "/profile/Gabriel-Suarez-2"
                },
                {
                    "user_id": "Anouk Woudt",
                    "user_href": "/profile/Anouk-Woudt"
                },
                {
                    "user_id": "Eric Wang",
                    "user_href": "/profile/Eric-Wang-434"
                },
                {
                    "user_id": "Daniel Drum",
                    "user_href": "/profile/Daniel-Drum"
                },
                {
                    "user_id": "Élise Petras",
                    "user_href": "/profile/Élise-Petras"
                },
                {
                    "user_id": "Biren Ghosh",
                    "user_href": "/profile/Biren-Ghosh"
                },
                {
                    "user_id": "Casey Guo",
                    "user_href": "/profile/Casey-Guo-3"
                },
                {
                    "user_id": "Kaustubh Khede",
                    "user_href": "/profile/Kaustubh-Khede-1"
                },
                {
                    "user_id": "Walker Lay",
                    "user_href": "/profile/Walker-Lay"
                },
                {
                    "user_id": "Tayla Tulloch",
                    "user_href": "/profile/Tayla-Tulloch"
                },
                {
                    "user_id": "JA Fearon",
                    "user_href": "/profile/JA-Fearon"
                },
                {
                    "user_id": "alex gates",
                    "user_href": "/profile/alex-gates-48"
                },
                {
                    "user_id": "Mälèèsh Mèkìtöjì Lèöñ",
                    "user_href": "/profile/Mälèèsh-Mèkìtöjì-Lèöñ"
                },
                {
                    "user_id": "Tanya Bolton",
                    "user_href": "/profile/Tanya-Bolton-1"
                },
                {
                    "user_id": "Xaelor Rathalos",
                    "user_href": "/profile/Xaelor-Rathalos"
                },
                {
                    "user_id": "Hari Iyer",
                    "user_href": "/profile/Hari-Iyer-79"
                },
                {
                    "user_id": "Annica Sandberg",
                    "user_href": "/profile/Annica-Sandberg"
                },
                {
                    "user_id": "Ethan Stevens",
                    "user_href": "/profile/Ethan-Stevens"
                },
                {
                    "user_id": "Alex Muniz",
                    "user_href": "/profile/Alex-Muniz-2"
                },
                {
                    "user_id": "Paul Leong",
                    "user_href": "/profile/Paul-Leong-3"
                },
                {
                    "user_id": "Yash Saraswat",
                    "user_href": "/profile/Yash-Saraswat-12"
                },
                {
                    "user_id": "Linus Skov",
                    "user_href": "/profile/Linus-Skov"
                },
                {
                    "user_id": "Donny Price",
                    "user_href": "/profile/Donny-Price-1"
                },
                {
                    "user_id": "Steve Theodore",
                    "user_href": "/profile/Steve-Theodore"
                },
                {
                    "user_id": "Tanmay Inamdar",
                    "user_href": "/profile/Tanmay-Inamdar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Poom Yoodee",
                "href": "/profile/Poom-Yoodee"
            },
            "answer_text": "Well it all started with Augustus the adopted son of Julius Ceasar. He started a time of expansion, government reform and learned from his fathers mistakes. These things helped rome achieve power culturally and physically it was a time of peace that would not end until about 200 year, this time was called the pax romana and it was the height of roman dominance.   The end- around 300-400 c.e the ruler if the empire decide to split the empire into 2 parts because the empire was to big to govern with one ruler. So one ruler had a capital at Constantinople, and the other at Rome. But here comes the arguing of the fall of rome part. The side with Rome as the capital got attack by the barbaric tribes of Germany and fell in 476, this is considered the fall of the roman empire. But (here comes the argument) the Eastern side with Constantinople as the capital did fall until 1453 when it fell to Ottoman turks 1000 years after the fall of western rome. So if you finish reading this you can share your thought about the argument. ",
            "date": "Answered June 10, 2014",
            "views": "890",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ivo Alpuim",
                    "user_href": "/profile/Ivo-Alpuim"
                },
                {
                    "user_id": "Daniel Drum",
                    "user_href": "/profile/Daniel-Drum"
                },
                {
                    "user_id": "Tanya Bolton",
                    "user_href": "/profile/Tanya-Bolton-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Holliday",
                "href": "/profile/Dan-Holliday"
            },
            "answer_text": "Define \"fall\" first.  The truth is, Rome never fell.  It evolved and morphed over nearly two millennia.  The Western Empire certainly did collapse, but to the people living there, they just saw it as a normal part of the transition of daily life.  Their lives were ruled by the local aristocracy with nominal patronage to Rome.  When Rome officially left, their lives either stayed the same or improved incrementally.  That's because -- by the time of Rome's Western collapse -- the area had been neglected for five generations.  All they knew is that those bastards in Rome were getting a percentage of their wealth.   The Eastern Empire stayed together for quite a bit longer.  Another eleven-hundred, in fact and even then -- while it did collapse -- the Turks considered themselves at least nominally the successors of Rome (naming one of their local states \"The Sultanate of Rum\"; \"Rum\" being \"Rome\").   So, unless you can define \"fall\" then we can't give you a date.  Even then, such a date comes with caveats.  Even then, I'd still fall back on the, \"Rome evolved more than it fell.\" ",
            "date": "Answered January 2, 2014",
            "views": "22",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Harold Migias",
                    "user_href": "/profile/Harold-Migias"
                },
                {
                    "user_id": "Brian Hval",
                    "user_href": "/profile/Brian-Hval"
                },
                {
                    "user_id": "Ivo Alpuim",
                    "user_href": "/profile/Ivo-Alpuim"
                },
                {
                    "user_id": "Jakub Zarębski",
                    "user_href": "/profile/Jakub-Zarębski"
                },
                {
                    "user_id": "Joshua Bodmer",
                    "user_href": "/profile/Joshua-Bodmer-1"
                },
                {
                    "user_id": "Eric Wang",
                    "user_href": "/profile/Eric-Wang-434"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jay-Double-Gee"
                },
                {
                    "user_id": "Mark Steinberg",
                    "user_href": "/profile/Mark-Steinberg-10"
                },
                {
                    "user_id": "Tanya Bolton",
                    "user_href": "/profile/Tanya-Bolton-1"
                },
                {
                    "user_id": "Hari Iyer",
                    "user_href": "/profile/Hari-Iyer-79"
                },
                {
                    "user_id": "Jeffrey Eisenberg",
                    "user_href": "/profile/Jeffrey-Eisenberg"
                },
                {
                    "user_id": "Jack Calnan",
                    "user_href": "/profile/Jack-Calnan"
                },
                {
                    "user_id": "Tirumalai Kamala",
                    "user_href": "/profile/Tirumalai-Kamala"
                },
                {
                    "user_id": "Mithil Kamble",
                    "user_href": "/profile/Mithil-Kamble"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Almendra",
                "href": "/profile/Jason-Almendra"
            },
            "answer_text": "Rome fell because they exported all their gold and silver to China and India for silk, spices and opium. They ran out of people to tax. That's why Rome fell in 476 AD. Constantinople lingered on until 1453 because they stole the secrets to silk production from China around 600s. They made it a government monopoly. So some of the flow of gold to China and India was diverted into the Eastern Roman empire’s treasury. They made government pay for itself. Which something Uncle Sam needs to learn. ",
            "date": "Answered December 2, 2018",
            "views": "297",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Susanna Viljanen",
                    "user_href": "/profile/Susanna-Viljanen"
                },
                {
                    "user_id": "Jeffrey Wang",
                    "user_href": "/profile/Jeffrey-Wang-156"
                },
                {
                    "user_id": "Brian Hval",
                    "user_href": "/profile/Brian-Hval"
                },
                {
                    "user_id": "Ivo Alpuim",
                    "user_href": "/profile/Ivo-Alpuim"
                },
                {
                    "user_id": "David James Lucas",
                    "user_href": "/profile/David-James-Lucas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Mills",
                "href": "/profile/Brandon-Mills-18"
            },
            "answer_text": "I would say though the Roman Military was and would be one of the leading forces in the world if it was around still of course then can still be killed unlike some of the legends. But like other people had said it was already dying and this just sped up the process of the failing heart of Rome . The drive to fight and prevail in battle was failing and the main heart of Rome had a disease known today as corruption so the Holy Roman Emperor was not that helpful and Rome would have stayed longer but still would eventually die ",
            "date": "Answered October 15, 2015",
            "views": "190",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeffrey Wang",
                    "user_href": "/profile/Jeffrey-Wang-156"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Baird",
                "href": "/profile/Andrew-Baird-6"
            },
            "answer_text": "The Roman empire fell because civil wars and contests over the throne left it unable to defend it's territory against the venetians, bulgarians, serbs and most importantly the turks, who overran its capital in 1453 and its last remaining province (the Morea) by 1460. ",
            "date": "Answered June 5, 2015",
            "views": "844",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nick William",
                    "user_href": "/profile/Nick-William-21"
                },
                {
                    "user_id": "Jeffrey Wang",
                    "user_href": "/profile/Jeffrey-Wang-156"
                },
                {
                    "user_id": "Ivo Alpuim",
                    "user_href": "/profile/Ivo-Alpuim"
                },
                {
                    "user_id": "Anouk Woudt",
                    "user_href": "/profile/Anouk-Woudt"
                },
                {
                    "user_id": "Francisco Mata",
                    "user_href": "/profile/Francisco-Mata-6"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jason-Blau"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zoie Yates",
                "href": "/profile/Zoie-Yates"
            },
            "answer_text": "Mr.Nicky guys listen to all of his songs it helps!But first listen to this one about this topic… Ancient Rome!",
            "date": "Answered May 19, 2016",
            "views": "51",
            "upvotes": "0"
        }
    ]
}