{
    "title": "How do home buyers usually search for homes? - Quora",
    "tags": [
        "Home Buying",
        "Real Estate Agents",
        "Homes and Houses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cameron Feldhaus",
                "href": "/profile/Cameron-Feldhaus-1"
            },
            "answer_text": "According to the Joint Study from The National Association of REALTORS® and Google, 90% of home buyers searched online during their home buying process.Real estate related searches on Google have grown 253% over the past 4 years.Buyers use specific online tools during different phases of the home search process.36% of new home shoppers utilize a mobile device while they are watching TV.Home shoppers using search engines are actively engaged, raising their hands asking for more information or assistance.Shoppers will perform an average of 11 searches prior to taking action on a real estate site.Home shoppers using search engines are 9% more likely to take an action on a real estate brand website than those who do not search.69% of home shoppers who take action on a real estate brand website begin their research with a local term, i.e. “Los Angeles homes for sale” on a search engine.52% of actions on real estate brand site come directly from a local search on a search engine.REALTORS® using offline marketing and sales channels should incorporate digital to complement those efforts.89% of new home shoppers use a mobile search engine at the onset and throughout their research.Mobile applications are used by 68% of new home shoppers at the onset and throughout their research.YouTube Is the Top Video Research Destination for Home Shoppers.31% of home shoppers who take action on a real estate site are aged 25-34, surpassing all other ages.TV, billboards, and print channels play minimal role in research and decision-making process for home shoppers.Home builder related searches on tablets grew 362% year-over-year.Real estate brokers related searches on tablets grew 300% year-over-year.New home buyers place emphasis on virtual tours and videos showcasing properties and communities.Home buyers who purchased previously owned homes are more likely to bring their online research offline by walking through or driving by a home they viewed online.Source: Google & Compete Home Shopper Study, 2011; Google & Compete New Home Shopper Study, 2012 ",
            "date": "Updated September 19, 2019",
            "views": "228",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Rolande",
                "href": "/profile/Jonathan-Rolande-1"
            },
            "answer_text": "In the UK, online. The vast majority look on portals such as Rightmove or Zoopla to check prices. I still recommend visiting the area to assess and hunt for For Sale boards too. That way you can refine things down to the exact location and style you want. ",
            "date": "Answered December 5, 2017",
            "views": "83",
            "upvotes": "0"
        }
    ]
}