{
    "title": "How underdeveloped was Russia compared to the other great powers before WW1? - Quora",
    "tags": [
        "World War I",
        "Russia",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Hopkin",
                "href": "/profile/Dave-Hopkin-1"
            },
            "answer_text": "In Russia in 1861, peasant reform (also known as the abolition of serfdom) was carried out. This reform created the conditions necessary for the victory of the capitalist mode of production. The main of these conditions was the personal liberation of 23 million serfs who formed the wage labor market. In the post-reform period, an industrial revolution ended in Russia. After 1861, all the prerequisites arose for the final conversion of manufacturing into factory production. By the early 1880s, the main industrial products began to be produced at factories and plants using machines and mechanisms driven by steam. Factory production on the basis of civilian labor pushed into the background manufactory in all leading industries. At the end of the 1870s, 58% of the textile industry was produced on 50 thousand mechanical looms. Factories accounted for three quarters of textile and more than 80% of metal products, about 90% of sugar production. Two-thirds of the energy needed for metallurgy came from steam engines and turbines. Manual labor occupied leading positions only in the leather, furniture, and in some sectors of the food industry. In the late 1880s and up to the end of the century, primarily heavy industry developed at a rapid pace, the volume of production of which increased by 4 times, and the number of workers doubled. If in the 80s large mechanized enterprises were rare among the huge mass of artisanal production, then in the late 19th - early 20th centuries. In all major sectors, large and largest enterprises dominated. The industrial development of the 1880s was marked by extreme regional and sectoral unevenness. At the end of the decade, it ended with a new systemic crisis, which was part of the recession in world industrial production and was accompanied by an agrarian crisis. In search of a way out of this difficult situation, the government made deliberate efforts that led to an unprecedented industrial boom that began in 1893. The years of this boom were a time of economic modernization of Russia under the auspices of the state. Growth in Russian Industrial Output as a percentage of world output  ",
            "date": "Answered October 26, 2020",
            "views": "133",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lynn Oddy",
                "href": "/profile/Lynn-Oddy"
            },
            "answer_text": "Russia was still basically a peasant agricultural economy run by an aristocratic nobility under an absolute monarch. The industrial revolution had started but relied on foreign engineers because the education system was aimed at those who could pay and the taught the subjects they were interested in. There was little banking or finance available so major projects had to be funded from outside - mainly Britain, France and Germany. What we would now call a third world economy. ",
            "date": "Answered October 24, 2020",
            "views": "54",
            "upvotes": "0"
        }
    ]
}