{
    "title": "How do historians and archaeologists know how old certain ancient artifacts are? - Quora",
    "tags": [
        "Archaeologists",
        "Artifacts (archaeology)",
        "Historians",
        "Archaeology",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Richter",
                "href": "/profile/Matthew-Richter-2"
            },
            "answer_text": "There are many ways an archaeologist can determine the age of an artifact. Here are some of them: Stratigraphy - Occupation and settlement layers are frequently able to be defined on the sides of the excavation pit. Each layer represents a different period of time. The upper layers are more recent than the lower ones. As the excavation continues, the time periods that belong to each layer are better defined as to their age. If an artifact is found within a specific layer, it can be dated to the period that layer corresponds toDendrochronology - If an object is made, or contains portions of wood, analysis of the growth rings in a sample of that wood can be compared to a database of known dates for that specific type of wood. This analysis can tell when the wood was cut to make the artifact. This is a relatively new dating technique but is being used more and more often.Carbon-14 - Analysis of the decay of carbon molecules within plant and animal remains can be measured in a laboratory. Since the rate of decay is known to be constant. The measurement of the decay will allow archaeologists to determine the age of an artifact.Comparative analysis (I’ve been out of archaeology for too long to remember the specific terms for this) - Types of pottery, tools, weapons and other artifacts can be compared to those found at other archaeological projects. A match to previously identified artifacts is found we can identify the age of the artifact we are studying.Or you can always ask your grandparents if the recognize the item……. ",
            "date": "Answered June 13, 2020",
            "views": "191",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arden Tom McClure",
                "href": "/profile/Arden-Tom-McClure"
            },
            "answer_text": "If they contain any carbon, carbon dating can be used. If they contain any radioactive material radioactive decay can be used. Those are the newer methods. Style charts exist from strata deposits and stylistic development researches. Also chemical analysis of paint, fibers, and Clays. They also use linguistic analysis and genetic analysis to help track changes. Change is the secret, because nothing stays the same. The essence of history. ",
            "date": "Answered June 13, 2020",
            "views": "183",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kriston Scott",
                    "user_href": "/profile/Kriston-Scott"
                }
            ]
        }
    ]
}