{
    "title": "How did the Great Depression affect housing? - Quora",
    "tags": [
        "The Great Depression",
        "Housing",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Sands",
                "href": "/profile/Bill-Sands-8"
            },
            "answer_text": " A \"Hooverville\" was a shanty town built during the Great Depression by the homeless in the United States. They were named after Herbert Hoover, who was President of the United States during the onset of the Depression and was widely blamed for it. The term was coined by Charles Michelson, publicity chief of the Democratic National Committee. There were hundreds of Hoovervilles across the country during the 1930s and hundreds of thousands of people lived in these slums. Homelessness was present before the Great Depression, and was a common sight before 1929. Most large cities built municipal lodging houses for the homeless, but the Depression exponentially increased demand. The homeless clustered in shanty towns close to free soup kitchens. These settlements were often trespassing on private lands, but they were frequently tolerated or ignored out of necessity. The New Deal enacted special relief programs aimed at the homeless under the Federal Transient Service (FTS), which operated from 1933 to 1935. Hooverville - Wikipedia L. 73–479, 48 Stat. 1246, enacted June 27, 1934, also called the Capehart Act and the Better Housing Program, was part of the New Deal passed during the Great Depression in order to make housing and home mortgages more affordable. National Housing Act of 1934 - Wikipedia The Housing Act of 1937 (Pub.L. 75–412, 50 Stat. 888, enacted September 1, 1937), formally the \"United States Housing Act of 1937\" and sometimes called the Wagner–Steagall Act, provided for subsidies to be paid from the U.S. government to local public housing agencies (LHAs) to improve living conditions for low-income families.  Federal Housing Administrator Stewart McDonald (right) discusses with Senator Robert F. Wagner, author of The Wagner Housing Act The act created the United States Housing Authority within the US Department of the Interior. The act builds on the National Housing Act of 1934, which created the Federal Housing Administration. Both the 1934 Act and the 1937 Act were influenced by American housing reformers of the period, with Catherine Bauer Wurster chief among them. Bauer drafted much of this legislation and served as a Director in the United States Housing Authority, the agency created by the 1937 Act to control the payment of subsidies, for two years. The sponsoring legislators were Representative Henry B. Steagall, Democrat of Alabama, and Senator Robert F. Wagner, Democrat of New York. Although initially controversial, it gained acceptance and provisions of the Act have remained, but in amended form. Housing Act of 1937 - Wikipedia ",
            "date": "Answered May 1, 2020",
            "views": "146",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gary Pearson",
                    "user_href": "/profile/Gary-Pearson-20"
                }
            ]
        }
    ]
}