{
    "title": "How many years has it been since Jesus died? - Quora",
    "tags": [
        "Years",
        "Jesus"
    ],
    "response": [
        {
            "author_info": {
                "name": "Milan Woodson",
                "href": "/profile/Milan-Woodson"
            },
            "answer_text": "Jesus died in the year of 33 C.E. (AD) so 2016 - 33 would be 1983 years. He may be back for the salvation of some very soon but to express vengeance on others at Armageddon. Could it be in, oooh lets say, as late as 17 years, which would be about 2,000 years since his death and resurrection when he will judge the world with Armageddon as the end result later? Who knows? Oh, did I mention that he will have a heavenly army of other spirits with him. Yet, he will return several years earlier than Armageddon to cut short the great tribulation, then several years later he will commence Armageddon. We first have to determine when Jesus was born to know when he died to know how long ago it has been. Jesus was born during the reign of Roman Emperor Caesar Augustus, when Quirinius was governor of the Roman Province of Syria and Herod was king of Judea in Israel, when a mandatory registration was commanded. For about 100 years there has been a consensus among scholars that Herod the Great reigned from 37 to 4 BCE. However, there have been several challenges to this consensus over the past four decades, the most notable being the objection raised by W.E. Filmer. This paper argues that Herod most likely reigned from late 39 BCE to early 1 BCE, and that this reconstruction of his reign can account for all of the surviving historical references to the events of Herod's reign more logically than the current consensus can. Moreover, the reconstruction of Herod's reign proposed in this paper accounts for all of the datable evidence relating to Herod's reign, whereas the current consensus is unable to explain some of the evidence that it dismisses as ancient errors or that it simply ignores. When Did Herod the Great Reign? The reign of Tiberius Caesar began on the death of his predecessor Augustus Caesar in September AD 14, implying that the ministry of John the Baptist began in late AD 28 or early AD 29.[38][39]...all the major Roman historians who calculate the years of Tiberius' rule - namely Tacitus, Suetonius and Cassius Dio - count from AD 14 - the year of Augustus' death. In addition, coin evidence shows that Tiberius started to reign in AD 14.[40] Chronology of Jesus - Wikipedia Tiberius (Latin: Tiberius Caesar Dīvī Augustī Fīlius Augustus;[1][2] 16 November 42 BC – 16 March 37 AD) was Roman emperor from 14 AD to 37 AD. Tiberius - Wikipedia Four main approaches have been used to estimate the date of the crucifixion of Jesus. One uses non-Christian sources such as Josephus and Tacitus.[16][17] Another works backwards from the historically well-established trial of Apostle Paul in Achaea to estimate the date of Paul's conversion. Both approaches result in AD 36 as an upper bound to the crucifixion.[18][19][20] Thus, scholars generally agree that Jesus was crucified between AD 30 and AD 36.[9][18][21][22] Astronomical point estimates developed by Isaac Newton focus on the first day of Passover, either Friday 3 April 33 AD or Friday 7 April 30 AD / 7.4.783 AUC / 14 Nisan 3790 HC (Anno Mundi)[23] Chronology of Jesus - Wikipedia For Jesus to have died on a Friday when Pontius Pilate was procurator of Judaea, 14 Nisan would have to be either April 7, AD 30—or, more probably, April 3, AD 33, when there also was a lunar eclipse as the full moon rose above Jerusalem, thus fulfilling the prophecy quoted by Peter that \"The sun shall be turned into darkness, and the moon into blood, before that great and notable day of the Lord come\" (Acts 2:20). (If the death of Jesus occurred on a Friday, 15 Nisan, in the decade-long rule of Pontius Pilate, the year would have to be either AD 27 or AD 34, which almost certainly is too early or too late.) Another incident supports the crucifixion of Jesus in AD 33: the death in Rome of the praetorian prefect Sejanus two years before. When Did Jesus Die? So, counting backwards Jesus started his ministry at the age of 30 within a year of John the baptizer's ministry who began in 29 CE (AD) in the fifteenth year of Caesar Tiberius. Therefore Jesus was born 30 years earlier in 2 BCE (BC) (there is no year 0, dates went from 1 BCE to 1 CE) from 30 years of age in 29 CE his ministry lasted 3 1/2 years when he was put to death in the year 33 CE on Thursday Nisan 14. Therefore, in the year 2017 (2017 - 33) Jesus had been dead as a human for 1984 years. By spring of 2033 CE he will have been dead as a human on earth for 2000 years. About 2 BCE “in those days a decree went forth from Caesar Augustus for all the inhabited earth to be registered; (this first registration took place when Quirinius was governor of Syria)…Of course Joseph went up…to get registered with Mary…While they were there…she gave birth to her son\" Luke 2:1, 2, 4-6 “Jesus was born in Bethlehem in the days of Herod the king” Matthew 2:1 1 BCE “angel appeared in a dream to Joseph, saying: “Get up, take the young child…and flee to Egypt and stay there until I give you word\" Matthew 2:13 1 BCE “When Herod had deceased…angel appeared in a dream to Joseph in Egypt and said: “Get up, take the young child…and be on your way into the land of Israel\" Matthew 2:20 “Archelaus ruled as king of Judea instead of his father Herod\" Matthew 2:22 29 CE “In the fifteenth year of the reign of Tiberius Caesar, when Pontus Pilate was governor of Judea, and Herod was district ruler of Galilee, but Phillip his brother was district ruler of the country of Ituraea and Trachonitis, and Lysanias was diastrict ruler of Abilene, in the days of chief priest Annas and of Caiaphas, God's declaration came to John the son of Zechariah in the wilderness.\" Luke 3:1 “Furthermore, Jesus himself, when he commenced his work, was about thirty years old” Luke 3:23 33 CE “I am going my way to the Father\" John 14:12 “my Father who is in the heavens\" Matthew 10:33 “he was exalted to the right hand of God\" Acts 2:33 \"Jesus...came forth from God and was going to God.\" John 13:1, 3 \"when they had impaled him\" Matthew 27:36 An unusually long, three hour, eclipse or dark atmospheric cloud cover happened over the land of Israel. It occurred from 12pm (6th hour) to 3pm (9th hour) Jerusalem time in the spring of 33 CE. It would have been Thursday April 1, on Nisan 14th. So while the darkness was natural its duration was miraculous, for eclipses nor dark clouds last for that much of an extended amount of time in one area over the earth. So God used what was practicle, natural and available to display his displeasure. Was Jesus crucified during a solar eclipse? NASA shows one occurred in 33 A.D. \"From the sixth hour on a darkness fell over all the land, until the ninth hour\" Matthew 27:45 Quake reveals day of Jesus' crucifixion, researchers believe \"look!...the earth quaked, and the rock masses were split.\" Matthew 27:51 Jesus died about April 1, 33 CE at 3pm. So the spring of 2033 CE, during March or April according to the Jewish calendar, Jesus will have been dead as a human, but as a spirit will have returned to earth with an army of angels to judge the earth. This will be after he will have cut the Great tribulation short, seal the slaves of God and resurrected these holy ones. But his judgment will result in adverse judgment upon the opposing world of mankind and the destruction of Babylon the Great and then the time of Armageddon during the fall of 2034 CE. Mt 25:31; Re 14:14; 16:1–31; 17:1, 5, 16; 14:17–20; 19:11, 13, 19–21 \"Again Jesus cried out with a loud voice, and yielded up his spirit\" Matthew 27:50 \"Then the dust returns to the earth just as it happened to be and the spirit itself returns to the true God who gave it.\" Ecclesiastes 12:7 Three days later he was resurrected as a spirit. \"If you send forth your spirit they are created\" Psalms 104:30 \"Do not be fearful...Jesus who was impaled...was raised up (merely resurrected, but not yet arisen to heaven)\" Matthew 28:5, 6 Jesus returned to heaven as a spirit but was fortold that he would return to earth a second time, his second coming. \"Lord, are you restoring the kingdom to Israel at this time?\" He said to them...after he had said these things...while they were looking on, he was lifted up and a cloud caught him up from their vision...'This Jesus who was received up from you into the sky will come thus in the same manner as you beheld him going into the sky.'\" Acts 1:6, 7, 9, 11  \"For Christ entered...into heaven itself...before the person of God.\" Hebrews 9:24 Near future \"Jesus Christ...is coming with the clouds, and every eye will see him\" Revelation 1:5, 7 No one on earth knows the exact day and hour of Christ's return. \"you do not know on what day your Lord is coming...because at an hour that you do not think to be it, the Son of man is coming.\" Matthew 24:36, 42, 44  But He said he will return. First century Christians were confident of this and had faith. \"if I go my way and prepare a place for you, I am coming again\" John 14:3 \"God...when he again brings his Firstborn into the inhabited earth\" Hebrews 11, 6 Although we cannot know the day nor hour, look to the year 2027 CE for his return! But March through April of 2016 CE makes it 1983 years since his death and March through April of 2033 CE will be 2,000 years since his death as a human and resurrection as a spirit. He should bring an end to all humanities problems in the fall of 2034 CE. ",
            "date": "Updated March 27, 2019",
            "views": "494",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tushar Waghmare",
                    "user_href": "/profile/Tushar-Waghmare-16"
                },
                {
                    "user_id": "Jonathan Kelly",
                    "user_href": "/profile/Jonathan-Kelly-39"
                },
                {
                    "user_id": "Mike Man",
                    "user_href": "/profile/Mike-Man-24"
                },
                {
                    "user_id": "Gunnar Engesland",
                    "user_href": "/profile/Gunnar-Engesland-2"
                },
                {
                    "user_id": "Brian McCleery",
                    "user_href": "/profile/Brian-McCleery-8"
                },
                {
                    "user_id": "Susan Jamison",
                    "user_href": "/profile/Susan-Jamison-10"
                },
                {
                    "user_id": "Emmanuel Gore",
                    "user_href": "/profile/Emmanuel-Gore-1"
                },
                {
                    "user_id": "Thomas G",
                    "user_href": "/profile/Thomas-G-1"
                },
                {
                    "user_id": "Karolin Benyamin",
                    "user_href": "/profile/Karolin-Benyamin"
                },
                {
                    "user_id": "Sebi Bihari",
                    "user_href": "/profile/Sebi-Bihari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Cutler",
                "href": "/profile/Geoff-Cutler"
            },
            "answer_text": "We have information that is channeled. That does not mean it is without error as getting dates and names is very hard. Still the year we have has been carefully checked against what is known and I believe it’s probably right: Summary: Jesus was born probably on Wednesday, January 7th, 7 BC. Jesus died probably on Friday, March 18th, 29 AD, at Passover. Below is a detailed exposition of this point of view. [1] [1] The Likely Dates Of Jesus' Birth And Death. That would make it 1988 years ",
            "date": "Answered October 21, 2017",
            "views": "31",
            "upvotes": "0"
        }
    ]
}