{
    "title": "How was Mexican music influence by German settlers? - Quora",
    "tags": [
        "Polka",
        "Mexican Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luis Fernando Mata Licón",
                "href": "/profile/Luis-Fernando-Mata-Licón"
            },
            "answer_text": "A lot in the north of Mexico, the current \"Música Norteña\" (northern music) is a music genre that exists thanks of the German and Scandinavian  settlers that came to the north of Mexico.When Maximilian I became emperor of Mexico in the Second Mexican Empire, he opened the doors to a lot of europeans immigrants to Mexico, most of them settled in the north of Mexico, in the border with the US.Those settlers were rural people who came with their instruments and started playing them in their new country. El Acordeón: Raíces y Rutas de un Instrumento Musical en América Also when Maximilian I arrived to Mexico he brought his own musical band to entertain him in his palace, once he was defeated this musicians fled to the north of Mexico with their instruments.With the pass of time these instruments broke and were fixed with local tools and material, so they started to change.The instruments brought by the settlers and musicians were the Accordion and some strings instruments like the  double bass.At the end of the XIX century these new instruments made a new music genre known nowadays as \"Música Norteña\"or Norteño. This music is played particularly in the north of Mexico and in the South of the US.Is characterized by the accordion in them (brought by the germans), a string instrument called \"Bajo Sexto\" (sixth bass), a Double Bass and sometimes Sax, Tuba or drums.This genre is a mix between polka, waltz, schottische, bolero, corrido and ranchera music.The \"Música Norteña\" is one of the most popular Mexican genres in the Americas.Norteño (music) ",
            "date": "Updated December 8, 2015",
            "views": "76",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arturo Wagner",
                    "user_href": "/profile/Arturo-Wagner"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Charles Roberts",
                    "user_href": "/profile/Charles-Roberts-34"
                },
                {
                    "user_id": "Angel Torres",
                    "user_href": "/profile/Angel-Torres-18"
                },
                {
                    "user_id": "Steve Lessner",
                    "user_href": "/profile/Steve-Lessner"
                },
                {
                    "user_id": "Shish-Kah",
                    "user_href": "/profile/Shish-Kah"
                },
                {
                    "user_id": "Todd Miller",
                    "user_href": "/profile/Todd-Miller-27"
                },
                {
                    "user_id": "Juan Hermosillo",
                    "user_href": "/profile/Juan-Hermosillo"
                },
                {
                    "user_id": "Cristian Montes de Oca",
                    "user_href": "/profile/Cristian-Montes-de-Oca-1"
                },
                {
                    "user_id": "Alois Zatloukal",
                    "user_href": "/profile/Alois-Zatloukal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandra PA",
                "href": "/profile/Sandra-PA"
            },
            "answer_text": "Not much by German settlers but by the Spanish that conquered the indians. Who listen to new music and experimented with european instruments to produce and evolve in their own style as they developed different genres in mexican music. The music patterns and rhythms are similar in certain mexican genres, to the german, the reason mainly being the exposition to new instruments and therefore rhythms and styles as the european brought them into America. México has a médium to large amount of musicians and composers, all with different styles, lifetime and experiences. In each  their own, traveling and exposition for various reasons to these instruments and rhythms would be the answer. ",
            "date": "Answered August 7, 2014",
            "views": "24",
            "upvotes": "0"
        }
    ]
}