{
    "title": "How long were knights around? - Quora",
    "tags": [
        "Medieval Knights",
        "Knights",
        "Middle Ages (era)",
        "History of Europe",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Helena Schrader",
                "href": "/profile/Helena-Schrader-1"
            },
            "answer_text": "Knighthood was a phenomenon distinct to Western Europe in the Middle Ages. There have been cavalrymen in many different ages and societies, but the cult of knighthood, including a special dubbing ceremony and a code of ethics (chivalry), exists only in the Age of Chivalry -- roughly 1000 - 1500. With the shift to dependence on mercenary armies in the Renaissance, knights became obsolete although the title continued. In England to this day, a person can be honored by knighting, but today it is only an honorary title that has lost all connection to its original function.  While Richard Barber, author of an excellent and comprehensive study which I highly recommend (The Knight and Chivalry. Boydell Press, 1995), warns that “we can only trace the emergence of the knight indistinctly,” (p. 16) it is clear that knights evolved out of mounted horsemen of earlier ages. The German word for knight (ritter) derives directly from the word for rider (reiter), while the French and Spanish terms, chevalier and caballero, derive from the word for horse (cheval and caballo respectively). Barber notes that being financially in a position to outfit oneself with arms and horses was crucial to knightly status. David Edge and John Miles Paddock argue in their comprehensive work Arms and Armour of the Medieval Knight (Saturn Books, 1996) that “[a knight’s horse] was the most effective and significant weapon the knight had; the basis of his pre-eminent position in society and on the battlefield.”  Please note, however, that while a knight was always a mounted warrior, not every mounted warrior was a knight. Throughout the Middle Ages various forms of mounted fighting men of lower status also existed. Obviously, squires were one such additional category of mounted fighting man (For more about squires see: Indespensible \"Hand-Maidens\" of the Battlefield). But there were also Turcopoles in the Latin East, light cavalry supplied by the native Christian population. In addition, all the military orders had “sergeants” who were issued horses and could fight mounted. This tradition continued in the Hundred Years War as well, where both sides deployed mounted sergeants particularly for reconnaissance, foraging and skirmishing. In short, knights were more than just mounted warriors. Knighthood was both a military function and a social status. Richard Barber summarizes the situation this way: The figure of the knight at once dominates the medieval world and distinguishes it from the classical era. The knight inherited both the lands and status of the magnate of the Roman world in his luxurious villa and the political power of the infantry soldier of the Praetorian Guard. His roots were barbarian; his ideals, born of the three turbulent centuries between the end of the western Empire and the accession of Charlemagne, were in sharp contrast to the Roman order. Above all, two characteristics stand out: in war, he fought on horseback where the Roman legions had fought on foot; in peace, he held his land because he was a skilled fighter. (Barber, Richard. p. 14.) Knights were the very backbone of feudal society. They were the base on which feudal society was built. The ideal or original form of knighthood was of a man holding land (a fief) from a lord in exchange for performing military (and other kinds of) service. The very definition of a “fief” was a land-holding large enough to provide sufficient income to support “a knight” — meaning a fighting unit composed of a knight and at least one of all of the following: destrier, palfrey, pack-horse and squire.  With time, however, other classes of knights evolved. Already by the 12th century there were many landless knights, young men who had the training and received the accolade, but did not receive any land. They were either “freelance,” trying to make their living on the tourney circuit or the like, attached to one of the militant orders (Templars, Hospitallers, Teutonics etc.), or they were “household” knights, i.e. knights in service to one lord or another but receiving room, board and pay (which was often at least partly in the form of clothing (e.g. one winter and one summer mantle, etc.) instead of land for their services. (For more on the different faces of knighthood see my answer to: What are some cool facts and misconceptions about knights?  Finally, it is fair to say that knighthood was inextricably tied to the concept of chivalry. Note, however, that chivalry was always an ideal. It defined the way a knight was supposed to behave. No one in the Middle Ages seriously expected every knight to live up to that ideal, much less all of the time. Even the heroes of chivalric romances usually fell short of the ideal at least some of the time – and many only achieved their goal and glory when they overcame their baser instincts or their natural shortcomings to live, however briefly, like “perfect, gentle knights.” (For more on chivalry see: Defining Chivalry)  For more about knights and chivalry see: Barber, Richard W. The Knight and Chivalry. The Boydell Press, 1970, 1974, 1995.Duby, George. 1985. William Marshal: The Flower of Chivalry. Random House, 1985.Hopkins, Andrea. Knights: The Complete Story of the Age of Chivalry, from Historical Fact to Tales of Romance and Poetry. Quarto Publishing, 1990.and many other sources!Edge, David & John Mills Paddock, Arms and Armor of the Medieval Knight, Saturn Books, 1996And many more! ",
            "date": "Answered March 22, 2019",
            "views": "27",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Francisco Manuel Bernal",
                    "user_href": "/profile/Francisco-Manuel-Bernal"
                },
                {
                    "user_id": "George Patton",
                    "user_href": "/profile/George-Patton-11"
                },
                {
                    "user_id": "Cian Walker",
                    "user_href": "/profile/Cian-Walker"
                },
                {
                    "user_id": "Sung Kim",
                    "user_href": "/profile/Sung-Kim-13"
                },
                {
                    "user_id": "Andrew Jonsson",
                    "user_href": "/profile/Andrew-Jonsson"
                },
                {
                    "user_id": "Martine Van Lookeren",
                    "user_href": "/profile/Martine-Van-Lookeren"
                },
                {
                    "user_id": "David Deitsch",
                    "user_href": "/profile/David-Deitsch"
                },
                {
                    "user_id": "John McEwan",
                    "user_href": "/profile/John-McEwan-13"
                },
                {
                    "user_id": "David Menéndez Hurtado",
                    "user_href": "/profile/David-Menéndez-Hurtado"
                },
                {
                    "user_id": "John Lundquist",
                    "user_href": "/profile/John-Lundquist-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Irving",
                "href": "/profile/Paul-Irving-3"
            },
            "answer_text": "Knights are still around. Here are some - Sir Michael Palin  Sir Michael Caine  Sir Michael Gambon  And one who isn’t named Michael - Sir Ian Mckellen.  I suspect you’re suffering from the delusion that knights all look like this, & everyone who looks like this is a knight -  In reality, at the time armour like the above was worn, the majority of men wearing it did not have the rank of knight. If we look at the muster roll of the army Henry V took to France in 1415, we find that most of the men-at-arms (i.e. the blokes equipped like the one above) were not knights. Some had higher ranks, e.g. there was a king in the English army, at least two dukes, & various other lords. Most were lower-ranked. For example, of the 280 or so men Baron Thomas Camoys took with him, 93 (plus Camoys himself) were listed as men-at-arms. Of those, only nine were knights. 49 were listed as “esquire”, & the rest had no status given. Think about that: fewer than 10% of the fully armoured men in that company were knights. That was normal in Henry’s army. Now please stop calling every man-at-arms a knight. It’s a grave error. ",
            "date": "Answered December 6, 2019",
            "views": "911",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Manory",
                    "user_href": "/profile/Andrew-Manory"
                },
                {
                    "user_id": "Andrew Hagen",
                    "user_href": "/profile/Andrew-Hagen-20"
                },
                {
                    "user_id": "Joseph Denbo",
                    "user_href": "/profile/Joseph-Denbo-1"
                },
                {
                    "user_id": "Eric Platt",
                    "user_href": "/profile/Eric-Platt-9"
                },
                {
                    "user_id": "Edward Hahm",
                    "user_href": "/profile/Edward-Hahm"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Nicholas Liaskos",
                    "user_href": "/profile/Nicholas-Liaskos"
                }
            ]
        }
    ]
}