{
    "title": "How were children dressed in the Victorian era? - Quora",
    "tags": [
        "Victorian Fashion",
        "Victorian Era (1837-1901 AD)",
        "Historical Eras"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Penrose",
                "href": "/profile/Elizabeth-Penrose-1"
            },
            "answer_text": " In 1847, the Prince of Wales toured a naval ship dressed as a cadet. The above painting was copied both in color and in black and white. Tailors were pressed into duty to make these special little outfits. Before this, children occasionally wore military uniforms, but the Prince had started a craze. For the first time, little boys had a distinctive clothing style in England, America, and Australia. In Homer’s painting Crack the Whip, the little boys wear suspenders and long pants, implying the children aren’t rich. But the style stuck, re-enforced when the grown Prince’s sons themselves wore “sailor boy” suits. In the 19th century many prosperous parents had the advantage of cheap fabric and the mass production of sewing machines. (Importation of cotton from India meant that the British mills did not have to support the American system of slave labor.) And the children looked so darling!  Even though many society women had adopted the tight corset, the social sphere was ambivalent about girls wearing it. Some few said that wearing it in childhood made it easier to take on in adulthood. Feminists despised the helplessness it fostered. Doctors knew it could make the user sick. Thus the majority of girls wore shifts and petticoats, without any tight garment underneath. They often wore white shifts and petticoats. When there was no central air conditioning, white clothes were cooler in summer. Cotton and linen were lighter and “more natural” than heavy wool. But girls and young women were also implied to be innocent, virginal. Queen Victoria had been married in white, making it fashionable. What the wash maid said when she was confronted by dirty smocks is not recorded. ",
            "date": "Answered May 4, 2018",
            "views": "27",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Katherine Bailey",
                    "user_href": "/profile/K-R-Bailey"
                },
                {
                    "user_id": "Jared Busby",
                    "user_href": "/profile/Jared-Busby-1"
                },
                {
                    "user_id": "Matt Jepson",
                    "user_href": "/profile/Matt-Jepson"
                },
                {
                    "user_id": "Jonathan Crews",
                    "user_href": "/profile/Jonathan-Crews-2"
                },
                {
                    "user_id": "Deepak Agrawal",
                    "user_href": "/profile/Deepak-Agrawal-119"
                },
                {
                    "user_id": "David Williams",
                    "user_href": "/profile/David-Williams-328"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katherine Bailey",
                "href": "/profile/K-R-Bailey"
            },
            "answer_text": "It depended on their class. The children of the poor wore discarded clothing that they found or were given, whether it fit them or not. Wealthy and middle class children would have their new clothing made by the same seamstress who made their mother’s dresses; but ready-to-wear stores were also on the rise. They might also wear hand-me-downs (if in good shape). Boy and girl babies all wore gowns/dresses, and a boy might be 5 or 6 before he wore short pants. Long pants were for older boys. Girls wore dresses or pinafores, usually to mid-calf until they were almost adults, when they’d put their hair up and lengthen their hems to the floor. ",
            "date": "Answered May 4, 2018",
            "views": "502",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rose Walker",
                    "user_href": "/profile/Rose-Walker-137"
                },
                {
                    "user_id": "Chelsea Edwards",
                    "user_href": "/profile/Chelsea-Edwards-96"
                },
                {
                    "user_id": "Sara Erickson",
                    "user_href": "/profile/Sara-Erickson-5"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                }
            ]
        }
    ]
}