{
    "title": "How can people believe in truths without evidence? - Quora",
    "tags": [
        "Truths of Life",
        "Evidence",
        "Faith",
        "People",
        "Truth",
        "Belief and Beliefs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glen Taylor",
                "href": "/profile/Glen-Taylor-3"
            },
            "answer_text": "Here’s a thought: no one has any belief without evidence. Every belief that a person has is supported by evidence, in some degree or fashion. In fact, if a person holds a belief, then the evidence that they have encountered is sufficient to convince them of that belief. No one chooses beliefs arbitrarily. Now, some, on seeing this claim, will bring up such topics as religious doctrine, urban legends, conspiracy theories, and so on. These represent systems of beliefs that are supposedly “not supported by evidence.” But that’s just not true. Let’s say that you have been raised in a Christian religious community. You were told from a young age such things as “Jesus loves me, this I know, for the Bible tells me so.” The word of one’s elders and community is evidence. Is it evidence that is objectively convincing outside the community? Not generally, but to an individual, it is sufficient. The words of the Bible, plus the concept that the Bible itself is unerring and incorruptible, is evidence. It’s written right there in black and white; there’s no arguing it. Add in social pressure; it is often considered a sign of weak faith or sin to even question religious doctrine. If you have learned that only evil people question the Bible, how likely are you to give any thought to challenging or testing the evidence you have been given? Anything that comes in through your senses is evidence. However, evidence can be interpreted in different ways by different people. To one of the faithful, the words of the Bible are evidence of an all-powerful Creator. To someone outside the faith, they are evidence of the cultural values of certain civilizations found in the Middle East several thousand years ago. In both cases, they are evidence, but the larger picture they serve differs greatly based on other evidence encountered (and accepted) by the viewer. ",
            "date": "Answered June 6, 2017",
            "views": "761",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dallars Kebantshitse Otukile",
                    "user_href": "/profile/Dallars-Kebantshitse-Otukile"
                },
                {
                    "user_id": "Neil Hiatt",
                    "user_href": "/profile/Neil-Hiatt"
                },
                {
                    "user_id": "Bryan Keith Elkins",
                    "user_href": "/profile/Bryan-Keith-Elkins"
                },
                {
                    "user_id": "Viorel Radu",
                    "user_href": "/profile/Viorel-Radu-3"
                },
                {
                    "user_id": "Jordan Rosales",
                    "user_href": "/profile/Jordan-Rosales-3"
                },
                {
                    "user_id": "Haryus Akbar",
                    "user_href": "/profile/Haryus-Akbar"
                },
                {
                    "user_id": "Araf Billah",
                    "user_href": "/profile/Araf-Billah"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Hartanto",
                "href": "/profile/William-Hartanto"
            },
            "answer_text": "Question: How can people have beliefs without evidence? Answer: Evidence is a matter of trust. Most people do not conduct scientific experiments on their own. We trust the papers that have been published by renown scientific journals because we trust in the integrity of the system and the peer review process. And yet scientific research are not perfect. Many of the research cannot be duplicated (think of “Mozart babies” fad that has been disproved now).  Now if you are going into the “conspiracy theories” loony bin, anything goes there: George W. Bush was behind the 9/11 in order to increase US military budget by trillions of dollars (US military budget has been on decline for decades until the rise of recent islamic terrorism, started by Osama Bin Laden, a known CIA funded operative in Afghanistan).Moon landing was a fake because (insert all theories here, flag not falling, Area 51 video shooting, race with Russia’s pressure etc)Hillary Clinton did every crime on the book: murdering government officials, child abuse pizza ring, selling information to (insert any country you want) etc etc.I think the above are lazy thinking. The faulty logic is “this is plausible, hence it may be true.” It is also childish. Like rebellious teens, conspiracy theorists like to be the “odd one out”, standing out because of their uniqueness.  When it comes to religion, the logic is simple: there is power in number If you are the only person on earth who believe what you believe, you are crazy and will be sent to mental hospitalIf you have a few hundred to ten of thousands of people believing what you believe, you are officially member / founder of a cultIf you have a few millions to billions of people believing what you believe, then you are the follower of the one true God.It’s a simple logic: if you are the only sane person in the country of insane people, then you are the crazy one.  And also tradition: most people believe what their parents believe.  ",
            "date": "Answered June 6, 2017",
            "views": "13",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Bueno",
                    "user_href": "/profile/John-Bueno-13"
                },
                {
                    "user_id": "Angela Johnson",
                    "user_href": "/profile/Angela-Johnson-527"
                },
                {
                    "user_id": "Pete Ser",
                    "user_href": "/profile/Pete-Ser"
                },
                {
                    "user_id": "Roberto Martinez",
                    "user_href": "/profile/Roberto-Martinez-118"
                },
                {
                    "user_id": "Bob Elton",
                    "user_href": "/profile/Bob-Elton"
                },
                {
                    "user_id": "Hendrik Daendels",
                    "user_href": "/profile/Hendrik-Daendels"
                },
                {
                    "user_id": "Andrew Wrigley",
                    "user_href": "/profile/Andrew-Wrigley-8"
                },
                {
                    "user_id": "Ekarat Vivek",
                    "user_href": "/profile/Ekarat-Vivek"
                },
                {
                    "user_id": "Aditya Bharadwaj",
                    "user_href": "/profile/Aditya-Bharadwaj-52"
                },
                {
                    "user_id": "Chris Whaley",
                    "user_href": "/profile/Chris-Whaley-24"
                }
            ]
        }
    ]
}