{
    "title": "How accurate were 17th century cannons? - Quora",
    "tags": [
        "Cannons (artillery)",
        "Cannon",
        "17th Century",
        "Guns and Firearms",
        "World History",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Jan Meyer",
                "href": "/profile/Jan-Meyer-21"
            },
            "answer_text": "They could be rather accurate. It depended on how much time you took loading and how good your ammunition was. If you loaded an about round stone, naked, atop of old gun powder your accuracy will be abysmal. But if you got a cast iron ball, almost perfectly round, wrapped it in oakum so it fits tightly into the bore, with new, well-made power, precisely measured, you will get pretty good accuracy out of them as in you will be able to hit the same meter of wall time after time provided you are able to put the gun back on the exact spot you fired it last time (recoil will move it). It is like with muskets: They are not that accurate but you can do a lot about the accuracy if you load it carefully you will be able to consistently hit deer at the outer range of the musket (about 100 meters). ",
            "date": "Answered April 23, 2019",
            "views": "216",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Astrid Ingmarsdottir",
                    "user_href": "/profile/Astrid-Ingmarsdottir"
                },
                {
                    "user_id": "Atanas Arnaudov",
                    "user_href": "/profile/Atanas-Arnaudov"
                },
                {
                    "user_id": "Nicole Leng",
                    "user_href": "/profile/Nicole-Leng-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "James R Barclay",
                "href": "/profile/James-R-Barclay"
            },
            "answer_text": "They weren’t. Each cannon was hand-cast so each one was a little different. Same with the cannon balls. In mass production they were made a little small to allow for the difference in cannon bore sizes. So the ball had a tendency to rattle down the bore as it went out. Cannon balls would get beat up during transport and would rust and corrode out of round and have to be beaten back into round before use, again making them a smaller diameter. This is why a good Cannoneer was so valued. They would know the bore of their cannons and would try and pick the perfect ball for the bore. They knew which powered charge best fit the distance for those individual cannons. In the end it came down to who could get the most iron down range first. ",
            "date": "Answered January 22, 2020",
            "views": "301",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Ali",
                    "user_href": "/profile/Ben-Ali-23"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey-16"
                },
                {
                    "user_id": "Shane Zimmerman",
                    "user_href": "/profile/Shane-Zimmerman-5"
                }
            ]
        }
    ]
}