{
    "title": "How many people where actually involved in the French Resistance during WWII and did they actually had an impact? - Quora",
    "tags": [
        "French Resistance (WWII)",
        "History of France",
        "France",
        "World War II",
        "World History",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Sheppard",
                "href": "/profile/Philip-Sheppard-16"
            },
            "answer_text": "Well officially the French government after the war recognised some 200,000 men and women as being resistance fighters or members roughly about 1% of the adult population. But remember it depends on what sort of thing you class as resistance after all is puncturing the local German sergeants bicycle wheel an act of resistance or deliberately sabotaging a piece of machinery in a factory or is it killing Germans or blowing up railway lines ? If it's the later two then probably only about 30,000 people were involved pretty much all the way through the occupation and mostly in the country and virtually nobody in Paris. But that's not to say that Parisians weren't willing but German security was at its best in the cities. That low number of 30,000 massively increased during 43 and 44 when people realised that the war wasn't going the Germans way and once D Day occurred the numbers became a real thorn in the Germans side tying down thousands of German troops behind the lines . This obviously helped the allies but to what extent is open to many different opinions and caused many reprisals the worst being the massacre at oradour sur glane by the das reich division on their way to Normandy in June of 44 . Numbers of German dead vary from 2000 to 4000 but at a cost of 8000 resistance fighters and many many thousands deported to concentration camps and Germany to work in arms manufacturing. Also they didn't always work in tandem with each other as there was a distrust between different factions such as the communists and those loyal to de Gaulle. This made them less affective and caused unnecessary casualties. Ultimately was it all worth it ? Personally I think so , they caused havoc behind enemy lines tied down troops that could have been used to fight the allies put fear in the Germans having to always watch their backs but ultimately at a very high price. If anything I believe it was worth it for French national pride and that I'm sure to every Frenchmen it was ultimately worth it . Vive la France ",
            "date": "Answered June 15, 2019",
            "views": "150",
            "upvotes": "0"
        }
    ]
}