{
    "title": "How many people die at Machu Picchu? - Quora",
    "tags": [
        "Machu Picchu",
        "Peru"
    ],
    "response": [
        {
            "author_info": {
                "name": "Norman Knowitall",
                "href": "/profile/Norman-Knowitall"
            },
            "answer_text": "Actually there are a lot of myths ranking around the death rate in Machu Picchu. It was certainly very scary to hike the stairs up to Huayna Picchu. And I guess there are a lot of inexperienced hikers going up..so well I guess that leads to the nickname “Stairs of death”. Here is an article that clears up most of them and quotes some actual news sources. http://www.annees-de-pelerinage.com/huayna-picchu-death-toll-and-accidents/ As far as I can see, people have died. But I guess that applies to any other mountain with high traffic. People tend to forget hiking is dangerous (especially when the weather changes quickly) ",
            "date": "Answered August 19, 2016",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Rios G",
                    "user_href": "/profile/Daniel-Rios-G"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Cannon De Borda",
                "href": "/profile/Kelly-Cannon-De-Borda"
            },
            "answer_text": "The stairs I believe you're talking about is the trail up to the top of Huayna Picchu, the tall point seen in the background of so many famous Machu Picchu images.  It's a fairly arduous and vertical climb, and there are no handrails or guardrails to speak of. It isn't unheard of for people to fall. It's been a while since I've actually heard of a tourist falling to their death, but earlier this year it was on the news here in Peru that a landscape worker at the site was killed in a fall. Considering that about 400 people a day make the climb, deaths seem pretty rare.  I made the climb back in 2008, with my husband two children aged at the time 8 and 10.  There were even younger children making the climb with their families.  I think it's a place where caution is definitely in order - but it's not to be avoided out of fear. ",
            "date": "Answered August 25, 2015",
            "views": "187",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Helen Childs",
                    "user_href": "/profile/Helen-Childs-2"
                },
                {
                    "user_id": "Robby Wille",
                    "user_href": "/profile/Robby-Wille-1"
                },
                {
                    "user_id": "Alex Delashmit",
                    "user_href": "/profile/Alex-Delashmit"
                },
                {
                    "user_id": "Kirti Paman",
                    "user_href": "/profile/Kirti-Paman"
                },
                {
                    "user_id": "Mark Kennet",
                    "user_href": "/profile/Mark-Kennet"
                },
                {
                    "user_id": "Sumana Choudhury",
                    "user_href": "/profile/Sumana-Choudhury"
                },
                {
                    "user_id": "Dennis Pettersson",
                    "user_href": "/profile/Dennis-Pettersson-3"
                },
                {
                    "user_id": "Daniel Rios G",
                    "user_href": "/profile/Daniel-Rios-G"
                },
                {
                    "user_id": "Felix Gutierrez",
                    "user_href": "/profile/Felix-Gutierrez-20"
                },
                {
                    "user_id": "Prafful Allamraju (प्रफुल అల్లంరాజు)",
                    "user_href": "/profile/Prafful-Allamraju-प्रफुल-అల్లంరాజు"
                }
            ]
        }
    ]
}