{
    "title": "How did Islam religion originate? - Quora",
    "tags": [
        "Muslims",
        "Islam"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Loughran",
                "href": "/profile/Mark-Loughran-1"
            },
            "answer_text": "On a night late in the sacred month of Ramadan, the night known to Muslims as Laylat-ul-Qadr, the ‘Night of Decree.’ When Satan appeared as an angel of light and choked Mohammed 3 times, stating, read/recite/‘Iqra’ after each choking, but Mohammed could not read, a fact Satan overlooked, so after nearly killing him Satan gave him the first revelation “Read, in the name of thy Lord who created, Created man from a clot of blood. Recite, for thy Lord is most Beneficent; Who taught by the pen, Taught man what he knew not.” Mohammed was then unconscious upon waking up he sprinted out of the cave, absolutely terrified, rightly so and thought he was possessed, his first wife Khadija decided to bring Mohammed to her uncle, a supposed ex christian, and he said ah ah that must be the Angel Gabriel / Jibreil and for 23 years Mohammed kept getting revelations from Satan and first 13 years they were peaceful and a warner, not many converts of “The People of the Book” many arab pagans worshippers, but the final 10 years a totally different Mohammed once he migrated to Medina and formed an army within these 10 years the more militant Islam was forming, an islam we know still exists today, an islam from its inception that denied Jesus Christ and has tried to hijack the God of Abraham, Isaac and Jacob. but Allah and YHWA are not the same. Christ is Life John 3:16 ",
            "date": "Updated August 11, 2020",
            "views": "584",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mary Princess Garnasa",
                    "user_href": "/profile/Mary-Princess-Garnasa"
                },
                {
                    "user_id": "Mark Loughran",
                    "user_href": "/profile/Mark-Loughran-1"
                }
            ]
        }
    ]
}