{
    "title": "How did sailors navigate the open seas before modern day navigation instruments, such as the GPS? - Quora",
    "tags": [
        "Sailors",
        "Navigation Systems",
        "Navigation",
        "GPS Navigation",
        "GPS Devices",
        "Sailing",
        "Global Positioning System",
        "Boats and Ships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Joyce",
                "href": "/profile/Eric-Joyce-7"
            },
            "answer_text": "DRT (Dead Reckoning Track), LORAN and Celestial Navigation. When you leave a port, you know where you are, as you change course and speed it is logged on the Quartermasters chart and log book. With a paper chart, a pencil (always a pencil) and a pantograph one can track where you were and where you’re going. Once out to sea the the DRT will let us know where we are to about a ten mile radius. Obviously if the seas are on your beam you will be pushed off of your desired course. To verify our POSIT (position in latitude and longitude) we can use the LORAN or OMEGA systems. LORAN or OMEGA systems that are a series of navigation transmitters located on the coastline that broadcast a specific signal. The ships receiver is an RDF (radio direction finding) instrument that will tell you the bearing to the transmitter. Find the bearing of two transmitters, and where those bearings cross on the chart is where you are. If you have done the DRT correctly, the electronic signal POSIT will be close to the DRT point. Both LORAN and OMEGA are now fully decommissioned in lieu of GPS. Lastly we will “shoot the stars” (celestial navigation) with a sextant every night to get our best POSIT of the day. Using the sextant to determine the elevation angle to specific star, an accurate clock (the ships chronometer) for ZULU or Greenwich Mean Time and the US Naval Observatory Nautical Almanac we can plot our POSIT to within a nautical mile. Ideally we will shoot three stars in a fifteen minute time frame. The US NAVY likes its redundant redundancies, so paper charts are kept in addition to computer based charts and logs. SINS (Ships Internal Navigation System) has replaced the once formidable spinning gyroscope with a ring laser, but there is still a Binnacle with a magnetic compass on the bridge, The atomic clock time from the GPS is accurate to .3 seconds, yet the three mechanical chronometers are still in the chart room, and they are “wound and compared” daily. Electricity is a fickle mistress, she comes and goes on her terms, but the earth’s magnetic field is forever. Hand wound mechanical clocks, just work without any outside assistance. Just as it got dark last night, it will happen again today, so break out the sextant and almanac, and let’s shoot some stars. ",
            "date": "Answered July 3, 2019",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Scoles",
                "href": "/profile/John-Scoles-1"
            },
            "answer_text": "Well you might be getting confused betwen Navigation (going from A to B) and fixing you position at a set time. You might easlly go from point A to B and never know where you are exactly until you get to B. Fine for a small sail-boat not so good for a supper-tanker. Anyway in the old days they did things the same same as they do now you have any combination of these three options (very simplified) Sight Navigation.you know where you are because you have been here before and you can see where you are. The most basic navigaion. You key in on objects on the land and you know where you are based on that.Not much use once out of sight of land.A young Salish is heading out from Esquimalt BC in her dug-out to visit her boyfriend in S’Klalla. She knows if she keeps Mount Baker one hand width on her left side of the bow of her dugout she will cross the Salish sea and land at about the correct spot.Dead reckoningYou start at point X point you boat at point Z and hope you get there.Very hit or miss without a compass.Zosime from Crete has set out in here small sailing vessel to visit her boyfreind in Athens. She points her boat toward the main-land and hopes she makes it there. She knows that tha sailing with the prevailing wind and tide will get here to the main-land and once there she can then make her way to Athens. If this was the middle ages she may of had a compass that she could use to make her course a little more direct to the main-land. At night she could correct her course by finding the North start (polaris) and going from that.Celestial FixingThis is using a fixed point in the sky to find you position on the earth. You can use the Moon, the Sun, a Star or an artificial satellite ie GPSYou can eaisly find out where you are but without a cumpass to stear you in the right direction you could end up going around in circlesJane sets out from Posthsmouth to visit her boyfriend in Calis. She pilots her sail-boat out of the harbour keeping the green lights on her left and the red lights on her right and then the light at Castle Pile at 180 to stern to keep hershelf mid channel until she passes the yellow light at Outer spit. She then sets her sails and tracks her boat using her compass to stear to the way points she had entered on her GPS.Thus to truly Navigate a ship out at sea you need a little from each of the above. There is also inertial navigation but that is really only used is a few special Military applications ie Boomer Subs. ",
            "date": "Answered July 3, 2019",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Louis Cohen",
                "href": "/profile/Louis-Cohen-1"
            },
            "answer_text": "By open seas I assume you mean out of sight of land. Dead reckoning - you keep track of your course and speed and how long you maintained that course and speed. Add in adjustments for currents (if you know what they are) and leeway (a sailing vesselś tendency to slide downwind when trying not to). Start at a known location and add all these up.Noon sights - at local noon (when the sun is highest in the sky) the angle of the sun above the horizon is your latitude. You get to the latitude of your destination and sail down it until you see it.Polaris - the altitude of the north star is your latitude in the northern hemisphereLunars - for a while, there were complex calculations you could do based on observations of the moon that would yield your longitudeOnce the marine chronometer was developed, the combination of local noon and the chronometer time at Greenwich would yield your longitudeThe chronometer also made celestial navigation possible; Each dawn/dusk sight of a star would give you a line of position ; you were somewhere on that line. Get 3 stars and hopefully the triangle of the 3 lines of position wasn’t too big.",
            "date": "Answered March 6, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Safford",
                "href": "/profile/William-Safford"
            },
            "answer_text": "They used an umber of instruments. Alidale, Nocturnal, Quadrant and Sextant (shown below) are 4 of them. basically they all measured the angle of the sun at a known time, and the locations of certain stars. Today we set the GPS and sail right to the port. Then they guestimated where they were, and then aimed for a point some miles north (or south) of their destination and when they reached land, turned south (or north) to the port they were aiming for. I can use a sextant (the bottom one), but it’s a royal pain in the rear. And I learned when I was 16 and I’m 72 now, so I’ve used one for a while. On the other hand, I love the GPS and SatNav systems.     ",
            "date": "Answered July 3, 2019",
            "views": "117",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Petr Titera",
                    "user_href": "/profile/Petr-Titera-1"
                },
                {
                    "user_id": "Tim Mahoney",
                    "user_href": "/profile/Tim-Mahoney-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonas Alexanderson",
                "href": "/profile/Jonas-Alexanderson"
            },
            "answer_text": "There are some good answers here already but I will add some methods that I used in my early years as a navigator (and some I still use). Radar. This is still today the most important instrument when navigating and for collision avoidance. To take the distance, and direction, to lighthouses, headlands, RACON (Radar beacons and other fixed objects.Decca. A European system similar to Loran C. Decca Navigator System - WikipediaRadio beacons. A type of radio tower that you could home in and get the direction to.Transit. An early satellite system based on the Doppler effect. Transit (satellite) - WikipediaWalker log. A small propeller on a line connected to a clock. Every turn on the propeller made the clock turn and you could measure the travelled distance. https://collections.rmg.co.uk/collections/objects/42936.html",
            "date": "Answered July 3, 2019",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kathy Tesch",
                "href": "/profile/Kathy-Tesch"
            },
            "answer_text": "A sextant ( look it up!). The Vikings were also very clever and used a crystal rock ( forget which kind ) to create the same effect ( calculating the angle of a fixed object like the sun to determine direction. ",
            "date": "Answered July 4, 2019",
            "views": "8",
            "upvotes": "0"
        }
    ]
}