{
    "title": "How did Stalin manage to kill so many people? Who were these people, and why did he do this? - Quora",
    "tags": [
        "Joseph Stalin",
        "Killing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hersh Bortman",
                "href": "/profile/Hersh-Bortman"
            },
            "answer_text": "Anatoly Wasserman: \"There are no repressions on Stalin's conscience!\" Meyerhold wrote denunciations, Tukhachevsky was busy preparing the defeat of the Red Army, and Babel slept with Yezhov’s wife.  Nikita Khrushchev (leftmost) blamed on Stalin all crimes after his death. To the right of the leader in the second row — Georgy Malenkov, Lavrentiy Beria, and Vyacheslav Molotov. Nikita Sergeevich will fire all of them later. He will have Beria shot ASAP without charge or trial. Photo: © Ria \"Novosti\".[https://www.eg.ru/politics/478021/] Surprised? Looks like Wasserman is right. Read, for instance, \nOrigins of the Great Purges by John Arch Getty In his book, Origins of Great Purges published in 1985, Arch Getty argued that the Soviet political system was not completely controlled from the center, and that Stalin only responded to political events as they arose. The book was a challenge to works by Robert Conquest. I did find instructive as well the collective work Victims of the Soviet Penal System in the Pre-war Years (Getty et al) The table below is from that book  Take a glance also at the numbers and diagram below. I got the data from Ann Appelbaum’s “Gulag”.  Now assume the average term 8 years in prison (Solzhenitsyn's sentence). Can you do the math and tell us how many prisoners went thru Gulag in 23 years? A personal note. As you probably know the proportion of political prisoners/plain criminals (rapist and such) was roughly 1:2. Do you feel compassion for the banal highway robbers? I believe, if you are looking for truly innocent victims only, you will reduce the numbers drastically. Unless, of course, you are in the anti-Russian propaganda business. There was a special kind of prisoners. War prisoners. Some of them represented in the Photo below.  Khalid Elhassan’s answer to How did Hitler and his top generals convince German soldiers to commit all those atrocities before and during World War II? If I knew that at least few of those Gulag “victims” were slowly, very slowly frozen to death, maybe then I will raise my prayer to God for the first time in my life. ",
            "date": "Answered September 20, 2018",
            "views": "868",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joze Sveticic",
                    "user_href": "/profile/Joze-Sveticic"
                },
                {
                    "user_id": "Bahan chod",
                    "user_href": "/profile/Bahan-chod"
                },
                {
                    "user_id": "Morley Evans",
                    "user_href": "/profile/Morley-Evans-1"
                },
                {
                    "user_id": "Albert Gareev",
                    "user_href": "/profile/Albert-Gareev"
                },
                {
                    "user_id": "Pavel Lipach",
                    "user_href": "/profile/リパチ-パヴェル-Pavel-Lipach"
                },
                {
                    "user_id": "Konstantin Zhiltsov",
                    "user_href": "/profile/Konstantin-Zhiltsov"
                },
                {
                    "user_id": "Vladimir Lebedev-Schmidthof",
                    "user_href": "/profile/Vladimir-Lebedev-Schmidthof"
                },
                {
                    "user_id": "Roman Galitsun",
                    "user_href": "/profile/Roman-Galitsun"
                }
            ]
        }
    ]
}