{
    "title": "How is Thomas Edison's light bulb still burning? - Quora",
    "tags": [
        "Thomas Alva Edison",
        "Light Bulbs",
        "Lighting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Neumann",
                "href": "/profile/Jonathan-Neumann-3"
            },
            "answer_text": "This is a prime example of what's called planed obselecence. You see, all bulbs could last 100 years. Even with turning them on and off twice a day. Even efficient LEDs. Why don't we have such lighting? Because if we did we would have less than 1/20th the manufacturing industry that we have today profiting off lighting. All the big bulb manufacturers of the day (early 1900) saw this coming and chose essentially to form a “legal cartel”. They thought what chance do I have of being part of the 5% survivor class? The answer for the best among them: not a pleasingly significant chance. So they all met up and decided to only produce bulbs that would last a short time. Literally this happened. I'm not joking when I say legal cartel. Just Google planed obselecence. This is literally the primary example. The result? Humanity only builds 3 year full use bulbs not 50-70 year full use bulbs. Also we have 20 times more people employed in our economy and in the world's economy in the lighting appliance manufacturing sector. Basically some people said that we don't want competition in our market, as we can just meet up and orchestrate a cooperative monopoly instead. By the way politicians love this and defend it fiercely on both sides. They want jobs. Apparently wasting resources and keeping the price of electricity atificially high for all is seen as a positive career. At least the jurisdiction has jobs and people have homes and food, even if they are not useful but draining on society in their work, the source of their earned pedigree. Cooperative unofficial monopolies happen all the time. An example from my life: I can get 1,000,000 grams of vanilla beans for $200 and 5,000,000 grams of saffron for $5,000. If you have any clue as to what the value of that prices out to you get the point. Only an idiot would undercut in this market, or many other markets in every county on earth. Shit, if i can get a deal with a grocery store id be an overnight millionaire. Why turn that 1M into 50k? You will surely make far less if you undercut. Just do the math. Besides you will actually get less business as your customers will assume you have bad product and will buy from the more expensive selection instead. By the way vanilla beans sell at $1 a gram and saffron sells at $5 a gram in relative bulk here in my market the US. The packaging, labor, marketing and shipping cost much more but are negligible as well. It is a huge problem. Our economy is actually incredibly inefficient. ",
            "date": "Updated September 11, 2018",
            "views": "33",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Johnson",
                    "user_href": "/profile/Jim-Johnson-646"
                },
                {
                    "user_id": "Beata Butykai",
                    "user_href": "/profile/Beata-Butykai"
                },
                {
                    "user_id": "David Smyth",
                    "user_href": "/profile/David-Smyth-12"
                },
                {
                    "user_id": "Nagraj Kumar",
                    "user_href": "/profile/Nagraj-Kumar-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Jantzen",
                "href": "/profile/Aaron-Jantzen"
            },
            "answer_text": "It is sad actually. They should turn it off and replace it with an LED bulb. The awful truth is that EVERY incandescent bulb can last basically forever. But lasting forever is not a good thing in this case. Imagine if you have a choice of a bright LED bulb that uses 10 watts, or a very dim old incandescent bulb that puts out 1/40th as much light yet uses 50 watts. Which is better? You would need 40 of these old bulbs to put out as much light, and it would take 2000 watts instead of 10 watts. Do the math. Now the secret: Want an incandescent bulb to last for the next 100 years? Here’s what you do: Install a 100 Watt incandescent bulb designed for 110V in your ceiling, and run a line from a transformer supplying 50V DC (notice how dim the photo of the old Edison bulb is). Never turn it off, keep it running 24/7. That’s it, simple. It won’t be efficient, but it will put out a little light and run for a century or more. And you’ll pay thousands of dollars more in electricity over the next century than if you had bought an LED bulb instead.  ",
            "date": "Answered May 18, 2017",
            "views": "2113",
            "upvotes": " View 1.7K Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Melvin Siow",
                    "user_href": "/profile/Melvin-Siow-1"
                },
                {
                    "user_id": "Salami Guadalupa",
                    "user_href": "/profile/Salami-Guadalupa"
                },
                {
                    "user_id": "Jim Skelton",
                    "user_href": "/profile/Jim-Skelton-2"
                },
                {
                    "user_id": "Pranav VS",
                    "user_href": "/profile/Pranav-VS-10"
                },
                {
                    "user_id": "David Tibbetts",
                    "user_href": "/profile/David-Tibbetts-6"
                },
                {
                    "user_id": "Doug Groves",
                    "user_href": "/profile/Doug-Groves"
                },
                {
                    "user_id": "Alberto Del Brutto",
                    "user_href": "/profile/Alberto-Del-Brutto"
                },
                {
                    "user_id": "Bill Otto",
                    "user_href": "/profile/Bill-Otto-5"
                },
                {
                    "user_id": "Lloyd Stovall",
                    "user_href": "/profile/Lloyd-Stovall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Todorovski",
                "href": "/profile/Nick-Todorovski-1"
            },
            "answer_text": "The carbon filament back then was thicker so it took more time for it to burn out.Manufacturers realized that this is no way to make money so they made it thinner so it burns out quicker forcing you to replace it more often. Other factors include if you run 1/2 the voltage though it you will extend its life.If you have a halogen type gas inside the bulb the gas puts back some of the carbon filament that burnt off Lastly Thomas Edison did no invent the lightbulb, he just made the edison screw fitting which is the main type of fitting used in North America and there are 8 sizes of these. For Candelabras E11 is 11mm wide and used on 240v systemsE12 is 12mm wide and used on 120v systrems SmallE14 is 14mm wide and used on 240v systemsE17 is 17mm wide and used on 120v systems StandardE27 is 27mm wide and used on 240v systemsE26 is 26mm wide and used on 12v systems GiantE40 is 40mm wide and used on 240v systemsE39 is 39mm wide and used on 120v systems And Edison was a jerk who electrocuted stray dogs with AC electricity to scare people off it and promote his DC electrical system. ",
            "date": "Answered June 4, 2017",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Murphy",
                    "user_href": "/profile/John-Murphy-519"
                },
                {
                    "user_id": "Zeynep Özsoy",
                    "user_href": "/profile/Zeynep-Özsoy-1"
                },
                {
                    "user_id": "Jeff Brenner",
                    "user_href": "/profile/Jeff-Brenner-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Brown",
                "href": "/profile/Keith-Brown-137"
            },
            "answer_text": "The fact is that Edison was as much a promoter as an inventor. Until improvements in creating a vacuum inside incandescent light bulbs were developed, Edison’s early light bulbs had a life of less than an hour. So when he invited the press to witness his marvelous light bulb at the 1893 World Fair in Chicago, each member of the press was granted a private 20 minute audience. Between audiences, the leaky bulbs were replaced. The equivalent of early 19th century “fake news” was that Edison’s incandescent bulb burned for days on end. Meanwhile Edison had a small army of people at Menlo Park perfecting the light bulb that eventually made him a very rich man. He would lose his fortune trying to corner the iron ore market using ore mined in New Jersey, in the years immediately preceding the development of the Mesabi Range. I don’t mean throw shade on one of the greatest inventors of all time, but Thomas Edison had far more failures than successes. Aside from learning from his mistakes, Edison also new how to sell his ideas. ",
            "date": "Answered July 20, 2017",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "David Gregory",
                    "user_href": "/profile/David-Gregory-34"
                },
                {
                    "user_id": "Cynthia Shaeffer",
                    "user_href": "/profile/Cynthia-Shaeffer-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Albert-Dock-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Iodice",
                "href": "/profile/Robert-Iodice"
            },
            "answer_text": "Here's a live cam of the bulb:http://www.centennialbulb.org/cam.htmand here's the Wikipedia page on it:https://en.wikipedia.org/wiki/Centennial_Light It's still burning due to a lucky combination of factors:1) Quality control wasn't that good 100+ years ago, so when it was made it was inadvertently built for a higher voltage (180v? 210v? More? It's anybody's guess);2) The lamp is in a location not subjected to physical abuse so it gets to sit there and \"burn-on\";3) The power supplied to it is relatively good: It is AC power but not wildly fluctuating, it doesn't suffer from a lot of surges in power, and there aren't a lot of inductive devices attached that are inducing 'noise' into the circuit. Here's a fact sheet on it:http://www.centennialbulb.org/facts.htm ",
            "date": "Answered July 31, 2016",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Jeff Brenner",
                    "user_href": "/profile/Jeff-Brenner-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alano Stolf",
                "href": "/profile/Alano-Stolf"
            },
            "answer_text": "Any lamp, bulb or LED could last forever (at least till the owner is gone). They last as much as who make them want. If they last forever, nobody would buy often. The manufacturer can adjust the alloy , thickness, etc. to give it an approximate lifetime. What make a bulb light dead is mainly to switch it on. If you turn it on when the AC current is at peak (it goes from 0 to ~155Volts 120 times per second) you stress the filament and reduce its life. Since it happens randomly, the lifetime is estimated (still programmed).With LED lamps it is even easer to program the lifetime. Most of them have the drice circuit dead but the LED still works! They do it with everything. What most reduce lifetime is the fact of switch on! This happens with your car too. It’s motor could last 3 times more miles if you run continuously, like taxis (their motors last much more miles). Some computer servers have extended warranty is they are used always ON (based mainly on hard disks mechanical startup stress). If that Edison bulb was daily turned off, got cold and ON again, it probably would be dead many years ago! ",
            "date": "Answered May 30, 2017",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashish Nanavati",
                    "user_href": "/profile/Ashish-Nanavati"
                },
                {
                    "user_id": "Jeff Brenner",
                    "user_href": "/profile/Jeff-Brenner-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loring Chien",
                "href": "/profile/Loring-Chien"
            },
            "answer_text": "You are probably referring to this:  described here: Centennial Light That is NOT Thomas Edison’s bulb. It was manufactured by Shelby Electric. in the 1890s. It amazes people but we electrical engineers know you can run incandescent bulbs at greatly reduced voltages or current and they will last practically forever but put out just a pretty useless glow. The lifetime is extended exponentially greatly beyond a linear extrapolation of the voltage ratio. Somehow the filament got very resistive and only allows enough current for a dim glow as evidenced by the picture. I’m not impressed. I could do the same thing, but it would take me 120 years to prove it to anyone. ",
            "date": "Updated October 9, 2016",
            "views": "812",
            "upvotes": " View 782 Upvoters",
            "upvoters": [
                {
                    "user_id": "Himanshu Bhushan",
                    "user_href": "/profile/Himanshu-Bhushan-49"
                },
                {
                    "user_id": "Dave Lindbergh",
                    "user_href": "/profile/Dave-Lindbergh"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Melvin Siow",
                    "user_href": "/profile/Melvin-Siow-1"
                },
                {
                    "user_id": "Salami Guadalupa",
                    "user_href": "/profile/Salami-Guadalupa"
                },
                {
                    "user_id": "David Tibbetts",
                    "user_href": "/profile/David-Tibbetts-6"
                },
                {
                    "user_id": "Ahmed Ramadan",
                    "user_href": "/profile/Ahmed-Ramadan-159"
                },
                {
                    "user_id": "Sabates Eye Centers",
                    "user_href": "/profile/Sabates-Eye-Centers-1"
                },
                {
                    "user_id": "Alberto Del Brutto",
                    "user_href": "/profile/Alberto-Del-Brutto"
                },
                {
                    "user_id": "Cristian M. Ioan",
                    "user_href": "/profile/Cristian-M-Ioan"
                },
                {
                    "user_id": "Nelson Cunnington",
                    "user_href": "/profile/コニンゴトン-ネルスン-Nelson-Cunnington"
                },
                {
                    "user_id": "Monica McCoy",
                    "user_href": "/profile/Monica-McCoy"
                },
                {
                    "user_id": "Redwan Hasan",
                    "user_href": "/profile/Redwan-Hasan-2"
                },
                {
                    "user_id": "Qasim Khan",
                    "user_href": "/profile/Qasim-Khan-91"
                },
                {
                    "user_id": "Julian R",
                    "user_href": "/profile/Julian-R-5"
                },
                {
                    "user_id": "Tyler Meszes",
                    "user_href": "/profile/Tyler-Meszes"
                },
                {
                    "user_id": "DeJuan Stevens",
                    "user_href": "/profile/DeJuan-Stevens"
                },
                {
                    "user_id": "Ilham Dwiyanto Emzar",
                    "user_href": "/profile/Ilham-Dwiyanto-Emzar"
                },
                {
                    "user_id": "Pete Trott",
                    "user_href": "/profile/Pete-Trott"
                },
                {
                    "user_id": "Philip Lacombe",
                    "user_href": "/profile/Philip-Lacombe-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lance Pickup",
                "href": "/profile/Lance-Pickup"
            },
            "answer_text": "I’ll add to the other excellent answers that point out that the bulb you are probably referring to is being run at a very low voltage and continuously, to avoid sudden surges of current you get when turn a light on, and is the point where most bulbs do eventually fail. Prior to 1924 light bulbs were made that lasted much longer than bulbs after 1924. The reason is that light bulb makers got together in 1924 and formed a cartel that mandated the standard 1,000 hour lifetime for bulbs (see The Great Lightbulb Conspiracy). And while the cartel has long since disbanded, we have lived with the results of that until CFL and LED bulbs with longer lifetimes became more prevalent. ",
            "date": "Answered January 20, 2017",
            "views": "43",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Cynthia Shaeffer",
                    "user_href": "/profile/Cynthia-Shaeffer-1"
                },
                {
                    "user_id": "Anandam Kankanala",
                    "user_href": "/profile/Anandam-Kankanala"
                },
                {
                    "user_id": "Juho Salokangas",
                    "user_href": "/profile/Juho-Salokangas-1"
                },
                {
                    "user_id": "Ashish Nanavati",
                    "user_href": "/profile/Ashish-Nanavati"
                },
                {
                    "user_id": "Zeynep Özsoy",
                    "user_href": "/profile/Zeynep-Özsoy-1"
                },
                {
                    "user_id": "Markus Greb",
                    "user_href": "/profile/Markus-Greb"
                },
                {
                    "user_id": "Akshat",
                    "user_href": "/profile/Akshat-124"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        },
        {
            "author_info": {
                "name": "P. Everseeker McCarthy",
                "href": "/profile/P-Everseeker-McCarthy"
            },
            "answer_text": "is being run at a very low voltage (50v) and continuously, to avoid sudden surges of power draw you get when turn a light on(The Filament only moves when it is heating/cooling… it flexes and contracts), and is the point where most bulbs do eventually fail. Think about it… How often does a light just… wink out… vs. how often does a light “blow” riiight as you flip the switch in the room ON. Or, you go into a room where the light USED to be working fine, but this time, when you flip the switch… nothing (It fell apart as it cooled/contracted last time you turned it off) ",
            "date": "Answered May 30, 2017",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Jorge Santiago",
                    "user_href": "/profile/Jorge-Santiago-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Lundgren",
                "href": "/profile/Kenneth-Lundgren"
            },
            "answer_text": "Incandescent bulb design is a tradeoff between efficiency and lifetime. If you design the bulb to run cooler (equivalent to reducing the voltage) it will last much longer, but will be less efficient, so it will use more electricity for the same brightness, The additional cost of the electricity is much more than the cost of the bulb. You can buy “long-life” bulbs, rated for 2000 hours, or you can buy standard bulbs rated for 1000 hours. (At least you used to be able to) You will find that the 1000 hour bulbs are much brighter than the 2000 hour bulbs for a given wattage. Photographers used to use “photoflood” bulbs which were very white and very bright. But they only lasted 6 hours. You can also buy 130V bulbs, which are fairly dim on 120V, but last much longer. ",
            "date": "Answered August 9, 2017",
            "views": "686",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "John Mccullough",
                    "user_href": "/profile/John-Mccullough-28"
                },
                {
                    "user_id": "John Murphy",
                    "user_href": "/profile/John-Murphy-519"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eugene Cottle",
                "href": "/profile/Eugene-Cottle"
            },
            "answer_text": "Nearly every Reliability Engineer (I can’t verify this) will tell you that Everything Fails. Eventually. (Can’t really verify this, either, but I’ve never yet been proven wrong.) The physical life of components is typically quantified in either operating time or cycles. The life of electronics and electrical components especially depend more on the number of power cycles than on operating time. If the bulb is rarely powered on and off then, while it won’t last forever, it will last long enough for all practical purposes. ",
            "date": "Answered June 7, 2017",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Smurdly",
                "href": "/profile/Bob-Smurdly"
            },
            "answer_text": "The thing about that bulb is, it is very inefficient converting electricity to light. The filament does not get hot enough to make a bright white light, so it i it does not use itself up, like a modern incandescent (though incandescent at its best is only about 1/10th the efficiency of LEDs) . There isn’t any magic or “lost Edison secret”. ",
            "date": "Answered October 26, 2016",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rick Leeke",
                    "user_href": "/profile/Rick-Leeke"
                },
                {
                    "user_id": "Jeff Brenner",
                    "user_href": "/profile/Jeff-Brenner-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Harris",
                "href": "/profile/Daniel-Harris-146"
            },
            "answer_text": "Success comes to the hardworking; during his most productive years, it is said that Edison worked for more than 18 hours a day! It was his passion for his work that kept him going. He practiced the theory of there is no substitute for success, except for hard work and sound thinking. “Our greatest weakness lies in giving up. The most certain way to succeed is always to try just one more time.” Source: 15 Amazing Facts About Thomas Edison ",
            "date": "Answered December 16, 2016",
            "views": "253",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arnold Goldman",
                "href": "/profile/Arnold-Goldman"
            },
            "answer_text": "I did not know that Thomas Edison’s light buld was still alight. If it is, it can only be because it is being operated on a lower voltage than it was designed for and is not operating at the designed brightness. 1000 hours would have been a good life for most tungsten filament lamps. ",
            "date": "Answered July 29, 2016",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Moulds",
                "href": "/profile/Mark-Moulds"
            },
            "answer_text": "I don't I don't think it's his first lightbulb but one of the first ones that he made is still burning in Greenfield Village in Dearborn Michigan ",
            "date": "Answered October 13, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Petersen",
                "href": "/profile/Michael-Petersen-22"
            },
            "answer_text": "I have a halogen bulb made for 220V running at 110v. It's been turned on nearly non stop and dimmed for over 20 years. I have a feeling it will last for another 100 years this way. Lightbulbls can all last forever. ",
            "date": "Answered June 24, 2017",
            "views": "138",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lizz Grace",
                    "user_href": "/profile/Lizz-Grace"
                }
            ]
        }
    ]
}