{
    "title": "How effective was the American DUKW, or Duck, amphibious vehicle in World War II? - Quora",
    "tags": [
        "Military History of the United States of America",
        "Military Technology",
        "Vehicles",
        "World War II",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Soutar",
                "href": "/profile/Steve-Soutar-1"
            },
            "answer_text": "I’ve never come across any criticism of them - so by that measure they were successful. Basically the DUKW is US 2 1/2 ton truck built to float. They were used in Landings at Sicily and at Normandy, able to drive right up the beaches to unload like any other truck, then back into the water to ferry the next load off one of the larger landing ships laying up offshore. they were also used for river crossings such as the Waal at Nijmegen, and later in the crossing of the Rhine into Germany itself. Some were also used by the US Marines in the Pacific campaign, along with other amphibious vehicles such as the Buffalo. You still a DUKW occasionally at historic vehicle rallies, and there always one or two driving down to Portsmouth for the D-Day memorial events each year, in among the Jeeps and the Deuce and Halfs ",
            "date": "Answered October 16, 2018",
            "views": "126",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeremy Lowe",
                    "user_href": "/profile/Jeremy-Lowe-3"
                },
                {
                    "user_id": "Erik van Garderen",
                    "user_href": "/profile/Erik-van-Garderen-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Straus",
                "href": "/profile/Ian-Straus"
            },
            "answer_text": "It was great! Note that this was a logistical vehicle, not a combat vehicle. Its purpose was to transport supplies inland without a battalion of longshoremen on the beach, also without the delay of transloading from boat to truck, also without a pile of ammunition exposed on the beach that would be a target. DUKW | Facts, History, & Specifications ",
            "date": "Answered October 15, 2018",
            "views": "74",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Soutar",
                    "user_href": "/profile/Steve-Soutar-1"
                },
                {
                    "user_id": "Erik van Garderen",
                    "user_href": "/profile/Erik-van-Garderen-1"
                }
            ]
        }
    ]
}