{
    "title": "How does electricity make light? - Quora",
    "tags": [
        "Visible Light",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Janeen Hu",
                "href": "/profile/Janeen-Hu"
            },
            "answer_text": "I will act as though you don't know anything about electricity and explain a bit. Michael Faraday in the 1800s was apprenticed to make experiments with electricity. He did not have a university education, but was brilliant. He found that if you wiggled a magnet along a coiled wire of metal that can conduct electricity that an electric charge would result in the wire automatically just by moving the magnet. Also, you could move the wire and not the magnet and make electricity. The faster you oscillated the magnet, the more electricity you got. This is electrical induction. Electricity could also be made by creating a battery with an anode and cathode and was called a photochemical cell. You can look these up on YouTube. Scientists saw that fine filaments of metal would light up when electrical current was run through them, but the fine filament of metal would quickly burn up. However, they found experimentally when they put an electric circuit in a vacuum tube in the laboratory the metal would not burn up. They are called these cathode ray tubes and this is how they discovered electrons. So running an electric current through a filament of wire automatically causes it to glow. Putting it in a vacuum tube makes it last longer. Voila! You invented the lightbulb. Light bulbs began to be manufactured. The big race in lighting was between Edison and Westinghouse. A very interesting history culminating in 1983 with Tesla lighting up the World’s Fair all night with light bulbs everywhere. No one had seen anything like it. ",
            "date": "Answered March 20, 2017",
            "views": "23",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joan Forner Arener",
                    "user_href": "/profile/Joan-Forner-Arener"
                },
                {
                    "user_id": "Widi Yanto",
                    "user_href": "/profile/Widi-Yanto-1"
                },
                {
                    "user_id": "Monika Kumari",
                    "user_href": "/profile/Monika-Kumari-268"
                },
                {
                    "user_id": "Bramhatanu Banerjee",
                    "user_href": "/profile/Bramhatanu-Banerjee"
                },
                {
                    "user_id": "Brad Kelly",
                    "user_href": "/profile/Brad-Kelly-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth D. Oglesby",
                "href": "/profile/Kenneth-D-Oglesby"
            },
            "answer_text": "From MC Physics, an electric current of negative charged electrons moving through a wire or gas creates a moving electric force around each electron as they move. Those electric charge forces increase the vibration (seen mostly as heat) of the atoms in that wire which causes the emission of photons particles (radiation) that are in all matter, some of those photons given kinetic energy escape the surface to become light that you see. Other photons remain in the material and deliver their kinetic energy to cause heat (more vibrations). ",
            "date": "Answered March 20, 2017",
            "views": "503",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brad Kelly",
                    "user_href": "/profile/Brad-Kelly-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brent Meeker",
                "href": "/profile/Brent-Meeker"
            },
            "answer_text": "Light is a vibration of the electromagnetic field in the small frequency range our eyes are sensitive to. So in a sense light is made of electricity. Most light is made by disturbing electrons in matter so they change their energy state, which produces the ripple in the electric field we see as light. Hot things glow because heat is energy of molecules and when they collide with sufficient energy this knocks the outer electrons of the molecules into different energy states. But cool things can also emit light, like fireflies, by a chemical reaction that changes the electron energy in a jump big enough to make visible light. Other charged particles, like protons and muons, can also cause light because they also interact with the electric field, but they do so less commonly. ",
            "date": "Updated August 8, 2019",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joan Forner Arener",
                    "user_href": "/profile/Joan-Forner-Arener"
                },
                {
                    "user_id": "Indy Higuet",
                    "user_href": "/profile/Indy-Higuet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Curt Weinstein",
                "href": "/profile/Curt-Weinstein"
            },
            "answer_text": "Electricity can make light in a variety of ways. Run electricity through a wire. The wire gets hot. If it cannot cool, it will eventually glow. Incandescent bulb!Run electricity through some gas. The molecules get “excited” and then they drop down into their ‘rest” state, giving off light. Neon bulb!Sometimes the light is ultraviolet, not visible, but that hits a fluorescent coating which in turn gives visible light. Fluorescent light.Sometimes you run a voltage against a diode. Some of them emit light. LED.In all cases, electrons are kicked up (take in energy) and fall back (give off energy — light). ",
            "date": "Answered March 20, 2017",
            "views": "496",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shreya Chand",
                "href": "/profile/Shreya-Chand-13"
            },
            "answer_text": "When a light bulb connects to anelectrical power supply, anelectrical current flows from one metal contact to the other. As the current travels through the wires and the filament, the filament heats up to the point where it begins to emit photons, which are small packets of visible light. While in the atmosphere The energy from the ultravioletlight is absorbed by the fluorescent coating inside the fluorescent lamp and re-emitted as visible light. The light emitted by a gas, when an electric current flows through it, results from collisions between atoms in the gas and electrons of the current. ",
            "date": "Answered January 8, 2019",
            "views": "303",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Navdeep Singh",
                "href": "/profile/Navdeep-Singh-1490"
            },
            "answer_text": "light appears due to heating of resistance when electricity is passed through it or it may appear when current is passed thorugh a light emitting p-n junction. Light in tube light appears as medium is ionized on passing of current and radiation emitted and it strikes on a material coated inside the surface of glass. ",
            "date": "Answered January 8, 2019",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Derron Ong",
                "href": "/profile/Derron-Ong"
            },
            "answer_text": "Well, the “sparks” that you see aren’t actually the electricity itself. (Actually, you can’t “see” electricity because its not a physical object, rather a side effect of movement and interaction of charged objects) The sparks are the ionized gases that form when electrons pass trough the air. The reason why they glow? THOSE THINGS ARE HOT AS FUQ The reason why they are hot? Friction coming from the movement of electrons ",
            "date": "Answered January 8, 2019",
            "views": "232",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kartik Gupta",
                "href": "/profile/Kartik-Gupta-502"
            },
            "answer_text": "-5 ",
            "date": "Answered January 8, 2019",
            "views": "48",
            "upvotes": "0"
        }
    ]
}