{
    "title": "How did the Hindu religion get started? - Quora",
    "tags": [
        "Hinduism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aatman Mehta",
                "href": "/profile/Aatman-Mehta"
            },
            "answer_text": "The Ikshvaku clan is said to have begun from the 1st Tirthankar Rushabhdev (Rishabh Dev (ऋषभदेव) or Adinatha (आदिनाथ); other names used: Rishabh, Rishabhanāth, Rushabh, Rushabhdev, Adinath or Adishwar; Sanskrit meaning \"best, most excellent\"] who is regarded as the first King on the earth of this Avsarpini cycle. Ikshvaku name of this clan was given by Lord Saudharmendra. When Tirthankar Rushabhdev was one year old, Lord Saudharmendra came to Rushabhdev's father, Nabhi for formalizing the family name. He carried sugarcane in his hand and baby Rushabh was sitting in his fathers lap. When Rushabh saw the sugarcane he eagerly extended his tiny hands to grab it. Lord Saudharmendra gave the sugar-cane to the baby and seeing his affinity for sugarcane, he formally named the family as Ikshvaku/House of Ikshvaku. Most Thirthankaras of Jainism belong to the House of Ikshvaku, and few from other clans. The Ikshvaku dynasty has a significant place in Jaina tradition, as 22 Tirthankaras were born in this royal house. The first Tirthankar Rushabhdev was son of Ikshvaku King Nabhi. The second Tirthankar, Ajitanatha, son of Ikshvaku King Jitashatru was cousin of Sagara. Rushabh has been mentioned in the Hindu text of the Bhagavatha-Purana as an avatar of Lord Vishnu. He is mentioned in all the Vaishnava/Shaiva Puraņas, as well as in some other texts. According to the Bhāgavata, he was born to show the people of this world the path of salvation. According to Jain beliefs, Rushabh - born to King Nabhi Raja and Queen Marudevi at Ayodhya in the Ikshvaku clan - existed before civilization developed. He taught people agriculture, tending of animals, cooking, and more. He had one hundred and one sons. His eldest son - Bharat - was achakravarti king - the conqueror of the known world. In the later part of his life he retired to become a monk and attainedmoksha. Since he became a Siddha (liberated soul which has destroyed all of its karma), he is occasionally worshipped. According to the Jain beliefs, India was named \"Bhārata-varsha\" or \"Bhārata\" after him. His second son was Bahubali, whose statue stands atShravanabelagola, Karnataka as well as atKarkala. Marudevi, mother of Adinath (Rushabh) was the first person to achievemoksha - even before Rushabh himself. Rushabh's grandson Marichi's soul later became Mahavira. He attained 'Kevalgnan' or infinite knowledge at Palitana and attained liberation (Moksha) at Ashtapad mountain inHimalayas. According to Jain beliefs, Rushabh was the first Tirthankar of the present age (Avasarpini). Because of this, he had the name of Ādināth - the first lord. ",
            "date": "Answered April 1, 2018",
            "views": "104",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Niel Kumar",
                    "user_href": "/profile/Niel-Kumar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "S Shukla",
                "href": "/profile/S-Shukla-21"
            },
            "answer_text": "There is no such religion as 'Hindu'. Hindu is actually a name for the group of people who lived near river 'Sindhu' and they used to follow the religion 'Sanatan Dharma'. Sanatan dharma has the only principle of 'belief' and ‘karma’. So the people who had belief in karma - doing good and hence getting good in return, later called to be a religion 'Sanatan Dharma' which is often called Hinduism. In Hindu religion, we worship several deities whom we refer as the one who keeps a watch over our karma and hence decides the results for the same. We have Vedas, which include all the teachings and motivate people to be good at deeds. These teachings are in the form of various stories/epics which conclude the basic moral- “Everyone has to bear their karmas. Even the God whom we pray, have to pay for it. The only way is to do good deeds so you always get the good results for the same.” ",
            "date": "Answered March 28, 2018",
            "views": "189",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Subham",
                "href": "/profile/Subham-110"
            },
            "answer_text": "There is no perfect definition of hinduism You can't tell people who are vegetarians are Hindus (aghoris eat dead human meat, live in crematoriums, bath with ashes etc etc) We are polytheistic, monotheistic, animistic, etc etc All ways lead to one God We can be peaceful as well as violent when needed But a hindu can never be ignorant about science. Hindus respect subjects like medicine, yoga, healthcare(we invented surgery and ayurveda), mathematics (Vedic mathematics), metallurgy, bombs ( chanakya invented the first explosives, and he attributed his findings to the verses in Vedas), weaponry etc So I guess hinduism existed ever since people began to learn about nature. ",
            "date": "Answered March 28, 2018",
            "views": "274",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vladimir Modi",
                    "user_href": "/profile/व्लादिमीर-मोदी-Vladimir-Modi"
                },
                {
                    "user_id": "Prasoon Singh",
                    "user_href": "/profile/प्रसून-सिंह-Prasoon-Singh"
                },
                {
                    "user_id": "Vijay Prasad",
                    "user_href": "/profile/Vijay-Prasad-37"
                },
                {
                    "user_id": "D Mukherjee",
                    "user_href": "/profile/D-Mukherjee-8"
                },
                {
                    "user_id": "Amey Tiwari (अमेय तिवारी)",
                    "user_href": "/profile/Amey-Tiwari-अमेय-तिवारी"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neelam Gopinath",
                "href": "/profile/Neelam-Gopinath"
            },
            "answer_text": "What is the definition of Hinduism ? To your question i would say Firstly Hindu is a way of Life, Nothing is to be done to live as Hindu Meaning to become Christain one need to Baptise ,Circumcision for Moslem Amrit Ceremony for Sikh , Jyukai for Buddhist etc , Vedic religion was by use age called as Hinduism by the invaders from West Meaning people living between Himalayas and Indus River turning short to HINDUS This practice was followed as early as 3000 years before ",
            "date": "Updated April 2, 2018",
            "views": "188",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prasoon Singh",
                    "user_href": "/profile/प्रसून-सिंह-Prasoon-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srinivasaraghavan Sridharan",
                "href": "/profile/Srinivasaraghavan-Sridharan"
            },
            "answer_text": "There is no ‘HinDu religion’, but only sanATanaDharma which is never startted. It always exists and is only followed, by who ever wishes to. ",
            "date": "Updated January 13, 2019",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prasoon Singh",
                    "user_href": "/profile/प्रसून-सिंह-Prasoon-Singh"
                }
            ]
        }
    ]
}