{
    "title": "How did Assyria survive the Bronze Age collapse? What features did it have that the Hittites or Mycenaeans didn't? - Quora",
    "tags": [
        "Mycenaean Greece",
        "Hittites",
        "Assyria",
        "Bronze Age"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kurt Scholz",
                "href": "/profile/Kurt-Scholz"
            },
            "answer_text": "The Old and the Neo-Assyrian empire were both trade empires. They had an organized trade that acquired them metals and an military production complex that turned it into mass armaments. Of the Middle Assyrian period fairly little is known except that Assyria became a very tiny state. There's a continuation of terms used in trade, making it likely that the Assyrian state continued to provide metal. Just like the neo-Hittite states and Egypt that reemerged after the crisis, the Middle Assyrian empire was ethnically unified and could make community decisions. Larger empires lacked that capability by having to subdue foreigners. The Bronze Age was characterized by a small elite monopolizing access to metal and providing a class of trained, armed and armoured fighters that maintained this access. The Iron Age sees this elite centric combat replaced by mass centric combat with more widely available metal outside the tin trade routes. Assyria's elite managed this transition better than others and reemerged as the nation with the best concept for an Iron Age military.  Massed foot archers gained importance over mobile archers on chariots during the transitional phase. The Neo-Assyrian empire after the transition sees the emergence of mounted archers and spearmen on horseback and the rise of heavy infantry with spears, shields and armour. But this happens after the Assyrians had figured out in the Middle Assyrian period how to make their footsoldier levy more effective and content with the situation. It's disputed how much of a role the Sea People played, destruction layers are selective and no large scale population replacement can be detected in ceramics. The time of the Sea People is assumed to have been in part destruction due to a series of revolutions against the old elite controlling tin and bronze. Assyria was in this setting able to forge politics that prevented revolution. The crucial difference lies in how content people were with their overlords. ",
            "date": "Answered August 19, 2020",
            "views": "111",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "Peter Knutsen",
                    "user_href": "/profile/Peter-Knutsen-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Almendra",
                "href": "/profile/Jason-Almendra"
            },
            "answer_text": "The Assyrians were the first people to breed horses large enough to be ridden by a warrior. They bred them in significant numbers to have mounted units. They had light lancers & mounted archers. The Battle of Kadesh fought in 1274 BC was the last great chariot battle. Assyria was also further up in Mesopotamia & was not really reliant on canals for irrigation. The Sea Peoples were mostly seaborne light infantry.    ",
            "date": "Answered August 18, 2020",
            "views": "218",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oliver Castillo",
                    "user_href": "/profile/Oliver-Castillo-2"
                },
                {
                    "user_id": "Andrei Stoica",
                    "user_href": "/profile/Andrei-Stoica-65"
                },
                {
                    "user_id": "Conor Quincey",
                    "user_href": "/profile/Conor-Quincey"
                },
                {
                    "user_id": "George Andrew Leiter Doolittle",
                    "user_href": "/profile/George-Andrew-Leiter-Doolittle"
                },
                {
                    "user_id": "Matthew Salerno",
                    "user_href": "/profile/Matthew-Salerno"
                },
                {
                    "user_id": "Antonio Luiz Musa De Noronha",
                    "user_href": "/profile/Antonio-Luiz-Musa-De-Noronha-1"
                },
                {
                    "user_id": "Gary Stevens",
                    "user_href": "/profile/Gary-Stevens-82"
                },
                {
                    "user_id": "Dong-Yoon Lee",
                    "user_href": "/profile/Dong-Yoon-Lee"
                },
                {
                    "user_id": "Jesse Spangler",
                    "user_href": "/profile/Jesse-Spangler"
                },
                {
                    "user_id": "Keith Allum",
                    "user_href": "/profile/Keith-Allum"
                }
            ]
        }
    ]
}