{
    "title": "How did Ambrose Bierce die? - Quora",
    "tags": [
        "Ambrose Bierce (author)",
        "History of Mexico",
        "People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ricardo Suasnavar",
                "href": "/profile/Ricardo-Suasnavar"
            },
            "answer_text": "His unhappy marriage and daily boredom led him to miss his youth adventures. In october 1913. seventy year old Bierce left Washington D.C. to scout the old U.S. Civil War battlefields. In december he crossed the Mexican border via El Paso, TX, as you probably know, Mexico was then struggling through a revolution. So he joined Pancho Villa's army as an observer. He made it to Chihuahua, were all track of him is lost. The last sign of him is a letter he wrote to an intimate friend, dated December 26th. Before leaving Washington, in a letter dated October the first, 1913, he wrote to one of his relatives:  Goodbye. If you hear i've been executed by a firing squad against a mexican stone wall, please understand i think it is a really good way out of this life. It's better than oldiness, sickness or falling down the stairs: Being a gringo in Mexico, that is eutanasia! The Encyclopaedia Britannica says he could have been murdered in the Ojinaga Battle (January 1914). Actually, a document about the battle reports the dead of an old gringo. The commonly accepted year of his death is 1914. The oral tradition of Sierra Mojada (Coahuila), transcripted by the priest Jaime Lienert, says that Bierce was executed by a firing squad in the town's cemetery. ",
            "date": "Answered July 4, 2012",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Way",
                    "user_href": "/profile/Tony-Way-1"
                },
                {
                    "user_id": "Jonathan Grimm",
                    "user_href": "/profile/Jonathan-Grimm"
                },
                {
                    "user_id": "Fran Jaime Rivera",
                    "user_href": "/profile/Fran-Jaime-Rivera"
                },
                {
                    "user_id": "Helena Štěpánová",
                    "user_href": "/profile/Helena-Štěpánová"
                },
                {
                    "user_id": "Monica Tulock",
                    "user_href": "/profile/Monica-Tulock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Berkley Easterbrook",
                "href": "/profile/Alexander-Berkley-Easterbrook"
            },
            "answer_text": "The story that I read was that he was tired of living and he went off and visited his daughter in Washington, D.C. and then disappeared into Mexico. He reportedly said the following: “A Yankee in revolutionary Mexico. Ah! That’s euthanasia.” So, supposedly he went to revolutionary Mexico to be killed. I don’t think anyone knows what happened to him. ",
            "date": "Answered August 22, 2020",
            "views": "38",
            "upvotes": "0"
        }
    ]
}