{
    "title": "How did Ghenghis Khan unite all the mongol tribes under him? - Quora",
    "tags": [
        "Genghis Khan",
        "Mongol Empire"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rashid Khan",
                "href": "/profile/Rashid-Khan-289"
            },
            "answer_text": "Ooooh thank god their is someone who have some interest in world History from indian. the most of indian whom i met are just horrible about history they think indian history is the only history in this world. Ok sorry let's come to the point so i Really glad to answer this question so let's Start guys. Genghis Khan and the Unification of Mongolia  (the khurilitai of 1206 C.E., conferring upon Temujin the title Genghis Khan) In 1206 C.E, at the headwaters of the Onon river, near the Khentii mountain range in what is now called Mongolia, a tribal council called a khurilitai met to officially recognize their young ruler, Temujin-Khan, as the master of all \"the people of the felt walls\". For the first time in recorded history, all the tribes of the Mongolian steppe were united under a solitary leader, as they gathered under Temujin's banner of white horsehair. It was here that the elders gave Temujin the name that would soon strike fear into nations and peoples from Asia to Europe: Genghis Khan. The military campaigns and empire which made Genghis Khan famous, or infamous, would never have been possible if Mongolia had not evolved into a united kingdom. At the time of his birth, there were numerous tribal factions and constant fighting among the people of the steppe. Separated by greed, a need for vengeance, and thoughts of cultural or religious superiority, the divided tribes would never have been able to muster the collective strength needed to build an empire, or even subdue the Chinese. Nonetheless, with an ability to break any fetters placed upon him by cultural norms or expectations, despite intense and even military opposition, possessing intelligence to innovate and adapt to the most pragmatic solution, and also benefiting from some amazingly well-timed coincidences, Genghis Khan forged a united Mongolian nation from the numerous nomadic tribes dwelling on the Mongolian steppe. The united Mongols gave Genghis Khan the numbers, strength, and organizational structure needed to launch his military crusades and expand his rule from the Mongolian steppe to most of Asia. Many believe that his unification of the Mongols — rather than the conquests that he initiated once he had unified the Mongols — was Chinggis Khan's biggest accomplishment. Unifying the Mongols was no small achievement — it meant bringing together a whole series of disparate tribes. Economically the tribal unit was optimal for a pastoral-nomadic group, but Chinggis brought all the tribes together into one confederation, with all its loyalty placed in himself. This was indeed a grand achievement in a country as vast as Mongolia, an area approximately four times the size of France. Once Chinggis had succeeded in bringing the Mongols together, in 1206, a meeting of the so-called Khuriltai (an assemblage of the Mongol nobility) gave their new leader the title of \"Chinggis Khan\": Khan of All Between the Oceans. Chinggis's personal/birth name was Temujin; giving him the title \"Chinggis Khan\" was an acknowledgment by the Mongol nobles of Chinggis's leadership and their loyalty. From that point on Temujin would be the Khan of all within Mongolia and of the Mongols. So guys hope you guys Enjoy and learn something to this \\U0001f60a\\U0001f60a\\U0001f60a thankyou and please follow me on quora ********The end ********** ",
            "date": "Answered June 4, 2017",
            "views": "48",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Victor Magallanes",
                    "user_href": "/profile/Victor-Magallanes-1"
                },
                {
                    "user_id": "Hashim Hatavati",
                    "user_href": "/profile/Hashim-Hatavati"
                }
            ]
        }
    ]
}