{
    "title": "How are Cuba and the USA economically related? - Quora",
    "tags": [
        "Cuba",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cary Mcdonald",
                "href": "/profile/Cary-Mcdonald"
            },
            "answer_text": "Unless a huge hurricane deals and economic blow on farms in Cuba and Florida, there’s NO connection. One ‘looked like’ it could begin, as Obama and Trump were both ‘easing travel,’ … but Cuba’s idea of dealing with ‘tourists’ was to insure the exchange rate was not facilitative, and then, when communist oppression continued against the popular vote in Venezuela, Cuba supplied ‘boots on the ground’ in that country to maintain the dictatorship, and to do an ‘end run’ on the Venezuelan Army that was starting to support a coupe. Putin supplied the arms and training to the Cuban installation. These activities did not thrill the Orange Man, so Cuban emissaries remain personae non gratae at this point IMHO.  ",
            "date": "Answered July 7, 2020",
            "views": "234",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Viraj Anand",
                    "user_href": "/profile/Viraj-Anand-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda Moore",
                "href": "/profile/Linda-Moore-16"
            },
            "answer_text": "Hey, I’ve got it. Since the USA is economically related to Cuba by taking in 20% of the Cuban population who are now living in the USA… let’s trade. The USA can send Cuba 66M (20%) of our population to Cuba to be taken care of for life. Now that would be a good and fair economic exchange. Or, ask how many Cubans want to go back to Cuba now that they made it to the USA. Why is it Americans are the ones always helping everyone else while being criticized for being…………..Americans? We just never do enough for anyone according to world news media. ",
            "date": "Answered July 7, 2020",
            "views": "79",
            "upvotes": "0"
        }
    ]
}