{
    "title": "How did Anglo-Saxon nobility work? - Quora",
    "tags": [
        "Nobility",
        "Anglo-Saxons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Errington",
                "href": "/profile/Mark-Errington-1"
            },
            "answer_text": "The first Anglo-Saxon, (AS) nobility we find are the legendary chiefs, Hengist and Horsa. The names mean ‘horse’ and ‘stallion’. They were the chiefs of early war bands employed by the equally legendary Vortigern to discourage other raiders. When Vortigern stopped paying, Hengist and Horsa decided to take their pay in land. These early war-bands owed loyalty to their leaders and expected gifts of jewellery, land or slaves in return. The archaeological evidence of early AS graves are that the war-bands were a pretty mixed bunch, probably assembled from whoever was available. It may be that the leaders of these bands were descended from nobility in Jutland, Saxony or Angelin, but any such claims to royal blood may be regarded as dubious in the extreme. It was the toughest, smartest and most ruthless who prospered. What we find in Bede is the genealogies for the kings in the petty kingdoms of the England of his time - England being a concept that was new, possibly invented by Bede. One thing all these kings claimed was descent from the Germanic / Norse gods, in fact all of them claim to be descended from Wodin, despite all being nominally Christian. What the genealogies show is that the succession was within the family. With the exception of Kent, where there were separate administrations in Canterbury and Rochester, there was just one king per kingdom. Whether the succession was always to the elder son or the one best fitted to succeed is arguable. A powerful king could start from an unpromising background, developing a petty kingdom into one which could dominate the others. But powerful dynasties were rare, and the balance of power shifted frequently. Alfred the Great started the political reality of England. He succeeded as the younger brother of the last king of Wessex, despite that brother having a heir. At the time there was a major Viking invasion and it may not have been wise to have a king who was a small boy. In principal, the succession was decided by the Witan, the great counsel of elders In practice the counsel tended to vote after being directed by a certain degree of military pressure. The last king of AS England was Harold Godwinson (Harold II). He was elected by the Witan on the death of his brother in law, Edward the Confessor in January 1066. Edward had named a successor, Edgar the Atheling, who was a teenager at the time. There were threats to England from both the Vikings, under Harald Sigurdson, known as Hardrada, and Duke William of Normandy, (William the Bastard). Harold was the son of Earl Godwine, the main enforcer for King Cnut, and a man of only middle rank. As such, Harold rose to be king having been born the son of a minor lordling. Harold’ brother, Tostig, was made Earl of Northumbria. He had no links with the local nobility and was hugely unpopular, being chased out of the earldom by revolt and being banished from England. This indicates that ‘ryal blood’ was still regarded as being important. ",
            "date": "Answered February 28, 2017",
            "views": "17",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Keri Keenan",
                    "user_href": "/profile/Keri-Keenan"
                },
                {
                    "user_id": "Georgina Lees",
                    "user_href": "/profile/Georgina-Lees"
                },
                {
                    "user_id": "Jose Pineda",
                    "user_href": "/profile/Jose-Pineda-6"
                },
                {
                    "user_id": "Mac Steynberg",
                    "user_href": "/profile/Mac-Steynberg"
                },
                {
                    "user_id": "Anne Sarah",
                    "user_href": "/profile/Anne-Sarah-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Tempest",
                "href": "/profile/Stephen-Tempest"
            },
            "answer_text": "Anglo-Saxon society was stratified. A three-tier system seems to have been most common: thēow, ceorl and thegn, or thrall, freeman and nobleman. Social status was inherited from your father, although a woman's status did not change on marriage. A noblewoman marrying a common freeman remained a noblewoman, but their children would be ceorls like their father.  Anglo-Saxon nobles Social status was codified in law thanks to the institution of wergild. This was the payment that a man's murderer would have to pay to his victim's family as compensation for the crime. Lesser offences were punished by paying a set fraction of the wergild. Under the lawcode of King Alfred the Great of Wessex, the wergild for a ceorl was 200 shillings, or £10. That for a thegn was six times higher: 1200 shillings or £60. Slaves had no wergild, though you would have to compensate their owner if you killed one. These numbers were well enough established that the expressions 'two-hundreder' and 'twelve-hundreder' (twihynde and twelfhynde) became accepted as descriptive terms for commoners and nobles respectively. Note that the numbers imply that a thegn was expected to be about six times richer than a normal freeman.  Social mobility was possible in both directions. A thegn who lost his wealth might sink to the status of ceorl; a ceorl who fell on hard times might be forced to sell himself and his family into slavery as a lord's thralls. Conversely, thralls could be freed by their masters, and prosperous ceorls rise to the nobility. How often this sort of thing actually happened is a matter of conjecture. Wulfstan, Archbishop of York during the reign of King Æthelred the Unready, complained that in his era the social structure had been thrown into disorder, and people were claiming privileges they had no right to receive. Wulfstan's writings are actually one of our main primary sources on how the Anglo-Saxon social structure operated, though it should be borne in mind that he was presenting an idealised picture of how he thought things ought to be, or how he thought they were in bygone days. According to Wulfstan, a ceorl could become a thegn simply by amassing enough wealth and using it in socially-acceptable ways. The aristocracy was thus not a closed caste. Having said that, though, other law codes specify that merely becoming rich was not enough to qualify as a thegn; the family must own that amount of wealth for three generations before the grandson of the original claimant can legitimately call himself a thegn. It's tempting to believe that regardless of what law codes and archbishops might say, the real test of whether you were considered noble was if your neighbours, tenants and other nobles were willing to accept you as such. Wulfstan's writings contain a famous passage that \"if a ceorl prospered that he possessed fully five hides of his own, church and kitchen, bell-house and gate-house, a seat and special office in the king's hall, then he was henceforth entitled to the rights of a thegn.\"  A nobleman’s manor (this one in Somerset actually belonged to the kings of Wessex) A hide is a measure of land: traditionally reckoned as 120 acres (49 hectares) though it seems to have varied from place to place. It was also originally supposed to be the amount of land needed to support one peasant family in relative comfort. The fact that a nobleman was expected to own at least five times as much land as a peasant ties in fairly well with the thegn's wergild being six times higher than that of a ceorl. The kitchen, church, bell-house and gate-house imply that the prospective nobleman needs to own a fortified manor house complex. This would position him as the leader of a community. To set up a church would require him to fund a priest to hold services there, and presumably allow the local villagers to attend. The purpose of the bell-house is not exactly known; it might have been attached to the church to alert people to the times of religious services, or it might have served to warn villagers if enemy raiders were spotted approaching, so they could take shelter. The gate-house also implies that the manor complex was fortified. These were not castles as the Normans would later build them; but it seems that a nobleman's manor would at least contain a small defensible stone building as a strongpoint, and perhaps a wooden palisade around everything. They could thus provide a rallying point for the local villagers if Vikings, Scots, Welsh or English from a rival kingdom came raiding.  Thegns were also expected to equip themselves as warriors. Unlike the knights of later Norman feudalism, thegns did not owe military service as a direct consequence of their social status or possession of land. Instead, Anglo-Saxon law required all free men to come to the defence of their king if summoned: this was one of the three 'common burdens', the other two being the upkeep of bridges and of fortifications. However, more was expected of thegns. The laws of King Ine of Wessex, two hundred years before Alfred, specified that a ceorl who failed to fulfil his military obligations was to be fined 30 shillings; but a nobleman who did the same was to be fined 120 shillings — and also have his land confiscated (which would presumably reduce him to ceorl status). Thegns would also be expected to own horses, so they could be called up for military expeditions into distant foreign lands such as Yorkshire or Kent; ceorls would only be expected to defend their own home shires.  The Anglo-Saxons commonly spoke of thegns or 12-hundred men as a single unified class, in distinction to ceorls. In fact, there were several stratifications within the class. Back in the old heroic days of the Migration Era and the Anglo-Saxon invasion of Britain, a king was attended by his gesiths (ġesīþas). This word means 'companions', and is a direct parallel to the Latin term comites (from which the noble title 'count' comes). A gesith was a nobleman who was in direct attendance on his king, feasted in his hall and fought beside him in his wars.  The cyning and his gesīþas Kingship became more formalised and remote, as the original dozens of kingdoms in England coalesced into a notional seven and then into one. The old class of gesiths no longer existed as such: but the status of being a king's thegn, with the right and duty to attend his court and ride into battle at his side, still carried weight. Other thegns might instead enter the service of another powerful lord, or even a bishop or abbot. A lord was expected to support his thegns: indeed, the word lord itself derives from the Anglo-Saxon term for 'bread-giver' (hlaford), implying his duty to provide food to his followers. Some lords also gave land to their thegns, but this was generally considered as a reward for loyalty, rather than the formal land-for-service transaction of feudalism. Initially land was given to an individual for his lifetime, then reclaimed by the lord. The system of 'bookland' was then introduced, based on the concept of permanent land ownership found in Roman law. (The term 'bookland' itself was based on the idea that the transfer of land was recorded permanently in writing, in a book.) Initially, bookland was the system used by kings to donate land to the Church, especially to establish monasteries. Gradually, the system became used for secularised landownership as well. This led to the creation of a class of independent landed nobility with their own power base, in place of the gesiths of former times.  Anglo-Saxon nobles might thus have originally received their land from a king, but unlike under the later feudal system, landholding was not directly tied to military or other obligations. Having said that, the Anglo-Saxons did have a tradition of a man swearing allegiance to a lord, which resembled a feudal oath of fealty. This was known as commendation: a man 'commended himself' to a lord. It could happen at all levels of society: a ceorl could commend himself to a thegn, and a thegn to a more powerful thegn or ruler. Here is one example of an oath of commendation: By the Lord before whom this sanctuary is holy, I will to [name] be true and faithful, and love all which he loves and shun all which he shuns, according to the laws of God and the order of the world. Nor will I ever with will or action, through word or deed, do anything which is unpleasing to him, on condition that he will hold to me as I shall deserve it, and that he will perform everything as it was in our agreement when I submitted myself to him and chose his will. As the wording of the oath implied, commendation was a two-way deal. The follower was obliged to obey his lord's orders and serve him as he desired; but in return the lord was expected to protect his follower from harm (including ensuring he was represented in court if legal action were taken against him), and to reward loyal service with gifts. Commendation seems to have been voluntary but widespread; it is likely there was suspicion, as there certainly would be later, of 'masterless men' with no lord to speak for them and regulate their conduct. Commendation was a lifetime commitment, unless the lord released his man or failed to fulfil his obligation of protection.  As well as king's thegns and the 'median' thegns who served other lords, there seem to have been other divisions within the nobility. Contemporary sources often refer to the 'chief men' (proceres) of the kingdom, or the 'best men' (optimates), or the elders or the high-born. This does not seem to have been a precisely-defined status, but was dependent on power and influence. One story illustrates this: In the mid 11th century, a thegn of Ely named Guthmund was negotiating to marry a high-born woman; but she refused to marry him because despite being of noble blood, he owned less than 40 hides of land. As such, she said, he could not be counted as being among the chief men. However, Guthmund's brother was the Abbot of Ely monastery, and he leased his brother some of the abbey's lands, bringing Guthmund's landholding up to the specified 40 hides. The marriage went ahead after all. 40 hides is eight times higher than the five hides needed to qualify as a thegn. While it would be dangerous to assume from this single account that this was a standard or typical figure, it does illustrate the existence of gradations of wealth within the aristocracy. One historian (Peter Clarke) calculated that there were about 90 noblemen below the rank of earl during the reign of Edward the Confessor who owned 40 or more hides of land. That compares to probably about 5,000 thegns in total in England; so the proceres made up about 2% of the nobility.  The status of earl or ealdorman was an appointed position rather than a noble rank, though the two did blend together. The expansion of the major kingdoms of Anglo-Saxon England like Wessex, Mercia and Northumbria came at the expense of many small kingdoms which previously had their own kings and nobles. In many cases, the old king of the conquered land was allowed to stay in power, but now as the subordinate to the new overlord. He had to provide troops and tribute, his face would no longer appear on the currency, and if he was allowed to sign laws and charters at all, the king would need to counter-sign them. Still, he was expected to govern his territory, including raising troops to defend it from attackers and administering justice. The new ruler was sometimes referred to as an 'under-king' or subregulus, but a more common term was ealdorman, which means 'elder' (or 'older man', literally). As the large kingdoms were consolidated, the kings moved to a system of appointing ealdormen directly to rule their provinces rather than leaving them in the hands of their former ruling families. This increased royal power and centralisation. An ealdorman might be chosen from the loyal noblemen in the region, or be one of the king's own personal thegns and companions. The term shire (scir in Anglo-Saxon) originally just meant a region or province in general, and could refer to a unit as small as a parish or a single nobleman's estate. Gradually, though, it came to be associated with the major administrative divisions of the kingdom of Wessex and, after Wessex conquered the rest of England, of that kingdom too. Sometimes a shire was one of the old kingdoms in toto, such as Sussex or Kent; at other times it was a subdivision of a larger kingdom. The kings placed an ealdorman in charge of each shire. During the Viking invasions and especially the reign of Cnut, the Norse term jarl was introduced to England. This was a cognate of the existing Anglo-Saxon word eorl, which meant a man of noble birth or high rank. As a result, the term earl developed as a synonym for ealdorman, and gradually replaced it. The earls or ealdormen were thus the highest rank of the aristocracy below the king. In theory there was one earl for every shire; but by the time of Edward the Confessor there were only six earls in all of England, controlling multiple shires each, and very powerful and dangerous to the authority of the Crown. Finally, the Church must be mentioned. This was very powerful in Anglo-Saxon England; the Church owned large amounts of land and as a result commanded great wealth. The higher ranks of the church and the aristocracy were closely intertwined. Noble families donated land and gifts to monasteries and cathedrals, and in turn expected a say in the appointment of church officials, and preference to be given to any of their sons and daughters who sought to enter the religious life. Bishops and the abbots of larger monasteries were powers in the land, a match for ealdormen, with thegns and even warriors under their command.   Duke William and his nobles holding a feast The Anglo-Saxon nobility was swept away wholesale by the Norman Conquest. The number of major landholders with English names in the Domesday Book can be counted on the fingers of one hand. The Norman nobility was far smaller than its predecessors: instead of the 5000 or so thegns under Edward the Confessor there were only about 200 Norman barons, who controlled almost all the land in England not owned directly by King or Church. William the Conqueror also introduced the feudal principle that land-holding depended on an oath of fealty and a contract to perform military service — though the old Anglo-Saxon idea that all free men owed military service to the King was not entirely abandoned. It was much too useful! ",
            "date": "Updated May 2, 2017",
            "views": "11",
            "upvotes": " View 195 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Federico Bruzone",
                    "user_href": "/profile/Federico-Bruzone"
                },
                {
                    "user_id": "Chris McCartney",
                    "user_href": "/profile/Chris-McCartney-21"
                },
                {
                    "user_id": "Cláudio André",
                    "user_href": "/profile/Cláudio-André-4"
                },
                {
                    "user_id": "Sebastian Stephenson",
                    "user_href": "/profile/Sebastian-Stephenson-1"
                },
                {
                    "user_id": "Peter de Loriol",
                    "user_href": "/profile/Peter-de-Loriol-1"
                },
                {
                    "user_id": "Chris Young",
                    "user_href": "/profile/Chris-Young-114"
                },
                {
                    "user_id": "Oscar Lee",
                    "user_href": "/profile/Oscar-Lee-122"
                },
                {
                    "user_id": "Keri Keenan",
                    "user_href": "/profile/Keri-Keenan"
                },
                {
                    "user_id": "Eamon Cao",
                    "user_href": "/profile/Eamon-Cao-1"
                },
                {
                    "user_id": "Tyler Silvio",
                    "user_href": "/profile/Tyler-Silvio"
                }
            ]
        }
    ]
}