{
    "title": "How did Christianity alter western civilization? - Quora",
    "tags": [
        "Western Civilization",
        "Western Culture",
        "Civilization",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Shelby",
                "href": "/profile/Alex-Shelby"
            },
            "answer_text": "It’s more like the other way around… “How did western civilization alter Christianity?” The differences between the New Testament (i.e. Judaism with Roman influence) and the Old Testament (i.e. Judaism prior to Roman occupation) is evidence of this. Many will argue that the differences are not differences. But judge for yourself with the 6 values/sentiments listed below… (1) CIRCUMCISION: Textual evidence exists that demonstrates a Greek and Roman preference for ‘aesthetics’, and likened circumcision to hygienic overkill and superstition: “Their [the Egyptian’s] concern for cleanliness also explains why they practice circumcision, since they value cleanliness more than comeliness.” (The Histories 2:37) Additionally, Around 50 CE the Council of Jerusalem was organized to address the application of Mosaic Law into the Hellenistic culture of Rome in an effort to maximize Gentile converts. The Apostolic Decree was established and documented in Acts of the Apostles: “It is my judgment, therefore, that we should not make it difficult for the Gentiles who are turning to God. Instead we should write to them, telling them to abstain from food polluted by idols, from sexual immorality, from the meat of strangled animals and from blood. For the law of Moses has been preached in every city from the earliest times and is read in the synagogues on every Sabbath.” (Acts 15:19 – 21) Back to circumcision… OT: God requires His worshippers to be circumcised. “This is my [the Lord’s] covenant with you [Abraham] and your descendants after you, the covenant you are to keep: Every male among you shall be circumcised. (Genesis 17:10) NT: God does not require His worshippers to be circumcised. “Mark my words! I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all. Again I declare to every man who lets himself be circumcised that he is obligated to obey the whole law. You who are trying to be justified by the law have been alienated from Christ; you have fallen away from grace. For through the Spirit we eagerly await by faith the righteousness for which we hope. For in Christ Jesus neither circumcision nor uncircumcision has any value. The only thing that counts is faith expressing itself through love.” (Galatians 5:2 – 6) (2) CEREMONIAL FOODS: Pope Victor I (c. 190 CE) disputed Quartodecimanism (i.e. the preparation for Passover), and it was formerly rejected by the Catholic Church at the First Council of Nicaea in 325 CE. This was part of a gradual assimilation of Christianity into the Roman Hellenistic culture, which largely rejected many of the Mosaic traditions. OT: Ceremonial foods are important to God. Three times a year you are to celebrate a festival to me [the Lord]. ‘Celebrate the Festival of Unleavened Bread; for seven days eat bread made without yeast, as I commanded you. Do this at the appointed time in the month of Aviv, for in that month you came out of Egypt.’” (Exodus 23:14 – 15) NT: Ceremonial foods provide no benefit. “Do not be carried away by all kinds of strange teachings. It is good for our hearts to be strengthened by grace, not by eating ceremonial foods, which is of no benefit to those who do so.” (Hebrews 13:8) (3) FOOD RESTRICTIONS: Roman and Greek cultures list no specific religious food restrictions. Nevertheless, Spartans – during Plutarch’s era (c. 75 CE) – indulged in a soup dish known as melas zomos (i.e. black soup), which was made with pork, salt, vinegar and blood. OT: Only clean food can be consumed. Do not eat any detestable thing. These are the animals you may eat: the ox, the sheep, the goat, the deer, the gazelle, the roe deer, the wild goat, the ibex, the antelope and the mountain sheep. You may eat any animal that has a divided hoof and that chews the cud. (Deuteronomy 14:3 – 4) NT: All food can be consumed. “They [those who promote false teachings] forbid people to marry and order them to abstain from certain foods, which God created to be received with thanksgiving by those who believe and who know the truth. For everything God created is good, and nothing is to be rejected if it is received with thanksgiving, because it is consecrated by the word of God and prayer.” (1 Timothy 4:3 – 5) (4) RETRIBUTION: OT: Repay evil by implementing ‘an eye for an eye’. “Show no pity: life for life, eye for eye, tooth for tooth, hand for hand, foot for foot.” (Deuteronomy 19:21) NT: Repay evil by ‘turning the other cheek’. “You have heard that it was said, ‘Eye for eye, and tooth for tooth.’ But I [Jesus] tell you, do not resist an evil person. If anyone slaps you on the right cheek, turn to them the other cheek also. And if anyone wants to sue you and take your shirt, hand over your coat as well. If anyone forces you to go one mile, go with them two miles.” (Matthew 5:38 – 41) Incidentally, Swiss theologian Ulrich Luz considers the prospect of “loving your enemy” to be the “distinction and innovation” of Christianity… “If your enemy is hungry, give him food to eat; if he is thirsty, give him water to drink.” (Proverbs 25:21) However, Luz overlooked a Babylonian passage that predates Proverbs by some 900 years (i.e. Christianity did not innovate this sentiment)… “Do not exchange hostilities with your opponent; repay your evil-doer with goodness. Grant justice to your enemy; show a cheerful heart to your foe.” (Counsels of Wisdom: 41 – 44) (5) CHILD DISCIPLINE: This one’s a little weak, but worth a mention. OT: Discipline your children through fear. “Do not withhold discipline from a child; if you punish them with the rod, they will not die. Punish them with the rod and save them from death.” (Proverbs 23:13 – 14) NT: Moderate your disciplinary methods. “Fathers, do not embitter your children, or they will become discouraged.” (Colossians 3:21) (6) DIVINE FAVORITISM: OT: God shows favoritism, especially towards the Jews. “And the Lord has declared this day that you [the people of Israel] are His people, His treasured possession as He promised, and that you are to keep all His commands. He has declared that He will set you in praise, fame and honor high above all the nations He has made and that you will be a people holy to the Lord your God, as He promised.” (Deuteronomy 26:18 – 19) NT: God does not show favoritism. “For God does not show favoritism.” (Romans 2:11) And in modern times (i.e. 2008), Catholic bishops were nearly unanimous in their vote to revise the following passage from the United States Catholic Catechism for Adults from this: “The covenant that God made with the Jewish people through Moses remains eternally valid for them.” To this: “To the Jewish people, whom God first chose to hear His Word, ‘belong the sonship, the glory, the covenants, the giving of the law, the worship and the promises; to them belong the patriarchs, and of their race, according to the flesh, is the Christ.’” In other words, Jesus loves them too. And now for a final take-away… If you want a chicken or the egg summation of what influences/alters what (i.e. does religion follow culture, or does culture follow religion?), the answer is… ECONOMICS drives everything! The methods and means to monetize resources and services (i.e. economics) is what influences culture and religion… and this is driven by improvements in technology and knowledge. As we innovate, progress, and learn, we improve and (thus) change. This applies to slavery, hygiene, preserving “royal” blood lines, incarceration methods, sexuality, gender assumptions, agricultural practices, foreign relations, diet, entertainment, electoral practices, environmental concerns, automation… the list goes on. Religion generally reinforces culture because “simple” explanations tend to become more and more elusive as our systems and laws become more complex. “Because God said so” is easier to communicate than a lecture on economic side-effects, etc. However, because we’ve attached the characteristic of omniscience to God to avoid discourse and dissent, this often implies that culture does not change. But guess what? It does… because changes in technology, knowledge, and economics demand it to change. ",
            "date": "Answered July 12, 2020",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cynthia Avishegnath",
                "href": "/profile/Cynthia-Avishegnath"
            },
            "answer_text": "Christianity did not alter western civilization. Christianity is the consequence of western civilization. About 2100 years ago, a group of progressive Hellenized Jews, who were completely dissatisfied with the obstinacy of their religious leaders to include new “western civilization” aka Hellenism materials, they decided to formulate their own. They could not understand why Jewish leaders would reject the elegance of personal salvation and the motivation of hell/hades and the super demons. All the great cultural philosophies and mythologies that helps regulate goodness into human behaviour in cultures from China, to India, to Iran, to Greece and Rome - Jewish leadership refused to admit them. Despite the 200 years of exile in Iran, Jews did not learn much or incorporate much from ancient Iranian mythologies. Hence the roots of Christianity was born - with a large volume of its teachings copied from the philosophies and mythologies of ancient Greece and Iran - all rejected from the ancient Hebrew texts. Let me estimate, around the year 450, the now triumphant Christians found they had no pre-Christian Greek scriptures that would authenticate their religion as the new inheritor of Jewish legacy. So they created the septuagint and then fraudulently backdated its existence back to the year -350 before the timestamp of the mythological birth of the pagan god Jesus Christ. There is no evidence of any existence of a pre-christian septuagint, or pre- year 450. Though there is a forged letter of Jerusalem rabbis attesting to virtues of the septuagint and the myth of 70 scholars. That letter is obviously forged on many fronts. Rabbis of Jerusalem in the year -350 ???C’mon. We also know that not all writings attributed to Josephus can be authenticated. The earliest copy of Joesphus’ testament is from the year 1000. Christianity then went on to develop a rabbi Paul as a skillfully executed prequel. I mean a mythology of 12 disciples and a replacement disciple had already been running around for nearly 200 years, so a very credible prequel had to have Paul appoint himself replacement apostle. Christianity thro Pauline doctrine went on to demolish and detach Christians from all the cleansing and health related rituals - declaring them meaningless and useless to personal salvation thro Jesus Christ The consequence -when more Christians than Jews died from the plague - Jews were accused as having laid the curse for the plague. Yes the blood of the lamb that was shed, when my ancestors were commanded to schlepp on the door posts and they trampled on the blood of the lamb as a sign of disrespect to the lamb the symbol of Egyptian princely royalty. To tell my ancestors to make the cultural break from Egypt that had dominated Palestinians for 400 years. The question should be, how did roots of western civilization which is Hellenism shape the minds of progressive Hellenic Jews who developed Christianity and collaged multiple personalities into the person Jesus Christ. Islam was a consequence of Christianity. Islam inherited much of the pagan mythologies from Christianity. Mohammed was illiterate and did not know the details of Jewish rituals - so he declared pigs and “”all else that is disgusting” do not eat. “Halal” is rom the Aramaic praise/commend. It is commendable not to eat disgusting foods. “Disgusting” is interpreted differently thro out the world. Just like Mohammed, early Christians could not read Hebrew and therefore could not know the details of the ancient Hebrew texts. It was only within the past 200 years Christian scholars began to discover the the ancient Hebrew text of the Bible contradicted Christian teachings, and so they had to concoct explanations technically known as “contexts”. “Contexts” allow Christian scholarship to modify the meaning of Hebrew words whenever they contradict Christian theology. Early Islam after the demise of Mohammed, which was significantly influenced by Hellenism , like Christianity had actually been one of the pillars of western civilization. One should also ask, how did Talmudic jurisprudence influenced the course of modern western jurisprudence. How did the 2000 years of persecution of my people by Christians and Muslims influence the course of modern ethics and morality. Persecution that was transferenced by Christianity upon my people, where the transference is documented into accusations against Jews in the gospels. Transference = the psychopathology of accusing your victims of perpetrating the violence and anger which you actually perpetrated on your victims. ",
            "date": "Answered July 16, 2020",
            "views": "59",
            "upvotes": "0"
        }
    ]
}