{
    "title": "How many US presidents have been alive at one time? - Quora",
    "tags": [
        "Presidents",
        "Presidents of the United States of America",
        "History of the United States of America",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Kett",
                "href": "/profile/Robert-Kett"
            },
            "answer_text": "April 30,1789-March 3, 1797: One (George Washington) March 4, 1797-December 14, 1799: Two (George Washington and John Adams) December 14, 1799-March 3, 1801: One (John Adams) March 4, 1801- March 3, 1809: Two (John Adams and Thomas Jefferson) March 4, 1809 - March 3, 1817: Three (John Adams, Thomas Jefferson, and James Madison) March 4, 1817- March 3, 1825: Four (John Adams, Thomas Jefferson, James Madison, and James Monroe) March 4, 1825-July 4, 1826: Five (John Adams, Thomas Jefferson, James Madison, James Monroe, and John Quincy Adams) July 4, 1826: Four (John Adams, James Madison, James Monroe, and John Quincy Adams) July 4, 1826-March 3, 1829: Three (James Madison, James Monroe, and John Quincy Adams) March 4, 1829-July 4, 1831: Four (James Madison, James Monroe, John Quincy Adams, and Andrew Jackson) July 4, 1831-June 28, 1836: Three (James Madison, John Quincy Adams, and Andrew Jackson) June 28, 1836-March 3, 1837: Two (John Quincy Adams and Andrew Jackson) March 4, 1837-March 3, 1841: Three (John Quincy Adams, Andrew Jackson, and Martin Van Buren) March 4, 1841-April 4, 1841: Four (John Quincy Adams, Andrew Jackson, Martin Van Buren, and William Henry Harrison) April 4, 1841-March 3, 1845: Four (John Quincy Adams, Andrew Jackson, Martin Van Buren, and John Tyler) March 4, 1845-June 8, 1845: Five (John Quincy Adams, Andrew Jackson, Martin Van Buren, John Tyler, and James K. Polk) June 8, 1845-February 23, 1848: Four (John Quincy Adams, Martin Van Buren, John Tyler, and James K. Polk) February 23, 1848-March 3, 1849: Three (Martin Van Buren, John Tyler, and James K. Polk) March 4, 1849-June 15, 1849: Four (Martin Van Buren, John Tyler, James K. Polk, and Zachary Taylor) June 15, 1849-July 9, 1850: Three (Martin Van Buren, John Tyler, and Zachary Taylor) July 9, 1850-March 3, 1853: Three (Martin Van Buren, John Tyler, and Millard Fillmore) March 4, 1853-March 3, 1857: Four (Martin Van Buren, John Tyler, Millard Fillmore, and Franklin Pierce) March 4, 1857-March 3, 1861: Five (Martin Van Buren, John Tyler, Millard Fillmore, Franklin Pierce, and James Buchanan) March 4, 1861-January 18, 1862: Six (Martin Van Buren, John Tyler, Millard Fillmore, Franklin Pierce, James Buchanan, and Abraham Lincoln) January 18, 1862-July 24, 1862: Five (Martin Van Buren, Millard Fillmore, Franklin Pierce, James Buchanan, and Abraham Lincoln) July 24, 1862-April 15, 1865: Four (Millard Fillmore, Franklin Pierce, James Buchanan, and Abraham Lincoln) April 15, 1865-June 1, 1868: Four (Millard Fillmore, Franklin Pierce, James Buchanan, and Andrew Johnson) June 1, 1868-March 3, 1869: Three (Millard Fillmore, Franklin Pierce, and Andrew Johnson) March 4, 1869-October 8, 1869: Four (Millard Fillmore, Franklin Pierce, Andrew Johnson, and Ulysses Grant) October 8, 1869-March 8, 1874: Three (Millard Fillmore, Andrew Johnson, and Ulysses Grant) March 8, 1874-July 31, 1875: Two (Andrew Johnson and Ulysses Grant) July 31, 1875-March 3, 1877: One (Ulysses Grant) March 4, 1877-March 3, 1881: Two (Ulysses Grant and Rutherford Hayes) March 4, 1881-September 19, 1881: Three (Ulysses Grant, Rutherford Hayes, and James Garfield) September 19, 1881-March 3, 1885: Three (Ulysses Grant, Rutherford Hayes, and Chester Arthur) March 4, 1885-July 23, 1885: Four (Ulysses Grant, Rutherford Hayes, Chester Arthur, and Grover Cleveland) July 23, 1885-November 18, 1886: Three (Rutherford Hayes, Chester Arthur, and Grover Cleveland) November 18, 1886-March 3, 1889: Two (Rutherford Hayes and Grover Cleveland) March 4, 1889-January 17, 1893: Three (Rutherford Hayes, Grover Cleveland, and Benjamin Harrison) January 17, 1893-March 3, 1897: Two (Grover Cleveland and Benjamin Harrison) March 4, 1897-March 13, 1901: Three (Grover Cleveland, Benjamin Harrison, and William McKinley) March 13, 1901-September 14, 1901: Two (Grover Cleveland and William McKinley) September 14, 1901-June 24, 1908: Two (Grover Cleveland and Theodore Roosevelt) June 24, 1908-March 3, 1909: One (Theodore Roosevelt) March 4, 1909-March 3, 1913: Two (Theodore Roosevelt and William Howard Taft) March 4, 1913-January 6, 1919: Three (Theodore Roosevelt, William Howard Taft, and Woodrow Wilson) January 6, 1919-March 3, 1921: Two (William Howard Taft and Woodrow Wilson) March 4, 1921-August 2, 1923: Three (William Howard Taft, Woodrow Wilson, and Warren Harding) August 2, 1923-February 3, 1924: Three (William Howard Taft, Woodrow Wilson, and Calvin Coolidge) February 3, 1924-March 3, 1929: Two (William Howard Taft and Calvin Coolidge) March 4, 1929-March 8, 1930: Three (William Howard Taft, Calvin Coolidge, and Herbert Hoover) March 8, 1930-January 5, 1933: Two (Calvin Coolidge and Herbert Hoover) January 5, 1933-March 3, 1933: One (Herbert Hoover) March 4, 1933-April 12, 1945: Two (Herbert Hoover and Franklin Roosevelt) April 12, 1945-January 20, 1953: Two (Herbert Hoover and Harry Truman) January 20, 1953-January 20, 1961: Three (Herbert Hoover, Harry Truman, and Dwight Eisenhower) January 20, 1961-November 22, 1963: Four (Herbert Hoover, Harry Truman, Dwight Eisenhower, and John Kennedy) November 22, 1963-October 20, 1964: Four (Herbert Hoover, Harry Truman, Dwight Eisenhower, and Lyndon Johnson) October 20, 1964-January 20, 1969: Three (Harry Truman, Dwight Eisenhower, and Lyndon Johnson) January 20, 1969-March 28, 1969: Four (Harry Truman, Dwight Eisenhower, Lyndon Johnson, and Richard Nixon) March 28, 1969-December 26, 1972: Three (Harry Truman, Lyndon Johnson, and Richard Nixon) December 26, 1972-January 22, 1973: Two (Lyndon Johnson and Richard Nixon) January 22, 1973-August 9, 1974: One (Richard Nixon) August 9, 1974-January 20, 1977: Two (Richard Nixon and Gerald Ford) January 20, 1977-January 20, 1981: Three (Richard Nixon, Gerald Ford, and Jimmy Carter) January 20, 1981-January 20, 1989: Four (Richard Nixon, Gerald Ford, Jimmy Carter, and Ronald Reagan) January 20, 1989-January 20, 1993: Five (Richard Nixon, Gerald Ford, Jimmy Carter, Ronald Reagan, and George H. W. Bush) January 20, 1993-April 22, 1994: Six (Richard Nixon, Gerald Ford, Jimmy Carter, Ronald Reagan, George H. W. Bush, and Bill Clinton) April 22, 1994-January 20, 2001: Five (Gerald Ford, Jimmy Carter, Ronald Reagan, George H. W. Bush, and Bill Clinton) January 20, 2001-June 5, 2004: Six (Gerald Ford, Jimmy Carter, Ronald Reagan, George H. W. Bush, Bill Clinton, and George W. Bush) June 5, 2004-December 26, 2006: Five (Gerald Ford, Jimmy Carter, George H. W. Bush, Bill Clinton, and George W. Bush) December 26, 2006-January 20, 2009: Four (Jimmy Carter, George H. W. Bush, Bill Clinton, and George W. Bush) January 20, 2009-January 20, 2017: Five (Jimmy Carter, George H. W. Bush, Bill Clinton, George W. Bush, and Barack Obama) January 20, 2017-November 30, 2018: Six (Jimmy Carter, George H. W. Bush, Bill Clinton, George W. Bush, Barack Obama, and Donald Trump) November 30, 2018-Present: Five (Jimmy Carter, Bill Clinton, George W. Bush, Barack Obama, and Donald Trump) ",
            "date": "Answered August 11, 2019",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Rosenfield",
                    "user_href": "/profile/Robert-Rosenfield-4"
                },
                {
                    "user_id": "Garon Jones",
                    "user_href": "/profile/Garon-Jones-1"
                },
                {
                    "user_id": "Siddhartha Sahasrabuddhe",
                    "user_href": "/profile/Siddhartha-Sahasrabuddhe"
                },
                {
                    "user_id": "AP DS",
                    "user_href": "/profile/AP-DS"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Cook",
                "href": "/profile/Dan-Cook-98"
            },
            "answer_text": "Good question! I thought right away that we had a record right now, but then checked Wikipedia and found the following There have been four time periods when six presidents (the incumbent and five former presidents) co-existed, including the current period:From March 1861 to July 1862, when Martin Van Buren, John Tyler, Millard Fillmore, Franklin Pierce, James Buchanan, and Abraham Lincolnwere alive.From January 1993 to April 1994, when six consecutive presidents, Nixon, Gerald Ford, Carter, Ronald Reagan, G. H. W. Bush, and Clinton, were alive.From January 2001 to June 2004, when six consecutive presidents, Ford, Carter, Reagan, G. H. W. Bush, Clinton, and G. W. Bush, were alive.From January 2017 to the present day, with Carter, G. H. W. Bush, Clinton, G. W. Bush, Obama and Donald Trump alive.Nixon is the only man to have been both the only living U.S. president (from January 1973 to August 1974) and one of six living presidents (from January 1993 to April 1994).",
            "date": "Answered October 23, 2017",
            "views": "113",
            "upvotes": " View 128 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Rosenfield",
                    "user_href": "/profile/Robert-Rosenfield-4"
                },
                {
                    "user_id": "Al Cohen",
                    "user_href": "/profile/Al-Cohen-11"
                },
                {
                    "user_id": "Evan Ray",
                    "user_href": "/profile/Evan-Ray-25"
                },
                {
                    "user_id": "Sanika Kotnis",
                    "user_href": "/profile/Sanika-Kotnis"
                },
                {
                    "user_id": "Connor Stuart Copeland",
                    "user_href": "/profile/Connor-Stuart-Copeland"
                },
                {
                    "user_id": "John Boyland",
                    "user_href": "/profile/John-Boyland"
                },
                {
                    "user_id": "Adam Roach",
                    "user_href": "/profile/Adam-Roach-6"
                },
                {
                    "user_id": "Jason Poe",
                    "user_href": "/profile/Jason-Poe-6"
                },
                {
                    "user_id": "Susan Ball",
                    "user_href": "/profile/Susan-Ball-16"
                },
                {
                    "user_id": "Michael D Murdock",
                    "user_href": "/profile/Michael-D-Murdock"
                }
            ]
        }
    ]
}