{
    "title": "How powerful was the Portuguese empire? - Quora",
    "tags": [
        "Portuguese Empire",
        "Power (international relations)",
        "Portugal",
        "Empires"
    ],
    "response": [
        {
            "author_info": {
                "name": "Delfim G. Almeida",
                "href": "/profile/Delfim-G-Almeida"
            },
            "answer_text": "Portugal was very powerful for about 100 years back in the XV -XVI century. It was not large nor powerful enough to keep all their colonies, but for a country wrecked by poverty, under constant attack from Spain and the Muslim world, what it accomplished was/is very significant. Other nations faced loss of colonies as well, but Portugal was the last colonial power to hang on to theirs. Not that I am particularly proud of that, or issues that came along the colonialism ride. However, in many areas of the globe where Portugal touched, there are still visible signs of Portuguese influence to this day in local society, physical anthropology, language, cuisine, culture, religion or architecture. For a country of barely one million inhabitants at the time, what Portugal accomplished cannot be ignored, nor easily swept aside by the desmissive hands of the ignorant, uninformed masses, including other ex-colonial powers who like to deride and criticize our modis operandi at the time, as if they were any better! Portugal gave us the world we know today with its own personal touch. That personal touch is a pleasant, delightful experience if/or when you go to Macau, Goa, or Cape Verde, and the incredible mesh of cultures that created beautiful people in beautiful lands like Brazil & São Tomé & Príncipe, off the Gulf of Guine. When the Eurasians of Melaka in present day Malaysia still hang on to their Kristang language, a Portuguese dialect that although still endangered, 500 years after Portugal left Melaka, it is still spoken. When the Mata Biru of Aceh, Indonesia make the news because of their beautiful women with light skin, blue eyes, blind hair, they tell you about their most likely Northern Portuguese touch and heritage. This tells you something about the bond that keeps these Eurasians attached to their European Portuguese legacy, which many still cherish. Portugal showed the world that if there was ever a group of courageous, valient, seafaring people that conquered unknown fears, seas, political and physical barriers, attacks, invasions, monsters, misery, hunger, foreign lands, societies, and armies 3 x’s + its size, they were my Portuguese ancestors, of which I am extremely proud for their courage, grit, sacrifice and determination. Amongst its many contributions, the Portuguese found, fought, lived, loved and died in areas of the world that even stronger and larger powers like Egypt, Greece, Rome, Vikings, Chinese and Muslims groups could not, or would not because…they amongst the many possible reasons were afraid, we were NOT. Please do not let size, stature, history or GDP taint your view of the Portuguese. We have balls BIG balls, we also like to put them to use, no matter where we are. We were ‘only’ the pioneers of globalization centuries before Bill Gates and Steve Jobs even thought about it. So please do let respect and justice fall on Portugal, and the Portuguese, if only for that; we thank you! ",
            "date": "Updated August 1, 2020",
            "views": "17",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eduardo Santos",
                    "user_href": "/profile/Eduardo-Santos-41"
                },
                {
                    "user_id": "Filipe Morgan",
                    "user_href": "/profile/Filipe-Morgan"
                },
                {
                    "user_id": "Sergio Lopes",
                    "user_href": "/profile/Sergio-Lopes-15"
                },
                {
                    "user_id": "Antonio Ferreira",
                    "user_href": "/profile/Antonio-Ferreira-136"
                },
                {
                    "user_id": "Luís Gonçalves",
                    "user_href": "/profile/Luís-Gonçalves-1"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-1492"
                },
                {
                    "user_id": "Maria Santiago",
                    "user_href": "/profile/Maria-Santiago-3"
                },
                {
                    "user_id": "Someone On Quora",
                    "user_href": "/profile/Someone-On-Quora"
                },
                {
                    "user_id": "Beatriz Gonçalves",
                    "user_href": "/profile/Beatriz-Gonçalves-47"
                },
                {
                    "user_id": "Santino Martinez",
                    "user_href": "/profile/Santino-Martinez-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rúben Marquês Urgeiro",
                "href": "/profile/Rúben-Marquês-Urgeiro"
            },
            "answer_text": "The Portuguese Empire, Win “Guinness World Records”, for first global empire. link: First global empire The Portuguese are very proud and stubborn by nature, and incredibly incredulous is a Portuguese characteristic since the time that the famous Ptolemy and others invented the theory that there were giant monsters in the sea and that the Indian Sea was surrounded by land, that is, not being able to reach there by boat but by land the Portuguese did not believe it and that is why they formed the first global empire on 4 continents and at a critical moment in world history as it was the time of the black plague that lasted for several years killing millions in Europe but thank God it arrived in Portugal and it arrived very little because the Portuguese borders were already more than well established at that time, and in relation to what other countries think about Portugal, for the Portuguese no one knows more about the history of Portugal than the Portuguese themselves because have obvious reasons for this, in addition to the old maps they have books with 500 years old that explain the great conquests and navigations, while there is countries that invent their own history based on theories because they do not have documents to prove it, just as there are no reliable documents of the exact number of the Portuguese population at the time, it is said that it was 1 million but with so many children who made it at that time, I very much doubt it of that number. Portuguese Empire “Wikipedia lusophone” link: Império Português – Wikipédia, a enciclopédia livre anyone who doesn't know Portuguese I would advise translation. :)  “size of the portuguese empire through ancient maps” World Map of Portuguese discoveries many parts of the world.  Portuguese Empire map of First Colonizations Canadá,India,Brazil, parts of Asia and Australia's claim and others… date: 1573  map of the Portuguese \"Domingos Teixeira\" date 1573 Symbol of the Flag of Portugal and symbol of the Portuguese Cross in Africa,Asia,part of Brazil and part of Canada, and of course India, japan and China and others… the map is on display at the national museum of france.  Map of the Kingdom of Portugal Brazil and Algarves “date 1821” is preserved in the national library of Portugal “Size of Brazil 1821”  map of Portuguese Africa  Map of Portuguese Canada  other map of Empire Portuguese in Asia  other map of Portuguese Empire in Asia.  most recent map of Portuguese “Africa Austro Equatorial “1884 - 1885”    Thanks, I hope you enjoy :) ",
            "date": "Answered October 28, 2020",
            "views": "176",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eduardo Santos",
                    "user_href": "/profile/Eduardo-Santos-41"
                }
            ]
        }
    ]
}