{
    "title": "How were the permanent members of UN security council selected ? - Quora",
    "tags": [
        "United Nations Security Council"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Wagon",
                "href": "/profile/Bruce-Wagon"
            },
            "answer_text": "The five permanent members of the United Nations Security Council are: Republic of China,France,The Union of Soviet Socialist Republics,The United Kingdom of Great Britain and Northern Ireland, and;The United States of AmericaHowever the UN is based on international law, not law. And international law is about power, not justice. They were permanent members since Day 1. The UN at large happened as a result of WWII. The five were - and still are - the largest military powers at the close of the war. The eternal truism is might makes right. Germany and Japan were excluded for obvious reasons. The UNSC was designed to provide the nations best equipped to wage war with an alternative avenue to exercise their dominance so they can govern the world without war having to take place at all. If, in the event the other powers disagree, it was intended to restrain one member having taken into consideration that the other powers have issued a veto, or registered their disagreement, and might attack the offending power. That design no longer works because: 1. The US military is now so gargantuan it can now wage war against the rest of the entire world all at once. The UNSC could not stop the US from waging wars in Iraq and Afganistan. 2. The US developed an alternative power rivaling that of its own military - the world’s currency reserve. The US now prefers to impose unilateral sanctions where possible, and only drop bombs on people who don’t use, and therefore not beholden to, the US financial system. However, the UNSC still has the same 5 permanent and 10 elected members structure because no one can change it in practice. If that goes, the UN goes. ",
            "date": "Answered October 10, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ali Zouaoui",
                    "user_href": "/profile/Ali-Zouaoui"
                },
                {
                    "user_id": "Lee Adam",
                    "user_href": "/profile/Lee-Adam-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giles Cattermole",
                "href": "/profile/Giles-Cattermole-1"
            },
            "answer_text": "The UN was originally - during; not after - WW2 the “Nations United against Fascism”. Those five were - in order - Britain, France, China, Russia, the USA. As WW2 drew to a close, that group decided to turn a wartime alliance into a peacetime world system, designed to correct the defects of the League of Nations, and prevent future wars. They invited in all those countries that had not “blotted their copybook” by fighting on the Axis side. Then - later - the axis countries themselves. But the original ‘Group of Five’ retained the structure - and the powers - which they had exercised in defeating fascism. At the time it seemed self-explanatory; and at San Francisco in 1945, there were no objections from other countries keen to join. Since then, the only change has been the replacement of the Republic of China by the Peoples’ Republic of China in 1971. ",
            "date": "Answered October 11, 2018",
            "views": "509",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ali Zouaoui",
                    "user_href": "/profile/Ali-Zouaoui"
                }
            ]
        }
    ]
}