{
    "title": "How are manuscripts different than scrolls? - Quora",
    "tags": [
        "Manuscripts",
        "Artifacts (archaeology)",
        "Archaeology",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Green",
                "href": "/profile/Peter-Green-189"
            },
            "answer_text": "How are manuscripts different from scrolls? Manuscript refers to the type of writing and scroll refers to what the writing is on. A manuscript is anything written by hand. Manu- means hand, and script means writing. A manuscript can be in a number of different forms. It can be on a single sheet or a scroll or a codex. A codex (plural “codices”) is made up of a group of sheets bound together in book form, so, for example, the famous Codex Vaticanus (a text of the New Testament found in the Vatican Library) consists of a collection of handwritten pages bound in book form. If early Christians were not the inventors of the codex form, they were among the most enthusiastic early adopters. The codex is a very portable technology. Another way to keep loose sheets together is to join them top to tail to form a scroll, somewhat similar to the way pages are presented on screen in Word or LibreOffice Writer, and is why we speak of “scrolling through” an online document. This remains the traditional form for Scriptures in Synagogues. Scrolls are suited for static use (though still somewhat awkward) but are not very practical for portability. Codices have demonstrated their portability for about 2000 years. ",
            "date": "Updated May 13, 2020",
            "views": "164",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donna Bowman",
                    "user_href": "/profile/Donna-Bowman-6"
                },
                {
                    "user_id": "Jiban Krushna Jena",
                    "user_href": "/profile/Jiban-Krushna-Jena"
                },
                {
                    "user_id": "David Deitsch",
                    "user_href": "/profile/David-Deitsch"
                },
                {
                    "user_id": "David McKay",
                    "user_href": "/profile/David-McKay-22"
                },
                {
                    "user_id": "Ian Carmichael",
                    "user_href": "/profile/Ian-Carmichael-10"
                },
                {
                    "user_id": "Steve Hayes",
                    "user_href": "/profile/Steve-Hayes-28"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "Evan Lipschultz",
                    "user_href": "/profile/Evan-Lipschultz"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Harland",
                "href": "/profile/John-Harland-2"
            },
            "answer_text": "“How are manuscripts different than scrolls?” They are neither different or the same. The two words refer to different attributes of a document. “Manuscript” means something handwritten. Its meaning is expanded a bit nowadays to describe an unpublished work even if it is typewritten or printed from a word processor program. A manuscript can be unbound pages, a scroll, or a codex (a bound book, in other words). Just as a printed page can be unbound, a codex or - occasionally - a scroll. ",
            "date": "Answered June 5, 2019",
            "views": "43",
            "upvotes": "0"
        }
    ]
}