{
    "title": "How were autistic people treated in Medieval Europe? - Quora",
    "tags": [
        "History of Mental Health Medicine",
        "Middle Ages (era)",
        "History of Europe",
        "Autism",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brandon Wiscombe",
                "href": "/profile/Brandon-Wiscombe"
            },
            "answer_text": "This was a comment that turned out in depth enough to be worth posting as an answer; I’ll proofread as best I can, but things might be wonky in parts. — The supposed treatment of mentally disabled people as somehow demonic or possessed in the Medieval period is largely a part of the Dung Ages myth; even more severe and/or disturbing (to others) forms tended to be seen as an unfortunate condition, albeit usually chalked up to being ‘simple.’ Back then, people knew everyone in their own town, generally speaking, and no one would let their neighbor’s kid starve to death if they were still capable of working, and the parish would often help cover basic needs with alms money if they weren’t good at it. Like other folks, there’s plenty of jobs the ‘village idiot’ can do, and most people aren’t so callous that they’d abandon someone they’ve grown up with or watched grow up. That being said, the very low-functioning might have suffered during the witch hunts of the early modern period. Wandering “witch hunters” had a habit of seeing, say, a panic attack and the rather unique noises an upset autistic person can make as possession - and a successful witch hunter’s most important skill is raising enough hysteria that people willingly murder their neighbors. Fortunately for medieval austistics, and contrary to popular belief, the witch hunts were primarily an early modern thing. Indeed, the Church turned a blind eye to folk magic for the vast majority of its history up to that point; despite the Inquisition’s (rightfully) sinister reputation, they were looking for heretics, not witches, though there was often overlap. ‘Good’ magicians, who used their magic for the good of their community, were rarely executed until aforementioned witch hunts, and almost never for witchcraft, but for heresy if their methods were deemed heterodox and they refused to recant. Interestingly enough, there are some cases - including Joan of Arc - where the Inquisition made an INNOCENT verdict; the Inquisition pretty much everywhere else condemned the kangaroo court run by the English on the woman who humiliated them. Despite being awful, at least some of them did believe that they were protecting people from evil, and didn’t just burn someone because they were weird. tl;dr people aren’t any more compassionate now than they were then, and in many cases were much more so, as charity was a virtue and a norm within one’s own community. Unless they were hurting people, a medieval autistic would likely live more or less just as well as their neighbors, albeit possibly with some help. ",
            "date": "Answered October 30, 2017",
            "views": "129",
            "upvotes": " View 112 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Ewart",
                    "user_href": "/profile/Ryan-Ewart-4"
                },
                {
                    "user_id": "Daniel Hager",
                    "user_href": "/profile/Daniel-Hager-3"
                },
                {
                    "user_id": "Laura Sommer",
                    "user_href": "/profile/Laura-Sommer"
                },
                {
                    "user_id": "Tyler Mackie",
                    "user_href": "/profile/Tyler-Mackie-3"
                },
                {
                    "user_id": "Anna Rossi",
                    "user_href": "/profile/Anna-Rossi-66"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Jonathan Liebowitz",
                    "user_href": "/profile/Jonathan-Liebowitz"
                },
                {
                    "user_id": "Joshua Trinidad",
                    "user_href": "/profile/Joshua-Trinidad-1"
                },
                {
                    "user_id": "Jezebel Braun",
                    "user_href": "/profile/Jezebel-Braun"
                },
                {
                    "user_id": "F Turtle",
                    "user_href": "/profile/F-Turtle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sophie Gwinn",
                "href": "/profile/Sophie-Gwinn-1"
            },
            "answer_text": "‘Medieval’ refers to a quite vast reference of time. You are speaking of a time that spans centuries. It’s like saying “How were the mentally disturbed treated over the last 500 years?” Wow. What a difference there is even for the last 50! And yet….’modern’ advancements in mental health did not take place until the last century, to be conservative. Medieval inevitably means spiritual. No matter your post modern slant, the ruling way of thinking was, even if a slight bit misguided, Biblical. You can’t ask about this era of history and honestly think things got better overnight before they were far worse. In early medieval times people with mental illness would have been pitied, been an interest of the somewhat earlier ‘church’ ((though, by now even the church had been corrupted)) if something spiritual had been read into their condition (not as likely as many would think. A vast majority of ‘demonic’ references in Scripture after all, were correlated more with physical issues…not mental. Some not necessarily attributed at all. None were directly linked with what we would now know as ‘mental illness’, save perhaps one vague reference.) It was not until the ‘hysteria’ of what the church could not explain, miraculously cure…but ESPECIALLY control, that it began asserting that any slight issue must assuredly be demonic. Enter the witching years. The Inquisition, world over. Later medieval era. Then, more recently, came the dawn of Eugenistic theory and application. This, by its own definition, superceded the superstitious ‘church’ age. It was rationalized by science now. Did you know that, by Hellen Kellers own standards, she would have been put to death? She was a staunch eugenist. She called for the simple minded and degenerate…you know, blind, deaf, etc. (even babies) to be euthanized so that they would spare humanity their weaknesses. This time was defined by the principle that the least of these should just die out and not contribute to (subtract from) society any longer. Talk about ‘dark’ ages. And that was only a century removed from where you are now. The ‘enlightened’ mindset. Thank God I didn’t live even 2 generations ago. I’m not in a straight jacket. ",
            "date": "Answered December 4, 2018",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Seeley",
                    "user_href": "/profile/Joe-Seeley-1"
                },
                {
                    "user_id": "Grada Schadee",
                    "user_href": "/profile/Grada-Schadee-1"
                },
                {
                    "user_id": "Jezebel Braun",
                    "user_href": "/profile/Jezebel-Braun"
                },
                {
                    "user_id": "Aaron Hill",
                    "user_href": "/profile/Aaron-Hill-31"
                }
            ]
        }
    ]
}