{
    "title": "How should businesses be responding to the COVID-19 pandemic? - Quora",
    "tags": [
        "Epidemiology",
        "Pandemics",
        "Small Businesses",
        "COVID-19 (2019-2020)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bharat Sharma Global",
                "href": "/profile/Bharat-Sharma-Global"
            },
            "answer_text": " Here are a few digital marketing strategies your business can adopt in these tricky times 2020 ADOPT A MULTI-CHANNEL APPROACHIt’s a great opportunity for your business to use PPC (pay-per-click) marketing to connect with their customers and gain a competitive advantage. Facebook and Twitter represent more brand-advertising opportunities than Google. Paid social on Instagram for example is also highly valuable for visual services and products, or even small businesses or financial advisers that can offer their services online – such as product information, investment advice, digital training, and a lot more. CREATE GOODWILL, AMPLIFY IT ON DIGITALBe it just changing the line of business (like how a few breweries around the world have started manufacturing hand sanitisers) or conducting an online social media drive or marathon to support Covid-19 warriors, people are looking for good gestures in troubling times like these. UPDATE YOUR ONLINE PRESENCEA lot of trade shows, exhibitions and events have been cancelled this year, for obvious reasons. This has hit companies hard, especially B2B companies. Figures released by data intelligence company PredictHQ, show that in February there was a 500% surge in cancellations and postponements of significant events.This puts a lot of pressure on your online presence to reflect the times. For instance, if you have a website that deals in a variety of product categories, you may want to bump up the essentials section and push luxuries all the way to the back. IMPROVE YOUR WEBSITE SEOThis follows naturally from the previous point – the best way to improve your online presence is to make it more noticeable to your audience – or as they say in the age of Google, more ‘searchable’. You want to be on the front page of the Google search, somewhere in the top 5, so that when your customers search for certain keywords, they end up contacting you. READJUST YOUR DIGITAL MARKETING BUDGETAn important piece of advice – in a situation like this, do not panic and slash your marketing budgets just because there’s an economic slowdown. Just readjust or restructure it smartly. Cutting down on budgets might impact the brand in the long run – we may not realise it now, but why wait for the future to see what its impact might be? ",
            "date": "Answered September 7, 2020",
            "views": "151",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patrick Liew",
                "href": "/profile/Patrick-Liew-5"
            },
            "answer_text": "Winning The COVID-19 War - The Mulan Way (Spoilers ahead. Please watch the 2020 Disney Mulan before reading this article.) Hua Mulan (花木兰) was a fictional heroine who impersonated a man and won many battles against the Rouran Khaganate(柔然), an alliance of nomadic tribes. Over time, the Hua Mulan story was shared in different ways through books, songs, cartoons, and many stage and screen adaptations. The latest version was the 2020 action movie produced by Walt Disney Pictures. From the movie, you can learn at least five lessons to help you respond to the COVID-19 pandemic and become a better human and leader. 1. Anchoring To Timeless Values While Adapting To The Times Loyalty, Bravery and Truth were values that were upheld by Mulan and her father, and these values were also shared by her army. To adapt to the new environment caused by COVID-19, it’s important to make changes to your life and workplace. However, there are timeless values that you should hold close to your heart and practise throughout your life. For example, the first and last line of defence against COVID-19 is your physical, mental, emotional, psychological and spiritual well-being. If your internal world is not right, the external world can go wrong. Reflection: What are the values that you should uphold in your life, including at your workplace that can put you in a better position to progress and succeed through the pandemic and thereafter? 2. Taking A Different Route Without Burning Bridges Since a young age, Mulan knew that she was different, and she was daring enough to be different so as to make a positive difference. In a similar way, you need to take courage to make not only linear but also exponential improvements to your knowledge and skillset, and also to your career and workplace so as to achieve radical results and impacts. Reflection: How can you transform your operating mindset, principles, and behavior so as to chart a brighter path in the new world? 3. Preparing For The Future With An Eye For The Present While being mindful about not revealing her true identity at every given moment in the army, Mulan had to also train and train hard for the battles ahead of her. In a similar way, while focusing on resolving current challenges, you have to continue to build skill, reskill, upskill, deep-skill and multi-skill yourself to adapt to the new and wonderful world of abnormal. Reflection: How can you redesign, reengineer and reinvent yourself for the exciting new world? 4. Taking A Strategic Approach Without Losing Sight Of Being Opportunistic In the movie, Commander Tung’s strategy to leave the advantages of a fortress to engage the Rourans in the open could have put his army at a disadvantage. In addition, during the heat of the battle, he ordered some of his limited number of soldiers to pursue Bori Khan's troops and in doing so, caused the deaths of some of his soldiers. On the other hand, Mulan was able to rise above the noises to appraise the situation. Made strategic moves to go around the enemies, and entrenched herself on a higher ground. Diverted the Rourans’ trebuchet towards the mountain and triggered an avalanche to wipe out the enemies. To achieve success during the pandemic, you need to solicit relevant information and spend time analyzing the information so as to craft your plans and strategies and keep improving them. At the same time, you need to continue to appraise the ever-changing situation and spend time in reflection. Reflection is one of the keys to unlock the vault of wisdom. Case in point, in the process of her struggles, Mulan saw her reflection in the pond and sword, and was able to achieve mental breakthroughs that put herself in a better state. Just as importantly, be ever-ready to capitalize on unplanned and unpredicted opportunities that can emerge in the heat of any challenges. Reflection: What are the silver lining in every cloud that even in a dark night, you can exploit for your profit, advantage and growth? 5. Fulfilling Obligations While Serving A Higher Calling Mulan knew that she had to fulfill her obligations as a member of her family and community. She had to subsequently discharge her roles and responsibilities as a friend and soldier. However, that didn’t stop her from standing up for truths and wisdom. In the process, she learned to be optimistic without being unrealistic. As Milan’s father would say, there’s no courage without fear. She bided time to rise up to do more and do better for her people and country. Eventually, she learned how to be authentic and take charge of her destiny. Reflection: How can you fight COVID-19 while learning how to take a helicopter view of the situation to fulfill a higher calling and serve a worthier cause? May the positive spirit and virtues of Mulan be with you on the journey of life. ",
            "date": "Updated September 12, 2020",
            "views": "185",
            "upvotes": "0"
        }
    ]
}