{
    "title": "How can the conflict between Armenia and Azerbaijan be resolved? - Quora",
    "tags": [
        "Azerbaijan (country)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anar Suleymanov",
                "href": "/profile/Anar-Suleymanov-5"
            },
            "answer_text": "In 1988 our Armenian neighbor Karapetyan’s family suddenly started to change towards Azerbaijanis. Before that they acted like helpful and peace loving. We dont know what happened with their Armenian mind but real fce of them revealed after. One day Mrs. Karapetyan was screaming at Azerbaijani kid in the street because that kids were playing football and being a bit noisy. It was not first time that kids were playing football and being noisy, it was normal thing. They are kids. She was screaming something in Armenian and she frequently used the word ‘Turkes’. Neighbours was in shock because it was unusal to scream outside. Neighbours started to cut relations with that Armenian family. After several days when protests in Armenia against Azerbaijanis living in Armenia that family members started to claim openly that ‘Nagorno Karabakh is part of Armenia’. It was impudent behavior by Karapetyans. You live in Azerbaijan you living among Azerbaijanis you act like Azerbaijanis owe you something. It is vulgar and immoral. Azerbaijanis started gradually cut relations with their Karapetyan neighbour. In 1989 that Armenian family were dismissed from their home by Azerbaijanis who were deported from Erevan. At that time Erevanian Azerbaijanis were very angry towards Armenians as they was deported from their own homes. Can anyone tell me how my kids in future be in safe living in the same country in neighborhood with Armenians? How I can be sure that we will never face troubles by Armenians? Either it be war or peace my main desire as citizen of Azerbaijan is to avoid living in the same place with Armenians. ",
            "date": "Answered June 20, 2018",
            "views": "366",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Khagan Ahmadov",
                    "user_href": "/profile/Khagan-Ahmadov"
                },
                {
                    "user_id": "Shemseddin Amanov",
                    "user_href": "/profile/Shemseddin-Amanov"
                },
                {
                    "user_id": "Naz Jahan",
                    "user_href": "/profile/Naz-Jahan-7"
                },
                {
                    "user_id": "Nedim Değirmenci",
                    "user_href": "/profile/Nedim-Değirmenci"
                },
                {
                    "user_id": "Ibrahim Mammadov",
                    "user_href": "/profile/Ibrahim-Mammadov-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Artur Aslanyan",
                "href": "/profile/Artur-Aslanyan"
            },
            "answer_text": "I will write my answer in general terms as there are numerous scenarios that could potentially work. The conflict can only be solved with compromise. Old-fashioned conflict resolution through good will, united goals and compromise. None of these are possible because both countries pursue zero sum policies. It is either “I get everything I want” or nothing. The first and foremost step is the establishment of good will. Both sides do not trust each other so any compromise is viewed as extremely dangerous. It is assumed that the other side has nothing but absolute ill will toward your people and compromise will allow the other side to harm your people. This, unfortunately, is quite true at the moment. The sides DO have nothing but ill will toward each other. Armenians view Azerbaijanis as the same Turks that slaughtered their ancestors a century ago and Azerbaijanis see Armenians as a devious, backstabbing people who always “steal” and kill Turks. With this type of general attitude of the people (and with the case of Azerbaijan, actual government support for this type of bigotry), there can be no avenues of compromise. This must be remedied first and foremost. After a trust is established between the two sides and a “good will” is assumed, then compromises must be made by each side to reach an eventual goal of settlement. These compromises will primarily be of a territorial nature as the conflict itself is mainly territorial. I can’t stress how Herculean the first step is. There are entire state history departments dedicated to pseudohistories in order to write out the “other” from the history of the region. How can a conflict be settled when official steps are being taken to claim that the other side doesn’t even have the right to a state (or even live in the region)? The future of settlement unfortunately is dire because of this reality. The forecast is war and more war until the two nation’s attitude about each other is changed from the very roots. ",
            "date": "Answered June 6, 2018",
            "views": "18",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yagub Aslanov",
                    "user_href": "/profile/Yagub-Aslanov"
                },
                {
                    "user_id": "Horváth Kristóf",
                    "user_href": "/profile/Horváth-Kristóf-5"
                },
                {
                    "user_id": "Kamran Huseynzade",
                    "user_href": "/profile/Kamran-Huseynzade-1"
                },
                {
                    "user_id": "Ferhad Mehdiyev",
                    "user_href": "/profile/Ferhad-Mehdiyev"
                },
                {
                    "user_id": "Ali Valizada",
                    "user_href": "/profile/Ali-Valizada"
                },
                {
                    "user_id": "Zhorzh Zakaryan",
                    "user_href": "/profile/Zhorzh-Zakaryan"
                },
                {
                    "user_id": "Vusal Gasimzade",
                    "user_href": "/profile/Vusal-Gasimzade"
                },
                {
                    "user_id": "Ruben Balyan",
                    "user_href": "/profile/Ruben-Balyan"
                },
                {
                    "user_id": "Caroline Limbonhai",
                    "user_href": "/profile/Caroline-Limbonhai"
                },
                {
                    "user_id": "Peter Norgaard",
                    "user_href": "/profile/Peter-Norgaard-1"
                }
            ]
        }
    ]
}