{
    "title": "How, when and why did German nationalism and German liberalism part ways? - Quora",
    "tags": [
        "Historical Germany",
        "German Ethnicity and People",
        "Nationalism",
        "Liberalism (politics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kjell Andersson",
                "href": "/profile/Kjell-Andersson-8"
            },
            "answer_text": "The political dualism between Liberalism and Conservatism was created after the Napoleonic wars. Conservatives believed that political legitimacy comes only from God who appoints a sovereign ruler, a king if it is for a country or a people, an Emperor if it is for the world. All other authorities must be derivatives from the sovereign. Conservatives were aiming to restore Europe as it was before Napoleon made a lot of disorder. Liberals believed that political legitimacy spreads from the botom and up. No legitimacy beats being elected by the people. Democracy! That was what liberals put up against the Conservatives claims. Democracy means: Rule by the people. This requires that there is a people. One people. You can not claim legitimacy from democracy if there is not one people. Liberals promoted a nation state as it was necessary for democracy. The Conservatives promoted diversed societies. A lot of different categories of humans all with their own sets of privileges and duties. The sovereigns job was to preserve society with all its groups and subgroups that were all busy to please the ruler to preserve their privileges and reduce their duties. Today we would call it multiculturalism. Bismarck created the German Empire in 1870 to make Prussia safe for Austrian Imperialism. To do this he high jacked German nationalism. Germany was created by excluding lands where Germans were a minority. This created a German people. The Empire had a parliament, the Reichstag, elected by universal male suffrage. This gave legitimacy to the Empire in the Liberal way. The government was appointed by the Emperor, just the way the government in the USA is appointed by the President. This gave legitimacy to the Empire in the Conservative way. German Conservatives were amazed by Bismarcks success. Suddenly they could argue against Liberals. We have created a nation state. That was what you have been arguing for. You have universal suffrage to the Reichstag. That is what you have been dreaming of. You have no right to complain. The new nation state was also a power house. One people united in one Empire! That was a recipe for success. Minorities were no longer an asset for the ruler but a problem. All citizens should assimilate into the German ethnicity. And by the way: Citizens are also subjects to the Emperor. ",
            "date": "Answered October 15, 2018",
            "views": "224",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pavlos Daskalakis (Παύλος Δασκαλάκης)",
                    "user_href": "/profile/Pavlos-Daskalakis-Παύλος-Δασκαλάκης"
                },
                {
                    "user_id": "Mirek Kowal",
                    "user_href": "/profile/Mirek-Kowal-2"
                },
                {
                    "user_id": "Joe Djoremy",
                    "user_href": "/profile/Joe-Djoremy"
                },
                {
                    "user_id": "Debadree Chatterjee",
                    "user_href": "/profile/Debadree-Chatterjee"
                }
            ]
        }
    ]
}