{
    "title": "I always hear that in real life, swords were not widely used and they were not very effective. How true is that? - Quora",
    "tags": [
        "Sword Fighting",
        "Swords",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Suttle",
                "href": "/profile/Chris-Suttle"
            },
            "answer_text": "It depends on what time period and what type of “real life” your referring to. During some parts of history sword fighting was taught with the same reverence as reading and writing and was considered part of a mans every day attire and the sign of a good education and higher upbringing. In military life there was a time where swords were all that were used and then in conjunction with other second handed weapons or shields. As to their effectiveness it depends on the sword. Early swords made from bronze or stone would be considered ineffective compared to steel but at the time of their use they were considered a marvel of modern invention. Once they were made from steel there was still different variations some being more effective than others such as folded steel forces cut or pressed steel. Are they as effective as guns or other projectile type arsenal? No, but why carry a sword when you can carry a gun? When comparing a sword to a sword and not to another type of weapon they were highly effective and used quite frequently by military and civilians alike. ",
            "date": "Answered May 14, 2019",
            "views": "930",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin P",
                    "user_href": "/profile/Kevin-P-78"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Lagrange-L"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Shrimp",
                "href": "/profile/Tom-Shrimp"
            },
            "answer_text": "Historically swords are used as sidearm. The battlefield weapon are spear. It takes skill to use swords effectively for things like edge alignment, false edge cut etc. Swords evolve from being short and gets longer with fancy handguard for range advantage with worse concealment as trade off. Nowaday Machete is the closest replacement. ",
            "date": "Answered May 14, 2019",
            "views": "281",
            "upvotes": "0"
        }
    ]
}