{
    "title": "I hear about Norwegian and Danish Vikings but I can’t find anything about Swedish Vikings. Does anybody have any knowledge of Swedish Vikings? - Quora",
    "tags": [
        "Swedish Ethnicity and People",
        "Vikings",
        "Sweden"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lars Eidevall",
                "href": "/profile/Lars-Eidevall"
            },
            "answer_text": "Swedish Vikings went mainly East of the Elbe and were called Varangians. Sweden did not have a West coast until the 1600s…the Geats lived in East and West Geatland, and Swedes lived by the East coast. Most of the Runestones from the Viking Age are found in Swede territory around Stockholm, and they talk about going to Greece (Constantinople), or via Novgorod to the Caspian Sea, and some to England. Varangians are bound together by oaths, and Russians call them Varjags - outsiders asked in to help. Slavic tribes asked them for help against Khazars and Bulgars, so they became the Rus dynasty. And then the Varangian guard in East Rome, who were recruited from the North. The Baltic Sea was called Varangian Sea in Arabic at the time. Swedish is called Ruotsi or Roots in Finnish and Estonian. Ruotsi - Wiktionary Trading on Eastern rivers on the Amber road had been done by Scandinavians since the Bronze Age. And Birka was the trade center in the Viking times with foreign slave craftsmen. Gotland was a strong trade center as well, which later became Swedish, like Scania, where Uppakra was a religious center. The Swedish Vikings controlled trade routes via Volga and Dniepr with Constantinople, Khazaria and the Silk Road, and spices like saffron, ginger and cinnamon were imported to Sweden from this time on. Ingegerd Olofsdottir was a Swedish Viking princess who was married to prince Jaroslav of Rus, after that he had sought refuge by the Swedes. Ingermanland or Ingria was named after her. And their daughters were married into the royal houses of Norway, Hungary and France at the end of the Viking age. ",
            "date": "Updated October 6, 2020",
            "views": "460",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rune Ørnfeldt Svensson",
                    "user_href": "/profile/Rune-Ørnfeldt-Svensson"
                },
                {
                    "user_id": "Christian Desaix",
                    "user_href": "/profile/Christian-Desaix"
                },
                {
                    "user_id": "Björn Petersson",
                    "user_href": "/profile/Björn-Petersson-3"
                },
                {
                    "user_id": "Mohammad Yamini",
                    "user_href": "/profile/Mohammad-Yamini"
                },
                {
                    "user_id": "Myrtle Gutierrez",
                    "user_href": "/profile/Myrtle-Gutierrez"
                },
                {
                    "user_id": "Marty C MacMurtrie",
                    "user_href": "/profile/Marty-C-MacMurtrie"
                },
                {
                    "user_id": "Kim E Ellingsen",
                    "user_href": "/profile/Kim-E-Ellingsen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erik Hörnfeldt",
                "href": "/profile/Erik-Hörnfeldt-1"
            },
            "answer_text": "You have to look at the era before the proper viking age, the vendel age from 550 to 600 AD. In Sweden it brought a blossoming of culture and left very rich artefacts          Swords were forged, ships were built and battle fought. Most forgotten now but armies seems to have been horseridden like the Rohirrim in Lord of the Rings and once there was a major battle between two horseridden armies on the ice of Lake Vänern. It must have been a sight to behold. Even less is known about Vendel age than about the Viking times but the finds are much richer and seems more advanced and ornate. Also, it was during this time that scandinavs started to go abroad. The people from present day Sweden started exploring the rivers into what is now Russia and lay the foundations for what would become Russia. They worked as bodyguards in Istanbul and Baghdad and we find bhudda statues in vendel era graves. And this kickstarted the age of viking raiding and exploration It was a time of fortunes made and spent. Just look at that second helmet above. It is a reconstruction but still, think about the pride that would come from wearing it ",
            "date": "Answered August 11, 2020",
            "views": "560",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erik Alapää",
                    "user_href": "/profile/Erik-Alapää"
                },
                {
                    "user_id": "Kari Autero",
                    "user_href": "/profile/Kari-Autero"
                }
            ]
        }
    ]
}