{
    "title": "I've recently heard that all Germans have blond hair and blue eyes. Doesn't that make them more 'Nordic' than Scandinavians? - Quora",
    "tags": [
        "Nordic Countries",
        "Scandinavia",
        "German Ethnicity and People",
        "Genetics and Heredity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Nikolaussen",
                "href": "/profile/Nick-Nikolaussen"
            },
            "answer_text": "It’s incorrect. Awfully incorrect. Not all Germans have blond hair nor blue eyes. Same for the nordic people of Scandinavia. Both are very heterogenous populations. But let’s play with the idea a bit: (I) First of all, the assumption that “all” Germans have characteristic traits is incorrect. Because: (1)There is no such thing as a Proto-Germanic look to relate. (2) What is the definition of “German”? Even if you will go through history of Germany, you will see how irreliable this terming is. Does holding a German passport makes, speaking fluently German, being raised in Germany, and identifying yourself as German makes you German? What are the criteria of being German is strongly associated withe the person you ask about. (3) Approaching it through set theory superimposed on the real world, it is very hard to “prove” with increasing n, that some given characteristics holds for all elements of a given set. (Simple example: I have 1 million blue balls in the pool. I can state than, that every ball in the pool is blue. BUT as soon as I add 1 white ball, I can not state the previous statement anymore. Nonentheless I can state, that every element in the pool are balls) (II) Same holds for Nordic people. Are you refering to nordic people as for the sami or are you refering to icelandic people, or other? Even in the “nordic” part is a huge heterogeneity. (III) The spectrum of variety of human traits is to vast, to pinpoint some traits here and there and say “okay, blonde hair and blue eyes now are you nordic”. (IV) It is true to say though that there is some “homogeneity in this heterogeneity” when regarding, the regions people inhabitate, but thus are only tendencies, not rules (V) There is no such thing as more “nordic” or less “nordic”. Why? Because it is subjective and it is incorrect to quantify it in any given way. Why? Because of the aforementiened heterogeneity and because of the modern understanding of the identity. (VI) There is one particular guy, who thought that way (german race, nordic, more nordic and so on), but just look at the guy’s picture and see how his statements does not even hold on himself. ",
            "date": "Answered June 15, 2020",
            "views": "183",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Gilmore",
                    "user_href": "/profile/Stephen-Gilmore-23"
                },
                {
                    "user_id": "Red Devine",
                    "user_href": "/profile/Red-Devine"
                },
                {
                    "user_id": "Annica Sandberg",
                    "user_href": "/profile/Annica-Sandberg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Pleece",
                "href": "/profile/Ron-Pleece"
            },
            "answer_text": "No, that makes them no existant because while there are many blonde hsired blue eyed Germans there are a great deal of them who are not, possibly if not definately the majority are not. It means that whom ever told you this has never been to Germany and full of shit. ",
            "date": "Answered June 17, 2020",
            "views": "23",
            "upvotes": "0"
        }
    ]
}