{
    "title": "If Article 48 of the Weimar Constitution only gives plenary power to the president, how did Hitler get this power as chancellor? - Quora",
    "tags": [
        "Weimar Republic",
        "Politics of Germany",
        "Historical Germany",
        "Constitutions",
        "Adolf Hitler",
        "Nazi Germany",
        "Germany",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gareth Adamson",
                "href": "/profile/Gareth-Adamson"
            },
            "answer_text": "Not quite sure what you mean by plenary power here. The constitution did not grant unlimited power to anyone, and had its checks and balances, but there were ways these could be undermined, and plenty of people (including Hindenburg) keen to undermine them. For instance, the constitution granted the president the power to rule by decree, in certain circumstances supposed to be emergencies, but each decree was supposed to be subject to parliamentary veto. However, it also gave him the power to dissolve the parliament, delaying by months any opportunity to use its veto. That happened. After Hitler became Chancellor, but without a parliamentary majority, he used the Reichstag Fire to persuade Hindenburg to issue emergency decrees, which he in turn used to arrest opposition members of parliament, giving himself an artificial majority. Combining these arrests with various forms of cajolement and persuasion, he cobbled a 2/3 majority to pass an Enabling Act, giving himself the power to rule by decree and suspend the constitution. This manoeuvre was of highly dubious legality, but the only person with the authority to challenge it, or dismiss Hitler as Chancellor, was Hindenburg. For the rest of Hindenburg’s life, Hitler was very careful to flatter him and keep him sweet. As soon as he died, Hitler used his Enabling Act powers to abolish presidential elections and combine the offices of President and Chancellor, with the new title of Leader (Fuehrer). ",
            "date": "Answered April 18, 2019",
            "views": "165",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Luca Dhagat",
                "href": "/profile/Luca-Dhagat"
            },
            "answer_text": "If you’re referring to how he used those powers to retaliate for the burning of the Reichstag, he convinced Paul Von Hindenburg(the president at the time of when Hitler was chancellor) to allow him to crack down on political enemies of the Nazi Party. Other than that, Hitler had actually experienced quite a few threats from Hindenburg when his party got too rough in the streets. I remember more than once that he threatened to shut down the Sturmabteilung(SA) for incidents in the street. ",
            "date": "Answered April 12, 2019",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gareth Adamson",
                    "user_href": "/profile/Gareth-Adamson"
                }
            ]
        }
    ]
}