{
    "title": "If a firearm has a longer barrel, does it make it more accurate? - Quora",
    "tags": [
        "Barrel",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Gordon",
                "href": "/profile/Tim-Gordon-8"
            },
            "answer_text": "If a firearm has a longer barrel, does it make it more accurate? Not necessarily, but it can. The optimum barrel length for a given load in a given cartridge is precisely the amount of barrel length for complete combustion of the propellant to occur. Any less than this, and you not only have not achieved the highest possible velocity for the bullet, but that uncombusted gas will ignite at the muzzle and create a bright flash. Any more than this, and the bullet will begin to lose velocity as the pressure decreases. Additionally, the longer the barrel is, the less rigid it tends to be and the more it will flex as the gun is fired. Some of the most accurate barrels can be seen on some .22 rifles. The .22 Long Rifle produces gas that is completely ignited in about 14″ of bullet travel thorough the barrel, and US law states that 16″ is the legal minimum length for a rifle not taxed under the National Firearms Act. Some barrels are that 16″ legal minimum length but are very close to an inch in diameter, so the bore is less than 1/4 of the outside diameter of the barrel. There is very little ‘whip’ happening with these barrels thanks to that rigidity, low pressure (only about 20,000 PSI peak), and a small, soft bullet that doesn’t contort much to engage the rifling. A longer, tapered, thin barrel will move ever so slightly more, and this will have an effect on accuracy. A long, thin barrel chambered for a hot centerfire cartridge will flex quite a bit more, and this may be amplified as it heats up with subsequent shots. Most precision shooting done today is performed with the aid of a telescopic sight, but when ‘iron’ sights are used, a longer barrel increases what is known as the ‘sight radius’, or distance between the front and rear sight. That will tend to lead to more accurate sighting of the firearm, but will not affect the inherent accuracy. Many of the old blackpowder rifles that had a hexagonal barrel, low pressure, maybe shallow rifling grooves, a soft bullet, plus a tang-mounted rear sight were capable of splendid accuracy since they had everything going in their favor. Many quality air rifles have some of the same attributes and are insanely accurate. Careful handloading of cartridges can be used to mitigate the ‘whip’ of long, thin barrels as well as tailor the propellant charge for best performance in any given rifle, but it does take considerable experimentation, sometimes, to discover the winning formula. ",
            "date": "Answered April 5, 2017",
            "views": "25",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Anderson",
                    "user_href": "/profile/Michael-Anderson-884"
                },
                {
                    "user_id": "Mark Doss",
                    "user_href": "/profile/Mark-Doss-5"
                },
                {
                    "user_id": "Sanjay Dubey",
                    "user_href": "/profile/Sanjay-Dubey-46"
                },
                {
                    "user_id": "Angel Guia",
                    "user_href": "/profile/Angel-Guia"
                },
                {
                    "user_id": "Charles Wehali",
                    "user_href": "/profile/Charles-Wehali"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Ven Horst",
                "href": "/profile/Jay-Ven-Horst"
            },
            "answer_text": "A lot of people are giving part of the answer. Most of the time when people assume longer barrels are more accurate. We start with pistols, the increase in sight radius makes small errors in the sights more visible making it easier to correct for, causing most Shooters to shoot the gun better making them think the gun shoots better because it is never the Shooters fault. This tends to be another reason rifles are more accurate than pistols, longer sight radius and the gun is tucked to the shoulder making it steadier also, which reinforces the idea for most Ssooters that the longer the barrel is the more accurate the gun is from a false conclusion. The shorter and stiffer the barrel is the more accurate a gun tends to be, but it need to be balanced with a cartridge desired velocity. Velocity, barrel harmonics, round choice, powder choice, Bullet choice, all and more that I can't go into in enough depth to help. To answer the question, with in reason, barrel length does not determine accuracy. I read a report many years ago, they took a 10 and a half inch barrel Ruger Blackhawk 44 magnum and checked accuracy and velocity out of a Ranson rest. Then they cut it of to 10, 9,8, 7 1/2 , 7, 6, 5, 4, 3, 2 1/2, 2, 1 and even shot it wit no barrel. They were trying to prove or disprove the old adage that you lost or gained a hundred feet per second per inch. I don't remember the exact numbers but we will say for sake of discussion they had highest velocity at 7 inches and best accuracy at 3 inches. It disproved the old adage of 100 FPS per inch. The exact numbers don't matter because if you took a different gun or even the same gun with a new barrel the numbers would more than likely vary and give different best accuracy length and optimum velocity length. There are what I call the mystical or magical variables that we don't know or understand along with the variables in machining etc we do know. One last tip, al2ays remember the barrel crown is the most important part of a gun, it is the last part that touches the bullet and if it is damaged a gun usually will not shoot. Hope this helps. ",
            "date": "Answered April 4, 2017",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Doss",
                    "user_href": "/profile/Mark-Doss-5"
                }
            ]
        }
    ]
}