{
    "title": "If acoustic ('vinyl') records were to be invented today, what would they be made from, considering modern manufacturing techniques and cost? - Quora",
    "tags": [
        "Acoustics",
        "Vinyl",
        "Vinyl Records",
        "Music Recording",
        "Audio Recording",
        "Invention and Inventions",
        "Manufacturing",
        "Music Industry",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fernando Garajalde",
                "href": "/profile/Fernando-Garajalde"
            },
            "answer_text": "The problem I have answering this question is one on the way technology is developed. Try to follow along with this without judgment: it would not have been possible for science to have developed without the critical theories of Euclid, Aristotle, Pythagoras, Newton, Hertz and many others that predated the invention of sound reproduction devicesalso the agreement among scientists and inventors to understand Latin and English as universal languages to write down and share their discoveries among others around the worldthe invention of the telegraph (which created a system of transmitting information via variations in voltage across copper wires strung between two devices) and the subsequent investments in making this a worldwide system (across continents and oceans) plays a critical role in the development of transferring information across great distances. This was followed in a couple of generations with the telephone.the telephone opens up the possibility to Bell, Edison, Marconi and Tesla among others that mixed sound (including conversations and music) could be transmitted real-time across the globe without wires and requiring only receiving devices for the average citizen to capture this soundfrom the radio grew the search for a medium to capture these sounds and replay them on other devices so that one could listen to those sounds repeatedly. Here’s where the record album (ceramic, celluloid, later vinyl plastic) as well as the wire recorder and the introduction of sound into motion pictures (a separate evolution) came to beMY POINT: discovery occurs in sequences that are interrelated and cannot be developed into shortcuts. The atomic bomb, for instance, would never have developed without a sequence from Aristotle’s “discovery” of atoms and later scientists (the Curies for example) who discovered radiation escaping from certain elements. IN A PARALLEL WORLD where “acoustic records” developed independently from other factors, it would be so expensive that it would be doubtful whether this would have been developed for the general public. It would likely take generations from the “acoustic record” to be mass produced and cost-effective from the wealthy person through various government-science projects and would still require capital investment and a risk for someone to attempt to make acoustic records available to the general public at an affordable price. NOTE: you have your own opinions and I suggest you share these using the “Answer” button under the question so your reply can be seen and appreciated by the general masses. As a rule, I only respond to “comments” very rarely but definitely in cases where I feel a person is inclined to approach this as a “public debate” rather than a general discussion and sharing of views. Thank you all for using the “Answer button”! ",
            "date": "Answered September 10, 2020",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Wilson",
                "href": "/profile/Alan-Wilson-9"
            },
            "answer_text": "Pretty sure they would still be vinyl, otherwise people making records now would be making them out of whatever other material was better. And I've never heard analog recording referred to as “acoustic” before, that generally means played using instruments that don't use electronics. A completely different thing ",
            "date": "Answered September 10, 2020",
            "views": "68",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shivani Singh",
                    "user_href": "/profile/Shivani-Singh-3334"
                },
                {
                    "user_id": "Suraj Singh",
                    "user_href": "/profile/Suraj-Singh-5832"
                }
            ]
        }
    ]
}