{
    "title": "If Abraham came from Sumeria and went to Canaan, where did the Canaanites come from before they got to Canaan? - Quora",
    "tags": [
        "Canaanites",
        "Canaan",
        "Abraham (biblical figure)",
        "Israelites",
        "Judaism",
        "Ancient History",
        "The Bible",
        "Christianity",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Valeria Clark",
                "href": "/profile/Valeria-Clark-5"
            },
            "answer_text": "The Canaanites came from the Tribe of Canaan. Ham (Hebrew meaning hot, burnt, black) was part of the family of eight who survived the great flood. Descendants of Ham populated Africa and parts of Asia. The word Ham is comes from the word Khawm which means “black, hot, and burnt” in Hebrew. Ham had 4 sons, Cush, Mizraim, Put, and Canaan.They make up the AFRO-ASIATIC FAMILY. The Bible stated that Ham and his sons, and their soon-to-be descendants lived and became the forefathers of the modern African continent, the modern Middle East, and the modern West Asia.According to Jubilees 10:29–34, Canaan'steadfast refusal to join his elder brothers in Ham's allotment beyond the Nile, and instead \"squatting\" within the inheritance of Shem, on the eastern shores of the Mediterranean, the region later promised to Abraham: And Canaan saw the land of Lebanon to the river of Egypt, that it was very good, and he went not into the land of his inheritance to the west (that is to) the sea, and he dwelt in the land of Lebanon, eastward and westward from the border of Jordan and from the border of the sea.And Ham, his father, and Cush ( Ethiopia) and Mizraim ( Egypt) his brothers said unto Canaan: 'Thou hast settled in a land which is not thine, and which did not fall to us by lot: do not do so; for if thou dost do so, thou and thy sons will fall in the land and (be) accursed through sedition; for by sedition ye have settled, and by sedition will thy children fall, and thou shalt be rooted out for ever.Dwell not in the dwelling of Shem; for to Shem and to his sons did it come by their lot. Cursed art thou, and cursed shalt thou be beyond all the sons of Noah, by the curse by which we bound, ourselves by an oath in the presence of the holy judge, and in the presence of Noah our father.' But he did not hearken unto them, and dwelt in the land of Lebanon from Hamath to the entering of Egypt, he and his sons until this day. And for this reason that land is named Canaan.1399 BC CANAAN IS DIVIDED BETWEEN THE TRIBES In approximately 1399 BC, Joshua assigned a specific territory in the Promised Land to each tribe, even though there remained much of the land of Canaan yet to be conquered. The first parcel was given to eighty-five-year-old Caleb, the faithful spy (Numbers 13) to whom Moses had promised the hill country of Hebron for his faithfulness (Joshua 14-22).",
            "date": "Answered February 26, 2020",
            "views": "139",
            "upvotes": " Answer requested by Gohan Saiyan",
            "upvoters": [
                {
                    "user_id": "Andy Bach",
                    "user_href": "/profile/Andy-Bach-1"
                },
                {
                    "user_id": "David Cary",
                    "user_href": "/profile/David-Cary-24"
                },
                {
                    "user_id": "Jon Collman",
                    "user_href": "/profile/Jon-Collman"
                },
                {
                    "user_id": "Greg Seller",
                    "user_href": "/profile/Greg-Seller"
                },
                {
                    "user_id": "Wayne Davis",
                    "user_href": "/profile/Wayne-Davis-10"
                },
                {
                    "user_id": "Solomon Gorlick",
                    "user_href": "/profile/Solomon-Gorlick-1"
                },
                {
                    "user_id": "Robert Wilson",
                    "user_href": "/profile/Robert-Wilson-77"
                },
                {
                    "user_id": "Jan Thorsted",
                    "user_href": "/profile/Jan-Thorsted"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Ben Waldock",
                    "user_href": "/profile/Ben-Waldock-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dick Harfield",
                "href": "/profile/Dick-Harfield"
            },
            "answer_text": "I will take a historical approach to this question. This means that Abraham did not come from Sumeria and go to Canaan, in fact he did not really exist. The story of Abraham began as a myth and was added to and elaborated over the centuries, especially during the Babylonian Exile and even the early centuries of the Common Era (CE). The Canaanites had already occupied the southern Levant from the beginning of the Early Bronze Age, when they probably displaced their Neolithic predecessors. For the most part, they occupied the Mediterranean coast, but sometimes also occupied the more arid cisJordan highlands. By the Late Bronze Age, the highlands had largely been abandoned, as an easier and more prosperous life could be had in the coastal cities and villages. The start of the Early Iron Age occurred at a time of conflict and population displacement all around the region. Archaeologists say that some rural Canaanites left the rich coastal plains to resettle the cisJordan highlands, spreading slowly southwards from the Jezreel Valley and eventually to include Judah in the south. When Pharaoh Merneptah arrived with his army, to put down an uprising among the Canaanite cities, he encountered these people in the highlands and, in a stele he erected in honour of his campaigns, referred to them as “Israel”. ",
            "date": "Answered February 26, 2020",
            "views": "29",
            "upvotes": " View 37 Upvoters"
        }
    ]
}