{
    "title": "If all slave states in the United States had seceded from the Union before the Civil War, would the North have still prevailed? - Quora",
    "tags": [
        "Secessionism in the USA",
        "Warfare in the United States",
        "Philadelphia, PA",
        "Slavery",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Cate",
                "href": "/profile/John-Cate-2"
            },
            "answer_text": " It would have been more difficult, but if they were as determined to keep the Union together as they were in actuality, they still should have won the war. The slave states that stayed in the Union were Missouri, Kentucky, Maryland and Delaware. Had they all seceded, the northern fronter of the Confederate States of America would have been much farther to the north of where it actually was. In addition, the national capital of Washington, D.C. would have been surrounded by seceded states. It’s not certain how much of an advantage this would have given the South, though. It’s quite possible that Maryland and Kentucky would have seceded if not for the presence of massive Union forces in those states early in the conflict. Kentucky actually tried to declare itself “neutral,” and bar troops from either side from entering. The Confederates unwisely violated this declaration of neutrality (which was of questionable legality anyway) first, and then Union troops poured into the state, holding it for the Union. The federal government had already taken steps to hold Maryland militarily, and also seized the territory that became West Virginia during an early campaign, in which none other than Robert E. Lee was unable to hold the region due to a lack of resources. Missouri and Delaware were unlikely to have ever seceded. While the Missouri slaveholders were some of the most rabid pro-slavery advocates in the country, most of the state had very few slaves. In Delaware, slavery was pretty much moribund, but it had a small slave-holding minority that had a lot of clout in the state legislature. Amazingly, these people even tried to keep their slaves after the war was over—arguing that because they had stayed loyal to the Union and therefore were never subject to the Emancipation Proclamation, they shouldn’t have to free their slaves. They didn’t do so until the 13th Amendment was ratified in December of 1865. Most of the supporters of secession in the border states that stayed in the Union actually “went South” and fought for the Confederacy. All of these states except for Delaware had units in the Confederate armed forces. Ironically, one of the official state songs of Maryland, “Maryland, My Maryland!” began as a pro-Confederate hymn, written by a supporter of secession. One of the Confederacy’s strongest leaders, both as a soldier and as a government official, was a Kentuckian, John C. Breckinridge, who had been Vice-President of the United States. There was no way to prevent people from going South and fighting for the Confederacy, but it’s unlikely that the South could have held the border regions even if these states had seceded. They not only lacked the military strength to hold Kentucky and West Virginia against Union opposition in 1861, they failed to even hold most of seceded Tennessee in 1862. Had those states actually seceded, the Union response to hold the border states would have been even stronger than it was. On a side note, nearly every one of these states, including the border states whose “official” state governments did secede, maintained a “government-in-exile” who sided with the other faction. It was one of these that eventually seceded from Virginia in 1863 and formed the new state of West Virginia (which was also of questionable legality). It’s also why the Confederate flag had 13 stars on it, even though only 11 states officially seceded—Kentucky and Missouri’s Confederate “governments-in-exile” also seceded during the war, and the Confederacy launched campaigns into both states in 1862 in order to try to install their own government, and a second one into Missouri in 1864. To a large extent, the issue of which states seceded and which didn’t was more a matter of who, as one famous Civil War general put it, could “get there first with the most men.” ",
            "date": "Answered August 12, 2016",
            "views": "55",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Grayson Roberts",
                    "user_href": "/profile/Grayson-Roberts-1"
                },
                {
                    "user_id": "Mark D. Saint Cyr",
                    "user_href": "/profile/Mark-D-Saint-Cyr"
                },
                {
                    "user_id": "Douglas James",
                    "user_href": "/profile/Douglas-James-41"
                },
                {
                    "user_id": "Armando Garza",
                    "user_href": "/profile/Armando-Garza-14"
                },
                {
                    "user_id": "Darnell Jenkins",
                    "user_href": "/profile/Darnell-Jenkins-5"
                },
                {
                    "user_id": "Bob Karpowicz",
                    "user_href": "/profile/Bob-Karpowicz"
                },
                {
                    "user_id": "Gwydion Madawc Williams",
                    "user_href": "/profile/Gwydion-Madawc-Williams"
                },
                {
                    "user_id": "Aaron Ray",
                    "user_href": "/profile/Aaron-Ray-17"
                },
                {
                    "user_id": "John Dewar Gleissner",
                    "user_href": "/profile/John-Dewar-Gleissner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert P. Collins",
                "href": "/profile/Robert-P-Collins"
            },
            "answer_text": "Probably so, but it would have taken longer. The Confederacy would have been significantly larger and more populous. The Ohio River valley might have become a major theater of the war, as the Union would have had to occupy and subdue Kentucky's river ports on the south bank of the Ohio. And of course there’s the fact that the national capital, Washington, would be surrounded by Confederate territory if both Virginia and Maryland seceded. In our timeline, many people greeted the war with enthusiasm; in this alternate timeline, I imagine things would have turned serious a lot sooner. But in the long run it's unlikely that the South, even if it captured Washington, would have prevailed. There is a legend that in 1861 Abraham Lincoln said about the imminent conflict with the South, \"I hope to have God on my side, but I must have Kentucky.\" He probably never said it, but even if he did, I doubt that he thought the Union would fail unless Kentucky stayed loyal. Lincoln was born in Kentucky. He may have been thinking of the embarrassment that would ensue if his and his wife's native state were to secede only a few months after he took office. (See Daniel Baker's answer for a contrary and well argued opinion.) In any case, Lincoln’s firm insistence throughout 1861–62 that this was a war “to save the Union,” not to end slavery, was calculated to keep the loyal slave states from bolting to the other side. The Confederacy only had seven states when it proclaimed itself in February 1861, and it ended up splitting the other eight slave states with Lincoln. The Rebels got Arkansas, North Carolina, Tennessee, and Virginia. They tried but failed to get Kentucky, Delaware, Maryland, and Missouri. Had they succeeded, they would have added Baltimore, Louisville, and St. Louis to the CSA. In other words, these states would have added more people and more industrial capacity than most Deep South slave states had to offer. So there's that. By the way, the South in the 1860s was not an agrarian backwater as it is often portrayed. Despite its smaller population, it was richer than the North, and while most of its capital investment continued to be in land and slaves, a fair portion was in factories, mines, foundries, railroads, and other industrial projects. Historians now estimate that the southern states surpassed most of the world, including Europe, in their scale of industrialization. Only Britain, France, and the northern United States were ahead of them. The Confederate government oversaw a massive military buildup and even relocated some civilians to produce goods for the army. It also made good use of U.S. weapons and supplies stored in arsenals and forts in the southern states. Food production turned out to be a more serious problem than war materiel — partly because too many farmers continued to grow cotton, and partly because most of the fighting was on southern territory, so southern agriculture ended up feeding armies on both sides. The Confederacy ran out of bread before it ran out of bullets. So would this larger, richer, and more industrialized Confederacy have been able to win the Civil War? It would have stood a better chance, certainly, but I think the most likely outcome would have been an even longer and bloodier war before the Rebels surrendered. This is especially true if historian William Freehling (The South vs. the South and other books) is correct about the role that disaffected white southerners played in bringing down the Confederate government. Anti-Confederate opinion was strongest in Tennessee, North Carolina, and the hilly northern counties of Georgia, Alabama, and even Mississippi. Had the rest of the upper South seceded, it would have brought not just land, cities, and loyal citizens, but an extra-large contingent of anti-Confederate spies, saboteurs, and guerrillas into the CSA. (Edited to note that France was ahead of the South in scale of industrialization.) ",
            "date": "Updated September 6, 2020",
            "views": "16",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Warner",
                    "user_href": "/profile/Steve-Warner-1"
                },
                {
                    "user_id": "Mark D. Saint Cyr",
                    "user_href": "/profile/Mark-D-Saint-Cyr"
                },
                {
                    "user_id": "Andrei Istrate",
                    "user_href": "/profile/Andrei-Istrate-3"
                },
                {
                    "user_id": "Shane Taylor",
                    "user_href": "/profile/Shane-Taylor-77"
                }
            ]
        }
    ]
}