{
    "title": "If ever put in place, would this hypothetical alternative to government work? - Quora",
    "tags": [
        "Sociology",
        "Hypothetical Personal Situations",
        "Political Science",
        "Government",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Weir",
                "href": "/profile/Rob-Weir"
            },
            "answer_text": "People can change their surnames.  So that essentially turns into voluntary arrangements.   You choose who to align with.   It is an idea that has been discussed.   Essentially, today government is a territorial monopoly on certain services, such as security, justice and some infrastructure.   These monopolies might be hierarchical, e.g., at the level of a city, a state/territory and the whole nation, but there are still clear geographical boundaries. So what if we could eliminate the territorial monopoly and \"sign up\" for these services from a provider, regardless of where we lived?   Some of them, like justice, are easier to imagine.  Others, like infrastructure are less so.   You care about the roads where you are.  So the geography is relevant, not arbitrary. However, in the private sector we've been able to overcome some of this.  For example, my electric bill has a separate charge for energy production and energy transmission.  So I have a choice of whether I want to pay for green energy or cheaper, non-green energy.  But it all comes over the same wires.  This is an accounting trick, not a physical channeling of electrons, but it has much the same effect.   I choose what I want and am not constrained by a territorial monopoly. This approach could be applied more broadly, e.g., separate public education infrastructure from delivery of instruction.   So I pay the local government for maintaining the school building, but I can, with other parents, work together to bring in a teacher of our choice to teach in that school. ",
            "date": "Answered May 4, 2015",
            "views": "333",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Oswald",
                    "user_href": "/profile/James-Oswald"
                },
                {
                    "user_id": "Braden Anderson",
                    "user_href": "/profile/Braden-Anderson"
                },
                {
                    "user_id": "Samuel Goodall",
                    "user_href": "/profile/Samuel-Goodall"
                },
                {
                    "user_id": "Michael Lee",
                    "user_href": "/profile/Michael-Lee-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Oswald",
                "href": "/profile/James-Oswald"
            },
            "answer_text": "Law enforcement would be messy.  What if the Smith's decided murder was ok, as long as you only killed Jones's and vice versa.  Micronations work pretty well, as long as no one attacks them.  Neil Stephenson wrote a few books where the world was mostly government by overlapping micronations, each with their own laws (Snow Crash, Diamond Age [I liked Diamond Age better, but like most Neil Stephenson works, it's a bit rambly towards the end.  Still the first third is very good]).  Basically the main problem is you have to figure out of a way for your micronations to peacefully interact with one another. ",
            "date": "Answered May 4, 2015",
            "views": "50",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Braden Anderson",
                    "user_href": "/profile/Braden-Anderson"
                },
                {
                    "user_id": "Thomas Redding",
                    "user_href": "/profile/Thomas-Redding-1"
                },
                {
                    "user_id": "Bart Loews",
                    "user_href": "/profile/Bart-Loews"
                }
            ]
        }
    ]
}