{
    "title": "If every president (past and current) were to run for election in 2020, who would win? - Quora",
    "tags": [
        "2020 U.S. Presidential Campaign and Election",
        "2020 (year)",
        "US Presidential Elections"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Richmond",
                "href": "/profile/Alex-Richmond-20"
            },
            "answer_text": "President James Polk. The 11th President of the United States of America.  Most people I know would be surprised that not only would I say I would elect a democrat president, some would have no idea who I was talking about. He was a one term president because he decided he didn’t want the job, and he would have had a easy win no doubt. When he was running for president, a lot of people said he was a terrible choice, the New York Herald said that a more ridiculous contemptible and forlorn candidate was never put forth by any party. The only reason he received the nomination was because of President Andrew Jackson, who carried a lot of influence in his party at the time (Jackson is the reason the party’s animal is a Jack-ass, fun bonus fact) James was not a intimidating figure, he was short, was often sickly as a child, and obviously was a easily forgettable individual. But similar to hell seed or Roosevelt overcame his sickly nature, James post himself by pushing and exploiting the gifts that he did have. What really made him stand out from other presidents is he actually accomplished everything he wanted to do, I would actually argue he’s the only president who went to the office knowing Sakely what he wanted to do and then got it all done in four years. And this was a man when he knew what he wanted to do, would make a list of these things, and his list was a very impressive goal. He wanted to reestablish an independent treasury system, something that would result in taking government money away from the banks, he wanted to reduce tariffs, and he wanted to acquire some land from Britain And Mexico. Because of him, we have Texas, Nevada, Utah, Arizona, New Mexico, Colorado, Wyoming and California. Not only that, but he also dealt with the Mexican – American war. He did all of this in a four time span, He then refused to seek reelection and went home, dying three months later of dysentery. The man dedicated every fiber of his being the politics, and proved to be incredibly efficient at it, it’s basically because of him we have the phrase “Sea to shining Sea”. Not only did he prove to be an honest and hard-working individual who actually preferred to handle things himself rather than leave it to other people so he could make sure it got done correctly, once he did everything he set out to do he stepped back, something that most politicians these days wouldn’t even think about. He is by far our most under rated and underappreciated president, He may not of been a big celebrity like some other presidents, but I would definitely say he did a better job than most. ",
            "date": "Answered August 10, 2019",
            "views": "366",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Logan Hess",
                    "user_href": "/profile/Logan-Hess-7"
                },
                {
                    "user_id": "Rick Stouten",
                    "user_href": "/profile/Rick-Stouten"
                },
                {
                    "user_id": "Bob Smith",
                    "user_href": "/profile/Bob-Smith-4533"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisa Newson",
                "href": "/profile/Lisa-Newson"
            },
            "answer_text": "This depends. Would they be running on similar platforms that they did when they originally ran? Possibly just more updated for the times? While it’s nice to think that some of our presidents from the distant past were amazing men and leaders (and to an extent they were), it’s hard to swallow that they would be successful today. Despite having a president now who has displayed less than savory behavior, some of our most beloved presidents were racist, slave owners, and had a whole host of additional issues that today would simply be unacceptable. Realistically I’d say the most competitive race of two presidents from two different parties in 2020 would probably be Reagan and Clinton. If Reagan maintained his position on the gay community that he had while he was president, it is likely that Clinton would win. However, it’s likely that if he were to run today that view would have changed. If that’s the case… I wouldn’t be able to call who wins. ",
            "date": "Answered June 9, 2018",
            "views": "117",
            "upvotes": "0"
        }
    ]
}