{
    "title": "If Germany had not attacked the Soviet Union in summer 1941, would the Soviets eventually have attacked them? When would that attack have happened? - Quora",
    "tags": [
        "Alternate Histories (Hypothetical Historical Scenarios)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Howard Yale Lederman",
                "href": "/profile/Howard-Yale-Lederman"
            },
            "answer_text": "The Soviet Union would never have attacked Nazi Germany without solid guarantees of Western aid, neutralization of Japan, and a necessity for the attack. If the US had joined Britain in the war in 1941, that would have made the Soviet Union safe. Such a development would have led to the situation that Stalin hoped for in 1939–1940: The capitalist powers slugging it out with neither alliance winning a decisive victory, both alliances exhausting themselves, and both alliances emerging from the struggle in no position to threaten the Soviet Union. One other possibility: If the West was willing to pay the Soviet Union’s price for support, the Soviet Union would attack Germany, advance westward against little opposition, and extend the Soviet sphere of influence with little cost in blood treasure much like the Soviet Union entered Eastern Poland and the Baltic States in 1939–1940 and Manchuria and Korea in 1945. So, intervention after a long, exhausting war in the West ending in a stalemate was the best situation for Soviet intervention. I can think of only one exception to the above: If the Axis had gained control of the Near and Middle East, thus enabling it to attack the Soviet Union from the south, also. Then, the Soviet Union would have had to intervene to prevent a serious Axis threat from the south. The Soviet Union would have been better off intervening while Britain was still fighting than after a British defeat or even Britain’s destruction. Howard Lederman ",
            "date": "Answered April 19, 2020",
            "views": "77",
            "upvotes": " Answer requested by Kurt Sawyer",
            "upvoters": [
                {
                    "user_id": "Howard Yale Lederman",
                    "user_href": "/profile/Howard-Yale-Lederman"
                },
                {
                    "user_id": "Philip Sutter",
                    "user_href": "/profile/Philip-Sutter"
                },
                {
                    "user_id": "Mohammad Noor",
                    "user_href": "/profile/Mohammad-Noor-92"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christer Antonsen",
                "href": "/profile/Christer-Antonsen"
            },
            "answer_text": "No, the Soviets would not have attacked Germany. Stalin suffered from paranoia, and all he cared about was power.Gambling on a war against the most successful war machine up till that time would put his own power at the gambling table. Stalin and the Soviet Union was very keen on making more and more territory between themselves and the west, and the more territory they got, then most secure they felt. Stalin and the Soviet Union never attacked the western powers during the Cold War, because they simply might lose, and that was the very same thoughts they had about Germany during World War 2 as well. Stalin was building up his military, but that was to make sure the west could never hurt them, it was meant to protect their own survival. not to go on a insane invasion of Europe, which could end in disaster, and even an united Europe VS the Soviet Union. Stalin did hope the west would destroy eachother and make eachother weak though.But this was more ecconomically rather than simply trying to invade the west. Stalin didn’t even trust his closest friends, he would never trust his military to take on the Germans until he had no other options when the Germans was on his door step. ",
            "date": "Answered April 14, 2020",
            "views": "125",
            "upvotes": " View 3 Upvoters "
        }
    ]
}