{
    "title": "If George Washington was running for president today, would you vote for him? - Quora",
    "tags": [
        "George Washington",
        "Hillary Clinton and Donald Trump",
        "Hypothetical Scenarios About the United States of America",
        "Political History of the United States of America",
        "Hillary Clinton",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Trump-Pence 2016",
        "History of the United States of America",
        "Donald Trump (politician, business person)",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Desmond Bolden",
                "href": "/profile/Desmond-Bolden"
            },
            "answer_text": "No. Like many others, I don’t like the fact that Washington owned slaves. He seemed to detest slavery. Yet, he owned quite a few. I don’t have much of a stomach for hypocrisy. From what I’ve read about him, he seemed like a decent and level-headed guy. He was the head of the Continental army, but the book I’m currently reading paints him as an okay general, at best. This book, Ron Chernow’s Alexander Hamilton, describes Hamilton as the man behind the scenes. His skill with a quill was vital to Washington during the Revolutionary War and during Washington’s tenure as president. And that’s just one of the ways he was helpful to Washington. Washington didn’t even want to give him command of a battalion because he so strongly believed that he needed Hamilton. Without Hamilton, or at least someone else to help him, I feel as though Washington would appear to be less impressive than how he’s viewed today. So, what exactly qualified a man like Washington to lead a country? The only thing I’m getting from this book is that a lot of people united behind him, which is good for a nation in its infancy. But that doesn’t automatically make a person fit to lead said nation. ",
            "date": "Answered December 24, 2016",
            "views": "487",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nacho Grimoldi",
                    "user_href": "/profile/Nacho-Grimoldi"
                }
            ]
        }
    ]
}