{
    "title": "If George Washington made himself king who would be the current monarch today? - Quora",
    "tags": [
        "George Washington",
        "Monarchs",
        "Alternate Histories (Hypothetical Historical Scenarios)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Baker",
                "href": "/profile/Daniel-Baker-37"
            },
            "answer_text": "If you follow agnatic succession rules, (i.e. only males can inherit the crown) the present king would theoretically be Paul Emery Washington of Texas. Following cognatic succession rules where females can inherit if no males are available, the question is murkier. George Washington had no children, so the question depends on whether his successor would have been the son of his deceased older half-brother Augustine or the grandson of his deceased younger full brother Samuel. In the one case it would be Queen Brynda Lee Hansen, in the other King Franklin Craig. Britain uses cognatic succession, which presumably America would have imitated. The theoretical regnal dates with cognatic succession through Augustine would be: King George I Washington (r. 1782-1799). King William I Washington (r. 1799–1810). King Bushrod I Washington (r. 1810–1831). King Spotswood I Washington (r. 1831–1865). King Bushrod II Washington (r. 1865–1918). Queen Estella I Washington (r. 1918–1931). King Lee I Washington (r. 1931–1969). Queen Odelle I Washington (r. 1969–2000). Queen Brynda I Hansen (r. 2000-present). Of course, this is all silly, as it presumes that the Washingtons would have made the same marriage choices if they had been reigning monarchs, that they would have lived the same length of time with top medical care available to all of them, that they would have had the same number of children, that none of them would have been assassinated, etc. King of America: Who Would Be Washington's Heir? - Ancestry Blog ",
            "date": "Answered June 8, 2016",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Brockway",
                    "user_href": "/profile/Robert-Brockway"
                },
                {
                    "user_id": "Estus Hibbard",
                    "user_href": "/profile/Estus-Hibbard"
                },
                {
                    "user_id": "Dot McHale",
                    "user_href": "/profile/Dot-McHale"
                },
                {
                    "user_id": "Christopher Ortiz",
                    "user_href": "/profile/Christopher-Ortiz-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Orlando Barrios",
                "href": "/profile/Orlando-Barrios"
            },
            "answer_text": "::If George Washington made himself king who would be the current monarch today?:: A very interesting question. Let’s start with saying that the story about George Washington refusing kingship is a mix of a myth and a misundertanding: The best account of the origins and development of this myth is by Robert F. Haggard, \"The Nicola Affair: Lewis Nicola, George Washington, and American Military Discontent during the Revolutionary War,\" Proceedings of The American Philosophical Society Vol. 146, No. 2, June 2002, pp. 139-169, on line at the APS site here: http://www.aps-pub.com/proceedings/1462/201.pdf Haggard first summarizes how the myth grew by reviewing accounts of it in historical works. The earliest of them, published in 1823, states \"\"a letter was handed to Washington containing the demand of some for a monarchy, and himself the king.\" From there the story grew. As recently as 1984 a prominent American historian wrote that \"Washington’s refusal to countenance Nicola’s scheme ‘signifies the death of the monarchical idea in the United States and the total triumph of representative government.’\" (Haggard p. 142). Haggard’s essay is the fullest answer to the question posed in my title. This short essay simply attempts to amplify and clarify it, and to present the relevant evidentiary documents in an authoritative and accessible format. Haggard writes: …[H]istorians have not always been wary enough of stories that appear tailor-made for their subjects, particularly when the source of that story is another secondary account. The thought of George Washington selflessly refusing the offer of a \"crown\" at the close of the Revolutionary War is so appealing, both to readers and writers of history, that its exclusion from the record would seem almost criminal. Third, biographers have not always treated fairly figures of secondary importance to the life of their primary subject.…That historians have not done so is attributable to one simple fact: they have not read the letters that Nicola wrote to Washington on 22, 23, 24, and 28 May 1782. If they had, they would have known that Nicola was only speaking for himself; that he was not advocating the overthrow of the government of the United States, but the establishment of a new state on its western border; and that he did not offer Washington a crown directly.(pp. 168-9) This is not quite right. Nicola did not \"offer\" Washington a \"crown\" at all, for Nicola had no crown to give. At most, Nicola was floating an idea of his own, but one he was utterly incapable of bringing into being, and gently suggesting that Washington might consider the desirability of establishing a new state, headed by a king. It’s inaccurate, therefore, to say that Washington turned down a chance to be king.[1] But let’s say that Washington was actually offered kingship, and he accepted it. Which was the only institution that could have offered the title? Congress, I think. So, let’s say that Congress decides to institute an elective monarchy, retaining the right to elect a King, a lifelong post with the responsability of carrying out the monarchy's constitutional and ceremonial duties. However, his significant political powers would be actually exerted by a premier/prime minister, turning the United States in a parliamentary republic (since the title of King is not hereditary), with the corresponding changes to the Constitution. His real political power curtailed, the King’s position would be actually ceremonial: an elder stateman (eventually statewoman?) appointed as a figure of authority, and the power and continuity of the State. King George Herbert Walker Bush? Footnotes[1] Did George Washington Turn Down An Offer To Be A King?",
            "date": "Answered June 9, 2016",
            "views": "19",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kyle Samuels",
                    "user_href": "/profile/Kyle-Samuels-4"
                },
                {
                    "user_id": "Daniel Ptashny",
                    "user_href": "/profile/Daniel-Ptashny-1"
                },
                {
                    "user_id": "HRH George J Rickle IV",
                    "user_href": "/profile/HRH-George-J-Rickle-IV"
                },
                {
                    "user_id": "Aryan Kumar Prasad",
                    "user_href": "/profile/आर्यन-कुमार-प्रसाद-Aryan-Kumar-Prasad"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nobody-156"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Jacob Sandman",
                    "user_href": "/profile/Jacob-Sandman"
                },
                {
                    "user_id": "Rupert Baines",
                    "user_href": "/profile/Rupert-Baines"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jason-Blau"
                }
            ]
        }
    ]
}