{
    "title": "If Germany had been treated 180% differently at the Treaty of Versailles, If they had been given crushing reparations and loss of territory and made to accept guilt, would WW 2 have occurred and would the Nazi's have ever existed? - Quora",
    "tags": [
        "Versailles Treaty of 1919",
        "Treaties",
        "World War I",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "World War II",
        "Germany",
        "World History",
        "Military History and Wars ",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Niko Vasileas",
                "href": "/profile/Niko-Vasileas"
            },
            "answer_text": "If Germany had been treated 180% differently at the Treaty of Versailles, If they had been given crushing reparations and loss of territory and made to accept guilt, would WW 2 have occurred and would the Nazi's have ever existed? The very premise of this question is wrong. To begin with Germany was going to lose money and territory by having long the war. That was a given. Germany was prepared to seize money and territory had they won the war—they did so against France in 1871, and against Romania and Russia in 1918. They had also planned to annex large parts of France and Belgium had they won. Germany mostly lost areas that had traditionally been parts of other nations (A-L to France, S-H to Denmark) who had area with large non-German populations for example to Poland. (And no, the Sudetenland does not count as that had been part of AUSTRIA not Germany). Reoperations? Not nearly as crushing, especially since the allies were willing to negotiate and set up payment plans. And again, Germany had demanded on “indemnities” from France twice in the 1800s (though once as the German Confederation of the Rhine) and like I pointed out, from Russia in 1918. And again, they were planning to take them from the allies in the west too. Sure German’s economy was a mess in the early 1920s, but the same could be said for all of Europe, there was no “Marshall Plan” in 1919. But, like the rest of Europe Germany had entered into recovery by the mid 1920s and life had largely turned around. War guilt? There was not “war guilt clause” rather there was a clause that established a legal link between Germany’s actions in the war, and the right of the allies to collect reoperations. The other treaties that settled issues with Austria, Hungary, Turkey and Bulgaria also had similar clauses, these nations simply didn't make a big deal about them. As one Frenchman put it “Was it France that attacked Germany? That invaded and caused havoc in neutral Belgium? That caused as much damage as possible? No! It was Germany that did that to France and Belgium.” The treaty was actually pretty soft on Germany—German’s rival of Austria-Hungary was gone, and Germany no longer had to share a border with Russia. Germany found itself surrounded by weaker, quarreling states that they could have easily had sway over. The Nazis were more a result of issues that already existed in German society before the war, and then the instability of the Weimar Republic and the effects of the Depression. Keep in mind that much of Nazi ideology ( “Aryan Racial Purity” destruction of the Slavs, settling their lands, the mass-murder of Jews, Roma and Sinti people as well as homosexuals, people seen as “disabled” and left-leaning political members, Jehovah’s Witness and others) had nothing to do with the Treaty. Part of the problem was the perception in Germany that they “hadn’t really been defeated” and thus the allies had no right to determine the terms of the treaty. As a result the allies were much harsher in 1945, invading Germany, insisting on an unconditional surrender, putting the country under occupation, splitting it in two, and Germany lost even more land in 1945 than in 1918. ",
            "date": "Answered April 29, 2020",
            "views": "446",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                },
                {
                    "user_id": "Russell Jurney",
                    "user_href": "/profile/Russell-Jurney"
                },
                {
                    "user_id": "Toussaint Bonavita",
                    "user_href": "/profile/Toussaint-Bonavita"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Hopkin",
                "href": "/profile/Dave-Hopkin-1"
            },
            "answer_text": "Apart from the actual proposition being ridiculous, Hitlers rise to power and WW” was not solely based on the Versalles Treaty it was a signifiant part of it but there were other factors that created the environment tht saw Hitlers popuarity rise ",
            "date": "Answered April 29, 2020",
            "views": "282",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Howard Brazee",
                    "user_href": "/profile/Howard-Brazee"
                }
            ]
        }
    ]
}