{
    "title": "If Henry VI had been successful, would a Union of England and France have worked? - Quora",
    "tags": [
        "King Henry VIII (historical figure)",
        "History of Great Britain",
        "England"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lori Jones",
                "href": "/profile/Lori-Jones-16"
            },
            "answer_text": "Henry VI was never going to make that work. He was the son of a legendary father, Henry V, but he was also the grandson of a French king who was out of his mind. One of the reasons why Henry VI became king of both England and France, the Plantagenet fantasy of all time, at the age of 9 months is because France had an unfortunate series of incompetent and mentally ill kings, and Henry V was able to take advantage of that and take both crowns for his infant son before he died. But the baby, now Henry VI, got a piece of the French madness through his mother, who was a princess of that lot. I haven’t read any evidence that she was mentally ill herself, but she apparently passed it on to her child all the same. If Henry VI had been like his father, who knows? But he wasn’t even close. His physical and mental problems were the base cause of the Wars of the Roses. More capable people were in the wings thinking they could do better and that someone had to do better for the sake of England. Edward II and Richard II had lost their thrones through poor kingship, so there was precedent for throwing Henry VI over too. It’s a wonder the English put up with him as long as they did. The French got it together when the deaths of the mad kings put the French crown in the hands of someone more capable, and Henry VI was easy to outmaneuver. France had the time to step it up because of Henry VI’s long childhood and because it became obvious fairly early that he was not like his father. Henry VI couldn’t hold on to either of his crowns. In England, there was that infamous civil war that wasn’t really over until Lancastrian Henry Tudor killed Richard III on Bosworth Field, was crowned Henry VII, and married Richard’s niece, a Princess of York, a result that was probably engineered by their mothers. ",
            "date": "Answered March 20, 2018",
            "views": "548",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Kupperberg",
                    "user_href": "/profile/Michael-Kupperberg"
                },
                {
                    "user_id": "Catherine MacLeod",
                    "user_href": "/profile/Catherine-MacLeod-9"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                },
                {
                    "user_id": "Charles Waring",
                    "user_href": "/profile/Charles-Waring"
                },
                {
                    "user_id": "Aniekan Thomas",
                    "user_href": "/profile/Aniekan-Thomas"
                },
                {
                    "user_id": "Callum Adair",
                    "user_href": "/profile/Callum-Adair-1"
                },
                {
                    "user_id": "Roger Fentiman",
                    "user_href": "/profile/Roger-Fentiman"
                },
                {
                    "user_id": "Ferry Kurniawan",
                    "user_href": "/profile/Ferry-Kurniawan-4"
                },
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                },
                {
                    "user_id": "Collin Spears",
                    "user_href": "/profile/Collin-Spears-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Gourlay",
                "href": "/profile/Ian-Gourlay"
            },
            "answer_text": "Since this can only be at best supposition, I guess my supposition’s as likely to be reasonable as most other non-specialists. So I’ll say a resounding No/Non…. The peoples of these countries mostly have only a hearty dislike for one another. Note that Scotland and France did have an agreement of sorts based not so much on mutual regard as that they shared a common enemy. IE England. That was called The Auld Alliance in Scotland. But any alliance between England and France would, I’m pretty sure, be transitory at very best, and at the short-lived end of “transitory” at that. There was so much double dealing and back stabbing generally in those days (has much changed in that regard?) that I’m pretty sure old hatreds would soon show up and someone on one side would kill or insult someone on the other and all would soon be as it was beforehand. Some hatreds are so old that the original reason for it is long forgotten, but why “waste a perfectly decent state of enmity” might summarise it to a point. Not a very serious one, I’ll grant! ",
            "date": "Answered March 20, 2018",
            "views": "215",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kennedy Walker",
                    "user_href": "/profile/Kennedy-Walker-41"
                },
                {
                    "user_id": "Andrei Topala",
                    "user_href": "/profile/Andrei-Topala-2"
                },
                {
                    "user_id": "Richard Craig",
                    "user_href": "/profile/Richard-Craig-5"
                }
            ]
        }
    ]
}