{
    "title": "If Islam is said to be a peaceful religion, why did the Prophet Muhammad wage wars against other religions? - Quora",
    "tags": [
        "Jihad",
        "Muhammad (Islamic prophet)",
        "Peace",
        "Muslims",
        "Warfare",
        "Islam"
    ],
    "response": [
        {
            "author_info": {
                "name": "Igor Rouzine",
                "href": "/profile/Igor-Rouzine-1"
            },
            "answer_text": "Some Muslims are peaceful, but the ideology is not peaceful. According to Wiki, 90% of terrorist acts are Muslim, see List of terrorist incidents - Wikipedia, at 20% Muslims in the world population. That is 1:50 ratio of terror acts per Muslim to non-Muslim, and do not tell me about “a tiny radical minority”. How come the other religions have no such minority? Buddhism, Hinduism, Christianity, Judaism, Animism? Clearly, the radical minority is 50-fold less tiny in Islam than in the other religions. Sharia Law: • Theft is punishable by amputation of the hands (Quran 5:38). • Criticizing or denying any part of the Quran is punishable by death. • Criticizing Muhammad or denying that he is a prophet is punishable by death. • Criticizing or denying Allah is punishable by death (see Allah moon god). • A Muslim who becomes a non-Muslim is punishable by death (See Compulsion). • A non-Muslim who leads a Muslim away from Islam is punishable by death. • A non-Muslim man who marries a Muslim woman is punishable by death. • A woman or girl who has been raped cannot testify in court against her rapist(s). • Testimonies of 4 male witnesses are required to prove rape of a female (Quran 24:13). • A woman or girl who alleges rape without producing 4 male witnesses is guilty of adultery. • A woman or girl found guilty of adultery is punishable by death (see \"Islamophobia\"). • A male convicted of rape can have his conviction dismissed by marrying his victim. • Muslim men have sexual rights to any woman/girl not wearing the Hijab (see Taharrush). • A woman can have 1 husband, who can have up to 4 wives; Muhammad can have more. • A man can marry an infant girl and consummate the marriage when she is 9 years old. • Girls' clitoris should be cut (Muhammad's words, Book 41, Kitab Al-Adab, Hadith 5251). • A man can beat his wife for insubordination (see Quran 4:34 and Religion of Peace). • A man can unilaterally divorce his wife; a wife needs her husband's consent to divorce. • A divorced wife loses custody of all children over 6 years of age or when they exceed it. • A woman's testimony in court, allowed in property cases, carries ½ the weight of a man's. • A female heir inherits half of what a male heir inherits  • A woman cannot speak alone to a man who is not her husband or relative. • Meat to eat must come from animals that have been sacrificed to Allah - i.e., be \"Halal.\" • Muslims should engage in Taqiyya and lie to non-Muslims to advance Islam. A political ideology: Al-Qur'an al-Kareem - القرآن الكريم is an official Muslim site for Muslims approved by Saudi Grand Mufti. What do we find in Quran? Disclaimer: I am not responsible for the accuracy of the following translation from Arabic, all complaints are deflected to that site. 2:161 Verily, those who disbelieve, and die while they are disbelievers, it is they on whom is the Curse of Allah and of the angels and of mankind, combined. 2:162 They will abide therein, their punishment will neither be lightened nor will they be reprieved. 4:48 \"Verily, Allah forgives not that partners should be set up with Him in worship, and whoever sets up partners with Allah in worship, he has indeed invented a tremendous sin.\" 4:76 \"Those who believe, fight in the Cause of Allah, and those who disbelieve, fight in the Cause of Idols (Taghut). So fight you against the friends of Satan [Hindus & Buddhists]; ever feeble indeed is the guile of Satan.\" 8:39 \"And fight them [the unbelievers] until there is no more disbelief (fitnah), and the religion will all be for Allah Alone 8:55 Verily, the worst of living creatures before Allah are those who disbelieve. 33:64 Verily Allah has cursed the Unbelievers and prepared for them a Blazing Fire 47:3 That is because those who disbelieve follow falsehood, while those who believe follow the truth from their Lord. 3:151. We will throw terror into the hearts of those who disbelieve, because they attribute to God partners for which He revealed no sanction. Their lodging is the Fire. Miserable is the lodging of the evildoers. 48:29. Muhammad is the Messenger of God. Those with him are stern against the disbelievers, yet compassionate amongst themselves. […] 98:6. Those who disbelieve among the People of the Scripture, and the Polytheists, will be in the Fire of Hell, where they will abide forever. These are the worst of creatures. 33:59 O Prophet, tell your wives and your daughters and the women of the believers to draw their cloaks close round them (when they go abroad). That will be better, so that they may be recognised and not annoyed. Allah is ever Forgiving, Merciful. 8: 59. Let not the disbelievers assume that they are ahead. They will not escape. 8:60. And prepare against them all the power you can muster, and all the cavalry you can mobilize, to terrify thereby God’s enemies and your enemies, and others besides them whom you do not know, but God knows them. Whatever you spend in God’s way will be repaid to you in full, and you will not be wronged. 9:29. Fight those who do not believe in God, nor in the Last Day, nor forbid what God and His Messenger have forbidden, nor abide by the religion of truth—from among those who received the Scripture—until they pay the due tax, willingly or unwillingly. Islam spread from the very beginning by war, not by the word, unlike Christianity:  The reasons why the Left suppress these facts is that Marxism denies the importance of religion and culture focusing instead on the economic class struggle. ",
            "date": "Updated August 9, 2020",
            "views": "11",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hasan Sheikh",
                    "user_href": "/profile/Hasan-Sheikh-1"
                },
                {
                    "user_id": "Sudharsan",
                    "user_href": "/profile/Sudharsan-121"
                },
                {
                    "user_id": "Chinmoy Kalita",
                    "user_href": "/profile/Chinmoy-Kalita-9"
                },
                {
                    "user_id": "Sreelakshmi Sadanandan",
                    "user_href": "/profile/Sreelakshmi-Sadanandan-1"
                },
                {
                    "user_id": "Srinath Nair",
                    "user_href": "/profile/Srinath-Nair-4"
                },
                {
                    "user_id": "Deepak S Fernandes",
                    "user_href": "/profile/Deepak-S-Fernandes"
                },
                {
                    "user_id": "Rohit Ghadge",
                    "user_href": "/profile/Rohit-Ghadge-18"
                },
                {
                    "user_id": "Xaverl Quamboq",
                    "user_href": "/profile/Xaverl-Quamboq"
                },
                {
                    "user_id": "Siddharth Malladi",
                    "user_href": "/profile/Siddharth-Malladi"
                },
                {
                    "user_id": "SUPRATIM PURKAYASTHA",
                    "user_href": "/profile/SUPRATIM-PURKAYASTHA-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hasan Ahmed",
                "href": "/profile/Hasan-Ahmed-187"
            },
            "answer_text": "All I can show you is a letter of covenant from the Prophet Muhammad, signed by the Prophet Muhammad with his hand print. It was issued to St Catherine’s Orthodox Monastery located at the foot of mount Sinai which is the oldest functioning monastery with 3300 year old manuscripts mostly from the 10th to 14th century. St Catherine’s monastery   This is the \"Charter of privileges\" granted to the monks of St. Catherine's located at the base of mount Sinai in 628 Here is a translation, In the name of Allah the most beneficent, the most merciful This is a message from Muhammad ibn Abdullah as a covenant to those who adopt Christianity near and far we are with them. I hold out against anything that displeases them, no compulsion is to be on them neither are there judges to be removed from their jobs nor their monks from their monasteries no one is to destroy a house of their religion, to damage it, or to carry anything from it to the Muslim houses. Should anyone take any of these, he would spoil God’s covenant and disobey his prophet verily they are my allies and have my secure charter against all that they hate. No one is to force them to travel or oblige them to fight, the Muslims are to fight for them. if a female Christian is married to a Muslim, it is not to take place without her approval she is not to be prevented from visiting her church to pray their churches are to be respected they are neither to be prevented from repairing them nor the sacredness of their covenants no one of the nation (Muslims) is to disobey the covenant till the last day St Catherine's Greek Orthodox monastery have an original letter almost 1400 years old. According to the above charter of privileges it is considered forbidden for any Muslim to break this charter today or any day until the end of time. Similar agreements were made between Jewish and Muslims but unfortunately there are no surviving documents. In the following paragraph I will try my best to explain what the misconceptions and issues that are portraying Muslims and Islam in a negative way. Islam has and is a peaceful religion, only a minority of so called Muslims give Islam a negative Image. I used the words “so called” deliberately, ask your self Is it possible to be a Christian if you do not believe in Jesus Christ (PBUH) or that Jesus was not a prophet? is it possible to be a Jew if you deny the existence of or the prophet hood of Moses (PBUH)? In Islam their is are several groups/sects which claim to be Muslim but in fact can not be accepted as Muslims because they deny the fundamental belief of Islam which is to acknowledge that God is the one and only supreme being and that the PROPHET Muhammad (PBUH) is the final prophet. This is also known as the “Shahada” which is the declaration of faith, the agreement between yourself and God. Any form of deviation means that you are no longer a Muslim. One of these groups refereed to as qadiani call themselves Muslims but do not accept or follow the Prophet Muhammad. Theoretically and factually they are not accepted as Muslims by the vast global majority of true Muslims and are considered blasphemers and heretics. It’s only westerners who through no fault of their own accept them as Muslims due to the lack of understanding of what it is to be a Muslim?, what defines a Muslim?. The other group is of a small proportion of shites who claims something similar to the above and deviate from the declaration of faith in Islam. Not all shites deny the Prophet hood of Muhammad (PBUH) but accept as if they are under duress. Not only do you have to speak the declaration of faith in Islam but you must truly believe without any doubt whatsoever. Finally Islam is not a religion it is a way of life you live according to the Quran and the Hadith (sayings) of the Prophet of Islam. Here is another historical fact:- in 1492 Catholic Spain expelled all Jews from their land, It was the Muslim Ottoman Empire which welcomed all the Jewish refugees, that’s in addition to sending an entire navy to rescue persecuted Jews The one issue which gave Islam a bad name to this day is of the brief Caliphate of Al-Hakim bi-Amr Allah - Wikipedia This individual was a completely deranged, mad and insane shia. during the reign of the mad shia Caliph Hakim in the Fatimid Dynasty, which, apart from the anomaly of the rule of Hakim, was a very good time for Christian and Muslim co-existence, (1004-1014 A.D) he decided to persecute the local Christian population, partially destroying the Church of the Holy Sepulchre and forcing many to convert to Islam. Following this he decided he was the incarnation of god and decided to persecute the Muslims instead he was overthrown soon after. The Fatimid caliph who razed the Church of the Holy Sepulchre was the sixth, Abu Ali-Mansur, born in 985 C.E. and better known by his title: Al-Hakim bi-Amr Allah, which simple means “Ruler by God’s command. On or about October 18, 1009, the so-called “Mad Caliph” of the Fatimid Empire flouted a long-standing policy of religious tolerance. With the ultimate aim of converting the empire’s Jews and Christians to Islam, Abu Ali-Mansur ordered the destruction of non-Muslim buildings and objects throughout the empire and specifically in the city of Jerusalem – including synagogues, Torah scrolls, Jewish artifacts and especially the Church of the Holy Sepulchre, also known as the church of Jesus’ resurrection. The original church had been built at the orders of Queen Helena, the mother of the Roman Christian emperor Constantine, in 330 C.E. In fact, the building destroyed by the caliphate was not the original church. That had been destroyed by the Persians in the year 614. What the caliph’s soldiers pulled down to the ground four centuries later was the second version. It was this lunatics actions which prompted Pope Urban II - Wikipedia to make a speech in which he said the following : Urban II said that Christians were being persecuted for their faith by the Muslims ruling the regions they lived in. This image, however, of the Muslim leaders was completely false as they were in many ways much more tolerant and respectful towards members of other faiths than the Catholic Church itself. Since the fall of Jerusalem to the Muslims in 638 A.D, there had been very little for the Christians to complain about. ",
            "date": "Updated September 5, 2019",
            "views": "13",
            "upvotes": " View 123 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mohammad Saiful Alam",
                    "user_href": "/profile/Mohammad-Saiful-Alam-2"
                },
                {
                    "user_id": "Muhammad Raza",
                    "user_href": "/profile/Muhammad-Raza-697"
                },
                {
                    "user_id": "Zaff von Zanal",
                    "user_href": "/profile/Zaff-von-Zanal"
                },
                {
                    "user_id": "That Guy",
                    "user_href": "/profile/That-Guy-1275"
                },
                {
                    "user_id": "Riefki Akbar Murdhanny",
                    "user_href": "/profile/Riefki-Akbar-Murdhanny"
                },
                {
                    "user_id": "Catherine",
                    "user_href": "/profile/Catherine-1233"
                },
                {
                    "user_id": "Isha Mahmood",
                    "user_href": "/profile/Isha-Mahmood-1"
                },
                {
                    "user_id": "Ahmed Ali Ibrahim Muhammad Ghazalawy",
                    "user_href": "/profile/Ahmed-Ali-Ibrahim-Muhammad-Ghazalawy"
                },
                {
                    "user_id": "Manal Flamir",
                    "user_href": "/profile/Manal-Flamir"
                },
                {
                    "user_id": "Yussuf Daher",
                    "user_href": "/profile/Yussuf-Daher"
                }
            ]
        }
    ]
}