{
    "title": "If Italy sided with the Allies in World War 2, would they have been allowed to keep Ethiopia as an Italian possession? - Quora",
    "tags": [
        "Italy",
        "World War II",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Mancini",
                "href": "/profile/Alex-Mancini-4"
            },
            "answer_text": "No. Only one third of Ethiopia had been occupied by Italy. The Italians controlled the routes from Eritrea to Addis Ababa and from Somalia via Harar to Dira Dawa. Italy spent the next five years of its occupation attempting to conquer the rest of the country. To do this, Graziani and its successor, the Duke of Aosta, had 466,000 white and colonial troops in 1936, 237,000 (of whom three-quarters were white) in 1937, and 280,000 (of whom three-sevenths were white) in 1938–1939. In the years to come, the pacification process cost Italy 9,555 dead and 140,000 wounded or sick. Ethiopia was never completely tamed and chances were Italy would have faced continual insurgencies by the Africans no matter which side they allied with. That's also because Italy wasn't a colonizing country. It had no previous colony as opposed to England and France. The Italians ultimately failed to culturally influence and change the Ethiopians amidst a time in which colonisation started to be always more and more uncommon before eventually it ceased to be a priority altogether. ",
            "date": "Answered October 31, 2017",
            "views": "323",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Lee",
                    "user_href": "/profile/Stephen-Lee-116"
                },
                {
                    "user_id": "Rakesh Nanda",
                    "user_href": "/profile/Rakesh-Nanda-16"
                },
                {
                    "user_id": "Jacob Ahumada",
                    "user_href": "/profile/Jacob-Ahumada-1"
                },
                {
                    "user_id": "Frank Jefferson",
                    "user_href": "/profile/Frank-Jefferson"
                },
                {
                    "user_id": "Yabkal Ayalew",
                    "user_href": "/profile/Yabkal-Ayalew"
                },
                {
                    "user_id": "Kelby Brewer",
                    "user_href": "/profile/Kelby-Brewer-1"
                },
                {
                    "user_id": "Kai Schlegl",
                    "user_href": "/profile/Kai-Schlegl"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Scallan",
                "href": "/profile/John-Scallan-1"
            },
            "answer_text": "Breaking news! They DID side with the Allies. ",
            "date": "Answered October 31, 2017",
            "views": "4",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tino Picchio",
                    "user_href": "/profile/Tino-Picchio"
                }
            ]
        }
    ]
}