{
    "title": "If Marilyn Monroe and Elvis Presley were still alive, what do you think they would be like today? - Quora",
    "tags": [
        "Marilyn Monroe (actor)",
        "Elvis Presley (musician, actor)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Connie Wilson",
                "href": "/profile/Connie-Wilson-98"
            },
            "answer_text": "For one thing, Marilyn Monroe was born June 1, 1926, which means that she would be 92. Elvis was born January 8, 1935, which means that he would be 83 today. Both would be long gone from stages and/or screens. Marilyn died in 1962 at the age of 36. Elvis died in 1977 when he was 42. We all have our moments in the sun when we are young and beautiful (or even middle-aged and beautiful) but nobody is going to be paying attention to a 92-year-old female. Another extremely beautiful sex symbol of the sixties was Brigitte Bardot, and you hear nothing about her today. Marilyn’s life might be something like Doris Day’s. Doris (and Brigitte, also, I think) have dedicated themselves to protecting animals. An elderly woman is the most invisible citizen on the planet. An old man is also nearly a non-person, but not nearly as invisible as a woman in her nineties. ",
            "date": "Answered November 14, 2018",
            "views": "15",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hninzi Lwin",
                    "user_href": "/profile/Hninzi-Lwin-1"
                },
                {
                    "user_id": "Abbie Volkmann",
                    "user_href": "/profile/Abbie-Volkmann"
                },
                {
                    "user_id": "Jack Johnson",
                    "user_href": "/profile/Jack-Johnson-448"
                },
                {
                    "user_id": "Joe Elliott",
                    "user_href": "/profile/Joe-Elliott-27"
                },
                {
                    "user_id": "Jon Mixon",
                    "user_href": "/profile/Jon-Mixon-1"
                },
                {
                    "user_id": "C Elizabeth Blocher",
                    "user_href": "/profile/C-Elizabeth-Blocher"
                }
            ]
        },
        {
            "author_info": {
                "name": "Israel James Cullett",
                "href": "/profile/Israel-James-Cullett"
            },
            "answer_text": "If Marilyn Monroe and Elvis Presley were still alive, they would look pretty old. That would be my guess.   Just some images I found with Google. I think they’re pretty accurate. But nobody knows for sure what they would look like. So many things can influence the appearance of a person; personal health choices, accidents (or lack of accidents), sicknesses (or lack of sickness), even emotional states. We can only guess. ",
            "date": "Answered November 14, 2018",
            "views": "812",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "C Elizabeth Blocher",
                    "user_href": "/profile/C-Elizabeth-Blocher"
                }
            ]
        }
    ]
}