{
    "title": "If Marilyn Monroe was still alive today, would she still be considered a Hollywood icon? - Quora",
    "tags": [
        "Marilyn Monroe (actor)",
        "Hollywood Celebrities",
        "Hollywood Actors and Actresses",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Hollywood",
        "Fame and Mass Popularity",
        "Celebrities",
        "Actors and Actresses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anais Vionet",
                "href": "/profile/Anais-Vionet"
            },
            "answer_text": "If Marilyn Monroe was still alive today, she would still be considered a Hollywood icon. Some performers are larger than life - Marilyn Monroe was larger than life - capturing the zeitgeist of sexiness and fun like few others in Hollywood history. Marilyn became a huge star in 1953 and Elvis’s fame exploded in 1956 but together they encapsulated their era as the top male and female icons. Marilyn was, just 10 days before her death, offered a million dollars to complete her role in Fox's Something's Got to Give (1962) - the only other Hollywood star to receive that unheard of sum for a movie performance was Elizabeth Taylor, in “Cleopatra” - so the narrative suggesting Marilyn’s career was on some downward trajectory is false. Marilyn Monroe was unique, a luminescent star of the screen - if you doubt that watch the movie The Prince and the Showgirl where she shared the screen with Laurence Olivier who was considered the greatest actor of his era - she blows him off the screen - he “might as well have been a mannequin” - That’s something HE said. Was she murdered? We’ll probably never know but the fact is that she was an icon then and would still be so now. If she were alive - she would be 95 on June 1st 2021. ",
            "date": "Answered June 4, 2020",
            "views": "414",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charles Krin",
                    "user_href": "/profile/Charles-Krin"
                },
                {
                    "user_id": "Jean O'Boyle",
                    "user_href": "/profile/Jean-OBoyle-2"
                },
                {
                    "user_id": "Marilyn Robinson",
                    "user_href": "/profile/Marilyn-Robinson-23"
                },
                {
                    "user_id": "Gina Lau",
                    "user_href": "/profile/Gina-Lau-14"
                },
                {
                    "user_id": "Krishmal Fernando",
                    "user_href": "/profile/Krishmal-Fernando-1"
                },
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amélie Malloy",
                "href": "/profile/Amélie-Malloy"
            },
            "answer_text": "In my opinion YES! I think if she was still alive and she was old, people would love her even more because they would look back at all her achievements and be like “wow she was cool” I think she will forever go down in history ",
            "date": "Answered June 4, 2020",
            "views": "108",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jean O'Boyle",
                    "user_href": "/profile/Jean-OBoyle-2"
                },
                {
                    "user_id": "Carolyn Barratt",
                    "user_href": "/profile/Carolyn-Barratt"
                }
            ]
        }
    ]
}