{
    "title": "If people don't really remember Charles Curtis as the first non-white Vice President, how well known will Barack Obama be in 100 years? - Quora",
    "tags": [
        "U.S. Vice Presidents",
        "Political History of the United States of America",
        "Barack Obama (politician)",
        "Presidents of the United States of America",
        "History of the United States of America",
        "History",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Nelson",
                "href": "/profile/Ryan-Nelson-110"
            },
            "answer_text": "The vast majority of Vice Presidents aren't well known, period. Even if they later became President, oftentimes almost nobody knows that they were actually a Vice President first. The exceptions are recent Vice Presidents, and Vice Presidents who became President because the current President died in office (rather than being elected President after they had left the Vice Presidency). As for how memorable Barack Obama will be? Tough question. George W. Bush is going to be memorable, if for no other reason than getting us mired in the wars in Afghanistan and Iraq (those wars are going to be very prominent in our history for a long time). Gitmo and Wikileaks are going to be remembered, too. Maybe the tax cuts, but that’s a big ‘maybe’. Barack Obama is going to be tied to, and a continuation of, the same narrative as Dubya. This is mainly because of their ties to the wars in Afghanistan and Iraq, mass surveillance, and drone strikes. Obama will be remembered as the guy who ended these wars. It’s similar to how Nixon is remembered for ending the Vietnam War. That’s going to be the key bullet point about Obama’s presidency. You’ll hear about the NSA and Snowden for sure; Wikileaks and Snowden together are the defining scandal of our times. Maybes in Obama’s legacy: rapprochement with Cuba, the nuclear deal with Iran, and Obamacare. For each of these, their historical prominence will really depend on what happens to them during Trump’s presidency. Oh, and a big deal will be made about the color of Obama’s skin, of that you can be sure. EDIT: I can’t believe I forgot the bailouts of 2008 and 2009! Credit for the ’08 ones ought to go to Dubya, but honestly, the narrative is probably going to play out the same way it did with Herbert Hoover and FDR in the history books. But the recession is going to be one of the key things covered about the first decades of the 21st century. ",
            "date": "Answered November 29, 2016",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Pellett",
                    "user_href": "/profile/Frank-Pellett"
                },
                {
                    "user_id": "Tara Nitka",
                    "user_href": "/profile/Tara-Nitka"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Clement Ng",
                    "user_href": "/profile/Clement-Ng-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Kinkade",
                "href": "/profile/Kelly-Kinkade-1"
            },
            "answer_text": "Barack Obama will be a part of every child’s history curriculum, for good or for bad, for at least the next fifty years, and likely for much longer. Nobody remembers Charles Curtis for the same reason that nobody remembers Levi Morton, Hannibal Hamlin, or Richard Johnson. John Garner Nance, another one of these mostly immemorable Vice Presidents, is only really known for saying that the Vice Presidency “is not worth a bucket of warm spit” (although he probably actually said “piss”), and that statement really summarizes why nobody really remembers Vice Presidents. Of the Vice Presidents we do remember, we remember because they became President. Meanwhile, while most Americans probably can’t tell you much else about James Polk, they will likely at least recognize that he was President at some time in the past. People will remember Barack Obama’s name far longer than they do Dick Cheney’s, but this will have nothing to do with the fact that Barack Obama is non-white; it will have everything to do with the fact that Barack Obama will soon be a former President of the United States, and Dick Cheney will not. ",
            "date": "Answered November 28, 2016",
            "views": "354",
            "upvotes": " View 344 Upvoters",
            "upvoters": [
                {
                    "user_id": "William Bradley",
                    "user_href": "/profile/William-Bradley-37"
                },
                {
                    "user_id": "Dwight Gray",
                    "user_href": "/profile/Dwight-Gray-3"
                },
                {
                    "user_id": "Nick Nicholas",
                    "user_href": "/profile/Nick-Nicholas-5"
                },
                {
                    "user_id": "Jill Meier",
                    "user_href": "/profile/Jill-Meier-3"
                },
                {
                    "user_id": "Mitchell Timp",
                    "user_href": "/profile/Mitchell-Timp"
                },
                {
                    "user_id": "Caitlyn Chung",
                    "user_href": "/profile/Caitlyn-Chung"
                },
                {
                    "user_id": "Rick Wright",
                    "user_href": "/profile/Rick-Wright-1"
                },
                {
                    "user_id": "Tony Pedretti",
                    "user_href": "/profile/Tony-Pedretti"
                },
                {
                    "user_id": "Jo P. Lindsey",
                    "user_href": "/profile/Jo-P-Lindsey"
                },
                {
                    "user_id": "Laverne Stokes Clayton",
                    "user_href": "/profile/Laverne-Stokes-Clayton"
                }
            ]
        }
    ]
}