{
    "title": "If Siberia is so inhospitable, why did early humans venture up there and eventually cross over to North America? - Quora",
    "tags": [
        "Siberia",
        "Prehistoric Humans",
        "North America",
        "Anthropology",
        "Geography",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alan Dillman",
                "href": "/profile/Alan-Dillman"
            },
            "answer_text": "Obviously the fact that they did answers the inhospitable portion of the question. I live at a similar latitude in Canada, and I have an observation. A human can live about three days with no water. So anywhere with non-saline water satisfies a primary requirement for life. Preferably it should also be uncontaminated by parasites and obnoxious minerals. Northern latitudes have beaucoup fresh water. In summer there are creeks, rivers, and lakes. I live in an semi-arid area, and even my area has a stream or a small lake every few kilometres. If one pond is bad, it does not render an area useless. Next, a human can only survive a few hours of sub-zero temperatures without an external heat source. However, northern latitudes have plenty of wood for fires and building shelters. There is a belt of forest around the world up here called the boreal forest. It’s mostly pine and spruce, with lots of willow, poplar, birch, and even some maple trees.  Which means that in winter time, early people had a source of even more readily available water, and snow is cleaner too. They don’t have to stockpile water, just wood. There are some interesting medicinal traits of certain plants too, like willow bark being nature’s aspirin, and pine pitch can disinfect wounds and stop bleeding. In summer, water consumption is lower in northern climates. In southern climes, it rises and water becomes choked with algae. Because in the north it freezes every year, parasites are fewer. For instance, there are no pests like hookworms in the soil, and even if there were, shoes block them. It is cool enough that closed-toe footwear is comfortable. Well, what about food? Again, in the north, herbivores tend to be quite large animals. So instead of trying to catch enough small animals, a good hunt would supply a family unit for a week. And meat doesn’t spoil when we can freeze it, so you can take several game animals in a hunt, and not be wasteful. Further, the skins and large bones and antlers were useful for tool crafting. And yet there is a good variety, including birds, mammals, and fish. Fish is an interesting one, and both Canada and Siberia have giant sturgeon, and things like northern pike and white fish are quite large too. What else? Northern waterways are useful for navigation, and they don’t have large predators in them like crocodiles. Further, the waterways are amenable to simple mapping, and if you can count, you can convey directions on a northern river. “Go down stream, third river mouth on the left, go up stream, and the camp is at the mouth of the second creek on the right”. This is harder to do in places with heavy rainfall, where rivers shift course, spill their banks, and creeks appear in new places due to rapid erosion, flooding and heavy rainfall. Anything else? Yes. The predators are fewer, more specialized, and larger overall. The larger they are, the more their efforts are best applied against large herbivores as well. This meant that humans were no longer attractive prey, moving them out of the prey food chain. In summary, reasons why moving north was more hospitable: water availabilityhunting efficiencymaterial densitylower parasite density in food, earth, and waterway-finding is easier.no longer primary prey for any other predators.Costs are that it is colder, sometimes to the point of being inimical to life, but this is abrogated by fires, which also repel predators. In the south, there is no cooling mechanism that is equivalent. One other negative is that animal populations are less dense, but this is partially negated by the fact that they are larger and easier to see and track. ",
            "date": "Updated October 22, 2020",
            "views": "314",
            "upvotes": " View 1.5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Scott McIntosh",
                    "user_href": "/profile/Scott-McIntosh-79"
                },
                {
                    "user_id": "Carlos Antonio Castro",
                    "user_href": "/profile/Carlos-Antonio-Castro"
                },
                {
                    "user_id": "David Mandić",
                    "user_href": "/profile/David-Mandić"
                },
                {
                    "user_id": "Robert Næss",
                    "user_href": "/profile/Robert-Næss-1"
                },
                {
                    "user_id": "Lillie Jeanne De Kerouaille",
                    "user_href": "/profile/Lillie-Jeanne-De-Kerouaille"
                },
                {
                    "user_id": "Kyle Maryeski",
                    "user_href": "/profile/Kyle-Maryeski"
                },
                {
                    "user_id": "Mark Urso",
                    "user_href": "/profile/Mark-Urso"
                },
                {
                    "user_id": "Darrel Tyree",
                    "user_href": "/profile/Darrel-Tyree"
                },
                {
                    "user_id": "Chris Atlas",
                    "user_href": "/profile/Chris-Atlas-6"
                },
                {
                    "user_id": "Ken Overholt",
                    "user_href": "/profile/Ken-Overholt-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Darroch",
                "href": "/profile/Richard-Darroch"
            },
            "answer_text": "It's thought that Paleolithic hunter-gatherers first wandered into Northeast Siberia around 25-30,000 years ago during the last Glacial Maximum. Because of several converging climatic factors, much of Siberia received insufficient snowfall to produce glaciation unlike Europe and North America. Beringia — the so-called “land bridge”— was a grassy steppe. It’s actually misleading to characterize Beringia as a “bridge” which conjures up a narrow span between the continents. In fact, it was a very large continuous tract as much as 1,000 miles wide North to South. While the general climate would certainly have been cold at times, it was far from frigid Arctic vastness. The land was amenable to wildlife and nourishing vegetation. If it wasn't people simply wouldn't have gone there. It took a very long time — millenia — for humans to finally cross into North America. Hunter-gatherers don't just pack up and decide to migrate thousands of miles. They set up camp near the game and edible plants, forage until the area no longer supports them and move on a few miles following the game and the water. They don't move in straight lines. If the weather is too cold they go where it's milder. They're not on a schedule. They might zigzag a few miles here and there every few weeks or months in this peripatetic way. Meanwhile, the climate in Beringia went through the usual cycles — warming a bit, cooling a bit, then warming a bit more as the glaciers retreated starting about 20,000 years ago. So a few hunter-gatherers slowly wound their way Eastward over land indistinguishable from Siberia, because for all intents and purposes it was Siberia. Along the way, through many generations of learning and experimentation, they developed the skills and technology to cope more easily with cold weather. We shouldn't think of those wanderers as somehow stupid and incapable. They were intelligent, inventive, resourceful people who'd been solving myriad problems of survival since their forebears walked out of Africa. ",
            "date": "Answered October 19, 2020",
            "views": "103",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gabriel Iacob",
                    "user_href": "/profile/Gabriel-Iacob-4"
                },
                {
                    "user_id": "Storm Williams",
                    "user_href": "/profile/Storm-Williams-33"
                },
                {
                    "user_id": "Catherine Lee",
                    "user_href": "/profile/Catherine-Lee-425"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                },
                {
                    "user_id": "Joe Devney",
                    "user_href": "/profile/Joe-Devney"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                }
            ]
        }
    ]
}