{
    "title": "If Trump loses, will America change forever? If so, how? - Quora",
    "tags": [
        "Methamphetamine",
        "Donald Trump (politician, business person)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Moser",
                "href": "/profile/William-Moser-2"
            },
            "answer_text": "If “46” is a Democrat and he gets House & Senare majorities, there will never be another Republican president. And within one or two election cycles, Democrats may have successfully Californicated the federal government. ICE will be abolished, CBP and border-security weakened and illegal immigrants will be ushured in. Amnesty is a forgone conclusion and with that, lowered de facto standards of citizenship. These are 22M guaranteed Democrat voters. State Dept can assist with resettlements into Red states as was done with Ilhan Omar's Somalis in MN. Fun fact: Some years before Ilhan's election, a bill outlawing ‘female genital-mutilation’ failed in the MN legislature. Google and FaceBook are collaborating with China to motivate up to 70M known-registered but inactive Democrat voters to the polls. This cohort can be carved out, Republicans and Conservative-types ignored and it's untraceable and completely deniable.   Following these changes will come all of the Progressive promises: Guns banned, universal healthcare, free schooling, limits on ‘hate-speech’, Climate-change taxes and mandates, possible subservience to U.N. dictates, on-and-on. The unintended consequences will mount with accompanying charges of this or that reactionary group sabotaging the Social Democrats' well thought-out plans and there may be civil strife. For sure, attempts to disarm one-half the country likely won't be accomplished peacefully. ",
            "date": "Answered March 19, 2020",
            "views": "135",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hans Brinkhof",
                "href": "/profile/Hans-Brinkhof-1"
            },
            "answer_text": "If Trump loses, will America change forever? If so, how? “Forever” is a big word, but America would change (if only for short term). How? As David Parker pointed out: for the better. Now, Mark Hamill pointed out the main difference between Trump and two well known previous presidents of the U.S.A. in a single tweet, by quotes they made in function of POTUS:  That one quote says more about Trump than he would like to admit. Trump doesn’t care. He just wants to be “respected” without bothering to earn respect, and be paid for it. All his golf trips to Mar-A-Lago, and all the accommodations they have to rent (during those trips) for secret service (for his protection) alone, who do you think that tax-payers money is being paid to? Trump is in it for the money. He has finally found something he can actually make money on (without going bankrupt).He should be replaced by someone who is in it to work towards a better America, not just for himself and the 1%, but for those who during the Corona virus outbreak can’t be tested because (even with the check the Trump administration is about to give them) can’t afford it. ",
            "date": "Answered March 19, 2020",
            "views": "191",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Davey Jay",
                    "user_href": "/profile/Davey-Jay"
                },
                {
                    "user_id": "Elijah Daneel",
                    "user_href": "/profile/Elijah-Daneel"
                },
                {
                    "user_id": "Jessica Massie",
                    "user_href": "/profile/Jessica-Massie"
                }
            ]
        }
    ]
}