{
    "title": "If the Imperium of Man is truly the best humanity can be given the circumstances, why is it not reasonable to say that they are objectively the good guy? - Quora",
    "tags": [
        "Imperium (Warhammer 40k)",
        "The Imperium Of Man",
        "Warhammer"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Hanson",
                "href": "/profile/Bill-Hanson-21"
            },
            "answer_text": "because that is not how it works. the 40k universe is an exercise in BAD…. it’s all bad ALL THE TIME. its just relative levels of bad. for instance the imperium is bad, because you are one of untold billions whose only function in reality is to die for the imperium either fightinmg or in a senseless accident or a victim of something. but its not as bad as being captured by the dark eldar…… who will torture you and keep you alive for funzies and when they get bored will convert you into some sort of obscene machine JUST FOR THE SHITS AND GIGGLES. or falling prey to chaos where you can be turned into a peutrifying corpse for fun while nurgle keeps you alive to “enjoy” all of the diseased fun scurrying all over your body… or be constantly hunting for more and more excesses in order to keep getting the favour of slannesh, which costs more and more every time, or become a blood maddened nutcase that cant do anything but kill and rage as a follower of Khorne and it does not matter who and what you kill as long as you keep killing….. or you could just become a rolling mass of tentacles so depraved it would make the average tentacle porn freak go nope for tzeench. or you could be dissolved in bio acid and become lunch for the tyranid hive fleet…… or get bored to death by the Tau as they supress all individuality until you become less than a worker bee. There is no “good” in the 40k world, just levels of not too bad. ",
            "date": "Answered February 2, 2020",
            "views": "141",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Bowers",
                    "user_href": "/profile/Christopher-Bowers-13"
                },
                {
                    "user_id": "Caleb Atchison",
                    "user_href": "/profile/Caleb-Atchison-1"
                },
                {
                    "user_id": "Morgan Carey",
                    "user_href": "/profile/Morgan-Carey-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rose Holt",
                "href": "/profile/Rose-Holt-10"
            },
            "answer_text": "One of my big problems with the Warhammer 40k fandom is how many people spend their time defending fascists. On an in universe level, I don’t think the Imperium is the best humanity can be. It’s the opposite. In its desperation to defend itself from chaos worship and xeno enslavement, the Imperium higher ups pledged themselves to a murderous warp entity, mutated themselves into its inhuman servants and enslaved all humanity to its will. Everything they’re trying to stop has already happened to humanity, and it was done by the Imperium. To protect humanity, they’ve taken away anything worth protecting. Let the Tyranids come devour it all- who’ll miss an empire of miserable fascist warcriminals huddled in rotting polluted wastelands? But that’s just discussing lore. It’s not a big problem The big problem is, on a more meta level, the Imperium are Nazis. They’re clearly based on them, both aesthetically and ideologically. They’re a hyper-bigoted tyrannical imperialist empire based around fanatic devotion one highly charismatic leader who have long creeds about purging the impure, how their group is innately racially superior to all others and the importance killing all dissenters, and how war against the nation’s enemies is the only true good in life. They’re bargain-bin nazis. Some things go beyond in-universe considerations. However much you might think it makes sense in the lore, if you are OK saying the fascist regime dedicated to wiping out lesser races/species are “objectively the good guys”? You may want to step away from the gaming table and think about real world context a little more. In a world of rising facism, spreading racism and eroding democracy, it may be best to avoid glorifying using external threats to justify thinly veiled nazi regimes too much. ",
            "date": "Answered February 2, 2020",
            "views": "117",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Wood",
                    "user_href": "/profile/Robert-Wood-97"
                },
                {
                    "user_id": "Cody Colburn",
                    "user_href": "/profile/Cody-Colburn"
                },
                {
                    "user_id": "Wes Whiting",
                    "user_href": "/profile/Wes-Whiting"
                },
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "Rob Walter",
                    "user_href": "/profile/Rob-Walter-15"
                },
                {
                    "user_id": "Duc Nguyen",
                    "user_href": "/profile/Duc-Nguyen-711"
                }
            ]
        }
    ]
}