{
    "title": "If the Confederate States created the Golden Circle, how long would it have lasted for? - Quora",
    "tags": [
        "U.S. Civil War",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "History of the United States of America",
        "Military History and Wars ",
        "Hypothetical Scenarios",
        "History",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "James M. Volo",
                "href": "/profile/James-Martin-2066"
            },
            "answer_text": "Short answer: The idea behind the Golden Circle was never practical because the extension of slavery was its only unifying principle. Besides the South did not have the military prowess to carry out such an extensive military operation (s). Colonialism and dependence on slavery had been declining rapidly everywhere. Devoted to commodity crops like cotton and sugar cane that required slave labor to be profitable, the Golden Circle ultimately would have collapsed under the weight of the increased use of mechanized agricultural machinery . The Knights of the Golden Circle or KGC had its beginnings in the formation of Southern Rights Clubs in various southern cities in the mid-1830s. The original objective of the KGC was to annex a \"golden circle\" of territories in Mexico, Central America, the usual confines of the Confederate States, and the Caribbean islands as slave states. In addition to the Southern Rights Clubs, which advocated the re-establishment of the African slave-trade, some of the inspiration for the Knights may have come from a little-known secret organization called the Order of the Lone Star, founded in 1834, which helped orchestrate the successful Texas Revolution resulting in Texas independence from Mexico in 1836. In 1859, future CSA brigadier general Elkanah Greer established KGC castles in East Texas and Louisiana. Some Southern sympathizers in the North (especially in the Midwestern states) were accused of belonging to the Knights of the Golden Circle. Records of the KGC convention held in 1860 state that the organization originated in Lexington, Kentucky, on the fourth day of July 1854.  The Golden Circle: A geographical rather than a practical concept After the Kansas-Nebraska Act was passed in 1854, pro-slavery and anti-slavery supporters rushed in to settle the Midwest, both sides hoping to affect the outcome of the first election. Because the act stated that the future status of slavery in the two territories was to be decided by sovereign popular vote, the opposing sides competed to win the region for their political beliefs. A number of “Blue Lodges,” proslavery organizations, were formed in the South to assist in promoting the interests of the slave power. These societies were known by different names, such as the \"Friends Society,\" the \"Social Band,\" the \"Dark Lantern Society,\" and the \"Sons of the South.\" The order was thought to be a branch of the infamous Knights of the Golden Circle, the common object being the same—the extension of slavery. Nebraska was considered to be too far north to be brought into the southern fold, but Kansas was on a knife’s edge between free and slave. After the invasion of the Kansas polls by the proslavery forces at the election of 1855, the free-state settlers began to organize to defend their rights. In Lawrence two companies, of about fifty members each, were formed and an agent was dispatched to Boston to secure arms.  Among the so-called “sovereign squats” were this group of Kansas gentlemen who had formed themselves into a local company of free-state militia. During the border trouble of 1856, the free-state groups were continually in the field. They participated in the attack on the proslavery forces at New Georgia and at Franklin, and they took part in the capture of Fort Saunders and Fort Titus. On the return journey to Lawrence, they were captured by federal troops, marched to Lecompton, and imprisoned, some being confined for several months as an illegally constituted militia. After their release they continued their organization. During the 1856 conflict in Kansas, John Brown commanded forces at the town of Osawatomie when it came under attack by 200-400 border ruffians. With 40 or so men, Brown tried to defend the town against the pro-slavery partisans, causing heavy casualties before being forced to withdraw. This was one event in a series of clashes between abolitionists and pro-slavery Missourians. Brown's followers then killed five slavery supporters at Pottawatomie. These same abolitionists endorsed Brown's attempt to foment an armed slave rebellion in Virginia by attacking Harper's Ferry in 1858. Not to be outdone, Southerners fought just as hard to make Kansas a slave state. With slaveowner-friendly Missouri right next door, numerous proslavery settlers flooded across the border, many establishing Town Association Companies and forming some of the earliest cities, such as Leavenworth and Atchison. Another group called the Law and Order League, also known as the Army of Law and Order was formed ostensibly for the purpose of promoting peace, prosperity and good government among the people of Kansas. But, such was not the case. It was an armed force, the strength of which has been variously estimated at from 500 to 1000 men, whose policy was banishment or extermination of all free-state men in the territory. The battles between the opposing parties continued until a referendum was finally authorized by the English Bill of 1858, which dashed all pro-slavery hopes of Kansas Territory becoming part of the slaveowning South. However, continued struggles would delay the admission of Kansas as a free state until January 1861. Thereafter, Kansas was justly regarded as a mere outpost in the larger war now being waged between the antagonistic civilizations of the North and the South. In early 1860 newspapers across the country reported that the Knights of the Golden Circle were recruiting troops in numerous cities to send to Brownsville, Texas, for the planned but aborted invasion of Mexico. Texas was home for at least thirty-two KGC castles in twenty-seven counties. After trying unsuccessfully to peacefully resolve the conflicts between North and South, the Knights of the Golden Circle threw its full support behind the newly-created Confederate States of America and added its trained military men to the Confederate States Army. Several Confederate military groups during the Civil War were composed either totally or in large part of members of the Knights of the Golden Circle. One of the organizations whose members were in large part Knights of the Golden Circle was Quantrill's Raiders. Throughout the war Lincoln was confronted with widespread disaffection and profound hostility. “Less ideologically minded” antiwar dissidents brought repeated violent protest to many parts of the North, both in the East and West and in rural as well as urban settings. Yet dissent had an unexpected by-product. As disputes over how the war should be waged divided towns and counties across the Union, Republican politicians–especially the state governors–embraced the administration’s position to a degree they otherwise might not have. “In dealing with this resistance, they turned repeatedly to the federal government for help, even if it meant surrendering state powers and becoming more dependent on a centralized infrastructure in the process.” The influence of the Peace Democrats varied with the fortunes of war on the battlefield. When things were going badly for the Union on the battlefield, larger numbers of people were willing to entertain the notion of making peace with the Confederacy. When things were going well, Peace Democrats could more easily be dismissed as mere defeatists. But no matter how the war progressed, Peace Democrats constantly had to defend themselves against charges of disloyalty. Revelations that a few had ties with secret organizations such as the Knights of the Golden Circle helped smear the rest. The administration exaggerated the Copperhead menace for political advantage, and the stories of secret plots and treasonous associations were mostly false. Government officials estimated that more than 100,000 persons belonged to these organizations, but most historians discount the figure as being dramatically higher than the group's actual numbers. Confederate Gen. Robert E. Lee surrendered his Army of Northern Virginia at Appomattox on April 9, 1865. Most historians accept this date of surrender as the official end of the Civil War. The Knights of the Golden Circle as an organization, however, continued to work to achieve their goals, which included a prosperous South, for many decades after the Civil War. The Knights of the Golden Circle ceased its operations in 1916. ",
            "date": "Answered May 25, 2019",
            "views": "425",
            "upvotes": " View 216 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adam Myers",
                    "user_href": "/profile/Adam-Myers-18"
                },
                {
                    "user_id": "Phuc G. Bui",
                    "user_href": "/profile/Phuc-G-Bui"
                },
                {
                    "user_id": "Ruti Amit",
                    "user_href": "/profile/Ruti-Amit"
                },
                {
                    "user_id": "Kent Burns",
                    "user_href": "/profile/Kent-Burns-3"
                },
                {
                    "user_id": "Luke Kaul",
                    "user_href": "/profile/Luke-Kaul-1"
                },
                {
                    "user_id": "Lopez Rodriguez",
                    "user_href": "/profile/Lopez-Rodriguez"
                },
                {
                    "user_id": "Jack Respeliers",
                    "user_href": "/profile/Jack-Respeliers"
                },
                {
                    "user_id": "Matt Krebs",
                    "user_href": "/profile/Matt-Krebs-5"
                },
                {
                    "user_id": "Augusto Dantas de Oliveira",
                    "user_href": "/profile/Augusto-Dantas-de-Oliveira"
                },
                {
                    "user_id": "Arel Pasha",
                    "user_href": "/profile/Arel-Pasha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Venable",
                "href": "/profile/Timothy-Venable-2"
            },
            "answer_text": "Wow, and all this because Massachusetts, Rhode Island, and New York owned the Slave market after King George. Furthering the African slave trade of African Slaves. An attempted to dismember the Klan in 1868, Seemed to be re-birthed in hate of both White and Black republicans. Some say because of the Black Codes in the North. Which I have read the correspondence between England's famous actors of the time and even some respectable politicians Like the Mayor of Chicago who states that the worst place in the Country for the Black man Was the City of Brotherly love ? Now in that City is a group establishing Lincoln policies, called the Union League. Who appear to have produced the Black Codes. In the South, as well as earlier in the North. They were there to stop reconstruction we wanted no part of the False Union. Just a little Narrative from an Abolishinist, who fought Slavery all his life; The Priciple on which the war was waged by the North , was simply this: That men may rightfully be compelled to submit to, and support, a government that they do not want: and that resistence, on their part, makes them traitors and criminals. No principle, that is possible to be named, can be more self-evidently false than this; or more self-evidently fatal to all political freedom. Yet it triumphed in the field, and is now assumed to be established. If it really be established. If it really be established , the number of slaves, instead of haning been diminished by the war; has greatly increased; for a man, thus subjected to a government that he does not want is a slave. ",
            "date": "Answered June 2, 2019",
            "views": "327",
            "upvotes": "0"
        }
    ]
}