{
    "title": "If the world were to lose all electricity with no way to repair it, sending us back to the stone age, how many people would survive, how long would it take the survivors to rebuild technology back to the present? - Quora",
    "tags": [
        "Stone Age",
        "Survivalism",
        "Survival",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "If the world indeed lost “all electricity” , questioner, it would lose the biochemically generated current which keeps life as we know it in existence. Nearly everything would die, meaning that “recovery” would no longer be possible. Additionally, human technology existed for thousands of years following the so-called Stone Age. In fact, it wasn't until the latter part of the 19th century that electricity first began its widespread use in major cities. Even today there are many areas around the world where electrical service is spotty, or nonexistent, and which don't exist in primitive conditions. So the loss of electrical generation would move society back 100-150 years, not 2-3,000. As to how many people might survive: Probably billions. While there would certainly be major die offs in a number of areas around the world, most them would be in areas where the food distribution networks are already troubled, and where the population vastly exceeds it's government's ability to maintain. In developed nations, the death tolls would also be high.; however technological advances would offset the lack of electrical power, at least for several years. To the final part of your question: Technology isn't going to disappear because the lights have gone off. There are millions of trained people, vast libraries of accumulated knowledge, and centuries worth of technology laying around. Things wouldn't have to reinvented; just restarted. And that can be using using spring energy, flywheels, or even chemical energy until electrical power was restored. ",
            "date": "Updated April 16, 2019",
            "views": "352",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Carey",
                "href": "/profile/Stephen-Carey-14"
            },
            "answer_text": "I don’t think my grandmother or her antecedents would agree that they lived in the stone age! They didn’t have electricity in their houses, and electricity hasn’t been around for very long - around the 1870s. Before that it was the horse - and cart. Nowadays, how many would survive? I would imagine most country people would survive, until the masses from the cities poured out and tried to take everything away from you. The survival of the fittest would probably break down any last vestiges of law and order, with the “walk tall and carry a big stick” chap and his ugly cohorts being the order of the day, pretty much like it was in the middle ages with the Lord of the Manor. As for rebuilding technology back to the present without electricity - well, that’s just about impossible isn’t it? You’ve said it can’t be fixed now, so it can’t be reinvented - imagine Michael Faraday standing by his new generator and saying “I can’t understand it, in theory it should work, but it doesn’t!”. We could arrange transport by steam engine, but making parts without electricity is going to be difficult - back to the horse. If you’re worried about the cessation of electricity in our lives, best to retrain as a blacksmith - the reason why there are so many Smiths in the UK is because every village and town had them. When I was a kid living in the country, the local garage was often the local smithy - he just sold petrol for those new-fangled horseless carriages. Never catch on… ",
            "date": "Answered November 8, 2018",
            "views": "225",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Lea",
                    "user_href": "/profile/Michael-Lea-16"
                }
            ]
        }
    ]
}