{
    "title": "If the President is removed from office, and the VP takes over, can he then just make the former president his VP? - Quora",
    "tags": [
        "Vice President of the United States",
        "U.S. Vice Presidents",
        "Executives",
        "Vice Presidents",
        "Impeachment",
        "Presidents",
        "Presidents of the United States of America",
        "Politics",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luther Berg",
                "href": "/profile/Luther-Berg"
            },
            "answer_text": "Once the VP becomes president, “and he shall have Power to grant Reprieves and Pardons for Offences against the United States, except in Cases of Impeachment.” Art. 2, sec. 2 I think it means the president can’t prevent an impeachment, nor pardon someone who was convicted in an impeachment. I’m not clear if that means the president can’t pardon someone to protect them for crimes committed to protect the president from being impeached. Also, it seems that conviction by the Senate, by 2/3 vote, isn’t a bar to a future federal office, such as federal judge, vice president or president. The bar to future federal office is an additional punishment that requires another vote by the Senate, this time requiring only a majority vote. For example, Alcee Lamar Hastings was a federal judge, removed by impeachment, but the Senate didn’t take the additional step of baring him from future federal office. He was then elected to the House of Reps from Florida. Although the House could have refused to seat him, they didn’t, and he has served in the house for something like 25 years, holding positions of leadership. No one will even run against him. He has cancer, so it seems that only death will remove him from office. Prior to his impeachment, the FBI found evidence of something like accepting bribes. He was tried, found innocent in a jury trial, but impeached and removed anyway. Was it wrong to impeach him, since he a jury had already found him innocent, or wrong to seat him since he had been impeached, or right to seat him since the voters knew the whole story and voted for him anyway? ",
            "date": "Answered September 28, 2019",
            "views": "205",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Samuel Blair",
                "href": "/profile/Samuel-Blair-5"
            },
            "answer_text": "No, he can't. The requirements for the position of VP are the same as for President. He must be at least 35 years of age, have lived in the US the last 14 years, be a native born citizen, and have no criminal history. If he was removed from the Presidency, it would have been by Impeachment and conviction in Congress, indictment and conviction in court or removal via the 25th Amendment. Any one of these would disqualify him on the grounds of criminal history. So no, Pence could not succeed him, appoint him, then resign and be reappointed VP. Besides, when the VP succeeds the President in midterm, and he chooses a new VP, that VP must go through a Senate confirmation hearing. Bear in mind that in the likeliest scenario arising from the circumstances your cited, the Senate just got done convicting him of “high crimes and misdemeanors, along with other offenses”. Do you really think they would then turn around and confirm him right back into the line of succession for the office they just convicted him of violating? I seriously doubt that would happen. ",
            "date": "Answered September 27, 2019",
            "views": "563",
            "upvotes": "0"
        }
    ]
}