{
    "title": "If Turkey and Greece went to war, who would support Greece? - Quora",
    "tags": [
        "Greek–Turkish Relations",
        "Greece",
        "Turkey (country)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eusinho Sou",
                "href": "/profile/Eusinho-Sou"
            },
            "answer_text": "European Union will support Greece. “We (the EU member states) are clear and determined in defending the European Union’s interests and solidarity with Greece and Cyprus. Turkey has to refrain from unilateral actions. This is a basic element to allow the dialogue to advance,” EU top diplomat Josep Borrell said. Germany, Italy and Malta are the more cautious about slapping sanctions on Turkey, according to diplomatic sources. Those countries reportedly expressed fears that Turkey could retaliate by releasing towards Europe the four million of migrants currently held on its soil, but without any doubts German Chancellor Angela Merkel has said EU countries have an obligation to support Greece and Cyprus. The Chancellor added that she had already discussed the dispute between Athens and Ankara “intensely” with French President Emmanuel Macron, Sputnik reported. Diplomats say France and Austria have adopted the toughest stance against Turkey. Paris has already sent warships in the region, while Vienna asked once again for the official end of Turkey’s EU accession process. Turkey defies EU ultimatum, threatens with war Merkel Says All EU Countries Have Obligation To Support Greece Against Turkish Aggression - Greek City Times If turkey keep this atitude all this could escalate into an actual military conflict…Look how easy the thinks could be very dark…for all, not just for Turkey or Greece. If for some reason Turkey attacks or invades some Greek territory, immediately the eu-battlegroups will be triggered to help and protect the Greek people. That's what they were created for and they exist today. It has nothing to do with Nato nor need Nato for anything. EU Battlegroups are multinational, military units, with at least 1500 personnel each and form an integral part of the European Union's military rapid reaction capacity to respond to emerging crises and conflicts around the world. The European Union Battlegroup is the EU's Rapid Response Force and can be deployed in a radius of up to 6,000 km around Brussels. The EUBG concept forms the basis for the EU's rapid crisis response and is intended to ensure the strategic independence of the European Union. They permit the EU and its Member states to respond early and rapidly to evolving conflicts. Preventing conflicts and engaging at an early stage is more efficient and effective than engaging at a later stage in fully fledged violent conflicts. In conjunction with a reliable early warning system, EU Battlegroups permit a targeted and rapid response to minimise human suffering and insecurity. In a world of predictable unpredictability, reacting fast is at times the only way to react effectively. While Member States remain in the driving seat and are responsible for deploying security and armed forces when needed, the EU can facilitate and reinforce this cooperation and make the collective effort more effective. Ensuring a joined-up and comprehensive approach which makes full use of all the EU's available instruments and acts on all stages and levels of the conflict is essential to achieve a lasting resolution of violent conflicts and crises. EU Battlegroups If things happen now in the second half of 2020 the european union has two battle groups in stand by that and other sixteen Battlegroups ready too. One battle group with German as frame nation. Germany acts as the lead nation, to which other countries can dock with their contingents and the other with Italy as frame nation. The “German” lead battle group composed with eight other EU countries: German contribution: · Germany is sending around 2600 soldiers, the majority from the 26 Parachute Regiment. Austria contribution: · Is making a contribution between 607 soldiers of a fully equipped battalion with mission support specialists. · is also making a contribution with logical forces. · The Austrian Participant will assume responsibility as Logistic Lead Nation (LLN) for the BG. Participant that assumes the overall responsibility for organising and coordinating a certain spectrum of logistic support for all or parts of the multinational force Croatia contribution: · 225 soldiers mainly the members of the motorised infantry company of the Battalion “Vukovi” members of the Fire Support Company 1st Motorized Battalion Vukovi brigades (GMTBR) By the way, the main task of the Fire Support Company is to provide fire support to its own battalion, and the LMB 120 mm M-75 light mortars are the basic weapons for providing fire support. · One engineer platoon · a logistic squad · a Military Police team · staff officers Czech Republic contribution: · is sending around 160 soldiers, One paratroop company · a Military Police team Finland contribution: · Will contribute about 80 soldiers. Finland's division consists of an armored reconnaissance platoon consisting of a miniature drone group, · staff officers, · national support element Ireland contribution: · Ireland will contribute with 155 soldiers. The Defence Forces contribution to this battle group will involve a special operations task group comprising a special operations forces platoon (Members of the elite Army Ranger Wing (ARW). · One engineer special search capability company, · explosive ordnance disposal, EOD, capability, · a security platoon, · staff posts at force headquarters Latvia contribution: · Latvia participated timidly in the EUBG, committed nine soldiers to the battle group. 9 Latvian National Guard. Nine lions is better than 500 sheep, they say... Netherlands - Dutch contribution: 730 soldiers come from the Netherlands 11th Air Mobile Brigade. 2 companies of the airmobile brigade, supplemented by Apache combat and Chinook transport helicoptersa C-13 Hercules transport aircraft.airborne medical company,· airborne combat service support company Sweden · Approximately 20 CBRN experts from Sweden. The Swedish contribution will consist of a unit with CBRN capability, ie specialized in detection, identification and decontamination of chemical, biological and radioactive weapons. More Medical Service. The total size its 4100 soldiers and many equipment... The “Italian” lead battle group composed with 3 other EU countries: It is one European Union Amphibious Battle Group and The unit uses a modular organization that is; it can grow or decrease depending on the threat... its main goal is projection of naval power on land... Vessels aircraft carrierCavour (C 550) has the capabilities to support amphibious operations, with the possibility of being able to transport a company of navy riflemen. aircraft carrierJuan Carlos I (L-61)Giuseppe Garibaldi (C 551)amphibious assault shipsGalicia (L-51)Castilla (L-52)St. George (L 9892)San Marco (L 9893)San Giusto (L 9894)L 173 HS Chios (1996) L 174 HS Samos (1994) L 175 HS Ikaria (1999) L 176 HS Lesbos (1999) L 177 HS Rodosfive conventional landships of type \"JASON\"L 180 KefaloniaL 181 IthakiL 182 KerkyraL 183 Zakinthosfour hovercrafts of type \"ZUBR\",And of course of the marines troops. Italy send 1st Rgt Anfibio San Marco Spain from the spanish Marine corps designated Tercio de Armada (tear). Two conventional and one mechanized on 8x8 Piranha. Portugal – a company of Portuguese Marine corps ( Portuguese Fusileiros). Greece - a company of Greek Marine corps. There was also a large number of aircraft from both the Navy, Harrier aircraft, SH3D, SH60, AB212, etc That’s a lot of fire power...But as you can see it's not just about power...but soft power too. If all these countries in one way or another are going to get involved in this scenario ... things will get very complicated ",
            "date": "Answered September 19, 2020",
            "views": "595",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Efthimis Mavr",
                "href": "/profile/Efthimis-Mavr-2"
            },
            "answer_text": "Greece is a peaceful nation, we don’t support war especially with allied powers, the only time Greece will go to war with Turkey is if Turkey attacks us first BUT! the North Atlantic Treaty (the treaty on the formation of NATO) states on Article 5 that: “An armed attack on one member state is an attack on all’’ which means that if Turkey dares to declare war, Greece has the right to invoke article 5, and then Turkey will be at war with 29 countries instead of just one. Also, Greece, as a member of the EU is also protected by another 6 non-NATO countries so that raises the number of allies to 35 (Based on the Treaty of Lisbon: Mutual Defense Clause). Also, Turkey’s relations with Russia couldn't be described as the best, so another possible ally is Russia cause they wouldn’t let Turkey control the Eastern Med. Then Russia is a member of the CSTO (Collective Security Treaty Organization) in which Armenia, a neighboring country of Turkey is also a member of. Then we have the EastMed Gas Pipeline, why this is important? Because in the agreement, there is an article which states that “the pipeline shall be protected by any means” which also means by the military. So this means that Turkey will also have to face Israel, a tiny nation yet one of the strongest. So tell me, please, would Turkey really risk a world war with 42 strong nations? ",
            "date": "Answered May 23, 2020",
            "views": "16",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Domenic Nicosia",
                    "user_href": "/profile/Domenic-Nicosia-2"
                },
                {
                    "user_id": "Ahmet Caliskan",
                    "user_href": "/profile/Ahmet-Caliskan-4"
                },
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                },
                {
                    "user_id": "George Papantoniou",
                    "user_href": "/profile/George-Papantoniou-1"
                },
                {
                    "user_id": "Theocharis Moustakas",
                    "user_href": "/profile/Theocharis-Moustakas"
                },
                {
                    "user_id": "Alex Mercer",
                    "user_href": "/profile/Alex-Mercer-294"
                },
                {
                    "user_id": "Felix Bluey",
                    "user_href": "/profile/Felix-Bluey"
                },
                {
                    "user_id": "Cathal Stein",
                    "user_href": "/profile/Cathal-Stein"
                }
            ]
        }
    ]
}