{
    "title": "If the Vikings were so strong, why were they annihilated so quickly? - Quora",
    "tags": [
        "Norse Mythology",
        "Vikings"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Moe",
                "href": "/profile/David-Moe-9"
            },
            "answer_text": "The Vikings weren’t annihilated, they invaded countries, displaced their rulers, took over their lands, became the rulers themselves, and then adopted the lifestyle of the local people. Then they stopped the rest of the Vikings from invading their own personal kingdoms. A classic case was Rolf the Ganger, a Viking who raided France and attacked Paris. Rather than fight, the French king, Charles the Simple, gave him Normandy, in return for not attacking Paris and keeping the rest of the Vikings out of France. As part of the agreement, Rolf and the rest of his Vikings converted to Christianity, learned to speak French, and adopted French customs. He became Duke Rollo of Normandy. They were totally French within two generations. His descendant, William the Bastard (so called because he was an illegitimate son of a subsequent Duke, Robert the Devil) later conquered England and became William the Conqueror. During the battles of 1066, King Harold of England, who was himself descended from Vikings, killed King Harald Hardrada (meaning Harald the Ruthless) who invaded from Norway, but shortly thereafter, Duke William of Normandy invaded England and killed King Harold of England at the battle of Hastings. Thus Duke William of Normandy, descendant of Viking Rolf the Ganger, became King William the Conqueror of England. Just as Duke Rollo had shut the door on subsequent Viking invasions of France, King William shut the door on subsequent Viking invasions of England and England has never been successfully invaded since. Something similar happened in Russia, because Russia was conquered by Swedish Vikings who became the rulers of the country. The name Russia is derived from an Old Norse term for \"men who row\", as rowing was the main method of navigating the rivers of Eastern Europe. Vikings rowed up the rivers, they saw the land, and they conquered it. And as in France and England, they adopted the language and the customs of the local people and became their rulers. Since that time Russia has never been successfully invaded from the west. Hitler had a racist theory about Aryans as being the “master race” but it was complete BS. The real Aryans invaded India from the North. They were light skinned but only compared to the original inhabitants of India, who were darker than today. Their descendants are still living in India, Pakistan, and Iran. If you are wondering why most of the rulers of Europe were tall, light skinned, and blue eyed, it is because most of them were descended from the Viking conquerors. That is why light skin, blond hair, and blue eyes became associated with racial superiority, at least in the minds of some people who don’t know their history. The Vikings were tall, blond, and blue eyed, but that is not why they took over. It was their skill at rowing longboats and swinging broad-axes that did it. Their large size did help, though. So, the Vikings weren’t annihilated, they conquered and then became the rulers. However, once one Viking took over, he would kill any other Vikings who tried to invade, and then the Viking invasions stopped. The descendants of less ambitious Norse who never left home are living in Norway, Sweden, and Denmark. Their more ambitious relatives ruled most of Europe for centuries. ",
            "date": "Answered July 17, 2017",
            "views": "262",
            "upvotes": " View 210 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Skow",
                    "user_href": "/profile/Richard-Skow-2"
                },
                {
                    "user_id": "Gary Keith",
                    "user_href": "/profile/Gary-Keith-42"
                },
                {
                    "user_id": "Cole Peterson",
                    "user_href": "/profile/Cole-Peterson-63"
                },
                {
                    "user_id": "Joshua Vetsch",
                    "user_href": "/profile/Joshua-Vetsch"
                },
                {
                    "user_id": "Student-Levi Coriell",
                    "user_href": "/profile/Student-Levi-Coriell"
                },
                {
                    "user_id": "Joe Doe",
                    "user_href": "/profile/Joe-Doe-335"
                },
                {
                    "user_id": "Cameron Wöltje",
                    "user_href": "/profile/Cameron-Wöltje"
                },
                {
                    "user_id": "Robert Savage",
                    "user_href": "/profile/Robert-Savage-15"
                },
                {
                    "user_id": "Jean Bradshaw",
                    "user_href": "/profile/Jean-Bradshaw-2"
                },
                {
                    "user_id": "Joshua Ambroise",
                    "user_href": "/profile/Joshua-Ambroise-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Per Jorgensen",
                "href": "/profile/Per-Jorgensen-1"
            },
            "answer_text": "Modernization and two pandemics, one of them bacterial, pacified the viking raider culture. Viking culture wasn't “annihilated”. It changed. You start with a society that's practically tribal in nature, with a bunch of small, often warring, chiefdoms. Arable land is precious, especially along the coasts, but those who do own land have a great deal of self determination. This isn't yet a feudal society. One way many of these people got good at adding to what you could pry out of the land was to go take it by force in hit and run raids. They were also traders, but for a time the risk-reward ratio of simply pulling up on the beach and raiding was very favorable. Meanwhile, modernization happens as chiefs and alliances are replaced with kings and earls consolidating and expanding their rule. It's what you'd expect to happen, a gradual transition to bigger, more centralized kingdoms and eventually states and nations. Those aren't compatible with a free-wheeling, loosely organized practice of raiding. Kings want to manage warfare and trade on a large scale, not leave it up to a bunch of farmers forming and dissolving alliances and bands for a summer of raiding. So you see the raids increase in scale until they no longer play to the strengths of the Norse but instead start to resemble warfare at scale, which the older and much larger European states know very well since literally thousands of years back. The Battle of Stamford Bridge is often used as a convenient marker for the “end of the Vikings” because it represents the kind of warfare the vikings were increasingly having to engage in but which they didn't have the scale nor tradition to win. There's a big difference between a few chiefs and landowners up and down the fjords pooling their resources to go raid poorly defended coastal villages and kings maintaining standing armies to engage in invasion and pitched battles. The Norse were clever and resourceful, but there just wasn’t that much you could squeeze out of those lands at the northern edges of Europe to equip and feed large armies. Consolidation brought with it the first pandemic: Christianity. If your ambition is to consolidate a kingdom, then you have two concerns. First, alliances with larger, more powerful kingdoms further south. Small, relatively poor kingdoms need allies. Those larger kingdoms are Christian. You need to establish that common thread, not to mention that the church itself is a major power player. Sitting on the outskirts as committed pagans is bad for consolidation of power and bad for business. Second, you need some way to establish and signify loyalty. What better way than to demand conversion? I'll know you're with me when you take the baptism to Kvitekrist (White Christ), renounce the old gods, build a church, and house and feed the clergy I'm sending up there who conveniently report to me. Any of your guys won't play ball, we'll remove his head, give his farm to one of my cronies, and enthrall his wife and children. So whaddaya say, how about a wee dunking? Christianity helped enforce and justify submission to central authority. It was a tool to enforce loyalty, obedience, and centralized power, which gradually turned the Scandinavian lands into more or less the feudal states you're familiar with further south in Europe. Not exactly the same, but close enough. Loosely organized raiding for profit does not fit into that plan. Then, the second pandemic hit, the bacterial Black Death — bubonic plague — which reached Bergen in 1349 and proceeded to wipe out maybe half the Norwegian population, which was sparse to begin with. To the extent there was fight left in the Norse, the Black Death beat it out of us. You were too busy trying to survive and put the pieces back together. And that was the end of it. A culture and lifestyle that worked for a while in one specific time and set of circumstances ceased to be viable, so it changed. What Happened to the Vikings?5 Major Factors That Ended the Viking Age - C.J. AdrienBlack Death - Wikipedia",
            "date": "Answered July 17, 2017",
            "views": "79",
            "upvotes": " View 60 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Curtis",
                    "user_href": "/profile/James-Curtis-15"
                },
                {
                    "user_id": "Hải Đông Nguyễn",
                    "user_href": "/profile/Hải-Đông-Nguyễn"
                },
                {
                    "user_id": "John Linstead",
                    "user_href": "/profile/John-Linstead"
                },
                {
                    "user_id": "Patricia Ritsema van Eck",
                    "user_href": "/profile/Patricia-Ritsema-van-Eck-1"
                },
                {
                    "user_id": "Elise Chevalier",
                    "user_href": "/profile/Elise-Chevalier-2"
                },
                {
                    "user_id": "David Geraghty",
                    "user_href": "/profile/David-Geraghty-2"
                },
                {
                    "user_id": "Victor Magallanes",
                    "user_href": "/profile/Victor-Magallanes-1"
                },
                {
                    "user_id": "Tayo Akin",
                    "user_href": "/profile/Tayo-Akin"
                },
                {
                    "user_id": "Maureen Lycaon",
                    "user_href": "/profile/Maureen-Lycaon"
                },
                {
                    "user_id": "Henry Norman",
                    "user_href": "/profile/Henry-Norman-3"
                }
            ]
        }
    ]
}