{
    "title": "If there were to be a war between all the continents, which continent would win? - Quora",
    "tags": [
        "Continents (physical geography)",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Whitefield",
                "href": "/profile/Sam-Whitefield"
            },
            "answer_text": "Assume no nuclear weapons are going to be used. We're going Ender's Game on this and saying there's a group preventing any nuclear missiles from flying, but all other military capabilities are the same as now.Preliminary moves:I'm going to guess the intention was that North and South America would be separate continents. However, it turns out that doesn't matter all that much. Because North American has the United States, plus manpower from Canada and Latin America. Most importantly, the US has more aircraft carriers than the rest of the world combined. Remember that, it's important.North America is able to pretty quickly take over South America (if we get to do negotiations instead of insane continent-wide xenophobia, it goes even faster). One of the things Risk (the board game) got right is that it's very very difficult to invade the Americas. North America gets to sit for a while and consolidate its position.While this is happening, we have a huge development in Asia. India and China have allied together with their fellow Asian nations and are reenacting the Mongol invasion of Europe, except this time they have more people. Right after WW2, some Allied leaders wanted to use nukes against the Soviet forces in Europe because they knew the Soviets had enough manpower to take all of Western Europe if they wanted. Nukes are out of play in our scenario, and the Asians have far more manpower than the Soviets ever dreamed of. I'm calling Russia a European country for the purposes of this, but it doesn't matter--their old military tech doesn't do much against the largest human wave attack the world has ever seen. Neither can the Germans (though they put up a good fight), and so Europe is reduced to (at best) a small perimter around Calais and the two islands of the UK. Everything else is Asia.Africa has even less in the way of organized military forces than Europe. While it would be an absolute bitch to hold, Asia conquers it rather easily.Australia doesn't have any population to speak of, so they just sit quietly in the South hoping no one notices them. Which works.With preliminaries over, the world is divided into two major powers: The North American Alliance (which holds all of the Americas) and the Asian Invasion (holding most, if not all, of Eurasia). Europe's last hope is a bunch of doughty Brits, but without American support they can't very well go on the offensive, so they keep calm and carry on. Australians attempt to recruit the ridiculously scary animals of their island to fight for them, but generally don't do very much. Here's how the next bit shakes down. The North American Alliance has naval control: the US Navy alone is enough to ensure that. Without naval superiority, the Asians have no decent method for transporting their troops to the Americas. Any attempt to move them across the Bering Straight will meet with huge problems due to weather as well as the threat of bombing raids from the aforementioned aircraft carriers. Plus, the Bering Straight is still a lot of water--the navy could blow up any troop carriers long before they reached shore. So no invasion of the Americas is happening.The problem on the reverse end is that the North Americans can move troops wherever they want, but once they get there they have to deal with an army of hundreds of millions of troops. Even if they land in Occupied South Africa, the sheer volume of Asian troops will make it incredibly difficult to move beyond the initial landing zone. Defeating a numerically superior enemy takes lots of time--think how long it took for Germany to be defeated, and they were the smaller nation, population-wise, in both WW1 and WW2. Superior technology, air and sea superiority, and better special forces allow the North Americans to win, but it takes many years and probably a scorched-earth campaign against some food-producing regions of Asia to finally bring it to its knees. ",
            "date": "Updated January 30, 2013",
            "views": "122",
            "upvotes": " View 71 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doles Pierre",
                    "user_href": "/profile/Doles-Pierre"
                },
                {
                    "user_id": "Keenan Haug",
                    "user_href": "/profile/Keenan-Haug-1"
                },
                {
                    "user_id": "Akezhan Kingushanov",
                    "user_href": "/profile/Akezhan-Kingushanov"
                }
            ]
        }
    ]
}