{
    "title": "If we cloned William Shakespeare, would the child grown up to have all the same talents of Shakespeare? - Quora",
    "tags": [
        "Clone",
        "Cloning (biology)",
        "Shakespeare Plays",
        "William Shakespeare",
        "Talent",
        "Writers and Authors",
        "Genetics and Heredity",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yonatan Rocha",
                "href": "/profile/Yonatan-Rocha"
            },
            "answer_text": "First of all, let us get to the basics: neither you nor anyone can clone another human being - this is entirely in the realm of science fiction. Second point: since the premise of the question is faulty, we can only really answer the question from reality, and it does not follow logically that the child of a genius will necessarily also be a genius in the same manner as his or her parent. It might be possible that from a common environment and nurturing education, that a child of a genius might also develop talents, and even possible for similar talents to be found, but there is not any guarantee of such an event and my money would be on the other option: probably not the case. ",
            "date": "Answered April 23, 2020",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Halina Minadeo",
                    "user_href": "/profile/Halina-Minadeo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Knox",
                "href": "/profile/Christopher-Knox"
            },
            "answer_text": "No. Genetics plays a part, but most of what made Shakespeare who he was had to do with his experiences and his environment, which is impossible to clone. Personally, I’ve known at least one pair of identical twins, who were almost nothing alike, other than appearance (of course, we’ve recently discovered that identical twins are not, in fact, identical). ",
            "date": "Answered April 23, 2020",
            "views": "58",
            "upvotes": "0"
        }
    ]
}