{
    "title": "If you get deported from a country, who pays for your ticket home? - Quora",
    "tags": [
        "Deportation",
        "Immigration",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Chandler",
                "href": "/profile/Mike-Chandler-67"
            },
            "answer_text": "In Canada, if you are deemed inadmissible at a port of entry and were arriving by commercial conveyance (ie. airline, ferry, train, bus), then the operator of that conveyance is responsible for returning you to the last port of departure (which is part of the reason why one-way international airfares cost so much money). If you were arriving by private conveyance (ie. private plane, boat, or a car at the land border), you’ll be instructed to turn around and leave Canada. If you are already in Canada and an immigration judge issues you a deportation order, there is usually a grace period for you to make arrangements to leave Canada voluntarily. In this case, you can purchase your own ticket out of Canada, and depending on your country’s consular services charter, you may be able to seek assistance from your home country’s government for help returning home in the form of a loan or grant to purchase a ticket. If you ignore the deportation order, then a removal order will be issued, along with a Canada-wide arrest warrant. At this point, CBSA inland enforcement officers may be actively searching for you, or alternatively, if you end up making contact with local police and they query your name against CPIC, they will see the arrest warrant and turn you over to the CBSA. You will then be placed in immigration detention awaiting for a flight out of Canada, and you are normally responsible for covering the costs of your deportation. In the event where you do not pay the cost for your deportation, the Government of Canada will cover for it; however, you will be in debt to the Government of Canada and have to repay this debt in the future should you ever want to re-enter Canada once your exclusion order expires. ",
            "date": "Answered August 6, 2020",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ranganath Prahlad",
                    "user_href": "/profile/Ranganath-Prahlad-2"
                },
                {
                    "user_id": "Lakshminarayan R Iyer",
                    "user_href": "/profile/Lakshminarayan-R-Iyer"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Burgess",
                "href": "/profile/John-Burgess-1"
            },
            "answer_text": "It depends on when (as well as where, of course) you're being deported. For the US (it may be the same in some other countries): If you're refused entry to a country, then the airline has to pay to take you back to where you boarded. If you agree to depart voluntarily (self-deport) as part of a pre-trial settlement, then you buy your ticket. If you're being deported due to some criminal offense, your sentence may require you to pay for you ticket. Or, the government can confiscate and auction your personal property (house, car, jewelry, etc.) to pay for the ticket. If there's no way to squeeze the fare out of you, then the government will buy the ticket. It may well send you a bill, however. If you're part of a large group being deported back to a single country, the US might provide its own plane or ask that country to provide one of its own. If you're being deported to the US, then an embassy will ask you to pay. If you don't have the money, they'll ask you to get your family or friends to pay. If they are unable to do so, then and only then will the government buy your ticket. They expect to be paid back and will set the bill-collector hounds on you if you do not. They will also confiscate your passport and replace it with a single-trip passport that will allow you to re-enter the US, but is invalid for any other travel. ",
            "date": "Answered March 3, 2014",
            "views": "866",
            "upvotes": " View 96 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Sameer Sai",
                    "user_href": "/profile/Sameer-Sai-1"
                },
                {
                    "user_id": "Nitish B",
                    "user_href": "/profile/Nitish-B-8"
                },
                {
                    "user_id": "Ernst Becker",
                    "user_href": "/profile/Ernst-Becker"
                },
                {
                    "user_id": "Paul E. Glotzer",
                    "user_href": "/profile/Paul-E-Glotzer"
                },
                {
                    "user_id": "Lakshminarayan R Iyer",
                    "user_href": "/profile/Lakshminarayan-R-Iyer"
                },
                {
                    "user_id": "Justin Vu",
                    "user_href": "/profile/Justin-Vu-12"
                },
                {
                    "user_id": "Andhavarapu Balu",
                    "user_href": "/profile/Andhavarapu-Balu"
                },
                {
                    "user_id": "Akhil Ramachandran ( അഖിൽ രാമചന്ദ്രൻ )",
                    "user_href": "/profile/Akhil-Ramachandran-അഖിൽ-രാമചന്ദ്രൻ"
                },
                {
                    "user_id": "Gary Vincent",
                    "user_href": "/profile/Gary-Vincent-16"
                }
            ]
        }
    ]
}