{
    "title": "If you could give a warning to only one person at any time of history, who would it be and what would you say? - Quora",
    "tags": [
        "World History",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samantha Dalton",
                "href": "/profile/Samantha-Dalton-43"
            },
            "answer_text": "Some of you may disagree with this answer, I totally get that. Criticism is open I would time travel to the year 1907, and go to the Academy of Fine Arts in Vienna, Austria. Most of you probably know this man:  The dictator of Germany from 1933 to 1945. The man responsible of the deaths of millions of Jews, Slavs, and other races he deemed “unworthy”. The man responsible for the most deadly conflict in history, WWII. No other than Adolf Hitler Most people don’t know that this same man who did all of that originally wanted to be an artist. So, what would traveling to the academy in 1907 do? It might’ve changed the course of history. Hitler applied to the academy in 1907 and 1908 and both times he didn’t make it in. They deemed his work “unsatisfactory”. However, they said he could apply to the School of Architecture, but since he didn’t finish secondary school he couldn’t be accepted there either. This would lead him to become interested in politics and become the Chancellor of Germany, and the rest is history. Scenario Time So, I walk into the academy a couple days before Hitler would get rejected. I ask them if there’s this one man with the name of Adolf Hitler who applied there. They say yes and ask me why. I tell them that if they don’t at least give him a chance in the school, then history will take a different path. I explain to them that if they don’t let him in, then he will try again next year and fail. Then become interested in politics, when WWI starts he will inlist himself in the German army. Growing CRAZY patriotic in the process. Then, when Germany get defeated, he will feel a lot of anger towards the Entente and want Germany to get even. He will then become Chancellor in 1933 then when President Paul Von Hindenburg dies, he will become president. Then dictator, and annex the whole of Austria. Invade Czechoslovakia, then invade Poland with Stalin. Which will create ANOTHER World War. Which leads to him killing and murdering millions of Jews, Slavs, and “lesser” races in concentration camps. Then he’ll eventually commit suicide then Germany gets divided for 41 years. Either the person looks at me like I’m crazy, or be terrified that they oblige and let Hitler in, despite his unsatisfactory work. If they do think I’m crazy then history will be the same. If they take my warning, then Europe and the rest of the world may change for better or for worse. Like I said at the beginning of the answer, criticism is welcome. If you have a better way of explaining this, then say what it is in the comments. ",
            "date": "Answered March 30, 2020",
            "views": "60",
            "upvotes": " View 661 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cody Judkins",
                    "user_href": "/profile/Cody-Judkins-1"
                },
                {
                    "user_id": "BitGMD",
                    "user_href": "/profile/BitGMD"
                },
                {
                    "user_id": "London Hopkins",
                    "user_href": "/profile/London-Hopkins-2"
                },
                {
                    "user_id": "Fred Jerome",
                    "user_href": "/profile/Fred-Jerome-2"
                },
                {
                    "user_id": "Mirant Vyas",
                    "user_href": "/profile/Mirant-Vyas"
                },
                {
                    "user_id": "Sedrick Jeremmiah",
                    "user_href": "/profile/Sedrick-Jeremmiah"
                },
                {
                    "user_id": "Arel Pasha",
                    "user_href": "/profile/Arel-Pasha-1"
                },
                {
                    "user_id": "Mike Smith",
                    "user_href": "/profile/Mike-Smith-6747"
                },
                {
                    "user_id": "Sophia Harding",
                    "user_href": "/profile/Sophia-Harding-8"
                },
                {
                    "user_id": "Raissa Silva",
                    "user_href": "/profile/Raissa-Silva-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosa Martin",
                "href": "/profile/Rosa-Martin-22"
            },
            "answer_text": "Unbeknownst to the world until this moment, I am virtually certain to have been the only person then alive to have rationally anticipated and also to have contemplated giving warning as regards the danger of assassination on the day of JFK’s killing in Texas. Although thinking hard and excruciatingly about doing so, both to the secret service and to the DPD at the time, I could not, as a newly fourteen year old determine whether or not any such warning as I could have attempted to give would have even been listened to, much less have been meaningfully heeded. As it turned out, as a person then likely as familiar if not more so than anyone else but one with the facade of the book depository and the superlative beauty and peacefulness of Dealy Plaza in the years leading up to that day, I could not have imagined that such an opportunity for momentous crime could have been overlooked by all except one lone child; or that the sniper’s building would even have been allowed to remain occupied during that day; much less during the actual, present passage of a presidential parade. Coincidentally, it would turn out that within three and one half years and 4–1/2 hours of that tragedy, I, myself, would be found under emergency treatment on the same cart and in the same ER and by two of the same physicians at Parkland who had attempted to avert the late president’s death, albeit that his minutes either as a government official or as a coherent human being had already been terminated before exiting the scenic, downtown gateway plaza. ",
            "date": "Answered January 14, 2019",
            "views": "899",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Logan Hess",
                    "user_href": "/profile/Logan-Hess-7"
                },
                {
                    "user_id": "Jim Buie",
                    "user_href": "/profile/Jim-Buie"
                },
                {
                    "user_id": "Matthew D Miron",
                    "user_href": "/profile/Matthew-D-Miron"
                },
                {
                    "user_id": "Jason Shaw",
                    "user_href": "/profile/Jason-Shaw-32"
                }
            ]
        }
    ]
}