{
    "title": "If zero was invented around the 5th century, how did they classify the years using BC and AD? - Quora",
    "tags": [
        "Before Zero",
        "Invention of Zero",
        "Anno Domini (numbering system)",
        "Before Christ (numbering system)",
        "History of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhinav Ashish",
                "href": "/profile/Abhinav-Ashish-12"
            },
            "answer_text": "Good question. I will explain everything properly in details.  No , zero was not invented in 5th century, it was invented much earlier at different places at different times. The Mayans, Egyptians, Babylonians , Indians , all of them invented zero separately. You must be thinking about Aryabhatta, but what Aryabhatta invented was the concept of zero as a notation in the decimal system. Now, coming to the concept of BC and AD. Basically what we follow is The Gregorian Calendar. BC means “ Before Christ “ . This system takes birth of Jesus Christ as a reference year. All the years before the birth of Christ are followed by BC . For example 300 BC means 300 years before the birth of Christ. Another interesting thing is that BC moves from back to front unlike AD i.e. 300 BC comes before 250 BC and so on. The last BC year is 1 BC . After 1 BC , begins AD. The first AD year is 1 AD. Full form of AD is “ Anno Domini “, which means “ in the year of the Lord” . Anno Domini is taken from the phrase “ anno Domini nostri Jesu Christi “ , which means “ in the year of our Lord Jesus Christ “. AD moves normally , from 1 AD to infinite AD. We are presently in 2018 AD. Hope it is clear now :) Many people think AD means After Death but this is a completely wrong conception. Another important point is that 1 BC is immediately followed by 1 AD ; there is nothing between them. In a nut shell , BC is from infinite past to 1 BC and AD is from 1 AD to infinite future. Hope you like it. Thank you :) ",
            "date": "Answered February 7, 2018",
            "views": "12",
            "upvotes": " View 43 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ravali Vaishu Pramoudh Mamidala",
                    "user_href": "/profile/Ravali-Vaishu-Pramoudh-Mamidala"
                },
                {
                    "user_id": "Shubham Verma",
                    "user_href": "/profile/Shubham-Verma-234"
                },
                {
                    "user_id": "Ushi Stm",
                    "user_href": "/profile/Ushi-Stm"
                },
                {
                    "user_id": "Arjaita",
                    "user_href": "/profile/Arjaita-1"
                },
                {
                    "user_id": "Pooja Madan",
                    "user_href": "/profile/Pooja-Madan-7"
                },
                {
                    "user_id": "Jamshed Afridi",
                    "user_href": "/profile/Jamshed-Afridi-4"
                },
                {
                    "user_id": "Prem Anand",
                    "user_href": "/profile/Prem-Anand-386"
                },
                {
                    "user_id": "Neha Jain",
                    "user_href": "/profile/Neha-Jain-2151"
                },
                {
                    "user_id": "Raghu Raghu",
                    "user_href": "/profile/Raghu-Raghu-366"
                },
                {
                    "user_id": "Imran Pasha",
                    "user_href": "/profile/Imran-Pasha-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Riggsby",
                "href": "/profile/Matt-Riggsby"
            },
            "answer_text": "As it happens, the use of AD didn’t appear for several centuries after Christ’s lifetime. It was developed in the early sixth century, around the same time as zero was developed in the Old World. However, the European monks who invented AD and added BC some time later didn’t know what was going on among mathematicians in India. Zero didn’t make its way to Europe until some time in the 11th century, long after the use of AD had become widespread in western Christendom. Consequently, those monks didn’t use it. The AD/BC system and its CE/BCE rebranding have no year 0. The last year before the traditional birth of Christ (which is actually a few years after our current best guess for the actual birth of Christ, but it’s far too late to fix that now) is 1 BC. The following year is 1 AD. That’s not how modern computer programmers think, but for people who are used to counting only things which have actual physical existence, starting with 1 rather than having a specific place for “no things at all” is entirely natural and sensible. ",
            "date": "Answered February 6, 2018",
            "views": "229",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Iha Bae",
                    "user_href": "/profile/Iha-Bae"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                }
            ]
        }
    ]
}