{
    "title": "In 1990, was it ever possible for East Germany to become another independent country, instead of reunifying with West Germany? - Quora",
    "tags": [
        "German Democratic Republic (DDR)",
        "Politics of Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Kemper",
                "href": "/profile/Frank-Kemper"
            },
            "answer_text": "Within the GDR (East Germany) many social democrats like Markus Meckel were discussing a so called \"third path\". Their idea was to impose democratic reforms to the socialistic system in order to make the GDR able to survive. The West German SPD also promoted the idea of a federation between the two Germanys. The SPD top candidate for the 1990 elections, Oskar Lafontaine, even suggested to break up with taboos: Since 1949, the Federal Republic had always granted East Germans full citizenship as well as access to Western German social welfare. As soon as the wall came down, a big brain drain started: Thousands of GDR citizen left their homeland for the FRG. Oskar Lafontaine made the proposal to treat GDR citizens different than FRG citizens and to deny them access to the FRG welfare system. Lafontaine also opposed against the announced \"Currency Union\", because he did not believe that the GDR economy could survive under free market conditions (In fact he was right with that, after the currency union the East German economy collapsed almost instantly) As a matter of fact, the people of the GDR had the choice when they voted for the first free and democratic East German parliament. They could decide between socialists and social democrats, who proposed a new, free, democratic GDR, or they could vote for the Christ Democrate proposal of a merger between the two states. The people chose the merger, not the federation. And obviously, the people wanted to have a merger as fast as possible, so they decided that the GDR would dissolve itself and ask to join the FRG. So the GDR adopted the political system of the FRG. This even repelled some West German citizens, because until 1990 our constitution (which is not called constitution but \"fundamental law\") contained a prefix saying that this funfamental law will be replaced by a real constitution as soon as both Germanys come together again in peace and freedom. This never happened. The GDR dumped their own constitution and adopted ours. Later, one rather cynical guy said: \"The East Germans did not vote for freedom and democracy, they voted for whipped cream\" ",
            "date": "Answered November 9, 2018",
            "views": "18",
            "upvotes": " View 45 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bagus Anugerah Yoga",
                    "user_href": "/profile/Bagus-Anugerah-Yoga"
                },
                {
                    "user_id": "Mark M Power",
                    "user_href": "/profile/Mark-M-Power"
                },
                {
                    "user_id": "Martin Ambrosius Hackl",
                    "user_href": "/profile/Martin-Ambrosius-Hackl"
                },
                {
                    "user_id": "Johan Olofsson",
                    "user_href": "/profile/Johan-Olofsson"
                },
                {
                    "user_id": "Christina Power",
                    "user_href": "/profile/Christina-Power-1"
                },
                {
                    "user_id": "Jens Grueber",
                    "user_href": "/profile/Jens-Grueber"
                },
                {
                    "user_id": "Asim Chilwan",
                    "user_href": "/profile/Asim-Chilwan"
                },
                {
                    "user_id": "Dzaky Faisa",
                    "user_href": "/profile/Dzaky-Faisa"
                },
                {
                    "user_id": "Eric Nicholson",
                    "user_href": "/profile/Eric-Nicholson-23"
                },
                {
                    "user_id": "Michał W. Solański",
                    "user_href": "/profile/Michał-W-Solański"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mitch Cohen",
                "href": "/profile/Mitch-Cohen-20"
            },
            "answer_text": "The vast majority of East Germans did not want an independent country, they wanted unity and to be part of a functioning, democratic country.People who were greatly privileged in East Germany — Party members and some very privileged intellectuals — wanted a “third way”. They still believed the communist system could be made to work. A majority of West Germans also wanted reunification. A few communist ideologues wanted a “third way”. And there were some West Germans who realized what unification would cost (financially) and didn’t want to make the (minor) sacrifice. ",
            "date": "Answered August 27, 2020",
            "views": "60",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Lobb",
                    "user_href": "/profile/Richard-Lobb-1"
                },
                {
                    "user_id": "Tomas Schild",
                    "user_href": "/profile/Tomas-Schild"
                }
            ]
        }
    ]
}