{
    "title": "In ancient Rome how often did Gladiators refuse to fight in the Coliseum or to participate in the training? - Quora",
    "tags": [
        "Roman Gladiators",
        "Colosseum",
        "Gladiators",
        "Ancient Romans",
        "Rome, Italy",
        "Ancient Greece",
        "Roman Empire",
        "Ancient Rome",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Zisk",
                "href": "/profile/Bob-Zisk"
            },
            "answer_text": "It wasn't a common occurrence. The punishments for refusal or cowardice were very severe. However, we have a vivid description of such an instance in Seneca's Epistle 70: Nay, men of the meanest lot in life have by a mighty impulse escaped to safety, and when they were not allowed to die at their own convenience, or to suit themselves in their choice of the instruments of death, they have snatched up whatever was lying ready to hand, and by sheer strength have turned objects which were by nature harmless into weapons of their own. 20. For example, there was lately in a training-school for wild-beast gladiators a German, who was making ready for the morning exhibition; he withdrew in order to relieve himself, – the only thing which he was allowed to do in secret and without the presence of a guard. While so engaged, he seized the stick of wood, tipped with a sponge, which was devoted to the vilest uses, and stuffed it, just as it was, down his throat; thus he blocked up his windpipe, and choked the breath from his body. That was truly to insult death! 21. Yes, indeed; it was not a very elegant or becoming way to die; but what is more foolish than to be over-nice about dying? What a brave fellow! He surely deserved to be allowed to choose his fate! How bravely he would have wielded a sword! With what courage he would have hurled himself into the depths of the sea, or down a precipice! Cut off from resources on every hand, he yet found a way to furnish himself with death, and with a weapon for death. however, some more illustrations drawn from the same games. 26. During the second event in a sham sea-fight one of the barbarians sank deep into his own throat a spear which had been given him for use against his foe. “Why, oh why,” he said, “have I not long ago escaped from all this torture and all this mockery? Why should I be armed and yet wait for death to come?” This exhibition was all the more striking because of the lesson men learn from it that dying is more honourable than killing.  If you're interested in the games, take a look at “Spectacles of Death in Ancient Rome,” by Donald Kyle. “Neropolis,” a novel by Hubert Montheilet, is definitely worth reading. The author knows his material well. ",
            "date": "Updated July 25, 2020",
            "views": "473",
            "upvotes": " Answer requested by Kiril Degtarev",
            "upvoters": [
                {
                    "user_id": "Matthew Moppett",
                    "user_href": "/profile/Matthew-Moppett"
                },
                {
                    "user_id": "Stephen Mitchell",
                    "user_href": "/profile/Stephen-Mitchell-103"
                },
                {
                    "user_id": "XiaoChuan He",
                    "user_href": "/profile/XiaoChuan-He-1"
                },
                {
                    "user_id": "Abraham Saladin",
                    "user_href": "/profile/Abraham-Saladin"
                },
                {
                    "user_id": "Alex Andria",
                    "user_href": "/profile/Alex-Andria-25"
                },
                {
                    "user_id": "Lynda Moore",
                    "user_href": "/profile/Lynda-Moore-25"
                },
                {
                    "user_id": "Frank Wilcox",
                    "user_href": "/profile/Frank-Wilcox-9"
                },
                {
                    "user_id": "Chris Villagomez",
                    "user_href": "/profile/Chris-Villagomez-4"
                },
                {
                    "user_id": "Halina Minadeo",
                    "user_href": "/profile/Halina-Minadeo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jakub Jasinski",
                "href": "/profile/Jakub-Jasinski-4"
            },
            "answer_text": " “Ave Caesar morituri te salutant!” (“Hail, Emperor, those who are about to die salute you”) – this is a greeting that was to be directed by the gladiators to the emperor before the fight began. But did the gladiator really go out to the arena and say the words? In fact, this call only concerned a one-off event – naumachia – which was organized in 52 CE on the order of the emperor Claudius in the waters intended for the drainage of the Lake Fucinus. Ancient sources do not mention other games, where gladiators would address these words to the emperor. This story is reported by Suetonius. The “Rhodesian” and the “Sicilian” fleets were to fight with each other (each consisted of twelve or fifty tertiary ships). Before the start of the clash, the combatants (naumachiarii) said mentioned above words for which Claudius was supposed to answer “aut non” (or not). The convicts understood that the emperor had pardoned them and refused to fight. Claudius had long wondered if they should not be killed (the praetorians armed with catapults and ballistics were placed around the “battlefield”), but eventually he managed to persuade them to fight.  more you can find here: Ave Caesar morituri te salutant « IMPERIUM ROMANUM ",
            "date": "Answered October 7, 2019",
            "views": "92",
            "upvotes": " View 9 Upvoters "
        }
    ]
}