{
    "title": "In Crusader Kings 2, what is your favorite dynasty and start year to play and why? - Quora",
    "tags": [
        "Crusader Kings (video games)",
        "Crusader Kings 2"
    ],
    "response": [
        {
            "author_info": {
                "name": "Reza Hairul Alim",
                "href": "/profile/Reza-Hairul-Alim"
            },
            "answer_text": "1066 Emirate of Sicily. You are Shia Emir of Sicily and only own 2 of 6 counties in Sicily. The other counties was ruled 3 Sunni sunni Sheikhs in the south, and 1 ruled by Norman duke that also hold almost 3 Duchies in Naples. He is significantly stronger than you and eager to conquer your land and other muslim Sheikhs because he aspire to become King of Sicily. The Pope rule Duchy of Latium and the rest of Italy is ruled by the powerful Holy Roman Emperor. Playing as Emirate of Sicily is really fun because of the struggle. You are placed in a very unfavorable condition. The Christian want to destroy you and The Sheikh hates you and doesn't want to become your vassal because you're Shia. You need be careful when attacking sunni sheikhs because The significantly stronger Norman Duke will attack you if he see you at weak position, like losing lot of soldier. Even if you somehow manage to conquer the Norman duke and become King of Sicily, you still ain't safe. Soon the pope will declare Crusade againsts you. This is where the struggle begin. If you're smart you already allied The Seljuk or The Fatimids, if you're lucky they will send their army to south Italy and defend you. If they don't well, good luck. Keep in mind that The Crusade against you is not one time occurence, it happens a lot. In most of My Sicily game, The Crusade occur 5–8 times and this is not because i finish the game until 1453 but because after only 200++ years i usually manage to conquer Italy and become Emperor of Italia and no Kingdoms able to threaten my existence anymore. Simply said, the reason why i like playing as Emirate of Sicily is because The Struggle is Real. ",
            "date": "Answered September 28, 2018",
            "views": "79",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mehdi Ali",
                    "user_href": "/profile/Mehdi-Ali-14"
                },
                {
                    "user_id": "Hoe Hao Ming Nickson Geraldo",
                    "user_href": "/profile/Hoe-Hao-Ming-Nickson-Geraldo"
                },
                {
                    "user_id": "Sahil Ray",
                    "user_href": "/profile/Sahil-Ray-25"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                },
                {
                    "user_id": "Lakan David Inocencio",
                    "user_href": "/profile/Lakan-David-Inocencio"
                },
                {
                    "user_id": "Ilham Maulana",
                    "user_href": "/profile/Ilham-Maulana-10"
                },
                {
                    "user_id": "Radu Dumitresccu",
                    "user_href": "/profile/Radu-Dumitresccu"
                },
                {
                    "user_id": "Keegan Hoffman",
                    "user_href": "/profile/Keegan-Hoffman"
                },
                {
                    "user_id": "Albert Michaels",
                    "user_href": "/profile/Albert-Michaels-3"
                },
                {
                    "user_id": "Maitreya Bhoir",
                    "user_href": "/profile/Maitreya-Bhoir"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Pachi",
                "href": "/profile/Justin-Pachi"
            },
            "answer_text": "My favorite start date is the Byzantine empire in 867 under the Makedons. I spend the first five years expanding my demense through intrigue and assasinations. Once my demense is larger than all my vassals I destroy duchy title and county titles. This centralizes control of the land. After this I stack the council with loyalists and abolish the council. I have a Palestine moment. “In order to ensure the security and continuing stability of Rhomania, the Imperial Council shall be reorganized into the Second Dominate.” Basically I have autocratic rule. Once I have enough soldiers I retake the Balkans slowly from the Bulgars. Once this is done I pounce on the levant and Middle East. The Abbassids have fractured and only hold mesapotamia. I annex the smaller and weaker states because it’s free real estate. I now have cleared the path for the next generation to retake Egypt. I then focus on reasserting influence over Italy. I retake the South and marry my heir to the king of Italy’s daughter. Eventually when he becomes ruler I use those claims to retake Italy. The Makedons live a long time and have very good traits. Plus in 867 Byzantium’s enemies are all weak or too busy fighting each other to notice the big purple blob until it’s too late. ",
            "date": "Answered September 28, 2018",
            "views": "41",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arshia Arsacid",
                    "user_href": "/profile/Arshia-Arsacid"
                },
                {
                    "user_id": "Ilham Maulana",
                    "user_href": "/profile/Ilham-Maulana-10"
                },
                {
                    "user_id": "Ahmed Hafez",
                    "user_href": "/profile/Ahmed-Hafez-25"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                },
                {
                    "user_id": "Lakan David Inocencio",
                    "user_href": "/profile/Lakan-David-Inocencio"
                },
                {
                    "user_id": "Lachlan Chan",
                    "user_href": "/profile/Lachlan-Chan"
                },
                {
                    "user_id": "Albert Michaels",
                    "user_href": "/profile/Albert-Michaels-3"
                },
                {
                    "user_id": "Maitreya Bhoir",
                    "user_href": "/profile/Maitreya-Bhoir"
                },
                {
                    "user_id": "Abidzar Awwalin",
                    "user_href": "/profile/Abidzar-Awwalin"
                },
                {
                    "user_id": "Freddy Gretton",
                    "user_href": "/profile/Freddy-Gretton"
                }
            ]
        }
    ]
}