{
    "title": "In one sentence, how would you describe Greece? - Quora",
    "tags": [
        "Descriptions",
        "Greece"
    ],
    "response": [
        {
            "author_info": {
                "name": "Noyan Aydin",
                "href": "/profile/Noyan-Aydin"
            },
            "answer_text": "The land of people who have tasted olive oil and had the salt of Mediterranean in their blood and the sun on their head. For non-Mediterraneans, olive oil freshens body, gives a glare, extends life. This is why we Mediterraneans have a better hold of life, we love to drink and dance. Our lives are worth to live! The salt in blood makes us short fuses but shorter heat. We love people. When together, we are loud, we can’t be silenced. We are loud in anger, we are louder in happiness! We are loud when talking, we are louder when drunk. And the sun gives us our color. Our skin is lighter than Arabs, but not as pale as Northerns. The sun boils our salty blood, but consumes our energy. We need to rest, it isn’t easy to work under the sun. Germans can work relentlessly to keep warm, but we already are warm! We are in the place where the others dream to be! I wrote as if Greek, but what makes people apart under the sun? An invisible line on a paper that isn’t real on the soil, called border. ",
            "date": "Answered January 18, 2020",
            "views": "514",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Poutoukianos",
                    "user_href": "/profile/Poutoukianos"
                },
                {
                    "user_id": "Gizem Acar",
                    "user_href": "/profile/Gizem-Acar-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dimitar-Esperanto Berberu",
                "href": "/profile/Dimitar-Esperanto-Berberu"
            },
            "answer_text": "Picture (<1 sentence) tells 1000 words. EU stereotypes - Least hardworking, guess who:  PS. Notice how they think they work ‘too much’ (Most Hardworking column ;)Then they think that the Italians are Least hardworking, probably linking to Southern ItalyItalians have been hyperactive with conquering all the known world for longest & starting the Renaissance. We now write with their script & the world is Romanised.Time to rest & eat Pizza. Let the hardworking Germans provide the beer ;)Are Italians Really Lazy? - Italy Chronicles PS.PS. Imagine there’s world without borders/self-glorifying nations.How would you describe that experience in one sentence? ",
            "date": "Updated January 17, 2020",
            "views": "6",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Erin Garmin",
                    "user_href": "/profile/Erin-Garmin"
                },
                {
                    "user_id": "Alex Wong",
                    "user_href": "/profile/Alex-Wong-96"
                },
                {
                    "user_id": "Romain Blanchard",
                    "user_href": "/profile/Romain-Blanchard-5"
                },
                {
                    "user_id": "Noyan Aydin",
                    "user_href": "/profile/Noyan-Aydin"
                },
                {
                    "user_id": "Mark Peters",
                    "user_href": "/profile/Mark-Peters-298"
                },
                {
                    "user_id": "Quentin Mariéthoz",
                    "user_href": "/profile/Quentin-Mariéthoz"
                },
                {
                    "user_id": "Medindie Victoria",
                    "user_href": "/profile/Medindie-Victoria"
                },
                {
                    "user_id": "Allen Ho",
                    "user_href": "/profile/Allen-Ho-21"
                },
                {
                    "user_id": "Matúš Motlo",
                    "user_href": "/profile/Matúš-Motlo"
                },
                {
                    "user_id": "Shubham Seth (शुभम सेठ)",
                    "user_href": "/profile/Shubham-Seth-शुभम-सेठ"
                }
            ]
        }
    ]
}