{
    "title": "In public, why do people feel embarrassed to fart and why do people mock those who fart? - Quora",
    "tags": [
        "Mockery",
        "Flatulence",
        "Embarrassment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pushkar Marathe",
                "href": "/profile/Pushkar-Marathe-1"
            },
            "answer_text": "My answer may seem 'dicey', I just prefer calling it balance. xD  Now, farts are bodily functions. Yes, it's natural, normal even.  The treatment it receives in public at times is also wrong. However, there are two scenarios here (considering how you have framed your question. Here goes.  People needn't feel embarrassed to fart in public, but that's when it occurs normally or naturally. The way you framed it makes me think of it in the intentional kind of way.  So of course, if it happens, there's nothing wrong with it. All I'm saying is, just because it isn't wrong, don't go around purposely... never mind, you get the idea. This is because of the obvious discomfort it causes to other people. It's a natural bodily function, but is frowned upon due to the smell and noise associated with the act. It's similar to bad breath, burping. Since these actions can cause discomfort to people around you, it is said that you refrain from them in public. This is because people remain fresh and presentable in public, and these acts reduce that factor of hygiene and comfort. Anyway.  The above was for acts on purpose. Of course, very few have an inclination towards purposely doing these things. So let's get to the natural part.  If it happens, so be it. You can politely say \"Excuse me\" loud enough for people to hear, and that should be it.  The part about people mocking someone who does fart is also not good. It's an involuntary thing, (at times :P )! Involuntary, out of the scope of our control. Similar to breathing, even. So if it happens, people should not indulge in making fun of the person.   But the difference lies in \"should not\" and \"don't\". Not many people understand that it's only normal, and hence go on to make fun of it.  I hope that answers your question, thanks for the A2A.   ",
            "date": "Answered April 8, 2016",
            "views": "71",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alexis Boll",
                    "user_href": "/profile/Alexis-Boll-1"
                },
                {
                    "user_id": "Afreen Siddiqui",
                    "user_href": "/profile/Afreen-Siddiqui-70"
                },
                {
                    "user_id": "Luna Moonlight",
                    "user_href": "/profile/Luna-Moonlight-15"
                },
                {
                    "user_id": "Ella Enchanted",
                    "user_href": "/profile/Ella-Enchanted-17"
                },
                {
                    "user_id": "Sonia",
                    "user_href": "/profile/Sonia-437"
                },
                {
                    "user_id": "Andilena Brooke Miller",
                    "user_href": "/profile/Andilena-Brooke-Miller"
                },
                {
                    "user_id": "Norma Louis",
                    "user_href": "/profile/Norma-Louis"
                },
                {
                    "user_id": "Suriya Prabha",
                    "user_href": "/profile/Suriya-Prabha-4"
                },
                {
                    "user_id": "Danni Flanigen",
                    "user_href": "/profile/Danni-Flanigen"
                },
                {
                    "user_id": "Nathan Nahum",
                    "user_href": "/profile/Nathan-Nahum"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rex Fernando",
                "href": "/profile/Rex-Fernando-5"
            },
            "answer_text": "I'm really not at all embarrassed to fart in public. And if people snicker behind my back, that doesn't affect me either. My belief about a fart is that it is better outside than inside. And I find it really stupid to keep myself in discomfort just for the sake of keeping up pretenses about the sort of person I am. I think that the sooner they find out what kind of person I am, the better it is for everyone. I don't know about other people, but my stress levels are very low because I don't have to pretend about who I am. And I fart if I want to fart, whether it is in the office, home or on the street. The only place where I try to hold myself is when I'm in a crowded public transport, but that happens very rarely, so I'm good. As to why others mock people who fart, I think that it's because they think that holding themselves from farting in public makes them better than people who don't. And yet, they don't see the stupidity of what they do. Farting is a biological phenomenon. Does anyone laugh at you when you take a leak? Or snigger when you have to go unload yourself? Then why about fart?  Beats me. I just think that they're stupid people who don't understand what decency and courtesy is. The very same people who would say that farting in public is indecent would not think twice about using filthy language in public. ",
            "date": "Answered April 8, 2016",
            "views": "34",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tom Cruise",
                    "user_href": "/profile/Tom-Cruise-580"
                },
                {
                    "user_id": "Luna Moonlight",
                    "user_href": "/profile/Luna-Moonlight-15"
                },
                {
                    "user_id": "Sonia",
                    "user_href": "/profile/Sonia-437"
                },
                {
                    "user_id": "Bob Yang",
                    "user_href": "/profile/Bob-Yang-47"
                },
                {
                    "user_id": "Jalan Marshall",
                    "user_href": "/profile/Jalan-Marshall"
                },
                {
                    "user_id": "Fatima Osman",
                    "user_href": "/profile/Fatima-Osman-4"
                },
                {
                    "user_id": "John Coffee",
                    "user_href": "/profile/John-Coffee-18"
                },
                {
                    "user_id": "Matix",
                    "user_href": "/profile/Matix"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kumar-719"
                },
                {
                    "user_id": "Sampriti Bhattacharya",
                    "user_href": "/profile/Sampriti-Bhattacharya"
                }
            ]
        }
    ]
}