{
    "title": "In Scotland, why and who was trade important for in the Act of Union 1707? - Quora",
    "tags": [
        "History of Scotland",
        "Politics of Scotland",
        "Trade",
        "Scotland",
        "England",
        "The United Kingdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Addley",
                "href": "/profile/Michael-Addley"
            },
            "answer_text": "Trade was very important to both, the Acts of union were creating a new country that was to exist forever with a single excise policy so both countries governments which we should remember were not elected by any modern definition, were made up of very wealthy men who often were merchants. The new excise regime could not hurt either party and mercantilism was the prevailing doctrine so both parties put in clauses for tariffs to be maintained. These can not be found now as most of the acts of union have become defunct through the passage of time and only the central articles remain on the statute book. Some of these duty based articles are below. That, during the continuance of the respective Duties on stamped Paper, Vellom and Parchment, by the several Acts now in Force in England, Scotland shall not be charged with the same respective Duties. XI. ‘That, during the continuance of the Duties payable in England on Windows and Lights, which determines on the first Day of August, one thousand seven hundred and ten, Scotland shall not be charged with the same Duties. XII. ‘That, during the continuance of the Duties payable in England on Coals, Culm and Cinders, which determines the thirtieth Day of September, one thousand seven hundred and ten, Scotland shall not be charged therewith for Coals, Culm and Cinders consumed there, but shall be charged with the same Duties as in England, for all Coals, Culm and Cinders not consumed in Scotland. XIII. That, during the continuance of the Duty payable in England on Malt, which determines the twenty-fourth Day of June, one thousand seven hundred and seven, Scotland shall not be charged with that Duty. XIV. ‘That the Kingdom of Scotland be not charged with any other Duties, laid on by the Parliament of England before the Union, except those consented to in this Treaty; in regard it is agreed, that all necessary Provision shall be made by the Parliament of Scotland, for the public Charge and Service of that Kingdom, for the Year one thousand seven hundred and seven; providing nevertheless, that, if the Parliament of England shall think fit to lay any further Impositions, by way of Custom, or such Excises, with which, by Virtue of this Treaty, Scotland is to be charged equally with England; in such Case, Scotland shall be liable to the same Customs and Excises, and have an Equivalent to be settled, by the Parliament of Great-Britain, with this further Provision,’ That any Malt to be made and consumed in that Part of the united Kingdom now called Scotland, shall not be charged with any Imposition on Malt during this War. ‘And seeing it cannot be supposed, that the Parliament of GreatBritain will ever lay any sort of Burthens upon the united Kingdom, but what they shall find of necessity, at that Time, for the Preservation and Good of the whole; and with due Regard to the Circumstances and Abilities of every Part of the united Kingdom; therefore, it is agreed, that there be no further Exemption insisted on for any Part of the united Kingdom, but that the Consideration of any Exemptions beyond what is already agreed on in this Treaty, shall be left to the Determination of the Parliament of Great Britain. https://www.parliament.uk/globalassets/documents/heritage/articlesofunion.pdf The vast majority of the articles are phrased in these terms. It was afterall just a hundred or so very rich folk horse-trading. The Scot’s wanted access to the English imperial network and the English wanted the Scot’s materials. Competition was pointless and the result for 300 years has been nothing but benefit even if the original articles have long ceased to have relevance, some of the language and principles can still be found in the Internal markets bill. ",
            "date": "Answered October 24, 2020",
            "views": "348",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandy Riach",
                    "user_href": "/profile/Sandy-Riach"
                },
                {
                    "user_id": "Paul Duffin",
                    "user_href": "/profile/Paul-Duffin"
                },
                {
                    "user_id": "Crispin Glover",
                    "user_href": "/profile/Crispin-Glover-3"
                },
                {
                    "user_id": "Yve Fox",
                    "user_href": "/profile/Yve-Fox"
                },
                {
                    "user_id": "Ian Murray",
                    "user_href": "/profile/Ian-Murray-62"
                },
                {
                    "user_id": "Thomas Murphy",
                    "user_href": "/profile/Thomas-Murphy-203"
                },
                {
                    "user_id": "Niko Salthouse",
                    "user_href": "/profile/Niko-Salthouse"
                },
                {
                    "user_id": "Andy Maycock",
                    "user_href": "/profile/Andy-Maycock-1"
                },
                {
                    "user_id": "Ivlia Blackburn",
                    "user_href": "/profile/Ivlia-Blackburn"
                },
                {
                    "user_id": "Sam Major",
                    "user_href": "/profile/Sam-Major-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Hickey",
                "href": "/profile/Bill-Hickey-11"
            },
            "answer_text": "Trade was important to both Scotland and England but, by far, the biggest trade beneficiary of the Act of the Union was Scotland. Scotland became, in it’s own right, a very wealthy country and Glasgow became one of the World’s busiest ports! Many very wealthy merchants stayed in Glasgow and there are City centre streets and landmarks which still bear those merchant’s name. Along with Scottish ingenuity, enterprise and education it also led to the period in Scotland called the Scottish Enlightenment. We saw many of the world’s leading inventors, philosophers and writers appear also during this period! Robert Burns, Walter Scott, James McAdam, Adam Smith, Thomas Telford etc, etc. Many of whom spent time in London and in Europe furthering the high regard held for Scotland’s and it’s world-leading education system. ",
            "date": "Answered October 24, 2020",
            "views": "35",
            "upvotes": "0"
        }
    ]
}