{
    "title": "In the book “guns germs & steel”, the author says that river valleys were not an answer to why some civilizations developed quicker than others. How is this true? Didn’t rivers lead to settlement, leading to political leaders & trade? - Quora",
    "tags": [
        "Guns, Germs, and Steel (1997 book)",
        "Jared Diamond (author)",
        "Rivers",
        "Civilization",
        "Geography",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gerold Firl",
                "href": "/profile/Gerold-Firl"
            },
            "answer_text": "This question is flawed. Diamond offered a biogeography-based argument to answer Yali’s Question (“why do white men have all the cargo?”) but the presence/absence of river valleys wasn’t even mentioned, as far as I recall. In comparing Eurasia and the Americas, Diamond used two primary arguments to explain why the Americas lagged: the relative lack of suitable domestic animals, and the north-south orientation of the Great Plains. The Eurasian Steppe has an east-west orientation, which could make it easier for long-distance migration of people and animals within a compatible band of latitude and climate. Supposedly this was important; it’s a weak argument, and doesn’t actually provide much explanation, but it has nothing to do with river valleys. Diamond then goes on to compare the opposite ends of Eurasia; Europe and China. Each are at the end of the east-west steppe highway, so why did Europe ultimately get all the cargo, while China burned itself to the ground to exorcise the Four Olds? (Four Olds - Wikipedia.) Here his attempts to strike a blow for social justice get even more ridiculous. His argument is still geographical, and there are several river valleys he could have invoked, but neither the Rhine, Huang Ho, Danube or Yangtze get a mention. Diamond tries to argue that China became locked-in to politically monolithic cultural rigidity because of a coastline lacking the kind of convoluted topology found in Europe. Europe is a peninsula of peninsulas, resulting in political fragmentation. China is a square, resulting in a static empire:  The Diamond thesis had a worthy goal. He argues against racism in general, and white supremacy in particular. We agree on that. But truth is the best weapon in that kind of battle. ",
            "date": "Answered October 20, 2020",
            "views": "224",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Will Ingram",
                    "user_href": "/profile/Will-Ingram-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Mann",
                "href": "/profile/Stephen-Mann-G"
            },
            "answer_text": "I think Jared Diamond had an egalitarian agenda in that he wanted to show that people were interchangeable: if Whites had been Americans, then they would have developed at the same rate as the Indians did given this premise. Whites wouldn't have developed civilization's along the Mississippi and Amazon but instead would have hunted buffalo and worn loin-cloths. Rather, Whites were driven out of Eurasia by Huns, Arabs, Turks, and Mongols into Europe. There they suffered from plagues, military attacks, and their inflexibilities. If they were being defeated by light, rapid cavalry with archers armed with composite bows, why couldn't they have fought back with the same? But they saved themselves by inventing factories and industries through which they processed new technologies. While the Chinese, Indians, and Arabs did this on lesser scales, they weren't as systematic or innovative. This doesn't make other races 'inferior' but shows that allowing citizens to elect leaders and people to investigate, invent, create, and produce also evolves modern economies… ",
            "date": "Answered October 19, 2020",
            "views": "144",
            "upvotes": "0"
        }
    ]
}