{
    "title": "In the military, what individual that you fought beside and was lost in battle do you remember most? - Quora",
    "tags": [
        "Historic Battles",
        "Military Personnel",
        "Human Memory",
        "Warfare",
        "Military",
        "Military History and Wars ",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Axel Hogwood",
                "href": "/profile/Axel-Hogwood"
            },
            "answer_text": "My AIT Drill Sergeant at Fort Sam told us that as Medics, our enemy on the battlefield is Death. It's our job to defeat Death. He said your first loss to Death would haunt you the rest of your life. He was right. It wasn't in combat. It was training; which makes it so much more 'memorable'. People die in battle, that's a given. You can try to prevent it, but it's going to happen. You accept it. People are not supposed to die in training. That's why you train - to prevent the deaths in battle. I was the Medic and my company was doing a live-fire tire-house. My platoon had just gone through and now my barracks roommate's platoon was going through. Just before the iteration, the Company Commander showed up to the range, walked through the scenario and for some reason made a few significant changes to the scenario (which in turn affected the procedure). First squad stacked up to clear the tire house led by CPL F with a SAW, and among the squad members was the newest FNG, PFC B. They entered the tire-house and CPL F adapted to the new scenario. PFC B did as he'd been trained in the dry-runs. This resulted in PFC B rushing into CPL F's line of fire as he's engaging the primary target (which had been moved by the Commander's decision). I'm with my buddy outside entertaining ourselves by throwing snowballs at the red cross on the front of the ambulance when we hear dreaded cry \"MEDIC! MEDIC!\" We grab our bags and rush into the tire house. PFC B was down barely in the door of the \"hot room\". He seemed in good shape, considering. He was even smiling about the situation. I was senior to my roommate so automatically took over treatment. I got his vest off (old style flak-vest) noted the blood on the rear right flank of it and noted the 5.56 round in the lower right front. I got his coat and t-shirt cut off, and bandaged the small entrance wound on his back. By this time they'd brought a litter in and we moved him out to the ambulance. In the ambulance I dressed the exit wound, which was barely noticeable -- not at all like the big gaping hole you hear about or see in movies. It was tiny and wasn't even bleeding much. We joked with PFC B that he'd have a helluva story for the grandkids. A few minutes later the DUSTOFF arrived and we loaded him up. They took him to the regional trauma center. This took place on Tuesday, 2 days before Thanksgiving. PFC B died about 0630 Wednesday morning. His parents plane arrived at the airport about 0700. The round, although causing minimal visible exterior damage, had gone through and destroyed his liver. An investigation was held. The Commander was relieved of his position (as was the Platoon Leader). CPL F committed suicide about 6 months later. I went before the investigators and was drilled on what/why/when I had or had not done this or that. I'd done exactly what I'd been trained to do. At that time Army Medics didn't even have to be EMT-Basic. Thankfully this has changed, EMT-Basic became the required norm with BTLS/ATLS/PHTLS etc. also. I was told by various medical officers that nothing I could have done on scene would have made a difference in the end result, but that doesn't stop me from the 'what-ifs'. ",
            "date": "Answered December 17, 2018",
            "views": "444",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Jang",
                    "user_href": "/profile/Jason-Jang-24"
                },
                {
                    "user_id": "Sean Mohan",
                    "user_href": "/profile/Sean-Mohan-3"
                },
                {
                    "user_id": "Jason Taylor",
                    "user_href": "/profile/Jason-Taylor-434"
                },
                {
                    "user_id": "Max Grout",
                    "user_href": "/profile/Max-Grout-1"
                },
                {
                    "user_id": "Alexander Ribakoff",
                    "user_href": "/profile/Alexander-Ribakoff"
                },
                {
                    "user_id": "John Marley",
                    "user_href": "/profile/John-Marley-13"
                },
                {
                    "user_id": "Ian Alter",
                    "user_href": "/profile/Ian-Alter"
                },
                {
                    "user_id": "Daniel De Jesus",
                    "user_href": "/profile/Daniel-De-Jesus-11"
                }
            ]
        }
    ]
}