{
    "title": "In the 18th century, how much were tall ships cost and who mostly owned them? - Quora",
    "tags": [
        "The 18th Century"
    ],
    "response": [
        {
            "author_info": {
                "name": "Astrid Ingmarsdottir",
                "href": "/profile/Astrid-Ingmarsdottir"
            },
            "answer_text": "This is a difficult question to answer since it depended on where the ship was made. However, it is possible to make a few educated guesses. Cost was largely dependent on where the ship was built, but an average of about £20 per ton could be considered average for a fully equipped sailing vessel. A 1100 ton East India merchant ship would thus cost about £22,000.  A smaller vessel, such as the Bounty (ex-Bethia) cost about £4,400.  The costs above are in 18th century £, so the cost today would be considerably higher with today’s currency values. The Bounty would have cost somewhere around £600,000 by today’s value, while the East Indiaman would have been a whopping £2.8 million. These prices were obviously beyond the usual capabilities of individuals, and merchant ships were normally built for shipping companies supported by investments from shareholders. Crews were paid a percentage of the value of the sail of cargoes, while investors were paid a percentage based upon the number of shares invested in the company (or in the ship if it was the only vessel operated by the owner). After deducting costs of payment to the builders and routine upkeep, the rest was banked as profit. It was hoped that over a life time of perhaps 20 years, a ship would have paid for itself with enough profit left over to invest in a new vessel when upkeep reached the point of diminishing returns. ",
            "date": "Answered March 9, 2018",
            "views": "36",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "James W. Hoover",
                    "user_href": "/profile/James-W-Hoover"
                },
                {
                    "user_id": "Cláudio André",
                    "user_href": "/profile/Cláudio-André-4"
                },
                {
                    "user_id": "Kapil Dev Tiwari",
                    "user_href": "/profile/Kapil-Dev-Tiwari-7"
                },
                {
                    "user_id": "James Ussery",
                    "user_href": "/profile/James-Ussery-10"
                },
                {
                    "user_id": "Andrés Amaya",
                    "user_href": "/profile/Andrés-Amaya"
                },
                {
                    "user_id": "Orgad Barsade",
                    "user_href": "/profile/Orgad-Barsade"
                },
                {
                    "user_id": "Trey Smith",
                    "user_href": "/profile/Trey-Smith-213"
                },
                {
                    "user_id": "Eugenie Koshka",
                    "user_href": "/profile/Eugenie-Koshka"
                },
                {
                    "user_id": "Shyam Kumar",
                    "user_href": "/profile/Shyam-Kumar-908"
                },
                {
                    "user_id": "James Griffin",
                    "user_href": "/profile/James-Griffin-73"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vicki Chang",
                "href": "/profile/Vicki-Chang-5"
            },
            "answer_text": "The Parliament of England ordered and paid for the largest fleet in the world and the Man of Wars cost around 40,000 Pounds. Their intention was to promote and protect commerce for England, the result was the Empire that the sun never sets on. ",
            "date": "Answered December 7, 2019",
            "views": "257",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kapil Dev Tiwari",
                    "user_href": "/profile/Kapil-Dev-Tiwari-7"
                },
                {
                    "user_id": "Jacquelyne Ricco",
                    "user_href": "/profile/Jacquelyne-Ricco"
                }
            ]
        }
    ]
}