{
    "title": "In the chaos of Age of Sail naval battles, sometimes two enemy ships would sink next to another. Would the surviving sailors keep the fight going in the water, trying to drown one another? - Quora",
    "tags": [
        "Age of Sail",
        "Naval History",
        "Sailors",
        "Sailing",
        "Naval Warfare",
        "United States Navy (USN)",
        "Boats and Ships",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Les Denham",
                "href": "/profile/Les-Denham"
            },
            "answer_text": "This would largely be a non-existent issue, because very few sailors could swim, and lifejackets had not been invented. But whichever side had control of the area of the battle after it ended would most likely attempt to rescue any survivors left clinging to floating wreckage, regardless of who they were. If two sailors ended up clinging to a piece of wreckage which only had enough flotation to keep one man afloat, they might fight regardless of whether they were on the same or different sides. If a survivor was a “friend”, he might be a replacement for crew on the rescuing ship killed or wounded in the battle.If a survivor was an “enemy” he might be pressed into service as crew on the rescuing ship, or (depending on the culture and laws of the rescuer’s nation) sold as a slave. If he was an officer, he would be kept for a possible prisoner exchange or for a ransom.Of course, there would be exceptions. If the winning side were short of food and water, and a long way from home, they would be reluctant to take on more mouths to feed; if they were already loaded with too many prisoners, they might be afraid to add more. But these questions would be more likely to arise when a ship was captured with its crew, still afloat. Where the winning ship’s captain did not want to take prisoners, he would be more likely to set them adrift in a boat rather than to take direct responsibility for killing them. ",
            "date": "Answered June 28, 2019",
            "views": "1",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grey Gibson",
                    "user_href": "/profile/Grey-Gibson-5"
                },
                {
                    "user_id": "David Saul",
                    "user_href": "/profile/David-Saul-13"
                },
                {
                    "user_id": "Tiago Silvestre",
                    "user_href": "/profile/Tiago-Silvestre-3"
                },
                {
                    "user_id": "John Owl",
                    "user_href": "/profile/John-Owl-4"
                },
                {
                    "user_id": "RAVI SINGH",
                    "user_href": "/profile/RAVI-SINGH-6174"
                },
                {
                    "user_id": "Daniel Baker",
                    "user_href": "/profile/Daniel-Baker-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Butler",
                "href": "/profile/Jim-Butler-10"
            },
            "answer_text": "Sinking during battle was very rare. Mostly gun crews were aiming at the sails and rigging to immobilise the ship or at the decks to cause casualties and destroy guns. Hits below the waterline happened, especially in the latter case, but they would take a long time to sink the ship, by which time one would have been captured or the action would have broken off. A more likely scenario would be two ships locked in a boarding action catch fire and both crews abandon. In that case they would concentrate on survival, and in fact most likely help each other. No, they would not continue fighting. ",
            "date": "Answered June 27, 2019",
            "views": "155",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Baker",
                    "user_href": "/profile/Daniel-Baker-37"
                },
                {
                    "user_id": "Rufus Sidford",
                    "user_href": "/profile/Rufus-Sidford"
                },
                {
                    "user_id": "Michael Tipton",
                    "user_href": "/profile/Michael-Tipton"
                },
                {
                    "user_id": "Matthew Storey",
                    "user_href": "/profile/Matthew-Storey-8"
                }
            ]
        }
    ]
}