{
    "title": "In the present time, why do Persians hate Arabs? - Quora",
    "tags": [
        "Persia and Persians",
        "The Arab World",
        "Arab Ethnicity and People",
        "Hate"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohamed Zenatti",
                "href": "/profile/Mohamed-Zenatti"
            },
            "answer_text": "Persians and Arabs have several common habits, shared history that extends for hundred of years. They even have several loanwords, despite Persian and Arabic are complete different languages. Arabic is a semitic language and Persian is an indo-european language. In my opinion, this hatred can be returned to: Religion. Iran and Arab countries are Muslims. However, Iranians are mainly Shia and Arabs are mainly Sunnis. Despite the fact that the difference between the two sects is mainly political, politics and religion got inter winded and this political difference grew into a major religious difference. For example, by the beginning of the sixteen century, Ismael Shah I, the founder of Safavid empire forced conversion from Sunni to Shia on all Iranians and this was mainly attributed to his wars with the Ottomans who are Sunnis. He and his successors kept supporting Shiaism to keep them distinct from their Sunni Turk and Arab neighbors. Safavid conversion of Iran to Shia Islam - Wikipedia The same way, Arabs supported Sunni extremism , Wahhabism, to defend their religious views against the Shia. Wahhabism does not consider Shias as truly Muslims. This was a huge problem between Iran and Saudi Arabia after the Iranian Islamic revolution in 1979. This pushed Khomeni in 1987 to say that \"these vile and ungodly Wahhabis are like daggers which have always pierced the heart of the Muslims from the back\", and announced that Mecca was in the hands of \"a band of heretics\". In 1987 pilgrimage , the Iranians demonstrated in Mecca, a Saudi territory and the holiest Muslim place against the Saudi government which escalated into riots leading to the death of more than 402 persons including Iranians and Saudi police forces. These actions increase the hatred between the two countries Economy. The economy of both countries are dependent on oil to a certain extent, Thus, they are competitors somehow and Saudi Arabia used its oil production as an effective way to weaken the Iranian economy which already suffers from economic sanctions. This ignites more hatred between the two countries and leads to several border conflicts, in specific around the Persian Gulf. Oil price falls as Saudi Arabia and Iran argue over output Iran as well supports Shias in different Arab countries such as Syria, Yemen and Bahrain as way to put pressure on the Saudi rulers. This is used by the Saudi government to further increases the hatred between the Arabs and Iranians. Culture The educational systems in most of Arab countries completely ignores the history of Persians and their contribution to the Islamic civilization. Moreover, Arabs tried to change geography. They call the Gulf which separates Iran and Saudi Arabia as “Arabian Gulf”, despite being known all over the globe as “Persian Gulf” and this illustrates the government attempts to increase such hatred. From the historical perspective the Arabian gulf was used for the red sea which separates Egypt from Saudi Arabia. After the Egyptian turmoil in 2011, the previous Egyptian president, Mursi, visited Iran to improve the countries bilateral relations. Mursi gave a speech which was mistranslated purposely replacing the word “Syria” by the word “Bahrain” to appear as if Mursi, a Sunni leader, supports Shia revolts in Bahrain. Bahrain criticises Iran over Mursi speech mistranslation In conclusion, this hatred is mainly boosted by political and economical conflicts between the Iranian government on one side and the Saudi and Gulf kingdoms on the other side. P.S. Most Arab countries follow the Saudi side against Iran, except for Oman which holds a neutral position. Compared to the rest of Arab countries, Egypt has a very special relation with Iran. Princess Fawzia, sister of Farouk, the last Egyptian king, married the last Iranian Shah, Mohammad Reza Pahlavi. Also, Pahlavi died in Egypt and was buried in Alrifai mosque in Egypt. ",
            "date": "Updated April 10, 2018",
            "views": "29",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arian Tari",
                    "user_href": "/profile/Arian-Tari-1"
                },
                {
                    "user_id": "Ahmed Rabee' (أَحْمَدْ رَبِيع)",
                    "user_href": "/profile/Ahmed-Rabee-أَحْمَدْ-رَبِيع"
                },
                {
                    "user_id": "Kamran Kashani",
                    "user_href": "/profile/Kamran-Kashani-2"
                },
                {
                    "user_id": "Harrison Enoghayin",
                    "user_href": "/profile/Harrison-Enoghayin-1"
                },
                {
                    "user_id": "Aniruddh Guranna",
                    "user_href": "/profile/Aniruddh-Guranna-1"
                },
                {
                    "user_id": "Henrique Morais",
                    "user_href": "/profile/Henrique-Morais-4"
                },
                {
                    "user_id": "Shivprasad Dinkar",
                    "user_href": "/profile/Shivprasad-Dinkar"
                },
                {
                    "user_id": "Dhi Yazan Al-Asbahi",
                    "user_href": "/profile/Dhi-Yazan-Al-Asbahi"
                },
                {
                    "user_id": "Mariokh Mt",
                    "user_href": "/profile/Mariokh-Mt"
                },
                {
                    "user_id": "Salwa Halabia",
                    "user_href": "/profile/Salwa-Halabia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Azita Koosha",
                "href": "/profile/Azita-Koosha"
            },
            "answer_text": "When Arabs invaded Persia, as it was their way of control the invaded nation they tried for make Arabic the formal language of Persia, they couldn’t and Persian language survived for thousand years after that. Arabs had no respect or understanding of art and poetry yet Persian were famous for their beautiful paintings, sculptures, Music and poetry. Arabs brought Islam which made music, dance and sculpture making forbidden and set horrible punishments for those who didn’t obey their rules. Before Arab Invasion Persia was THE most advanced empire in the world and 100% equality between men and women. Persia had women rulers and army generals. Arabs believed and enforced their Muslim laws that women were (and still are!) to satisfy men and should always be completely covered. Persians saw the invaders as less civilized and barbaric leaders who had no business ruling their rich and advanced country. Arabs with their religyof Islam burned huge libraries that had collections of Greeks and Persian historical and medical books. Iranians have never forgotten that how Arab’s jealousy to their beautiful land and well educated nation cost them to loose half of their history to their bigotry. The current government of Iran is an anti Iran and a sympathizer of Arab’s culture ",
            "date": "Answered February 18, 2020",
            "views": "474",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arshanoush Shahande",
                    "user_href": "/profile/Arshanoush-Shahande"
                },
                {
                    "user_id": "A Khorasanchi",
                    "user_href": "/profile/A-Khorasanchi"
                },
                {
                    "user_id": "Parinaz D",
                    "user_href": "/profile/Parinaz-D"
                },
                {
                    "user_id": "Negin Green",
                    "user_href": "/profile/Negin-Green"
                },
                {
                    "user_id": "Amirkia Rafiei",
                    "user_href": "/profile/Amirkia-Rafiei"
                },
                {
                    "user_id": "Iuliaa Almohammad",
                    "user_href": "/profile/Iuliaa-Almohammad"
                },
                {
                    "user_id": "Shayan Vajdi",
                    "user_href": "/profile/Shayan-Vajdi"
                },
                {
                    "user_id": "Nima Ze",
                    "user_href": "/profile/Nima-Ze"
                }
            ]
        }
    ]
}