{
    "title": "In the 1996 election, Pres. Bill Clinton beat Sen. Bob Dole (KS). Who was Dole's running mate? - Quora",
    "tags": [
        "Bob Dole",
        "Hillary Clinton Running Mate Speculation (2016 campaign)",
        "Bill Clinton",
        "U.S. Senators",
        "Hillary Clinton",
        "2016 US Presidential Campaign and Election",
        "Political Campaigns",
        "US Presidential Elections",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael King",
                "href": "/profile/Michael-King-1446"
            },
            "answer_text": "A guy that was too hurt to serve in the military, but not so hurt that he couldn’t play professional football. Perhaps it was bone spurs. Kemp Got Waiver From Army Injury Kept Him Off Battlefield, Didn't Stop Pro Football Career Jack Kemp, the Republican candidate for vice president, received a medical exemption in 1961 that allowed him to avoid active duty in the Army while he played quarterback for the San Diego Chargers. Kemp was a private in the Army Reserve when his unit was called to active duty in the fall of 1961, during the Berlin crisis. But Army doctors, in a decision reviewed at the Pentagon because of Kemp’s prominence as a football player, determined that a shoulder injury made him unfit for duty. He went on to lead the Chargers to a division title that year, passing for 2,686 yards and 15 touchdowns. Republicans have made military service an issue in the presidential campaign, showcasing Bob Dole’s injuries during World War II and criticizing President Clinton for avoiding service during the Vietnam War. In San Diego last week, Dole said his military service made him a better American than those who did not serve and he mentioned his service frequently in his acceptance speech Thursday night. Kemp played professional football for eight more years and suffered a knee injury in 1968. He cited lingering effects from that injury as the reason he had to fly first class at government expense while he was secretary of housing and urban development from 1989 to 1992. ",
            "date": "Answered May 10, 2020",
            "views": "212",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rhodes Davis",
                    "user_href": "/profile/Rhodes-Davis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Valenci",
                "href": "/profile/Jay-Valenci"
            },
            "answer_text": "Jack Kemp. ",
            "date": "Answered May 4, 2020",
            "views": "106",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Chaplan",
                    "user_href": "/profile/Michael-Chaplan-1"
                },
                {
                    "user_id": "Charles Wolf",
                    "user_href": "/profile/Charles-Wolf-8"
                },
                {
                    "user_id": "Keith Chase",
                    "user_href": "/profile/Keith-Chase-5"
                },
                {
                    "user_id": "Cathy Riess",
                    "user_href": "/profile/Cathy-Riess"
                },
                {
                    "user_id": "Kathie McDonald Rost",
                    "user_href": "/profile/Kathie-McDonald-Rost"
                }
            ]
        }
    ]
}