{
    "title": "In World War I (WW1), which country suffered the most civilian fatalities? - Quora",
    "tags": [
        "British Empire",
        "World Wars",
        "World War I",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Elias Azrak",
                "href": "/profile/Elias-Azrak-1"
            },
            "answer_text": "In terms of the percentage of its population Although it was not a country participating in WW1 nor has any battles been waged on its territory, but as a result of British policy in the latter stages of the war the biggest civilian fatalities would be by far in Iran whereby some counts 8 to 10 million civilians perish out of a total population of 18 to 20 million writes Gholi Majd in\"The great famine and genocide in Persia 1917 - 1919\". Wikipedia mentions under the list of famines \"As much as 1/4 of the population living in the north of Iran died in the famine.\" A large proportion of Iranian crops were seized by Britain and used to feed their occupying forces leaving Iranian people to die from hunger, malnutrition, and disease. Gholi Majd argues that the British Government was the main cause of this famine and genocide that occurred by preventing food imports from neighboring Mesopotamia and India, which were under its control, and where there was an abundance of grain. The Great Iranian Famine of 1917-19 is almost unknown despite being possibly the largest genocide of the twentieth century. According to documents in the U.S. Persia’s population in 1914 was 20 million and as a result of the famine, it was reduced to 11 million, by 1919. About 40% of the Iranian population died in the space of two years during the military occupation of Persia by Britain. At the same time, Britain had huge revenues of Persian oil at its disposal, to pay for food imports for the starving people. But these funds were diverted to the British Treasury instead to subsidize military operations elsewhere in the world. Dan Holiday gives an equal number of casualties for the Ottoman and Russian Empires. Once these numbers are converted in a percentage of the population then the Ottoman Empire suffers by a larger percentage than Russia. Again those numbers pale in relation to the Iranian tragedy at the hands of the British Empire.  Source: Wikipedia ",
            "date": "Updated February 16, 2019",
            "views": "31",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zen Okada",
                    "user_href": "/profile/Zen-Okada"
                },
                {
                    "user_id": "Volin Azhra",
                    "user_href": "/profile/Volin-Azhra"
                },
                {
                    "user_id": "Wyatt Cowperthwait",
                    "user_href": "/profile/Wyatt-Cowperthwait"
                },
                {
                    "user_id": "André Carvalho",
                    "user_href": "/profile/André-Carvalho-17"
                },
                {
                    "user_id": "Robert Dumnicki",
                    "user_href": "/profile/Robert-Dumnicki"
                },
                {
                    "user_id": "Ilhan Garou",
                    "user_href": "/profile/Ilhan-Garou"
                },
                {
                    "user_id": "Raul Castro",
                    "user_href": "/profile/Raul-Castro"
                },
                {
                    "user_id": "Sai Venkatesh",
                    "user_href": "/profile/Sai-Venkatesh-27"
                },
                {
                    "user_id": "Yash Gandhi",
                    "user_href": "/profile/Yash-Gandhi-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Holliday",
                "href": "/profile/Dan-Holliday"
            },
            "answer_text": "The Russian Empire or the Ottoman Empire.  World War One was not a \"good v evil\" war comparable to the second one. Some historians have begun to call the period between 1914-1945 \"The European War\" and even \"The European Civil War\" (Tony Judt, for example). But despite being a 31 year period of unending conflict on the continent, bookended by two massive conflicts, they aren't all the same.  The First World War was largely between evenly matched (in innocence, evil and training) groups (Central Powers v Allied Powers). Each had a bungling oaf that lost millions in battle (the Russian Empire for the Allies; the Ottoman Empire, for the Central Powers). It's within the statistical margin of error for the Ottomans to have lost more than the Russians, but it looks like the former \"wins\" in civilian deaths.   Total Russian deaths:  2.8-3.4 million (1.7-2.2 million military)Total Ottoman deaths: 2.8-3.3 million (325,000-770,000 military)In WWI, most of the deaths were civilian (especially for the Turks) because the war disrupted critical supplies that the large, urban populations needed for survival. The massive migration due to the fronts, added a many-million-person refugee crisis to the strained system. Most people died of malnutrition and disease. ",
            "date": "Answered October 16, 2015",
            "views": "98",
            "upvotes": " View 95 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dai McClymont",
                    "user_href": "/profile/Dai-McClymont"
                },
                {
                    "user_id": "Luiz Giaconi",
                    "user_href": "/profile/Luiz-Giaconi"
                },
                {
                    "user_id": "Aman Ganapathy",
                    "user_href": "/profile/Aman-Ganapathy"
                },
                {
                    "user_id": "Philip Brannan",
                    "user_href": "/profile/Philip-Brannan"
                },
                {
                    "user_id": "Valy Stanciu",
                    "user_href": "/profile/Valy-Stanciu"
                },
                {
                    "user_id": "Allan Scafe",
                    "user_href": "/profile/Allan-Scafe"
                },
                {
                    "user_id": "Zach SChmitz",
                    "user_href": "/profile/Zach-SChmitz-2"
                },
                {
                    "user_id": "Ryan Li",
                    "user_href": "/profile/Ryan-Li-80"
                },
                {
                    "user_id": "Taylan Kasar",
                    "user_href": "/profile/Taylan-Kasar"
                },
                {
                    "user_id": "Alec Evans",
                    "user_href": "/profile/Alec-Evans-3"
                }
            ]
        }
    ]
}