{
    "title": "In your opinion, how have grammar skills fared in the 21st Century? - Quora",
    "tags": [
        "English (Writing Practices)",
        "Skills",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jean Rafenski Reynolds",
                "href": "/profile/Jean-Rafenski-Reynolds"
            },
            "answer_text": "Grammar in English is largely based on word order. Our language lost most of its formal grammar (its elaborate declensions, cases, and conjugations) when Old English evolved into Middle English after the Norman Conquest. Word order in English (subject, verb, object) is pretty much the same as it was at the beginning of the Modern period, in Shakespeare’s time. Children learn most of their English grammar by the time they’re four or five years old. You never hear children say “Fed the Grandma cat.” English usage is very different from English grammar. “Ain’t” is a usage issue, not a grammatical one. A sentence containing “ain’t” can be diagrammed perfectly - but you will have great difficulty if you use “ain’t” in a job interview. English usage - especially word choice - went through many changes in the 20th century (as it did in the centuries before). Words were added, words fell out of favor, and words changed their meanings. In 1960, the American Heritage Dictionary decided not to include an entry for “escalate” because it was a brand-new word - a back formation from “escalator” - and was therefore suspect. Today nobody thinks twice about using “escalate.” The word “dingbat” used to mean “a printer’s ornament.” When the All in the Family show came along, “dingbat” came to mean “a silly person,” and now that’s the first meaning in the dictionary. Of course English usage is evolving in the 21st century, and it will continue to do so. ",
            "date": "Answered August 28, 2018",
            "views": "283",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yonatan Rocha",
                    "user_href": "/profile/Yonatan-Rocha"
                },
                {
                    "user_id": "Brad Johnston",
                    "user_href": "/profile/Brad-Johnston-29"
                },
                {
                    "user_id": "Susan Joslin",
                    "user_href": "/profile/Susan-Joslin-1"
                },
                {
                    "user_id": "Sandeep Albert Mathias",
                    "user_href": "/profile/Sandeep-Albert-Mathias"
                },
                {
                    "user_id": "Ed Han",
                    "user_href": "/profile/Ed-Han-1"
                },
                {
                    "user_id": "Art Dalton",
                    "user_href": "/profile/Art-Dalton"
                },
                {
                    "user_id": "Dan Guerra",
                    "user_href": "/profile/Dan-Guerra-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veronica Curlette",
                "href": "/profile/Veronica-Curlette"
            },
            "answer_text": "Well considering the vast amount of English language learners in the world today, I’d have to say that it’s on the rise. 50 years ago, people knew prescribed grammar better than we do today, but it’s not a very useful grammar. This is where you get all those ridiculous rules like ‘don’t split an infinitive’ (which is impossible to maintain in any normal conversation—just ask Churchill). But today, since we have millions of students who learn English grammar, as a matter of course, (no pun intended), the quantity of grammar skills is huge. As for grammar skills used by native English speakers, I’d say it’s about the same as it was 50 years ago, especially if we eliminate the prescriptive stuff. The people who study at university might not ‘know’ how to explain the grammar today, but they won’t get good marks on their essays if they don’t ‘use’ grammar properly. I don’t know about the mechanics of a car, but I can drive. My mechanic doesn’t know about the rules of grammar, but he speaks perfectly well. Knowing about grammar is highly over-rated. You have to be able to ‘use’ grammar. If you speak well and communicate properly, you’re doing just fine. If you don’t and can’t, grammar isn’t going to help you. It means you have a communication issue. ",
            "date": "Answered September 23, 2018",
            "views": "186",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joel Sante",
                    "user_href": "/profile/Joel-Sante"
                },
                {
                    "user_id": "Dan Guerra",
                    "user_href": "/profile/Dan-Guerra-1"
                },
                {
                    "user_id": "B Fearns",
                    "user_href": "/profile/B-Fearns"
                },
                {
                    "user_id": "Ray Denback",
                    "user_href": "/profile/Ray-Denback-1"
                }
            ]
        }
    ]
}