{
    "title": "Is 2020 the most challenging election in US history? - Quora",
    "tags": [
        "2020 (year)",
        "US Presidential Elections",
        "History of the United States of America",
        "History",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Srinivas Charlu",
                "href": "/profile/Srinivas-Charlu-3"
            },
            "answer_text": "I wouldn't use the word “ challenging “ to describe the outcomes possible as a result of the re election of Trump. It is certainly momentous - since Mr. Trump has tried the same approach to law/ conventions guiding the conduct of US Presidents as an obstacle to be overcome / by passed or bulldozed through that he has been used to doing in his business careers. He came as a hopeful figure ready and willing to change the gridlock in the way the US Congress was working- being a person with no prior political experience and the aura of a successful businessman who built up his own fortune. Unfortunately- all that he has exhibited is a performance for “ I , me, myself\" ; an unwillingness to do any sustained effort to learn about the nitty gritty of governance and policy making, deliberately bringing a very divisive managerial style of dealing with his direct reports and their deputies and so on. His victory will be treated as a vindication to run roughshod over all the checks and balances in the US government. He may not become a dictator but the broken system he will leave behind has the potential of bringing an American Hitler or Xi Jinping to power. That is why I think that this is a momentous election- just like the 1932 choice between Hoover and FDR. ",
            "date": "Answered October 25, 2020",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shivkumar Mala",
                "href": "/profile/Shivkumar-Mala"
            },
            "answer_text": "No. every election is historical for politicians specifically winners. And losers have an opportunity to obstruct in the path of events of winners like hanuman’s tail on the path way of Bheema of Mahabhart episode. citizens/voters have chance of observing the same episode at no cost for the period of five years. ",
            "date": "Answered October 24, 2020",
            "views": "13",
            "upvotes": "0"
        }
    ]
}