{
    "title": "Is 20th century any better than any other century? - Quora",
    "tags": [
        "Centuries",
        "20th Century",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Silas O. Abayomi",
                "href": "/profile/Silas-O-Abayomi"
            },
            "answer_text": "Each century has events and developments to be proud of, and also several unsavory spots to be greatly ashamed of. Millions or perhaps billions of books, journals, pamphlets, and drawings have preserved the activities of man from ancient times to the modern day, which continuously remind humans of their failures, errors, successes, achievements, and derelictions. In fact, going down the memory lane; and looking at each century from what it offered mankind, it could be said, no CENTURY IS THE GREATEST, because the minuses outweigh the additions. The negatives outdo positives; failures surpass successes; evils triumph over good; darkness eclipse light. From the first century C.E. to the 2nd, 3rd, 4th, 5th, 6th, 7th, 8th, 9th and 10th to 20th century, many things happened to humans. Between the first and fourth century was the birth of Christianity-championed by Roman’s emperor-Constantine at Council of Nicaea; unfortunately, within the period, early Christians had witnessed unparalleled persecution from Nero Rome, and more so, Jerusalem, as a city was lost for another 1,878 years. Aside from the decline of Western Roman Empire, which Eastern Roman Empire or Asia Minor from the vantage of Constantinople benefited from, other horrible things happened down the road. Centuries after-even with the introduction of a new religion-Islam, it did not change the matter, as Europe and Asia engaged themselves in wars of attrition for survival; wars rooted on faith of religious superiority and acrimony; which destroyed trust, friendship, peaceful co-existence upon which human cohesion derive life. From the fall of Eastern Roman Empire to the establishment of Holy Roman Empire around 800 C.E. by Frankish king, Charlemagne through multiple eras in Europe, up to era of reformation, and including the Ottoman Turk era in Ottoman Empire, which replaced Eastern Roman Empire-all the centuries-were perhaps-centuries of mixed blessing. With the fall of Holy Roman Empire followed by different and multiple European royal families controlling Europe with the support of Roman Catholic Church to a new interconnected or overlapping eras-Era of Reformation, Era of Discovery, Era of Sea Voyages, Era of Slavery, Era of Industrial Revolution, Era of Reason-centuries that followed 15th, 16th, 17th, 18th, 19th and 20th, benefitted Europeans greatly; the development from 15th through 19th century created a 20th century modern society; society that was great in many areas: What 20th Century Offered Mankind:   Science, technology, education, engineering, medical science, defeat of diseases, inventions of anti-biotic medicine, eradication of deadly diseases, telecommunication inventions-telephone, telegraph; invention of television, improvement in maritime sector-ship building, sea voyage; civil aviation; space exploration; invention of artificial satellite to understudy planetary heaven; the use of satellite for communication; Moon Walk in 1969; space travel; understanding of nature and the workings or symbiotic relationship among objects in the nature; invention and improvement in auto-engineering; urban development and industrial development; road/transportation development; great improvement in governance-as world witnessed a significant shift from dictatorship/monarchical system to representative democracies. Adult suffrage, women’s rights to vote. Establishment of social institutions to make governments accountable and to make citizens enjoy freedom, liberty and be more responsible.             The Other Sides of 20th Century: Having said this, 20th century also had its dark sides; in fact, historians agreed that civilization went down hill in 20th century, mankind lost brake or restraint to maintaining social, political, and economic order. Two international wars- the First World War (1914–19180; Second World War 91939–1945) destroyed human civilization forever. With the two wars, very unusual in history, mankind had lost balance and coherence; since 20th century, man has been walking in darkness, creating political instability.     Apart from evil and social dislocation, the two world wars created in the last century, the century gave mankind the TEMPLATE FOR CARNAGE, as witnessed by horrific destruction of life through GENOCIDES. At least, ten different genocide accounts/history marred 20th century-The Herero, Armenian, the Holocaust/Jews; Holodomor; Cambodian; Rape of Nanjing by Japanese in 1937; Serbian/Bosnian, and Rwanda.       Fanatical nationalism replaced global brotherhood and friendship. Election of Adolph Hitler in 1933 in Germany created a new wave of nationalism, which pushed reason and wisdom to background. Race or color became social issue, which invariable turned political in decades ahead. As Germans believed Aryan race was superior to other races, elsewhere in Europe-Britain, France, United States racial segregations had both social and legal support, just as apartheid took a firm root in South Africa. Even when it was morally repulsive and socially reprehensible.    Another evil 20th century gave birth to was TERRORISM. Unlawful use of violence and intimidation against civilians to pursue political or religious aims. Hundreds of thousands of lives had been lost on this route. And what is more depressing is, no nation or individual is safe. Unfortunately, terrorists continue to carry their fights to neutral zones or sanctuaries, where victims are absolutely innocent.     ",
            "date": "Answered May 25, 2020",
            "views": "12",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Walter Moscicki",
                    "user_href": "/profile/Walter-Moscicki"
                },
                {
                    "user_id": "Darth Kenobi",
                    "user_href": "/profile/Darth-Kenobi-2"
                },
                {
                    "user_id": "Sam Joy",
                    "user_href": "/profile/Sam-Joy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Blais",
                "href": "/profile/Bill-Blais-5"
            },
            "answer_text": "Historically speaking, no. The eleventh century— 1000–1100 AD— was probably more important for two reasons: First, it was the first time that mankind had enough to eat. Before that time, for most people, getting enough to eat was a daily struggle. But by the eleventh century, agricultural know-how— hard to say “technology”— had advanced so that enough food could be grown to feed everybody. From that, there was a great boost in population and life expectancy. And from that, there was an explosion in ideas, knowledge, and understanding. The eleventh century sees a dramatic rise in commerce; the rise of universities; the beginnings of scientific inquiry; and literacy. Indeed, the level and pace of human knowledge in the eleventh century was greater than that of modern times. The eleventh century was also the beginning of the Crusades, which arguably we are still fighting. Another candidate for “most important” century would be the seventeenth century, which saw the advent of the Age of Enlightenment/Reason, and the articulation of principles of liberty, science, and self-identity and self-determination, which guide civilization today. Granted, the 20th century saw great strides in science and technology, and a move towards enlightenment, but to a large extent those advances were only expansion, and refinements, of the principles first espoused in the seventeenth century. Finally, and as I think someone else already wrote, the twenty-first century will likely be more important than the twentieth because we will be facing some existential problems, and how we solve— or fail to solve—- those problems will impact the centuries to come. ",
            "date": "Answered May 5, 2017",
            "views": "21",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asimina Giannikaki",
                    "user_href": "/profile/Asimina-Giannikaki-1"
                },
                {
                    "user_id": "James Welch",
                    "user_href": "/profile/James-Welch-26"
                },
                {
                    "user_id": "Amlan Naskar",
                    "user_href": "/profile/अमलान-नसकर-Amlan-Naskar"
                }
            ]
        }
    ]
}