{
    "title": "Is Albanian the oldest living language in Europe? - Quora",
    "tags": [
        "Albanian (language)",
        "Albanian Ethnicity and People",
        "Albania",
        "Europe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sokrat Bega",
                "href": "/profile/Sokrat-Bega"
            },
            "answer_text": "You better believe it She is not only in Europe in the planet Earth. She's the only one who can explain everything round us because everything was named after Her. Is there any other tongue who can do that? The answer is absolutely not unless they use the Gods and the Bible or the Quran another word explaining with the unexplainable. Do you guys know how everything we know today like nature, stars, science, geography, Mathematics, numeral numbers, calendars, months, days I mean everything was named after this precious tongue. I bet you don't. How could you unless you speak Her and even that is hard for some of us talking the short cut. Let's just Google, copy and paste and the problem solved. So much for helping out and show to the world how special She is. We are the lucky ones born with the gift and it's our duty to do so not as Albanians because She's not an Albanian thing She's treasure to humanity. Don't call me nationalist because Im not but I'm patriotic though and I see nothing wrong with that. Just proud of being who I'm as everybody should be and trying to represent the best of my country. Let's talk language cause that's all I care anyway. She's the MOTHER LANGUAGE no brainer on this one. I can't believe the experts are missing so badly. Is the effects of brainwash used deliberately for the last two millenniums to make this beautiful tongue disappear. But thank goodness we kept'em a life and She's here to tell a story now, because everything is written to Her and She doesn't know how to LIE like they did for over 2000 of years. I just give you few examples how smart She is unlike any other: Sun = Diell which means Di = know Ell=stands for celestial things on the sky always like we say Qiell=sky and they copy it in the other languages Ell and Al or All means high or up there. Allah, Mikael, Israel etc. So the meaning of Diell is more or less you know what you doing when the sun is up. Same goes for the Day = Dite, same root Di=know, meaning you know what you doing in the daytime. Nate = night Ne - ate meaning somewhere inside in the cave or later the house because is dark and unlike the daytime you do know what's around, and for your protection stay N-ate which became the word for night. Does any other language explain the same way like this. Let me know if you know any is gotta be news to me. And they named the places where they stay one by one. Africa = fear or scary and I believe the word was born from the word Frike=fear They were scared of fire and running away from it. The sound of the fire or better saying the firecrackers do that Frrr, frrrii and Ike means go combine them both makes Frike = fear or scare, then you say A=is makes the word Africa. How easy was that only in the MOTHER tongue don't forget, nowhere else is possible. They named the river Nile which means everything was born from it meaning the water, no brainer over here and the Saharan desert which means Sah - a - ran = so much sand. They got lucky like the archeologists and historians say when they learn how to farm and start expanding in all corners of planet Earth and discovering new things along the way. They got more sophisticated and invented the alphabet, numerals but not in Albania though which Google records says 14th AD so which is correct because in Google we trust. Just having fun over here. I give you two numbers today. Five is called Pese = Pe - se = you see this meaning five fingers the hand, and the numeral was made after the letter S which is almost similar. Why S because of emphasis of the word pes'e. And there is the amazing number ten. Ten = D(j)HJET= knowledge or wisdom, as you can see the DI = know is the root word like the ones before, and that's why we give the top evaluation with number 10 everywhere. Does any language do this? Not a chance accept for the MOTHER, you need to wake up people. The numeral was easy because they already knew the 1and 0 or you could separate the letter d which gives the 10. The days Sunday = e Diell, day of the sun, that's where it comes from MOTHER language and copy by the others, Monday = e Hene = moon, the day of the moon. There are the months. March = Mars the first month in the old calendar. Mars means you first like in dancing or in Albanian folk music you take the lead. So March first, September = Shtator meaning the seventh month, Shtate = seven ,October 8th, November 9th, December 10th very easy no and please don't mention Latin or Greek. What about the colors I give you two on this one: White = Bardhe or bordhe, Bor is the snow, dhe is the dirt ,is when the snow falls in the ground, White. Green = JESHILE = Je - S(i)h - Ile = the just born sprouts or anything green, grass i don't know which one is the perfect word but you got the idea. I hope you like this stuff and you judge for yourself. ",
            "date": "Updated October 5, 2020",
            "views": "178",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Llazar Gjermeni",
                    "user_href": "/profile/Llazar-Gjermeni"
                },
                {
                    "user_id": "Xhevdet Kastrati",
                    "user_href": "/profile/Xhevdet-Kastrati"
                },
                {
                    "user_id": "Maxim Nesterenko",
                    "user_href": "/profile/Maxim-Nesterenko"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julian Fejzo",
                "href": "/profile/Julian-Fejzo"
            },
            "answer_text": "No, Europe is plenty of languages who are older than us, speaking the oldest Balkan language (within Greek) doesn't mean speaking the oldest in Europe. First of all, Albanian is an Indo-European language, genetics don't matter in linguistics, the Indo-European family originated in an area between Ukraine and Kazakhstan, then it spread in several dialects, which diverged more and more until they became separate languages, the Balkans were inhabited by several populations in the ancient times (Greeks, Illyrians, Paeonians, Thracians, Dacians, Phrygians, Dacians, etc.), one of these languages (except for Greek and Phrygian) might have gave the birth of Albanian, non-Balkan origin theories were discarded due to the lack of proofs, while there are many proofs about the Balkan origin of Albanian. But Greeks, Illyrians, Dacians, and so on, were not the original languages of the Balkans, being IE they migrated there in the prehistoric times, before the existence of civilization and writing systems, the Balkans and Europe (except from the area occupied by the early Proto-Indo-Europeans) was inhabited by mysterious populations we don't know, the only residue of that time is Basque, a language that doesn't have relatives, direct or indirect (unlike Albanian whic is a distant relative of Slavic, Germanic, Iranian, Italic, Celtic, and other IE groups). So, is Albanian the oldest living language in Europe? NO, IS JUST NATIONALISM BULLSHIT, IS NONSENSE Who's the oldest language in Europe then? Basque is, because it is what remained of the old pre-Indo-European languages in Europe (not get confused with Proto-Indo-European). Probably I will be harrassed by Albanian nationalists for having said that Albanian isn't the oldest in Europe, and by Serbian nationalists for having said that Albanian is an autocthonous language of the Balkans (and for being Albanian myself), so I will mute the comment section. PS: DON'T DARE TO TAG ME, OR I'LL BLOCK AND REPORT YOUR ACCOUNT! Thanks for the attention! ",
            "date": "Answered December 31, 2018",
            "views": "46",
            "upvotes": " View 57 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Armand Tresova",
                    "user_href": "/profile/Armand-Tresova"
                },
                {
                    "user_id": "Dorjan Hysi",
                    "user_href": "/profile/Dorjan-Hysi-1"
                },
                {
                    "user_id": "Argjend Krasniqi",
                    "user_href": "/profile/Argjend-Krasniqi-2"
                },
                {
                    "user_id": "Leon Dedi",
                    "user_href": "/profile/Leon-Dedi-1"
                },
                {
                    "user_id": "Jack Daxter",
                    "user_href": "/profile/Jack-Daxter-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ljubomir-Zmajević"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Idk-1270"
                },
                {
                    "user_id": "Leon Berisha",
                    "user_href": "/profile/Leon-Berisha-10"
                },
                {
                    "user_id": "Kristi Xharau",
                    "user_href": "/profile/Kristi-Xharau"
                },
                {
                    "user_id": "Dean Celiku",
                    "user_href": "/profile/Dean-Celiku"
                }
            ]
        }
    ]
}