{
    "title": "Is anyone bothered by the fact that if DC gets statehood, the name 'Washington' is going to be dropped? - Quora",
    "tags": [
        "Statehood in America",
        "Washington Metropolitan Area",
        "Washington, DC",
        "History of the United States of America",
        "Politics",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Robrish",
                "href": "/profile/Dan-Robrish"
            },
            "answer_text": "The “fact?” Here is a news article about the bill that passed the House of Representatives today. It says: The bill would turn most of the present District of Columbia into a new state called Washington, Douglass Commonwealth, entitled to two senators and a voting member of the House. The federal district would be reduced to about two square miles in area, made up of the White House, the Capitol, the National Mall and the Supreme Court. (Emphasis added.) So the name Washington would not be dropped if this bill were to become law. ",
            "date": "Answered June 26, 2020",
            "views": "156",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Willie Williams",
                    "user_href": "/profile/Willie-Williams-128"
                },
                {
                    "user_id": "Janet Ybarra",
                    "user_href": "/profile/Janet-Ybarra"
                },
                {
                    "user_id": "George Tarkanian",
                    "user_href": "/profile/George-Tarkanian"
                },
                {
                    "user_id": "Nick Layon",
                    "user_href": "/profile/Nick-Layon"
                },
                {
                    "user_id": "Frederic Rachford",
                    "user_href": "/profile/Frederic-Rachford"
                },
                {
                    "user_id": "Bart Loews",
                    "user_href": "/profile/Bart-Loews"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Young",
                "href": "/profile/Frank-Young-105"
            },
            "answer_text": "That won’t happen. Washington state, that place on the west coast on top of Oregon, will still be Washington. If DC gets statehood (not likely in my opinion), the city will still be Washington, the “state” could be called “Columbia” or some other name. If Washington, DC, truly wants to be a state, I think the best solution would be to make DC of county of the State of Maryland. I think statehood for DC would be a catastrophe for its residents. They would be much better off with the status quo or as a county of Maryland. And I lived in the DC area for 41 years. ",
            "date": "Answered June 26, 2020",
            "views": "164",
            "upvotes": "0"
        }
    ]
}