{
    "title": "Is Boston a racist city? - Quora",
    "tags": [
        "Boston, MA"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Cheng",
                "href": "/profile/Dave-Cheng"
            },
            "answer_text": "Every city is a little bit racist -- Boston less so than most. This is not an easy one to answer in a clear, quantifiable way.  I grew up outside of Boston [1] and went to college in Cambridge so I've been in or around the Boston area from ages 6 to 21.  My parents and more than a few of my best friends still live there so I'm back in Boston often.  I've also lived in Manhattan (5+ years), southern Connecticut (~3 years), Beijing (6 years & numerous visits), and now Hong Kong. First, let me try to compare it to other cities in an objective, albeit still imprecise and personal, way:  It's slightly more racist than NYC due mainly to being less diverse and less integrated racially.  Like Philadelphia, you can often tell what neighborhood you're in by the race of the people around you.  It's also more racist than San Francisco because it's less liberal and less entrepreneurial (i.e., who you know and where your family is from matters more in Boston). It's far less racist than any non-U.S. city I've ever been to -- including Shanghai, Hong Kong, Rome, Montreal, Vancouver, et al. -- and many U.S. cities and regions -- including New Orleans, Miami, Baltimore, Hartford, every inch of New Hampshire, et al. Secondly, I'll share a few racially unpleasant experiences from my time in Boston: When I was 19, an extremely drunk man purposely bumped into me on the street and told me to \"Go back to Asia.\"  When I confronted him and demanded an apology, he apologized (in a clearly insincere manner and only because I had 6 or 7 friends with me and he only had 1).One of my high school football coaches regularly called me a \"gook.\"If you go to the North End (Boston's Little Italy) with a group of yellow, black, and/or brown friends, you're going to get a few jeers and jokes thrown your way.  Nothing overtly threatening -- just enough to let you know that you don't belong.When I dated a white girl for ~2 years during my last year of high school and first year of college, we would sometimes get curious and perplexed stares if we were holding hands or engaging in any other form of PDA.My father owns 3 rental properties.  If you are black or Hispanic, it will count against you.  Neither is an impossible hurdle to overcome as many of his current tenants are black or Hispanic, but if a prospective tenant who is white or Asian comes along and her income, attire and personality are identical then she is going to get the apartment over you.Like I said though, I've seen much worse in other cities -- particularly outside of the U.S.  Other than Manhattan and San Francisco, I am confident that living for more than a decade in almost any other part of the world would result in experiencing far greater racism than the above.  The world can be a cruel and unfair place. -- [1] I grew up in a suburb called Bedford.  It's between Lexington and Concord but was left out of the history books.  We had the first U.S. town flag: The Bedford flag on display at the Bedford Free Public Library is the oldest known surviving intact battle flag in the United States. It is celebrated for having been the first U.S. flag flown during the American Revolutionary War, as it is believed to have been carried by Nathaniel Page's outfit of Minutemen to the Old North Bridge in Concord for the Battle of Concord on April 19, 1775. Bedford, Massachusetts ",
            "date": "Answered November 3, 2013",
            "views": "137",
            "upvotes": " View 51 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kitoye Igoni",
                    "user_href": "/profile/Kitoye-Igoni-1"
                },
                {
                    "user_id": "Anthony Song",
                    "user_href": "/profile/Anthony-Song-19"
                },
                {
                    "user_id": "Josh Frost",
                    "user_href": "/profile/Josh-Frost-4"
                },
                {
                    "user_id": "Jim Meenaghan",
                    "user_href": "/profile/Jim-Meenaghan"
                },
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Flyingtoyoublue Flyingtoyoublue",
                    "user_href": "/profile/Flyingtoyoublue-Flyingtoyoublue"
                },
                {
                    "user_id": "Mike Josef",
                    "user_href": "/profile/Mike-Josef-2"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "Rebekah Rachel Baker",
                    "user_href": "/profile/Rebekah-Rachel-Baker"
                },
                {
                    "user_id": "Sue Carabin",
                    "user_href": "/profile/Sue-Carabin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ellen Vrana",
                "href": "/profile/Ellen-Vrana"
            },
            "answer_text": "Is Boston a racist city? No, it is a city not a person and cannot hold values - racist or otherwise.   Does Boston have racist people?  Yes.   I'm white so cannot speak to a personal experience of racism. However, I lived there, know the city very well, and have lived in other comparable cities.  What I surmise is this:   Boston is as diverse as most large cities, BUT it is much less integrated.   I've never known a city that has as many ethnically separate areas that are so separate.  Italians live in Charlestown & North End; Hispanics live in Chelsea, Irish live in South Boston; WASPs live in Beacon Hill, Back Bay, Lexington; Blacks live in Dorchester; Asians live in Chinatown or more likely Quincy; Jewish people live in Brookline and Newton; Gays live in South End and Jamaica Plain; Eastern Europeans live in Arlington and Watertown.   I'm sorry if my listing mechanism is insensitive or offended you.  That is not my intention.  Of course it isn't 100% true.  Of course its changing.  Mostly due to vibrant young students, inflow of skilled workers and rising incomes.  But not fast enough.  And yes, separation is due to affordability and income levels.   However, there is almost a tribal culture among different ethnic and cultural groups.  \"These are my people, this is my turf\" kind of mentality.  And everyone has it.  Because they feel shut out by others?  Definitely.  But when everyone is shut out, how do you point the finger at who did it first or who is doing it more? There are a lot of elbows in Boston.  And sometimes they hit each other.  Is it racism, or just lack of association/sensitivity with or for anyone who is different?  I think mostly it's the latter, but I don't know.   Consider the recent kerfuffle over the St. Patrick's Day Breakfast.  To those 99.9% of you who haven't heard of this, its a breakfast the day of Boston's SPD Parade where the who's who of political world get together and tell inappropriate but hilarious jokes about each other.  Everyone is invited and included. The breakfast is hosted by the sitting Senator in South Boston.  Who has always been Irish-American.   But when Senator Hart left his seat to join private sector, the Senator who replaced him was Linda Dorcena Forry.  And she is African-American, not Irish.   So a conflab erupted on whether she was \"appropriate\" to host the breakfast.  Her point was St. Patrick's day is bigger than the Irish, it represents something to everyone.  And her husband was Irish, and her kids were half-Irish.  The opposition's point was, 'you're not Irish' (which many people thought was code for \"you're black.\")   Fortunately, they resolved it. Dorcena Forry is hosting.  World continues to turn. Many people think this was a racist act against Dorcena Forry.  Others ask 'what's wrong with having something that is culturally Irish remain in Irish hands?' The one good thing that came from this is people talked about it, got it out there.  Maybe broke down a few walls.  Too bad there are so many more to go... ",
            "date": "Updated November 14, 2014",
            "views": "232",
            "upvotes": " View 136 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eli Heerter",
                    "user_href": "/profile/Eli-Heerter"
                },
                {
                    "user_id": "Jim Meenaghan",
                    "user_href": "/profile/Jim-Meenaghan"
                },
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Jakob Allen McConuisce",
                    "user_href": "/profile/Jakob-Allen-McConuisce"
                },
                {
                    "user_id": "Mahesh Jethalia",
                    "user_href": "/profile/महेश-जेथलिया-Mahesh-Jethalia"
                },
                {
                    "user_id": "Maria Ri",
                    "user_href": "/profile/Maria-Ri"
                },
                {
                    "user_id": "Elise Chevalier",
                    "user_href": "/profile/Elise-Chevalier-2"
                },
                {
                    "user_id": "Mark Grinstein-Camacho",
                    "user_href": "/profile/Mark-Grinstein-Camacho"
                },
                {
                    "user_id": "Dan Steele",
                    "user_href": "/profile/Dan-Steele-2"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                }
            ]
        }
    ]
}