{
    "title": "Is Biden correct for calling Trump Abraham Lincoln who freed all the slaves? - Quora",
    "tags": [
        "Abraham Lincoln",
        "Slavery",
        "Joe Biden (politician)",
        "History of the United States of America",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gerry Boire",
                "href": "/profile/Gerry-Boire"
            },
            "answer_text": "Biden called his opponent “Abraham Lincoln\" as a slight, in the same way his opponent called Elizabeth Warren “Pocahontas”. It was interesting to see his opponents immediate reaction to the jibe. He obviously didn't like having done to him what he has done to countless others. His opponent then went on his deranged rant about not even bringing up the subject. We all heard him compare himself to the former President, yet he wants us to believe he didnt do it; just seconds before. His opponent deserved and deserves every ounce of humiliation he received for his farcical statement that he is the least racist person in the room. He sounded like my racist uncle who always claimed that he wasnt racist because a had “ coon for a friend” (My apologies to all African Americans for the use of that dreadful term). It only proved to me how racist he was. So to answer your question; You bet your sweet bippy Biden was right. It showed his discust for his opponents obvious obfuscation, as well as gave him a dose of his own medicine. ",
            "date": "Answered October 23, 2020",
            "views": "102",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Sharon Wolfgang",
                    "user_href": "/profile/Sharon-Wolfgang"
                },
                {
                    "user_id": "Jeff Flanagan",
                    "user_href": "/profile/Jeff-Flanagan-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Max Patrick",
                "href": "/profile/Max-Patrick-5"
            },
            "answer_text": "Biden never said that lol. Lincoln had lots of tragedy in his own life. He offered the job of Postmaster General to his brother in law. That brother in law turned him down. All of his brothers in laws fought for the confederacy. All of his brothers in laws were killed by his troops. Lol Exactly what has Trump ever done for his country?? Trump never served in Vietnam. 50,000 Americans died in Vietnam while mr bone spurs had 7 deferments. What has Trump ever done in sacrifices for his country? He grew up rich.  ",
            "date": "Answered October 23, 2020",
            "views": "117",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeff Flanagan",
                    "user_href": "/profile/Jeff-Flanagan-4"
                },
                {
                    "user_id": "Shelby Smith",
                    "user_href": "/profile/Shelby-Smith-556"
                }
            ]
        }
    ]
}