{
    "title": "Is China as powerful today as the Soviet Union was at its height, compared to the US, or as strong as the Soviets before they reached their height? If so, when? - Quora",
    "tags": [
        "Soviet Union"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Trask",
                "href": "/profile/Tom-Trask"
            },
            "answer_text": "I want to break the question into two parts. Military strength and economic strength. Frankly, I suspect that about 99% of the world’s population views economic strength as the race to win so I’ll deal with that first. In 1960, China and the USA had GDP of 60 and 543 billion dollars respectively. I’m getting these numbers from GDP (current US$). In 2015 those figures were 11,200 and 18,600 billion dollars respectively. In 2015, the Russian Federation GDP was 1,280 billion dollars. So today, China is about 9 times the size of the Russian Federation. Probably (no figures on this site) the Soviet union was larger than China in 1960 but it probably wasn’t 9 times larger (that would put it on par with the USA in 1960 which seems unlikely). Maybe USSR was half the size of the USA which puts them at about 4.5 x the size of China. I don’t think the Chinese economy really started to take off until about 1980 so maybe China/Russia stayed at 1/2 until then and then in the intervening 35 years China grew at a higher rate until it got to the current 9/1 ratio. That puts China on an 8.6% growth rate relative to Russia (whatever rate Russia grew at, China was growing at 1.086 of that value). China and USSR/RF should have been at parity in about 8.4 years at that rate so call it mid-1988 China passed Russia in GDP. Now, militarily? Has China surpassed Russia in power projected beyond its borders? They do seem to be spending more on military but it’s hard to find an actual “client state” outside of Asia. They have been using their economic power to further their economic interests but we do all do that. I think the battlefield that matters going forward is the economic battlefield. Does China want to support a dictatorship in Sudan? Not really. But they do want the oil to be pumped out of the ground. Who wants the gas in Iran? Russia seems flush with gas, as does the US but China could use it, sure and they won’t put up such a stink over every little thing Iran does besides pumping gas out of the ground. ",
            "date": "Answered November 5, 2017",
            "views": "16",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Winston Yang",
                    "user_href": "/profile/Winston-Yang-37"
                },
                {
                    "user_id": "Rohit Arora",
                    "user_href": "/profile/Rohit-Arora-336"
                },
                {
                    "user_id": "Nelson Lin",
                    "user_href": "/profile/Nelson-Lin-39"
                },
                {
                    "user_id": "Mandy Lane",
                    "user_href": "/profile/Mandy-Lane-12"
                },
                {
                    "user_id": "Shekhar Sarebahi",
                    "user_href": "/profile/Shekhar-Sarebahi"
                },
                {
                    "user_id": "Lucy Troke",
                    "user_href": "/profile/Lucy-Troke"
                },
                {
                    "user_id": "Matt Fisher",
                    "user_href": "/profile/Matt-Fisher-86"
                },
                {
                    "user_id": "Turyahikayo Santana",
                    "user_href": "/profile/Turyahikayo-Santana"
                },
                {
                    "user_id": "Charles Grumet",
                    "user_href": "/profile/Charles-Grumet"
                },
                {
                    "user_id": "Joshua A. Riefman",
                    "user_href": "/profile/Joshua-A-Riefman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gennady Orshansky",
                "href": "/profile/Gennady-Orshansky"
            },
            "answer_text": "Like many people before me, we can compare GDP and other economic indicators, but the Soviet Union might was based on military capabilities. After WWII, Soviet Union was had very powerful military. When it comes to China, that comparison does not work. First of all despite the size and copied military technology China did not use it's military in war for the last 60+ years. Second of all, I am sceptical about China made weapon or amo. I am licenced to carry gun and regularly practice with my 9 mm S&W. Several years ago I bought 9 mm Luger amo in Walmart. It was Chinese made bullets. OMG, it was a mistake, almost every third bullet malfunction. I have used American, Russian and German made bullets and never had any issue. ",
            "date": "Answered November 5, 2017",
            "views": "534",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Harshil Dave",
                    "user_href": "/profile/Harshil-Dave-4"
                }
            ]
        }
    ]
}