{
    "title": "Is CLAT 2020 postponed to 24th May? - Quora",
    "tags": [
        "Common Law Admission Test (CLAT)",
        "Exam and Test Advice",
        "Exam and Test Preparation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajat Godara",
                "href": "/profile/Rajat-Godara-2"
            },
            "answer_text": "Consortium of National Law Universities (NLU) has extended the Common Law Admission Test (CLAT) date to 24 May 2020, with the application deadline extended to 25 April 2020. Indeed, with the near-global policy of social distancing and judging by the spread in other countries, putting tens of thousands of budding lawyers into examination halls all over the country does not seem like a good idea, at least in its current form and even one-and-a-half months from now. The Consortium, which includes all the vice-chancellors (VCs) of NLUs, has agreed to extend the application deadline of 31 March 2020 and the date of 10 May 2020 in light of the situation, according to this year’s CLAT convenor and DNLU Jabalpur VC, Prof Balraj Chauhan. “We have decided to extend the date of application of [CLAT] submission forms,” said Chauhan yesterday. Today he added that the VCs had also agreed to postpone the date of the exam for now. Under the current circumstances, he had said, with a national “lockdown approved until 14 April”, the Consortium had hoped it would be possible to organise the test on 10 May as scheduled. However, he added “we are not sure what will be the situation after 14 April. Let’s hope this lockdown will be successful.  “We are closely watching the situation and discussing all the developments amongst ourselves.” ",
            "date": "Answered March 28, 2020",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vaishali",
                "href": "/profile/Vaishali-307"
            },
            "answer_text": "Yes, CLAT has been postponed to 24 May 2020.  Study well and take care. ",
            "date": "Answered March 28, 2020",
            "views": "165",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Umesh Ambadi",
                    "user_href": "/profile/Umesh-Ambadi-1"
                },
                {
                    "user_id": "Kartik Arya",
                    "user_href": "/profile/Kartik-Arya-10"
                },
                {
                    "user_id": "Aviral Shakya",
                    "user_href": "/profile/Aviral-Shakya-1"
                },
                {
                    "user_id": "Karan Singh",
                    "user_href": "/profile/Karan-Singh-1203"
                },
                {
                    "user_id": "AlKa PAl",
                    "user_href": "/profile/AlKa-PAl-36"
                },
                {
                    "user_id": "Dimpi Dimpi",
                    "user_href": "/profile/Dimpi-Dimpi-8"
                },
                {
                    "user_id": "Swati Chandra",
                    "user_href": "/profile/Swati-Chandra-26"
                },
                {
                    "user_id": "Vandana Nishad",
                    "user_href": "/profile/Vandana-Nishad-3"
                }
            ]
        }
    ]
}