{
    "title": "Is China more powerful today than USSR at its height? - Quora",
    "tags": [
        "Soviet Union",
        "Russia",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paris Qian Sen",
                "href": "/profile/Paris-Qian-Sen"
            },
            "answer_text": "Power is how much force you can organize. In this case, China is not even close to USSR. USSR have Warsaw Pact, as counter-part of NATO. We can say they are the only 2 forces on earth that can make their own agenda. The rest are only self-defense forces, most of them are not even capable of defensing themselves. Soviet naval bases and anchor rights abroad in 1984.  This is a USSR. A gigantic might! It can project it’s power to half of the planet. China? Today’s China has only 1 logistic harbor in Djibouti. Even Japan(a country claim that it only have “self-defense forces”) have more oversea bases than China. 1 harbor VS half of the globe. What a easy pick. Also both USSR and USA at their peak can destroy our poor planets several times in a row  See where is China today  Then let’s talk about science. They have so many leading scientists that made extraordinary achievements in Math & Physics, Engineering, Aerospace, Biology and not to mention, Armament. Remember? They are the second nation which developed a nuclear weapon. They launched world's first artificial satellite! See how many Nobel laureates they have.  Till today, China only have 2: Tu Youyou(Physiology or Medicine) and Mo Yan(Literature). Even you count litterateur as Scientists, it’s still 2 VS many. Side note: Every Sci-fi fans knows Kardashev scale - Wikipedia. This is how to method of measuring a interstellar civilization's level, and our Earth civilization is not even type 1(around 0.72) The 3rd thing I want to mention is the ideology. It’s tiring, I know, but it is also necessary for an empire to go beyond its territory. It should have something, that people can admire and pay tribute to. It can potentially lead our humanity forward. What I am gonna talk about is something get stigmatized for a long time, “Communism”. Before we dig into any details, just ask ourselves one simple question:  Do you think this is fair? If your answer is no, then you can basically see how this ideology get spread so quickly. I know many people think it’s unpractical. Ironically, the idea of “how communism won’t work” is also attested by the collapse of USSR. Before it hit its doomsday, even US once believe one day Socialism is gonna take over the world.   (This is in New York, BTW) China? The red China itself is nothing but a follower of such ideology. Although USSR is dead, it cannot defend itself. Many people including Russian splash dirty water on it for years. It doesn’t mean it didn’t put a ding in the universe. RIP USSR. IMHO, China cannot hold a candle to USSR.  OK, guys, I understand USSR is dead, and will never get revived. What its goals have also been proven failed. I won’t deny. However, this question is about USSR “at its height”. You cannot measure USSR with today’s gauge of ideology and economy. For example, today’s GDP is measured by USD/PPP, but USSR never label their national resources with price tags, by then it is simply not on their todo list. For the same reason, we knew Communism is dead, yes, but you cannot deny the history. There used to be a time, that entire world is fascinated by this idea. All I try to point out is there are many incredible achievements USSR have done, that China cannot compare with even after 40 years of development since its great open-up. ",
            "date": "Updated February 19, 2019",
            "views": "62",
            "upvotes": " View 573 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarthak Gupta",
                    "user_href": "/profile/Sarthak-Gupta-491"
                },
                {
                    "user_id": "Udoy Bose",
                    "user_href": "/profile/Udoy-Bose-5"
                },
                {
                    "user_id": "Ezra BLedsoe",
                    "user_href": "/profile/Ezra-BLedsoe-2"
                },
                {
                    "user_id": "Bilge Kağan",
                    "user_href": "/profile/Bilge-Kağan-6"
                },
                {
                    "user_id": "Hirav",
                    "user_href": "/profile/Hirav-2"
                },
                {
                    "user_id": "Samkala Yuan",
                    "user_href": "/profile/Samkala-Yuan"
                },
                {
                    "user_id": "Tejas Badwe",
                    "user_href": "/profile/Tejas-Badwe"
                },
                {
                    "user_id": "Satyam Tomar",
                    "user_href": "/profile/Satyam-Tomar-5"
                },
                {
                    "user_id": "Heinrich Lee",
                    "user_href": "/profile/Heinrich-Lee"
                },
                {
                    "user_id": "Liuchao Liu",
                    "user_href": "/profile/Liuchao-Liu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sayak Biswas",
                "href": "/profile/Sayak-Biswas-12"
            },
            "answer_text": "Ever heard of Warsaw Pact?? If not, then let me tell you, there were nations, communist nations, many of which (especially the Eastern European ones minus Yugoslavia which left the sphere of influence post fallout) nonetheless were mere puppets of Moscow , were part of a real military alliance to counter NATO  If one considers this alliance, then the standard Soviet defence forces at total strength of 4,490,000 (active service) and 35,745,000 ( reserves) would get coupled with militaries of all the Warsaw Pact nations which maintained fairly decent fighting forces, would be a very large and highly formidable one, and since it’s the Soviets who are bosses here, you know who’s to call the shots in a real war. Now current China military i.e. People’s Liberation Army, has a strength of 2,035,000 (active service) and 510,000 (reserves) , which is like a miniaturized Soviet military, and of course, no equivalent of Warsaw Pact. This means that in a real conflict involving man and machines, China’s only “real ally” would be probably North Korea (client state of China after all) and China. This is something China too knows I presume, right? In addition, this is the graph of military spending of former USSR vs today’s Russia.  Note the decrease from 250 billion to less than 200 billion. Now from this I believe that somewhere way before in 1960s (though most of it is highly secretive and not present for public consumption) the expenditure was assumed to be definitely more than this, since that was the period when Soviets were expanding it’s ideology and footprint round the globe from Ethiopia to Vietnam to Cuba Source: The Soviet Union: Military Spending  Red is USSR, blue is USA If one uses them to compare to current Chinese expenditures (like what’s public of it), then in 2018 it was at $170 billion, which is as per world values is second-largest but still far from what USSR was. Of course, a higher spending need not necessarily mean a better military right? After all Saudi Arabia spends a lot but has a military which is a joke and can’t even protect oil fields. Well, one must look at mindset too. Soviet citizens were patriotic, it’s military were a highly motivated franchise. So a larger budget is like a force-multiplier to such a group. China today is increasing it’s budget, however it’s trying to cut it’s military into a more sleeker version and not a bulky one.  So in terms of military, Soviets were at a whole new level, something China hasn’t reached yet.  In terms of image, Soviet Union and China are different. Now I will tell about India, a country which in past had strong friendship with Soviets and even now maintains a firm tie with Russia. If you talk to the older generation of India, and by this I mean born in 1960s -1970s who didn’t leave India, some of them are hardcore fans of Soviet Union . Nope they aren’t communists or socialists, rather this friendship was purely because they believed that Soviets stood with India when many other countries didn’t. In reality, post independence, the government were the ones to forge a strong tie with Soviets by remaining at same time neutral to both west and east bloc, and such a thing led to rise of a thought that Soviets are the benevolent beings and communism is cool. Most I guess never paid much attention to the old truth that international diplomacy has no permanent friends. Now I will tell you something. India today judging by it’s ties with USA , maybe people like me somewhere thirty years down the lane would praise USA because it supported India, however at same time we would also be having a highly negative opinion on some of their habits of meddling into internal matters nearly everywhere, like making comments on internal politics and sticking it’s nose where it doesn’t belong. A similar thing is absent in those who are fans of Soviet Union. Don’t mistake me, but I would laugh if someone said that Soviets didn’t interfere in internal matters of India. If such was the case, then I guess the amount of far-left infiltration into the intelligentsia here would have been non-existent, but we clearly know that such an infiltration is as real as the fact that Earth is round. However I don’t blame them for this, even to an extent even I have some amount of support for Soviets. Now on the alternative, consider China. Today China is finding friends in mostly African nations by the typical method of giving loans at high interests. While some have been jubilant about this, some others smelled a rat [1] and decided to go ballistic on China . And there are several other examples, where Chinese attempts at bullying smaller sovereign nations led to incidents where other nations had to step in and demand China to behave. You get it friend? Unlike the Chinese, Soviet Union did one thing very well outside their borders- manipulation. A huge credit should go to the all-powerful propaganda that came out of there at complete blessing of Kremlin. And maybe it is this Soviet propaganda which post the collapse of the country, led to people in the world and particularly those who never saw communism as a viable option , to use as a counter-propaganda, to show to rest of the world that not always the grass is greener on other side and there maybe more than meets the eye. China has frequently engaged in different methods (newspapers, books, media houses) in several nations, including those of western world and nations in Asia-Pacific, to portray a very beautiful image of themselves similar in pattern how Soviets used in India with beautiful prints of “Soviet Desh magazine” (a Bengali magazine which showed beautiful pictures of Soviet Union), however in an age of internet they have a very very difficult and rocky road in this propaganda battle. Had internet been alive and kicking in 1960s, Soviets would probably faced a similar onslaught. Face it. Soviet propaganda still has buyers. Chinese propaganda….umm……..  Then comes the final thing- economy. Soviet Union for most of it’s history followed a state-planned economy and it was only during Gorbachev’s perestroika that a minimum amount of capitalistic principles were actually allowed, however it was…………..too late  First-ever McDonald's in USSR In it’s best days, Soviet Union has been more or less the third-largest economy, thanks to a large emphasis of manufacturing sectors, oil and gas sector and of course, agriculture, all of which were administered as per five-year plans by government. As the things went by, how much of their own information is real, that’s well another story for another day. However despite all that, division among people very much remained and classless society was a scam, since there were people of party who had far more benefits compared to people not in party. China on other hand, as long as Mao Zedong was there, economy was again, state-planned, and large-scale mismanagement was common, especially from the bad harvests of days of Great Leap Forward which later led to famines throughout the population of the country. It was not until Deng Xiaoping took the helm of country that things began moving in the direction where China is reportedly today. China is often credited with removing the largest number of it’s own people from poverty today, thanks to Deng Xiaoping rejecting communist ideas. China today is not a communist nation, certainly not by the way things go on. In the most layman of terms, China is pretty much an oligarchy, a totalitarian state where the ruling club calls itself communist but behaves like a capitalist . Much of economy, just like Soviet Union, has become more manufacturing based (largest in world now) and mining-based (largest amount of natural resources) than agriculture-based, however the planning over all this is not job of government, rather the government’s control over it has been decreasing , a stark opposite to Soviet method. Again just like Soviet Union, it’s numbers are under scrutiny, but that’s for another day. Much like how Party and Soviet Union became intertwined , CCP today has an exact similar relationship with China. If compared, China because of adopting capitalism has done things that would anytime be superior to what Soviets did.  China is one notch above [2] Soviet union in terms of being a large economy.  On a strategic level, Soviet expansion was significant. They managed to go as far as Cuba, Africa, get a foothold around Arctic , the list is long. In addition, Soviet Union was really good in making friends, particularly among the non-aligned movement where they acted as sort of inspiration to several countries with their technological achievements. Most of the non-aligned nations to begin with were third-world nations of yesterday and some of them are emerging nations today. First Indian in space, Wing Cdr Rakesh Sharma, was one of the several foreigners in the famous Interkosmos program  Some of the people Soviets became friends with outside the Eastern European sphere, were not the ones who would accuse Soviets of land-grabbing (exception: Afghanistan)  And some were simply way too willing to let Soviets enter their area (eg. Cuba)  This was is the closest Soviets got to USA, next to Bering strait. China too, is good in making friends. However, this happens as long as a nation doesn’t share two things with them Land borderTerritorial watersSpeaking of both of them, China currently has land and water dispute with nearly all it’s neighbours, even some with whom it doesn’t even probably share a border[3] . Another thing that creates a severe problem for China is, it’s location. It’s location makes it difficult to have a good connection to the Indian Ocean, and is therefore forced to use a large sum of it’s money on developing ports in coastal regions of countries which have a coastline in Indian Ocean. The plan to begin with, is expensive, takes in a large amount of money , and above all, hard to fully reach the intended goal  And the countries with whom this friendship happens, as I mentioned, a debt trap is set for them, and as time flies, the Chinese intrusion starts becoming more and more visible in those economies.  When one considers scientific temper, Soviet Union and China are pioneers in that. While it’s true that Chinese attention towards science and technology is huge, but let’s be honest, Soviets invented a large number of things which today are acting as a foundation for China. Soviets were the original inventors, pioneers, and promoters of everything from space travel to space science, alongside USA. In addition, weapons of Soviet origin, from rifles to fighters, even after demise of Soviet Union, still gets not just sold but also used, by nations near and far. Who invented the largest space station before International Space Station? It was Soviet Union Who sent the first man and woman into space? Soviet Union Who designed the fastest fighter aircraft? Soviet Union Who designed the fastest bomber aircraft? Soviet Union Most importantly, discoveries like Cherenkov radiation, linear programming problems, extensive research on quantum mechanics, are things that were not known of unitl someone from Soviet Union either stumbled upon them or better, discovered them. Compare to all these, China haven’t quite made a legendary or groundbreaking scientific discovery in last one century that could catapult the inventors to a real fame beyond China. The country has a total of one person who won Nobel Prize in scientific field i.e. medicine, compared to a humongous list of Soviet Nobel laureates in scientific field which is mostly Physics-centric (not surprising, considering that it’s a nation from where Rocket equation came out). Most of China’s creations since creation of PRC is something that is already there. Aircrafts used by China have been in use in other places, smartphones are not something alien to rest of planet, there are countries with a far more open internet, supercomputers too are common to most nations who can create one, and come on, stealth aircrafts were in skies even a decade ago.  Comparing Soviet Union and China by today’s yardstick would be a severe mismatch, but as you asked in question “at it’s height”, Soviet Union is a behemoth compared to China Footnotes[1] Debt-trap diplomacy - Wikipedia[2] Economy of China - Wikipedia[3] China claims territories of 23 countries, even though it only has borders with 14",
            "date": "Answered December 20, 2019",
            "views": "124",
            "upvotes": " View 314 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yosavin Phuchamchote",
                    "user_href": "/profile/Yosavin-Phuchamchote"
                },
                {
                    "user_id": "Hrishikesh Shukla",
                    "user_href": "/profile/Hrishikesh-Shukla-6"
                },
                {
                    "user_id": "Raghuram Venkatesan",
                    "user_href": "/profile/Raghuram-Venkatesan-6"
                },
                {
                    "user_id": "Shwetank Rishi",
                    "user_href": "/profile/Shwetank-Rishi"
                },
                {
                    "user_id": "Hank Zhang",
                    "user_href": "/profile/Hank-Zhang-13"
                },
                {
                    "user_id": "James Ferguson",
                    "user_href": "/profile/James-Ferguson-444"
                },
                {
                    "user_id": "Ft Z",
                    "user_href": "/profile/Ft-Z-2"
                },
                {
                    "user_id": "Ellia Kristopany Kohen",
                    "user_href": "/profile/Ellia-Kristopany-Kohen"
                },
                {
                    "user_id": "Anurav Agrawal",
                    "user_href": "/profile/Anurav-Agrawal"
                },
                {
                    "user_id": "George Wang",
                    "user_href": "/profile/George-Wang-82"
                }
            ]
        }
    ]
}