{
    "title": "Is Donald Trump similar to Ronald Reagan? - Quora",
    "tags": [
        "Ronald Reagan",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Bowerbank",
                "href": "/profile/Mike-Bowerbank"
            },
            "answer_text": "Thanks for the A2A. No, Trump and Reagan are not a lot alike. Oh, sure, they have a few similarities, but only a few. Neither men are intellectually curious, neither have any interest in details, both men made money in the entertainment industry, and both men take a \"big picture\" approach to their ideology. Both men have been divorced. That's almost everything right there. Reagan had hands-on political experience as Governor of California. Trump's political experience comes through donations and reciprocal favours. Reagan tried to make the biggest tent he could. He tried to be likeable to everyone.Trump's tent is small - there are very few groups that he hasn't insulted or marginalized. Reagan was known as the \"Teflon President\" as nothing stuck to him. He rolled with the punches and remained affable and (mostly) unflappable.Trump is so thin-skinned, he cannot let any sleight go without a comment. If someone dares to criticize him, Trump becomes a whiny, petulant child who throw a hissy fit and Tweets the equivalent of \"I know you are, but what am I?\" Reagan was willing to compromise to push his agenda. He worked with Democrats and skeptical Republicans to come up with bills and legislation. Trump bullies his way through deals and he will likely try to govern the same way. Say what you will about Reagan, the man was a gentleman. Trump, not so much. Reagan was beholden to his base and stakeholders.Trump IS his own stakeholder and he will be loyal only to himself. Reagan began his term hostile to the Russians and by the end of his term, he considered himself a friend of Russian president Gorbachev.Trump will begin his term as a strong admirer of Russian president Putin. So, overall these are two very different men. There is one final similarity to Reagan, though, that I saved for the end. Both men are impulsive and do things without thinking them through. Reagan deployed US Marines to Beirut but did so with no goals and no actual mission. 249 of them died.Reagan armed the Afghan Mujahedeen to resist the Russian invasion. One of them was a fellow named Osama bin laden. We all know how THAT ended up. Trump is much more impulsive than Reagan. We'll be dealing with the blowback of this presidency for decades. ",
            "date": "Answered January 9, 2017",
            "views": "16",
            "upvotes": " View 40 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Shade",
                    "user_href": "/profile/Steve-Shade"
                },
                {
                    "user_id": "Lewis Perelman",
                    "user_href": "/profile/Lewis-Perelman"
                },
                {
                    "user_id": "Vincent Cammisa",
                    "user_href": "/profile/Vincent-Cammisa-3"
                },
                {
                    "user_id": "Brett Minkin",
                    "user_href": "/profile/Brett-Minkin"
                },
                {
                    "user_id": "Tedd Kattchee",
                    "user_href": "/profile/Tedd-Kattchee"
                },
                {
                    "user_id": "Joel Monkarsh",
                    "user_href": "/profile/Joel-Monkarsh"
                },
                {
                    "user_id": "Fabiano Dias",
                    "user_href": "/profile/Fabiano-Dias-6"
                },
                {
                    "user_id": "Alexander Moriarty",
                    "user_href": "/profile/Alexander-Moriarty-1"
                },
                {
                    "user_id": "Claire Jordan",
                    "user_href": "/profile/Claire-Jordan-10"
                },
                {
                    "user_id": "Zealand Rose",
                    "user_href": "/profile/Zealand-Rose"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Evans",
                "href": "/profile/Joseph-Evans-130"
            },
            "answer_text": "Trump has way more in common with Lincoln. Many people blame Trump for the de-Reaganization of the Republican Party & wistfully pine for the 1980’s era of gentleman’s politics. This is, by & large, the main source of anxiety about Trump. And it is also the driving momentum of the Never Trump movement. Lincoln wasn’t lionized in his time; not until 40 years after his assasination. Not since 1865 have DEMS so dramatically refused to accept the outcome of a presidential election. With Lincoln, DEMS threatened to secede from the union—With Trump, DEMS threatened to move to Canada. Lincoln was assassinated by an actor—Hollywood actors talk about assassinating Trump, burning down the white house, a slivered head, etc., They would if they could. Trump left his first wife for a supermodel. Most people don’t know that Lincoln left Mary for a Slovenian supermodel. Both were famous for introspective quotes. They both verbally abused their cabinet members. Lincoln’s nationalism helped save the union. Trump is trying to do the same. Lincoln definitely had an ego. And just like Trump, it could get in the way. And if he decided you had attacked one of his friends, you might want to leave the country: He once threw a general in prison for 6 months, without charges, on his unfounded suspicion the general intentionally got one of Lincoln’s close friends killed in combat. Not to mention jailing journalists. And people call Trump a dictator… Both arrived in DC amid culture wars whose participants were intoxicated with their own righteousness, amid opportunistic, hack politicians indifferent to the facts, pandered to by their pet media outlets. In both cases powerful figures connived to manipulate them on their arrival. In Lincoln’s case, they failed. In Trump’s case, they’re kidding themselves. Lincoln arrived in a capital already hopelessly polarized, & his mere presence triggered a civil war—With Trump, well.... you get the idea. Trump’s stance on Immigration & Trade are in some ways “heresies” in the eyes of Republican politicians. But they were not heresies in the eyes of Lincoln. His GOP was unabashedly protectionist & viewed tariffs as a necessary & valid economic strategy to protect American workers & American industry from mercantilist competition from European powers. While many progressives as well as conservatives insist that tariffs have never worked, America had tariffs in Hamilton’s time through the end of the 19th century, & it was during this period that America grew most rapidly & became the largest economy in the world, surpassing Great Britain. ",
            "date": "Answered March 25, 2019",
            "views": "293",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Deborah Hamilton",
                    "user_href": "/profile/Deborah-Hamilton-48"
                }
            ]
        }
    ]
}