{
    "title": "Is every piece of land on earth owned by somebody? - Quora",
    "tags": [
        "Land",
        "Earth (planet)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Harrison",
                "href": "/profile/Mark-Harrison-2"
            },
            "answer_text": "No. There are genuinely bits of unowned / unclaimed land in the world. In many parts of the world all land is owned. In my country (the UK), all land is owned by The Crown [1]. There are similar laws in other parts of the world in which “unowned” land is sort of owned by the national government. But in Antartica, say, there’s plenty of land with no owner. There may well be other regions where the same is true. Multiple claimants Then there are places like Rockall, which is to say, uninhabited, but with territorial claims from different countries. So the British Government claims it’s British, but the Irish government claims it isn’t [2]… and no-one actually lives there so there’s no possibility of local self-determination.  No claimants If multiple claimants isn’t good enough, there’s Bir Tawil. On the border of Sudan and Egypt, there’s an unihabited area called Bir Tawil. There’s a dispute between the two countries about whether a political boundary established in 1899 is correct, or an administrative one established in 1902. Egypt claim that the correct one is is the 1899 one, which gives Egypt Hala’ib, but not Bir Tawil. Sudan claim the correct one is the 1902 one, which gives Sudan Hala’ib, but not Bir Tawil. So basically, both countries claim it doesn’t belong to them - and again, no-one lives there.  [1] The Crown isn’t the same as The Queen. The Crown is sort of like a company of which The Queen is the current Chair of the Board (and the PM is the CEO). [2] An earlier version of this answer made the incorrect statement that Ireland claimed sovereignty over Rockall. The official position of the Irish government is that no country has sovereignty over it. Both countries agree with the position of the UN convention on the law of the sea (UNCLOS) which states that \"rocks which cannot sustain human habitation or economic life of their own shall have no exclusive economic zone or continental shelf\". ",
            "date": "Answered August 22, 2019",
            "views": "317",
            "upvotes": " View 382 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Avin Kurian",
                    "user_href": "/profile/Avin-Kurian-1"
                },
                {
                    "user_id": "Vladimir Pitch",
                    "user_href": "/profile/Vladimir-Pitch"
                },
                {
                    "user_id": "Milan Karia",
                    "user_href": "/profile/Milan-Karia"
                },
                {
                    "user_id": "Kristin Annexstad",
                    "user_href": "/profile/Kristin-Annexstad"
                },
                {
                    "user_id": "Vishwam Khapre",
                    "user_href": "/profile/Vishwam-Khapre"
                },
                {
                    "user_id": "Kieran Elrod",
                    "user_href": "/profile/Kieran-Elrod"
                },
                {
                    "user_id": "Jef Verstraete",
                    "user_href": "/profile/Jef-Verstraete-1"
                },
                {
                    "user_id": "Daniel Wiget",
                    "user_href": "/profile/Daniel-Wiget"
                },
                {
                    "user_id": "Keith Robison",
                    "user_href": "/profile/Keith-Robison"
                },
                {
                    "user_id": "Luca De Rosa",
                    "user_href": "/profile/Luca-De-Rosa-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Rice",
                "href": "/profile/Christopher-Rice-41"
            },
            "answer_text": "All inhabitable land is owned by individuals, governments, or businesses. Uninhabital land is not owned, except in a few circumstances, by anyone. Land on Antarctica cannot be owned as it is uninhabitable, though some countries claim sovereignty for areas where they have outposts or scientific studies on the continent. Countries like Canada have vast areas where no one lives but the land there is unusable and is defacto government land. Why do you ask this? Are you looking for land to settle? There are countries who give incentives to those who wish to move to sparsely populated areas ",
            "date": "Answered June 15, 2019",
            "views": "149",
            "upvotes": "0"
        }
    ]
}