{
    "title": "Is Gondor based on the Byzantine Empire? - Quora",
    "tags": [
        "Gondor",
        "Eastern Roman Empire (Byzantine Empire)",
        "Byzantines",
        "The Lord of the Rings (books)",
        "Empires",
        "Tolkien's Middle-earth (creative franchise)",
        "The Lord of the Rings (creative franchise)",
        "Roman Empire",
        "Ancient Rome",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ares Ferentinos",
                "href": "/profile/Ares-Ferentinos"
            },
            "answer_text": "yes! :) It has been noted that Tolkien drew heavily on the general history of the Goths, Langobards and the Byzantine Empire and their mutual struggle. Even historical names from these peoples have been used in drafts or the final concept of the internal history of Gondor, such as Vidumavi, wife of king Valacar (Gothic language).The Byzantine Empire and Gondor were both only echoes of older states (the Roman Empire and the unified kingdom of Elendil), yet each proved to be stronger than their sister-kingdoms (the Western Roman Empire and Arnor, respectively). Both realms were threatened by powerful eastern and southern enemies: the Byzantines by the Persians and the Muslim armies of the Arabs and the Turks, as well as the Langobards and Goths; Gondor by the Easterlings, the Haradrim, and the hordes of Sauron. Both realms were in decline at the time of a final, all-out siege from the East; however, Minas Tirith survived the siege whereas Constantinople did not. In a 1951 letter, Tolkien himself wrote about \"the Byzantine City of Minas Tirith.\" The Lord of the Rings: A Reader's Companion - Wikipedia Tolkien and the Study of His Sources ",
            "date": "Answered September 25, 2019",
            "views": "116",
            "upvotes": " View 112 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Filip Dragic",
                    "user_href": "/profile/Filip-Dragic"
                },
                {
                    "user_id": "Mario García",
                    "user_href": "/profile/Mario-García-53"
                },
                {
                    "user_id": "Andrea Uboldi",
                    "user_href": "/profile/Andrea-Uboldi-1"
                },
                {
                    "user_id": "Jack Knibb",
                    "user_href": "/profile/Jack-Knibb"
                },
                {
                    "user_id": "Ryan Baron",
                    "user_href": "/profile/Ryan-Baron-1"
                },
                {
                    "user_id": "Thomas Snerdley",
                    "user_href": "/profile/Thomas-Snerdley"
                },
                {
                    "user_id": "Chris Villagomez",
                    "user_href": "/profile/Chris-Villagomez-4"
                },
                {
                    "user_id": "David Weihe",
                    "user_href": "/profile/David-Weihe"
                },
                {
                    "user_id": "Anthony Janssen",
                    "user_href": "/profile/Anthony-Janssen-3"
                },
                {
                    "user_id": "Thijsje Van Der Lee",
                    "user_href": "/profile/Thijsje-Van-Der-Lee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffery Scripps",
                "href": "/profile/Jeffery-Scripps"
            },
            "answer_text": "There are some parallels to be sure. An ancient capital in a supremely defensible position awaits the final battle against exotic and seemingly unstoppable enemies from the East. Over the years the kingdom has lost cities and provinces to these invaders until now only the once-magnificent capital remains to stand against the tide (a few territories remain in semi-independent status to the south and west. If this ancient capital falls, it has repercussions for the western half of the continent. The chain of beacon fires might have been from Byzantine inspiration too. But there are differences as well. The men of Gondor did their own fighting; the Romans often hired mercenaries. Gondor was content to be ruled by a Steward awaiting the return of the rightful king; the Romans were usually in factions and frequently fell into civil wars. Those civil wars more than anything else, even the Fourth Crusade, were what put Constantinople in such a weakened state. Gondor had a sense of “Team West\" and so they would not ally with Imladris/Rivendell to invade Lothlorian or split up Rohan with Isengard or Mordor. In real life Greek, Latin and various Muslim princes formed alliances, betrayed each other and made up again. This was statecraft in the Middle Ages. In real life the Turks were not orcs nor were the Greeks (or other westerners) knights in silver armor. They were all men and women, each person having some good (image of God in my faith) and some evil in them and they are all unique and complex individuals. Tolkien's masterful work is a Romantic or ideal story where the good guys are really good and the bad guys are really bad. The heightened contrast serves to draw out the few instances of conversion (Boromir, Saruman and maybe Gollum) and the overall call to preserve what is good in this decaying world. As a call that really goes out to every generation, it makes sense that we would see in the fading of once great kingdoms or empires some parallels to Lord of the rings. ",
            "date": "Answered September 26, 2019",
            "views": "11",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thomas Snerdley",
                    "user_href": "/profile/Thomas-Snerdley"
                },
                {
                    "user_id": "Michael Joseph",
                    "user_href": "/profile/Michael-Joseph-375"
                },
                {
                    "user_id": "Moraine Dunne",
                    "user_href": "/profile/Moraine-Dunne"
                },
                {
                    "user_id": "Michalis Georgiou",
                    "user_href": "/profile/Michalis-Georgiou-10"
                },
                {
                    "user_id": "Josiah Murphy",
                    "user_href": "/profile/Josiah-Murphy-1"
                },
                {
                    "user_id": "Ted Nivens",
                    "user_href": "/profile/Ted-Nivens"
                },
                {
                    "user_id": "Sean McHugh",
                    "user_href": "/profile/Sean-McHugh-9"
                },
                {
                    "user_id": "James Welch",
                    "user_href": "/profile/James-Welch-26"
                },
                {
                    "user_id": "Sameer Ketkar",
                    "user_href": "/profile/Sameer-Ketkar"
                }
            ]
        }
    ]
}