{
    "title": "Is Harshad Mehta still alive? - Quora",
    "tags": [
        "Harshad Mehta"
    ],
    "response": [
        {
            "author_info": {
                "name": "Naveen Prasadula",
                "href": "/profile/Naveen-Prasadula"
            },
            "answer_text": "Harshad Mehta Died in 31 December 2001 at the at age of 47 in 2001. Harshad Mehta was an Indian stockbroker, well known for his wealth and for having been charged with numerous financial crimes that took place in the 1992 securities scam. Of the 27 criminal charges brought against him, he was only convicted of four, before his death Good Days for Harshad Mehta’s family followed by Complete Explanation of Harshad Mehta Scam: Big Bull of the Stock Market   Complete Explanation of Harshad Mehta Scam: Big Bull of the Stock Market Let The Story Begin! A boy was born in a Gujarati Jain family in 1954. India was still enjoying the hangover of independence; new social and economic challenges were being faced, Andhra Pradesh high court was established Mehta, struggling with his crooked teeth (and a brain for sure) was growing up in the city of Kandivali, Bombay (then it was not called Mumbai, so please don’t yell at me!) until the family moved to Raipur, Madhya Pradesh (today’s Chhattisgarh). A young Harshad started trying his hand on different jobs in sales such as cement, hosiery and sorting diamonds. His career finally witnessed a concrete stability in New India Assurance Company (NIACL) where he was recruited as a sales person. The parallel scene! Dramatic personae: Government of IndiaIndian EconomyThese two characters were working hand in hand. They developed a strong bond with each other. The economy was in a much more controlled situation than it is today. It was mandatory for the banks to invest beyond a particular threshold amount in government securities. The amount had day to day variables but there had to have a weekly cut off. The smaller banks were even more regimented to maintain such threshold limit. They also needed to buy securities from banks that had securities in surplus. RF alias Ready Forward Deals had a strong impact upon such transactions. Ready Forward deals were a kind of very short term loans that one bank would avail from another in against bank securities. A BR (Bank Receipt) was issued by the borrowing bank that would promise the lending bank about delivering the money at the termination period of 15 days. The then brokers would work as a mediator conducting such transactions between these two banks. Meanwhile Harshad Mehta who had already developed keen interest in the stock market trading and investment jumped into the pool of money market. After resigning from NIACL, Harshad joined a brokerage firm Harjivandas Nemidas Securities as a middleman (known in the industry as JOBBER) for Prasann Pranjivandas who would consider Harshad his ideal disciple. The 90s had already started; Bombay was transforming every single day into today’s Mumbai. Kumar Sanu was mesmerizing the audiences with his blockbuster songs. 90s’ kids were being born as upcoming netizens and social media legends. Meanwhile, someone was writing a script of arguable the country’s biggest stock market scam. Let’s rewind back to 80s when the entire plot was being structured. The year was 1984, when Harshad Mehta along with his brother established a firm named Grow More Research and Asset Management. In order to open the firm he took assistance of the associates as the Bombay Stock Exchange had auctioned a broker’s card. In next two years he actively started trading. When the time entered the 90s, he started investing heavily in the shares of ACC (Associated Cement Company). The share price in the ACC eventually jumped from ₹ 200 to around ₹ 9000. When asked, Mehta validated the fact of his heavy investment into the shares of ACC by stating that the stocks had been undervalued. He created an aura by saying that his heavy trading corrected the market when it considered revaluing the company at a price equal to the cost of building a resembling enterprise. He thus, brought forth the famous “replacement cost theory”. This was a year that boomed his career, had he not dipped his leg into the sea of corruption. In a single financial year (1990-1991) Harshad was entitled “The Big Bull”. Magazines like Business Today got his photo published in the cover page. He almost became an overnight sensation in the world of finance in India. Harshad Mehta from a mediocre Gujarati man working as a junior clerk became a symbol of cosy lifestyle. But, how could he hoard such gigantic property and money? Was he industrious in his work? Yes, he was. Was he genius at the stock market trading? Oh, come on, he was, indeed! Let us dig deeper about his genius scam strategy. There were two very little known banks operating in Bombay: the Bank of Karad and the Metropolitan Co-Operative Bank. You have already got a concept of Bank Receipts, right? Well, now Harshad Mehta also took a deep dig in the process of Bank Receipts as he contacted these two banks to issue fake BRs. What is fake BR? These are bank receipts that did not have the backing of any bank security. He mastered it, grabbed the entire deal in hand and then went for a ride with the entire banking system. How was Mehta handling his trade mechanism? Let us elucidate it. Mehta structured a very unique and genius modus operandi of his entire scamming game. Shall we understand it with a very clear-cut example? Suppose, you have 5 banks: Bank 1, Bank 2, Bank 3, Bank 4, Bank 5. And, suppose you are “the Harshad Mehta” (just arbitrary, ok?) So, you have issued fake bank receipt from Bank 1. Went to Bank 2 and bought Government Bonds against BRs promising to repay on the very next day. Now you went to Bank 3 and issued government bonds that you had bought from Bank 2. Here, Bank 3 issues a cheque favouring you and you repay the Bank 2 in the very next day.Then you go to Bank 4 that sells securities and present fake BRs and purchased government bonds and issued Government Bonds to Bank 5 that issues cheque to you and you repay Bank 4.You have excess funds in your hand and you have started transmitting them towards purchasing stocks from the stock market.FEW!!! You have just created a maze without letting anyone realize that they were just being out-jockeyed. Harshad had a coterie of brokers who had a very smooth skin in the game. He did not just stop issuing fake BRs for the bank, but he rather started making fake BRs for himself. This made him a man of excellence, as if he was a sorcerer’s stone. Whatever he would touch, would turn into gold. ACC, Videocon and name what may where he had his eye on, got their value quadrupled overnight. He was turning rugged to rich. He was the king of Worli. Exposed!!!! But, the villain of his film was watching the entire story from the other side of the lens. Sucheta Dalal ripped off Mehta’s dubious activity by exposing him in an article in The Times of India in April 23rd 1992. In the article she described exactly how Mehta had extracted ₹500 crore from SBI’s treasury. In the book “The Scam”, co-written by Dalal she further stated that Mehta was called on by the SBI chairman to repay ₹500 crore by a cheque the very next day. However, the entire incident was denied by both the mentioned persons. After the article was published, the news busted like a volcano. It spread panic across the market. Even, National Housing Bank was found to have been victimized instantaneously. Mayhem!!! Banks became clueless thus demanding their money, which resulted in drastic downfall of Sensex. In January it was at 4467 points and it suddenly crashed to 2529 point in the month of August. It drained more than ₹100,000 crore from the money market. Those who trusted Mehta lost their savings of life. The then Finance Minister Manmohan Singh said in his discourse that the administration was in the process of downsizing the Statutory Liquidity Ratio (SLR) which at present bolts up an enormous segment of bank assets in the moderately low yielding government protections. This uber trick of extraordinary extents had uncovered the disorder and administrative oversight at the RBI, the Securities and Exchange Board of India (SEBI) which for all intents and purposes had no force at that point and the Finance Ministry. Notice the trick in a get-together of old shrewd gentlemen. You'll be remunerated with unpleasant grins and snide answers without a doubt. In December 31st , 2001 Mehta passed away in a Mumbai jail. Had the man been as honest as he was genius, a much celebrated life-story could have been written. However, the story could never be averted or ignored by the B-Town. 2006, Bollywood Drama almost did justice to the incredible and dark shaded journey of Mehta. A new Bollywood venture is also being talked about to be loosely based on Harshad Mehta’s life: “The Big Bull” starring Abhishek Bacchan. Worth of Scams If we talk about the gist, Indian economy has been and still is being shattered by humongous amount of monetary scams. RBI report says, only the financial year 2019 has witnessed bank frauds worth ₹71,500 crore. If someone points out that the effective measures are not being taken, then this is completely a superficial statement. When the entire system falls within complex law mechanism, a solid outcome takes time to be brought forth into the light under long-term solution. ",
            "date": "Answered October 8, 2020",
            "views": "33",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amlani Priyal",
                    "user_href": "/profile/Amlani-Priyal"
                },
                {
                    "user_id": "Dhiraj Kumar",
                    "user_href": "/profile/Dhiraj-Kumar-3465"
                },
                {
                    "user_id": "Yuva Raj",
                    "user_href": "/profile/Yuva-Raj-319"
                },
                {
                    "user_id": "Yatika Pasricha",
                    "user_href": "/profile/Yatika-Pasricha-1"
                },
                {
                    "user_id": "Arun Giri",
                    "user_href": "/profile/Arun-Giri-119"
                },
                {
                    "user_id": "Vivek Soni",
                    "user_href": "/profile/Vivek-Soni-127"
                },
                {
                    "user_id": "Aditya Dhuri",
                    "user_href": "/profile/Aditya-Dhuri-5"
                },
                {
                    "user_id": "Sunil Singh(सुनील सिंह)",
                    "user_href": "/profile/Sunil-Singh-सुनील-सिंह"
                },
                {
                    "user_id": "Chatrajit Swargiary",
                    "user_href": "/profile/Chatrajit-Swargiary-2"
                },
                {
                    "user_id": "Jhunulata Sahoo",
                    "user_href": "/profile/Jhunulata-Sahoo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anantha Maiya",
                "href": "/profile/Anantha-Maiya"
            },
            "answer_text": " Name: Harshad Shantilal MehtaBorn in: 29th July 1953Died in: 31st December 2001Profession: BIGGEST STOCK MARKET SCAMMERHe earned Degree in Bachelor of CommerceHe is still alive in the minds of operators - Sinners thoughts never die",
            "date": "Answered October 4, 2020",
            "views": "638",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aniket Pandey",
                    "user_href": "/profile/Aniket-Pandey-176"
                }
            ]
        }
    ]
}