{
    "title": "Is hindu religion growing? - Quora",
    "tags": [
        "Hinduism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pratik Kathesia",
                "href": "/profile/Pratik-Kathesia"
            },
            "answer_text": "There was a time when the father of Lord Rama, Dasaratha had three wives before 7000 years ago in Ramayana. On the contrary, Draupadi (female) had five husbands in Mahabharata before 5000 years ago. Do you find any such type of tradition among Hindus? No, Hindus have been transforming themselves according to time and situations. When we talk about inventions; zero, first university Nalanda,Algebra, Trigonometry, Geometry, Calculus, the great language Sanskrit, Ayurveda, Sushruta ( Inventor and Expert Medicine,Plastic surgery, Dentistry Sushruta - Wikipedia ) and many more 25 Amazing Ancient Indian Inventions That Changed The World Today. were discovered in India by Hindus. Also, world’s best and oldest architectural temples were built more than 500 years ago with full of complexity but sustainable and still alive. Thousand of earthquakes haven't destroyed it which was built without modern softwears and computers. You can imagine how powerful ancient Indian maths that former sculpture knew. Yes,there were unnecessary and harmful rituals (which was followed blindly) such as Sati-Pratha Sati (practice) - Wikipedia, Dowry (Dahej system) Dowry - Wikipedia , no education to girls. But slowly slowly it was eliminated from Hindu culture because it was never part of that. And Hindus have been accepting changes. In the time of world war 1 and 2, different countries were busy killing each other and dominating themselves around the world. At that time, Gandhiji (Hindu) took a different approach to fight for freedom which was never used previously because it was totally non-violence. And yes, it worked. The growth of thinking. After independence of united India, Muhammad ali jinnah (Non-Hindu) separated a country on the name of religion. At the same time, Sardar Patel (Hindu) integrated entire India by joining 562 territories which was hardest task by having a vision that no one would attack on India again. Thinking and achieving power of unity by a Hindu person. Major population (more than 80%) in India were/are Hindu. Hindu leaders knew that when they declared India as a secular country. So that, people of all religions can live happily and peacefully. India is best at space due to ISRO-Indian Space Research Organisation - Wikipedia. But the pioneers of building ISRO were Vikram Sarabhai, Dr APJ Abdul Kalam (Non-Hindu). It was launched from Church area in Thumba in Kerala. Transported on a Bicycle, Launched from a Church: The Amazing Story of India's First Rocket Launch Yes, we never forget the contribution of non-Hindu people and we really notice that. Look at the negative side, there are still some virtues we lack in majority states such as honesty, hygiene, education to girls and a few. But we have been struggling to solve these issues. Our main motto is ॐ सर्वे भवन्तु सुखिनःसर्वे सन्तु निरामयाः ।सर्वे भद्राणि पश्यन्तुमा कश्चिद्दुःखभाग्भवेत् ।ॐ शान्तिः शान्तिः शान्तिः ॥ which means Om, May All become Happy,May All be Free from Illness.May All See what is Auspicious,May no one Suffer.Om Peace, Peace, Peace. Overall, we have been changing ourselves from time to time, time with modernity, modernity as per requirements, requirements as per growth. Yes, We Hindus are growing. ",
            "date": "Answered August 10, 2017",
            "views": "16",
            "upvotes": " View 157 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhr",
                    "user_href": "/profile/Bhr-5"
                },
                {
                    "user_id": "Rish Wish",
                    "user_href": "/profile/Rish-Wish"
                },
                {
                    "user_id": "K Ganapathi",
                    "user_href": "/profile/K-Ganapathi-5"
                },
                {
                    "user_id": "Subramanyan Senapathi",
                    "user_href": "/profile/Subramanyan-Senapathi"
                },
                {
                    "user_id": "Raj Rupa",
                    "user_href": "/profile/Raj-Rupa-1"
                },
                {
                    "user_id": "Vishesh Jain",
                    "user_href": "/profile/Vishesh-Jain-82"
                },
                {
                    "user_id": "Srishti Jain",
                    "user_href": "/profile/Srishti-Jain-77"
                },
                {
                    "user_id": "Aum Namaha",
                    "user_href": "/profile/Aum-Namaha"
                },
                {
                    "user_id": "Venkatesan Devaru",
                    "user_href": "/profile/Venkatesan-Devaru"
                },
                {
                    "user_id": "Vandana Janwadker",
                    "user_href": "/profile/Vandana-Janwadker"
                }
            ]
        }
    ]
}