{
    "title": "Is history useless? - Quora",
    "tags": [
        "History",
        "Philosophy of Everyday Life",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Negron Luis",
                "href": "/profile/Negron-Luis"
            },
            "answer_text": "As an avid student of history, economics, and international relations, I believe history is one of the most important and applicable subjects in your everyday life. As an example let’s look at politics. But not any politics. Venezuelan politics. Gather ‘round for a story you probably haven’t heard of before and one that may make you realize how important history is. You sold yet? No? Perfect. There was once a boy. He grew up and became a soldier. Dissatisfied with the state of his country which had gone through some economic turmoil recently and with aspirations to reform the country’s political system, the man attempted a coup with his supporters. He was arrested and sentenced to jail but thanks in part to his popularity and many supporters, he was given a pardon and released early. This man eventually became the leader of the country and led it through some successful years of impressive economic growth while at the same time slowly turning into a dictatorship and persecuting a group of people, taking all their belongings and often forcing them out of the country. His policies eventually led to the ruin of his country. Now, can you guess who this person is? The answer is obvious, isn’t it? It’s Adolf Hitler.  You might have also answered Hugo Chavez.  To that, I also say that you are correct. Now, do you see the value of history? “Those who do not learn history are doomed to repeat it.” Or as the original quote said, \"Those who cannot remember the past are condemned to repeat it.\" History is not about knowing these so-called useless facts such as George Washingtons birthday, the casualties in the battle of Gettysburg or the life of Shakespeare. History is about understanding how all of these pieces fit together into the large puzzle that is history. Can you tell me how England and Scotland united despite them often not agreeing with each other and often going to war? And how did that influence the rise of the United Kingdom? And how did that lead to the rivalry with France that directly led to the independence of the United States and so-on and so-on? History is never useless. And in case you wonder when you will use history in your job, let’s list a few examples. Engineers should always know about disastrous engineering failures so as to not repeat them. Example? The Columbia disaster of 2003. Engineering disasters - Wikipedia Lawyers often deal with old cases that set the precedents. There are a ton of them. Just look at the list here. List of landmark court decisions in the United States - Wikipedia Another one? Well, how about economists? They must deal with the modern and constantly evolving world, right? Well how about the great depression or the US subprime mortgage crisis? 1929 and 2007 respectively. Subprime mortgage crisis - Wikipedia Great Depression - Wikipedia I could go on and on and on, but I won’t. As a proud Venezuelan, seeing my country’s history of coup after coup makes me ashamed of the people in here. I have met lots of people who simply do not care about history and many, despite how heartless I sound here, truly deserve the terrible situation they are in right now for not caring enough to read a history book. Edit: Grammar. ",
            "date": "Answered May 22, 2018",
            "views": "22",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pratap Raj",
                    "user_href": "/profile/Pratap-Raj-21"
                },
                {
                    "user_id": "Travis Moore",
                    "user_href": "/profile/Travis-Moore-18"
                },
                {
                    "user_id": "Tom Worrall",
                    "user_href": "/profile/Tom-Worrall-4"
                },
                {
                    "user_id": "Phạm N.H. Trung",
                    "user_href": "/profile/Phạm-N-H-Trung"
                },
                {
                    "user_id": "Hiền Ngô",
                    "user_href": "/profile/Hiền-Ngô-29"
                },
                {
                    "user_id": "Kristin Annexstad",
                    "user_href": "/profile/Kristin-Annexstad"
                },
                {
                    "user_id": "Teo Kai Pun",
                    "user_href": "/profile/Teo-Kai-Pun"
                },
                {
                    "user_id": "Binara Sirisena",
                    "user_href": "/profile/Binara-Sirisena"
                },
                {
                    "user_id": "Janson Hendryli",
                    "user_href": "/profile/Janson-Hendryli"
                },
                {
                    "user_id": "Jorge Mendoza",
                    "user_href": "/profile/Jorge-Mendoza-87"
                }
            ]
        },
        {
            "author_info": {
                "name": "AMIR AITELHADJ",
                "href": "/profile/AMIR-AITELHADJ"
            },
            "answer_text": "Well, at first I always thought to myself; why learn about the past if we are going to the future? But then I realized, you can’t improve if you don’t make mistakes, and if you don’t know what has happened before. So, the past shows us how things were back then and how we can improve. For example, with Hitler and the Nazis taking over Germany and giving hell, we learn not to do something like that again. That’s just my opinion, but I think history is useful! ",
            "date": "Answered May 22, 2018",
            "views": "291",
            "upvotes": "0"
        }
    ]
}