{
    "title": "Is it true that the ancient Egyptian king Amenmesse is Moses? - Quora",
    "tags": [
        "Moses (biblical figure)",
        "Ancient Egyptians",
        "Ancient Egypt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Owen Lee",
                "href": "/profile/Owen-Lee-126"
            },
            "answer_text": "I find it odd how people want to read the bible or religious scriptures as if it is actual or factual historicity. Yet they will not do any sort of research and verification and testing to see if what those texts contain hold any validity. Wether you believe in religion or their texts or not and or wether you believe in some god deitism or not, one thing should be a foundational process you should all believe in and that is what is demonstrably the truth and that which is a demonstrable proven fact. FACTS and TRUTH outweigh any and everything else. We have demonstrable and proven factual evidences that Moses never existed. That the story about him never took place. That there was never an exodus from Egypt, that there was never any 1 to 2 million Hebrew slaves of Egypt. It was all a lie.. It is all made up..It is all fictional created stories. We have direct evidences that disprove the entire existence of Moses and that entire story. Then when you look at factual historicity there is nothing on the story claims to back them up to even suggest these claims have any truth. Simply put a claim about a story is not in itself evidences. The sources of the claim CAN NEVER be used as the source of proof or evidences. Claims are not not evidences. Please, just lay your bibles and religious texts aside.. and go study factual historicity. Go study what is proven to know to be of existence of history. One of the main points of archeology and other related sciences is that they take the findings in and of that location and let the evidences of those findings tell the story .to put the puzzle together and of all those pieces they start getting a clear picture of what is there of that time and place. Science does not start with a picture and then go out and try to look for pieces that fit the picture they want to see. This is why religion and its texts it creates and make up are not science related. They deny and refuse to use sience..they oppose science. Science uses the information that is found and demonstrated in reality and uses that reality to come to a conclusion after all the information is put together…and then if new information is found and demonstrated in reality it changes and modifies its conclusions to fit the information and reality. It is willing to always change its final conclusion pending the information at hand that is given. The facts of reality it has to determin that conclusion. Religion and religious texts are opposite of that..it draws a picture and a conclusion, usually with mo facts and no demonstrable information or evidences and has that final conclusion and everything must conform to it. It will fit pieces to that conclusion even when they do not fit. Usually upon assumption that it must exist and even though there is zero proof of or evidences of..it still must exist..even when it defies the laws of reality. ",
            "date": "Answered October 20, 2020",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Tatford",
                "href": "/profile/Peter-Tatford"
            },
            "answer_text": "Absolutely not. It’s a fantasy concocted by someone trying to sell a book. If Amenmesse (c1200 BCE) was Moses then the entire biblical story prior to the United Monarchy would have to be entirely invented. In which case Moses would never have existed. ",
            "date": "Answered March 5, 2020",
            "views": "144",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        }
    ]
}