{
    "title": "Is it true that the Chinese and Koreans sabotaged the ships when the Mongols invaded Japan? - Quora",
    "tags": [
        "Mongolian Ethnicity and People",
        "Mongol Empire",
        "Korean Ethnicity and People",
        "Chinese Ethnicity and People",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Im Yang Gyoon",
                "href": "/profile/Im-Yang-Gyoon"
            },
            "answer_text": "Is it true that the Chinese and Koreans sabotaged the ships when the Mongols invaded Japan? Goryeo (Korea) was opposed to Mongolia's conquest of Japan. The reason was that building ships and fighting wars for Mongolian troops, who had no idea about the sea, did not help the economy of Goryeo. However, they were forced by Mongolia to build 900 ships. From November 11th to November 26th, 1274, the first invasion of Japan was made. In this war, due to the Goryeo army's performance, the Japanese army lost and ended in victory.  Mongolia wanted a second round of Japanese conquests, and in the case of the first round, Goryeo had a hard time building ships. During the first expedition, 35,000 Goryeo people were mobilized to build 900 ships. In fact, it was never a pleasant war for Goryeo. This is because the entire country was forced into another war while the entire country was already devastated by the massive war with Mongolia, and the end of the Goryeo Dynasty became even more impoverished as the human and material resources that had to be used to restore farmland or cities were diverted to war. The Mongolian army did not know about the sea and was afraid of the sea, so it was helped by the Goryeo army to navigate the sea to Japan. he whole islet-rich Japan was not in a situation to end in a year or two. Therefore, Goryeo would have had to have a way of easily rejecting Mongolia's demands. Goryeo is a country with three sides of the sea... Typhoons come to the Korean Peninsula in summer. People living on the Korean Peninsula know that severe monsoon rains accompany typhoons in summer. And Goryeo did not build ships that were strong for long periods of time for typhoons. A ship that could be broken very easily was built and provided to Mongolia. However, from June 16 to August 29, 1281, they fought a war in the sea during the typhoon.  After meeting the typhoon, the Mongol army rarely returned, but most of the Goryeo troops returned alive. The typhoon wiped out the Mongolian army, but the Goryeo army did not suffer much damage. Mongolia thought it was the Savotage of Goryeo and suspected Goryeo, but gave up the Japanese expedition due to lack of accurate evidence. ",
            "date": "Answered July 22, 2020",
            "views": "290",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Luca Nic",
                "href": "/profile/Luca-Nic-1"
            },
            "answer_text": "I have heard the same rumor as well but I can’t recall one single sources confirming this. Both the Han Chinese and the Korean who took part into the invasion were definitely against the idea of fighting abroad for the sake of their invaders, but purposely sabotage the ships which their sons and themselves would have used seems a very odd idea if you ask me. On the other hand, some ships used in the Invasions were not sturdy enough to survive a sea voyage in open waters but better suited to navigate small rivers. Wether or not that was intentional is up to debate. ",
            "date": "Answered July 22, 2020",
            "views": "197",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tae Hoon Kim",
                    "user_href": "/profile/Tae-Hoon-Kim-25"
                },
                {
                    "user_id": "John Cordova",
                    "user_href": "/profile/John-Cordova-50"
                },
                {
                    "user_id": "Jay Yan",
                    "user_href": "/profile/Jay-Yan-1"
                },
                {
                    "user_id": "Jacob Dorey",
                    "user_href": "/profile/Jacob-Dorey"
                }
            ]
        }
    ]
}