{
    "title": "Is investing in Bitcoin in 2020 a wise decision? - Quora",
    "tags": [
        "Bitcoin Investment",
        "Cryptocurrency Investment Advice",
        "Cryptocurrency Investing",
        "2020 (year)",
        "Virtual Currencies",
        "Bitcoin",
        "Cryptocurrencies",
        "Investment Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Oman Moor",
                "href": "/profile/Oman-Moor"
            },
            "answer_text": "Whether one should invest in bitcoin or not depends on whether you think Bitcoin will become a long-term trusted store of value. If it does become a long-term trusted store of value, BTC should trade around $2,000,000 a coin (depending on how many coins are lost and are actually in circulation). That is over 100x the price of where BTC is today. IMPORTANT NOTE: Have you ever imagined a Cryptocurrency platform that serves as a wallet and also an investment platform? Have you ever imagined keeping your Crypto coin safe secured and insured for the future with reasonable profit margin of up to 20%? Don’t worry because now it exist. CryptoexchangeFX is the answer. Google CryptoexchangeFX and thank me later. Love live the future of Cryptocurrency…. www.cryptoexchangefx,com If BTC does not become a long-term trusted store of value, its likely price will be close to zero (unless it becomes a \"cool\" collectible... which is a possibility). So if you think BTC has a 10% chance of becoming a long-term trusted store of value, it is a good investment with a nice expected return. It is still very risky but professional investors should invest some small portion of their portfolio in this case. PROMOTED If you think BTC has a 1% chance of becoming a long-term trusted store of value, you should not invest. If you think BTC has a 0.001% chance of becoming a long-term trusted store of value, you might consider a short. 2. Bitcoin is a religion... how good are the evangelists? Like all stores of value and collectibles, Bitcoin is a religion. It is like gold or a Rembrandt painting... it has no cash flows so its value is only what others think it should be. And like all religions, Bitcoin has evangelists and early disciples. Bitcoin has a few things going for it in this regard: 1. The savior, Satoshi Nakamoto , is unknown and potentially not alive anymore. So we can only attribute wonderful things to Satoshi and cannot see her/his faults. If Satoshi Nakamoto eventually becomes known, it will make it harder for Bitcoin to become a true religion and this harder to become a long-term store of value. 2. Early bitcoin disciples and enthusiasts are super smart, great at marketing, and mostly were already very wealthy before bitcoin. There are about 1000 people that were very early public Bitcoin backers... at least 50 of whom were already worth over $100 million before they got into Bitcoin (and a few were billionaires). These people are incredible connected, smart, media savvy, good at PR, and tapped into the world of finance (some run large financial institutions). They are \"rebels\" in a sense but they are also very much part of the establishment. They have the ability to help get Bitcoin to go mainstream. Should you invest in Bitcoin? I'm not going to give advice on that. In even the best-case scenario, Bitcoin is incredibly risky ... so if you do invest, you should go in expecting to lose all of it. ",
            "date": "Updated October 13, 2019",
            "views": "133",
            "upvotes": " View 142 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dejan Papež",
                    "user_href": "/profile/Dejan-Papež"
                },
                {
                    "user_id": "Theo Batik",
                    "user_href": "/profile/Theo-Batik"
                },
                {
                    "user_id": "J Hawkins",
                    "user_href": "/profile/J-Hawkins-5"
                },
                {
                    "user_id": "Sampson Beke",
                    "user_href": "/profile/Sampson-Beke"
                },
                {
                    "user_id": "Kaho Jano",
                    "user_href": "/profile/Kaho-Jano"
                },
                {
                    "user_id": "Cati Wiyi",
                    "user_href": "/profile/Cati-Wiyi"
                },
                {
                    "user_id": "Fiwen Ara",
                    "user_href": "/profile/Fiwen-Ara"
                },
                {
                    "user_id": "Moha Nobi",
                    "user_href": "/profile/Moha-Nobi"
                },
                {
                    "user_id": "Cofe Hope",
                    "user_href": "/profile/Cofe-Hope"
                },
                {
                    "user_id": "Lefe Jena",
                    "user_href": "/profile/Lefe-Jena-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Kireev",
                "href": "/profile/Dan-Kireev"
            },
            "answer_text": "Bitcoin is not a company or a stock. It is a virtual currency. If you still don’t quite get what Bitcoin is, you may wish to defer to the plethora of videos online and articles on this site in order to get a clearer understanding. So, when you finally decide to invest in crypto, you are essentially buying a currency like the US Dollar or Euro. However, there are also some specific strategies for investing in BTC. Believe it or not, there seems to be the best day of the week, and the best time of day, to buy Bitcoin. Is now a good time to buy BTC? Let’s see how professionals will answer this question. Economists from Yale University have come up with a technique to predict the price BTC based on the cryptocurrency’s past behavior. Yukun Liu and Aleh Tsyvinski analyzed seven years of BTC price data to figure out which indicators can be used to determine the future price of BTC. Their findings, published in The National Bureau of Economic Researh, established that all cryptocurrencies are entirely distinct from stocks, currencies and other commodities in terms of factors affecting their market movements. “In contrast, we show that the cryptocurrency returns can be predicted by factors which are specific to cryptocurrency markets,” the study explains. “Specifically, we determine that there is a strong time-series momentum effect and that proxies for investor attention strongly forecast cryptocurrency returns.” This momentum effect was found to strongly affect cryptocurrency, meaning that if Bitcoin is performing well then it is likely to continue doing so, at least in the short-term. According to their strategy, an investor should buy BTC if its value increases more than 20 percent in the previous week. The best thing you can do is to adopt three incredibly simple principles before buying any coins: educate yourself, buy the dips, and never sell. Educate yourself If you don’t understand what cryptocurrency is, you should not buy it. Do not frantically chase quick profits or parabolic price patterns. Nowadays, there are multiple resources available on the Internet including our website that can help you gain all the necessary knowledge. Yes, it may take time. But this is the only right way to start crypto trading. To learn about Bitcoin, visit James Lopp’s website and browse this list of reading materials from the Nakamoto Institute. Watch any of the videos on Andreas Antonopoulos’ YouTube channel too. As well as YouMeAndBTC and Noded podcasts for entertaining and high-quality crypto discussion! Buy the dip Playing the price to find an ideal entry point burns more people than it benefits. And we, therefore, offer no opinions on when to buy it. Never sell Part of this philosophy also requires anyone buying BTC to only spend as much money as they are entirely comfortable losing completely. Some crypto investors only nominally accept this idea. We recommend serious consideration. Holding Bitcoin long-term is the best strategy. Why not sell and take profits? Because Bitcoin is a commodity in the process of monetizing. It has been a long process with many ups and downs, but it would be foolish to accumulate fiat profits which end up worthless. Conclusions When is the best time to buy cryptocurrencies? Despite many theories, efficient markets do not exist in the real world. Human habits, regulations or manipulation can result in recurring disparities in price patterns. Statistical oddities and many other patterns can be quickly found with the help of the Seasonax app on Bloomberg or Thomson-Reuters systems. Unlike stocks, bonds, or buying fiat, cryptocurrencies are highly volatile, much more so than traditional investments. This can be both good and bad: on one hand, you can make some quick and easy profits on a good day, but you could also lose your entire investment in the next. I encourage you to look and research further than the data available in this post if you ever decide to buy some BTC. One golden tip I learned throughout the years, never invest more than what you are willing to lose. While many of us are lucky to have the means to experiment with 50 USD, you should never feel pressured to invest beyond your comfort zone. Many people don’t know but it’s absolutely not necessary to buy 1 whole Bitcoin. Digital currencies such as Bitcoin as divisible into small amounts, so you can just buy a fraction. Reach out to me If you need my consultancy on Bitcoin mining or connect with me as my goal for the rest of 2020 is to help atleast 1000 people get in crypto :) Upvote if you like! ",
            "date": "Answered May 15, 2020",
            "views": "52",
            "upvotes": " View 51 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prashant Bhalani",
                    "user_href": "/profile/Prashant-Bhalani"
                },
                {
                    "user_id": "William Kurtz",
                    "user_href": "/profile/William-Kurtz-17"
                },
                {
                    "user_id": "Rhonda Mitchell",
                    "user_href": "/profile/Rhonda-Mitchell-68"
                },
                {
                    "user_id": "Arun N Art",
                    "user_href": "/profile/Arun-N-Art"
                },
                {
                    "user_id": "Joanna Kubiak",
                    "user_href": "/profile/Joanna-Kubiak-3"
                },
                {
                    "user_id": "Thando Mkhatshwa",
                    "user_href": "/profile/Thando-Mkhatshwa"
                },
                {
                    "user_id": "Dejan Papež",
                    "user_href": "/profile/Dejan-Papež"
                },
                {
                    "user_id": "William Brookhouse",
                    "user_href": "/profile/William-Brookhouse"
                },
                {
                    "user_id": "Phabe Barcelona",
                    "user_href": "/profile/Phabe-Barcelona"
                },
                {
                    "user_id": "Josef Kosik",
                    "user_href": "/profile/Josef-Kosik"
                }
            ]
        }
    ]
}