{
    "title": "Is it true that George Washington bought slaves to have their teeth pulled to make his own dentures? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Ted Koehl",
                "href": "/profile/Ted-Koehl"
            },
            "answer_text": "It is absolutely untrue the George Washington purchased slaves in order to have their teeth pulled in order to make him dentures. If you are able to travel to the George Washington Memorial Masonic Temple located in Alexandria, Virginia, you can see George Washington's carved wooden dentures on display. He is to have had several sets of like dentures during his lifetime as needed. He complained about the pain involved in using them as you can imagine. The fact that they were wood and wired together allowed the dentist to make ongoing adjustments. While Washington was a slave holder through inheritance, he despised slavery as an institution. Many other Founder's and Framer's were also in the same situation and expressed the same opinions. It is important to remember that slavery in all countries was common at the time as well as throughout recorded history. It is significant to note that our Founder's sought to create a better society than they had or had knowledge of as reflected in the Declaration of Independence and the United States Constitution. Not perfect, but striving to be more perfect. ",
            "date": "Answered June 8, 2014",
            "views": "990",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Megan Mendez",
                    "user_href": "/profile/Megan-Mendez-4"
                },
                {
                    "user_id": "Zachary Stucki",
                    "user_href": "/profile/Zachary-Stucki"
                },
                {
                    "user_id": "David Lickiss",
                    "user_href": "/profile/David-Lickiss"
                },
                {
                    "user_id": "Chris Colella",
                    "user_href": "/profile/Chris-Colella-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Desmond Bolden",
                "href": "/profile/Desmond-Bolden"
            },
            "answer_text": "I don’t think Washington bought slaves simply to use their teeth for his dentures. At some point, Washington stopped buying slaves altogether. The number that he owned continued to grow simply because his slaves married each other and had kids. Now, Washington’s dentures did use human teeth, which sometimes came from slaves, but I still find it difficult to believe that any of his slaves existed for the sole purpose of outfitting his dentures. ",
            "date": "Updated April 18, 2020",
            "views": "392",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tl Jones",
                    "user_href": "/profile/Tl-Jones"
                },
                {
                    "user_id": "Megan Mendez",
                    "user_href": "/profile/Megan-Mendez-4"
                }
            ]
        }
    ]
}