{
    "title": "Is it true that early Christians were baptised naked? - Quora",
    "tags": [
        "Early Christianity",
        "Baptism",
        "History of Christianity",
        "History of Religion",
        "Christians",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Francis Marsden",
                "href": "/profile/Francis-Marsden-1"
            },
            "answer_text": "So far as we know, and practices may have varied in different local churches, those being baptized were not naked, but clothed in some single cloth vestment and led down into the baptismal pool. There they were plunged three times under the water. They climbed out up the steps, and were led into a side room, changed into a long dry white robe (white being symbolic of purity and new life) and then re-emerged to be chrismated (confirmed). Deaconnesses and godmother assisted the female candidates, deacons and godfathers the male candidates, who of course would have been separated. The early Christians were far more concerned about modesty and decency than many people today are. ",
            "date": "Answered September 24, 2019",
            "views": "60",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elvis George",
                    "user_href": "/profile/Elvis-George-4"
                },
                {
                    "user_id": "Roger Hayes",
                    "user_href": "/profile/Roger-Hayes-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Rommel",
                "href": "/profile/Mike-Rommel"
            },
            "answer_text": "Question: Is it true that early Christians were baptised naked? In light of what the Bible teaches, I have to wonder where such a thought could come from. Such a thing would cause all kinds of lustful thinking….NO! Matthew 5:28 ESV But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart. Habakkuk 2:15 ESV “Woe to him who makes his neighbors drink— you pour out your wrath and make them drunk, in order to gaze at their nakedness! Leviticus 20:17 ESV “If a man takes his sister, a daughter of his father or a daughter of his mother, and sees her nakedness, and she sees his nakedness, it is a disgrace, and they shall be cut off in the sight of the children of their people. He has uncovered his sister's nakedness, and he shall bear his iniquity. ",
            "date": "Answered September 24, 2019",
            "views": "19",
            "upvotes": "0"
        }
    ]
}