{
    "title": "Is it true that there were very few Catalans among the conquistadors and Spanish migrants to America? - Quora",
    "tags": [
        "Catalan People",
        "Conquistadors",
        "Spanish Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucas Villar",
                "href": "/profile/Lucas-Villar-3"
            },
            "answer_text": "The conquistadors were mostly Extremenian and Andalusian, why? The nobles of each region had certain acquired privileges, that's how feudal societies worked. Castile funded Colombus, Castilian nobles had the exclusive rights over whatever Colombus may find, they made a bet and they got the reward. They acquired the privilege of managing the New World. Catalan nobles paid less than half the taxes as one of their acquired rights for example. Therefore Castilian nobles had the reserved rights over the Americas as signed in the contract with Colombus. That is until the old privileges were abolished with the arrival of the Bourbons in 1714, since then Castilian nobles lost the monopoly over the colonies, but everything was conquered already by then so no conquistadors but quite a few Catalan traders after that, especially to Cuba.The southern hidalgos (lower nobility) such as Cortés or Pizarro were the ones who went to the Americas for the most part because the trading port with the colonies was Seville in the region.",
            "date": "Answered October 28, 2018",
            "views": "918",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nathan Yang (楊立慶)",
                    "user_href": "/profile/Nathan-Yang-楊立慶"
                },
                {
                    "user_id": "Daniel Olivares",
                    "user_href": "/profile/Daniel-Olivares-13"
                },
                {
                    "user_id": "Antonio Carmona",
                    "user_href": "/profile/Antonio-Carmona-11"
                },
                {
                    "user_id": "Nat Condit-Schultz",
                    "user_href": "/profile/Nat-Condit-Schultz"
                },
                {
                    "user_id": "Alejandro van Rooy",
                    "user_href": "/profile/Alejandro-van-Rooy"
                },
                {
                    "user_id": "Sam Pollard",
                    "user_href": "/profile/Sam-Pollard-3"
                },
                {
                    "user_id": "Johnny Hernandez",
                    "user_href": "/profile/Johnny-Hernandez-122"
                },
                {
                    "user_id": "Matt Elsen",
                    "user_href": "/profile/Matt-Elsen-1"
                },
                {
                    "user_id": "Rogelio Lorenzo",
                    "user_href": "/profile/Rogelio-Lorenzo"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Conrad Raphael Maleta'",
                "href": "/profile/Conrad-Raphael-Maleta"
            },
            "answer_text": "There was no Catalans (in the sense of today) around 1500s. Catalans are a young concept developed mostly in the XIX century. Instead you have the Kingdom of Aragon. However, the Counts of Barcelona acted de facto as royal house of the Kingdom of Aragon but they ended in 1410, i make you notice that Barcelona was ruled by a Count never a King. At the times of the conquist you didn have catalans, didnt exist! you had aragonese and YES, you can track LOT of aragonese conquerors in America. ",
            "date": "Answered October 28, 2018",
            "views": "194",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicholas Newman",
                    "user_href": "/profile/Nicholas-Newman-8"
                },
                {
                    "user_id": "Guillermo Garcia Alcaine",
                    "user_href": "/profile/Guillermo-Garcia-Alcaine"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                }
            ]
        }
    ]
}