{
    "title": "Is it true that Greeks originate in Anatolia? - Quora",
    "tags": [
        "Anatolia",
        "Greek Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Apellido",
                "href": "/profile/Alex-Apellido"
            },
            "answer_text": "Essentially, yes, Greeks are native to the vast majority of Anatolia, also known as the Asia Minor. There were other groups who inhabited Anatolia as well, but they disappeared or were absorbed into the Greek inhabitants of Anatolia. The only other major remaining group of people who are also native to Anatolia are the Armenians, who mainly lived in the very eastern part of Anatolia, while Greeks prevailed everywhere else. Additionally, Greeks are the people who have lived in Anatolia the longest, having lived in Anatolia for thousands of years under different Greek city-states, kingdoms, and empires until the Turks committed genocide in the 1900s against these two groups, the Greek and the Armenians, essentially removing them in totality from the Asia Minor. The Assyrians were also victims of the same genocide during this time frame as well. These three groups were targeted because they were the three large Christian groups with ancient ties to the regions they inhabited and were now under the rule of a Muslim empire (the Ottomans) ruled by Turks—people lacking those ancient ties, being an outside invader force that came in, conquered, and settled the area in the Middle Ages. Here is a map of Anatolia in 1910 and where the three Greek speaking groups lived. The orange represents Pontic Greeks (Pontic Greeks - Wikipedia), the teal represents Capaddocian Greeks (Cappadocian Greeks - Wikipedia), and the yellow represents “Demotic” Greeks, or those more closely related to modern Greeks, linguistically speaking.  So yes, Greeks are native to most of Anatolia but are effectively nonexistent there as a result of genocide and “population exchange” that occurred in the 1900s and that, unfortunately, the modern state of Turkey continues to deny happened to this day (including the Armenian and Assyrian Genocides, as well). So if Greeks are not native to Anatolia, then the current inhabitants, the Turks, are most certainly not native either. Anatolia is full of Greek ruins that, thankfully and fortunately, the modern state of Turkey has done a relatively good job preserving and appreciating compared to their cousins in Azerbaijan who have been actively removing ancient Armenian ruins from their country.  Ruins of the Temple of Artemis at Ephesus:  Modern Turkish reconstruction of the temple:  Read more here: Greek genocide - Wikipedia Population exchange between Greece and Turkey - Wikipedia Armenian Genocide - Wikipedia Assyrian genocide - Wikipedia ",
            "date": "Answered January 28, 2020",
            "views": "11",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Riley Miller",
                    "user_href": "/profile/Riley-Miller-75"
                },
                {
                    "user_id": "Orumcek Misaroglu",
                    "user_href": "/profile/Orumcek-Misaroglu"
                },
                {
                    "user_id": "Stratos Gregoras",
                    "user_href": "/profile/Stratos-Gregoras"
                },
                {
                    "user_id": "Konrad Söderlund",
                    "user_href": "/profile/Konrad-Söderlund"
                },
                {
                    "user_id": "Henry Denton",
                    "user_href": "/profile/Henry-Denton-3"
                },
                {
                    "user_id": "Andreas labros",
                    "user_href": "/profile/Andreas-labros"
                },
                {
                    "user_id": "Efe Çarıkçı",
                    "user_href": "/profile/Efe-Çarıkçı"
                },
                {
                    "user_id": "Peter Jackson",
                    "user_href": "/profile/Peter-Jackson-287"
                },
                {
                    "user_id": "Michael Loizides",
                    "user_href": "/profile/Michael-Loizides-1"
                },
                {
                    "user_id": "Mithridatis Da Costa",
                    "user_href": "/profile/Mithridatis-Da-Costa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Ingvaldsson Kitselis",
                "href": "/profile/Philip-Ingvaldsson-Kitselis"
            },
            "answer_text": "Partially true. All people are mixed to a certain degree. Around 9000 years ago there was a big migration of Anatolian farmers to Greece. They and the relative small population of Helladic hunter-gatherers set the foundation of the gene pool in Greece. Some related papers to read Paschou, P., Drineas, P., Yannaki, E., Razou, A., Kanaki, K., Tsetsos, F., Padmanabhuni, S.S., Michalodimitrakis, M., Renda, M.C., Pavlovic, S. and Anagnostopoulos, A., 2014. Maritime route of colonization of Europe. Proceedings of the National Academy of Sciences, 111(25), pp.9211-9216. King, R. J., Özcan, S. S., Carter, T., Kalfoğlu, E., Atasoy, S., Triantaphyllidis, C., ... & Michalodimitrakis, M. (2008). Differential Y‐chromosome Anatolian influences on the Greek and Cretan Neolithic. Annals of human genetics, 72(2), 205-214. Lazaridis, I. (2018). The evolutionary history of human populations in Europe. Current opinion in genetics & development, 53, 21-27. Van Andel, T.H. and Runnels, C.N., 1995. The earliest farmers in Europe. Antiquity, 69(264), pp.481-500. Tringham, R. 2000. Southeastern Europe in the transition to agriculture in Europe: Bridge, buffer, or mosaic in Europe’s first farmers. Edited by D. Price, pp. 19–56. Cambridge: Cambridge University Press Hofmanová, Z., Kreutzer, S., Hellenthal, G., Sell, C., Diekmann, Y., Díez-del-Molino, D., ... & Kirsanow, K. (2016). Early farmers from across Europe directly descended from Neolithic Aegeans. Proceedings of the National Academy of Sciences, 113(25), 6886-6891. Some public articlesFarming was spread into and across Europe by people originating in modern-day Greece and Western Turkey The Greeks really do have near-mythical origins, ancient DNA reveals ",
            "date": "Answered August 17, 2019",
            "views": "490",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Denton",
                    "user_href": "/profile/Henry-Denton-3"
                },
                {
                    "user_id": "Ece Cenker",
                    "user_href": "/profile/Ece-Cenker"
                },
                {
                    "user_id": "Efe Çarıkçı",
                    "user_href": "/profile/Efe-Çarıkçı"
                },
                {
                    "user_id": "Salih Atalay",
                    "user_href": "/profile/Salih-Atalay"
                },
                {
                    "user_id": "Alan Piersonn",
                    "user_href": "/profile/Alan-Piersonn"
                },
                {
                    "user_id": "Yayang Tapir",
                    "user_href": "/profile/Yayang-Tapir"
                },
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                }
            ]
        }
    ]
}