{
    "title": "Is it possible that the Catholic Church was not built by Christ? - Quora",
    "tags": [
        "Christian Churches and Denominations",
        "Catholic Churches",
        "Catholics",
        "Christian Theology and Philosophy",
        "Churches",
        "Catholicism",
        "Jesus",
        "Theology",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Renato Baldago",
                "href": "/profile/Renato-Baldago-3"
            },
            "answer_text": "How could Christ have built the Catholic Church with all its beliefs mixed with lies, folklore, supposed visions of Mary appearing and disappearing and giving instructions, and idolatry beginning with man-conceived notions of hierarchy where Mary is a negotiator and God an unreachable, unknowable X? Using the Bible as usual, let us start with Peter talking since the Catholic Church makes a mountain of lore about Peter being their first Pope.  MATTHEW 16:16-18 16 And Simon Peter answered and said, Thou art the Christ, the Son of the living God. 17 And Jesus answered and said unto him, Blessed art thou, Simon Bar-jona: for flesh and blood hath not revealed it unto thee, but my Father which is in heaven. 18 And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it. There are delicate matters in the preceding verses a careful student of the Bible must consider. When Peter said, “Thou art the Christ, the Son of the living God,” it is a revelation from the Father. The speaker saying, “Thou art Peter, and upon this rock I will build my church” is the Lord Jesus Christ. Behind these verses are biblical truths of antiquity! Let us consider.  As early as the time of Adam, God foretold the coming of the Messiah or the Christ.  GENESIS 3:15 And I will put enmity between thee and the woman, and between thy seed andher seed; it shall bruise thy head, and thou shalt bruise his heel. This was foretold again in the time of Moses,  DEUTERONOMY 18:18 I will raise them up a Prophet from among their brethren, like unto thee, and will put my words in his mouth; and he shall speak unto them all that I shall command him. To give my readers advanced food for thought which we will clarify later, the Prophet mentioned in Deuteronomy 18:18, being Jesus Christ in reality, will speak the Father’s own words (“my words in his mouth”). When Christ said, “Upon this rock I will build my church,” it is the “Church of God” and not His own church - not the church of Christ that others perceived it to be). It must be understood that the Father will be the one to build and not the Son! The main reason is that Christ is part of the Church being its foundation!  At the time of the Lord Jesus Christ, the Jews who did not know were rebuked by the Lord Jesus for their ignorance about the “signs of the times.”  MATTHEW 16:1-4 1 The Pharisees also with the Sadducees came, and tempting desired him that he would show them a sign from heaven. 2 He answered and said unto them, When it is evening, ye say, It will be fair weather: for the sky is red. 3 And in the morning, It will be foul weather today: for the sky is red and lowering. O ye hypocrites, ye can discern the face of the sky; but can ye not discern the signs of the times? 4 A wicked and adulterous generation seeketh after a sign; and there shall no sign be given unto it, but the sign of the prophet Jonah. And he left them, and departed. The issue is: Is this person doing things not known among the Israelites the Christ or Messiah?  The reason they were asking for a sign is that they knew that, in His coming, the Messiah shall fulfill the prophecies concerning Him; but their ignorance of the scriptures deprived them of the understanding necessary to be sure who really is the Christ! Nevertheless, there were a few select people who used biblical analysis and came up with a predictive notion that Jesus is the Christ. Based on prophecy and experience, this woman in these three verses, manifests her discernment that the man she faced was Christ.  JOHN 4:19, 25, 26 19 The woman saith unto him, Sir, I perceive that thou art a prophet. 25 The woman saith unto him, I know that Messiah cometh, which is called Christ: when he is come, he will tell us all things. 29 Come, see a man, which told me all things that ever I did: is not this the Christ? But there are side issues to be resolved first. Is Jesus, the son of Mary, the Christ? These exchanges that follow can help us understand the reactions of people finding Jesus and what they thought of him – still leading to the thought that Jesus is the Christ. This time, it is with Philip whom Jesus asked to follow him. (Does commanding to follow one usually happen with ordinary men?).Then Philip tells Nathanael what they found, echoing the woman who found Jesus at a well. Nathanael tests Jesus.  JOHN 1:43-49 43 The day following Jesus would go forth into Galilee, and findeth Philip, and saith unto him, Follow me. 44 Now Philip was of Bethsaida, the city of Andrew and Peter. 45 Philip findeth Nathanael, and saith unto him, We have found him, of whom Moses in the law, and the prophets, did write, Jesus of Nazareth, the son of Joseph. 46 And Nathanael said unto him, Can there any good thing come out of Nazareth? Philip saith unto him, Come and see. 47 Jesus saw Nathanael coming to him, and saith of him, Behold an Israelite indeed, in whom is no guile! 48 Nathanael saith unto him, Whence knowest thou me? Jesus answered and said unto him, Before that Philip called thee, when thou wast under the fig tree, I saw thee. 49 Nathanael answered and saith unto him, Rabbi, thou art the Son of God; thou art the King of Israel. This is a demonstration of Jesus having knowledge that ordinary men do not have. He could tell of the character of men he was dealing with. Nathanael was surprised that Jesus could appraise him as “having no guile” or being honest and not deceitful. “When did you come to know me?” or “Have we met?” was yet demonstrated as Jesus being able to see things before they happen. Nathanael was sitting under a fig tree. Philip called him to show Jesus and Nathanael stood up to go see the Christ. Before Nathanael stood up to go to Jesus, the latter already saw where Nathanael was, and more: He knew what nation Nathanael belonged to and what character Nathanael had!  There are works that will prove that the Messiah has come. He will come with wonderful works.  MATTHEW 11:3-6 3 And said unto him, Art thou he that should come, or do we look for another? 4 Jesus answered and said unto them, Go and show John again those things which ye do hear and see: 5 The blind receive their sight, and the lame walk, the lepers are cleansed, and the deaf hear, the dead are raised up, and the poor have the gospel preached to them. 6 And blessed is he, whosoever shall not be offended in me. He will be coming from three (3) distinct places: Bethlehem of Judea, Egypt, and Nazareth. The Chapters in Micah and Matthew point to them.  MICAH 5:2 But thou, Bethlehem Ephratah, though thou be little among the thousands of Judah, yet out of thee shall he come forth unto me that is to be ruler in Israel; whose goings forth have been from of old, from everlasting. MATTHEW 2:1 Now when Jesus was born in Bethlehem of Judea in the days of Herod the king, behold, there came wise men from the east to Jerusalem, MATTHEW 2:13-15 13 And when they were departed, behold, the angel of the Lord appeareth to Joseph in a dream, saying, Arise, and take the young child and his mother, and flee into Egypt, and be thou there until I bring thee word: for Herod will seek the young child to destroy him. 14 When he arose, he took the young child and his mother by night, and departed into Egypt: 15 And was there until the death of Herod: that it might be fulfilled which was spoken of the Lord by the prophet, saying, Out of Egypt have I called my son. MATTHEW 2:19-23 19 But when Herod was dead, behold, an angel of the Lord appeareth in a dream to Joseph in Egypt, 20 Saying, Arise, and take the young child and his mother, and go into the land of Israel: for they are dead which sought the young child's life. 21 And he arose, and took the young child and his mother, and came into the land of Israel. 22 But when he heard that Archelaus did reign in Judea in the room of his father Herod, he was afraid to go thither: notwithstanding, being warned of God in a dream, he turned aside into the parts of Galilee: 23 And he came and dwelt in a city called Nazareth: that it might be fulfilled which was spoken by the prophets, He shall be called a Nazarene. That time was the appointed time that the Jews should have understood as the time of the coming of the Messiah. But they did not.  DANIEL 9:24-26 24 Seventy weeks are determined upon thy people and upon thy holy city, to finish the transgression, and to make an end of sins, and to make reconciliation for iniquity, and to bring in everlasting righteousness, and to seal up the vision and prophecy, and to anoint the most Holy. 25 Know therefore and understand, that from the going forth of the commandment to restore and to build Jerusalem unto the Messiah the Prince shall be seven weeks, and threescore and two weeks: the street shall be built again, and the wall, even in troublous times. 26 And after threescore and two weeks shall Messiah be cut off, but not for himself: and the people of the prince that shall come shall destroy the city and the sanctuary; and the end thereof shall be with a flood, and unto the end of the war desolations are determined. All available unbiased and written history - biblical or otherwise -points to the son of Mary who lived on this earth 2,000 years ago as the MESSIAH! Jesus Christ lived during the incumbency of the fourth kingdom prophesied in the book of Daniel that is the Roman Empire.  We shift the scene to where a king was direly in need of someone to interpret his dream – a dream that was not only bizarre but also foreboding and he was much disturbed.  In Chapter 2 in the book of Daniel, King Nebuchadnezzar dreams of a statue with body parts made of different materials: (1) head of gold, (2) chest and arms of silver, (3) belly and thighs of bronze, and (4) legs of iron with feet of iron and clay.  DANIEL 2:32-35 32 This image's head was of fine gold, his breast and his arms of silver, his belly and his thighs of brass, 33 His legs of iron, his feet part of iron and part of clay. 34 Thou sawest till that a stone was cut out without hands, which smote the image upon his feet that were of iron and clay, and broke them to pieces. 35 Then was the iron, the clay, the brass, the silver, and the gold, broken to pieces together, and became like the chaff of the summer threshing floors; and the wind carried them away, that no place was found for them: and the stone that smote the image became a great mountain, and filled the whole earth. Daniel, then a prisoner, interprets these body parts as four kingdoms (verses 37-42): The Babylonian king Nebuchadnezzar is the head of gold. Chest and arms of silver convey that after Nebuchadnezzar an inferior kingdom shall arise. The belly and thighs of bronze point to a third kingdom that shall rule over all the earth. The legs of iron with feet of iron and clay is a fourth kingdom, strong as iron.  DANIEL 2:36-41 (KJV) 36 This is the dream; and we will tell the interpretation thereof before the king. 37 Thou, O king, art a king of kings: for the God of heaven hath given thee a kingdom, power, and strength, and glory. 38 And wheresoever the children of men dwell, the beasts of the field and the fowls of the heaven hath he given into thine hand, and hath made thee ruler over them all. Thou art this head of gold. 39 And after thee shall arise another kingdom inferior to thee, and another third kingdom of brass, which shall bear rule over all the earth. 40 And the fourth kingdom shall be strong as iron: forasmuch as iron breaketh in pieces and subdueth all things: and as iron that breaketh all these, shall it break in pieces and bruise. 41 And whereas thou sawest the feet and toes, part of potters' clay, and part of iron, the kingdom shall be divided; but there shall be in it of the strength of the iron, forasmuch as thou sawest the iron mixed with miry clay. But the feet and toes partly of potter’s clay and partly of iron show it shall be a divided kingdom – this fourth kingdom.  DANIEL 2:42 (KJV) And as the toes of the feet were part of iron, and part of clay, so the kingdom shall be partly strong, and partly broken. This fourth kingdom is foretold that “they shall mingle themselves with the seed of men: but they shall not cleave one to another, even as iron is not mixed with clay.” Why?  DANIEL 2:43 (KJV) And whereas thou sawest iron mixed with miry clay, they shall mingle themselves with the seed of men: but they shall not cleave one to another, even as iron is not mixed with clay. The Kingdom of Christ is also set up – one that shall break all these kingdoms of men – including this fourth kingdom.  DANIEL 2:44 (KJV) And in the days of these kings shall the God of heaven set up a kingdom, which shall never be destroyed: and the kingdom shall not be left to other people, but it shall break in pieces and consume all these kingdoms, and it shall stand forever. The fourth kingdom is the Roman Empire, symbolic of what will be the Catholic Church! Let us go further.  In Daniel 7 as support to Daniel 2, Daniel receives visions of four beasts coming out of the sea, as well as a vision of \"one like the Son of Man\" coming up to the Ancient of Days.  This time the fourth kingdom is more clearly zoomed into. It is a beast of 10 horns. Take note of the terms, “fourth beast,” “horn that had eyes and a mouth that spake very great things,” “the same horn made war with the saints,” and “until the Ancient of days came.”So this fourth beast cum kingdom would be having its field day of great power and glory until “the Ancient of days” will intervene. That is Christ.  DANIEL 7:19-22(KJV) 19 Then I would know the truth of the fourth beast, which was diverse from all the others, exceeding dreadful, whose teeth were of iron, and his nails of brass; which devoured, brake in pieces, and stamped the residue with his feet; 20 And of the ten horns that were in his head, and of the other which came up, and before whom three fell; even of that horn that had eyes, and a mouth that spake very great things, whose look was more stout than his fellows. 21 I beheld, and the same horn made war with the saints, and prevailed against them; 22 Until the Ancient of days came, and judgment was given to the saints of the most High; and the time came that the saints possessed the kingdom. To be continued. Be patient and you will come to know the true church of the Bible. ",
            "date": "Answered May 15, 2015",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jack Elphinstone",
                "href": "/profile/Jack-Elphinstone"
            },
            "answer_text": "*Coughing* *More Coughing**More coughing* *Coughing**Coughing* Yes. *Coughing**More coughing* *Coughing**More coughing* *Coughing* Sorry, I don't know what got over me then. I was just about to start typing when I had this tremendous fit. Please forgive me. Aside, I'm not a fan of Jesus. Or Christianity. Or any church. Particularly not the Catholic Church from which I can claim the title of apostate.  But even if I was a Jesus person, in their own book, he dies before anyone has built anything approaching such an institution. Beyond isolated little communities here and there, Catholicism only really came to materialize after it was adopted as the religion of the Roman empire. More than anything, the Romans/Roman Emperors built the Catholic Church. The only tangible line (that I know about) is where Jesus tells Peter that he will be the rock upon which he builds the church. (Mathew 16:18). So, even if the guy existed, at best I think you could say he commissioned it. If you like, he built the Church in Peter's head. If you wanted to push it you could say that he inspired everything through the spirit and was actively at work in the first followers/all followers. Whatever you want to believe I guess. Personally I sit with the line that he didn't exist at all, and thus could have built exactly nothing. But that's just me. A bitter juvenile Catholic apostate. Perhaps others will have other things to say. ",
            "date": "Answered May 15, 2015",
            "views": "124",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Frans du Plessis",
                    "user_href": "/profile/Frans-du-Plessis-1"
                }
            ]
        }
    ]
}