{
    "title": "Is it ok for north African people to say the N word? - Quora",
    "tags": [
        "Africans",
        "Black People",
        "Africa",
        "Racism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arslane Bensahli",
                "href": "/profile/Arslane-Bensahli"
            },
            "answer_text": "I think it's extremely disappointing to see people like you trying to demolish the bond that north Africans and the rest of Africa are trying to create. As an algerian, I consider myself as African as a Senegalese, a Somali or a Gabonese. If you would have done your research, you would have noticed that the majority of Algerian people (I'm taking Algeria as the exemple) descend from the indigenous tribes that existed before the Arabic conquest. Also, you would have known that slavery was common in Africa, was practiced by brown and black africans and it wasn't based on race. Black africans themselves would bring slaves to the Europeans so they could handle the rest. I am aware there is racism towards black people in North africa, (like there's colorism in the entire continent) and it really hurts me to see some of my people hate their own brothers, but please don't be foolish enough to think the majority of North Africans look down on the black population. People like you that are making assumptions and generalities are at the core of the communitarian problems existing in this continent. This has nothing to do with the n-word or wether or not we can say it. I love my continent, I love all the African people, I feel 100% african and no one will prevent me from being who I am and who we are. Weirdly, I haven't met one REAL African, as you like to call them, that ever told me I wasn't a real African as well. Nor did I meet a North African claiming he is something else than African. Very strange. ",
            "date": "Updated April 21, 2020",
            "views": "54",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Omimah Aboud",
                    "user_href": "/profile/Omimah-Aboud"
                },
                {
                    "user_id": "Marine Kdad",
                    "user_href": "/profile/Marine-Kdad"
                },
                {
                    "user_id": "SHEIKHWEST",
                    "user_href": "/profile/SHEIKHWEST"
                },
                {
                    "user_id": "Julian Ross",
                    "user_href": "/profile/Julian-Ross-35"
                },
                {
                    "user_id": "Jacques Verhaeghe",
                    "user_href": "/profile/Jacques-Verhaeghe"
                },
                {
                    "user_id": "Bryan Kalvari",
                    "user_href": "/profile/Bryan-Kalvari"
                },
                {
                    "user_id": "Jana Ahmed",
                    "user_href": "/profile/Jana-Ahmed-33"
                },
                {
                    "user_id": "Eileen Murphy",
                    "user_href": "/profile/Eileen-Murphy-54"
                },
                {
                    "user_id": "Asmae Sabab",
                    "user_href": "/profile/Asmae-Sabab"
                },
                {
                    "user_id": "Red Dahmani",
                    "user_href": "/profile/Red-Dahmani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peri Collins",
                "href": "/profile/Peri-Collins-1"
            },
            "answer_text": "Why are people obsessed with saying this “N-word” that they know is extremely hurtful to so many people? No. No. No. It is not okay. I don't want to hear it from anyone. I agree with the sentiments of Dr. Maya Angelou about it being it inappropriate for anyone to toss around. It is sewage no matter whose mouth spews it. It hasn't been “reclaimed” from its negativity by black people using it. Everyone just gets subjected to more of it. No Americans, no Africans, simply no one should speak that word! I don't wish to be assaulted by this type of verbal vulgarity daily. There are certain radio stations I actively avoid due to the repeated use of this word and other vulgar language demeaning women and diminishing those who use it as well. It is incredibly sad to me that some black people have jumped into the sewer with those who use this word as a weapon. No one has reclaimed guns so that they don't injure people when shot at them. Swords still stab and hack flesh. The N-word still causes harm to too many people whether they know it or not. A drug addicted person will do some debasing things to get their next fix, but if they are so far gone that they no longer think about the horror of their life does it make it any less awful? ",
            "date": "Updated October 16, 2020",
            "views": "92",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amber",
                    "user_href": "/profile/Amber-2266"
                },
                {
                    "user_id": "Raghib Hossain",
                    "user_href": "/profile/Raghib-Hossain"
                },
                {
                    "user_id": "Marylin Menhoe",
                    "user_href": "/profile/Marylin-Menhoe"
                },
                {
                    "user_id": "Furat Al Samaraie",
                    "user_href": "/profile/Furat-Al-Samaraie-1"
                },
                {
                    "user_id": "SaiRiss Reve",
                    "user_href": "/profile/SaiRiss-Reve"
                },
                {
                    "user_id": "Justin Gobel",
                    "user_href": "/profile/Justin-Gobel-1"
                },
                {
                    "user_id": "Manu Htide",
                    "user_href": "/profile/Manu-Htide"
                },
                {
                    "user_id": "Matthew Mann",
                    "user_href": "/profile/Matthew-Mann-72"
                },
                {
                    "user_id": "Hibatoullah Douche",
                    "user_href": "/profile/Hibatoullah-Douche"
                },
                {
                    "user_id": "Barry Bee Benson",
                    "user_href": "/profile/Barry-Bee-Benson-5"
                }
            ]
        }
    ]
}