{
    "title": "Is Islam an offshoot of Nestorian Christianity? - Quora",
    "tags": [
        "Islam",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Morrison",
                "href": "/profile/Steven-Morrison-17"
            },
            "answer_text": "Not at all. While Nestorian were culturally different, living in Asia, they affirmed the Council of Nicea. And even after Nestorius was kicked out of the orthodox church at the Council of Ephesus in 431 A.D., they later affirmed the 451 A.D. Council of Chalcedon (they did this at a Council between 531 and 544 A.D.). Their views on God, the Trinity, and the deity of Christ are the same as other Christians. Like all other Christians, they believe that Jesus died on the cross to pay for our sins, and that He bodily rose from the dead. They believed everything that eastern Orthodox, Roman Catholics, and even later Protestants held in common, except for two key differences. They believed that Christ had two distinct wills: human and divine. Also, they admired Theodore of Mopsuestia, a Pelagian, at the Nestorian Council of Jundish in 484 A.D. If you are interested in reading more about different Christian groups, you can see A Taste of Various Church Groups. So all Christian groups that follow the Bible believe that God is a Father, in a non-sexual sense. They believe there is one inseparable God, consisting of three distinct parts: Father, Son (Jesus) and the Holy Spirit. In stark contrast to this, Islam denies that God is a Father, in any sense of the word. They deny that Jesus is the Son of God. Most who call themselves Muslims (some ‘Alawites excepted) deny anything even approaching deity to Jesus. They do not believe the Holy Spirit is the Third Person of the Trinity, in fact they do not believe the Trinity. Islam is not any closer to Nestorianism, than it is to Coptic Christianity, eastern Orthodox, Roman Catholicism, Protestantism, or non-denominationals. Muslims deny that Jesus died on the cross, died for our sins, or rose fro the dead. But at least almost all who call themselves Muslims (Ahmaddiyas excepted) agree with Christians that Jesus was born of the virgin Mary, and that Jesus was sinless. They also believe that Jesus will return. You can read more at Sects of Islam ",
            "date": "Answered October 8, 2018",
            "views": "397",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maria Oorial",
                    "user_href": "/profile/Maria-Oorial"
                }
            ]
        }
    ]
}