{
    "title": "Is it true that hair and nails keep growing once you die? - Quora",
    "tags": [
        "Anatomy",
        "Nails (anatomy)",
        "Hair",
        "Death and Dying",
        "Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sharika Salimsha",
                "href": "/profile/Sharika-Salimsha"
            },
            "answer_text": "Your hearts stops, your blood goes cold and your limbs stiffen. Yet amidst the signs that you are no more, your fingernails continue to lengthen and your hair grows – or so we’re told. After death our heart stop beating and oxygen supply also stops because of this glucose also not stored , which cause nerve cell to die . In the case of finger nail , the new cells should be produced in order for the nails to grow and it can’t happen without glucose . Death put an end to the supply of glucose because of that nails also stop growing . Same condition for hair also . Each hair sits within a follicle that helps to grow . At the base of the follicle is the hair matrix, a group of cells that divide to produce the new cells that make hair strands longer. These cells divide very rapidly, but only when supplied with energy. This happen when the glucose is burned which require the presence of oxygen to complete it . When the heart stop beating the oxygen pumping is also stopped because of that energy supply dries up and so does the cell division that drives hair growth. So from this we can conclude that finger nails and hair won’t grow after a person is dead ",
            "date": "Answered January 2, 2018",
            "views": "126",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anisha Mandal",
                    "user_href": "/profile/Anisha-Mandal-11"
                },
                {
                    "user_id": "Priyanshu Yadav",
                    "user_href": "/profile/Priyanshu-Yadav-133"
                },
                {
                    "user_id": "Sidhu",
                    "user_href": "/profile/Sidhu-54"
                },
                {
                    "user_id": "Elle Hampton",
                    "user_href": "/profile/Elle-Hampton-1"
                },
                {
                    "user_id": "Hermine S",
                    "user_href": "/profile/Hermine-S"
                },
                {
                    "user_id": "Laura Lee Mason",
                    "user_href": "/profile/Laura-Lee-Mason"
                },
                {
                    "user_id": "Ahmad Qadri",
                    "user_href": "/profile/Ahmad-Qadri-3"
                },
                {
                    "user_id": "Sabin Blejusca",
                    "user_href": "/profile/Sabin-Blejusca"
                },
                {
                    "user_id": "Arrel Tidwell",
                    "user_href": "/profile/Arrel-Tidwell"
                },
                {
                    "user_id": "Tom Knudsen",
                    "user_href": "/profile/Tom-Knudsen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Franc Neary",
                "href": "/profile/Franc-Neary"
            },
            "answer_text": "No! Within a short time after oxygen has ceased to be available for the normal vital cellular processes, all such processes will stop (some will stop a little later than others but generally you could say in a short period there are no signs of any cellular activity or processes (i.e. death has occurred). Legal interpretations of death notwithstanding most professionals could conclude that, for example, two days after a person's has ceased to breathe, there simply isn't a discussion/debate! There is a MYTH that when bodies are exhumed and coffins are opened that hairs and nails attached to the body appear to have elongated or \"grown\" but this can be explained by the slight delay in the cellular death of cells in extremities like fingers or skin and for the shrinkage of tissues, again like skin, due to dehydration for example and the nails and hairs are extruded thereby giving the appearance that they have continued to grow. ",
            "date": "Answered January 12, 2019",
            "views": "429",
            "upvotes": "0"
        }
    ]
}