{
    "title": "Is it possible to have one world government? - Quora",
    "tags": [
        "United Earth Government",
        "Global Governance",
        "Government",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Short",
                "href": "/profile/Dan-Short-24"
            },
            "answer_text": "What would it take to make a “One World Government”? Interesting that the question of total absurdity seems to be repeated on some continuum without reprieve. In the 17th century, Immanuel Kant made this remarkable conclusion that every effect is motivated by an initial cause. When one even takes some journey into fantasy…such as all men are the same…refutes the known reality, no they are not. First all men would have to be automatons and the very foundation of what man is identified….Homo sapiens…dismissed. For as a Homo sapient, there are two identifiable constructs in that identification, free choice, and abstract thought. If you have individual thought, you will never have all comply, except at the communist and the islamics do, kill those who do not submit and obey. Currently in the world at large is the reality that one nation, and one nation only…even though they have done such absolutely ignorant actions…standing against the totalitarian sovereignty of enslaving all of mankind, under one world dictatorship, is America. The efforts to destroy America and have it ‘submit and obey’ reject individual rights, natural rights, and the independence of man, can be analyzed and considered. From that each and every individual…if you have not been indoctrinated in accepting the collective…can then begin the requirement of applying your own knowledge, what you have for logic, and your individual reasoning. As reasoning is one of the things, that must be destroyed, where does on start? Reason requires knowledge…and the logic of each individual built up the ethnicity, the standards, of each and every one of us, and the society in which we have matriculated. So from conclusion these are the two areas under attack in America. First, you must destroy the logic…the very ethnicity of the society. In America, it is a Protestant Christian foundation, so what has been the attack of those who would fundamentally transform this nation? The answer is obvious, a coalition between the current papist pope, rejecting Christianity, and the idiotology of mohammadism, the antithesis of civilized society advanced by the civil rights of government. The other requirement, destroy the knowledge, the what was once the intellect of our nation, now the indoctrination of our academic environment. How was that accomplished, using civil rights, and advancing egalitarianism, then it was not the fundamental transformation of academia from gaining knowledge, to gaining indoctrination to comply with the demagoguery, the dogma, of some fiction of fantasy rejecting reality. Example, we don’t teach the wonder of America’s history, but now we teach the failure of all other societies, and call it history. As long as man thinks, there will never be one construct that works for all, while still preserves the liberty of all men. This idea, tried once in the Articles of Confederation in America…but lacking angels to administer it…was rejected and allowing men to be government, playing god little (g) on earth, creates what government always creates, tyranny. The why is obvious, as for a reason that God placed all races in different places, it is or should be, obvious that all men, and all groups of men are different, and as such, they view the ethnicity, the mores of what they accept, or wish for their society differently. The prime example, only the White English Anglo-Saxons ever conceived building a society with the basis of ‘Liberty’ while no other society, never in the empirical history of mankind even made it…LIBERTY…a consideration. For those who accept this foundation, it would be difficult to them accept some central planning of communism, islamism, or any other slavery of man. The idea of different nation, and different mores, morals, and faiths, as Montesquieu in the 17th century identified is as true today, as when he made his observation. ",
            "date": "Answered May 2, 2019",
            "views": "364",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sam Qwato",
                "href": "/profile/Sam-Qwato"
            },
            "answer_text": "Q. What is the possibility of there ever being a world government? (1) Short answer: Never say never.Very, very low possibility.Because of the highly onerous necessary and sufficient conditions.Based on current global sentiments (Brexit, rise of Nationalism, Alt-Right, Trump’s America First, Catalan crisis), the outlook is dank.(2) If there is ever a so-called One World Government (OWG), it won’t be a situation where, suddenly, all countries had a simultaneous global epiphany overnight, that it’s a great insight, and then lets-do-it. (3) These’re the run-up necessary conditions, and steps. The EU gets past the current Brexit and populist nationalism psyche phase. The EU is a mini, forerunner, test case, an OWG of sorts. If the EU is not holding up, and strengthening, we can forget the larger OWG concept.In a similar vein to the EU situation above, the world at large gets past the current populist anti-globalization, nationalist mental block. Right now, as of 2017, it doesn’t look good. The Alt-Right, Trump phenomenon, Bernie Sanders phenomenon, Marine Le Pen, nationalist parties, NAFTA renegotiation, Catalan independence agitation (as of Nov 2017). A hairball.The globalization modus operandi to-date is not working well. Countries benefit from globalization in aggregate. But, there is simmering injustice in the unwieldy undergrowth. The winners of globalization such as young, educated, skilled, urban professionals lap up the benefits, but carry none of the economic and social costs. The losers of globalization, such as lower-educated, lower-skilled, older, rural folks suck up all the costs, get the short shrift, get shafted, enjoy minimal incidental benefits. OWG is bigtime ambitious globalization. If large swathes of the population are disenfranchised, the system can’t be sustained. There has to be more equitable sharing of the benefits and costs to make globalization hum on an even tone.Assuming we get past the above EU, populist, nationalist, globalization winners-vs-losers sentiments and challenges, there’re are more EU-like entities, e.g. in South East Asia (ASEAN), North East Asia, Latin America, Africa. These are consolidated Lego-like building block modules to eventually compound into a larger monolithic OWG.It’s in the nature of humanity that people will voluntarily favor collectivism, buy-in to the sum of the parts is synergistically larger than the whole, when there is relative broadbased prosperity. Self-evidently, people want to share prosperity, not share shit. There must be an enough fund of prosperity to go round for sharing. E.g. the EU was born in an era of high Western European prosperity. Thus, the OWG will only happen when swimming in a similar sea of global prosperity. Prosperity papers over differences. It lubricates the massive challenges involved in negotiations, resolving differences, making the OWG a reality.",
            "date": "Answered November 13, 2017",
            "views": "1",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dillon Laishram",
                    "user_href": "/profile/Dillon-Laishram"
                },
                {
                    "user_id": "Andrew Brown",
                    "user_href": "/profile/Andrew-Brown-20"
                },
                {
                    "user_id": "Gabe Gronlund",
                    "user_href": "/profile/Gabe-Gronlund"
                },
                {
                    "user_id": "Isaac Nelson",
                    "user_href": "/profile/Isaac-Nelson-12"
                }
            ]
        }
    ]
}