{
    "title": "Is it true that the French resistance movement was one of the least effective during WW2? - Quora",
    "tags": [
        "French Resistance (WWII)",
        "World War II",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Harker",
                "href": "/profile/Steven-Harker-4"
            },
            "answer_text": "When compared against which other resistance movements? I don’t think that the French resistance movement was quite as effective as post WW2 history would perhaps have us believe. it was also patchy but that is not to say that collectively it did not play an imporant part. It should be remembered that up to june 6th 1944, there wasn’t a lot of point for the French to be particularly active in resisting the German forces. All it was likely to do was cause a lot of grief for everybody. after all it wasn’t like carrying out resistance was going to make the germans pack up and go home. Germany shipped out many thousands of French men as forced labour who could also act as hostages. Whilst the general perception is that up the June 1944 France was an easy gig for German soldiers (certainly when compared to the eastern front), this is not to say that Grman security forces did not come down very hard on the populace for any acts of sabotage, however minor. Neither was France put in the position of nothing to lose/fight or die that some other occupied countries faced. Things were a bit different in Vichy France and I have to wonder how much the resistance was motivated by anti German or anti vichy sentiments. Following D-day there were “risings” of French resistance groups and whilist they caused a lot of distruption to german communications and logistics (Notably delaying the advance of the 2nd SS panzer division, as it moved to oppose the D-Day landings) this was done at a terrible cost with whole villages being decimated in retaliation for resistance attacks. The worst being the macasacre at the village of Oradour-sur-Glane. If this is an attempt to sneak in a bit of French bashing, you really need to go look up the history. ",
            "date": "Answered August 21, 2020",
            "views": "1",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Valentine",
                    "user_href": "/profile/Chris-Valentine-30"
                },
                {
                    "user_id": "Jeremie Le Guen",
                    "user_href": "/profile/Jeremie-Le-Guen"
                },
                {
                    "user_id": "Ludivine Reynaud",
                    "user_href": "/profile/Ludivine-Reynaud"
                },
                {
                    "user_id": "Ben Crook",
                    "user_href": "/profile/Ben-Crook-6"
                },
                {
                    "user_id": "John Fox",
                    "user_href": "/profile/John-Fox-358"
                },
                {
                    "user_id": "Merrill Russell",
                    "user_href": "/profile/Merrill-Russell-1"
                },
                {
                    "user_id": "Bruce Cain",
                    "user_href": "/profile/Bruce-Cain-5"
                },
                {
                    "user_id": "N Maccallan",
                    "user_href": "/profile/N-Maccallan"
                },
                {
                    "user_id": "Zachary Taylor",
                    "user_href": "/profile/Zachary-Taylor-3"
                },
                {
                    "user_id": "Bill Remer",
                    "user_href": "/profile/Bill-Remer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jihoon Seo",
                "href": "/profile/Jihoon-Seo-3"
            },
            "answer_text": "The effect was disappointing. Here are some reasons why. Politically Diverged Communists, De Gaullist, Catholic Conservatives, Liberals, Moderate Socialists, you name it. The key ideology of French resistance differed too much and due to the over-diversity, each resistance forces combatted against themselves, maybe not directly, but they prevented other resistance forces from taking Allied supplies, hampered their operations. The Communists especially, who were more for the Soviets and was against the De Gaullists who were the primary force of Free France was dubious with its effectiveness. Even communists fight against other communist. Trotsky communists, Stalinists there were a lot. Here are some resistances. BCRA, CNR, FTPF, Brutus Network, Dutch-Paris, Marquis, FTP, FFI, APA, AS, BOE, ETA, CAD, CAS, CE, CFC, CNR, FN, FANA, GF, JAC, JIC, LSGD, MCF, SAP, OCM, TSI… and probably I should stop. Dispersed The French Resistances were not coordinated by a single government or a leader. The Free French Government in Britain didn’t take full control of the Resistance, but each force had independence in movement. If Paris was not occupied by the Germans, Paris could be used as a form of centralization, but it was under heavy guard and suppression by the Germans. Anybody who is suspicious could be executed at once.  Here is a video of occupied Paris. Just for some side information. Due to that, the Resistance forces were all around the countryside of France. Because of lack or, often times, no communication, each Resistance group couldn’t go into a coordinated attack, actually cutting German railway and taking out detached groups effectively. Under-Trained Soldiers The countryside of France is not like the countryside of America. Normal peasants were not expert marksmen, and though some were talented and was experienced, sometimes escaped French army prisoners joined, the vast majority of soldiers were untrained. Not only that the quality of weapons were very low. I believe you will know this famous pistol.  FP-45, aka, Liberator. A lot of the dropped weapons of the Allies were meant to be used temporarily, to kill a German and take his equipment, rather than in use for prolonged fire fights. How rubbish this pistol was, this video will tell you.  Low quality weapons+Under-trained soldiers=less effective military force German Suppression Reprisals after founding a Resistance troop was heavy. Execution of the individual was obvious, the families of the individual together. Many times, the town where the individual lived or if seen suspicious to be a headquarter of a resistance force, the entire town was burnt, the inhabitants left abandoned or executed as well. Due to that, many French people who wanted to live in safety didn’t want their sons and husbands to be in the Resistance. They wanted to live quietly and outside of German suppression. This also lead to a lot of Frenchmen cooperating to the Germans, but that is a different topic. Though the German suppression and reprisal towards the Resistance was extremely inhumane and shall be condemned, it is true that it was effective in short terms. Conclusion The Resistance was effective in certain areas. Most famously, before Normandy. However, in general there effect was dubious and later on, the Allies slowly supplied them less due to the reason. It is hard to say if they were the least effective, but they weren’t very effective in every circumstances for sure. ",
            "date": "Answered August 21, 2020",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Juan Marquez",
                    "user_href": "/profile/Juan-Marquez-189"
                }
            ]
        }
    ]
}