{
    "title": "Is it true that the majority of people in Eastern Europe miss communism? - Quora",
    "tags": [
        "Communists",
        "Eastern Europe",
        "Communism",
        "Europe",
        "Government"
    ],
    "response": [
        {
            "author_info": {
                "name": "Norbert Szczęch",
                "href": "/profile/Norbert-Szczęch"
            },
            "answer_text": "Thanks for the A2A Nicholas Morrison. I can answer in regard to Poland as a Central European country. It’s not true. Before Poland joined the EU and Poles were allowed to work in other member countries, there were millions of people who were convinced that life before 1989 was better. They didn't miss the regime in any political, ideological or philosophical way but only in economical sense. Everybody had a guarantee of having a job, nobody was starving, people weren't evicted on a sidewalk. Those people couldn't accept challenges of the free market economy and reality of being left alone by the liberal democracy. After joining the EU, most of young unemployed people emigrated abroad, elders were widely supported by the young or emigrated themselves, farmers vastly improved their situation. There was still a huge area of poverty and dissatisfaction, but this issue was successfully dealt with by the currently ruling party which introduced welfare state in Poland. Thus the famous Polish saying “Za komuny było lepiej” - It was better off under Communism - evolved from a dead serious statement, through a form of a ritual national grumble, to the something so completely outdated and ridiculous, that is invoked almost exclusively in a satirical, sarcastic, joking manner. There are surely some people for whom this above mentioned saying rings true. Those are tens of thousands or maybe even hundreds of thousands of the former regime political activists, officials, intelligence officers and the like - who surely miss communism/socialism, as they were in power and lived a good life. They are however nothing but a tiny minority comparing to the whole nation. |Lucky| ",
            "date": "Answered July 8, 2019",
            "views": "11",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vladimír Galla",
                    "user_href": "/profile/Vladimír-Galla"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-4491"
                },
                {
                    "user_id": "Robby Shima",
                    "user_href": "/profile/Robby-Shima"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Caslonc Cas",
                    "user_href": "/profile/Caslonc-Cas"
                },
                {
                    "user_id": "Ron Ralston",
                    "user_href": "/profile/Ron-Ralston-1"
                },
                {
                    "user_id": "Symon Jemčenko",
                    "user_href": "/profile/Symon-Jemčenko"
                },
                {
                    "user_id": "Trevor Woodhams",
                    "user_href": "/profile/Trevor-Woodhams"
                },
                {
                    "user_id": "Robert Hafer",
                    "user_href": "/profile/Robert-Hafer"
                },
                {
                    "user_id": "Radek Gliniecki",
                    "user_href": "/profile/Radek-Gliniecki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ardi Kule",
                "href": "/profile/Ardi-Kule"
            },
            "answer_text": "They don't miss communism. Some of them miss certain aspects of the social system like free housing, healthcare and education, lifelong security and a guaranteed job. Many people like to have things taken care for them by the state, especially once they've tried it. Not everyone likes capitalism. Capitalism is full of insecurities and risks. You can never feel secure. You could however never worry about anything under socialism as long as you didn't do politics. Unlike what people in the west believe, “communist” states were not all about suffering and oppression. Most of the time life was just boring and uneventful. If you wanted, you could literally spend all your life worry free and cared for (living a relatively simple life) and never suffer anything. ",
            "date": "Updated August 2, 2019",
            "views": "264",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "José Jaimes",
                    "user_href": "/profile/José-Jaimes-1"
                },
                {
                    "user_id": "Vladimír Galla",
                    "user_href": "/profile/Vladimír-Galla"
                },
                {
                    "user_id": "Cristian Malide",
                    "user_href": "/profile/Cristian-Malide"
                },
                {
                    "user_id": "Robby Shima",
                    "user_href": "/profile/Robby-Shima"
                }
            ]
        }
    ]
}