{
    "title": "Is it true that there were twice as many Irish slaves as African slaves shipped to the US? - Quora",
    "tags": [
        "Irish Slavery",
        "Slavery",
        "African Americans"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Dewar Gleissner",
                "href": "/profile/John-Dewar-Gleissner"
            },
            "answer_text": " It depends upon how you define the word “slave.” I researched slavery in the USA for 3 years and never found any solid evidence that the Irish, white people, were chattel slaves. Many were transported as punishment and became indentured servants. Irish transported to tropical climates did not survive as well as African slaves. Cromwell mistreated and killed many Irish a long time ago. Most of the Irish transported were indentured servants for some term of years, usually 4 years, plus or minus 2 years, although periods of indenture could vary more widely. Further, indentured servants in the 13 Colonies or USA, including the Irish, were sometimes called “white slaves,” even though they were due to be freed in a few years. In practice, many indentured servants were treated worse or no better than slaves of African descent while they were under their indenture. Part of the reason our knowledge of “white slaves” in the USA is so cloudy is because indentured servants after completing their indenture chose to forget their indentured service, did not leave any records of their indenture and often chose not to tell their neighbors, friends or children. The indenture usually arose from an embarrassing criminal sentence. If an American has English, Scottish or Irish ancestors and does not know how, when or where they came to America, the chances are very good that they were indentured servants transported to America as part of a criminal sentence. Indentured servants tended to prosper after their indenture expired, and some even married into the families they served. Now … there is evidence that Irish in America were not valued as much as African American slaves. Here is a paragraph from Prison & Slavery - A Surprising Comparison, used with the permission of the author and without footnotes in this Quora answer: ““Slaves knew that they were valuable people, and they said so among themselves.” [Frederick Law] Olmsted heard about their value. “Negro hands were sent to the top of the bank, to roll the bales to the side, and Irishmen were kept below to remove them, and stow them. On asking the mate (with some surmisings) the reason of this arrangement, he said, \"The [slaves] are worth too much to be risked here; if the Paddies are knocked overboard, or get their backs broke, nobody loses anything!\"” In other words, slaves did not always work the most dangerous jobs. Slaves commonly told jokes about “numskull” Irishmen, and African-Americans continued doing so into the twentieth century.” Many thousands of Irish were shipped to America as indentured servants. We don’t know the number of Irish shipped to the USA or 13 Colonies as indentured servants, but their numbers are not likely twice the number of slaves from Africa.  ",
            "date": "Updated November 24, 2019",
            "views": "697",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike Stanton",
                    "user_href": "/profile/Mike-Stanton-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "It is not true. There were no Irish slaves. There is a myth making the internet rounds that the colonies were filled with Irish slaves but it’s completely without foundation. Like impoverished people of other nationalities, many emigrated from Ireland to the Americas in the 17th and 18th centuries as indentured servants; a smaller number were forcibly banished into indentured servitude during the period of the English Civil Wars; indentured servants often lived and worked under harsh conditions and were sometimes treated cruelly. Unlike institutionalized chattel slavery, indentured servitude was neither hereditary nor lifelong; unlike black slaves, white indentured servants had legal rights; unlike black slaves, indentured servants weren't considered property. A facet of U.S. history largely unfamiliar to Americans themselves is the role of indentured servitude in the survival and growth of the original 13 colonies. The earliest settlers needed laborers, but only wealthy people could afford passage to the New World. This led to a system whereby those who lacked means were brought from Europe under contract to work off their passage, room, and board over a period of two to seven years, until they were considered to have earned their freedom. No fewer than half of the immigrants who came to the New World during the colonial period arrived as indentured servants. Among the many thousands of impoverished Europeans brought over in this fashion were men, women, and children from England, Ireland, Scotland, Germany, and elsewhere, but over the intervening centuries the notion has arisen that the Irish, in particular, were shipped to the New World as \"white slaves.\" In fact, according to an article first published on the Internet in 2008 and endlessly recirculated since, Irish slaves were not only common in early America, they were more common than African slaves, and often treated more harshly. The article making these claims is usually credited to an individual named John Martin, who, in turn, found most of his \"facts\" in a 2003 article by James F. Cavanaugh called \"Irish Slaves in the Caribbean.\" It has gone by many names, but as of mid-2016, the most shared version of the Irish slave narrative was entitled \"Irish: The Forgotten White Slaves,\" and posted under the byline of a man named Ronald Dwyer. Woven throughout is the implication that the reason so few Americans know anything about the so-called \"forgotten\" history of Irish slavery is that it has been excluded from \"biased\" history books. Were There Irish Slaves in Early America? ",
            "date": "Answered October 29, 2016",
            "views": "19",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael McGonagle",
                    "user_href": "/profile/Michael-McGonagle-7"
                },
                {
                    "user_id": "Elizabeth Mead",
                    "user_href": "/profile/Elizabeth-Mead-1"
                },
                {
                    "user_id": "Wes Frank",
                    "user_href": "/profile/Wes-Frank-2"
                },
                {
                    "user_id": "Ken Fishkin",
                    "user_href": "/profile/Ken-Fishkin"
                },
                {
                    "user_id": "Chris Hughes",
                    "user_href": "/profile/Chris-Hughes-421"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Kathryn Berck",
                    "user_href": "/profile/Kathryn-Berck-3"
                },
                {
                    "user_id": "Bart Loews",
                    "user_href": "/profile/Bart-Loews"
                },
                {
                    "user_id": "James Henry",
                    "user_href": "/profile/James-Henry-124"
                }
            ]
        }
    ]
}