{
    "title": "Is Muhammad Ali the greatest heavyweight boxer ever? - Quora",
    "tags": [
        "Boxing Greats",
        "Muhammad Ali (boxer)",
        "Boxers (sport)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Khela",
                "href": "/profile/Dave-Khela"
            },
            "answer_text": "well from what i have seen over the past half century with my own eyes, ide have to say without a shadow of a doubt, YES . he fought All and Everybody. Cant think of anybody that Ali did not fight when he was boxing.. Won against the best boxers at the time and it spanned into two decades, including the Golden Age as well. Lost a couple, but faced Everybody.. Nobody comes close. NoBody. Moore, Patterson, Liston, Williams, Frazier, Foreman, Norton.. I mean to add Lyle, Quarry, Foster, Folley, Ellis, Chuvalo, Bonavena and Shavers. .. Name anybody that has that in their resume. NONE. Nobody comes close. NOBODY.. Not even Sugar Ray Robinson Foreman was at the primest of his prime. . Liston just used Patterson as a mop twice. . Shavers was at his peak. . Jimmy Young was a masterful boxer who beat Foreman.. Ali faced All styles . All up and coming fighters. . All the Heavy Punchers, those that were feared and heavily favored to knock his ass out, he Beat. No catchweight, no rediculous stipulations, no 'home' arena and fans didn’t have to wait years before the fight to happen.. That's Greatness. If you were chosen by the Universe to take boxing to Levels it's never been taken before with hand speed, hand eye coordination, the best footwork of All, better than any Heavyweight that came before or after and made it possible to earn million dollar purses for All fighters today, then you are the Greatest without even having to debate .  ",
            "date": "Answered April 27, 2019",
            "views": "23",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lloyd Salcedo",
                    "user_href": "/profile/Lloyd-Salcedo"
                },
                {
                    "user_id": "Krishnasamy Sankar",
                    "user_href": "/profile/Krishnasamy-Sankar"
                },
                {
                    "user_id": "Jawad Akram",
                    "user_href": "/profile/Jawad-Akram-9"
                },
                {
                    "user_id": "Steve Pierce",
                    "user_href": "/profile/Steve-Pierce-13"
                },
                {
                    "user_id": "Michael Rawiri",
                    "user_href": "/profile/Michael-Rawiri"
                },
                {
                    "user_id": "Tony Heiberg",
                    "user_href": "/profile/Tony-Heiberg"
                },
                {
                    "user_id": "Mark Jones",
                    "user_href": "/profile/Mark-Jones-867"
                },
                {
                    "user_id": "Moody Sabet",
                    "user_href": "/profile/Moody-Sabet"
                },
                {
                    "user_id": "Steve Cody",
                    "user_href": "/profile/Steve-Cody-8"
                },
                {
                    "user_id": "Brian Reynolds",
                    "user_href": "/profile/Brian-Reynolds-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samuel Inbaraja Sundar",
                "href": "/profile/Samuel-Inbaraja-Sundar"
            },
            "answer_text": "Let us look at the statistics Top 10 boxers by most KOs Billy Bird (138)[7]Archie Moore (132)Young Stribling (129)Sam Langford (128)Buck Smith (120)Kid Azteca (114)George Odwell (111)[8]Sugar Ray Robinson, Alabama Kid (108)[9]Peter Maher (107)Sandy Saddler (103)No M. Ali in the list. Top 10 boxing champions (including interims) by KO % Inactive National Boxing Association, World Colored Boxing Championship as well as list on List of current world boxing champions and European Boxing Union. Edwin Valero, Artur Beterbiev (100%)Deontay Wilder (97%)Gervonta Davis, Ángel Acosta (95%)Jonathan Guzmán, Anthony Joshua (boxer) Daniel Dubois (92%)Carlos Zarate, Dmitry Kudryashov, Yunier Dorticos, LaMar Clark (90%)Rocky Marciano, Wilfredo Gomez, Aaron Pryor, Laila Ali, Gary Mason (88%)Vitali Klitschko, Gennady Golovkin, Errol Spence Jr., Naoya Inoue, Jaime Munguia (87%)Khaosai Galaxy (86%)Eduard Troyanovsky, Oleksandr Gvozdyk, Gerald McClellan, Miguel Berchelt, In-Chul Baek, David Benavidez (85%)Naseem Hamed, Alfonso Zamora, Frank Bruno, David Haye, George Foreman, Alberto Machado (84%)No M. Ali in this list either Longest reigning Boxing Champion - M. Ali not the first in this either. Wladimir Klitschko12 years, 0 months, 0 days 4 382 days 2. Joe Louis 11 years, 8 months, 8 days 4 270 days 3. Muhammad Ali 9 years, 5 months, 5 days 3 443 days What was it that M. Ali did that made people believe that he is the greatest? The stats for performance does not point towards Ali as the greatest boxer of all time. He might have been when he was the champion. His trash-talking would have made him even more popular and his popularity and the power to draw crowds for his matches and TV shows was phenomenal. Though he was a good boxer. Even the best when he was the champion, he is not the greatest of all boxers. There is no objective consensus as to who is the greatest boxer of all times. But certainly, M. Ali was good at PR and he ‘is’ perceived as the greatest just because of his PR skills and the reputation he built on and off his stage. “Muhammad Ali's fights were some of the world's most-watched television broadcasts, setting television viewership records. His most-watched fights drew an estimated 1–2 billion viewers worldwide between 1974 and 1980, and were the world's most-watched live television broadcasts at the time.” Who does qualify for the the list of greatest? Rocco Francis Marchegiano (September 1, 1923 – August 31, 1969), best known as Rocky Marciano (/mɑːrsiˈɑːnoʊ/), was an American professional boxer who competed from 1947 to 1955, and held the world heavyweight title from 1952 to 1956. He is the only Heavyweight champion to have finished his career undefeated.His six title defenses were against Jersey Joe Walcott, Roland La Starza, Ezzard Charles (twice), Don Cockell and Archie Moore. 2. Wladimir Klitschko - Longest reigning champion 3. Vitali Klitschko (right) retired as champion in 2005. Following his retirement, the WBC conferred \"champion emeritus\" status on Klitschko, and assured him he would become the mandatory challenger if and when he decided to return Mohammad Ali may have been the best when he was the heavyweight champion, but the talk of being the greatest is just PR and there is no statistics to back it up.  ",
            "date": "Answered December 15, 2019",
            "views": "433",
            "upvotes": "0"
        }
    ]
}