{
    "title": "Is Napoleon Bonaparte the greatest general in history? If not, who is? - Quora",
    "tags": [
        "Napoleon Bonaparte",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Schauss",
                "href": "/profile/Mark-Schauss"
            },
            "answer_text": "No, he made many tactical mistakes in his career, especially towards the end. I will give you two names that I believe were superior, and they were both undefeated. The first is Alexander Suvorov who was a generalissimo of the Russian Empire. He led his soldiers into almost 100 battles and never came away with a loss. Not only that, but his men loved him because he cared about their health and well being. The second is Khalid ibn al-Walid who was the leader of Muslim forces from between 632–638. Without his brilliant leadership, it is possible that Islam would not have made it out of Arabia. He often times was vastly outnumbered but he would still win battle after battle, never having been defeated. Others that I would take over Napoleon are Alexander the Great, Julius Caesar, and Hannibal. ",
            "date": "Answered March 28, 2019",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sergei Ivã-Nicolai Romanov",
                    "user_href": "/profile/Sergei-Ivã-Nicolai-Romanov"
                },
                {
                    "user_id": "April Harding",
                    "user_href": "/profile/April-Harding-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarbojoy Saha",
                "href": "/profile/Sarbojoy-Saha"
            },
            "answer_text": "Well there are several people worthy of this title. From Hannibal, to Spartacus, to Caesar and finally Napoleon himself. But,perhaps there was never and will never be another Alexander the Great. From Greece to India,he came everywhere. And from a Macedonian king,he became so much more. And at such a young age. He never lost a major battle. He came a king,and died like one too. Napoleon was also one of the greatest generals of all time,but some of his decisions were questioned by even his own men, especially the invasion of Russia. And he lost a few battles,and that’s completely natural for a general. But,his one mistake cost him dearly. ",
            "date": "Answered September 11, 2018",
            "views": "794",
            "upvotes": " Answer requested by John Dewar Gleissner"
        }
    ]
}