{
    "title": "Is nationalism more predominant in Slavic countries, than in germanic for example? - Quora",
    "tags": [
        "Politics of Europe",
        "Nationalism",
        "Europe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Max Sabbatic",
                "href": "/profile/Max-Sabbatic"
            },
            "answer_text": "If we would judge by these countries that are members of EU, then definitely Germanic countries commit more hate crimes, crimes based on ethnic origin, or even perceive the discrimination as more widespread.  UK is germanic, Germany is Germanic, and Sweden is Nordic, which appeals also to be Germanic. Then is France and Spain which are Romance Countries. And finally here comes Poland. That means, that hate crimes are more widespread and intensive in three germanic countries, and two romance countries within EU, and then first of Slavics appears. Even rating by hate crimes per capita, it would make us just realize how British nasty are.  The answer is the nationalism, is less predominant in Slavic countries, than in Germanic, or Romance countries. This applies to the countries that are members of European Union. Simply: there is more nationalism in Germanic or Romance Countries than in Slavic. Source: What are the current statistics on race related attacks… ",
            "date": "Answered February 1, 2019",
            "views": "375",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jiri Bayer",
                    "user_href": "/profile/Jiri-Bayer"
                },
                {
                    "user_id": "Goran Arsic",
                    "user_href": "/profile/Goran-Arsic-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kolton Mitchell",
                "href": "/profile/Kolton-Mitchell"
            },
            "answer_text": "I dont think so.....  Im going with Anglo Saxons..... they are a Germanic people that I can personally attest for. ( well some of them anyways )  Think about the US.... yes we are mixed country but its a Anglo Saxon culture.  We are the most nationalistic people on the planet. Hands down.  We have almost no history in comparison to most of the world. We came over on a boat... we stole some land... killed some proud native americans.... farmed... ranched.... fought a couple wars.. took advantage of all the stolen land we now had....  helped our allies out in ww2. Took 90% of the credit for 30% of the work. Now its 2015 and we are still riding off the glory of that victory!  Slavs have alot to be proud of.... living on the frontier of Caucasian territory through out their history.  A lesser people might of completely. They faced down many great empires and out lasted them.  Yet.... they still dont brag as much as my fellow Americans.  So.... to answer your question.      Nope. ",
            "date": "Answered November 28, 2015",
            "views": "447",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jani Mäkinen",
                    "user_href": "/profile/Jani-Mäkinen-3"
                }
            ]
        }
    ]
}