{
    "title": "Is New Orleans still affected by Katrina? - Quora",
    "tags": [
        "Hurricane Katrina (2005)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guy Rich",
                "href": "/profile/Guy-Rich-9"
            },
            "answer_text": "Carl Backes bears a long standing hatred of New Orleans, and he stalks it online constantly. By the dates he ran like a rabbit and never came back. Most of the city is entirely recovered from Katrina, indeed, it is very much better than before. Certainly my house, my neighborhood, and my friends are happy and much better off. Covid19 is a hard blow, but that is so everywhere. A handful of outlying neighborhoods, particularly those outside of hurricane protection, lag in improvement. This is because they were already not great places to live, and Katrine made their vulnerability very clear. Perhaps Carl lived in one of these (the 9th Ward, New Orleans East, etc.). The proper word is affected. If the city were effected by Katrina, that would mean that Katrina brought it into being. While it brought into being the great improvements that have occurred, the city was already here for nearly 300 years. ",
            "date": "Answered April 22, 2020",
            "views": "48",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elise Leslie",
                    "user_href": "/profile/Elise-Leslie"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                },
                {
                    "user_id": "Victoria Nicholson",
                    "user_href": "/profile/Victoria-Nicholson-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Williams",
                "href": "/profile/Kelly-Williams-495"
            },
            "answer_text": "Yes. The city has mostly been rebuilt, but the landscape has changed in that the makeup of its residents are different. There is a huge problem with gentrification and that is slowly eating away at the culture of the city. It’s really expensive to live here. It wasn’t that bad before the storm. I also believe that Katrina made a lot of people “hard”. You can’t go through something like that without being changed. But, New Orleans is still like no other place on the planet. And for that reason, I will never move. ",
            "date": "Answered May 12, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Andreas Hedkins",
                    "user_href": "/profile/Andreas-Hedkins"
                }
            ]
        }
    ]
}