{
    "title": "Is Napoleon Bonaparte the greatest strategist in war history? - Quora",
    "tags": [
        "Napoleon Bonaparte",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Wilson",
                "href": "/profile/Thomas-Wilson-388"
            },
            "answer_text": "The reason Napoleon is regarded as one of the greatest generals is not just because of his mastery of the operation level tactics, but because he invented the level of operational tactics. Before him, most people worked from strategy straight into tactics, which meant marching together and then fighting separately. Commanders such as Marlborough and the Frederick the Great pulled of great tactical masterpieces such as flanking movements, ambushes, and general small-scale things conducted in a single day, on the battlefield. Any strategy those generals had was mostly incompatible with the tactics. They would march at the enemy, camp before him on the battlefield, and then start any maneuvers and tactics the next day, during the battle. Napoleon’s armies, however, marched separately and fought together. His corps system meant he marched spread across the landscape and could fling his armies around the enemy almost before they knew he was there. His flanking movements - some of the greatest in history - stretched across days, far out of sight of the enemy, not right across his nose on a battlefield. He would begin the day of the battle already positioned around and behind the enemy. He would concentrate his strength in a battle having stretched the enemy thin in the weeks beforehand with maneuvering on a grand scale. This was the opposite of earlier generals who would allow both parties to concentrate and attempt to stretch them with tactics on the battlefield; and it was what enabled Napoleon to win such crushing victories with the shock factor of overwhelming the enemy’s critical point, compared to even Wellington’s more clinical, ordered victories. This is part of the reason he began to struggle towards the end of his reign. Armies became some much bigger than in 1804/05, and it became impossible to pull off his operation level maneuvers that outfoxed all opponents in the early years. He simply couldn’t maintain the control over his corps and division that he had in 1804 and 1805, and that made it much harder for him to sweep across Europe like beforehand. Of course there are other factors. Napoleon’s age and ill-health; Sun Tzu’s point that “You must not fight to often with the same enemy, or you will teach him all your art of war”; the fact France was vastly outnumbered after 1812; and the 1812 expedition itself, particularly the lack of cavalry horses in the years after it, as well as his own declining skill. But the growth of the army sizes and the lack of control that came after that was an important factor, probably the most important one. And he was, in my opinion, the greatest general in history, as well as one of the greatest men. ",
            "date": "Answered June 10, 2018",
            "views": "743",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Philippe Prigent",
                    "user_href": "/profile/Philippe-Prigent"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Inglis",
                "href": "/profile/David-Inglis-8"
            },
            "answer_text": "Depends what you mean while a great General he was actually poor in many regards in strategy, the Russian 1812 campaign being a great example. He tended to be an improvisor , and prone to overly optimistic evaluations of the strategic situation, worked well when he was winning but leading to heavy defeats when he was not. Napoleon was excellent at operational manoeuvres and motivating his troops developing their espirit du corps, though poor at discipline. A good organiser but somewhat haphazard in his selection of subordinates at times.he also failed to setup clear lines of command and responsibility, preferring to keep his Marshall squabbling as a matter of policy., He had a good tactical eye. While nota great innovator he certainly understood the state of development and systemised and integrated changes happening in the French revolutionary army, the development of corps , divisions, etc. ",
            "date": "Answered November 5, 2017",
            "views": "603",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeremy Selby",
                    "user_href": "/profile/Jeremy-Selby"
                }
            ]
        }
    ]
}