{
    "title": "Is oil still being created in the earths crust by the same processes which made the current supply? How much is being made? - Quora",
    "tags": [
        "Geology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Piotr Sowiński",
                "href": "/profile/Piotr-Sowiński-1"
            },
            "answer_text": "Well, actually there is - still - some small degree of uncertainty regarding how oil is being created. Assuming widely accepted organic theory then yes, some oil is still being created as proper rocks, rich in organic matter are being heated under correct pressure in the earth crust. However, this amount is miniscule compared to current consumption; it needs to be noted that amount of oil “created” per year was always is Earth’s history very small. Reserves of oil are huge because it was created over millions of years.There is one more theory, abiogenic - it was proposed mostly by east bloc scientists in first half of XX century - according to it petroleum is generated by inorganic reaction in earth’s crust or mantle and the process is ongoing, producing big amounts. However this theory seems to be wrong ",
            "date": "Answered April 5, 2018",
            "views": "25",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chuck Bryant",
                    "user_href": "/profile/Chuck-Bryant-2"
                },
                {
                    "user_id": "William McGready",
                    "user_href": "/profile/William-McGready"
                },
                {
                    "user_id": "Viktor Elofsson",
                    "user_href": "/profile/Viktor-Elofsson"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Sadaf Dawar",
                    "user_href": "/profile/Sadaf-Dawar-1"
                },
                {
                    "user_id": "Steve Ludington",
                    "user_href": "/profile/Steve-Ludington"
                },
                {
                    "user_id": "Douglas E De Vries",
                    "user_href": "/profile/Douglas-E-De-Vries"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hesham Ali",
                "href": "/profile/Hesham-Ali-40"
            },
            "answer_text": "Not even the slightest close…in less than the last 2 centuries we have consumed most of the oil that was created in a process lasted 100s of millions of years. Actually for the oil to move from the source rock “where oil is being created” to the reservoir rock “ where we can drill in it and retrieve the oil\" it takes millions of years. So in the last 100 years its not possible for oil to be created or even move to the reservoir rock ",
            "date": "Answered April 5, 2018",
            "views": "672",
            "upvotes": "0"
        }
    ]
}