{
    "title": "Is racial segregation the real answer to racism? - Quora",
    "tags": [
        "Segregation",
        "Race Relations",
        "Racism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shamas Khanewal",
                "href": "/profile/Shamas-Khanewal"
            },
            "answer_text": "Slavery was made illegal in the United States upon the ratification of the Thirteenth Amendment in December 1865. (Note that France abolished slavery in 1794, the UK in 1833, Spain in 1867, Portugal in 1858.) Racial segregation has historically been a product of racism, not a solution. Look at the history of the US. Racial segregation in schools/colleges, in jobs and pay etc were all once commonplace. These all followed the abolition of slavery. The Jim Crow laws remained firmly in place for many years. Jim Crow laws - Wikipedia  Inter-racial marriages were rare if not outright forbidden. Even by the time Sammy Davis Jr married a white woman, the actress May Britt in 1960, interracial marriage was still illegal in 31 US states. Even JFK, for whom Sammy Davis campaigned, shunned him because of his marriage to a white woman. Why JFK Refused to Let Sammy Davis Jr. Perform at White House JFK shunned Sammy Davis Jr. because he married a white woman In South Africa for many years the White minority rule claimed apartheid was simply separate development and segregation. But the facts showed that the amount of money spent by government on Black South Africans was much less than that spent upon White South Africans. S Africa became a pariah among nations on the international stage because of its racist segregation. ",
            "date": "Answered October 18, 2020",
            "views": "52",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joshua Choyce",
                    "user_href": "/profile/Joshua-Choyce"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caleb Messinger",
                "href": "/profile/Caleb-Messinger"
            },
            "answer_text": "No. Its not. It is quote possibly the worst solution to trying to solve racism. If we segregated society, black people would sit at the back of the bus, would use different restrooms, would drink from different water fountains, would eat at black restaurants or would be forced to take food away from white restaurants. Not only is that supremely racist, but it is also a lot of work. An easier solution would be getting rid of police unions, banning the extreme use of force by police, defunding the police, passing an act that gets rid of not being hired because you checked off that you’re black, instead of white. Don’t even get me started on red lining and how banks make it harder for black people to buy houses. The court case Brown v Board of Education and the Civil Rights Act of 1964 passed because segregation was destroying society. MLK Jr was shot because he wanted to dismantle segregation. Segregation is a racist policy that conservatives tout because they want to go back to when they had all the power, instead of trying to change the USA so that everything can be more equal. ",
            "date": "Answered October 18, 2020",
            "views": "56",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Victoire Smith",
                    "user_href": "/profile/Victoire-Smith-1"
                },
                {
                    "user_id": "Ron Scott",
                    "user_href": "/profile/Ron-Scott-124"
                }
            ]
        }
    ]
}