{
    "title": "Is Sri Lanka a good place to travel? - Quora",
    "tags": [
        "Visiting and Travel in Specific Locations",
        "Visiting and Travel in Sri Lanka",
        "Locations",
        "Sri Lanka"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christine Nigam",
                "href": "/profile/Christine-Nigam"
            },
            "answer_text": "A number of people in Hong Kong have told me how beautiful Sri Lanka is. My son’s primary school Principal at German Swiss International School in Hong Kong, an Australian started the Galle International school and lives in Galle. One of our English friends just built a home in Kandy. Some of our best friends who live in Singapore are from here, so visiting Sri Lanka has always been on my bucket list. My husband and I made it a point to travel to a new country that we have not been to every year, this Easter we chose Sri Lanka. We travelled from Singapore to Colombo by Sri Lankan Airline. The airport looked quite modern. We stayed at the swimming club in Colombo which had a view of the Indian Ocean. The room was really nice and we loved the Sri Lankan cuisine which we know already as our Sri Lankan best friends have often invited us to their home. The next morning, we took a car to see the city which was as modern as Hong Kong and clean. Our driver took us to Mt Latvinia and we had tea at the beautiful Mt Lavinia Hotel. My husband had to go back to work the next day as Sri Lanka was the third country we visited during our Easter holidays. After he left, I hired a car from Colombo to Galle and I saw miles and miles of the Indian Ocean during the drive. Being a British colony, there were also many interesting churches dotted on the island. There were also some big Buddhist temples too. I stayed at the beautiful Amari Hotel in Galle, the buffet for dinner and breakfast had some interesting Sri Lankan cuisine. I visited many interesting historical landmarks in Galle. My driver drove me to Ella which has miles and miles of verdant countryside. From Ella I took a train to Nuwara Eliya. I visited a tea plantation to see how tea leaves were processed to make tea. We visited a place called Little England in Nuwara Eliya with homes that looked like you were transported to England for one minute. I visited Kandy, went to the botanical garden and then drove through stretches of the ocean road to return to Colombo where I stayed at the Galle Face Hotel. I saw a lot during my one week stay but there were a lot in the north of Sri Lanka to see which I would leave for the next trip. I was surprised to see how clean Colombo was, I love the food, some of the supermarkets were better than the ones in Hong Kong. Most people could speak English and the cost of travelling in Sri Lanka was very affordable and you could get great value. It certainly was worth visiting this beautiful pearl shaped island. Swimming Club Colombo  Mt Latvinia  Mt Latvinia Hotel       The Amari Hotel     The verdant countryside  Little England  Tea Plantations  The Botanical Garden in Kandy   The Galle Face Hotel    Colombo   ",
            "date": "Updated June 4, 2018",
            "views": "526",
            "upvotes": " View 380 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aaryan A",
                    "user_href": "/profile/Aaryan-A-6"
                },
                {
                    "user_id": "Vendhan Subramaniam",
                    "user_href": "/profile/Vendhan-Subramaniam"
                },
                {
                    "user_id": "Akila Herath",
                    "user_href": "/profile/Akila-Herath-3"
                },
                {
                    "user_id": "Sanduni Ubayasiri",
                    "user_href": "/profile/Sanduni-Ubayasiri-1"
                },
                {
                    "user_id": "Pratyasha Basu",
                    "user_href": "/profile/Pratyasha-Basu-3"
                },
                {
                    "user_id": "Sara Hadi",
                    "user_href": "/profile/Sara-Hadi-17"
                },
                {
                    "user_id": "Pramodya Thilakarathna",
                    "user_href": "/profile/Pramodya-Thilakarathna"
                },
                {
                    "user_id": "Mishenki Bandara",
                    "user_href": "/profile/Mishenki-Bandara"
                },
                {
                    "user_id": "Vill Life",
                    "user_href": "/profile/Vill-Life"
                },
                {
                    "user_id": "Simran Raj",
                    "user_href": "/profile/Simran-Raj-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vatsal Gajera",
                "href": "/profile/Vatsal-Gajera"
            },
            "answer_text": "Yes. Traveling Sri Lanka is completely worth. I visited Sri Lanka in May 2016. As I completed my post graduation in April and I had time of 2 months before joining my new job, I and my friends agreed upon Sri Lanka as a destination for our summer trip. Before starting our trip we knew that there is a flood in Sri Lanka, but after reaching there we came to know the actual situation. The situation was too bad there. Fortunately the places which we wanted to visit were not much affected. We planned trip for 6 nights and 7 days. Whole trip was completely planned by us only as we wanted to explore it by ourselves. We booked car for 7 days (Airport to Airport). We applied visa online and it was approved within 2 to 3 days. Whole trip was heavenly experience. In 7 days we covered almost all major tourist attractions. Our total journey was of approximately 1000 km. Below is the short summary of the places which we visited in whole trip. Before starting our trip. At Chhatrapati Shivaji International Airport, Mumbai.  We reached to Colombo at early morning. From Mumbai it is approximately 2.5 hr journey. Our car was ready at Colombo airport. We booked car with self-drive option. We started our journey for Nuwara Eliya. We reached Nuwara Eliya around 11:30 AM. Nuwara Eliya is located at altitude of 1868 meter. We booked all hotels for our 7 days trip from India only. Below pictures are taken by us during 3 days stay at Nuwara Eliya. Climate of Nuwara Eliya is similar to that of Britian’s so It is also called ‘Little England’. Our Hotel. Rainy Evening at Nuwara Eliya town.  Tea Gardens. Somewhere in Nuwara Eliya. After spending amazing 3 days in Nuwara Eliya we started heading to Bentota (From 1868 m to 3 m altitude :) ). It is approximately 210 km journey. We took 7 hr to reach Bentota as weather was not good and we started our journey at dawn. Hotel staff at Nuwara Eliya was so much cooperative, they prepared breakfast for us at early morning and packed it for us before we leave. This journey includes beautiful coastal route. We reached at Bentota around 11 AM. We booked sea facing resort in Bentota to enjoy our stay and believe me it was heaven. Coastal Highway Sea facing resort at Bentota After spending 1 day at Bentota we planned to spend one day in Aluthgama, Hikkaduwa, Galle and Unawatuna. In Aluthgama and Hikkaduwa you can enjoy snorkeling and scuba diving. Due to bad weather scuba diving was not allowed so we enjoyed snorkeling at Hikkaduwa. Beautiful sunset at beach Galle Cricket Stadium Galle Lighthouse After spending 2 days at above wonderful places we started heading to Colombo. We spent 1.5 days in Colombo. Colombo    The journey of 7 days was amazing. I would like to go Sri Lanka again surely. We could not cover all the places because of time constraints. So answer is Yes, traveling Sri Lanka is completely worth. Edit:- At the time of our trip (May 2016) 1 INR = ~2.20 Sri Lankan rupee. As I mentioned above we applied visa online. It costed us ~1400 INR per head. We booked our flight tickets before 3 to 4 months back as some offers were going on. Total cost of flight ticket was ~15000 INR (Round trip, Mumbai - Colombo). Total cost of car was ~25000 INR (including petrol) for 7 days. We decided to spend more on hotels so we booked little bit costly hotels at 3 places (Nuwara Eliya, Bentota and Colombo), as we wanted to enjoy sea facing and mountain resort view. But you can get all type of resorts (mid to high range) in every city. Total cost for trip per head was ~43k to 45k. Total cost includes everything (e.g. Shopping, cost of reaching Mumbai from my hometown etc.) ",
            "date": "Answered August 18, 2018",
            "views": "393",
            "upvotes": " View 456 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sowmya GS",
                    "user_href": "/profile/Sowmya-GS-12"
                },
                {
                    "user_id": "Aditya Krishnan",
                    "user_href": "/profile/Aditya-Krishnan-42"
                },
                {
                    "user_id": "Minidu Amarasekera",
                    "user_href": "/profile/Minidu-Amarasekera"
                },
                {
                    "user_id": "Surya Pavan",
                    "user_href": "/profile/Surya-Pavan-60"
                },
                {
                    "user_id": "Menula Gunasekara",
                    "user_href": "/profile/Menula-Gunasekara"
                },
                {
                    "user_id": "Nikhil Kumar",
                    "user_href": "/profile/Nikhil-Kumar-3436"
                },
                {
                    "user_id": "Pratyasha Basu",
                    "user_href": "/profile/Pratyasha-Basu-3"
                },
                {
                    "user_id": "Charles Lee",
                    "user_href": "/profile/Charles-Lee-731"
                },
                {
                    "user_id": "Simran Raj",
                    "user_href": "/profile/Simran-Raj-34"
                },
                {
                    "user_id": "Neha Purohit",
                    "user_href": "/profile/Neha-Purohit-35"
                }
            ]
        }
    ]
}