{
    "title": "Is Sadhguru a Brahmin? - Quora",
    "tags": [
        "Chief Minister Jayalalithaa Hospitalized (September 2016)",
        "Isha Foundation",
        "Tamil Brahmin Hindus People",
        "Yogis and Yoginis",
        "Sadhguru Jaggi Vasudev (Indian Yogi)",
        "Hindu Brahmins (priestly caste)",
        "Indian Caste System",
        "Hinduism",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krishna Gopal",
                "href": "/profile/Krishna-Gopal-378"
            },
            "answer_text": "Brahmin means one show knows the knowledge of God. God comes to this world human form like Rama, Krishna etc. One has to catch hold of such God in human form alive in this world. He comes here for preaching divine knowledge. You have to meet Him by visiting this site: www.universal-spirituality.org. The word ‘sat’ in Sadguru (Satguru) means not only God in human form, but also a good Guru elaborating the concepts of the Sadguru with more suitable examples, for further clarification. Sat not only means God, but also good work (Praśaste karmaṇi tathā …—Gītā). A Guru explaining exactly the concepts of the Sadguru with more suitable examples is also a Sadguru. Slight deviations, which do not damage the original concepts in any way, are negligible. I find most of the so-called Sadgurus only explaining human psychology for relieving mental stress, without speaking about the concepts of sin and the administration of God. The same thing is also done by a psychiatrist. Of course, one has to pay fees to the psychiatrist, whereas, one can receive the same analysis or sometimes even better analysis from these Sadgurus, without the payment of any medical fees. In this way, the Sadgurus are useful to poor people. But such psychological analysis is only beating around the bush because it only gives temporary relief and not permanent relief. Permanent relief is obtained only when the root cause is resolved. When one gets a fever, the root cause is the infection by bacteria or a virus. Putting a cold cloth on the forehead only gives temporary and superficial relief and not actual relief. Using antibiotics or suitable drugs to kill the bacteria or virus is the permanent relief. Similarly, if you analyse the cause of the mental stress that people are facing, it is the problems faced by people in life, that arise in spite of their extreme care and cautiousness. The cause of their problems is the sins committed by them in the past, in this life or in previous lives. Sin brings problems and mental stress follows. Hence, the Sadguru should explain the root cause of the mental stress, which is, the punishment given by God for the past sins. You need not be discouraged thinking that there is no way to escape the punishment of the past sin, which has already been done. This is not correct because the punishments of pending sins can be cancelled, if the realisation of past sins is attained. Realisation means accepting the sin done by oneself, without the influence of ego. The Gītā says that realisation is like the fire, which burns all the pending sins to ash (Jnānāgniḥ sarva karmāni…—Gītā). The logic behind this concept is that the punishment is always given only to bring this self-realisation and not to pacify the victim’s desire for revenge against the sinner. If this realisation is attained through spiritual knowledge, it kills the ego and makes the soul submissive to accept the sin for rectification. Once this realisation is attained, the spontaneous subsequent steps are repentance and non-repetition of the sin again in the future. Non-repetition of the sin and not mere repentance, is the true proof of the realisation. When this true realisation dawns through spiritual knowledge, God cancels all the pending sins also because there is no need of any punishment, when the realisation has already been attained. This enlightenment should be given by the Sadguru to resolve the issue at the root-level. There is no use of any psychological analysis for giving temporary and superficial relief. Even the present coronavirus pandemic is based on this concept of the punishment of sin and if a soul realises, repents and does not repeat the sins, this problem will end forever. Sadguru always solves issues at the root-level for achieving a permanent effect. God takes a lot of time before giving the punishment to give enough opportunity for reformation in the sinner. Of course, the victim who has been harmed by the sinner will be compensated by God immediately. The compensation to the victim will be many times more than the loss suffered by the victim. If the victim was a sinner in the previous birth, who had harmed the present criminal, it means that the criminal is only harming the victim in return. In such cases of retaliatory crime, no punishment is due to the present criminal. By looking at such retaliatory cases, people misunderstand God’s administration saying that sinners are not punished by God. Such misunderstanding makes them even doubt the existence of God! -By Shri Datta Swami www.universal-spirituality[.]org Universal Spirituality for World Peace ",
            "date": "Answered July 28, 2020",
            "views": "302",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ajay Dahiya",
                    "user_href": "/profile/Ajay-Dahiya-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranjiv Kurup",
                "href": "/profile/Ranjiv-Kurup"
            },
            "answer_text": "A Brahmin in what sense? From a Hindu philosophical perspective, or from the perspective of the British “caste system”? You cannot build a spiritual center and a whole range of supporting activities unless you have some wisdom. That’s a Brahmin, a spiritual orientation towards seeking Brahma Vidya. If he was a Kshatriya, he would have probably chosen the military, as a Vaishya he could have chosen any field of endeavor to exercises his entrepreneurship. And if he was a Shudra, he would have been indifferent to acquiring any abstract knowledge about the metaphysical and would have preferred to focus on developing his innate talent or ability as a doctor, a surgeon, a sportsperson, singer, artisan, painter or whatever. If you are asking from the perspective of “caste”, probably the Church or its evangelical arm would know better, as they inherited their legacy from the British! ",
            "date": "Answered September 6, 2020",
            "views": "287",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "H V Raghavendra Prasad",
                    "user_href": "/profile/H-V-Raghavendra-Prasad"
                },
                {
                    "user_id": "Mudit Sharma",
                    "user_href": "/profile/Mudit-Sharma-101"
                },
                {
                    "user_id": "Ajay Dahiya",
                    "user_href": "/profile/Ajay-Dahiya-66"
                },
                {
                    "user_id": "Swarnali Chatterjee Yokota",
                    "user_href": "/profile/横田-チャタジー-スワルナーリ-Swarnali-Chatterjee-Yokota"
                }
            ]
        }
    ]
}