{
    "title": "Is the Royal Navy’s submarine service elite? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Matthew Bennett",
                "href": "/profile/Matthew-Bennett-43"
            },
            "answer_text": "Thanks for the A2A, Despite being a filthy “skimmer” or a member of the surface fleet, I have some very good submariner friends and they all pretty much say the same thing about the Silent Service. They are very much an elite service in more ways than you might think. Firstly you have the covert nature of their work, for obvious reasons little is known about it, but the Submarine Service contributes hugely to the intelligence picture of the Royal Navy as well as contributing the Continuous At Sea Nuclear Deterrent ( CASD).  Secondly they have the bond of being a Submariner, which is shown by the Dolphins they all wear on their uniform. Which not only means that they serve on Submarines but they have done the SMQ course in which they learn all about the Boats they serve on, regardless of their job onboard. This provides the Service with a technical fluency that you do not necessarily find on Surface Ships. Lastly, much like other elite units , the Submarine Service operates in difficult conditions. Under the water for months on end, going through periods where everything has to be silent and dealing with much worse accommodation than their Surface counterparts.  However they do get paid a lot for their trouble! ",
            "date": "Answered May 31, 2020",
            "views": "282",
            "upvotes": " View 165 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Milne",
                    "user_href": "/profile/Mike-Milne-7"
                },
                {
                    "user_id": "Richard Wall",
                    "user_href": "/profile/Richard-Wall-66"
                },
                {
                    "user_id": "Ian Nunn",
                    "user_href": "/profile/Ian-Nunn-1"
                },
                {
                    "user_id": "Mark Bond",
                    "user_href": "/profile/Mark-Bond-70"
                },
                {
                    "user_id": "Taff Davies",
                    "user_href": "/profile/Taff-Davies-2"
                },
                {
                    "user_id": "Alex Palmer",
                    "user_href": "/profile/Alex-Palmer-20"
                },
                {
                    "user_id": "Tom Pepper",
                    "user_href": "/profile/Tom-Pepper-13"
                },
                {
                    "user_id": "Roy Tipper",
                    "user_href": "/profile/Roy-Tipper"
                },
                {
                    "user_id": "Paul Tempany",
                    "user_href": "/profile/Paul-Tempany"
                },
                {
                    "user_id": "David Tauchmann",
                    "user_href": "/profile/David-Tauchmann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Babus Abus",
                "href": "/profile/Babus-Abus"
            },
            "answer_text": "If you take the definition of Elite as: “a select group that is superior in terms of ability or qualities to the rest of a group” then the straight answer is yes. I held the same job title and similar departmental responsibilities in both an SSBN and a surface ship. In the SSBN, I ran a department that had the same overall responsibilities as a surface ship (although I did have more help from the shore side support facilities when alongside, in a surface ship I was on my own). I was also expected to act as the Officer of the Watch both surfaced and dived, Ship Control Officer of the Watch for missile launches and Casing Officer. None of these extra responsibilities were expected in a surface ship. Having volunteered to join the RN, and passing the various exams etc, when I then volunteered to do a stint in boats, I had a second set of physical and mental hurdles to over come, which sets you apart from your contemporaries. Everyone in a boat, no matter what your specialisation or rank needs to know the lay out and safety valve usage in all compartments. There is no Part III needed in a “skimmer”. So by definition, yes submariners can be classed as “Elite” due to the extra abilities and qualities they have to take on to be effective members of a boats crew. They rarely brag about it though, the payslip is sufficient! I have used only my personal experiences to illustrate the point. Most personnel on board a boat do more than they would in a RN Ship. ",
            "date": "Answered June 7, 2020",
            "views": "82",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yosef Mordechai Coleman",
                    "user_href": "/profile/Yosef-Mordechai-Coleman"
                }
            ]
        }
    ]
}