{
    "title": "Is there any real reason to like America or be proud of this country? - Quora",
    "tags": [
        "Pride",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Doug Freyburger",
                "href": "/profile/Doug-Freyburger"
            },
            "answer_text": "“Is there any real reason to like America or be proud of this country?” If some foreigner is angered by us, that’s actually a good sign from history. Outsiders hated all empires that imposed peace. If you have peace it’s because we forced it on you for most of the world. With a few smart exceptions like China. if you have war it’s because someone near you forced it on the region and your neighbors didn’t shoot them as troublemakers. If some foreigner loves us, that’s not all that impressive. Come join us. Immigrants stand in line for years. You don’t have to like us. We don’t care and history teaches that we should not care. I don’t have to be proud. I just need to read tens of thousands of pages of world history top have a valid basis for comparison. You’ve read over 10,000 pages of world history in order to have a valid opinion, right? Got it. I’m not proud that I’m an American. I’m grateful that my parents through my grand children live in the Pax Americana. I’m proud that I’m mostly as serene and hard working as my parents installed in me. We push republic. Why? Because history says it’s the best form known so far. If you object to republic, you are the one on the wrong side of history. We push freedom of religion. Why? Because history says it’s the best form known so far. If you object to freedom of religion, you are the one on the wrong side of history. Our corporations dominate. Why? Material success begets material success. Does anyone but major stockholders like this? Not even most citizens here. But our business is part and parcel with the peace we impose. Ugly and hated but effective. You name the large long lived empire in world history and the world is mostly the better because they imposed civilization on their era and continent. You name the empire and outsiders hated it, but they also lined up to move there. Technically we are now hegemony not empire. It’s a technicality. Whatever. ",
            "date": "Answered April 29, 2020",
            "views": "369",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Smith",
                    "user_href": "/profile/Jennifer-Smith-3255"
                },
                {
                    "user_id": "Benjamin Hoffman",
                    "user_href": "/profile/Benjamin-Hoffman-5"
                },
                {
                    "user_id": "Viatcheslav Dobrovitski",
                    "user_href": "/profile/Viatcheslav-Dobrovitski"
                },
                {
                    "user_id": "Vic Dhillon",
                    "user_href": "/profile/Vic-Dhillon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Barry",
                "href": "/profile/Jeff-Barry-11"
            },
            "answer_text": "RE: Is there any real reason to like America or be proud of this country? Pride in a country? I don’t know about that. Here in the US we have a President with vast legal power and vast influence on public opinion. I think the people of the US did a good thing, for example, to fight Nazi Germany and Imperial Japan during WW2. That took a huge amount of blood, sweat, and tears shed by the American people to win those wars. But say if President Roosevelt had waffled instead of forging ahead to supply our allies and commit our troops, and WW2 had gone the other way, would the US be at fault or would the President have been at fault? I say the President would have been at fault, not the US as a country. Here is one example of a President waffling which led to a MUCH bigger problem. When President Reagan withdrew our troops from Lebanon after the 1983 Beirut barracks bombings his action made a certain dictator believe that the US wouldn’t risk casualties in its armed forces. He was quite wrong about that. When Saddam Hussein subsequently invaded Kuwait — thinking that the US would do nothing besides howl — there was another US president in office, and then Saddam found out that it was Ronald Reagan who wouldn’t risk casualties in the US military. Should the US as a nation be blamed for the weakness of Ronald Reagan? I don’t think so. The actions of nations are determined by a handful of people at the top of the power pyramid, and I don’t think that the ordinary people should be burdened with the shame or pride of the actions of a few people. But do I like America? Yes I do. I don’t have a lot of experience being in other countries. In fact I’ve only ever spent significant time in two countries besides the US, namely Mexico and Canada. From what I have seen of Canadians they are in many ways like Americans, and perhaps somewhat more civilized than Americans as a whole. Canada was a good place to visit and I would go back. But what I saw in Mexico HORRIFIED me. I went there with a church group when I was a teen. We stayed off the tourist trails and went to places where there were ordinary people. When I got back to the US I was very, very glad that I had the luck to be born here in the US. (In spite of the fact that I’ve met some very fine Mexicans in my life, I’ve never gone back to Mexico in the half century since I went to Mexico as a teen.) And it’s clear from what little I see of “the news” that there are many, many countries on Earth which are FAR worse than Mexico. Should the common people of those hell-holes be blamed for the state of affairs where they live? No. I don’t think so. They are caught up in whatever insanity comes down upon them from on high. It is rare for the ordinary people to rise up and overthrow an existing government, and when it does happen what you usually get is a dictatorship as bad as or even worse than the former government. I think probably the biggest reason I like America is because our culture is ultimately descended from educated, benevolent people who did overthrow a dictatorship but replaced it with a republic, not another dictatorship. Here in the US the government exists to serve the people, not the other way around as is still so common elsewhere. Was the early US perfect. Not by a long shot (eg slavery, lack of rights for women, etc). BUT what the leaders did back then was astonishing FOR THEIR TIME. And we have improved upon it since. As a result life has gotten better and easier here. Does that mean the US is perfect? Of course not. We still suffer from idiots in the White House and Congress, but all things considered, we have learned that peaceful cooperation is beneficial to everyone and so mostly life gets better. And mostly we practice Live and Let Live, and that is a good way to live. I like it here. There are Americans who think the US is terrible. I suggest they go live somewhere else for a while and compare. ",
            "date": "Answered April 29, 2020",
            "views": "407",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anthony Campbell",
                    "user_href": "/profile/Anthony-Campbell-7"
                },
                {
                    "user_id": "Jennifer Smith",
                    "user_href": "/profile/Jennifer-Smith-3255"
                },
                {
                    "user_id": "Vic Dhillon",
                    "user_href": "/profile/Vic-Dhillon"
                },
                {
                    "user_id": "Virgil Fenn",
                    "user_href": "/profile/Virgil-Fenn"
                },
                {
                    "user_id": "Tom Battraw",
                    "user_href": "/profile/Tom-Battraw"
                },
                {
                    "user_id": "Charles Daugherty",
                    "user_href": "/profile/Charles-Daugherty-12"
                },
                {
                    "user_id": "Will Finch",
                    "user_href": "/profile/Will-Finch-8"
                },
                {
                    "user_id": "Liam Eloie",
                    "user_href": "/profile/Liam-Eloie-1"
                }
            ]
        }
    ]
}