{
    "title": "Is there a documentary or movie which one can watch to learn an unbiased history of the world? - Quora",
    "tags": [
        "Impartiality",
        "Documentaries",
        "Movie Lists",
        "Movie Production",
        "Movie Recommendations",
        "World History",
        "Learning",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Weihe",
                "href": "/profile/David-Weihe"
            },
            "answer_text": "An unbiased history of the world? Are you kidding? Humans, a good or bad idea? Or just unavoidable fallout from the 2.7 million year long Ice Age? Are neolithic farmers responsible for preventing the world from going into another Glacial Maximum, and if so, is this bad? No Europeans can comment, since they will be buried by mile thick glaciers, and thus are biased in favor of living. No one who lives within 100 feet of sea level can comment, since the next Glacial Maximum will lower sea level at least the 60 meters that the last one did, if not more, thus making them very much not seashore, anymore. No one who doesn’t like Europeans, now or at their worst, can comment, since they are biased the other way. No on from within a few hundred miles of the terminal moraines in North America is unbiased, because they would be living on tundra that Inuits would call harsh, so I should shut up as totally biased. OK, if we have this answered in an “unbiased” fashion, we have answered the questions to the early farmers, a thousand or three years before the first inscriptions, lets move on. Writing? Good, should have stayed as an accountants’ trick like double entry bookkeeping, or outright bad? What right did the Anatolian farmers have to move into Europe and take over everything by out-breeding the hunter-gatherers who had been there following the retreat of the Ice. Can we get Midnight Oil to write a song about the evil bastages who tear up Mother Earth, rather than living with the cave bear and dire wolves (not GRRM’s invention, but real) and even, apparently, giant hyenas in northern Eurasia who kept us in our place (seriously, who ISN’T biased against hyenas? Especially big ones?). ",
            "date": "Answered April 2, 2020",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Meny",
                "href": "/profile/John-Meny"
            },
            "answer_text": "I really don’t think so. Every documentary is the product of writers, directors, editors, producers ect, all of whom have particular biases. Even if there were a serious effort to produce an unbiased movie, the (unconscious) biases of these workers would influence the viewpoint the film takes. ",
            "date": "Answered April 5, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Farrukh Ibne Mahmood",
                    "user_href": "/profile/Farrukh-Ibne-Mahmood"
                }
            ]
        }
    ]
}