{
    "title": "Is the UN Security Council useless? - Quora",
    "tags": [
        "United Nations Security Council",
        "United Nations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Qing Xia",
                "href": "/profile/Qing-Xia-36"
            },
            "answer_text": "First, you must realize this, the UN was built by the giant 5, the giant 5 are the corner stones of UN. Second, the deepest reason of 5 Permanent Member of Security Concil structure, is Balancing. Because after WWII, the top five as winning countries, had no doubt strongest influence and military power no matte regionally or globally. It will cause serious disasters for humanbings if among five had any direct millitary conflicts. Therefore, we could say, the UN has provided a place for the five to discuss on tables, instead of soldiers fighting on battlefields. Some will say, the UN Security Concil is useless, it can not stop wars！People are still being slaughtered in different wars during past decades. Yes you maybe right. The key factor is: The UN exists only for the five. If the five had not launched wars against each other, the scale for this war can't really threat human beings. Maybe you will say it is not true, the 5 can't judge the rest of the world！Let me tell you, all about the UN is for balancing the 5, the 5 can't judge the rest of the world only because the 5 also has diversities. But if the 5 all agreed on one particular issue, no one/a country on earth can stop that happening. ",
            "date": "Answered March 9, 2018",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Gao",
                    "user_href": "/profile/Mark-Gao-28"
                },
                {
                    "user_id": "Deepak Narayan Singh",
                    "user_href": "/profile/Deepak-Narayan-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Shim",
                "href": "/profile/Alex-Shim-13"
            },
            "answer_text": "The United Nations Security Council is not representative of each continent in the world in regards to warfare among UN member states. Africa, South America, South Asia and the Middle East have no permanent member representation in the UNSC. All of those regions also do not have nuclear weapons states except for India and Pakistan. The veto power has become an obstacle to prevent conflicts from occurring. A new system needs to be developed to replace the veto system. New York is now currently a terrible location to host the UNSC and the UN General Assembly. Both the UNSC and the UN General Assembly should be located on the islands of Hawaii where Hawaii is ceded from the United States. ",
            "date": "Answered October 18, 2020",
            "views": "68",
            "upvotes": "0"
        }
    ]
}