{
    "title": "Is the idea of the 'nation state' entirely a Western concept or is it the eventual state of being for countries regardless of Western ideas? - Quora",
    "tags": [
        "Political Entity",
        "History of Ideas",
        "Nation States",
        "Western Nations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Holliday",
                "href": "/profile/Dan-Holliday"
            },
            "answer_text": "I want to first start off by thanking the author of the question for the respect of granting my ancestors the dignity and brilliance of inventing universally eminent concept.  Talk about white man's burden! And on we go . . . To answer the question, while it may have happened to occur first in the West, there is absolutely no reason to assume that it would not have occurred elsewhere. Let's take a side trip down \"invention\" lane and consider several other developments: Petroleum refinement -  Sure, sure it happened first here, but do you have any doubt that it wouldn't have occurred in China or in the Americas if they \"arrived\" first technologically?The Light bulb - setting aside the fact that Thomas Edison really wasn't its inventor (that credit goes to James Lindsay, Edison and his company bought the patent and developed the first industrially produce-able light bulb), the light bulb is a \"logical\" step in technological evolution (as seen from all the parallel work on it around the world).  It would have happened, eventually.The Internet - Another great \"invention\" that was destined to happen no matter what.  Even though credit goes to the USA and the DoD, specifically (not Al Gore?), it is inconceivable that another group of scientists, somewhere would not have developed a protocol to allow computers to chit-chat with each other.So, lets think about nation states as a development that would have happened, eventually, everywhere and anywhere regardless of who arrived there first.  As nations developed in complexity, so would the need to show property rights. As property rights increased, so would the need to have legal authority over said property.  Thus, arises the need for a legal framework of the nation state. It just so happens that Europeans, while sooner at the finish line on a number of developments and inventions, aren't a group of crazy geniuses who came up with all these things because they are ubermensch but (to quote Jared Diamond) were lucky enough to inhabit a great piece of land with resources and climate in just the right proportions to push them forward faster than the rest.  The culture of entrepreneurship and invention cannot be separated from who Europeans are, but even without that culture, eventually, most of the things that are would end up being, eventually, just not as soon.  Nation states included. http://en.wikipedia.org/wiki/Guns,_Germs,_and_Steel. Guns, Germs & Steel.  Diamond, Jared.  1997. ",
            "date": "Answered September 10, 2011",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Weill",
                    "user_href": "/profile/Andrew-Weill"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Sinanian",
                "href": "/profile/Michael-Sinanian"
            },
            "answer_text": "This answer approaches the question from a world-historical perspective, and not endogenous non-Western political history: Most non-Western nation-states were established during the period of decolonization in the 20th century, coinciding with the fall of Western imperialism after World War II. [1] Since this occurred after Western polities became nation-states, we can not say with certainty whether these entities would have adopted the concept on their own, outside the influence of Western ideology. Unfortunately, the direct answer to this question falls victim to a particular quirk of history. In other words, it's quite possible non-Western polities could have on their own arrived at the nation-state concept, but because most were empires and/or dominated by Western powers, that was never the case. Even examples outside the decolonization period, such as Haiti's nationalist revolution in 1804 occur after particular cases of Western nation-state establishment, and well after such ideas were espoused by Western intellectuals. [2] The Commonwealth of England, the French First Republic and the United States are some examples of these early cases. To further clarify, non-Western polities predating ideas of nation-statehood were typically multiethnic empires (or part of them). The Ottoman Empire ruled over a vast body of land in the Middle East and North Africa that would later host several nation-states, but it was not itself a nation-state. In that case, the nation, \"Anatolian Turks,\" were not coincident with the geographic boundaries of the sovereign political body. Meanwhile, in Asia, the Indian subcontinent was under the hegemony of Britain, itself a global empire dominating over several nations. [3]  --[1] ...if you don't consider the U.S. post-WW2 to be an empire [2] Most of these Western intellectuals came out of the Enlightenment movement dating from 1650-1800, well before the first non-Western nation-state was established. [3] What about nation-states that contain many nations, any why can't empires be classified as such? This requires a more nuanced discussion of what a nation-state is and its sub-types: the \"nation-state\" is a political concept wherein a nation (a shared cultural group) coincides with a state (a sovereign political entity)there are two types of nationalism: ethnic nationalism (nation-state based on a majority ethnic group) and civic nationalism (nation-state based on shared values and principles like democracy/republicanism or capitalism or socialism, etc...)The British empire had at its core a civic nationalist polity, established after the English Civil War in the mid 1600's that created a Commonwealth based on a Bill of Rights. This core, however, did not apply to its colonies, who originally did not share the civic values of Britain (the things that make-up \"Britain-ness\").",
            "date": "Updated October 10, 2011",
            "views": "21",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "George Nathanael",
                    "user_href": "/profile/George-Nathanael-3"
                },
                {
                    "user_id": "Beth Jones",
                    "user_href": "/profile/Beth-Jones-118"
                }
            ]
        }
    ]
}