{
    "title": "Is Time Magazine left or right-wing? - Quora",
    "tags": [
        "TIME (magazine)",
        "Right-Wing Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jayarava Attwood",
                "href": "/profile/Jayarava-Attwood"
            },
            "answer_text": "The Media Bias /Fact Checker Website rated Time as high on factual reporting. Indeed they say “Time Magazine has never failed a fact check.” However, Time is rated left of centre for story selection and on using emotive language that is pro-left with respect to USA politics To fact check the fact checker, the examples used to demonstrate this “bias” are pro-Obama and anti-Trump which is not the same as left/right bias. And since Time is an international magazine the website should have given international examples. The US bias of the Media Bias /Fact Checker Website means that we don’t have a clear idea if the political bias extends to other countries or politicians. So this seems flimsy to me. Overall, we rate Time Magazine Left-Center biased based on story selection that mostly favors the left and High for factual reporting due to proper sourcing and a clean fact check record. This update moves Time further to the left with their bias rating score increasing from 3.75/10 to 4.75/10, which is on the cusp of Left and Left-Center Bias.  By contrast, the Adfontes media bias chart suggests considerably less skew to the left. They confirm that Time score high on factual reporting. Time is more towards the centre than either MSNBC or CNN. Fox News TV is shown below for comparison.  So overall I would say we can confidently put Time in the centre of the political spectrum and slightly to the left. How much of this left bias is in fact a manifestation of the personality politics of the last decade is unclear. Both Obama and Trump have tended to polarise the American electorate and this in itself skews any attempt to evaluate bias. Time is an exceptionally reliable news source that has never been known to print false or misleading stories. However, Time is a magazine rather than a newspaper and its long articles contain a high level of analysis and this inevitably means that the author’s opinions and expertise colour the content. Analysis is always, to some extent, affected by subjectivity. But there is none of the heavily ideological commentary you expect from MSNBC or Fox News. Even the media bias evaluations show variation (and thus bias) so we take this with a grain of salt. ",
            "date": "Answered September 17, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Cook",
                "href": "/profile/Bob-Cook-40"
            },
            "answer_text": "Time was originally positioned as a weekly magazine a busy, no-nonsense business man could read to stay current on important news without having to read a lot of different publications — a top-level summary of the news. Like the rest of mainstream American journalism, Time originally strived to stay in the center. To the extent Time had a political slant, it would have been slightly Republican. Newsweek, which was once Time's direct competitor, was the same, only with a slightly Democratic slant, if any. Today, Time has remained more-or-less in the center. If they have a significant right or left bias, I doubt it is intentional. ",
            "date": "Answered December 18, 2016",
            "views": "67",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Gordon",
                    "user_href": "/profile/Michael-Gordon-459"
                },
                {
                    "user_id": "Oleg Romanov",
                    "user_href": "/profile/Oleg-Romanov-10"
                },
                {
                    "user_id": "Eric Hartman",
                    "user_href": "/profile/Eric-Hartman-20"
                },
                {
                    "user_id": "Paul Stivers",
                    "user_href": "/profile/Paul-Stivers"
                },
                {
                    "user_id": "Gus Zahariadis",
                    "user_href": "/profile/Gus-Zahariadis"
                }
            ]
        }
    ]
}