{
    "title": "Is there a chance for someone like Hitler to rise again in Germany? - Quora",
    "tags": [
        "Historical International Relations",
        "Dictatorships",
        "Adolf Hitler",
        "Germany",
        "World History",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikhil Pratap Singh",
                "href": "/profile/Nikhil-Pratap-Singh-5"
            },
            "answer_text": "I think German people, like the Japanese, work very diligently to portray an image of their country which is far different from what it used to be in the 1930s. Whether it is their hospitality towards tourists(i have never visited Germany, but reviews on various websites say so), their technological advancements, the kind of sportsmanship that you might have noticed in the recent FIFA'14,etc. All this shows that they are trying very hard to impress the world and give a message that whatever happened was a thing of past and they should not be looked upon with suspicion that, this is the country which gave Adolf Hitler to the world and might give another one as well. We should respect their efforts towards the same and moreover the world today has institutions like the UN and European Union plus a lot many NGOs which constantly keep a check on governments and leaders who have an authoritarian approach. P.S. : The same question can be answered in one line as well, it is that- the Germans are constantly working(in their factories as well as their homes) not just to give the best machines to the world but also the best human beings..!! ",
            "date": "Answered July 15, 2014",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonio \"Dually\" Brooks",
                    "user_href": "/profile/Antonio-Dually-Brooks"
                },
                {
                    "user_id": "Uma Priyadarsi",
                    "user_href": "/profile/Uma-Priyadarsi"
                },
                {
                    "user_id": "Anuradha Singh",
                    "user_href": "/profile/Anuradha-Singh-5"
                }
            ]
        }
    ]
}