{
    "title": "Is the Italian Medici family still rich? - Quora",
    "tags": [
        "Medici Family",
        "History of Italy",
        "Italian (language)",
        "Italy",
        "Wealthy People and Families"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alessandro Fornaciari",
                "href": "/profile/Alessandro-Fornaciari-1"
            },
            "answer_text": "Yeah, pretty much. Though, we should add some long and boring explanations. First of all, nobility titles in Italy after WWII had been totally eradicated and stripped off of all their value - nobody in Italy can claim officially to be a noble, although we sometimes hear someone recalling their noble heritage. The Medici family has been full of dukes, princes, marquesses.. and even popes. Though, most noble families that were rich before the fall of Fascism are still quite rich nowadays, even if the richest Italians are not noble at all. On a second level, we must acknowledge that there are tons of Medici in Italy who are not related to the actual family from Florence, since “medico” means simply “doctor” or “physician” in Italian.. one can imagine how many people named Medici live in Italy. The “real” Medici family is split into three branches, and all of them are wealthy: the Ottajano Medici (living in Naples since the Renaissance; they have managed some years ago to change their surname to “de’ Medici di Toscana di Ottaiano”, although as I said no nobility titles are valid in Italy), the Medici Tornaquinci and the Peruzzi de’ Medici, families still residing in Tuscany and Florence. Members of these families nowadays are still rich, they own huge mansions and often they’re involved into bank and finance affairs. Just to say, when a TV series was launched years ago on the Medici family, they had been broadcasted on every national channel with their critiques and harsh opinions. They run institutions such as the Ordine Civico Mediceo (you can get the meaning if you speak English =P) which is something like an institution that manages donations, owns buildings and art galleries and works in politics. They have been a hugely important family for several centuries, and they managed to keep most of their richess and their wealth through the following centuries like many other former noble families did. They’re definitely not the richest Italians, but they’re wealth and somehow influent. Probably though very few Italians are aware of their existance and their links to the Renaissance.. ",
            "date": "Answered September 25, 2019",
            "views": "48",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Federica Tavoletta",
                    "user_href": "/profile/Federica-Tavoletta"
                },
                {
                    "user_id": "Michelangelo Roseni",
                    "user_href": "/profile/Michelangelo-Roseni"
                },
                {
                    "user_id": "Arystan Nurgaliyev",
                    "user_href": "/profile/Arystan-Nurgaliyev-2"
                },
                {
                    "user_id": "Barbara Keeney",
                    "user_href": "/profile/Barbara-Keeney-4"
                },
                {
                    "user_id": "Vivien Cerin",
                    "user_href": "/profile/Vivien-Cerin"
                },
                {
                    "user_id": "Will King",
                    "user_href": "/profile/Will-King-116"
                },
                {
                    "user_id": "Mahesh Jethalia",
                    "user_href": "/profile/महेश-जेथलिया-Mahesh-Jethalia"
                },
                {
                    "user_id": "Faustina Prima Aksara",
                    "user_href": "/profile/Faustina-Prima-Aksara"
                },
                {
                    "user_id": "Alessandro Mencarelli",
                    "user_href": "/profile/Alessandro-Mencarelli-1"
                },
                {
                    "user_id": "Alessia Saini",
                    "user_href": "/profile/Alessia-Saini"
                }
            ]
        }
    ]
}