{
    "title": "Is there a far right dictatorship currently in the world? - Quora",
    "tags": [
        "Far Right Politics",
        "Dictatorships",
        "Government"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marek Dohojda",
                "href": "/profile/Marek-Dohojda"
            },
            "answer_text": "One must remember that Left/Right definitions today are largely nonsensical. The definition of which are muddy and incomprehensible. Left/Right started with the “Ancient Regime” where those who were pro king sat on the Right while those who were against him sat on the Left. This evolved to mean that Left was for individual freedom, while Right was pro big Government/Dictator. This is rather easy definition to follow, isn’t it? It simply means that edge of Left is Anarchy, while edge of Right is either Utopia or absolute Dictatorship (depending on how you view these things). What that means, of course, is that every dictatorship by definition is of the Right. Unfortunately this all changed at the turn of the 20th century, and even more so after WW2. Now, Socialism is creed of the Left, except that doesn’t make sense, as you can’t have Socialism and freedom, by definition of the term (even on paper when one takes two seconds to actually think about it). And small Government is creed of the Right, along with such concepts as Mercantilism. Yet these two are mutually exclusive terms! Incidentally, that means that in GOP party today, you have those who want small Government, return to Constitutional rule of law, and at the same time those who want protectionism, subsidize, etc.. So within this context, and with impossible to define definition, how can one truly answer the question? (Or much of anything really). Guess the best way to define Right today is Nationalistic, capitalistic, and rule of Law. Definitions which don’t really mean all that much, as for instance Capitalism requires freedom by definition (Capitalism is in reality defined, today at least, as Market operating system, and Market is? Everybody who exchanges good and services for their own interests). Therefore are there any right dictatorship? Not really, no. There aren’t Capitalistic dictatorships (which is always an moronic idea anyway, although I suppose Chile had that kind of system, kinda, loosely defined). I suppose closest you can get today, would be either Putin (if you consider him a dictator) or Duterte, again if you consider him a dictator. ",
            "date": "Answered August 2, 2017",
            "views": "150",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucas Nascimento",
                "href": "/profile/Lucas-Nascimento-25"
            },
            "answer_text": "If you classify “far right” as opening up borders to trade and exploitation from foreign nations for personal gain and power, then probably yes. You will find a few out there. “Far right” could also mean closing up borders and preserving natural resources and wealth for yourself and your close allies, at the expense of the rest of the population. Probably more than a few out there. If by “dictator” you mean a person who obtains and preserves absolute power over a government through a corrupt usurping of democracy… then I am sure you will find plenty of those around too. But the world is globalizing. “Democracy” will probably prevent dictators from coming to power. “Globalization” will probably prevent even a dictator from having vast control over the economy of a country without suffering some exertion of influence from foreign trade. ",
            "date": "Answered August 2, 2017",
            "views": "35",
            "upvotes": "0"
        }
    ]
}