{
    "title": "Is Vladimir Putin a dictator or not? - Quora",
    "tags": [
        "Dictators",
        "Dictatorships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Cohen",
                "href": "/profile/Jeffrey-Cohen-16"
            },
            "answer_text": "There's a sliding scale of who constitutes a dictator, so that's not fully a yes-or-no question. On balance, I think he's pretty far down the scale toward being a dictator. 1. When Putin is President, the President runs Russia. When Putin is Prime Minister, the Prime Minister runs Russia. The government's structure adjusts to keep Putin at the top.2. His country's press largely does what he tells them, so that the public always agrees with his policies.3. If you're too critical of him, you end up in jail.4. He introduces brutal laws against citizens he dislikes (e.g. gays).5. He has personally stolen billions from his people. 6. Through his control of information and ability to jail his opponents, he nearly always gets his way domestically. True, he needs the Duma's approval for some things, but they are a rubber stamp. As for Obama, there's no comparison. If you think he's a dictator, then you simply have no idea what a dictator is. If he were a dictator, he wouldn't have to compromise so much on budgets. He would have gotten the healthcare bill he wanted, not settled for much less. When people told lies about him, they would be thrown in jail. Fox News, which openly supports his political opponents, would be shut down or have its leadership replaced. Congress would not be able to investigate him, and after an investigation showed a clear lack of wrongdoing (e.g. Benghazi) his political opponents would certainly not be allowed to keep running phony investigations to imply to the public that he hadn't already been cleared of wrongdoing. He would have gotten common-sense gun control that was supported by 80% of the public, instead of having Congressional Republicans shut him down. He would have declared what \"grand bargain\" was going to happen on entitlements and taxes, rather than trying to compromise and failing to get anything at all. A dictator gets his way, at least domestically. Obama often can't even get his way when a majority of the public supports him. ",
            "date": "Updated December 29, 2014",
            "views": "422",
            "upvotes": " View 165 Upvoters",
            "upvoters": [
                {
                    "user_id": "J.A. Cwynar",
                    "user_href": "/profile/J-A-Cwynar"
                },
                {
                    "user_id": "Dean Moriarty",
                    "user_href": "/profile/Dean-Moriarty-17"
                },
                {
                    "user_id": "Brendan Murphy",
                    "user_href": "/profile/Brendan-Murphy-7"
                },
                {
                    "user_id": "Nitish B",
                    "user_href": "/profile/Nitish-B-8"
                },
                {
                    "user_id": "Samantha Stevens-Dixon",
                    "user_href": "/profile/Samantha-Stevens-Dixon"
                },
                {
                    "user_id": "Chandler Jowers",
                    "user_href": "/profile/Chandler-Jowers"
                },
                {
                    "user_id": "Misterx Goldbergstein",
                    "user_href": "/profile/Misterx-Goldbergstein"
                },
                {
                    "user_id": "Alireza Rezania",
                    "user_href": "/profile/Alireza-Rezania-2"
                },
                {
                    "user_id": "Sandra James",
                    "user_href": "/profile/Sandra-James-53"
                },
                {
                    "user_id": "Rob Hz",
                    "user_href": "/profile/Rob-Hz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Ewing",
                "href": "/profile/Tony-Ewing-7"
            },
            "answer_text": "You mean, does he rule despite the will of the Russian people? No. Nearly 90% of Russians support Mr. Putin, while only 30% of Americans support Mr. Trump. You mean does he rule with an iron fist? Not really. This paper, the Moscow Times, is distributed free of charge (because no one would buy it otherwise) and is not only anti-Kremlin, it seems clearly supported by American political interests. Yet, Mr. Putin has made no attempt to shut it down. You mean, does he take resources that aren’t his and divert them to his personal account? Or is he some freak who gets his thrills in bizarre ways? Or do his family members (his daughters) engage in the sorts of past-times that dictators children engage in? (I won’t repeat the accusations.) Well, these (among many others) are the accusations of Stanislov Belkovsky (exactly, who?) a man who dubs himself a “Kremlin insider” but who furnishes no evidence of such insider credentials. He is also a man unable to support any of his claims about Mr. Putin. Nonetheless, Mr. Putin has not put him in jail nor has he waited outside Mr. Belkovsky’s office and physically smacked him around a few times when he comes out in response to the latter’s bad-mouthing of his parents and his daughters (all of which I would be tempted to do). Again, not the behavior of a dictator—or a Midwesterner. By comparison, in America, we are forced to accept a President—any president—even if most of us don’t vote for him or her. And should the popular opinion of that President fall even to historic lows, we cannot remove that person from office. We furthermore endow that president to make lasting changes to the Judicial system and in relation to Federal and overseas policies, without our consent. FEMA and the rights to put Federal troops on local streets while also detaining people indefinitely, for example, were created by George “Axis of Evil” Bush. Moreover, we don’t actually vote our President into office—the Electoral College does. And while the workings of the Electoral College are quite clear, its transparency is a mystery to most. At the same time, we’re forced to accept a two-party system, even though politics (and real life) are more nuanced than black-white discussions of abortion, gay marriage and health care. Furthermore, we must accept the dirt, grime, corruption and incompetence of our political parties—with no recourse regarding their actions. In America we also have no vote or hand in levying taxes—how they are assessed, at what level they are assessed, in what increments they apply or in how those funds are spent. And one would be terribly unwise to criticize the IRS for fear of ending up in some sort of Guantanamo Bay type situation. In fact, Guantanamo Bay might be preferable, as even with legal representation, we have no recourse against an agency that can destroy one’s entire life, tear apart one’s family and career and leave one in poverty. I could go on, but I think you get the point: People who live in glass houses, shouldn’t throw stones. ",
            "date": "Answered November 14, 2017",
            "views": "74",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Erin Flanagan",
                    "user_href": "/profile/Erin-Flanagan-48"
                },
                {
                    "user_id": "Diane Tregear",
                    "user_href": "/profile/Diane-Tregear-1"
                },
                {
                    "user_id": "Christian Shelton",
                    "user_href": "/profile/Christian-Shelton-16"
                },
                {
                    "user_id": "No Name",
                    "user_href": "/profile/No-Name-8166"
                },
                {
                    "user_id": "Sandra James",
                    "user_href": "/profile/Sandra-James-53"
                },
                {
                    "user_id": "Cristi Tase",
                    "user_href": "/profile/Cristi-Tase"
                },
                {
                    "user_id": "Liz-Marie van der Westhuizen",
                    "user_href": "/profile/Liz-Marie-van-der-Westhuizen"
                },
                {
                    "user_id": "Lazar Acimov",
                    "user_href": "/profile/Lazar-Acimov"
                },
                {
                    "user_id": "Sabina Bista",
                    "user_href": "/profile/Sabina-Bista"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Terry-Cupboards"
                }
            ]
        }
    ]
}