{
    "title": "Is Vancouver Island really sinking? - Quora",
    "tags": [
        "Vancouver Island, BC",
        "Living in Vancouver, BC",
        "Sinking",
        "Pacific Ocean",
        "British Columbia, Canada",
        "Vancouver, BC",
        "Islands",
        "Geography"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ron Poulter",
                "href": "/profile/Ron-Poulter"
            },
            "answer_text": "No not sinking. Rising. And as far as “the big on goes” on average over the millennia they have averaged 500 years between… Last on in 1700 - that means on average the next one is in 2200. But only mother nature knows for sure. What is overdue is the southern half of the fault off Oregon - it pops twice as often on average - every 250 years - so the southern half is overdue, not the whole complete fault. When it does strike Vancouver Island will drop about a metre or two on the west coast of the island. The 9.x epicenter will be over 100 km off the west coast of the island and it will be felt in the populated areas on the east coast as about a 5.x to 7.x depending on geography and distance. It will also last for minutes rather than seconds. Tsunami will hit the west coast of the island only and part way down the Straight of Juan de Fuca … Hint… a long violent shaking is your official signal to get the heck to high ground ! ! ! ! You might have 20 minutes… ",
            "date": "Answered January 25, 2020",
            "views": "457",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ken Swanston",
                "href": "/profile/Ken-Swanston"
            },
            "answer_text": "I live in Richmond BC surrounded by the Fraser River and the concern about Vancouver Island is not so much that it is sinking, but that it is on the wrong side of a tectonic (Pacific) plate that is ‘subducting’ (i.e. very gradually, but in BIG magnitude 9.0+ jolts, going under) the North American plate. Apparently the next BIG one is ‘due’ any time in the next minute to 100+ years. The last BIG one was January 27th, 1700… Experts: Vancouver Island will rip open like a zipper when overdue earthquake hits …I always wanted a swimming pool in my back yard…just not over my house! ",
            "date": "Answered April 30, 2019",
            "views": "440",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wolf Drescher",
                    "user_href": "/profile/Wolf-Drescher"
                },
                {
                    "user_id": "Dave Macmurchie",
                    "user_href": "/profile/Dave-Macmurchie"
                },
                {
                    "user_id": "Miles Baillie",
                    "user_href": "/profile/Miles-Baillie"
                },
                {
                    "user_id": "Shane Roche",
                    "user_href": "/profile/Shane-Roche-17"
                },
                {
                    "user_id": "Viola Yee",
                    "user_href": "/profile/Viola-Yee"
                }
            ]
        }
    ]
}