{
    "title": "It is 1939. You have Adolf Hitler lined up in the sights of a high-power rifle. Do you pull the trigger? Why or why not? - Quora",
    "tags": [
        "Social Justice",
        "Adolf Hitler",
        "Hypothetical Personal Situations",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Ethics",
        "Morals and Morality",
        "World War II",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "S. Patrick Maiorca",
                "href": "/profile/S-Patrick-Maiorca"
            },
            "answer_text": "This is hard to say, there is a tendency to think the history had was the worst possible outcome. There are two extremes that would have happened if Hitler were shot in 1939, either one of his lieutenants would have been able to cement themselves in the position of Fuehrer quickly or they would have started infighting to gain superiority and brought things to an end quicker. I know what happened in our timeline, so we have to decide about the alternate timelines. If they united there are three possibilities, either we see events unfold more or less the same way except for Herman Gorring or Rudolf Hess becomes Fuehrer in this case shooting him doesn’t change much. The next possibility is that whoever takes over is incompetent and Nazi Germany falls faster, the last possibility is the successor actually avoids Hitler’s biggest mistakes-which would be the worst possible outcome. So you need to really ask re you willing to risk living in a high castle? ",
            "date": "Answered October 24, 2020",
            "views": "363",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Smith",
                    "user_href": "/profile/Tim-Smith-1637"
                },
                {
                    "user_id": "Jodi Schuetzle",
                    "user_href": "/profile/Jodi-Schuetzle"
                },
                {
                    "user_id": "Barry Exum",
                    "user_href": "/profile/Barry-Exum"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Langben",
                "href": "/profile/Frank-Langben-1"
            },
            "answer_text": "The answer’s not that simple. In 1939, before September 1st, do you know the future? If you don’t, you probably can’t foretell the coming World War II and the holocaust/shoa. If you know the future, you need to consider what happens if you do kill Hitler. The Nazi Party is not going to collapse and Germany suddenly start singing kumbayah. Goebbels or Göring would be the new Führer. Would they continue with World War II — assuming that this is before September 1st? Would they be more effective in command and not make the many mistakes Hitler made, thus at least lengthening the war? If you really want to make sure that the Nazi Party remained just a small paragraph in the history of Weimar Germany, go back to November 1923, and shoot Hitler on his way to the Bürgerbräukeller. Or, even better, shoot him in combat during World War I. ",
            "date": "Answered October 29, 2020",
            "views": "195",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard Holder",
                    "user_href": "/profile/Richard-Holder-46"
                }
            ]
        }
    ]
}