{
    "title": "Just how good were Spartans when it came to combat? - Quora",
    "tags": [
        "Spatacus",
        "Hand to Hand Combat",
        "Ancient Spartans",
        "Ancient Sparta",
        "Combat",
        "Ancient Greece",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "John Dewar Gleissner",
                "href": "/profile/John-Dewar-Gleissner"
            },
            "answer_text": " The Spartans were superb warriors, the best in the world for their era. They were in great physical shape, trained constantly, had the best armor and weapons, could move as units, had a clear command structure and a fighting ethos that discouraged cowardice, retreating or surrendering. Spartans were conditioned to endure hardship without complaint. During the 27 years of the Peloponnesian War, Athens did not dare face the full Spartan army in close combat with all their forces. Sparta trained constantly, not just for war with other city-states or Persia, but mainly to keep their more numerous helots in subjugation. The helots outnumbered the Spartans 7 to 1. The skill of Spartan warriors is even reflected in the way they were finally defeated decisively: Thebes had 50 rows of hoplites against the Spartans 8 rows of hoplites, and the Thebans wore the Spartans down with greater numbers arrayed against them.  The Spartans had the same idea as Sun Tzu …. and they trained for it.  ",
            "date": "Updated May 14, 2017",
            "views": "381",
            "upvotes": " View 119 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zexiao Sun",
                    "user_href": "/profile/Zexiao-Sun"
                },
                {
                    "user_id": "Jack Rosener",
                    "user_href": "/profile/Jack-Rosener"
                },
                {
                    "user_id": "Ben Solace",
                    "user_href": "/profile/Ben-Solace"
                },
                {
                    "user_id": "Jason Davis",
                    "user_href": "/profile/Jason-Davis-633"
                },
                {
                    "user_id": "Clara Love",
                    "user_href": "/profile/Clara-Love-7"
                },
                {
                    "user_id": "Andrew Shkreli",
                    "user_href": "/profile/Andrew-Shkreli"
                },
                {
                    "user_id": "George Yin",
                    "user_href": "/profile/George-Yin-6"
                },
                {
                    "user_id": "Vineet Kaddu",
                    "user_href": "/profile/Vineet-Kaddu"
                },
                {
                    "user_id": "Ayu Nazrah",
                    "user_href": "/profile/Ayu-Nazrah"
                },
                {
                    "user_id": "Luka Sukurica",
                    "user_href": "/profile/Luka-Sukurica"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christian Desaix",
                "href": "/profile/Christian-Desaix"
            },
            "answer_text": "Given the Spartan fear of helot revolts, they trained on a much more frequent schedule than hoplites in other cities. That gave them an edge in terms of discipline and formation movement. Remember that Greek warfare was not about individual close combat, but about the steady push of massed spearmen. They were very good at phalanx warfare, to the point where their (carefully polished and artfully spread) legend demoralized many a potential opponent long before actual combat. Again, though, given the fear of revolt at home, Sparta was rather cautious about dispatching its army far from Lakonia. Note, too, that by the end of the great war with Athens, other cities had begun to train more frequently and spend more time in arms…meaning that Sparta’s edge relatively declined. ",
            "date": "Answered February 11, 2020",
            "views": "269",
            "upvotes": "0"
        }
    ]
}