{
    "title": "Once believing that Christopher Columbus discovered North America, in what year did we learn that Leif Erickson had landed in Canada almost 500 years earlier? - Quora",
    "tags": [
        "Leif Erikson",
        "Columbus Discovers the Americas (1490s & 1500s)",
        "Christopher Columbus (historical figure)",
        "North America"
    ],
    "response": [
        {
            "author_info": {
                "name": "KC Armstrong",
                "href": "/profile/KC-Armstrong-3"
            },
            "answer_text": "“WE” do not count. Europeans in Scandinavia knew of Lief’s father’s discovery of Greenland in 962 a few years later and last that I looked it was part of North America.. Sagas suggest that the land was known a century earlier. All that Lief added was the discovery of the mainland (continent) around 1,000 AD. The Roman Catholic Church had an entire Bishop and cathedral in Greenland by 1126 so North America was known, not just in Scandinavia but in Italy by the 12th century. There is a documented annual tribute to Rome of walrus ivory and luxury goods in terms of Bishop’s finery that went westwards. Historians not believe that the last Norse died in Greenland about the time that Columbus sailed. Columbus was we well aware of the Norse sagas having spent time in Iceland. He reasoned that the Norse had found what we call today the Kamchatka peninsula just east of Siberia. He reasoned that if he sailed due west from Southern Europe that he would arrive in China. When Church scientists advised him that the earth was in the vicinity of (what we know today) he insisted that it was much smaller. The point here is that Europeans knew about the Americas 500 years before Columbus and that Rome was well aware of it at least 380 years before he sailed. Given that he never claimed discovery of a continent the later credit of discovery given to him is iffy. Norse settlements in Greenland had been revisited by the 18th century. The final proof was the discovery of the Viking colony at L’Anse aux Meadows in Canada and the recent discovery of a second site where they mined for iron. That Americans resist taking the credit away from Columbus is perhaps due to Italian-American influence. ",
            "date": "Answered December 2, 2018",
            "views": "114",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Theland Robideaux",
                "href": "/profile/Theland-Robideaux"
            },
            "answer_text": "The year 1075 was the first historical writing about it. In 1960 archaeologists uncovered sites. Yet it’s still barely mentioned or unmentioned in almost all textbooks. They also don’t mention multiple Polynesian migrations and intermixture with seven Native tribes from Chile to Canada 2,000 years ago. Nor Australian Aboriginal migration 8,000–14,000 years ago to Brazil, though an Aboriginal skeleton was found in 1974. They don’t want to challenge the Columbus Myth. Same reason genocide by him often goes unmentioned. ",
            "date": "Answered December 1, 2018",
            "views": "66",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Bullish",
                    "user_href": "/profile/John-Bullish"
                },
                {
                    "user_id": "Quentin Quimby",
                    "user_href": "/profile/Quentin-Quimby"
                },
                {
                    "user_id": "Richard Morris",
                    "user_href": "/profile/Richard-Morris-158"
                }
            ]
        }
    ]
}