{
    "title": "Once established, Christianity seems to be resilient no matter the level of persecution and to spread in spite of it. Why did it virtually disappear from Japan? - Quora",
    "tags": [
        "Persecution",
        "History of Christianity",
        "History of Religion",
        "Catholicism",
        "Christians",
        "Japan",
        "Christianity",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rathi Raj",
                "href": "/profile/Rathi-Raj"
            },
            "answer_text": "Japan has its own culture and religion, which was being threatened by the Dutch merchants during mid-1500s who secretly smuggled Christian missionaries and started the spread of their religion there. Once the Emperor became aware, he deported all the Dutch and threatened the new convertees of Japanese origin to either return to their centuries old belief system or be prepared to be deported as well. In 1551 Francis Xavier managed to convert about 150 Japanese to Christianity but was forced to leave. The second attempt was made by Portuguese merchants, who likewise tried to spread Christianity and met with the fate similar to that of the Dutch when Emperor Hideyoshi banisehed them in 1587. In Japan, where certain religions already existed and followed by all in complete cohesion, the introduction of a new European religious philosophy was a matter of grave concern. Thankfully, the Japanese government acted well in time and adequately so that the Japanese culture has remained intact even till date. ",
            "date": "Answered July 31, 2019",
            "views": "123",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrita Poonia",
                    "user_href": "/profile/Amrita-Poonia"
                },
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                },
                {
                    "user_id": "Gaurav Gurkhe",
                    "user_href": "/profile/Gaurav-Gurkhe"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Farnsworth",
                "href": "/profile/David-Farnsworth-18"
            },
            "answer_text": "Despite severe persecution (and, yes, contrary to the assertion of one of the other persons answering, Christianity HAS been subject to persecution in many places, including Japan), this religion persisted intact throughout the persecution period and into the modern age. I have visited a town in Kyushu where they had “kakure Kirishitan” (hidden Christians). What interested me was that, even if these Christian churches were “hidden”, there was no way that the whole town did not know about them. So the town, right up to the samurai overlord, was aware of, and protected, the Christian minority, despite the standing order of the Tokugawa Shogunate, that all Christians must be reported to the government. A remarkable thing. ",
            "date": "Answered August 1, 2019",
            "views": "51",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leo Dunphy",
                    "user_href": "/profile/Leo-Dunphy"
                }
            ]
        }
    ]
}