{
    "title": "Prior to China's unification in 221 BC, did these warring states actually all consider themselves Chinese? Did they all have the same cultural identity already? - Quora",
    "tags": [
        "History of China",
        "Culture of China",
        "Chinese Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Helena Štěpánová",
                "href": "/profile/Helena-Štěpánová"
            },
            "answer_text": "Well, yes and no. They were all Zhou vassal states (originally at least, though later in name only), they mostly considered themselves 华夏 (Huaxia) - a group of civilized peoples/polities defined both negatively - as the non-barbarians - and positively - by a shared elite culture and tradition.On the other hand, there is some evidence that by the end of Warring States period, some pretty strong regional identities formed in the region.Chu for example was certainly a country and a people apart, The Qin, which seems to originally have been a rather traditionalist Zhou polity, also developed quite a strong notion of having a specifically Qin identity. The same probably holds true for other warring states as well and it might have started quite early on during the Spring and Autumn period. Qin Shihuang was very ecclectic in terms of state ideology (more ecclectic than most emperors that came after him, actually) but also fairly inflexible - and many historians attribute the quick downfall of Qin dynasty to the fact that the grand unification project clashed too strongly with regional identities and loyalties in the subjugated states, which further fuelled the already existing centrifugal tendencies.  It is true, that in all or most Warring states there existed tendencies towards centralization and growing militarism, and administrative reforms similar to those that Shang Yang introduced in the state of Qin were implemented in most other states (in many of them earlier than in Qin, actually). This led to formation of strong, increasingly aggressive polities - so eventual unification was probably one of the most likely outcomes of the whole Warring states mess. Qin just happened to be stronger, better prepared and luckier than the others.That doesn't mean, however, that it was an inevitable scenario (as generations of Chinese historians have led us to believe). Despite some shared tradition and the existing concept of Huaxia, the Zhou cultural sphere was probably pretty diverse and things could have happened differently. The incredible speed with which the Qin empire fell apart after Qin Shihuang's death suggests that the centrifugal forces were very strong.(I personally am inclined to believe that before Qin Er Shi - the  second emperor of Qin - the dynasty still stood a fairly good chance at  surviving, albeit with some necessary tweaks and reforms - but there's no denying that while there was some shared cultural identity, there were also differences - and the Qin unification was basically one strong state subduing others.) ",
            "date": "Answered July 7, 2014",
            "views": "22",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yu Xiang",
                    "user_href": "/profile/Yu-Xiang-79"
                },
                {
                    "user_id": "Aisingioro Giocangga",
                    "user_href": "/profile/Aisingioro-Giocangga"
                },
                {
                    "user_id": "Anh Tran",
                    "user_href": "/profile/Anh-Tran-157"
                },
                {
                    "user_id": "Xiran Zhao",
                    "user_href": "/profile/Xiran-Zhao"
                },
                {
                    "user_id": "Wendy Wright",
                    "user_href": "/profile/Wendy-Wright-53"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Adam Gieseler",
                    "user_href": "/profile/Adam-Gieseler"
                },
                {
                    "user_id": "Ang Li",
                    "user_href": "/profile/Ang-Li-36"
                },
                {
                    "user_id": "Amin Ghaemi",
                    "user_href": "/profile/Amin-Ghaemi-1"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Boyle",
                "href": "/profile/Joseph-Boyle"
            },
            "answer_text": "The warring states originated with the Zhou emperor gradually losing power to his outlying vassals. This evolution could be compared to post-Roman European feudalism, or the later period in Japan also called Warring States.  The state of Chu, for example, gradually expanded south to the Yangtse River moving its capital, eventually ruling populations who likely spoke languages of the Miao-Yao, Tai, or other unknown language families not Sino-Tibetan. But the ruling class at the least must also have known the proto-Chinese languages centered farther north. Much earlier, in the 2000s BC according to legend, the Yellow Emperor ancestral to the Huaxia (the same hua in today's zhonghua and huaren) defeated the ancestor of the Miao people (one branch are today's Hmong) who then moved south to the Yangtse valley.  Like later southward migrations in Chinese history, this was a patrilineal ancestor who intermarried locally and was eventually revered by a snowballing group of tribes. Compare the Biblical story of Abraham migrating from Iraq to Canaan and eventually being claimed as ancestor of Hebrews and Arabs.  The Yangtse Valley received successive waves of northern influence, including this early proto-Miao around 4000 years ago, then the Chu and Qin more than 2000 years ago who brought the language ancestral to today's Chinese, then more Chinese fleeing northern invaders around 1000 ago.  China's south coast was more isolated and the first recorded invasion was by Qin, comparable to Caesar's invasion of Gaul and its following Romanization. The coastal culture, known as Yueh or Viet, was eventually assimilated to speak Chinese dialects except for its southern end in today's North Vietnam, which evolved into today's Vietnam, preserving its non-Chinese language even after much convergent evolution with Chinese (like both developing tones) and heavy vocabulary borrowing from Chinese. ",
            "date": "Answered December 31, 2013",
            "views": "12",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yu Xiang",
                    "user_href": "/profile/Yu-Xiang-79"
                },
                {
                    "user_id": "Rafay Azim",
                    "user_href": "/profile/Rafay-Azim"
                },
                {
                    "user_id": "Samuel Liu",
                    "user_href": "/profile/Samuel-Liu-7"
                },
                {
                    "user_id": "Collin Spears",
                    "user_href": "/profile/Collin-Spears-1"
                },
                {
                    "user_id": "Kevin Zhang",
                    "user_href": "/profile/Kevin-Zhang-566"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jerry-Green-9"
                },
                {
                    "user_id": "Ty Eng Lim",
                    "user_href": "/profile/Ty-Eng-Lim"
                },
                {
                    "user_id": "Eric J. Lin",
                    "user_href": "/profile/Eric-J-Lin-1"
                }
            ]
        }
    ]
}