{
    "title": "Should a woman fart in front of a man? - Quora",
    "tags": [
        "Flatulence",
        "Manners and Etiquette"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Wyatt",
                "href": "/profile/David-Wyatt-41"
            },
            "answer_text": "Women are human with digestive systems as well. Women eat and their dejection system produces gas as well. This means women need to fart as well. A woman’s body does not not produce gas right at that moment because a man is around. Since farting is a natural and normal bodily function for women as well and holding in bodily waste can really damage your insides including causing cancer women should tend to do their bodily needs whenever they feel the urge to arise. Studies have shown women’s farts do reek far worse than men’s do on average and that is due to much higher levels of hydrogen sulphide gases that are present in women’s farts. This is just a fact not a judgment of women. So yes, women should fart without shame around men. Women should poo at their man’s house, in public toilets etc etc and nobody should judge women or make them feel ashamed for doing so either. This entire attitude of raising women to be embarrassed to do natural and normal bodily functions is just stupid and crazy in my opinion. If women around you take care of natural bodily functions and it stinks don’t make a big deal of it, just open a window. Women don’t deserve to feel ashamed for natural and normal bodily functions they should be doing the moment they feel the urge arise and we shouldn’t be raising women to feel shame for it either. So yes, women should fart, poo and do all other natural bodily functions the moment they feel the urge arise at anytime, around anyone and anywhere and this includes at a friends place, their partners place, at work, anywhere in public or another other place they are when they feel that urge arise the instant women feel that urge arise. Women should never hold it in even for a second, women should instantly let it out! As I said making a woman feel so ashamed she is always holding in bodily waste can cause her to get bowel cancer. It is a serious health risk for the woman. After all, at the end of the day no matter how great you think the woman’s ass may look in those super tight skinny jeans or whatever it is why women have an ass so the woman can dump farts, poo and other waste product out of her body. ",
            "date": "Answered March 24, 2020",
            "views": "399",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gary Jones",
                    "user_href": "/profile/Gary-Jones-164"
                },
                {
                    "user_id": "Leonie Smith",
                    "user_href": "/profile/Leonie-Smith-22"
                },
                {
                    "user_id": "Reva Pearlston",
                    "user_href": "/profile/Reva-Pearlston"
                },
                {
                    "user_id": "Tina T",
                    "user_href": "/profile/Tina-T-23"
                },
                {
                    "user_id": "Les Powell",
                    "user_href": "/profile/Les-Powell-5"
                },
                {
                    "user_id": "Lee Douglas",
                    "user_href": "/profile/Lee-Douglas-18"
                },
                {
                    "user_id": "July Kimono",
                    "user_href": "/profile/July-Kimono"
                },
                {
                    "user_id": "Preet Brar",
                    "user_href": "/profile/Preet-Brar-115"
                },
                {
                    "user_id": "Chandu",
                    "user_href": "/profile/Chandu-7"
                },
                {
                    "user_id": "Libby Novotny",
                    "user_href": "/profile/Libby-Novotny"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swarnali Chatterjee Yokota",
                "href": "/profile/横田-チャタジー-スワルナーリ-Swarnali-Chatterjee-Yokota"
            },
            "answer_text": "What kind of question is this? Women can fart when they need to, same as a man. Women too have gas, and digestive system. If men can fart in front of women so can women fart in front of men. ",
            "date": "Answered March 24, 2020",
            "views": "179",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gary Jones",
                    "user_href": "/profile/Gary-Jones-164"
                },
                {
                    "user_id": "Leonie Smith",
                    "user_href": "/profile/Leonie-Smith-22"
                },
                {
                    "user_id": "Noah Taylor Moran",
                    "user_href": "/profile/Noah-Taylor-Moran"
                },
                {
                    "user_id": "Mudit Johar",
                    "user_href": "/profile/Mudit-Johar-1"
                },
                {
                    "user_id": "David Wyatt",
                    "user_href": "/profile/David-Wyatt-41"
                }
            ]
        }
    ]
}