{
    "title": "Should I buy a pre-built PC or build one with the same specifications? - Quora",
    "tags": [
        "Custom PC Building",
        "Home-built Computers",
        "Personal Computing Hardware",
        "Personal Computers",
        "PC Gaming ",
        "Shopping",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "Buster Smith",
                "href": "/profile/Buster-Ecks"
            },
            "answer_text": "For a home PC, I tend to recommend building it yourself. My reason behind this is simple, knowledge. When you build your own computer, you're forced to research parts for power, compatibility, budget, and sensibility. The great thing about this is in the event that you run into a problem, you're more inclined to tackle it yourself rather than waiting for help, paying the help, and hoping the help can correctly tackle the problem quickly and effectively. Often enthusiasts will proclaim that building is cheaper than buying. Truth be told, this isn't always the case. Sometimes buying comes out cheaper than building, again you have to do research to know for sure. One thing I will say is that most builders forget to add in the cost of the OS and simple software that's typically included on a purchased computer. Please don't forget that, and know that there are online retailers who will sell OS keys for a very low price - and yes the key is legit but will lack any support. But then again, who really contacts Microsoft for support? I hear people saying they prefer to buy because everything is covered by a single warranty. Again, good argument, but problematic parts are quite rare. You're more likely to buy an incompatible part than receive a part that doesn't work properly or is DOA. Just so we're clear, I'm not biased to building. I do understand that buying has benefits as well. For starters, it's easier and quicker. There's no piecing parts together or anything of the sort. Drivers also tend to be in one place. Personally, if you're teetering in between building and buying, I'd recommend a retailer that makes \"custom\" computers. By custom, I mean that they have a list of hardware components to choose from which they'll install for you then ship you the final product. One of my favorites as IBuyPower. Select game(s) you plan on playing and at what general performance tier and from there IBuyPower builds a rig which you can roughly customize to better suit your needs and desires. I consider this the “Easy Button” because little research is needed.  ",
            "date": "Answered May 29, 2020",
            "views": "170",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Justin Marcrum",
                    "user_href": "/profile/Justin-Marcrum"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Navarra",
                "href": "/profile/Brian-Navarra"
            },
            "answer_text": "If you’re looking to get the cheapest piece of crap you can for just browsing the internet, go get a Chromebook for under 200 bucks. The higher the price point you go, the more economical it is to build your own. Anything under $500 is going to be very price competitive and economical, but there are cut corners, and no room for upgrading. Generally, if you buy a pre-built computer, the manufacturer uses the cheapest parts that they can get away with running without any major issues. For example, your computer peaks out at 300 watts, the manufacturer might put in a 350 watt power supply. Power supplies degrade a bit over time, so it’s going to rate at around 300 watts. If you want to upgrade your video card, chances are, the power supply won’t supply enough power for the new card. The motherboard might also not have the slot for expansion, and also some power supplies are ‘proprietary’ and the manufacturer doesn’t want you to upgrade. Dell was known for this at one time, but I’m not sure about now. Some builders are more upgrade-friendly, but check with the manufacturer before buying. If you do decide to build, make sure the CPU matches the socket type, match the correct memory to the board (DDR3 vs DDR4 etc) and you have an adequate power supply that is going to power everything. As a general rule, try to double the power supply rating for your needs, for multiple reasons: Some manufacturers fudge the numbers for their power supply tests, degradation over time, future upgrades, and certain times when it occasionally draws more power. The power supply also tends to run more efficiently and produces less heat when it’s not at full power draw. Also, don’t get the cheapest case possible. Spend a few dollars more. A $20 case is probably going to give you a miserable time. A $80–$100 case should be more than adequate. If you’re not comfortable building your first PC, ask a friend or family member for help. Usually, there are many computer people who would love to help you with your first build. Another downside is that you’ll have to install the operating system software yourself rather than the manufacturer install it for you, but it shouldn’t be overly stressful, unless you encounter problems during the installation. ",
            "date": "Answered May 30, 2020",
            "views": "259",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Les Markwart",
                    "user_href": "/profile/Les-Markwart"
                },
                {
                    "user_id": "Hiro Ishida",
                    "user_href": "/profile/Hiro-Ishida-4"
                }
            ]
        }
    ]
}