{
    "title": "Should the state of Indiana change its name? - Quora",
    "tags": [
        "Indiana (state)",
        "Name Changes",
        "Etymology",
        "Law",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cernowain Greenman",
                "href": "/profile/Cernowain-Greenman"
            },
            "answer_text": "Should Indiana change its name? When you consider the history of Indiana, this is a valid question. Indiana was originally named “Indiana” by European settlers on the east cost when it was the “frontier” where the Native Americans lived. It was officially named “Indiana” by US Congress in 1800 when the Northwest territory was divided up. When those settlers moved westward into the Indiana area, they forcefully relocated the Indians out, beginning in 1830. Particularly horrible was the Pottawatomie Trail of Death in 1838, when this tribe was marched out of Indiana and into Kansas. In 1846, most of the Miami tribe were moved out as well. The only Native Americans allowed to remain in Indiana were the small Pokagon band (in NW Indiana) and a few of the Miami who owned land. Considering how the Native Americans of the Indiana area were expelled, it is strange that the state still bears the name “Indiana”. The capitol, Indianapolis, ie, “city of the Indians” was originally home to a group of Lanape (Delaware) who had been forced out of their homes in the east. Then they were were also forced to leave Indiana to relocate to Kansas. Indianapolis continues to be called “Indianapolis” and its minor league team “the Indians”. It would be ironic, if it were not done intentionally. One can ask if perhaps the city of Indianapolis consider a name change as well. But should the name of “Indiana” be changed? On the one hand, keeping the name “Indiana” reminds us that this state is in no uncertain terms a stolen land as most of its original inhabitants were kicked out. On the other hand, what else could the state be named? Hoosierland? West Ohio? How about altering the name from “Indiana” to “Independence” or just “Indy”? Maybe it could be named after one of its famous inhabitants: President Benjamin Harrison (the state of “Harrison”)Lincoln (he lived there a short time, and naming it “Lincoln” would really piss off the people of Illinois)Gus Grissom (Apollo 1 astronaut, “Grissom”)David Letterman (“Land of Letterman”)John Mellencamp (“Mellencampland”)Kurt Vonnegut (maybe “Vonnegon”, like Oregon)Madam Walker (African American businesswoman, “Walker”)James Whitcomb Riley (a poet, “Riley”)Oscar Charleston (African American baseball hall-of-famer, “Charleston”)Hoagy Carmichael (songwriter, “Carmichael”)Of the above, I think “Harrison” or “Riley” would have the most possible support. There are others, such as James Dean, Larry Bird, Florence Henderson, Steve McQueen, Michael and/or Janice Jackson, Mike Pence, Dan Quayle, Jim Nabors, and Johnny “Appleseed” Chapman, which you could consider, but I don’t think these are viable. Then again, I think the thing Indiana is most famous for isn’t a person, but an event: the “Indy 500” race. So a name related to car racing might be best. I’d vote for the name of “Speedway” myself. ",
            "date": "Answered July 18, 2020",
            "views": "366",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Freking",
                    "user_href": "/profile/Maria-Freking"
                },
                {
                    "user_id": "Theresa Shea",
                    "user_href": "/profile/Theresa-Shea-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Smith",
                "href": "/profile/Bill-Smith-698"
            },
            "answer_text": "I see no problem with the name Indiana which means land of Indians. The real bugaboo name for with Indiana is the term “Hoosier.” Even though I grew up in Indiana and have lived there 35 out of 45 years of my life I refuse to call myself a Hoosier. Hoosier has different meanings in Indiana that no one has definitively determined other than some various yokel ideas such the state being named as after Hoosier’s men or “Who’s here” done in a backwoods Indiana southern style hillbilly dialect, etc. Or they call it the Hoosier state which I just find ridiculous. I’d rather be referred as a Indianian or something else at least intelligible rather than some backwoods mentality garbage that came out of some backwoods town 200 years ago that makes the state look like a bunch of wandering hilljack locals. That said and also in St. Louis slang a Hoosier is basically nothing but white trash which is another thing that occurred in the 1900s when Indiana workers went to St. Louis and East St. Louis to break strikes of the local unions protesting lousy working conditions there. So there you have it what a Hoosier truly is and I’ve never been white trash nor associated with that type of subclass of people. Indiana needs to ditch the Hoosier moniker. ",
            "date": "Answered September 8, 2020",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Theresa Shea",
                    "user_href": "/profile/Theresa-Shea-13"
                }
            ]
        }
    ]
}