{
    "title": "Should the media be charged with 'incitement to riot' for their continuous reports of a potential riot if there's a no Brexit deal? - Quora",
    "tags": [
        "Riots",
        "United Kingdom Votes to Leave the EU (June 2016)",
        "Media"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guy Campbell",
                "href": "/profile/Guy-Campbell-3"
            },
            "answer_text": "Its part of the right wing playbook. Donald Trump threatens that if he is voted out or impeached there will be a revolt, and Trumpists are forever pointing out that they are all armed and will descend on the White House should Mueller drop the bomb on Donny’s head. In the UK, Nigel Farage and his cohorts at the Daily Mail have been muttering darkly about insurrection and riots should Leavers not get the imaginary fantasy of a Brexit, and Brexiter Quorans enjoy predicting violent rejection of a second referendum. What they don’t realise so much, is that not everyone is motivated by fear like they are. Fear of the other, fear of the foreign, fear of the new. Conservatives live their lives and cast their vote against, not for things. Three-quarters of a million people turned out to reject a destructive Brexit. 100,000 hit the streets to demonstrate against Trump, in London. The empty threats of the far right should be met with hollow laughter. And if necessary, we can have a second battle of Cable Street as well, which will go as badly for them as the first one did. Battle of Cable Street - Wikipedia ",
            "date": "Answered December 19, 2018",
            "views": "175",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simon Carter",
                    "user_href": "/profile/Simon-Carter-95"
                },
                {
                    "user_id": "Frank Hollis",
                    "user_href": "/profile/Frank-Hollis"
                },
                {
                    "user_id": "Richard Hoover",
                    "user_href": "/profile/Richard-Hoover-13"
                },
                {
                    "user_id": "George Graham",
                    "user_href": "/profile/George-Graham-2"
                },
                {
                    "user_id": "Dave Gorst",
                    "user_href": "/profile/Dave-Gorst"
                },
                {
                    "user_id": "Alen Zsivkov",
                    "user_href": "/profile/Alen-Zsivkov"
                },
                {
                    "user_id": "Cleo Short",
                    "user_href": "/profile/Cleo-Short"
                },
                {
                    "user_id": "Mario Ramos",
                    "user_href": "/profile/Mario-Ramos-45"
                },
                {
                    "user_id": "Antonio Tela",
                    "user_href": "/profile/Antonio-Tela"
                },
                {
                    "user_id": "Mike Down",
                    "user_href": "/profile/Mike-Down-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Sloan",
                "href": "/profile/Alan-Sloan-1"
            },
            "answer_text": "No, I think it is a good thing to air these fantasies, and especially to enquire from the propagators if this a threat or a political science type observation. I love watching them squirm on that one. Lets face it, the riot-prone Brexiteers are not the sharpest knives in the box and break down very quickly under scrutiny. They are desperate be heard, they know they are thick but just need the attention so badly they’ll do anything. The good news is their tactics are likely to be rubbish so it will be easy to get them into a corner where their heads can be kicked in - if you have the heart fir that sort if thing, which I dont, I hasten to add. And dont you do it either - it would be naughty. ",
            "date": "Answered December 19, 2018",
            "views": "15",
            "upvotes": "0"
        }
    ]
}