{
    "title": "Since when did building a website come to be called programming? - Quora",
    "tags": [
        "Website Building",
        "Computer Programming Websites",
        "Web Design",
        "Websites",
        "Programming Languages",
        "Web Development",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlos Araya",
                "href": "/profile/Carlos-Araya-1"
            },
            "answer_text": "From my perspective, it depends on how you build the site and how you define programming. I prefer the term web development for the general practice and then qualify it as frontend and backend. Modern sites, particularly those built with frameworks are written primarily in Javascript so people can say that building such a website is web programming. Most people put the entire development process under the term It’s dangerous to say something has never happened or never been done. What is Web Programming? or Fundamentals of Web Programming would prove you wrong ",
            "date": "Answered October 24, 2020",
            "views": "166",
            "upvotes": " Answer requested by Takizawa Hiroshi",
            "upvoters": [
                {
                    "user_id": "Takizawa Hiroshi",
                    "user_href": "/profile/Takizawa-Hiroshi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Hersom",
                "href": "/profile/Steven-Hersom-1"
            },
            "answer_text": "It depends on the method you’re using to create a website. For example, there are popular CMS such as WordPress and website builders such as Wix, Zyro, or Squarespace that helps users build a website without any coding. So, in this case, website building shouldn’t be called programming. However, a website can also be coded by hand from scratch. So this process can be referred to as programming. ",
            "date": "Answered October 27, 2020",
            "views": "190",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Tjipke van der Heide",
                "href": "/profile/Tjipke-van-der-Heide"
            },
            "answer_text": "Why call it something else when it's programming? It's probably called that way since it first became a thing. Since, you know, website's are written in code, and writing code is often called programming? Unless of course you don't write code for it. In which case it isn't called programming. ",
            "date": "Answered October 24, 2020",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Johanna Berglund",
                "href": "/profile/Johanna-Berglund-2"
            },
            "answer_text": "building a website is not and have never been called programming. When developing a website tho, programming languages are used. ",
            "date": "Answered October 24, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ken Burgett",
                "href": "/profile/Ken-Burgett"
            },
            "answer_text": "It was called programming before it was called ‘building a website’. Programmers built the first websites. ",
            "date": "Answered October 24, 2020",
            "views": "31",
            "upvotes": " Answer requested by Takizawa Hiroshi"
        }
    ]
}