{
    "title": "The 70s and 80s were nearly 40 and 50 years ago. Do they feel like they passed yesterday? - Quora",
    "tags": [
        "1970 (year)",
        "1980 (year)",
        "1970s",
        "1980s",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jackie Michel",
                "href": "/profile/Jackie-Michel-4"
            },
            "answer_text": "I can only speak for the 80s since I never experienced the 70s (I was born in early 80) but the 80s to me feels totally different from today while the 90s not so much. I entered preschool in 83–84 and remembered my daily allowance was only a few cents which back then was enough for me to buy a sandwich and a soda. I was biking around, operate a gas stove, secretly puffed my dad’s cigarette one time when he asked me to hold it while he was doing something, lol. And there were only 3 channels and our TV set was a 70s style with door that we had to constantly adjust the antenna. We didn’t have cable until the early 90s. Every morning and afternoon, we watched Smurfs, Carebears, Thundercats, Inspector Gadget, Ghosbusters, Sesame Street, Alf and my country’s local teen variety show while in evenings I watched Golden Girls, A-Team, Miami Vice, McGyver with my Boomer aunties. After the 11pm news, the TV signals were off. I definitely miss the simpler times. On top of that, it was the decade wherein I witnessed how social revolutions worked to overthrow a dictatorship. I also remember the time I was reading my children’s encyclopedia about geography and Germany was still divided between East and West, Eastern Europe were considered communist countries while in our atlas which my dad bought in 1990, Germany was already one nation while the USSR was still there. Whenever I think about all these events from my childhood and tween, it makes me feel so old but proud to be a child of the 80s. ",
            "date": "Answered September 14, 2020",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Keith Bate",
                "href": "/profile/Keith-Bate-1"
            },
            "answer_text": "Too true ! “The past is a Foreign Country they DO things differently there “ (JP Hartley “The Go between”) . My fav first line from any novel The foreign Country that was the GB of the 1970’s and 80’s burns in my memory. So near yet so far. Many I know from those two decades have passed : family , friends , work colleagues . Not all old . My Younger Brother Ian died of Cancer in 1986 aged barely 20 years old. He made his mark. He recorded a music album that is rare and collectible . “If only” The Sears (1984) But as for me I endure and swim through the currents of life “For me the road go’s ever on “ (JRR Tolkien) “I will be dragged kicking and screaming into that good night” (Dylan Thomas ) …………………………………………………….nuff said ! ……………………………………………………. ",
            "date": "Answered October 22, 2019",
            "views": "154",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bengt Lindvall",
                    "user_href": "/profile/Bengt-Lindvall"
                },
                {
                    "user_id": "Veronique Helmridge-Marsillian",
                    "user_href": "/profile/Veronique-Helmridge-Marsillian"
                },
                {
                    "user_id": "Kenneth Hau",
                    "user_href": "/profile/Kenneth-Hau-2"
                },
                {
                    "user_id": "Jim Busbin",
                    "user_href": "/profile/Jim-Busbin"
                }
            ]
        }
    ]
}