{
    "title": "The tricorn hat seemed to have gone from being the hat of the 18th century to almost disappearing overnight in the 19th century. Was this a case of tricorns being 'so last century?'? - Quora",
    "tags": [
        "History of Fashion",
        "The 18th Century",
        "Hats & Caps",
        "20th Century",
        "19th Century",
        "World History",
        "History of the United States of America",
        "Fashion and Style",
        "Clothing and Apparel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Kennedy",
                "href": "/profile/Tim-Kennedy-19"
            },
            "answer_text": "Why does any garment go out of fashion? As you say it was due to people wishing to move away from the old fashions. Other fashions of the time died at the same time for example huge bouffant hairdos for fashionable ladies, and buckled shoes. Other things changed too. The 1700s were regarded as a disreputable era by the late Georgians, despised as a time when sexual morals were lax. The early 1800s saw a rise in Christian worship and church attendance which continued into the Victorian era. In fact ‘immorality’ did not go away , it just went underground. The tricorne hat actually survived in a modified ‘bicorn’ style for British Royal Navy Officers into the 1800s. Lord Nelson is wearing one on top of his column in Trafalgar Square. ",
            "date": "Answered July 16, 2019",
            "views": "155",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raditya Abyudaya",
                    "user_href": "/profile/Raditya-Abyudaya"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Fagg",
                "href": "/profile/Chris-Fagg"
            },
            "answer_text": "Became identified with the lower classes when the Regency dandies introduced new styles: see regency era men's hats ",
            "date": "Answered July 16, 2019",
            "views": "51",
            "upvotes": "0"
        }
    ]
}