{
    "title": "The Muslim caliphate of Baghdad was destroyed by Hulagu Khan, the Mongol. How come the Mongols later adopted Islam faith? - Quora",
    "tags": [
        "Mongolian Ethnicity and People",
        "Mongol Empire",
        "Muslims"
    ],
    "response": [
        {
            "author_info": {
                "name": "Syed Waizuddin Shah Khadri",
                "href": "/profile/Syed-Waizuddin-Shah-Khadri"
            },
            "answer_text": "The Land conquered it's Conquerers. The barbarian Mongals invaded the city of Baghdad, the biggest centre of learning, commerce and the most developed city of the world, at a time, when Europe was stricken with plague and death. Hulagu Khan's army destroyed the architecture, the Universities, the gardens, the hospitals, the house of knowledge, and the Great library of Baghdad.  It is said that such a large number of books were thrown into the River Tigris, that a horse could be made to walk over the river filled with books and the water ran black due to ink, for days. The 7 days following this saw about a million people killed mercilessly and towers of skulls erected in Baghdad. Hulagu asked his men to gather all scholars in a field and made to stand in rows. He rode a horse with a lemon in his hand, tossing and catching it over and over again, as he herld abuses and dared them to challenge his might. He asked “Who is going to save you from my fury today?” Imaam Yusuf, an aged Sufi scholar gave a stern reply, he said “ Allah will save me. He can topple the thrones and powers in seconds and no one can stand even the slightest chance against His will”. Hulagu was shocked to see someone reply to him, a powerful invader, in such a way. He missed to catch the lemon and as it went down, he bent over to catch it and accidentally kicked the horse. His horse ran wildly and Hulagu toppled, but with one leg stuck in the saddle. He was draged around and bled to his death, miserably, mercilessly [1]. He was buried by his men in Shahi Island, near lake Urmia [2]. The Mongol Invaders during such raids and massacres were influenced by the words of great Sufi mystics, who changed the views of the Invaders towards life, it's purpose and humanity. The barbaric Invaders and their next generations embraced Islam, settled there and rebuilt the city of Baghdad themselves. Within two generations all the Mongals converted to Islam. Eventually 3 of the 4 Khanates that formed the Mongol Empire would embrace Islam. [1] The death of Halaku Khan [2] Hulagu Khan - Wikipedia ",
            "date": "Updated December 9, 2017",
            "views": "13",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Harun Rashid",
                    "user_href": "/profile/Harun-Rashid-455"
                },
                {
                    "user_id": "Mahmoud Elfar",
                    "user_href": "/profile/Mahmoud-Elfar-1"
                },
                {
                    "user_id": "SYED",
                    "user_href": "/profile/SYED-351"
                },
                {
                    "user_id": "Akbar Muhammad",
                    "user_href": "/profile/Akbar-Muhammad-3"
                },
                {
                    "user_id": "Jamil Abdullah Chy",
                    "user_href": "/profile/Jamil-Abdullah-Chy"
                },
                {
                    "user_id": "Sanjay Patil",
                    "user_href": "/profile/Sanjay-Patil-390"
                },
                {
                    "user_id": "Sufyan Khan",
                    "user_href": "/profile/Sufyan-Khan-10"
                },
                {
                    "user_id": "Muhammad Aasim Shamim",
                    "user_href": "/profile/Muhammad-Aasim-Shamim"
                },
                {
                    "user_id": "Ahmed Ruhul Alom",
                    "user_href": "/profile/Ahmed-Ruhul-Alom-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SYED-SAQLAIN-32"
                }
            ]
        }
    ]
}