{
    "title": "To which religion did Alexander the Great belong? - Quora",
    "tags": [
        "Famous Greeks",
        "Alexander the Great",
        "History of Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dimitra Triantafyllidou",
                "href": "/profile/Dimitra-Triantafyllidou"
            },
            "answer_text": "I agree with all previous answers. Alexander like his family and his fellow countrymen practiced Greek polytheism. It is not correct to say that he followed different religions. I think different cults is more accurate.  Different regions had their preferred deities. Some of these deities were worshipped as the region's or city's patron/patroness and were attributed far greater importance than the other gods. For example Athens patroness was Athena Pallas and Pella's was Athena Alkidemos (Athena of the strong community).  It might be unfamiliar in Protestant areas but in fact this concept still exists today in Greece and Italy where each city has its own patron saint.  The same concept holds true for people and families. So who were Alexander's patrons? We know that the Argead kings' patron were Zeus and Hercules (Ηρακλής Πατρώος) who they claimed as great-great-great-great-....-grandfathers. This little symbol (talisman?) was in the inside of Philip's ornamental shield. Athena was also a patroness.   (Sorry I couldn't get a better picture).  But the Macedonian kings were also high-priests of the Macedonians. Following what was probably a very ancient tradition they were responsible for leading the army in certain \"cleansing\" ceremonies before/after battle and for conducting specific sacrifices daily. Even after falling ill Alexander continued his duties.  This is the Diadem, a high priest's head dress found in Philip's tomb at Aigai. There several coins of Alexander and of the Diadochi with a diadem that prove its use by Alexander.   There is also a torch, a very unusual artifact for a king.. There is however a mention that when Spartans (who also were a monarchy) went to war the king was preceded by a torchbearer.   ",
            "date": "Answered January 16, 2016",
            "views": "88",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Piersonn",
                    "user_href": "/profile/Alan-Piersonn"
                },
                {
                    "user_id": "Sylvia Denlinger",
                    "user_href": "/profile/Sylvia-Denlinger"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Natalia-Nezvanova"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                },
                {
                    "user_id": "Patrick Garvey",
                    "user_href": "/profile/Patrick-Garvey-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Theodore",
                "href": "/profile/Steve-Theodore"
            },
            "answer_text": "Alexander seems to have pretty conventional Greek Olympian beliefs (which doesn't tell us much, since Greek religion was not very systematic or centralized).  However he was himself a religious figure of some importance. During his conquest of Egypt he courted native Egyptians  by appealing to traditional Egyptian religious beliefs.  He visited the Oracle of  Siwa, a famous Egyptian holy site deep in the Libyan desert, and emerged with the claim that he was the son of \"Zeus Ammon\" -- a hybrid of the chief Greek deity Zeus and Amun-Ra[1], the the head of the Egyptian pantheon.   He ruled Egypt with the title and some of the trappings of an Egyptian Pharaoh, although he didn't stay long, as he was still warring against the Persians.  The Persians -- who in most of their empire were fairly tolerant -- were extremely unpopular in Egypt and had denigrated the native religion, so Alexander's patronage gained him an enthusiastic following.  After his death the Ptolemies ruled Egypt with many of the same concessions to Egyptian style.    Zeus-Ammon (left) and Alexander (right).  The horns over the ears are a Greek version of the traditional animal-headed deities of Egypt.  Here's a more traditional representation of Amun:   Alexander caused a lot of friction among his own army by openly ruling as a 'living god'.  He ordered Greek cities to put his statues in temples, and  he minted coins showing himself holding the thunderbolt (traditionally, the symbol of Zeus)   Coin of Alexander showing him holding the thunderbolt. His soldiers seemed not to care what he said to the Egyptians or later the Persians but there were several incidents in which old comrades made fun of Alexander's divine status when he started to expect similar honors from Greeks and Macedonians. He    irritated his officers by demanding that they prostrate themselves before him (A Persian custom which Greeks had proudly disdained).  Callisthenes, one of Alexander's early biographers, was executed after remarking unfavorably on the custom.    After Alexander's death, treating emperors as living gods became a staple of Greek politics (a practice which the Romans found ridiculous during the Republic, but which eventually was applied to Roman emperors too).  Alexander continued to receive worship in several of the cities he founded (notably Alexandria, in Egypt) long after his death.   Some people think the figure of Dhul-Qarnayn, the 'Two-horned one' who holds back Gog and Magog in the Koran, is Alexander in his Ammon-guise -- though this is highly disputed.  [1] Alexander didn't invent the association of Zeus and Ammon -- there was apparently a statue of a Ram-horned Zeus at Delphi more than a hundred years before Alexander, and the Spartans in particular paid a lot of respect to the Oracle of Siwa. ",
            "date": "Answered November 30, 2015",
            "views": "352",
            "upvotes": " View 43 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zakaria Al Mamun",
                    "user_href": "/profile/Zakaria-Al-Mamun-2"
                },
                {
                    "user_id": "Nicola Briggi",
                    "user_href": "/profile/Nicola-Briggi"
                },
                {
                    "user_id": "Pavel Zdut",
                    "user_href": "/profile/Pavel-Zdut"
                },
                {
                    "user_id": "John Oparinde",
                    "user_href": "/profile/John-Oparinde"
                },
                {
                    "user_id": "Beau Richardson",
                    "user_href": "/profile/Beau-Richardson-2"
                },
                {
                    "user_id": "Alicia",
                    "user_href": "/profile/Alicia-421"
                },
                {
                    "user_id": "Robby Shima",
                    "user_href": "/profile/Robby-Shima"
                },
                {
                    "user_id": "Prafful Allamraju (प्रफुल అల్లంరాజు)",
                    "user_href": "/profile/Prafful-Allamraju-प्रफुल-అల్లంరాజు"
                },
                {
                    "user_id": "Amazing Developer",
                    "user_href": "/profile/Amazing-Developer"
                },
                {
                    "user_id": "Yogesh Santwani",
                    "user_href": "/profile/Yogesh-Santwani-1"
                }
            ]
        }
    ]
}