{
    "title": "To what extent did slavery benefit the US? How would the US be different today if slavery never happened in the US? - Quora",
    "tags": [
        "History of Slavery",
        "Slavery",
        "History of the United States of America",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karl Burkhalter",
                "href": "/profile/Karl-Burkhalter-1"
            },
            "answer_text": "The North's primary revenue source textiles depended on Slave grown cotton. Slavery was here thousands of years prior to Columbus and African Slaves were here 79 years before Jamestown. If the Confederacy were to survive as a separate country, there is no doubt that its import tariffs would be much lower than those of the United States. President Jefferson Davis announced in his inaugural address, “Our policy is peace, and the freest trade our necessities will permit. It is…[in] our interest, [and those of our trading partners] that there should be the fewest practicable restrictions upon interchange of commodities.” Later Confederate Secretary of State Judah Benjamin offered France a special tariff exemption “for a certain defined period” in exchange for diplomatic recognition. During the entire war Confederate tariffs raised less than $4 million as compared to other war taxes of over $120 million. A low Confederate tariff presented the remaining states of the truncated Union with two consequences. First, the Federal government would lose the great majority of its tax revenue. Articles imported into the Confederacy from Europe would divert tariff revenue from the USA to the CSA. Additionally, the Confederacy’s low duties would encourage Northern-bound European imports to enter in the South where they could be smuggled across the Ohio River, or the other vast boundaries of the Northwestern states, to evade U. S. duties. Tariff compliance would become minimal thereby causing the Federal tax structure to collapse. Second, as a result of its lower tariff, residents of a Southern Confederacy would likely buy most of their manufactured goods from Europe as opposed to the Northern states where prices were inflated by protective tariffs. Thus, after the opening shots at Fort Sumter the Northern states chose to fight to “preserve the Union” because they wanted to avoid the anticipated economic consequences of disunion. “Preserving the Union” as an abstraction is simply not a satisfying explanation. In January 1861 The Philadelphia Press editorialized, “It is the enforcement of the revenue laws, not the coercion of the state that is the question of the hour. If those laws cannot be enforced, the Union is clearly gone.” Author Charles Adams reasons: If trade were to shift to the Southern ports because of a free trade zone, or extremely low duties relative to the North, then [the] great cities [of the Northeast] would go into decline and suffer economic disaster. The image painted by these editorials [from newspapers of Northeastern cities] is one of massive unemployment, the closing of factories and businesses, followed by unrest, riots, and possibly revolution. The inland cities of the North would also go into decline, like Pittsburg, where duty-free British steel and iron products would cripple the American steel industry. Ward Hill Lamon who was Lincoln’s legal partner for five years before the war and his personal bodyguard during the presidency explained why Southern secession was such a frightening threat to Northerners: [Cotton] formed the bulk of our exchanges with Europe; paid our foreign indebtedness; maintained a great marine; built towns, cities, and railways; enriched factors, brokers, and bankers; filled the federal treasury to overflowing, and made the foremost nations of the world commercially our tributaries and politically our dependents. A short crop embarrassed and distressed all Western Europe; a total failure, a war, or non-intercourse, would reduce whole communities to famine, and probably precipitate them into revolution. On the eve of the Civil War New England based cotton textile manufacturing was America’s single biggest industry. In 1860 its goods were valued at $115 million as compared about $73 million for wool and iron, which were the number two and three ranking manufacturing industries respectively. A valid study of the causes of the Civil War requires an examination of the reasons the Northern states chose to fight instead of letting the cotton states seceded peacefully. The North’s economic self-interest is too often minimized and even ignored by modern historians. Excerpt from Abbeville Institute ~El ",
            "date": "Answered August 12, 2020",
            "views": "228",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rick McDonald",
                    "user_href": "/profile/Rick-McDonald-49"
                },
                {
                    "user_id": "Gary Keith",
                    "user_href": "/profile/Gary-Keith-42"
                },
                {
                    "user_id": "Russell Person",
                    "user_href": "/profile/Russell-Person"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gene Hennig",
                "href": "/profile/Gene-Hennig-1"
            },
            "answer_text": "It depressed the economy in the South, stopped industry,, and kept it agricultural. And it also depressed wages. It hurt the Southern economy & kept it backward. And of course it led to the Civil War. A few got rich, but overall, it was a drag on the economy. ",
            "date": "Answered August 15, 2020",
            "views": "127",
            "upvotes": "0"
        }
    ]
}