{
    "title": "To what extent can it be argued that the character of Louis XVI was the major cause for the crisis in 1789 in France? - Quora",
    "tags": [
        "Louis XVI (historical figure)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adrian Garcia-Landa",
                "href": "/profile/Adrian-Garcia-Landa-1"
            },
            "answer_text": "Louis the 16th was an ordinary man that by chance of birth was propelled to the position of absolute monarch. He had absolute powers and cold in theory enforce everything he wanted. But to face the massive crisis that led to the french revolution — it was a financial crisis, France had a gigantic debt it couldn't master any more — you would have needed an energetic, imaginative, daring personality. Instead of that, Louis liked to go hunting and when he came back, he loved to play with clockworks and locks. The aristocracy had immense wealth, the clergy as well, yet they paid no taxes. All powers of french society having been neutralized by the crown — parliament had last seated in 1614, the provinces were we facto managed by royal bureaucracy while the aristocrats owning the land received a yearly payment in return — no one felt responsible for bringing up a solution. They had all been barred from responsibility, it was the kings job to find solutions. What clergy and the aristocracy could do however is to resist necessary reforms. So while capable ministers of Louis xvi proposed the right thing to do, they were met with fierce resistance. No doubt a king with a more dominant personality could have had his way and beat that opposition. But Louis didn't, so in last resort his council reverted to the nuclear option as we would say nowadays. Call in the estates general, the parliament of France, that had been stashed away by royal power for 150 years. The parliamemt had the right to change taxation laws, but reverting to it was already a sign of weakness. That opened the door for all the unsatisfaction that had been oppressed in France for centuries. It was basically like opening the lid of a steam.cooker too soon, it blew everything to pieces. The commoners who had always been the most numerous group of societ, had during the first stages of the industrial revolution become its most dynamic economically. They wanted to participate in.power instead of financing an incompetent and lazy elite with their tax money. They seized the opportunity to change the way France as ruled. The first stage of the french revolution was comparatively peaceful compared to what happened in the further stages. It resulted in France becoming a constitutional monarchy with Louis 16 still being the king. He could have left it at that and appreciate the fact that although weak and incompetent, people liked him enough to let him be king. He would have lived happily ever after and France would have prospered under a stable and fair political system. But Louis was weak and influencable. His entourage and his fellow aristocrats in Europe persuaded him to rebuke the new order. A plan was schemed to make Louis flee France in secret, his king colleagues of Europe would then round up an army and crush the french commoners and reinstall Louis as an absolute king. Unfortunately during his attempt.to flee, he was recognized and captured. People were outraged as that meant perjury. The king had sworn an oath on the constitution and by fleeing, he had shown his oath to be phony. The king was imprisoned and tried for high treason before the parliament. When it had to decide the sentence, death penalty or prison for life, the parliamentarian were asked to.show their decision by sitting themselves to the right (prison) or to the left (death) of the assembly. This was the origin of the traditional left and right division of the political landscape. After the decapitation of Louis xvi, things got completely out of hand. The European kingdoms declared war on France, the constitution was no longer in effect, the political climate had become one of open conflict, France drifted into civil war while being attacked from outside. The situation.was desperate. The parliament installed a committee of public welfare that was given immense powers. That was 1793, the year that is remembered as the terrible one. In January the king was beheaded, by summer France was Armageddon. The guillotine worked around the clock to squash the internal rebellion, french armies of citizens defended their nation against the armies of European monarchs and against uprisings within. Millions of dead, unnecessary wars, loss of life and not least, of his head. That was the result of Louis xvi lack of personality. ",
            "date": "Answered March 22, 2018",
            "views": "774",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tsuk János",
                    "user_href": "/profile/Tsuk-János"
                },
                {
                    "user_id": "Vicki Baxter",
                    "user_href": "/profile/Vicki-Baxter-4"
                },
                {
                    "user_id": "Nathan Donaldson",
                    "user_href": "/profile/Nathan-Donaldson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yves Epelboin",
                "href": "/profile/Yves-Epelboin"
            },
            "answer_text": "Yves Epelboin's answer to Did people in France like Louis XVI? ",
            "date": "Answered March 25, 2018",
            "views": "158",
            "upvotes": "0"
        }
    ]
}