{
    "title": "Visighots were Slavic tribes from the Vistula region. How far did they emigrate? - Quora",
    "tags": [
        "Emigration"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Cole",
                "href": "/profile/Tim-Cole-1"
            },
            "answer_text": "The Visgoths, or Western Goths evolved through ethnogenesis (the formation of an ethnic group through a process of self-identification) between at least two older Germanic tribes during the Migration Period (\"Völkerwanderung\", c. 300–800). In his Germania, the Roman historian Tacitus mentions a people called Gotons or Gutons who settled around the mouth of the Vistula in modern-day Poland. Most historians believe these to be the ancestors of the Goths, but others maintain that the ethnogenetic blending occurred later when the tribes moved to the Black Sea area to what is now the Ukraine. By the middle of the 3rd century the Gutons split into eastern (Greutungi) and western (Therwingi) tribes which became the Ostrogoths and the Visigoths. The Terwingi crossed the Danube into Dacia, where they defeated and killed the East Roman emperor Valens in the Battle of Adrianopel (378). In 382, they became foederati (allies) of Rome and later moved to Gaul, where they established their capital at Toulouse. They were later forced by the encroaching Franks to move to Spain where they established a new capital at Toledo before being defeated and dispersed by the Muslim Moors who invaded the Iberian peninsula in the 8th century. In the meantime, the Ostrogoths were conquered and subjected by the Huns under Attila around 375 but later went on, under their king Theoderic the Great, to conquer Rome before themselves being defeated and dispersed by East Rome around 550. ",
            "date": "Answered October 21, 2020",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Łukasz Rzepiński",
                "href": "/profile/Łukasz-Rzepiński"
            },
            "answer_text": "Goths were not Slavs. According to common knowledge they were Germanic tribe from Scandinavia. Vistula was region on path of their migrations. ",
            "date": "Answered October 21, 2020",
            "views": "33",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "László Pál",
                    "user_href": "/profile/László-Pál-1"
                },
                {
                    "user_id": "Cveta Georgieva",
                    "user_href": "/profile/Cveta-Georgieva"
                },
                {
                    "user_id": "Michael Baumgartner",
                    "user_href": "/profile/Michael-Baumgartner-8"
                },
                {
                    "user_id": "Nikolay Ivanov",
                    "user_href": "/profile/Nikolay-Ivanov-62"
                }
            ]
        }
    ]
}