{
    "title": "Was Ray Nagin, the former mayor of New Orleans, the real cause of slow recovery after Hurricane Katrina? - Quora",
    "tags": [
        "Ray Nagin",
        "Hurricane Katrina (2005)",
        "U.S. City Mayors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guy Rich",
                "href": "/profile/Guy-Rich-9"
            },
            "answer_text": "Yes, he is responsible for a large, but not a majority part of the problems. He was corrupt, but also seemed to suffer some kind of psychotic break, after which he became utterly incompetent, but crooked (not unusually for his predecessors). He also made horrible staffing choices, most particularly Ed Blakely, a self-styled disaster expert who actually managed to parlay his complete botch of Katrina recovery into another botched role in Australia. He was a classic narcissist, as he wrecked one thing after another he wrote paeans of praise to himself, by himself. President Bush’s incompetent neglect and the complete unpreparedness of his administration finished the job. Carl Backes, above, makes a profession of demeaning New Orleans in any way that he can. While there WERE many victims of the Corps of Engineers negligence, and a normal number of people that simply remained victims, the overwhelming majority fought to get resources, rebuilt, improved, and moved on. It makes one wonder what happened to Carl before he left. His diatribe about the removal of the statues of several skillful but treasonous people really makes that plain. His focusing criticism on the two most recent mayors (who brought those statues down), who have led the most constructive and honest administrations perhaps in the state’s history, reinforces that judgement. Many southerners regret the passing of those eras of racial dominance and emblems of the war to retain slavery. Many more have moved on. I am one of those people who picked up tools and moved on to rebuild. After 4 weeks of living in a chemical plant, 6 weeks of living in a colleague’s bedroom, 3 months of sharing a house, and 3 years of renovating and living in an apartment across from my house (all while working on the house), we moved back in (March, 2009) into a house 10 feet taller (raised above flood risks), 30% more capacious, with a big front and back porch. It’s fantastic. Everyone I know returned to the city and rebuilt better than before. Now we have better schools, great (2) mayors, and a decent city council. Corruption is a tiny fraction of before. ",
            "date": "Answered December 27, 2019",
            "views": "73",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gerry Surette",
                    "user_href": "/profile/Gerry-Surette-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Backes",
                "href": "/profile/Carl-Backes"
            },
            "answer_text": "No. The real reason is the population itself. After Katrina, we had a choice. We could become victims or successful survivors. A majority chose to be victims. For them, it became an issue of “I need help” rather than “what I can do to rebuild “. They elected the current Mayor and City Council who are great examples of poor leadership. It is more import to spend $2 million dollars to remove monuments and statues that cause no harm than to spend money to fight crime, repair streets, update drainage systems and tear down the remains of the many buildings that are uninhabitable as a result of the flooding. The City has chosen as a whole to be a victim, which, while I will always be a New Orleanian, I will never live there again. New Orleans was once a great place to visit and an even better place to live. It then became a good place to visit. Now, it is a dangerous place to live and an even more dangerous place to visit. French Quarter stabbing death recorded, posted to Snapchat ",
            "date": "Answered September 25, 2017",
            "views": "196",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lloyd C Reid Jr",
                    "user_href": "/profile/Lloyd-C-Reid-Jr"
                },
                {
                    "user_id": "Wayne Peltier",
                    "user_href": "/profile/Wayne-Peltier"
                },
                {
                    "user_id": "James Ware",
                    "user_href": "/profile/James-Ware-32"
                }
            ]
        }
    ]
}