{
    "title": "Was it common to hijack vehicles during WW2? - Quora",
    "tags": [
        "Hijacking",
        "Tanks (armored combat vehicles)",
        "Nazi Germany",
        "Vehicles",
        "World War II",
        "Germany",
        "Military History and Wars ",
        "Cars and Automobiles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander James Irons",
                "href": "/profile/Alexander-James-Irons"
            },
            "answer_text": "It was so common for the Germans to use captured enemy armor they had a word for it “beutepanzer”. It translates as “loot armor” or captured armor.  So many things to address: Tigers were lost because of maintenance failures spurring from the overcomplicated design and Allied air raids: either they got ditched because there was no hope of repair, or more often, fear the tank would be targeted by fighters and bombed. Ammo was comparatively common.Shermans could very much defeat a Tiger, depending on the model of Sherman and type of anti-tank round. Front armor was often difficult except at very close ranges due to deflection, but side armor could be vulnerable at slightly farther ranges.Captured tanks were hard to use due to the damage generally done to them prior, lack of ammo/parts, lack of crew training, and high risk of friendly fire. Tanks couldn't really be stolen, as they're pretty much useless to someone who steals it. Tanks require ammunition, maintenance and spare parts in abundance, and the Allied logistics chains deliver ammunition and spare parts for their tanks, not those of the enemy. Things like firearms or knives were taken all the time as trophies, and intact vehicles could be captured, but it wouldn't be cost effective to try and put those captured vehicles into service on a regular basis.That said, the Germans used a large number of French tanks as tractors and for patrol duties, while the Soviets ran German tanks until they broke down whenever they could claim them, and everyone used captured tanks as ad-hoc artillery. The Western nations, however, preferred to take captured tanks back home to study them, looking for weakness to exploit or advantages to copy. By the time this was no longer necessary, the Germans had lost most of their tank production, so there was very little to capture. ",
            "date": "Answered February 11, 2019",
            "views": "411",
            "upvotes": " View 418 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Annambhatta Tirumala",
                    "user_href": "/profile/Annambhatta-Tirumala"
                },
                {
                    "user_id": "Jack Gray",
                    "user_href": "/profile/Jack-Gray-77"
                },
                {
                    "user_id": "Tim Larsen",
                    "user_href": "/profile/Tim-Larsen-29"
                },
                {
                    "user_id": "Dušan Janiš",
                    "user_href": "/profile/Dušan-Janiš"
                },
                {
                    "user_id": "Enrique Vonchong",
                    "user_href": "/profile/Enrique-Vonchong"
                },
                {
                    "user_id": "Dave Cosby",
                    "user_href": "/profile/Dave-Cosby"
                },
                {
                    "user_id": "Sunny Katu",
                    "user_href": "/profile/Sunny-Katu-1"
                },
                {
                    "user_id": "Jan Keller",
                    "user_href": "/profile/Jan-Keller-7"
                },
                {
                    "user_id": "Peter Schmidt",
                    "user_href": "/profile/Peter-Schmidt-155"
                },
                {
                    "user_id": "Ryan Daimid",
                    "user_href": "/profile/Ryan-Daimid"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mert Toker",
                "href": "/profile/Mert-Toker-1"
            },
            "answer_text": "It was very common. Let’s firstly look at from German side. During World War II the German Panzer-Divisions used about 1,000 Captured American Tanks between 1941 - 1945 , this includes the Battle of North Africa, invasion of Italy, D Day invasion of Normandy, Battle of the Bulge and even American tanks in Russian service on the Eastern Front.  War Daddy II a captured American Sherman on left tested against a Panther. Source: Warfarehistorynetwork On the other hand French tanks captured in 1940 was almost useless in battle. After the French surrender in 1940, the Wehrmacht found itself possessing large number of Franch tanks and such as Somua S35 and Char 1 bis, but also of the French production facilities and ammunition factories needed to sustain the vehicles. These early vehicles were equivalent to the Germans used and it had been a more matter of their tactical employement than their quality that hastened French defeat. So Germans kept these vehicles, used them for security of airfields and railroads and driver training in Western Europe. Later these tanks became obsolete for battlefield use , their turrets are removed and placed in bunkers and pillboxes, while the chassis found use as artillery tractors and carriers for self propelled guns. After their usefulness in direct combat is over, these tanks were employed against partisans who generally lacked anti tank weapons. Source: Warfarehistorynetwork The Germans also got many tanks from Russians and used them in battles… Mass produced Russian tanks always caused problems for spare parts which Germans had little.  German soldiers placed a Nazi flat atop the vehicle’s turret to warn friendly aircraft not to attack. KV1 Russian Tank Germans used Russian tanks in battle frequently they even produced spare parts for them. They had facility in Riga , a Daimler Benz factory in Marianfelde,and a plant in Gorlitz,all turned out T-34’s… Source: Warfarehistorynetwork  ‘’An Australian tanker uses M13/40 light tank captured by 6 th Australian Divisional cavalry in Cyrenaica,Libya, on March 4, 1941. Source: Warfare history network’’  ‘’A captured German tank used by British 4 th Coldstream Guards, 6 th Guards tank brigade.’’ Allies also gladly used German captured vehicles when they had the chance because they believed that German machines were qualitatively superior. The Allies used captured enemy weaponry in Europe and North Africa, but the Germans certainly did. As galling as it might have been for the Master Race to to admit it, the T-34 had its virtues and outnumbered as they were, the Germans were not that far above pressing captured T-34s into service. Likewise they used PPSh-41 submachine guns because of their reliability and high rate of fire. Erwin Rommel made liberal use of captured British armor and trucks to supplement his shaky supply lines, including a British command vehicle he called Der Mammut (“mammoth”). Even in the Pacific, Marines occasionally using captured Japanese items, such as the 70mm light field howitzer and Type 89 grenade projector, against their former owners.  US Marines using Jap Howitzer Source: Historynet Axis problem was always about oil. Not the amount of vehicles… Germany was able to produce tanks, planes etc. They simply did not have enough oil to run them. The fallback on synthetic oil and the human cost With German defeat in North Africa and Russia, by mid 1943, the dream of Hitler of convergence on the Baku Oilfield was now a fantasy. Germany faced a huge fuel crisis and turned to coal-based synthetic oil production which was based on the great technological ingenuity of Bergius. Germany was in a state of moral bankruptcy. Albert Speer was commissioned to rebuild Berlin and given sweeping powers of the German economy. After 2 ½ years, he had managed a threefold increase in aircraft, weapons, and ammunition production, and nearly had sixfold increase in tanks, even at a time when the Allied forces were successfully bombing German targets such as the aviation industry, railway depots, and ball-bearing factories. Between 1940 and 1943, synthetic fuel production almost doubled from 72,000 to 124,000 barrels per day, and in the first quarter of 1944, the synthetic fuel plants provided 57% of total supply and 92% of aviation gasoline. Source: e-education psu According to an article on Telegraph: A captured German Tiger Tank which was inspected by Winston Chuchill during the Second World War has been restored to working order for the first time in decades.  It has taken two-years and £80,000 to restore the Tiger Tank 131 to its original war time specification Source: Telegraph The tank is the only working example in existence and can be seen bombing around Bovington Tank Museum in Dorset. It has recently been fitted with a genuine German wartime Maybach engine and its fan drives have been re-engineered from original blueprints. Now it boasts an original inertia starter handle that needs to be wound furiously to coax into life the massive monster that terrified the Allies in the war. It is the end of a two-year, £80,000 restoration project to return Tiger Tank 131 to its original war time specification. But efforts to restore the tank by museum experts have been on-going on since the 1990s when the museum received a grant of 100,000 pounds. The tank is not fuel efficient however, and does about three gallons to the mile. And despite the efforts of restoring it, staff at Bovington have been struggling to buy enough fuel because of the panic buying across the county. The 55 ton tank was a fearsome and frightening weapon and totally superior to anything the British had during the war. Rounds from Allied tanks could not penetrate its 100mm thick armour and the tank soon gained legendary status after its introduction in 1942. Tiger Tank 131 was captured after a lucky hit by a British Churchill tank, belonging to 48 Royal Tank Regiment, in the Tunisian desert in April, 1943. The shot glanced off its powerful 88mm cannon and wedged in the turret ring, rendering it useless. The five man German crew abandoned the Tiger which was captured by the Allies intact and virtually unscathed. Winston Churchill, who was in Tunisia at the time, gave it a personal inspection and clambered all over it. It was then sent straight back to Britain for detailed examination so the Allies could look for any weaknesses. The King, George VI, also went to inspect it. It was moved to Bovington in 1951, complete with the small dent in the turret where it had been hit years before. Although museum staff have had it moving before, the engine was not right and it kept breaking down. But now it should be far more reliable with its V12 engine and having been returned to its wartime specification. David Willey, museum curator at Bovington, said: \"The Tiger tank is a vehicle with an almost mythical status which far outweighed its actual impact on the battlefield. \"It represented a significant leap forward in tank design and outmatched anything that the Allies could field at the time. \"With its powerful 88mm gun and thick armour, Allied tank crews genuinely feared an encounter with a Tiger tank - and it is this mighty reputation that has given rise to such fascination in this particular vehicle. \"It is the most complete and best preserved example, and the only one in running order. \"It is the most iconic tank of the Second World War and continues to capture the imagination of audiences in to the 21st Century. \"If you think you've got trouble getting hold of petrol at the moment, it's worth noting that to fill the Tiger's tanks would take 534 litres. \"That's 27 Jerry cans. At today's prices, that would cost around 740 pounds and you would only get around three gallons per mile off road. \"The Jerry can is so called because the British Forces preferred the German method of supplying fuel in re-usable, sealable tin cans. \"Before this, up to a third of our fuel was being lost in our equivalent, the \"flimsy\" - a big square tin that was used once and thrown away. \"So we pinched the design and the name \"Jerry Can\" stuck. \"On top of that, this Tiger was captured in North Africa where all German petrol supplies had to be shipped across the Mediterranean. \"We know that only a quarter of their supplies were getting through due to the activity of the Royal Navy and the Royal Air Force. \"As a result of this, the German Army had to be frugal with the supplies of petrol they did have.\" Propaganda Value of Captured Tanks Little is discussed about propaganda value of captured tanks. When Brits had Tigers in their use it boosted the morale of the soldiers and belief in final victory. I recently watched a movie called T-34 telling an escape story. Wonderful movie about a captured Russain tank and its crew… It also has propaganda value…  Source: Thedailybeast ‘T-34’ glamorizes the militaristic, backward-looking nationalism that Vladimir Putin counts on to mobilize ‘real’ Russians against their ‘fascist’ enemies. The new World War II tank thriller from Russian writer-director Aleksey Sidorov, T-34, is frenetic, loud and silly. \"Fast & Furious with tanks,\" is how one producer described it. It's also propaganda. The Russian Ministry of Culture ponied up part of the movie's budget, and once T-34 was done the Russian army reportedly screened it for the troops. Emboldened by the film's success, the Kremlin has been scouring the planet for old tanks it can buy back, so that it can help to make more movies like T-34without having to rely on expensive CGI. With its big, dumb, computer-generated jingoism, T-34 is hardly alone in the world. In American director Michael Bay's Transformers, for instance, the robots pose in front of American flags and speechify about freedom. Source: The daily beast ",
            "date": "Answered March 6, 2019",
            "views": "265",
            "upvotes": " View 57 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jon Thorse",
                    "user_href": "/profile/Jon-Thorse"
                },
                {
                    "user_id": "Arlen Robinson",
                    "user_href": "/profile/Arlen-Robinson-2"
                },
                {
                    "user_id": "Patrick Power",
                    "user_href": "/profile/Patrick-Power-22"
                },
                {
                    "user_id": "Colin Scinto",
                    "user_href": "/profile/Colin-Scinto-1"
                },
                {
                    "user_id": "Mario A. Vargas",
                    "user_href": "/profile/Mario-A-Vargas"
                },
                {
                    "user_id": "David C. MacLean",
                    "user_href": "/profile/David-C-MacLean"
                },
                {
                    "user_id": "Elias Choo",
                    "user_href": "/profile/Elias-Choo"
                },
                {
                    "user_id": "Tom Kitta",
                    "user_href": "/profile/Tom-Kitta"
                },
                {
                    "user_id": "Sasha Golovin",
                    "user_href": "/profile/Sasha-Golovin"
                },
                {
                    "user_id": "Don Mellish",
                    "user_href": "/profile/Don-Mellish"
                }
            ]
        }
    ]
}