{
    "title": "Was Soviet Union at its peak more powerful than the United States? - Quora",
    "tags": [
        "Soviet Union",
        "Russia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clifford Heseltine",
                "href": "/profile/Clifford-Heseltine"
            },
            "answer_text": "I’m not certain the Soviet Union ever actually had a “peak”. They may have had a high point somewhere, but it was pathetic compared to what a free country could have achieved with the same resources. The only thing the Soviets excelled at (other than a really effective gulag system to suppress political dissent) was military hardware and in head-to-head combat with similar American equipment it never fared all that well. As in The Great Patriotic War (WW II) the only advantage they hold is quantity and a willingness to send young men to die in attempts to overwhelm their opponent(s). The results in Afghanistan and Chechnya put the lie to Soviet military invincibility. One has to give credit for their rockets, however. The Soyuz has had an excellent service record. Could they get men to the moon? Nope. That system failed so spectacularly that they simply abandoned the project and went to work putting robots in orbit around Venus instead. Even if you credit the Soviet Union towards the end of WW II as being at its peak, they were still not more powerful than the Germans, only more numerous. The Russian tanks by that time, and actually through most of the war, the Tiger tanks excepted, were superior to the German Panzers, but lacked radios or effective tactical control once combat commenced. Their anti-tank weapons were barely adequate. Their later model airplanes bested the ME-109s and anything new the Germans deployed, although the German jets went almost exclusively to counter the Allied bombing campaign. And by the way, the top Soviet Ace during WW II achieved this flying a lend-lease American Aerocobra fighter which we were willing to send to Russia because we had better planes for our own use. So I would suggest that the height of Soviet power was its ability to convince millions of young Red Army soldiers to run headlong into German machine guns and artillery and across known minefields until the Germans were overwhelmed, or out of ammunition, or had worn their weapons out mowing them down. Economically the Soviet system stood no chance against the western capitalist world, as no communist state did, could or ever will. ",
            "date": "Answered March 26, 2017",
            "views": "17",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Homer Quan",
                    "user_href": "/profile/Homer-Quan"
                },
                {
                    "user_id": "Frank C. Miller",
                    "user_href": "/profile/Frank-C-Miller"
                },
                {
                    "user_id": "Nunya Biz",
                    "user_href": "/profile/Nunya-Biz-67"
                },
                {
                    "user_id": "Błażej Seremak",
                    "user_href": "/profile/Błażej-Seremak"
                },
                {
                    "user_id": "Aria Kae Broeka",
                    "user_href": "/profile/Aria-Kae-Broeka"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                },
                {
                    "user_id": "Siddharth Radhakrishnan Warrier",
                    "user_href": "/profile/Siddharth-Radhakrishnan-Warrier"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Dane",
                "href": "/profile/John-Dane-6"
            },
            "answer_text": "There was a point when the USSR was actually better than the United States at around the 50s or 60s I think; and yes, I’m willing to swallow my patriotic pride to admit that. At one time their health care system was better, their general education was better, their industrial output was better, and their military was better. Sure, their soldiers weren’t better than the closest NATO equivalent back in the day but their doctrine never put a whole lot of faith in their soldiers anyway. Tactically we could kick their ass but on the operational level of war their regiments would be dancing around our allies and our own forces with abandon. Not only did they have the numbers to back that up but they also planned in depth their counter-attack against NATO armies (I want to point out that both sides believed the other would attack first. The difference was that while NATO’s plan was to dig in and hold out, the Warsaw Pact’s was to launch a counter-attack as soon as the enemy offensive was blunted.) But at its peak I believe was somewhere in the early seventies, we were relatively even then and it went downhill from there for the Soviets and satellite states or puppet regimes if you want to be more honest. ",
            "date": "Answered April 4, 2017",
            "views": "879",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gökay Aslan",
                    "user_href": "/profile/Gökay-Aslan"
                },
                {
                    "user_id": "Emir Kocak",
                    "user_href": "/profile/Emir-Kocak"
                },
                {
                    "user_id": "Sameer Hasan",
                    "user_href": "/profile/Sameer-Hasan-36"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Nermin Hajdarbegovic",
                    "user_href": "/profile/Nermin-Hajdarbegovic"
                },
                {
                    "user_id": "Aria Kae Broeka",
                    "user_href": "/profile/Aria-Kae-Broeka"
                }
            ]
        }
    ]
}