{
    "title": "Was the Black Death actually spread by rats? - Quora",
    "tags": [
        "Plagues",
        "Bubonic Plague",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Cramer",
                "href": "/profile/Will-Cramer-2"
            },
            "answer_text": "Yes, they were part of the chain that spread the plague. Let’s call the rats the carrier, a infected flea would feed off a rat and give the plague to the rat. Then another would also also feed off the rat and then feed off a human and infect them. The rats were the carriers, an infected rat would get on a ship, and its fleas would infect the other rats on the ship. Then when the ship entered another country, the rats would leave the ship with infected fleas on them, and the plague would enter an new territory. ",
            "date": "Answered June 25, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "FC Brown",
                "href": "/profile/FC-Brown"
            },
            "answer_text": "The streets of European cities were open sewers. The people were filthy. Bathing was not common. For example, King Louis XIV Of France was reputed to have had 3 baths in his entire life. People thought disease was caused by evil odors and comets (!!!). Some historians believe the Catholic Church’s crusade against cats (agents of Satan!) caused an explosion in the rat population. Rats were targets of fleas. Fleas also bit the filthy people. In addition, even when people are within hours of dying of the plague, the symptoms may not be that bad. They may still be mobile and interacting with others, sneezing, coughing, spreading bacteria. ",
            "date": "Answered May 27, 2019",
            "views": "52",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael Heffez",
                    "user_href": "/profile/Michael-Heffez-1"
                }
            ]
        }
    ]
}