{
    "title": "Was Joseph Stalin above the law? - Quora",
    "tags": [
        "Joseph Stalin",
        "History of USSR",
        "History of Russia",
        "Soviet Union",
        "Russia",
        "Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dmitriy Genzel",
                "href": "/profile/Dmitriy-Genzel"
            },
            "answer_text": "There is a lot of subtlety to this question. First, let’s ask what it means to be above the law. I can see at least two different ways you can interpret it: A person who can do actions that are outside of what the law formally allows, but there are no consequences for thisA person whose wishes simply can become the lawIf you think about it naively you might say that only the first person is “above the law”. For example, Louis XIV, who said “I am the state”, or Russian Czars who formally had the title of “Autocrat of All Russia”, or Roman dictators would not be above the law because the law provided that anything they did was lawful. Note that this does not mean that they could do literally anything (because they would face rebellion if they did), but they could do almost anything they needed to. To me, however, the distinction between the two groups is not a very relevant distinction today, and I would say that both are above the law. Let’s take a more recent example like Putin. He is generally very scrupulous in observing the forms of the law, but he has the ability to change the Russian constitution and any law he pleases, and does so. He is not quite above the law the same way a Czar was because he is more constrained in what he can do before it would trigger a backlash, but he can do anything he choses politically. Now, let’s look at Stalin. Stalin was never the official head of the Soviet state, it’s even arguable whether he was the official head of the All-Russia Communist Party, he was simply the head of its Secretariat, as General Secretary. During the war he was also the Soviet prime-minister (not the head of state) and minister of defense. For much of his time in power he had very limited legal powers. But, critically, this was by choice. He had absolute and complete control of the state, and when he decided he wanted to, he was given any government positions he chose by his “colleagues”, and he would give them away when he no longer needed them. He could give orders and expect them to be carried out without question. He generally did these in a perfectly legal way. He would say to his colleagues, “There is an opinion that such and such is the way to go”, they would agree unanimously, documents will be prepared and signed by appropriate people, and things will go forward. All of the arrests of senior officials were first formally approved by the Politburo or the Presidium of the Supreme Soviet, and carried out by the People’s Commissioner (i.e. Minister) for State Security under his authority, and they all went to formal trials, with convictions duly entered and executions carried out. If Stalin decided to commute someone’s sentence (not something he could legally do in 1937), it was officially done by the head of state (Mikhail Kalinin). Anything extra-legal would simply be made legal after the fact, or in fact used to punish officials Stalin wanted punished (called out as “violations of Socialist justice/jurisprudence”). My own opinion is that very little that Stalin ever did was contrary to the Soviet law at the time, formally speaking. At the same time, informally speaking, he could and did absolutely anything he chose without worrying about complying with the substance of the law, but only following its forms. His actions then were made compliant with the law, sometimes simply by changing the law. ",
            "date": "Answered January 30, 2020",
            "views": "662",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Norbert Voss",
                    "user_href": "/profile/Norbert-Voss-1"
                },
                {
                    "user_id": "Oleg Volkov",
                    "user_href": "/profile/Oleg-Volkov-29"
                },
                {
                    "user_id": "Jayam Thaker",
                    "user_href": "/profile/Jayam-Thaker"
                },
                {
                    "user_id": "Tudor Achim",
                    "user_href": "/profile/Tudor-Achim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Morgan Ann McDowell",
                "href": "/profile/Morgan-Ann-McDowell"
            },
            "answer_text": "Of course he was, he was a dictator!  Let me explain. You may not like what you are going to hear, but I have to say it anyways. Nobody said it was right, but that’s just the truth, if you are a dictator, you can do whatever you want. That’s just how it goes. I don’t like it, you don’t like it, congrats, we’re like the majority of the human race in that respects. I will now compare communism to religion. Another issue, is that many out there assume that he couldn’t have done communism the right way. Guess what, that’s completely incorrect! That’s like Christians saying, “He’s not a true Christian, because he kills people.” Another well known example, Muslims saying, “He’s not a true Muslims, he kills people.” I have heard a number of Christians and Muslims say this, trust me! Okay fine, at least the Christians’ and Muslims’ hearts are in the right place, especially if they hate killing, period. Keep in mind, that Christianity and Islam are older religions, and have presented mixed messages for anyone who has studied both the Bible and Quran in depth. You have one side that says, “But they are a true Muslim/Christian, the Quran/Bible says kill the non-believers. All adulterers must be stoned, all homosexuals will go to hell/or be killed.” Then you have your other side that says, “But that’s not possible, you cannot kill its a sin!” Anyone can believe one or the other, that’s why religion is so polarizing. In the end though, religion was made up for good intentions, but produced sometimes evil results under religious regimes throughout the centuries, because a bunch of evil people choose the bad and questionable passages from the books. But communism isn’t a religion, while religion preaches love and hate at the same time, it also gives you ideas about being devoted to your spouse, children, parents and community. What does communism do? It preaches power, to the government! There are no moral values at all, its purely about what the state wants, not about how to be kind to people or how to fear a God (AKA Allah) into behaving oneself. You and your family, spouse, community and children don’t belong to one another, you all belong to the state, your loyalty is to the state, not one another. It would even make it easier for you to turn on your friends, family and community too. So what the heck was Karl Marx actually talking about then? Its all about submission, and Karl Marx manipulated his thesis. Because of Marx’s flaw thinking, 100,000,000 people died under communism (under various regimes) in the last century, all because he was too stubborn to let the idea go down the drain, where it belonged. Before you use the “But religion has killed more than communism ever has!” Yes, all world religions have probably murdered way more people over the thousands of years vs communism, but the point is that communism murdered way more in a single century, even though it was a very new idea being put into practice. Simply watch the video, you may actually learn something.  My only question is this, why do you assume that communism, much like religion cannot attract a bunch of shady people? Of course it does! Anyone can be attracted to a bad idea, especially if their personalities are closer to these ideas. Yes there are many benevolent Christians and Muslims in the world, but all it takes is one bad apple to spoil the bunch. All it takes is a bunch of questionable passages written thousands and thousands of years ago, that don’t match up to Judeo-Christian culture, to once again be put into practice, so that it makes religion look purely evil. Enough with the, “Oh Stalin/Lenin/Mao/ect…. didn’t get communism right!” Of course they did, they knew what they were doing, and they could easily point to a part of the Manifesto itself and say, “I have the permission to kill those who go against the law/government! It says so here!” By that logic, you wouldn't even need proof that someone is breaking the law. So what about Stalin then? Like I said, bad ideas attract people who are closer in personality to those ideas. Stalin isn’t the only one either, Mao killed way more people than he did, whether it was purely accidental or not, didn’t matter. Lenin was okay with the Czar and his family of his wife, four daughters, a teenage son, even two of their dogs (out of three), and some of their servants being executed too. I just think that communism gave Stalin more power to be “above the law”, just like it did to Mao, Lenin, Castro, ect…… Its not right, but its the truth. ",
            "date": "Answered September 28, 2019",
            "views": "613",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vasily Smith",
                    "user_href": "/profile/Vasily-Smith"
                },
                {
                    "user_id": "Андрей Зеленин",
                    "user_href": "/profile/Андрей-Зеленин"
                },
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        }
    ]
}