{
    "title": "Was Paraguay ever Communist? - Quora",
    "tags": [
        "Culture of Paraguay",
        "Paraguay"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tabrez Alam",
                "href": "/profile/Tabrez-Alam-4"
            },
            "answer_text": "There has never been a Communist ruling party in the history of Paraguay. Most of Paraguay’s political history tightly revolves around a rather authoritarian military rule. Dr. José Gaspar Rodríguez de Francia, the first dictator of an independent Paraguay, ruled the country as a police state, heavily influenced by the ideals of the French Revolution (and the Reign of Terror).  With that start, Paraguay was ruled throughout the 19th century and 20th century by caudillo, or military strongmen. The Lopez family notably Paraguay in a fairly authoritarian, centralist manner though the government unsurprisingly collapsed following the infamous War of the Triple Alliance from 1864 to 1870, in which Paraguayan dictator Francisco Solano López thought he could defeat the combined forces of Uruguay, Brazil and Argentina. Spoiler alert: he couldn’t and instead died fighting. The war left Paraguay’s population decimated and the country destabilized. This can be reflected by the unstable political game of musical chairs between the Liberal Party and the more conservative Colorado Party, in which a rapid succession of presidents was common, often removed by force. During much of the Cold War, the Colorado Party, under the military ruler Alfredo Stroessner, ruled Paraguay with a highly anti-communist government that was US backed. Stroessner ruled from 1954 to 1989, the longest in modern South American history.  Even after Stroessner’s death, the Colorado Party more or less dominated Paraguay’s politics to this day (with the exception being when the Liberal Party won in the 2008 elections). Due to its long history of political repression and political culture, Paraguay has managed to not become ruled by a Communist party of any kind and instead had an anti-communist political atmosphere. ",
            "date": "Answered June 24, 2018",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeremiah Anderson",
                    "user_href": "/profile/Jeremiah-Anderson-4"
                },
                {
                    "user_id": "Conner Anderson",
                    "user_href": "/profile/Conner-Anderson-4"
                },
                {
                    "user_id": "Kristoffer Barks",
                    "user_href": "/profile/Kristoffer-Barks-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman De Barath Holst",
                "href": "/profile/Norman-De-Barath-Holst"
            },
            "answer_text": "Not directly, but the “February revolutionary Party”, (Partido Revolucionario Febrerista) was the furthest left-aligned government we had. It was founded when, in february of ‘36, a revolution leaded by army coronel Rafael Franco led to him being president. It failed to make communism politically relevant, but it brought new social policies, like the 8-hour-workday, sunday’s rest and a first agrarian reform and the creation of the Health Ministerium. It lasted until february of 1937, where a liberal-based coup d’etat put Felix Paiva in charge. ",
            "date": "Updated August 1, 2018",
            "views": "685",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vlada Jeremić",
                    "user_href": "/profile/Vlada-Jeremić"
                },
                {
                    "user_id": "Peter Humphries",
                    "user_href": "/profile/Peter-Humphries-7"
                }
            ]
        }
    ]
}