{
    "title": "Was life in Eastern European countries better under the Nazi occupation, or that of the Soviets? - Quora",
    "tags": [
        "Historical Power (international relations)",
        "The Holocaust",
        "Nazism",
        "History of Europe",
        "Nazi Germany",
        "World War II",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Natalia Kuszewska",
                "href": "/profile/Natalia-Kuszewska"
            },
            "answer_text": "Do you mean during WWII? Of course for Jewish people Nazi occupation was worse but for others it's hard to say. Nazi occupation (for non-Jews):- forcing people to work (e.g. my great-grandfather had to make graves for soviet prisoners from the nearest camp)- roundups which resulted in sending random people to labour camps- deportations to work in german farms (helping families whose men went to German army)- dead penalty for helping Jews- concentration camp or dead penalty for actions against Nazi soldiers (in my town one boy was killed and two others were send to Auschwitz because of beating a girl who was friend of German soldiers)- poverty, school closed etc. Soviet occupation:- deportations to gulags for every person accused of collaborating against Soviet Union- there were many fake accusations of that collaboration against Soviet Union, especially if it came to wealthy, intelligent, educated people or soldiers, policemen- mass deportations to Siberia (mainly civilians, intelligent people, people from certain villages, towns)- communists were privileged- many wealthy people lost their possesions- poverty of course I'm writing about life in Poland during the war. After the war life was not a dream... Many people were accused of collaboration againts communism and ended up with death penalty or being put into prison for many years. Witold Pilecki who experienced both Auschwitz and Soviet tortures said that the second one was much worse.Many people - especially those who fought in the West - were forced to emigrate from Poland for this reason. But definetely it was calmer and safer for average people than during Nazi occupation. ",
            "date": "Answered May 30, 2015",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Starchen",
                    "user_href": "/profile/Alex-Starchen"
                },
                {
                    "user_id": "Cam Iwea",
                    "user_href": "/profile/Cam-Iwea"
                },
                {
                    "user_id": "Luetzelschwab Madeleine",
                    "user_href": "/profile/Luetzelschwab-Madeleine"
                },
                {
                    "user_id": "Luis Gomez",
                    "user_href": "/profile/Luis-Gomez-54"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mats Andersson",
                "href": "/profile/Mats-Andersson-16"
            },
            "answer_text": "In general, in Soviet territory, the Nazis were initially hailed as liberators. Inside 6 months, there were partisan movements fighting to return to the oppression under Stalin. That’s more or less all anyone needs to know. Sure, there were always people who would have preferred the Nazis. There were probably entire regions that would have preferred the Nazis. There were likely some places that suffered worse under Stalin than under Hitler, and of course many individuals. But by and large, after trying the Nazis, they wanted the Communists back. Badly enough to risk their lives for it. And that was definitely not because they thought the Communists were nice. They were just the lesser of two evils. Given that the lesser evil was Stalin, can you even imagine how bad the Nazis were? ",
            "date": "Answered April 9, 2017",
            "views": "790",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amir Yagudkin",
                    "user_href": "/profile/Amir-Yagudkin"
                },
                {
                    "user_id": "Tommy Gunn",
                    "user_href": "/profile/Tommy-Gunn-47"
                },
                {
                    "user_id": "Doron Babad",
                    "user_href": "/profile/Doron-Babad"
                },
                {
                    "user_id": "Daniel Tiede",
                    "user_href": "/profile/Daniel-Tiede"
                },
                {
                    "user_id": "Chris Colella",
                    "user_href": "/profile/Chris-Colella-2"
                },
                {
                    "user_id": "Chase Bivens",
                    "user_href": "/profile/Chase-Bivens-1"
                }
            ]
        }
    ]
}