{
    "title": "Was bleeding or bloodletting the most popular treatment of medical problems by medical doctors in the U.S. in the 1800s and used on George Washington who died of a throat infection? - Quora",
    "tags": [
        "George Washington",
        "Medical Treatments",
        "History of the United States of America",
        "Doctors",
        "History",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick VonderBrink",
                "href": "/profile/Rick-VonderBrink"
            },
            "answer_text": "Medicine before the era of science was dominated by the theories of th ancient Greeks. Central to this theory was that the human body was dominated by the four humors (blood, black bile, yellow bile, and phlegm. Disease occurred when these humors were out of balance. Many sicknesses were attributed to an excess of blood, and therefore were treated by bloodletting. The Greek beliefs were not chased away until the mid 1800s, and were still very much in fashion in early America. Washington was treated with bloodletting many times, including his final, fatal illness of a peritonsillar abscess. The bleeding certainly did not help and almost certainly made things worse. The only consolation is that physicians of the time had nothing better to offer, so the bleeding was not done in favor of a more effective therapy. ",
            "date": "Answered October 25, 2020",
            "views": "158",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zack Walter",
                    "user_href": "/profile/Zack-Walter-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Bluestein",
                "href": "/profile/Chuck-Bluestein"
            },
            "answer_text": "This is part of history even if it is not taught in school. There is a page about bloodletting on Wikipedia that you can read so you will know about the history of this medical practice that was the most popular at one time. Look at the page called Bloodletting - Wikipedia This says the following on it: It is claimed to have been the most common medical practice performed by surgeons from antiquity until the late 19th century, a span of over 2,000 years. ",
            "date": "Answered October 24, 2020",
            "views": "236",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joel Goldberg",
                "href": "/profile/Joel-Goldberg-21"
            },
            "answer_text": "I would say into the 1800’s, and for hundreds of years prior to that. I wonder how many people died unnecessarily from excessive bleeding ! Sounds pretty familiar if you substitute “COVID-19”. Please be aware that leeches are still used by today’s medical professionals as a clean and simple method of cleaning out wounds; nothing to do with bloodletting, which could be done without the use of leeches. ",
            "date": "Answered October 24, 2020",
            "views": "189",
            "upvotes": " Answer requested by Chuck Bluestein"
        },
        {
            "author_info": {
                "name": "Mark Johnson",
                "href": "/profile/Mark-Johnson-2431"
            },
            "answer_text": "How can we know such things as there were no studies then to answer such a question. I would guess that blood letting was not a popular treatment for a field surgeon in the Revolutionary War. They already had lost plenty of blood. I think this was a treatment for the upper classes who were generally kept from the horrors of the world because they were busy causing them. ",
            "date": "Answered October 27, 2020",
            "views": "119",
            "upvotes": " Answer requested by Chuck Bluestein"
        },
        {
            "author_info": {
                "name": "Cecelia Holland",
                "href": "/profile/Cecelia-Holland"
            },
            "answer_text": "washington died in 1799. he was bled for an infection, but bleeding was a very old remedy, dating to ancient times, and based on the idea that the body contained 4 humors and sickness arises when one is out of balance. by the 1800’s medicine was moving toward a germ theory of illness. ",
            "date": "Answered October 24, 2020",
            "views": "135",
            "upvotes": " Answer requested by Chuck Bluestein"
        },
        {
            "author_info": {
                "name": "Thom Noble",
                "href": "/profile/Thom-Noble"
            },
            "answer_text": "Washington probally died from pnemonia and to much bléding causing anemia as well. He was a firm believer in bleeding in his day. Not realizing to much was deadly as well. ",
            "date": "Answered October 24, 2020",
            "views": "65",
            "upvotes": "0"
        }
    ]
}