{
    "title": "Was World War II the worst war in human history? - Quora",
    "tags": [
        "World War II",
        "World History",
        "Death and Dying",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Higdon",
                "href": "/profile/Matthew-Higdon"
            },
            "answer_text": "Yes, it was. The infrastructure and economies of Europe were absolutely devastated. North Africa, Russia, Japan, and especially China suffered heavily as well — really, every major nation except the United States. The Second World War was the first truly, thoroughly global war. It drew more belligerents than any war previous. It sucked every area of Earth’s geography into its multi-continental conflict, to a degree of involvement never before seen. (Even World War I was not quite global in this complete sense.) Every country and people-group in the world was affected by it. We do not know the exact total number of people who died, because many deaths were not reported. Combat soldiers are not known for taking careful statistical records of this kind of thing. (It is sad, certainly, but nevertheless the nature of warfare.) Estimates of tallied numbers from among the belligerent nations suggest a death-toll figure in the vicinity of 75,000,000 (million) human beings. This includes combatants, prisoners-of-war, civilians, and victims of the Holocaust. For comparison, this number is several times greater than the total deaths of World War I, the second most destructive war, which tallied between 16 and 20 million persons. ",
            "date": "Updated August 10, 2016",
            "views": "64",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oogly Boogly Boo",
                    "user_href": "/profile/Oogly-Boogly-Boo"
                },
                {
                    "user_id": "Jason Reihl",
                    "user_href": "/profile/Jason-Reihl"
                },
                {
                    "user_id": "Wednesday Mornings",
                    "user_href": "/profile/Wednesday-Mornings"
                },
                {
                    "user_id": "Octavio Barajas Loaiza",
                    "user_href": "/profile/Octavio-Barajas-Loaiza"
                },
                {
                    "user_id": "Ryan Eusebio",
                    "user_href": "/profile/Ryan-Eusebio-1"
                },
                {
                    "user_id": "Kaspar Koegel",
                    "user_href": "/profile/Kaspar-Koegel"
                },
                {
                    "user_id": "Paul Q. Le",
                    "user_href": "/profile/Paul-Q-Le"
                },
                {
                    "user_id": "Alana Higdon",
                    "user_href": "/profile/Alana-Higdon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Destiny Levits",
                "href": "/profile/Destiny-Levits"
            },
            "answer_text": "WW2 is considered more of a World War than WW1. There were more countries involved, and there were more deaths. The invention of atomic weapons and brutal island hopping nearly decimated Japans population in itself. Not only that, but the radiation effects are still seeen today causing mutations and genetic diseases in the younger generations as well as the older. The Soviet Union on the other hand had some of the highest casualties. Left to fend off the Germans in 1943 with no foreign aid from the US or Britain, the Germans destroyed many many different neighborhoods through Blitzkreig. It was a three step process literally meaning lightin war. The first step were air strikes, the second tanks and the third troops on the ground. The Germans struggled to get their tanks and troops through the mud and climate of the Soviet Union. This was in fact a result of the oil freezing within the tanks. However, the Germans still got through and killed millions, suffering hundreds of thousands of causalties. Rather than to continue to bore you with the details(though they’re actually really interesting to us history majors), here is a chart explaining the casualties.  ",
            "date": "Answered April 25, 2018",
            "views": "15",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leroy Holiday",
                    "user_href": "/profile/Leroy-Holiday"
                },
                {
                    "user_id": "Sebastian Olivieri",
                    "user_href": "/profile/Sebastian-Olivieri-1"
                },
                {
                    "user_id": "Jason Skelly",
                    "user_href": "/profile/Jason-Skelly-3"
                },
                {
                    "user_id": "Mohamed Samy",
                    "user_href": "/profile/Mohamed-Samy-182"
                },
                {
                    "user_id": "Saikat Aich",
                    "user_href": "/profile/Saikat-Aich"
                },
                {
                    "user_id": "Russell Pollard",
                    "user_href": "/profile/Russell-Pollard-3"
                },
                {
                    "user_id": "Jack Garreans",
                    "user_href": "/profile/Jack-Garreans"
                },
                {
                    "user_id": "Jack Maher",
                    "user_href": "/profile/Jack-Maher-4"
                },
                {
                    "user_id": "Matthew Salerno",
                    "user_href": "/profile/Matthew-Salerno"
                },
                {
                    "user_id": "David Saul",
                    "user_href": "/profile/David-Saul-13"
                }
            ]
        }
    ]
}