{
    "title": "Was Abraham Lincoln an honorable person? - Quora",
    "tags": [
        "Honor",
        "Abraham Lincoln",
        "Presidential History of the United States of America",
        "Political History of the United States of America",
        "U.S. Civil War",
        "Presidents of the United States of America",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Smith",
                "href": "/profile/Chris-Smith-3675"
            },
            "answer_text": "That’s a tough one to answer. You can see what the white supremacist extremist groups believe. That based on their belief that black people are just property, Lincoln “Stripped us of our Constitutional Freedoms”. Of course losing the right to own other humans I would exactly call “freedom”, but if you believe black people don’t count as human, well Karl gives a great answer of that stance. Imagine being so stuck on pro-slavery beliefs that you call the freedom of 4 million southerners an “atrocity on the people of the South”…. That kind of talk just makes my skin crawl that TODAY people still consider those 4 million slaves nothing more than property and not real people of the South. Lincoln did often do one thing that wasn’t honorable at times that stands out. In his push for votes on the campaign trail, or to keep states out of insurrection, he kept saying “I have no intention to end slavery where it exists”. Which is one of the big things the slavers called him out as a liar about hundreds of times, and they were right on that, because in his first term in office through executive action, pressuring Congress and states for new laws, he ended up getting more legislation and orders through that DID end slavery where it existed than all other US President’s combined. Then the 2nd election he did the same thing and pulled a little trick over those former slavers and extremist white supremacists stating that he wouldn’t look to help blacks become citizens. Of course in his first major speech from the White House, he spoke to exactly that, expanding voting rights to African Americans. Unfortunately, John Wilkes Booth was at that speech, left screaming “That means n*gger citizenship, by God I’ll run him through!” and before the month was out followed through on that promise. Another example of what someone would call less than honorable would be how he pressured Congress to pass the 13th amendment. That period was littered with stories of how Lincoln would promise representatives cushy foreign positions in Europe, or even threaten their families that joined the slavers rebellion with a possible prison sentence if they didn’t vote for the Amendment to end slavery, or in some cases, to just decline to vote either way if their ties to slavery were too strong to say no to it. In the end, he felt that the ends outweighed the means, and for some that would be a lack of honor, for others, destroying race based slavery in America was worth it. And you can see how strongly it upset those white supremacists and slavers… and those who support that today are STILL ticked about it. ",
            "date": "Answered October 23, 2020",
            "views": "79",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lucas Cosolo",
                    "user_href": "/profile/Lucas-Cosolo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Knudsen",
                "href": "/profile/Frank-Knudsen-5"
            },
            "answer_text": "Much can be said of Lincoln and the crosscurrents of his life and times. Both Adams and Lincoln were antislavery moralists. Lincoln, unlike Adams, never became an antislavery activist, even when a brutal civil war forced him to take action against slavery. Adams envisioned a multiracial America as inevitable. Long before his death, he became deeply sympathetic to abolitionists and abolitionism. Lincoln distrusted abolitionism. Though he believed slavery a moral abomination incompatible with American principles, and looked toward its eventual elimination, he desired that all blacks residing in the United States immigrate to a land of their own. He worried that the attempt of the two races to occupy the same country would lead to a century or more of racial conflict. Despite all of this which he had not like most things on his mind did not keep to himself. He instead realized the folly of the notion of separation as a way of keeping the peace. Something that many years later during reconstruction became the staple of southern life for generations. Lincoln wasn't always right on things. He believed in preserving the union. He believed in the inalienable rights of humans. He did ultimately what he thought was right and darkly wavered from this compass. ",
            "date": "Answered October 23, 2020",
            "views": "45",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                },
                {
                    "user_id": "Lucas Cosolo",
                    "user_href": "/profile/Lucas-Cosolo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Troy Cowan",
                "href": "/profile/Troy-Cowan-1"
            },
            "answer_text": "I would like to know the name of a more honorable governmental leader. Lincoln was wise, truthful, and compassionate. He was the total opposite of Donald Trump. However, he was not without fault. I believe that when he became president, he was in over his head. He was a country bumpkin unfamiliar with the corrupt ways of the world. He selected some of the most talented people to help him run the government. Unfortunately, those in his cabinet had their own agenda. They repeatedly took action that wasn’t good for the country. Lincoln got the blame. ",
            "date": "Answered October 23, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Dodd",
                "href": "/profile/Carl-Dodd"
            },
            "answer_text": "If you ever study Lincoln, you will find that he was an extremely honorable man. He was probably one of the most honest people that you could ever meet for his day and age. He once found out that he overcharged a woman a penny when he worked a small grocery store. In a cold Illinois winter storm he walked something like 5 miles to make sure that woman got her penny back that same day. To us, that penny means nothing much. To Lincoln, and the people of his day, that one penny meant a lot but Lincoln’s honesty meant more than the penny did. That was why Lincoln earned the nickname of “Honest Abe.” ",
            "date": "Answered October 23, 2020",
            "views": "78",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ken Fishkin",
                    "user_href": "/profile/Ken-Fishkin"
                },
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                },
                {
                    "user_id": "Henry Cooper",
                    "user_href": "/profile/Henry-Cooper-56"
                },
                {
                    "user_id": "Lucas Cosolo",
                    "user_href": "/profile/Lucas-Cosolo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raymond Beck",
                "href": "/profile/Raymond-Beck"
            },
            "answer_text": "He was a white supremacist who wanted all blacks sent back to Africa. He wanted an all white America. He was a corporate lawyer, who once represented a slave owner trying to get a runaway slave returned to slavery. When Congress got tired of his Civil War, it told him they would not continue to fund it unless he attempted to negotiate a peace. He lied and pretended to negotiate, when he had no serious intent to do so. He gave us the bloodiest war in history, per capita casualties. Draft riots broke out against his war. His war was not to end slavery but to dominate the South for financial plunder. ",
            "date": "Answered October 24, 2020",
            "views": "33",
            "upvotes": " Answer requested by Lucas Cosolo",
            "upvoters": [
                {
                    "user_id": "Lucas Cosolo",
                    "user_href": "/profile/Lucas-Cosolo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Fishkin",
                "href": "/profile/Ken-Fishkin"
            },
            "answer_text": "In his time, Lincoln was renowned for his integrity and honor. A specific example of how high his reputation was, from when he was practicing law in the 1850s: On one case, Lincoln was one of two defense lawyers, opposed by two prosecution lawyers. when the trial opened, the judge was a no-show. the trust [of Lincoln] was so complete that [the prosecution] agreed Lincoln should take the bench and preside as judge (source: “Lincoln’s Last Trial”, by Abrams) Incredible. Thanks for the A2A, Lucas. ",
            "date": "Answered October 24, 2020",
            "views": "69",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                },
                {
                    "user_id": "Roger Still",
                    "user_href": "/profile/Roger-Still-1"
                },
                {
                    "user_id": "Jade Lilly",
                    "user_href": "/profile/Jade-Lilly-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edna Arroyo",
                "href": "/profile/Edna-Arroyo-2"
            },
            "answer_text": "Yes, Abraham Lincoln was an honorable person. He was flawed, as we all are, but he had the determination to steer the nation through the Civil War and the ability to change his views and prejudices, that we would do well to remember. John Wilkes Booth did not do the country, most especially the Southern states that attempted to secede from the Union, any favors when he, stupidly and maliciously assassinated the President. The country is paying for that to this day. ",
            "date": "Answered October 24, 2020",
            "views": "34",
            "upvotes": " Answer requested by Lucas Cosolo",
            "upvoters": [
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Baltimore Bob Andrews",
                "href": "/profile/Baltimore-Bob-Andrews"
            },
            "answer_text": "The opposite of Trump. ",
            "date": "Answered October 23, 2020",
            "views": "27",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Gene Hennig",
                "href": "/profile/Gene-Hennig-1"
            },
            "answer_text": "He’s considered one of our top 3 presidents - Washington, Lincoln & FDR. Hard to image a dishonorable person reaching that lofty rank. ",
            "date": "Answered October 23, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Paul Sprottle",
                "href": "/profile/Paul-Sprottle"
            },
            "answer_text": "Yes.-Massively-honorable.-He-was-quite-certain-that-he’d-be-murdered-for-his-convictions,-and-he-was-correct.-No-one-dies-for-cash.-Only-idealism-can-push-a-man-towards-a-suspected-death. ",
            "date": "Answered October 24, 2020",
            "views": "16",
            "upvotes": " Answer requested by Lucas Cosolo"
        },
        {
            "author_info": {
                "name": "Jason King",
                "href": "/profile/Jason-King-229"
            },
            "answer_text": "Yes. He often faced tough decisions, agonized over them, and then made the best decision he could— and stood by it. ",
            "date": "Answered October 24, 2020",
            "views": "14",
            "upvotes": " Answer requested by Lucas Cosolo"
        }
    ]
}