{
    "title": "Was Napoleon a good general? - Quora",
    "tags": [
        "Napoleon Bonaparte"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Inglis",
                "href": "/profile/David-Inglis-8"
            },
            "answer_text": "He was Great General, though he was a curious mixed bag of talents with great strengths and weaknesses. Strengths - Organization - Napoloen understood the advantages and the consequences of the existing Division concept and added Corps organization, massed cavalry and artillery so they could add punch to areas of the battlefield rather than being dispersed. Operational Maneuver - Napoleon was adroit at operational maneuver, built upon the Division/Corps organization, the each part of the army was fully functional all arms formations capable of fighting independently if required. Operational Concept - Linking the previous two, Napoleon used the principle of concentration of forces to enable local superiority to enable decisive results of the battlefield. Morale - Napoleon was superb at manipulating and inspiring his troops. Weaknesses Over Optimism - Napoleon was prone to over optimistic views of the situation, which could led to major misjudgements. Discounting the chances of teh Austrians attacking at Marengo, Thinking the Prussians were beaten and falling back east at Ligny rather than falling back towards Wellington in fairly good order, this leading to Grouchy being sent the wrong way. Pride and Ego - Napoleon had a great difficulty cutting his losses. Not abandoning the battalion guns at Moscow to maximize the use of horses at his fear of the Russians using them as trophies, hanging on at Moscow 6 weeks, failure to prepare a retreat from Leipzig after the first day, Discipline - Napoleon never seemed to appreciate the value of discipline, his troops where used to foraging/looting, this lead to taking plunder rather than food when retreating from Moscow. Management of his Generals - Napoleon favored familiar faces and yes men to some degree and often chose the wrong man for a job. Promotion of his family and friends to high military commands then were badly suited for Murat and Jerome. Using Ney repeatedly as independent corps/army commander when he repeatedly shown he was not up to it. Napoleon also encouraged squabbling among his Marshals (political aim to keep them divided ) and purposefully never set a clear chain of command. Over Centralization - everything run through the Emperor’s hands, as campaigns and amries got bigger the lack of effective delegation meant that things just were not co-ordinated properly and that often subordinates just did not have the authority to operate effectively. The divided campaigns in Spain, the Chaos of the back areas in Russia, ",
            "date": "Answered April 8, 2018",
            "views": "11",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob Sanger",
                    "user_href": "/profile/Bob-Sanger-4"
                },
                {
                    "user_id": "Paul Marks",
                    "user_href": "/profile/Paul-Marks-12"
                },
                {
                    "user_id": "Tom Nelson",
                    "user_href": "/profile/Tom-Nelson-39"
                },
                {
                    "user_id": "Cherie",
                    "user_href": "/profile/Cherie-44"
                },
                {
                    "user_id": "Will Jessop",
                    "user_href": "/profile/Will-Jessop"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendell Stewart",
                "href": "/profile/Wendell-Stewart"
            },
            "answer_text": "Napoleon was not only a good general he was one of the greatest generals in history. He was the first to institute the draft (well ancient Israel was actually the first). He was the first to use artillery against infantry. He won every battle he ever fought except one, Waterloo. Napoleon was one of the greatest, look at his battle record. He had to leave his troops in Egypt because the English fleet cut him off. He left to not be captured by the British. That is not bad leadership but expediency, MacArthur did the same thing in the Philippines during WWII. Napoleon’s tactics are studied in military academies all over the world. He invented small portable cannons that could be moved quickly and used against infantry. That had never been done before. He started the first draft where all young men were pressed into military service, that had never been done before, except in the case of ancient Israel. Unlike the all other armies of Europe men were promoted because of merit not because of being royal or of noble birth. He was defeated because the English would never let him be. They undermined his relations with other countries and successfully got his allies to turn against him. The single greatest factor in his downfall was the Russian winter and his loss of the Grand Army in Russia. He never recovered from that loss. He changed all of Europe making the common man equal to Nobles under the law. He gave us the metric system and canned foods. European monarchs hated him because he eventually was the cause of the collapse of kings throughout all of Europe. ",
            "date": "Answered April 9, 2018",
            "views": "26",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vicenç Morales",
                    "user_href": "/profile/Vicenç-Morales"
                },
                {
                    "user_id": "Cherie",
                    "user_href": "/profile/Cherie-44"
                }
            ]
        }
    ]
}