{
    "title": "Was Genghis Khan gay? - Quora",
    "tags": [
        "Genghis Khan",
        "Mongol Empire"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clarence Sherrick",
                "href": "/profile/Clarence-Sherrick"
            },
            "answer_text": "The term \"gay\" did not exist at the time Timujin aka \"Genghis Khan\" lived. Moreover, Genghis was not a homosexual, so he cannot be referred to as \"gay\" in the modern sense. He actually had numerous wives and concubines. It is estimated that he has 26 million descendants living in the world today.   However, it was not unusual for adolescents boys in any age to experiment sexually with other boys. Especially in highly restrictive cultures which demand that a woman be chaste and a virgin before marriage.    I too have read that Timujin was enamored of a young male companion during his early  teenage years and this could very well have been Jemulga. \"Sharing a blanket\" is a euphemism for a sexual encounter. A rather elegant way to put it.    However, in the version I am aware of, Timujin's father had this young man secretly murdered, so that Timujin would never again hold any man with such intimate regard. A political behavior considered a weakness among Mongols.    Does one relationship with a close friend make anyone gay? Absolutely not. That specific term is best applied to males who prefer their own gender over that of females. To an exclusive choosing. Moreover, it is historically well known how much Genghis Khan preferred women. ",
            "date": "Answered November 9, 2014",
            "views": "127",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diana Mazin",
                    "user_href": "/profile/Diana-Mazin-2"
                },
                {
                    "user_id": "Dev Naik",
                    "user_href": "/profile/Dev-Naik-29"
                },
                {
                    "user_id": "Murali Menon",
                    "user_href": "/profile/Murali-Menon-11"
                },
                {
                    "user_id": "Robert Berger",
                    "user_href": "/profile/Robert-Berger-28"
                },
                {
                    "user_id": "Maruti Jai Walia",
                    "user_href": "/profile/Maruti-Jai-Walia"
                },
                {
                    "user_id": "Danita Dsouza",
                    "user_href": "/profile/Danita-Dsouza"
                },
                {
                    "user_id": "Dave Karimura",
                    "user_href": "/profile/Dave-Karimura"
                },
                {
                    "user_id": "Abdul Rafay",
                    "user_href": "/profile/Abdul-Rafay-74"
                },
                {
                    "user_id": "Isabelle Lucke",
                    "user_href": "/profile/Isabelle-Lucke"
                },
                {
                    "user_id": "Amarsanaa Narmandakh",
                    "user_href": "/profile/Amarsanaa-Narmandakh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Finn Frankis",
                "href": "/profile/Finn-Frankis"
            },
            "answer_text": "Based on his actions as the ruler of the Mongol Empire, it is relatively safe to assume that he was not. However, there is not enough evidence to formulate a certain answer. For instance, he banned sodomy in his code of law for the Mongol Empire, promising execution to those who engaged in homosexual acts. However, this was done mostly to increase native Mongol population, a figure which soon became a minority in a quickly expanding empire. Furthermore, Genghis Khan is well-known for producing a rumored 16 million children. While this precise number is almost certainly an extreme exaggeration, it is safe to say that he procreated with an extremely large quantity of women. Thus, while his directly documented and well-known actions would lead many to believe that he was not homosexual, it is impossible, based on the existing evidence, to make a claim either way.  Genghis Khan’s Yassa, or code of law ",
            "date": "Answered June 26, 2017",
            "views": "127",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wiwat Srithongkul",
                    "user_href": "/profile/Wiwat-Srithongkul"
                },
                {
                    "user_id": "Camilo M Villanueva Jr",
                    "user_href": "/profile/Camilo-M-Villanueva-Jr"
                },
                {
                    "user_id": "Selena K. Escobar",
                    "user_href": "/profile/Selena-K-Escobar"
                },
                {
                    "user_id": "Tawfik Khan",
                    "user_href": "/profile/Tawfik-Khan-1"
                },
                {
                    "user_id": "Z Parla",
                    "user_href": "/profile/Z-Parla"
                },
                {
                    "user_id": "Jamie Veitch",
                    "user_href": "/profile/Jamie-Veitch"
                },
                {
                    "user_id": "David Szutu",
                    "user_href": "/profile/David-Szutu"
                },
                {
                    "user_id": "Harmit Singh",
                    "user_href": "/profile/Harmit-Singh-20"
                },
                {
                    "user_id": "Russell Pollard",
                    "user_href": "/profile/Russell-Pollard-3"
                }
            ]
        }
    ]
}