{
    "title": "Was WWII really a World War? - Quora",
    "tags": [
        "World War II",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Dennis Weidner",
                "href": "/profile/Dennis-Weidner"
            },
            "answer_text": "Your point has some validity when discussing World War I as there was very limited fighting in Asia, Oceania, Africa, and Lain America, but World War II was different. World War II was very different. The War was fought on or off all continents except Antarctica. The great bulk of the world population was involved in the War, including China and India and extensive fighting and huge casualties took place in Asia and Europe as well as some important campaigns in Africa. Very few countries or colonial empires were uninvolved in the war and no country was unaffected, even the few countries which managed to remain neutral World War II country trends Lets look at Latin America because it was the region least involved. Latin America was the only populated continent that did not see important land battles, although the Battle of the Atlantic did occur in part off South America and the first major naval battle of the war was the Battle of the Rio Plate (Plata) fought off Uruguay and Argentina leading to the destruction of the German pocket battleship ‘Graf Spee’. Latin America was also affected by trade shifts, cut off from Germany, but benefiting by tremendous demand for its raw material from the Allies. World War II -- Latin America I find in discussions with Latin Americans that they are unaware and even more important aspect of the war that would have very much affected them had the Germans won the War — NAZI racism. They are aware of course of the NAZI campaign against Jews, but like the Arabs are unaware of just where they ranked as NAZI racial targets. Hitler and the NAZI race specialists, not only put Native Americans very low in their racial rankings , but considered racial mixing an anathema. That was part of the reason they hated Jews. And a great deal of the Latin American population is composed of Native Americans and Mestizo people. World War II -- the Holocaust targets ",
            "date": "Answered November 13, 2016",
            "views": "374",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Shaltz",
                    "user_href": "/profile/Jonathan-Shaltz-1"
                },
                {
                    "user_id": "Graeme Shimmin",
                    "user_href": "/profile/Graeme-Shimmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jose Benito Torres Medina",
                "href": "/profile/Jose-Benito-Torres-Medina"
            },
            "answer_text": "Actually, World War II was fought mostly in Europe; Asia and the Pacific, as well in North Africa. the Countries of Latin America declare war on Germany; Italy and Japan, but only two got involved in a limited way: Mexico, who send an air unit on the Pacific; and Brazil, who send an expeditionary force, to Italy. The African colonies of Great Britain; Belgium and France, send troops to support the war effort, specially South Africa. Only Portugal; Sweden; Ireland (excluding Ulster, aka, Northern Ireland); Spain and Switzerland remain neutral in the conflict. So, in a way, it was a world war, from a political perspective, rather than a geographical one; and it was nothing more than the continuation of World War I. ",
            "date": "Answered November 13, 2016",
            "views": "122",
            "upvotes": "0"
        }
    ]
}