{
    "title": "Was there ever a shoulder stock for the early model Radom pistols? - Quora",
    "tags": [
        "Gunsmithing",
        "Pistols",
        "Handguns",
        "Weapons",
        "World War II",
        "Guns and Firearms",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Wilson",
                "href": "/profile/Paul-Wilson-906"
            },
            "answer_text": "Yes. Not only the VIS (Radom) but Colt 1911, Browning Hi Power, FN, Mauser 98 & later revisions, along with the Luger all offered popular versions with shoulder stocks.  Radom Shoulder Stock (above)  Slot in rear of VIS (Radom) for the shoulder stock. (above)  Better photo of slot in rear of VIS (Radom) for the shoulder stock. (above)  Colt Model 1905 with shoulder stock. (above)  Colt Model 1911 with shoulder stock. The Colt version was dropped in 1934 with the introduction of the NFA but never were that popular to begin with. Since possession of both stock & pistol became a criminal offense without federal registration most of these were burned or otherwise destroyed by their owners. But the few registered ones have survived along with those in other countries.  Mauser Model 1898 with shoulder stock. (above)  Browning Hi Power with shoulder stock. (above)  German Luger with shoulder stock. (above) Savage also offered a shoulder stock for their 1917 Automatic Pistol as did numerous other small firearms companies. China copied the 1911, 1898 and Browning designs along with their shoulder stocks.  FN Model 1903 with shoulder stock. (above)  Swedish Model 1940 with shoulder stock. (above)  Bergman with shoulder stock. (above)  Stechkin Automatic Pistol with shoulder stock. (above) There were even a very few Soviet TT-33 Tokarevs manufactured with matching shoulder stocks, but only in the Yugoslavian version. They are rarely seen but do come up for auction on occasion. So yes, Radom manufactured the VIS with a matching shoulder stock as did most of the competing firearms manufacturers of the day. ",
            "date": "Answered October 23, 2020",
            "views": "45",
            "upvotes": " Answer requested by Jerome Healy"
        },
        {
            "author_info": {
                "name": "Richard Gibb",
                "href": "/profile/Richard-Gibb-5"
            },
            "answer_text": "First of all RADOM was a place not the name of the Manufacturer. The Pistol was a VIS and No they never produced a shoulder stock as that would have interfered with the mechanism. ",
            "date": "Answered October 23, 2020",
            "views": "39",
            "upvotes": "0"
        }
    ]
}