{
    "title": "Was homosexuality invented by ancient Greeks? - Quora",
    "tags": [
        "Ancient Greece"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Finn",
                "href": "/profile/James-Finn-12"
            },
            "answer_text": "Nope. Same-sex attraction is a biological phenomenon. A small but significant minority of humans are born with the neural circuitry to be primarily or exclusively attracted to other people of the same sex instead of to other people of the opposite sex. Many cultures throughout human existence seem to have found same-sex attraction quite unremarkable, many of the Archaic and Classical Greeks included. In fact, during the Archaic period, and probably beginning in Crete, some Greeks formalized homosexual behavior by instituting a voluntary system among the elite classes whereby young men in their early to mid twenties would enter into romantic and sexual relationships with ephebes, late adolescents. The relationships would continue for several years.[1] The practice was apparently designed to help put off reproduction. Primogeniture, combined with less readily-available land for colonization, had put a lot of pressure on elite families to lower their birth rates.[2] Institutionalized pederasty, as we call the system today, removed aristocratic males from the reproduction pool until they were about 30 years old. Whether this system had the desired effect is debated. By Classical times, it was pervasive, though. We still remember it today through the writings of literary Greeks of the time. That system, however, was but one manifestation of homosexual attraction and behavior in the Greek world. Elite men often had sex with male prostitutes and slaves, for example, though custom dictated that they must play the penetrative role only. Sexual relationships between men of equal age and status were almost always prohibited. The ancient Greeks regulated sexual behavior as much as any society. Homosexual behavior was interdicted for many people in many circumstances. It's not at all true that the Greeks invented same-sex attraction and behavior. In many situations, they prohibited behavior. In others, they allowed it. Approved or allowed, their customs were simply a manifestation of biological reality. Footnotes[1] Pederasty in ancient Greece - Wikipedia[2] Pederasty and Pedagogy in Archaic Greece",
            "date": "Updated December 25, 2017",
            "views": "3",
            "upvotes": " View 113 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ester Prifti",
                    "user_href": "/profile/Ester-Prifti-1"
                },
                {
                    "user_id": "Jeff Collins",
                    "user_href": "/profile/Jeff-Collins-6"
                },
                {
                    "user_id": "Ward Van Frost",
                    "user_href": "/profile/Ward-Van-Frost"
                },
                {
                    "user_id": "Lydia Mekonnen",
                    "user_href": "/profile/Lydia-Mekonnen"
                },
                {
                    "user_id": "Jennifer Hu",
                    "user_href": "/profile/Jennifer-Hu-1"
                },
                {
                    "user_id": "Giaan Pandher",
                    "user_href": "/profile/Giaan-Pandher"
                },
                {
                    "user_id": "Jeffrey Dunham",
                    "user_href": "/profile/Jeffrey-Dunham-3"
                },
                {
                    "user_id": "Erik Dralle",
                    "user_href": "/profile/Erik-Dralle"
                },
                {
                    "user_id": "Lexi Marcus",
                    "user_href": "/profile/Lexi-Marcus-3"
                },
                {
                    "user_id": "Paulo Pereira",
                    "user_href": "/profile/Paulo-Pereira-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Riggsby",
                "href": "/profile/Matt-Riggsby"
            },
            "answer_text": "Homosexuality was invented in the 19th century. The term itself mixes Greek and Latin roots. It’s the Greek “homo,” meaning “same” (“Homo” in Latin means “man”), while “sex” comes from Latin. It was created more or less simultaneously with its opposite, “heterosexuality.” During the 19th century, these words were used to label instances of a new concept: sexual orientation. Previously, one might speak of various sexual acts, and one might even note an inclination towards particular kinds of partners, but it wasn’t until around that time that people began to speak of a particular kind of person. That is, a kind of person who wanted sexual and romantic relationships with a person of the opposite sex vs. the same sex. That said, activities which we would call homosexual are widespread in nature, found in dozens of species. And among species which engage in long-term mating, like some birds, we find same-sex long-term mates. Homosexual behavior clearly predates not just the Greeks but all of humanity by…well, a lot. ",
            "date": "Answered December 15, 2017",
            "views": "793",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jed E. Herman",
                    "user_href": "/profile/Jed-E-Herman"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "William Burgeson",
                    "user_href": "/profile/William-Burgeson"
                },
                {
                    "user_id": "Lucas Jerzy Portela",
                    "user_href": "/profile/Lucas-Jerzy-Portela"
                },
                {
                    "user_id": "Jo Ayers",
                    "user_href": "/profile/Jo-Ayers-1"
                },
                {
                    "user_id": "Mohammad Alsafran",
                    "user_href": "/profile/Mohammad-Alsafran"
                },
                {
                    "user_id": "Michael Fairfax",
                    "user_href": "/profile/Michael-Fairfax"
                },
                {
                    "user_id": "Don Montgomery",
                    "user_href": "/profile/Don-Montgomery"
                },
                {
                    "user_id": "Rygar Bensen",
                    "user_href": "/profile/Rygar-Bensen"
                },
                {
                    "user_id": "Rich Alderson",
                    "user_href": "/profile/Rich-Alderson"
                }
            ]
        }
    ]
}