{
    "title": "Was there any black slave owner that own white slaves in USA? - Quora",
    "tags": [
        "Human Trafficking",
        "Slavery",
        "White People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Françoise Marie",
                "href": "/profile/Françoise-Marie-1"
            },
            "answer_text": "Yes, there were wealthy black plantation owners that had white servants and even white slaves. Many White people will deny it. Of course, the powerful white supremacy propaganda machine will always project the false image that white people have never ever been the slaves, subjects or servants of powerful or wealthy Blacks anywhere in the world or any time in history. Anthony Johnson (colonist) - Wikipedia When Anthony Johnson was released from servitude, he was legally recognized as a \"free Negro.\" He became a successful farmer. In 1651 he owned 250 acres (100 ha), and the services of five indentured servants (four white and one black). In 1653, John Casor, a black indentured servant whose contract Johnson appeared to have bought in the early 1640s, approached Captain Goldsmith, claiming his indenture had expired seven years earlier and that he was being held illegally by Johnson. A neighbor, Robert Parker, intervened and persuaded Johnson to free Casor. Digital History Virginia Slave Laws The status of blacks in seventeenth century Virginia was extremely complex. Some were permanently unfree; others, like indentured servants, were allowed to own property and marry and were freed after a term of service. Some were even allowed to testify against whites in court and purchase white servants. White Slavery in Colonial America: and Other Documented Facts Suppressed From the Public Know There were negroes of non –slave status who owned both black and white slaves. White Slavery In Colonial America: And Other Documented Facts Supressed from the Public Know!: Masterson, Dee: 9781442133976: Amazon.com: Books  For decades, the story has been told. Major motion pictures have used it as a premise. We even teach it to our children. But what if AFRICAN SLAVERY is the BIGGEST HOAX ever perpetrated? Not to suggest it didn't happen; but rather not in the context often presented as factual history.A conspiracy to suppress 400-years of American history has kept everyone in the dark, made African-Americans feel inferior, and fueled the illusion of white superiority. When we think of slavery in American history, we are conditioned to go back only so far; the Trans-Atlantic African Slave Trade. THE TRUTH of the matter is that if we went back a little further, we would discover a world just as cold and just as cruel but exclusively to white slaves from Europe. They were kidnapped, put in chains, transported across vast oceans, auctioned, torn from their families, whipped, tarred and feathered, lynched, beat to death, malnourished, denied medicare, and worked until they literally dropped dead. Contrary to popular belief, America did not begin as a colony built on the labor of Africans. This earliest and covered-up period began with the systematic exploitation of labor, targeting WHITE SLAVES ONLY. Now suppose this is only the beginning of deceptions you were spoon fed to believe since birth. If you choose the empty hand, you'll go back to sleep, wake up in ignorant bliss, and pick up where you left off. But if you choose to bite the apple from the forbidden tree of knowledge, I'll show you how deep the rabbit hole goes. Knowledge is evil only to those who want to keep you enslaved. Slaves of a different color I discovered that there was strong anecdotal evidence of whites being kidnapped or sold into slavery from the early 1700s to the Civil War. Some were orphans, others poor immigrants or unwanted illegitimate babies. Some were snatched off country lanes, their skin dyed to look black; some were sold ostensibly as light mulattoes. A white woman was even sold down the river by her new husband, followed by her children, to a Georgia preacher. There were court cases, including the notorious 1844 New Orleans case of Sally Miller, a German child sold as a mulatto. There were newspaper accounts, sightings of white slaves in Southern travel memoirs, including Frederick Law Olmsted's influential \"The Cotton Kingdom\" (1862), and African-American slave narratives attesting to white slavery. The numbers are impossible, so far, to pin down, but some white bondage clearly occurred. In an era when human beings were the most valuable commodities available to thieves and slave traders, greed occasionally trumped the crucial myth that there was a strict dividing line between the races. And while there were instances of what appeared to onlookers as \"purebred\" whites being sold on auction blocks, those Anglo-Saxons were being sold as \"blacks.\" One had to become physically or socially accepted as black to be legally sold into chattel slavery and enter into the full degradation of American bondage. As light-skinned blacks sometimes gained their freedom by \"passing\" as white, so did hapless Caucasians make the reverse journey -- proving that race and bondage were even more fluid concepts in antebellum America than we would like to believe. And the phenomenon was not restricted to the United States: The Barbary captivity narratives, recounted in Paul Michel Baepler's \"White Slaves, African Masters,\" in which Europeans and some Americans described their brutal episodes of slavery in the courts of Algerian and Moroccan pashas, were wildly popular in the 1800s. ",
            "date": "Answered March 14, 2020",
            "views": "102",
            "upvotes": " View 48 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob Boa",
                    "user_href": "/profile/Bob-Boa-2"
                },
                {
                    "user_id": "Kirstie Christine Ahmed",
                    "user_href": "/profile/Kirstie-Christine-Ahmed"
                },
                {
                    "user_id": "No Body",
                    "user_href": "/profile/No-Body-1028"
                },
                {
                    "user_id": "Matt Grubb",
                    "user_href": "/profile/Matt-Grubb-8"
                },
                {
                    "user_id": "Penelope Greenfield",
                    "user_href": "/profile/Penelope-Greenfield"
                },
                {
                    "user_id": "Wolf Krakowski",
                    "user_href": "/profile/Wolf-Krakowski"
                },
                {
                    "user_id": "Jada Winters",
                    "user_href": "/profile/Jada-Winters-4"
                },
                {
                    "user_id": "Mpilo Mizere",
                    "user_href": "/profile/Mpilo-Mizere"
                },
                {
                    "user_id": "Amy Tortorici",
                    "user_href": "/profile/Amy-Tortorici-1"
                },
                {
                    "user_id": "Ryan Bosela",
                    "user_href": "/profile/Ryan-Bosela"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albert Germaine",
                "href": "/profile/Albert-Germaine-1"
            },
            "answer_text": "The answer is YES! Very early in the colonial era, White slave owners had not yet mythologized slavery to make it a racial state or condition. There were indentured Black and White slaves who could be bought. I should have memorized the guy’s name. It might be Anthony Johnson. He was a Black slave in the 1600s who worked himself out of indentured slavery by purchasing his own freedom. He bought land and slaves of his own, some were White indentured slaves. He had the richest, most prosperous plantation in a particular county of (IIRC) Virginia. But, gradually Whites created myths about Blacks being inherently so inferior that they were naturally, or ordained by God, suitable only to be slaves. The function of this process was to excuse their abuse of Blacks and to justify slavery in the face of abolitionist criticism as well as to brainwash the slaves. Blacks were supposed to be less able to take care of themselves than the birds and the bees. They were fortunate, although they couldn’t understand it, to be under the control of White people who would take care of them. Slavery was like a philanthropic endeavor. Trying to educate Blacks would only confuse them and expose them to dangerous ideas. Eventually, in many counties, laws were passed to enforce this fantastic myth. The Black belonged as a slave. In some places a free Black would, if he didn’t leave the jurisdiction within 24 hours, be captured and sold into slavery where he belonged. The ultimate codification of these ideas was the Dred Scott decision of the US Supreme Court which held that a Black person had no rights that a White man need observe. Literally, a White could commit any crime against a Black with total, legal impunity. The Black had no appeal to the law. But, this was already true in practice in much of slave territory where whippings, lynchings, rapes and all manner of abuse were a White man’s prerogative. ",
            "date": "Answered April 6, 2019",
            "views": "48",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Roy Sykes",
                    "user_href": "/profile/Roy-Sykes-1"
                },
                {
                    "user_id": "Jonathan M. Jacobs",
                    "user_href": "/profile/Jonathan-M-Jacobs"
                },
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-2"
                },
                {
                    "user_id": "Alex Powers",
                    "user_href": "/profile/Alex-Powers-32"
                },
                {
                    "user_id": "Celia May Malm",
                    "user_href": "/profile/Celia-May-Malm"
                },
                {
                    "user_id": "Angus McGillicuddy",
                    "user_href": "/profile/Angus-McGillicuddy"
                },
                {
                    "user_id": "Kevin McAllister",
                    "user_href": "/profile/Kevin-McAllister-15"
                },
                {
                    "user_id": "Deborah Hamilton",
                    "user_href": "/profile/Deborah-Hamilton-48"
                },
                {
                    "user_id": "Clifton Mcdowell",
                    "user_href": "/profile/Clifton-Mcdowell-1"
                },
                {
                    "user_id": "Katie Stone",
                    "user_href": "/profile/Katie-Stone-128"
                }
            ]
        }
    ]
}