{
    "title": "Was colonial Britain a bad thing? Were they just the most successful at doing what many other nations around the same time were trying to do? - Quora",
    "tags": [
        "British Empire, Good or Bad",
        "British Colonial Rule"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Page",
                "href": "/profile/Stephen-Page-8"
            },
            "answer_text": "There has been a dangerous, incorrect and blatantly bigoted, ‘progressive’ view that originated in Soviet Russia, then exported to western socialists as well as Indian school texts, that suggests colonial Britain was a ‘bad thing’. However, please remember, Russia and the rest of the global community were trying to do exactly the same thing and failed. At that time colonialism was the way forward. irrespective of today's ridiculously silly, revisionist, finger-wagging. Let’s explore the period together shall we? Ferguson 2003: By the time Churchill died in 1965 all of the British Empire’s most important parts had gone. Why? Traditional accounts of \"decolonisation\" tend to give the credit (or the blame) to the nationalist movements within the colonies, from Sinn Fein in Ireland to Congress in India. The end of the Empire is portrayed as a ‘victory’ for \"freedom fighters\", who took up arms from Dublin to Delhi to rid peoples of the ‘yoke of colonial rule’. This is misleading. Throughout the 20th century, the principal threats - and the most plausible alternatives - to British rule were not national independence movements, but other empires. These alternative empires were significantly harsher in their treatment of subject peoples than Britain. Even before the First World War, Belgian rule in the notionally \"independent\" Congo had become a byword for the abuse of human rights. Rubber plantations and railways were built and operated on the basis of slave labour, and the profits flowed directly into the pocket of King Leopold II. Such was the rapacity of his regime that the cost in human life from murder, starvation, disease and reduced fertility has been estimated at ten million: half the existing population. The French did not behave much better than the Belgians in their part of the Congo: population loss was comparably huge. In Algeria, New Caledonia and Vietnam too, there was a policy of systematic expropriation of native land which made a mockery of Gallic rhetoric about universal citizenship. German overseas administration was no more liberal. Nor should the comparisons be confined to West European powers. Japanese colonial rule in Korea - a protectorate from 1905 and a colony directly ruled from Tokyo from 1910 - was conspicuously harsh. We should also remember the quality of Russian rule in Poland, in the Caucasus, in the Central Asian provinces of Turkestan and Turkmenia; and in the Far East, where the new Trans-Siberian Railway took the Tsar's writ all the way to Sakhalin and Vladivostok and finally into Manchuria. In their European colonies the Russians pursued aggressive policies of \"russification\". In Central Asia, resistance to Russian colonisation was dealt with uncompromisingly: a revolt by Muslims in Samarkand and Semirechie in 1916 was bloodily suppressed and the rebel death toll may have reached hundreds of thousands. Yet all this would pale into insignificance alongside the crimes of the Russian, Japanese, German and Italian empires in the 1930s and 1940s. By the time Churchill became Prime Minister in 1940, the most likely alternatives to British rule were Hirohito's Greater East Asia Co-Prosperity Sphere, Hitler's Thousand Year Reich and Mussolini's New Rome. Nor could the threat posed by Stalin's Soviet Union be discounted, though until after the Second World War most of his energies were devoted to terrorising his own subjects. It was the staggering cost of fighting these imperial rivals that ultimately ruined the British Empire. In other words, the Empire was dismantled not because it had oppressed subject peoples for centuries, but because it took up arms for just a few years against FAR more oppressive empires. In the end, the British sacrificed the Empire to stop the Germans, Japanese and Italians from keeping theirs. Did not that sacrifice alone expunge all the Empire's other sins? It did the right thing, regardless of the cost. And that was why the ultimate, if reluctant, heir of Britain's global power was not one of the evil empires of the East, but Britain's most successful former colony. _________________________________________________________________________________ Ferguson is one of many historians and authors that see the British Empire for what it actually was rather than through communist/socialist ideological filters that were frankly, at best, revisionist and at worst a deliberate falsification of the historical record. The Indians have been the most vocal, in that they jumped on to the so-called 'victim pyramid', proceeding to suggest that if it wasn't for the British their nation would be somehow more exceptional. The facts are, that it is childish to conflate what a global power did in the context of history with modern values,. Subsequently, such suspect behaviour is a waste of time and more, suggests the true agenda is rather Anglophobia camouflaged with socialist dogma. When Great Britain ran its empire, that was how things were done, by pretty much everyone or at least everyone tried to...and most failed. The odd thing is that no-one protests about the awful Spanish, Belgian, Russian or French Empires which (as you will see from the above citation) were far more brutal, so much so that their actions reverberate down the centuries to today, where on the streets of France, Belgian and Spain we see angry ex-colonial subjects strike out at the inheritors of those barbaric regimes. In relation to their foreign competitors, Great Britain demonstrated enlighten4d self-interest and compassion. More importantly, Britain laid the foundations for many of the things we take for granted today; Parliamentary democracy, the rule of law, individual rights, Industrial Revolutions I,II, III and IV (without which, we and I do mean all of us, no matter where you are in the world, would still be working in the fields lorded over by an elite few). The British government in the form of the Royal Navy ‘West Africa Squadron’ policed the seas to stamp out slavery, a morally enlightened practice that both Arabs and Americans protested loudly against I might add and cost so much that it almost bankrupted Britain, the loans eventually paid off in 2015, now THAT’S planning for the long term! Were there occasional mistakes? Yes, of course, no-one denies the historical facts. However, to suggest that the British were somehow worse than any other nation in their foreign policy at the time is ludicrous and stinks of revisionist nonsense. Here’s Ferguson again: Many charges can of course be levelled against the British Empire. I do not claim, as Lord Curzon did, that \"the British Empire is under Providence the greatest instrument for good that the world has seen\"; nor, as General Smuts claimed, that it was \"the widest system of organised human freedom which has ever existed in human history\". The Empire was never so altruistic. In the 18th century the British were as zealous in the acquisition and exploitation of slaves as they were subsequently zealous in trying to stamp slavery out; and for much longer they practised a form of racial discrimination and segregation that we today consider abhorrent. When imperial authority was challenged - in India in 1857, in Jamaica in 1831 or 1865, in South Africa in 1899 - the British response was brutal. When famine struck (Ireland in the 1840s, India in the 1870s) their response was negligent, in some measure positively culpable. Nevertheless, the fact remains that no organisation in history has done more to promote the free movement of goods, capital and labour than the British Empire in the 19th and early 20th centuries. And no organisation has done more to introduce policies of law, order and governance around the world. For much (though certainly not all) of its history, the British Empire acted as an agency for relatively incorrupt government. Prima facie, there therefore seems a plausible case that empire enhanced global welfare - in other words, was a Good Thing. In closing, a little known fact about the British empire is that the only time the world has known global peace was during the period that Britain dominated the seas. By gunboat and the cannon you say? No, by free trade and the spread of the democratic process. ",
            "date": "Updated June 19, 2020",
            "views": "31",
            "upvotes": " View 56 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shaban Saba",
                    "user_href": "/profile/Shaban-Saba"
                },
                {
                    "user_id": "Tony English",
                    "user_href": "/profile/Tony-English-30"
                },
                {
                    "user_id": "William Alexander",
                    "user_href": "/profile/William-Alexander-99"
                },
                {
                    "user_id": "Jack Doyle",
                    "user_href": "/profile/Jack-Doyle-40"
                },
                {
                    "user_id": "Mark Bailey",
                    "user_href": "/profile/Mark-Bailey-414"
                },
                {
                    "user_id": "Louise Robertson",
                    "user_href": "/profile/Louise-Robertson-10"
                },
                {
                    "user_id": "David Johnston",
                    "user_href": "/profile/David-Johnston-249"
                },
                {
                    "user_id": "James Hall",
                    "user_href": "/profile/James-Hall-1103"
                },
                {
                    "user_id": "Peter Calvert",
                    "user_href": "/profile/Peter-Calvert-1"
                },
                {
                    "user_id": "Damian Piesse",
                    "user_href": "/profile/Damian-Piesse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Doyle",
                "href": "/profile/Jack-Doyle-40"
            },
            "answer_text": "I think there is alot to unpack here. It’s two questions, with many answers. First, The British were driven into colonialism out of competition particularly with the Catholic powers of the continent. Colonialism came in waves, with the Americas followed by Asia followed by Africa. The British generally were better than other Europeans, they didn’t engage with the sort of brutal rule like the Spanish in Latin America or Germans and Belgians in Africa. They made treaties with natives peoples (one of the cause of the American Revolution was the desire to expand westward by the colonies) and its empire generally evolved out of trade (The nationalisation of the East India Company brought large parts of India under formal British rule) Second, The British goal was trade, and the state was often reluctant to intervene, as long as they could trade they were content, until later when prestige became a driver. Third the world only evolved to nation state democracies relatively recently (in part thanks to the British), so it would wrong to judge it by modern standards. Most of its subjects were trading one overlord for another. It certainly was progressive and much like the Romans seems to have left a generally positive legacy evidence by the fact it’s former colonies are more likely to be liberal democracies and more likely to be economically successful than those of other european states. Fourth the British Empire brought good and bad, India for example is only a unified democracy due to British rule, it’s infrastructure, civil service and legal system, even now is mostly what the British built. Africa however is a different story. The British engaged in the slave trade, and this was a tragedy for the untold number of slaves and a continuing legacy for those in the Americas, It was moral relativism on the Europeans part. Slavery was an African custom, there had been an extensive trade with the muslim world for centuries when the Europeans arrived. However the Europeans demand for labour in the new world kicked this into overdrive. African kingdoms became extremely rich and the entire economy of the continent became based on the export of slaves. So when the British engaged in moral imperialism and began unilaterally interdiction of the trade it devastated the African economy. The nations of Africa fell into economic collapse and chaos. This was easy pickings for European nations who could use the anarchy of economic collapse as justification for their colonialism. Thus the map of Africa was redrawn not to suit cultural or linguistic groups but the whim of European kings. All because the British did something with massive unintended consequences. The Middle East is perhaps a more egregious example. Following its victory over the Ottomans in WW1 it divided up the former empire’s holdings establishing the arab kingdom of Saudia Arabia for its Arab allies, and drawing Iraq simply to capture the best oilfields. Then it engaged in a litany of failures in Palestine, its weakness on stopping illegal immigration and combating terrorism are the prime factors in the current situation in the holy land. English is the language of culture, business, science and diplomacy thanks to the British Empire, we have an interconnected would of trade and communication thanks to the British Empire, Perhaps their best legacy is The British believed in the rule of law and that everyone was equal before the law regardless of race, gender or creed. That is legacy spread, with a young lawyer who trained at the University of London before practicing in South Africa before going home to India, to another Lawyer who lived and fought in South Africa. Clause 39 of the Magna Carta is perhaps the acorn of modern liberty “No free man is to be arrested, or imprisoned, or disseised, or outlawed, or exiled, or in any other way ruined, nor will we go against him or send against him, except by the lawful judgment of his peers or by the law of the land.” So much as Europe lived in the mausoleum of the Roman Empire we now live in the mausoleum of the British. ",
            "date": "Updated September 23, 2017",
            "views": "597",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shaban Saba",
                    "user_href": "/profile/Shaban-Saba"
                },
                {
                    "user_id": "Alan Robertson",
                    "user_href": "/profile/Alan-Robertson-46"
                },
                {
                    "user_id": "Jim Strong",
                    "user_href": "/profile/Jim-Strong-24"
                },
                {
                    "user_id": "Arthur McClench",
                    "user_href": "/profile/Arthur-McClench"
                },
                {
                    "user_id": "John Cash",
                    "user_href": "/profile/John-Cash-181"
                },
                {
                    "user_id": "Josiah Murphy",
                    "user_href": "/profile/Josiah-Murphy-1"
                },
                {
                    "user_id": "Zaki Ahmed",
                    "user_href": "/profile/Zaki-Ahmed-21"
                },
                {
                    "user_id": "Edward Kamposek",
                    "user_href": "/profile/Edward-Kamposek"
                }
            ]
        }
    ]
}