{
    "title": "Was 2007 the mid-2000s or the late 2000s? - Quora",
    "tags": [
        "2007 (year)",
        "2000s",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marcie Miller",
                "href": "/profile/Marcie-Miller-10"
            },
            "answer_text": "Mid-2000s. The big dividing line between the mid and late 2000s was the Financial Collapse in 2008, followed by the election of Obama and his inaguration in ‘09. In 2007, we were very much still focused on the Iraq War and GWB, and no one really knew just what was right around the corner (the collapse, that is). It began in 2006 when construction starts began to seriously fall in the latter part of that year, but, though the blogs were full or predictions of what was about to happen, no one really had any idea just how awful it would be. For that reason, ’07 belongs squarely to the mid-’00s. The GFC/Great Recession was a tragedy that somehow got swept under the rug. So many of us suffered and continue to suffer from the fallout, but unlike during the Great Depression of the 1930s, the media and government chose to ignore the people whose lives were destroyed by the malfeasance of the banks and the elite. Someday, perhaps, the truth will be told. Maybe. ",
            "date": "Answered March 1, 2020",
            "views": "903",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dylan Jackson",
                    "user_href": "/profile/Dylan-Jackson-203"
                },
                {
                    "user_id": "Chris Londo",
                    "user_href": "/profile/Chris-Londo"
                },
                {
                    "user_id": "Brandon White",
                    "user_href": "/profile/Brandon-White-484"
                },
                {
                    "user_id": "Luca Costa",
                    "user_href": "/profile/Luca-Costa-8-1"
                },
                {
                    "user_id": "Kim Boze",
                    "user_href": "/profile/Kim-Boze"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bengt Persson",
                "href": "/profile/Bengt-Persson"
            },
            "answer_text": "The intentions with using terms like “mid decade” (of late) is to avoid being precise. Example: Talk about fashion “during the mid 2000’s the xxx sneakers where very popular”. The is does not matter if they went out of fashion in NY 2006 and in Oregon in 2008. If there are precise events to refer to it is better to sat “between 2004 and 2008 this happened”. But If the exact time is not known terms like “mid decade” can still be used “in late 1920’s he moved with his family to the west coast where his farther hoped to find jobs”. ",
            "date": "Answered March 2, 2020",
            "views": "400",
            "upvotes": " Answer requested by Dylan Jackson"
        }
    ]
}