{
    "title": "Was Saul the first king of Israel? - Quora",
    "tags": [
        "Saul (king of Israel)",
        "History of Israel",
        "Kings (royalty)",
        "Israel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shaul Valadez",
                "href": "/profile/Shaul-Valadez-1"
            },
            "answer_text": "Saul was the first king over the people of Israel as a whole within the Land of Israel. (Caanan). However Saul was not the first Hebrew monarch of Caanan. This was the Priest-King Melchitzedek, also known as Shem son of Noach. He ruled the kingdom of Salem (Yireh-Shalem) during the lives of Abraham and Issac. The birthright given to Abraham is actually the right of the Aramean-Hebrew line to suceed Shem as king of Yireh-Shalem.This is why the Israelites wanted to return to Canaan. The conquest of the tribes of the region of Canaan was to re-establish the sovereignty of the kingdom of Yireh-Shalem. The Temple was built in Yireh-Shalem for that reason This became the tribal region of Judah and Binyamim. The Levites controlled the Priesthood and the alliance of Benyamin and Judah became permanent with David. The tribe of Binyamin saw David as Saul’s heir and the Davidic monarchy as the continuation of his dynasty. That said The Tribe of Binyamin supported Ish Bosheth Son of Saul as their king for two years until he died. Then they supported David as the heir of Shaul. Later the area of the Temple incorporated land from the tribe Binyamin and Judah in recognition of the permanent union of the sons of Leah and Rachel into a nation of God with the Levites as Priests and teachers as well as The house of David as kings. The ten tribes split away into the northern kingdom after Sollomon died in an attempt to disolve this treaty and create a monarchy under Yosef's banner (Ephraim and Menashe). Had Binyamin's tribe not contributed land to the Temple and supported the house of David as successor to Shaul the split mighy have been considered legitimate. Saul's monarchy was what allowed the Davidic monarchy the authority of the entire Jewish people. When David was acknowledged by the Tribe of Binyamin upon Ish Botheth's death as the only valid heir of Shaul that allowed the monarchy of David to unite with the monarchy of Shaul. Rachel's lineage the dynasty of Shaul and it had been joined to the dynasty of Leah (Judah) by marriage. This allowed David to bind both dynasties into one. Sollomon was not from Shaul's daughter, but David was the link to Shaul as his heir via a legal ruling done by a Prophet (prophets can make certain one time legal rulings that normally are not possible if commanded to by GD). The ruling was that David would inherit as a full son would Shaul's kingship (but not tribal lands). Normally it would have been the right of the son togain the kingship and keep it within the tribe. Samuel was told to decree that it should be transferred to the Davidic family and Nathan was told that Sollomon and his descendants would always have the legitimate claim. That said Binyamin had chosen a tribal king not a national king, and that presented a problem because for the first two years after Shaul's death they followed a tribal king and therr was a civil war. They eventually accepted David after Ish Bothet died because there was simply no other more legitimate heir left who was worthy of the kingship other than David. ",
            "date": "Updated July 22, 2020",
            "views": "98",
            "upvotes": " View Sharers "
        },
        {
            "author_info": {
                "name": "Enver Weitz",
                "href": "/profile/Enver-Weitz"
            },
            "answer_text": "First king AF what. Is real never existed in ancient times. Galatians 4:24 ‘’Which things are an allegory…’’ I AM DUMBFOUNDED AT THE FACT THAT SO MANY CHRISTIANS DOES NOT READ THEIR ‘’HOLY BOOK'', TOTALLY IGNORANT OF WHAT'S ACTUALLY WRITTEN IN IT. I SAID BEFORE THE COUNTERFEIT SPIRIT IS IN CHARGE OF THE CHRISTIAN CHURCH. I WAS IN THE CHURCH, PREACHED. IN THE LAST 5 YEARS I'VE WORKED THROUGH THE BIBLE AND FOUND THAT CHRISTIANS THATS BEEN IN CHURCH DON'T READ WHAT'S WRITTEN IN THE BIBLE. IGNORANCE IS ONE OF THE EVIL SPIRITS CONTROLLING THE CHRISTIAN CHURCH… ",
            "date": "Answered March 15, 2020",
            "views": "20",
            "upvotes": " Answer requested by Fernando Martinez"
        }
    ]
}