{
    "title": "Was Winston Churchill a good prime minister overall? - Quora",
    "tags": [
        "Winston Churchill",
        "History of Politics",
        "Prime Ministers",
        "Great Britain",
        "World War II",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Mantle",
                "href": "/profile/Jonathan-Mantle"
            },
            "answer_text": "When you ask a question you have to look at a number of different factors. What did he do for the economy, how did he improve this, that and the other. The issue with this Prime Minister is that he won WW2. On this single point we can say that he was an AMAZING Prime Minster. The issue is you said overall. That changes the goal posts on this matter. How does one determined if someone is a good Prime Minister? Is it economically, socially, militarily, scientifically, or something else? What does it mean to be good overall? Let's take this from the start of Winston Churchill Prime Minsters department. Winston Churchill took over from Neville Chamberlain when Britain was on its knees. Someone needed to come in, make the speeches that gave us moral, give us determination, give us a shake up to our forces. We needed people and munitions to keep us going. Without doubt, Churchill did this. He did an AMAZING job of getting us back on track against the Nazi menace. Without him we would not have been able to fight in an effective manor, we would not have had allies with Russia, relations with Poland, France, and to an extent the Americans. Without question, Churchill was an amazing Prime minster for the time that he was in. The question, however ISN'T “Which was the best Prime Minster for the time that they are most known for”. It is was “Was Churchill a good Prime Minster, overall”. As a result we must look at another section which is less known about. That is his ability AFTER the war. After the War, Churchill was NOT the man of the moment. The best way to show this is how he lost the General election on a MASSIVE landslide. There is no better way to see how well your party is doing than by a general election. The issue that Churchill had after the war was that he was he didn't know how to deal with all of the other issues that were outstanding. A good example of this is that Churchill raised the rations fro Fish but lowered them for cooking oil. A very unpopular move. As a result he did make a number of mistakes which cost him the election. Churchill was a good War minister. Probably the best that the United Kingdom has ever had. The thing is that he was the best man for the job at the time. Overall, he didn't have a clue about health care, housing, food production, or transport. As a result, overall he was a great man for a moment, but a small man overall. ",
            "date": "Answered August 30, 2016",
            "views": "61",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guillaume Paquette",
                    "user_href": "/profile/Guillaume-Paquette"
                },
                {
                    "user_id": "Steve Morton",
                    "user_href": "/profile/Steve-Morton-69"
                },
                {
                    "user_id": "Shree Shetty",
                    "user_href": "/profile/Shree-Shetty-2"
                },
                {
                    "user_id": "Colin Mitchell",
                    "user_href": "/profile/Colin-Mitchell-107"
                },
                {
                    "user_id": "Rodney Shinkfield",
                    "user_href": "/profile/Rodney-Shinkfield"
                },
                {
                    "user_id": "Chris White",
                    "user_href": "/profile/Chris-White-427"
                },
                {
                    "user_id": "Ashleigh Stanton",
                    "user_href": "/profile/Ashleigh-Stanton-2"
                },
                {
                    "user_id": "Richard Smith",
                    "user_href": "/profile/Richard-Smith-1002"
                },
                {
                    "user_id": "David Domínguez",
                    "user_href": "/profile/David-Domínguez-2"
                },
                {
                    "user_id": "David Lincoln",
                    "user_href": "/profile/David-Lincoln-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Wright",
                "href": "/profile/Michael-Wright-45"
            },
            "answer_text": "Overall, no: and if it hadn’t been for WW II, he would never have been Prime Minister, because a lot of people didn’t trust him. He had, after all, started out as a Conservative, changed as a young man to the Liberal Party; rose to ministerial rank in that party, but when he lost an election, came back in a couple of years as a Conservative. I think he’s very like Boris Yeltsin: a bit of a hack, with some dodgy history, who happened to encounter a crisis in history when the right thing to do was to rant drunken defiance, and they both met the challenge superbly, and have their greatness. But it has to be said that Churchill’s speeches in 1940, which established that the UK would not make a sensible settlement with Hitler but would fight on, at the risk (realised, as it turns out) of national bankruptcy, didn’t go down very well in the House of Commons. After that moment, quite a large part of the war effort by the military professionals was devoted to stopping Churchill interfering in things, though there was one point when he might have intervened, and failed to. The decision to engage in area bombing of German cities (terror bombing, if you will) was a collective one, taken before Arthur Harris was appointed to lead Bomber Command. There came a point when it was clear that there were militarily preferable uses for the resources devoted to the area bombing campaign, but Harris refused to cooperate, and indeed flatly disobeyed orders. This was a point when a PM could, and should, have got involved, but Churchill didn’t. Regard for Churchill in the UK did become nearly idolatrous after he had finally retired, but one of my favourite people in public life was the mayor of a Yorkshire or Nottinghamshire pit village. When Churchill died, the state funeral was, of course, massive, and every town and village had some event, except this one place (alas, I can’t remember the name). The BBC interviewed the mayor, to ask why, and his reply was to the effect that “Winston Churchill was never a friend of the working class while he was alive, so we’re not going to do anything for him now.” BTW, I’ve finally made sense of the crop of Quora postings about the Bengal famine and Churchill’s responsibility for it. Horrible, but it was 70 years ago, and why that and not also the Amritsar massacre, say, or the events of the late 1850s? But a recent one gave the game away, saying that Churchill said some horrible things (which is true), and that he was worse than Hitler, which is palpably false on the most jaundiced reading of Churchill’s life. There must be some kind of BJP youth wing campaign on, with a goal of doing a revisionist take on Hitler, so as to remove the unfortunate stigma on the RSS that it got on the wrong side in WW II. ",
            "date": "Answered August 30, 2016",
            "views": "86",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isak Khan",
                    "user_href": "/profile/Isak-Khan-9"
                },
                {
                    "user_id": "Sang Do",
                    "user_href": "/profile/Sang-Do-6"
                },
                {
                    "user_id": "Lachlan Bowden",
                    "user_href": "/profile/Lachlan-Bowden"
                },
                {
                    "user_id": "George Griffin Powers",
                    "user_href": "/profile/George-Griffin-Powers"
                },
                {
                    "user_id": "Damiano Faloci",
                    "user_href": "/profile/Damiano-Faloci"
                },
                {
                    "user_id": "Carol Milner",
                    "user_href": "/profile/Carol-Milner-1"
                },
                {
                    "user_id": "Lee Dennett",
                    "user_href": "/profile/Lee-Dennett"
                },
                {
                    "user_id": "Pik As",
                    "user_href": "/profile/Pik-As"
                },
                {
                    "user_id": "Ted Kennedy",
                    "user_href": "/profile/Ted-Kennedy-17"
                },
                {
                    "user_id": "Ashleigh Stanton",
                    "user_href": "/profile/Ashleigh-Stanton-2"
                }
            ]
        }
    ]
}