{
    "title": "Was there a time when ketchup was used as a medicine? - Quora",
    "tags": [
        "Ketchup",
        "Condiments",
        "Food"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dorlinda Chong",
                "href": "/profile/Dorlinda-Chong"
            },
            "answer_text": "Not that I am aware of. Tomatoes being a member of the nightshade family, there was a time when people in Europe wouldn’t eat them for fear of being poisoned. In fact, one of the amusing stories of the Revolutionary war was the time Washington’s cook, (a Tory spy), put tomatoes in his stew, and thinking that he had killed the general by this means, committed suicide so he wouldn’t be tortured. Washington supposedly noted that the stew had tasted particularly fine. Deadly Nightshade, (belladonna), has been used as both a poison and an eye drop to dilate the pupils, but I have no knowledge of tomatoes being used in any herbal remedy. Raw milk, OTOH, has been used as a drawing poultice, both with linseed oil and with yeast bread. I have it on personal experience that bread soaked in raw milk used as a poultice is a very effective drawing solution. (Chewed tobacco is also effective as a drawing agent.) ",
            "date": "Answered September 23, 2018",
            "views": "104",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chris Daniels",
                    "user_href": "/profile/Chris-Daniels-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doris Arnold",
                "href": "/profile/Doris-Arnold-1"
            },
            "answer_text": "A2A No, I have never heard ketchup or tomatoes being used as a medicine. I do remember hearing that at one time people would not eat tomatoes because they thought they were poisonous. ",
            "date": "Answered September 27, 2018",
            "views": "15",
            "upvotes": " Answer requested by Lydia Mimiaga"
        }
    ]
}