{
    "title": "Was 'Hagar the Horrible' based on an actual historical figure? - Quora",
    "tags": [
        "Hagar the Horrible",
        "Fiction",
        "Comic Books",
        "Fictional Characters",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roger Payne",
                "href": "/profile/Roger-Payne-56"
            },
            "answer_text": "10 Things You Might Not Know About Hägar the Horrible BY JAKE ROSSEN  For 45 years, the anachronistic adventures of a Scandinavian Viking named Hägar have populated the funny papers. Created by cartoonist Dik Browne, Hagar the Horrible is less about raiding and pillaging and more about Hägar’s domestic squabbles with wife Helga. If you’re a fan of this red-bearded savage with a surprisingly gentle demeanor, check out some facts about the strip’s history, Hägar’s status as a soda pitchman, and his stint as a college football mascot. 1. HÄGAR IS NAMED AFTER HIS CREATOR. Richard Arthur “Dik” Browne got his start drawing courtroom sketches for New York newspapers; he debuted a military strip, Ginny Jeep, for servicemen after entering the Army in 1942. Following an advertising stint where he created the Chiquita Banana logo, he was asked to tackle art duties on the 1954 Beetle Bailey spinoff strip Hi and Lois. When he felt an urge to create his own strip in 1973, Browne thought back to how his children called him “Hägar the Horrible” when he would playfully chase them around the house. “Immediately, I thought Viking,” he told People in 1978. Hägar was soon the fastest-growing strip in history, appearing over 1000 papers. 2. HE COULD HAVE BEEN BULBAR THE BARBARIAN.  KING FEATURES SYNDICATE Working on Hi and Lois with cartoonist Mort Walker (Beetle Bailey) gave Browne an opportunity to solicit advice on Hägar from his more experienced colleague. As Walker recalled, he thought “Hägar” would be too hard for people to pronounce or spell and suggested Browne go with “Bulbar the Barbarian” instead. Browne brushed off the suggestion, preferring his own alliterative title. 3. A HEART ATTACK COULD HAVE CHANGED HÄGAR’S FATE. When Browne came up with Hägar, he sent it along to a syndicate editor he knew from his work on Hi and Lois. According to Chris Browne, Dik’s son and the eventual artist for Hägar after his father passed away in 1989, the man originally promised to look at it after he got back from his vacation. He changed his mind at the last minute, reviewing and accepting the strip before leaving. Just days later, while on his ski vacation, the editor had a heart attack and died. If he hadn’t approved the strip prior to his passing, Browne said, Hägar may never have seen print. 4. THE STRIP HELPED BROWNE AVOID VANDALS.  KING FEATURES SYNDICATE Chris Browne recalled that Halloween in his Connecticut neighborhood was a time for kids to show their appreciation for his father’s work. While trick-or-treaters were busy covering nearby houses in toilet paper or spray paint, they spared the Browne residence. The only evidence of their vandalism was a spray-painted sign that read, “Mr. Browne, We Love Hägar.” 5. BROWNE’S DAUGHTER TALKED HIM OUT OF KIDNAPPING PLOTS. Vikings were not known for being advocates for human rights. Hägar, despite his relatively genteel persona, still exhibited some barbaric traits, such as running off with “maidens” after a plundering session. Speaking with the Associated Press in 1983, Browne admitted he toned down the more lecherous side of Hägar after getting complaints from his daughter. “Running off with a maiden isn’t funny,” she told him. “It’s a crime.” 6. HÄGAR ENDORSED SODA. Despite his preference for alcohol, Hägar apparently had a bit of a sweet tooth as well. In the 1970s, King Features licensed out a line of soda cans featuring some of their most popular comic strip characters, including Popeye, Blondie, and Hägar. The Viking also shilled for Mug Root Beer in the 1990s. 7. HE WAS A COLLEGE MASCOT. In 1965, Cleveland State University students voted in the name “Vikings” for their collegiate basketball team. After using a mascot dubbed Viktorious Vike, the school adopted Hägar in the 1980s. Both Hägar and wife Helga appeared at several of the school’s sporting events before being replaced by an original character named Vike. 8. HE EVENTUALLY SOBERED UP.  KING FEATURES SYNDICATE When Dik Browne was working on Hägar, the Viking was prone to bouts of excessive drinking. When Chris Browne took over the strip, he made a deliberate decision to minimize Hägar’s imbibing. \"When my father was doing the strip, he did an awful lot of gags about Hägar falling down drunk and coming home in a wheelbarrow, and as times go on that doesn't strike me as that funny anymore,” Brown told the Chicago Tribune in 1993. “Just about everybody I know has had somebody hurt by alcoholism or substance abuse.” 9. HE HAD HIS OWN HANNA-BARBERA CARTOON. It took some time, but Hägar was finally honored with the animated special treatment in 1989. Cartoon powerhouse Hanna-Barbera created the 30-minute special, Hägar the Horrible: Hägar Knows Best, and cast the Viking as being out of his element after returning home for the first time in years. The voice of Optimus Prime, Peter Cullen, performed the title character. It was later released on DVD as part of a comic strip cartoon collection. 10. HE SAILED INTO THE WIZARD OF ID.  ",
            "date": "Answered October 4, 2020",
            "views": "127",
            "upvotes": " Answer requested by Viktor Bondarchuk"
        }
    ]
}