{
    "title": "Was Anne of Cleves unsightly and smelly? Or, had Henry VIII been humiliated when he first met her that he couldn't back down? - Quora",
    "tags": [
        "Anne Boleyn (historical figure)",
        "King Henry VIII (historical figure)",
        "History of Great Britain",
        "British Monarchy",
        "England"
    ],
    "response": [
        {
            "author_info": {
                "name": "Heather Buettner Teysko",
                "href": "/profile/Heather-Buettner-Teysko"
            },
            "answer_text": "Contemporary sources say that Anne was very pretty, and one interesting tidbit is that after Katherine Howard was executed, many people thought Henry would go back to Anne, and she herself made some disparaging comments about Katherine Parr’s looks after Henry started courting her. Also interesting to note is that Holbein was never punished for his paintings. One would imagine, given Henry’s overblown reactions, that if the paintings were obviously made to enhance her looks, that he would have lost commissions, at the very least. That didn’t happen. I mean, Cromwell was put to death in part because of it. Holbein kept getting commissions. I don’t think Henry would have kept using him if he had really done that poorly of a job. The problem with the painting is that both the main one, and the miniature, are painted facing forward, and when you look at other portraits of Anne, done in Germany, and in profile, she had a pretty crooked nose. So that part was left out when you paint her facing forward. That is pretty much the only criticism of the painting that historians have come up with. Regarding his humiliation - indeed, it was incredibly awkward and humiliating to him when he burst in on her and she didn’t recognize him. In her new fictional story of Anne of Cleves Alison Weir puts forward the theory that Henry may have truly believed that she wasn’t a virgin - after all, he had had dozens of children through at least five women by that point (though the children mostly didn’t live, of course) and he would have been able to recognize a virgin belly from one that had gone through childbirth. You can listen to Alison talk more about this in her interview on my podcast here. Also, remember that there were legitimate questions about her precontract before she married Henry, which gave him a convenient out. Henry and Anne went on to be quite good friends, to the extent that there was a lot of gossip at court about them, and even rumors that she had his children - rumors that still persist today. It seems that they respected and had a true fondness for each other, but there just wasn’t the chemistry there. Add to that the humiliation he felt, and his questions on her virginity, and the possibility that she was still precontracted, and you have a perfect storm, really. ",
            "date": "Answered May 28, 2019",
            "views": "763",
            "upvotes": " View 187 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Morton Isaacs",
                    "user_href": "/profile/Morton-Isaacs"
                },
                {
                    "user_id": "Kay Turrill",
                    "user_href": "/profile/Kay-Turrill-1"
                },
                {
                    "user_id": "Eduardo Eusebio",
                    "user_href": "/profile/Eduardo-Eusebio-1"
                },
                {
                    "user_id": "Raeman Haines",
                    "user_href": "/profile/Raeman-Haines"
                },
                {
                    "user_id": "K Lina",
                    "user_href": "/profile/K-Lina-2"
                },
                {
                    "user_id": "Franda Back",
                    "user_href": "/profile/Franda-Back"
                },
                {
                    "user_id": "Billy Biden",
                    "user_href": "/profile/Billy-Biden"
                },
                {
                    "user_id": "David Doane",
                    "user_href": "/profile/David-Doane-11"
                },
                {
                    "user_id": "Anne Horacio",
                    "user_href": "/profile/Anne-Horacio"
                },
                {
                    "user_id": "Janice Oon Bee Li",
                    "user_href": "/profile/Janice-Oon-Bee-Li"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Overland",
                "href": "/profile/Brian-Overland-1"
            },
            "answer_text": "As European royalty being taken to meet a king in order to cement an alliance, I suspect she would’ve bathed before being taken to meet him. But remember that there were no photos in those days. Painted portraits were the closest thing, and… although some artists strove more for realism, it was common for portraits to be “flattering,” to make the royal person look much better than they did in real life. Henry was sent such a painting of Anne before they met. And this is essentially what happened: it was the Renaissance equivalent of a Royal Online Dating service gone horribly wrong. Essentially, Henry reacted the same way as someone who saw an old picture posted online, and the person no longer looked that good!!!!!!!!!! Or somehow the picture was touched up to make the person look leaner, younger, etc. One irony of course, is that Henry—by that time—was no prize either, to look at him. From all accounts, he’d been genuinely handsome as a young man, but by the time he met Anne of Cleaves he had put on hundreds of pounds. Ah, the problems of Medieval “Online” Royal Betrothal! (Or “MORBid” for short. (Morbidly obese, in Henry’s case.) But Henry rejected her too soon. Ironically, he felt guilty enough to put her up in England with her own castle and servants (the man was not without SOME conscience) and, ironically, he decided that he really enjoyed her company… as a friend. Ooooh… Poor Anne. Friend-zoned by His Majesty! But again, the irony: He ended up treating her much better than some of his other wives… some of whom, remember, he had beheaded. ",
            "date": "Answered May 26, 2019",
            "views": "2114",
            "upvotes": " View 915 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elletherese",
                    "user_href": "/profile/Elletherese"
                },
                {
                    "user_id": "Kimberly Rader",
                    "user_href": "/profile/Kimberly-Rader-13"
                },
                {
                    "user_id": "Neville James Scrooby",
                    "user_href": "/profile/Neville-James-Scrooby"
                },
                {
                    "user_id": "Carol Macfarlane",
                    "user_href": "/profile/Carol-Macfarlane-1"
                },
                {
                    "user_id": "Ann Bond",
                    "user_href": "/profile/Ann-Bond-22"
                },
                {
                    "user_id": "Billy Biden",
                    "user_href": "/profile/Billy-Biden"
                },
                {
                    "user_id": "Stephanie Ramsey",
                    "user_href": "/profile/Stephanie-Ramsey-53"
                },
                {
                    "user_id": "Allen Exelby",
                    "user_href": "/profile/Allen-Exelby-1"
                },
                {
                    "user_id": "Jane Glick-Coleman",
                    "user_href": "/profile/Jane-Glick-Coleman"
                },
                {
                    "user_id": "Jessica Pawluk",
                    "user_href": "/profile/Jessica-Pawluk"
                }
            ]
        }
    ]
}