{
    "title": "Was Ibn Rushd a Muslim? - Quora",
    "tags": [
        "Ibn Rushd (Averroes)",
        "Muslims"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Keiler",
                "href": "/profile/Jonathan-Keiler-1"
            },
            "answer_text": "Yes, but he did not conform to the prevailing idea that the Koran was the literal, actual and unalterable word of God. He was not that far from the idea, but believed that there was a tiny bit of human agency between the revelation of Allah to Mohammed, rather than the Koran representing the very words of the deity. His position was not popular before his time, and after a short period of consideration, was rejected almost universally by Islamic clericalism after his death. Had his ideas gained or retained prominence in Islam, it would have offered the belief system a logical way out of doctrinal orthodoxy and into Western-style modernity. Unfortunately, that did not happen. The Islamic community generally accepts Ibn Rushd as a Muslim, because he is recognized as a great philosophical figure—though some would disagree—but Islam generally rejects his most important ideas. ",
            "date": "Answered October 25, 2017",
            "views": "397",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammad Nihal Shaikh",
                    "user_href": "/profile/Mohammad-Nihal-Shaikh"
                },
                {
                    "user_id": "Alena Němcová",
                    "user_href": "/profile/Alena-Němcová-2"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "Scott Hakala",
                    "user_href": "/profile/Scott-Hakala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Hunt",
                "href": "/profile/Ian-Hunt-46"
            },
            "answer_text": "Ibn Rushd (the grandfather) was a hugely important Islamic scholar. He is well respected and loved by Muslims. Ibn Rushd (the grandson, also a philosopher) is not considered to be a Muslim by Islamic theologians. This is because he claimed that although the universe is created by God, “universeness” is eternal and uncreated. In doing so, he claimed that there is something other than God that is eternal, which directly goes against one of the most fundamental Islamic beliefs, and also goes against the Qur’an. ",
            "date": "Answered October 26, 2017",
            "views": "733",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammad Nihal Shaikh",
                    "user_href": "/profile/Mohammad-Nihal-Shaikh"
                },
                {
                    "user_id": "Adeel Arif",
                    "user_href": "/profile/Adeel-Arif-36"
                },
                {
                    "user_id": "Yassin Mohammed",
                    "user_href": "/profile/Yassin-Mohammed-6"
                },
                {
                    "user_id": "Syed Baqar ali Syed",
                    "user_href": "/profile/Syed-Baqar-ali-Syed"
                }
            ]
        }
    ]
}