{
    "title": "Was the British Empire, on average, a force for good in the world? - Quora",
    "tags": [
        "Legacy of British Rule"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Joseph",
                "href": "/profile/Robert-Joseph-86"
            },
            "answer_text": "No. Let me clarify. The Mongols killed almost 30,000,000 people, the Nazis directly and indirectly killed around 40,000,000. The British empire blows these atrocities out of the figurative ballpark. The death toll throughout history due to British action(or inaction) is over 150,000,000. Let that sink in. The British killed almost 5 times as many people as the Mongols. The British Empire stood for over 300 years right? Most of those deaths must have occurred a long time ago right? Well, you’d be wrong. Case in point, the Bengal famine. The Bengal famine was an artificially created famine. In 1943, the rice harvest of Bengal was better than normal. It was certainly more than enough to support the population of Bengal. Then Winston Churchill, a war hero, diverted food grains away from India to supposedly fuel the war effort in Eastern Europe. He felt that the food would be of better use feeding sturdy Greeks rather than Indians who bred like rabbits anyway. The grains were found to be rotting away in granaries uneaten years after the war had concluded. To exacerbate the issue Churchill declined over a 1,000 tonnes of rice Canada offered as well as 10,000 tons of wheat the USA offered. When interviewed about the Bengal Famine, Churchill reportedly said that the famine was the fault of the Bengalis for breeding like rabbits. In clearer terms Churchill created the famine which killed over 3,000,000 people. Churchill was a psychopath on the level of Hitler and Stalin. He was exonerated of his crimes by the virtue of being on the winning side. That is why the British Empire with its murderous leaders was certainly one of the most violent and bloodthirsty empires to ever stand on the face of the earth. So no, the British empire was definitely not on the average a force for good.  9th August 2020: I’ve still been receiving hate about this. While this does bother me to some extent, I thinks the insight that this provides is fascinating. The way people get so defensive when their foundational realities are challenged, it’s obvious that a lot of people in the comments here were brought to believe that the British Empire and it’s leaders were a benevolent and magnanimous lot and when someone challenges their perception, people are obviously upset. I’m sorry I had to be the wake up call but the British Empire was a cruel, racist, insensitive empire with a callous disregard for any life that was not white. No amount of imperial apologism will change this. Some British leaders regarded Indians much the same way as Nazis did Jews, only they weren’t so audacious. ",
            "date": "Updated August 8, 2020",
            "views": "1528",
            "upvotes": " View 8.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Damien Darragh",
                    "user_href": "/profile/Damien-Darragh"
                },
                {
                    "user_id": "Topper Bravo Yadav",
                    "user_href": "/profile/Topper-Bravo-Yadav"
                },
                {
                    "user_id": "Jose Antunez",
                    "user_href": "/profile/Jose-Antunez-8"
                },
                {
                    "user_id": "Hamza Yousaf",
                    "user_href": "/profile/Hamza-Yousaf-45"
                },
                {
                    "user_id": "Pablo Bazzano",
                    "user_href": "/profile/Pablo-Bazzano-1"
                },
                {
                    "user_id": "David Carballo",
                    "user_href": "/profile/David-Carballo-3"
                },
                {
                    "user_id": "Anton Lebedev",
                    "user_href": "/profile/Anton-Lebedev-12"
                },
                {
                    "user_id": "Snyman Rijkloff",
                    "user_href": "/profile/Snyman-Rijkloff"
                },
                {
                    "user_id": "Tin Pizent",
                    "user_href": "/profile/Tin-Pizent"
                },
                {
                    "user_id": "Petru Dancs",
                    "user_href": "/profile/Petru-Dancs"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jordan Cook",
                "href": "/profile/Jordan-Cook-65"
            },
            "answer_text": "This is a highly debatable topic but to sum everything up, the British Empire had its pros and cons. Here are some reasons why the British Empire was a good thing. Pros Britain’s colonization of nations helped nations worldwide westernize technologically and socially.The British Empire led to the creation of nations such as the United States, Canada, Australia, and India which are all nations that have played significant impacts on modern society. For example the United States created the United Nations which has caused more peace worldwide than ever in the past.The existence of the British Empire led the connection of all sorts of different cultures worldwide. For the first time, the British Empire truly was able to connect people from all of the world under one banner which helped lead to modern maritime trade and whatnot.The British Empire helped create Democratic governmental systems world wide. Commonwealth nations such as Canada and Australia have some of the highest standards of living worldwide and a large reason why this is the case is because of the governments that they have that are based of Britain’s.If it wasn’t for the British Empire, the Napoleonic Wars, World War 1, and World War 2, all would have turned in favor of the nations that opposed Britain. Hitler could have ruled Europe along with Napoleon if it wasn’t for Britain having its colonies during its fight against their enemies.The British Empire taught many parts of the world skills that changed their societies for the better. The British helped establish potato farming in the Western Hemisphere while also establishing share-cropping in many countries too.Cons The British destroyed many essential parts of cultures around the world. During the War of 1812, the British burnt down the White House in America, demoted tribal practices in their African colonies and so on.The British established racial division worldwide. In the America’s the British helped establish slavery while in South African they helped establish Apartheid, which divided that region racially for many years. They also put white plantation owners over natives in their Caribbean colonies for many years.The British were not able to maintain all of the nations that they held due to their own personal entanglements in Europe. For example during World War 2 their was a massive Indian famine that made millions of Indians starve due to the fact that the British couldn’t send supplies to the region. They had to worry about the Germans and sending supplies would have been risky so they tried not to, causing the famine.Due to the British Empire and their cons, many people worldwide started to view Europeans poorly. They were stereotyped as murderers and evil due to empires such as that of the British.A lot of Britain’s colonies failed after receiving independence, largely due to the British Empire. Britain’s colonization of Israel helped cause the Israeli-Palestini conflict that is present today and also they helped created a lot of the conflicts that are seen in African nations such as Uganda.The British Empire granted the chance for other empires to rise around the world which caused many issues. Britain’s weakening of China during the Opium Wars caused China to be too weak to fight off the Japanese during World War 2 along with the Malaysians, Singaporese, etc.These are just some pros and cons that I thought of on the top of my head. I would say that from all of this the British Empire was good but also had its flaws as well as you can see. I hope these all helped! ",
            "date": "Answered December 22, 2017",
            "views": "144",
            "upvotes": " View 61 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Donald G. Boudreau",
                    "user_href": "/profile/Donald-G-Boudreau"
                },
                {
                    "user_id": "Paul Haslam",
                    "user_href": "/profile/Paul-Haslam-15"
                },
                {
                    "user_id": "Robert Sedgwick",
                    "user_href": "/profile/Robert-Sedgwick-4"
                },
                {
                    "user_id": "Ian Barber",
                    "user_href": "/profile/Ian-Barber-25"
                },
                {
                    "user_id": "Richard Frost",
                    "user_href": "/profile/Richard-Frost-26"
                },
                {
                    "user_id": "James Hall",
                    "user_href": "/profile/James-Hall-1103"
                },
                {
                    "user_id": "Oliver Ashmore",
                    "user_href": "/profile/Oliver-Ashmore-2"
                },
                {
                    "user_id": "Aswin Nair",
                    "user_href": "/profile/Aswin-Nair-74"
                },
                {
                    "user_id": "Harry Warrior",
                    "user_href": "/profile/Harry-Warrior"
                },
                {
                    "user_id": "Nicholas Ryan",
                    "user_href": "/profile/Nicholas-Ryan-55"
                }
            ]
        }
    ]
}