{
    "title": "Was Trump inadequate during the Covid-19? - Quora",
    "tags": [
        "COVID-19 (2019-2020)",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Hutton",
                "href": "/profile/Michael-Hutton-20"
            },
            "answer_text": "The hallmark of Trump’s handling of the COVID-19 pandemic can be captured with this quote: “No, I don’t take responsibility“ (in reference to the botched test rollout). But, to clarify his ineptitude, here are the highlights and these are only a brief summary of his disastrous handling of the pandemic. The Obama administration left Trump a detailed series of plans and reports on how to address pandemics. All those reports were removed from the White House website in January 2017. On March 10, Trump told the country that America was prepared and doing a great job. “And it will go away. Just stay calm. It will go away.” (120,000 dead and counting) He is a president who refuses to let facts drive scientific decisions. For example: He described the Covid-19 virus as a bacterium that is resistant to antibioticsHe insisted that the virus could not cause a pandemic, that warm weather, as well as sunlight, will kill it, andHe has repeatedly touted untested pharmaceuticals such as hydroxychloroquine as well as other noxious household detergents as interventions to either prevent or treat infection.His remarks taken together cannot be excused as occasional gaffes or verbal missteps. They’re the words of someone who simply doesn’t understand science — and doesn’t want to. And, the consequences of his failure to lead and his ignorance are the deaths of a 120,000 Americans. He failed to use the power of the presidency to initiate a whole of government approach to fight the pandemic And, now we are dealing with the consequences. We have no idea whether this will get worse or fade away; but, Trump only accelerated and magnified what could’ve been managed. ",
            "date": "Updated June 28, 2020",
            "views": "150",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edward Lafreniere",
                    "user_href": "/profile/Edward-Lafreniere"
                },
                {
                    "user_id": "Ken Bothwell",
                    "user_href": "/profile/Ken-Bothwell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Gillespie",
                "href": "/profile/Jerry-Gillespie-4"
            },
            "answer_text": "Trump has done the best possible especially during the pandemic. People still suffering from Trump Derangement Syndrome will always condemn Trump no matter what he does. This has been the case with the news media and the radical lefts historic and on-going attacks on all Republican presidents. They have wanted to convict previous Republican presidents for any made up lie. This is all that they know how to do. They were okay with Bill Clinton being a sexual pervert, Obama giving Iran billions in cash without a reason. They are fine with Hillary Clinton with the massive evidence of her criminal activity and the selling foreigners access to the President. They don’t criticize their own for crimes or actions and it is like to qualify to be a Democrat president all he or she needs to be is either corrupt, a pervert or a criminal. ",
            "date": "Answered May 20, 2020",
            "views": "61",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jamesphilip Dumantay Wilson",
                    "user_href": "/profile/Jamesphilip-Dumantay-Wilson"
                }
            ]
        }
    ]
}