{
    "title": "Was Napoleon Bonaparte considered royalty? - Quora",
    "tags": [
        "Napoleon Bonaparte",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Enrico Toro",
                "href": "/profile/Enrico-Toro"
            },
            "answer_text": "Yes, but in a post enlightenment way, by will of the people as opposed to ancient regime monarchs who were sovereigns by will of God. So for as much as people and a nation can decide to confer a title of monarch to someone, Napoleon was royalty. If you read bulletpoint 3) of this incredibly detailed answer by Epaminondas Kolokouris you will learn a lot on how Napoleon ended up becoming royalty. What are the biggest myths about Napoleon? Of course his opponents, especially the royalists, always considered him to be an usurper, and only the Bourbons the legitimate monarchy. And tons of ink have been used in the debate. But I think that if Napoleon had been left in power he would have probably been the first of a dynasty of constitutional monarchs. Probably short lived, given the strong republican forces in the nation, but still a dynasty. ",
            "date": "Answered August 14, 2018",
            "views": "688",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raj Das",
                    "user_href": "/profile/Raj-Das-75"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Lammers",
                "href": "/profile/Joe-Lammers"
            },
            "answer_text": "No, the other monarchs of Europe always considered him a usurper. Napoleon himself took the title of “Emperor of the French” and not “King of France” because the first title smacked too much of royalty, which the French Revolution had overthrown. In his final years, in exile on St. Helena island, his relationship with the British governor, Sir Hudson Lowe, was usually acrimonious. Napoleon insisted on being called by his title “Emperor of the French” while Lowe addressed him as General Napoleon.The story of Napoleon's exile on St Helena ",
            "date": "Answered August 17, 2018",
            "views": "475",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raj Das",
                    "user_href": "/profile/Raj-Das-75"
                },
                {
                    "user_id": "Kristoff Etranos",
                    "user_href": "/profile/Kristoff-Etranos"
                },
                {
                    "user_id": "Du Toit van Schalkwyk",
                    "user_href": "/profile/Du-Toit-van-Schalkwyk"
                },
                {
                    "user_id": "Brent Kelly",
                    "user_href": "/profile/Brent-Kelly-10"
                },
                {
                    "user_id": "Matthew Ciccone",
                    "user_href": "/profile/Matthew-Ciccone-2"
                }
            ]
        }
    ]
}