{
    "title": "Was Japan anywhere near developing an atomic bomb during World War 2? - Quora",
    "tags": [
        "Japan in World War II",
        "Bombs",
        "Nuclear Weapons",
        "Japan",
        "World War II",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Pellas",
                "href": "/profile/William-Pellas"
            },
            "answer_text": "Yes, but this was only the first step on the road to a practical, fully functional weapons system. Although primary source documentation regarding the WWII Japanese atomic bomb projects is generally fragmentary because so much paper was burned at the end of the war, sufficient traces have survived to sketch at least the broad outlines. It appears that it was the Japanese Army which first began the formal, organized pursuit of the weaponization of nuclear energy. Initially there were two branches of Army officialdom involved in atomic bomb research and development: the Army Aeronautical Technical Research Institute in mainland Japan, and the Kwantung Army in “Manchukuo”, the Japanese puppet state carved out from captured Chinese territory in Manchuria. The Imperial Japanese Navy later launched its own nuclear quest, probably in 1943, though a considerable amount of preliminary research had already occurred at the Navy’s main brainpower reserve, Kyoto Imperial University. As the tide of war turned and Allied forces grew ever larger, more powerful and better trained, and as they advanced ever closer to Japan itself, the Japanese grew increasingly desperate. In spite of their intense mutual hatred, the Imperial Navy joined forces with the Army and the two armed services threw all of their scientific and industrial resources together in a last gasp project located in what is today North Korea—territory conquered by Japan in the 1904–5 Russo-Japanese War, and subsequently developed by several zaibatsu colonial - slave labor enterprises. It was off the coast of Korea that Japan’s genshai hakai dan—its “element bomb”—was said to have been tested, just days after the second US-Allied atomic bombing at Nagasaki. There is also mention of an apparent, earlier weapons test somewhere in the Gobi Desert. Presumably this involved the Kwantung Army project, but very few details about this event in early 1945 have surfaced to date. Whether this branch of the Japanese atomic enterprise was amalgamated with what the Imperial Navy and Army were doing in Korea, I don’t know at this time. Even if the Japanese really did get as far as a working prototype atomic bomb, however, there was still the question of how it was to be delivered on target. Here a number of factors would have been in play, including the size, shape, and weight of the device, the distance to the target or targets, and the numbers and quality of any defensive forces in the vicinity. For Further Reading: William Pellas's answer to If the US had not dropped atomic bombs on Japan, how soon would Japan have been able to drop atomic bombs on America? William Pellas's answer to Is it true that Japan developed an atom bomb at the end of WWII? William Pellas's answer to Did the Japanese know that atomic bombs were being built? ",
            "date": "Updated February 3, 2020",
            "views": "360",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ivaylo Ivanov",
                    "user_href": "/profile/Ivaylo-Ivanov-38"
                },
                {
                    "user_id": "Pasha Aulia Muhammad",
                    "user_href": "/profile/Pasha-Aulia-Muhammad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig R. Summers",
                "href": "/profile/Craig-R-Summers"
            },
            "answer_text": "There had been a rumor they were about to test a device on the east coast of what is now North Korea, Aug 15, 1945 the day the Emperor made it known that Japan would surrender. They did have at one time have two Nuclear programs going on up until the big firebomb raid on Tokyo which destroyed their Army program. However their Navy program was able to continue in what is now North Korea. Japan certainly had the brain power to do this , having very capable scientists and engineers working in both programs. Their major problem was getting raw materials and having enough machinery to process and test such materials. Nevertheless there are some who believe they were barely able to do it by gathering materials found in the lands they had grabbed and occupied and had some help from Germany. And that they could have run some kind of major test by Aug 15, 1945. But it was generally believed by the Japanese that Nuclear bombs were possible but the it would take about another 10–20 years before even the USA could make one, up until of course Hiroshima and Nagasaki were hit. So when these two cities were hit some of these Japanese were not too surprised. And they had an idea of what to expect of these bombs results. ",
            "date": "Answered August 27, 2019",
            "views": "48",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "William Pellas",
                    "user_href": "/profile/William-Pellas"
                },
                {
                    "user_id": "Kelly La Rue",
                    "user_href": "/profile/Kelly-La-Rue"
                }
            ]
        }
    ]
}