{
    "title": "Was a peasant’s life in 13th century Europe better than in 2nd century Rome? - Quora",
    "tags": [
        "Peasants",
        "Middle Ages (era)",
        "Roman Empire",
        "Ancient Rome"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "Yes. The 2nd century Roman peasant would have been a slave at a latifundium. The Roman agriculture was extremely concentrated and based on large estates, and smallholding had effectively disappeared completely during the Marian period, 1st century BC. Latifundia were based on slavery, and slaves toiled there. The latifundia could produce agricultural products cheaper than smallholders, as they did not need to pay their workers salary, and they could coerce their workforce. Needless to say, most agricultural slaves did not see their 40th birthday. Slaves were not human beings according to the Roman law, but chattel. The 13th century peasant would have been either a serf, a tenant farmer or a yeoman. Slavery had disappeared already during the Dark Ages (476 to 800) and being superseded by the feudal system. Serfs were unfree, tenant farmers were free but they did not own their land, and yeomen were free and owned their land. Everyone was considered a human being according to law, and even serfs had a legal right to flee if they were treated badly. If you were a Roman peasant in the 2nd century, you were not only bound to the land, but also your master could treat you as on his whim. If you were a Medieval peasant and if you were a serf, you were bound to the land but you also had rights and responsibilities. The Enlightment scholars and philosophers have attempted to show the Middle Ages in as bad light as possible, inventing things which never existed in the first place, such as droit de seigneur. Serfdom pretty much disappeared in Italy and Southern Europe in the 11th-12th centuries, and in the Western Europe during the 13th-14th centuries. The Black Plague meant the rise of price on work force and on salaries, and most serfs simply bought themselves free. ",
            "date": "Answered May 31, 2019",
            "views": "79",
            "upvotes": " View 245 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Irfan A",
                    "user_href": "/profile/Irfan-A-20"
                },
                {
                    "user_id": "Cesar Contreras",
                    "user_href": "/profile/Cesar-Contreras-1"
                },
                {
                    "user_id": "Melissa Myers",
                    "user_href": "/profile/Melissa-Myers-18"
                },
                {
                    "user_id": "Brent Fisher",
                    "user_href": "/profile/Brent-Fisher-1"
                },
                {
                    "user_id": "Simon Long",
                    "user_href": "/profile/Simon-Long-22"
                },
                {
                    "user_id": "Tom Billings",
                    "user_href": "/profile/Tom-Billings-8"
                },
                {
                    "user_id": "Kamil Olesiński",
                    "user_href": "/profile/Kamil-Olesiński"
                },
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-2"
                },
                {
                    "user_id": "Daniel Aldridge",
                    "user_href": "/profile/Daniel-Aldridge-8"
                },
                {
                    "user_id": "Maitreya Bhoir",
                    "user_href": "/profile/Maitreya-Bhoir"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Catlin",
                "href": "/profile/Colin-Catlin"
            },
            "answer_text": "As pointed out by other answers, quite a large portion of the Medieval population were serfs and a large portion of the Roman population were slaves. It is hard to make comparisons, but I think we can say that both serf and slave are roughly equivalent, in that their life was tied to agricultural success or failure - benefiting little from the successful years, but suffering terribly in poor years. Yet I would argue that the Roman ‘peasant’ had things better in the time period chosen - 2nd century CE vs 13th century CE on the grounds that the Roman empire was in the middle of the Pax Romana, a period of unprecedented peace across Europe and the Mediterranean. The Pax Romana meant that most inhabitants of the Roman empire would have seen little to no warfare anywhere near home. Medieval Europe, on the other hand, would have faced more frequent pillage and plunder by passing bands and armies. Warfare also meant more taxes and impositions, straining the already limited resources of the lower classes. The increased integration and trade of the Roman empire meant for good opportunities for those of a more middle class background. People can and did move from one corner of the empire to the other, people from the Levant and Africa were to be found up near Hadrian’s Wall in Britain, and vice versa. Increased trade also meant more stable food supply. The city of Rome was usually fed from North Africa, but also sourced grain from Egypt, the Black Sea, and indeed most provinces probably supplied grain to Rome at one time or another. This was driven in part by large grain ships, of a scale not seen again until the Industrial revolution. Most places would have had a greater hope of relief from famine in this way than in later medieval times. Overall the homogeneity of the Roman empire was a strength. The most prosperous corner of 12th century Europe probably had better conditions for peasants than the nicer parts of Roman territory (due to Rome having greater income inequality, with the success more limited to the rich), but as an average across a continent, Rome seems the superior. Technology is a bit more complicated. The Dark Ages were not actually quite as dark as most people think, and saw improvements in agriculture like improved heavy/mouldboard plows, improved mills, and improved technology for using horses. Medicine also likely improved. However, Roman cities were likely to have better infrastructure than their medieval counterparts. The 14th Century brought the Black Death, which resulted in widespread gains to peasants and the effective end to serfdom in most places (due to a low supply of peasants, giving them more bargaining power). It is a massive generalization, but I think post Black Death Europe would have been the first time peasants had a clear advantage overall over their Pax Romana equivalents. ",
            "date": "Answered March 16, 2020",
            "views": "78",
            "upvotes": "0"
        }
    ]
}