{
    "title": "Was Elton John a good singer? - Quora",
    "tags": [
        "Elton John",
        "Madonna (musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Retro Reginald",
                "href": "/profile/Retro-Reginald"
            },
            "answer_text": "Elton is so amazing! Take it from a mega fan myself… though I’m not afraid to admit that some songs he can’t quite do like he used to. But, to say someone is a “good” singer is super subjective. Here’s what I think about Elton. Elton is in general, pretty underrated and overlooked for his talents. On a celebrity level, he’s probably gotten TOO much attention, lol. He’s super present with every day life, whether he’s got a new single on the charts, helping charity and his AIDS Foundation, or even simply being in a Snickers ad… he’s been knighted and everything. He’s gotten more than enough fame, but unfortunetly, not all of him has been widely recognized and appreciated.What I mean is that he’s actually a badass piano player, and of course, singer! Without going off on different topics on his music, I’ll stick solely to his singing here. Elton began his singing career when he was about 20, and he’s 71 now, so that’s like 5 decades of variance in his voice. So nobody should literally expect him to sound the same! For the average listener, it’s really hard to listen to a song like “Rocket Man” from 1972 and then hear him sing it now. It’s just SO different, right? Well, yes and no. Elton’s most iconic hits from the 70s came from the years 1970–1976, which was his entire 20s. In that frame of time his voice didn’t alter much. That was his heyday, I suppose, and that’s the Elton most people think of when they hear his name.It was in 1977 when he turned 30 that he took a completely different direction to his singing. He paired up with a man named Thom Bell who worked with R&B artists like The Stylistics, The Delfonics, and The Spinners. Thom taught Elton how to use his deeper ranges, and encouraged him to sing lower in addition to the high range he already has/had. And what happened between the years of 1977–1984 were some of Elton’s absolutely GREATEST periods of singing, ever! The vocal lessons from Thom Bell paid off. Here are 3 examples (live and studio) I can give of his voice during that time and how wide his range was. He was without a doubt, SO underrated and overlooked as a singer.    I think those should give you a rough idea of his range at that time and how his lower register was becoming more prominent, in addition to his already established higher range. In 1985 however, things really started to change for him. During his touring from late 1985 and well into ‘86, Elton’s voice was sounding terribly gravelly and raw. He sounded downright awful and maybe even ill… and this was during Elton’s most drug-fueled days. Stubborn and high, of course, he put off his singing concerns and continued touring and touring, ignoring the fact that his singing was getting worse. It became so bad than when Elton would try to sing high notes, he’d miss them and they’d become “hiccups”. Here’s some of the hiccups when he sings “Give me a peace of mind” in the chorus:  If you can bear through the shitty quality, here’s another example of his awful voice. Listen for the flanger effect.  Wow, it’s hard for even a mega fan like me to listen to that, lol! It’s obvious that he struggled immensely with the higher notes, and if you listen carefully, sound mixers actually put a flanger effect on his voice during the chorus to smooth out the roughness because he sounded so terrible. When your voice needs extra aid like that is when it’s time to stop. And the flanger effect would continue during the rest of the tour because silly Elton didn’t see any problem! I’ve just recovered from a laughing attack at those videos. Anyway… FINALLY, in January of ’87 Elton decided to get his throat checked out, and people were spreading rumors that he had throat cancer. Nope. All he had were polyps/nodules on his throat that needed to be removed. They did the surgery and after awhile of healing (which is why Elton didn’t do live performances in 1987 much), Elton was recovered and he no longer had the “hiccups”! Great right? But what about his high range? Did that mean goodbye?There’s a common misconception that Elton’s surgery in 1987 was responsible for destroying Elton’s high range, but that is blatantly not true. All the surgery did was remove the nodules, and it smoothed the rawness of his voice. That was essentially it. Elton made sure before he got surgery that it would not alter his singing in any way and it really did not. So, what happened to his high range? Nothing really. Just the natural ageing process… it was unrelated to surgery.Don’t believe me? There are some incredible performances of Elton still reaching high notes after surgery. I’ll use Elton and Aretha’s duet, “Through The Storm” as an example, from 1989.  He DEFINITELY was more than capable of singing high notes once he was able to heal from his surgery. The surgery has helped him FAR more than it’s done harm. But you got to remember now, Elton turned 40 in 1987 and by then he was getting older and the natural progression of his voice was showing. He just sounded more “mature”, in a way I think we all understand. I mean, a 60 year old man won’t talk with the same pitch his 20 year old self did, right? Around his rehab period in 1990, Elton started adjusting to his maturing voice. It wasn’t that he couldn’t sing the higher notes- he definitely could. But they were no longer comfortable notes to be hitting. In other words, he didn’t “lose” his high range until the mid 2000s when age really started to catch up. He only didn’t sing so high in the 90s because he had a growing lower range and was using it to his maximum. He was able to be just as dynamic in his lower range as he was with his higher stuff in the 70s. Here’s a great live example of Elton messing around with his low notes in 1993… and credit to his AMAZING backup singers for providing the other amazing spectrum of voices. He starts singing at around 4:44.  I think that his lower range is just as epic as his higher one!Now that you got the big idea of what “happened” to his voice, the rest just falls in the place. Now, he’s just getting older and his range of comfortable notes is pretty much stagnant- and yeah, it’s safe to say he’s lost his high range by now. But, just because he can’t sing high anymore doesn’t mean he sucks at all! Indeed, when he sings songs like “Tiny Dancer” and “Rocket Man” which require higher notes that he can’t do, it’s nothing out of the ordinary. He hasn’t been singing those songs like the originals since the mid 1980s! What Elton does now is actually very remarkable. He: A.) Uses what range he has right now to its fullest and doesn’t hold back anything at all. So his voice comes out clear and strong despite his range shortening.B.) Still sings all of his songs in the original keys, despite vocal changes. I think he’s a phenomenal singer still, at least of someone his age. He is able to project his voice very loudly and he doesn’t squeak and make “hiccups” like his nodule days. His voice never fumbles, ever. I can’t find one performance of him these days were he “messes up”. His concerts are so, so, SO enjoyable these days if people would just set his vocal changes aside and appreciate the general beauty of the song. They need to stop comparing his vocals of the past to the ones today. 50 years is a long ass time to be making music and like any other artist, it’s absolutely impossible not to change. Now, whether you like the change or not is all a matter of opinion, but I don’t believe Elton is “bad” at singing at any point in his life. He just has his ups and downs. There are actually some songs that Elton sings better now than he used to. I think “Sacrifice” is one of those.People call me crazy but I think Elton’s voice easily compares to those like Michael Jackson and Freddie Mercury and stuff. When I say compare I don’t mean “better”. I just mean that he has the same capabilities as those who are famous particularly for their singing. I just think, as I said in the beginning, that Elton’s vocal talents are misunderstood and ignored when in fact they are actually extraordinary. He’s an amazing singer, period. Hope that slightly answers your question. I’ll be seeing Elton 3 times this month in Michigan. Those will be my 3rd-5th Elton shows. I recently saw him in Las Vegas this year and honestly it was SO worth the thousands of dollars and plane rides. Phenomenal is an understatement. His showmanship is LEGENDARY and he sang songs like Levon, Mona Lisas and Mad Hatters, Circle of Life, etc., so heavenly! He is definetely worth seeing at least once. He’s some of the last real talent we have in this world from a bygone era. By the way I’m only 19. I mention this because Elton is like 50 years older than me, and for someone as young as me to dig a man so much like this is pretty significant to Elton’s career. It means he’s still “hot”. He’s still got it. He’s still talented and still kicks ass. I know plenty of teenagers and even kids who think Elton is amazing. And they all talk about how great of a SINGER he is… not just musician! So people all over of all ages, races and genders adore his voice. It’s just something to think about. He really has a beautiful voice! One last thing. Here’s a video on his actual voice range through the years.  ",
            "date": "Answered October 2, 2018",
            "views": "55",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kathleen Collins",
                    "user_href": "/profile/Kathleen-Collins-68"
                },
                {
                    "user_id": "Narendra Samal",
                    "user_href": "/profile/Narendra-Samal-3"
                },
                {
                    "user_id": "Philip David Williams",
                    "user_href": "/profile/Philip-David-Williams"
                },
                {
                    "user_id": "Jose Alberto Garcia Lozada",
                    "user_href": "/profile/Jose-Alberto-Garcia-Lozada"
                },
                {
                    "user_id": "Elai Gwood",
                    "user_href": "/profile/Elai-Gwood"
                },
                {
                    "user_id": "Hà Tấn Phát",
                    "user_href": "/profile/Hà-Tấn-Phát"
                },
                {
                    "user_id": "Sophie Osrev Ol",
                    "user_href": "/profile/Sophie-Osrev-Ol"
                },
                {
                    "user_id": "Roy Nilsen",
                    "user_href": "/profile/Roy-Nilsen-3"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Gerald Feltch",
                    "user_href": "/profile/Gerald-Feltch"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Hall",
                "href": "/profile/David-Hall-594"
            },
            "answer_text": "Yes, indeed. Elton John was an exceptionally good vocalist. He’s not anymore. He has lost his voice and he can’t sing anything like he used to. I don’t think he is doing the legacy of the exceptional recordings he made in the 70′s too many favours by performing so prolifically today. I’d compare it to AC/DC’s Bon Scott era. Bon Scott recorded a significant volume of exceptional performances in the late 70’s, but the difference was that Bon Scott, rather unfortunately just died. Today, the legacy of the early AC/DC material is legendary. Bon Scott’s performances of that era can never be tarnished, because he’s not around to discredit or diminish them with his ageing, diminishing talent. I suspect that in the decades following Elton John’s life, his early recordings will be the chronicle of his career. I doubt that many of his post 1980’s performances will be remembered. ",
            "date": "Answered February 18, 2020",
            "views": "622",
            "upvotes": "0"
        }
    ]
}