{
    "title": "Was the American revolution a revolution or revolt? - Quora",
    "tags": [
        "The American Revolutionary War"
    ],
    "response": [
        {
            "author_info": {
                "name": "Linus Skov",
                "href": "/profile/Linus-Skov"
            },
            "answer_text": "You can argue for both, and I wouldn’t say they’re mutually exclusive. It was definitely a revolt, of sorts, in that the Thirteen Colonies renounced their allegiance to the United Kingdom of Great Britain and Ireland. But that doesn’t say much about whether or not it was a revolution. In my view (although I realize this is not the dictionary definition), for a revolt to be called a revolution, it must be more or less an outlet for new ideas, and a battle in a larger conflict between ideologies. The state that results from said revolt should be fresh experiments with radical ideals. This is also applicable to failed movements. If this is our definition of our revolution, then the American War of Independence is undoubtedly one. The end of the 18th century was particularly interesting, because the ideals of the Enlightenment were beginning to manifest politically, and all the innovative and classicist patterns of thought and theory were culminating in the ideology of liberalism.  Coloured engraving of Gutenberg. Liberalism has it’s roots in the beginning of the early modern period, and is inexorably linked with the American Revolution In Europe, the various facets of this brand-new ideology were, as yet, untried, and widely disliked among the ruling elites. The dominant institutions of the Church abhorred the notion of secularism, and the freedom of religion advocated by the enlightened gentlemen sponsoring the revolution. Absolute monarchy was the norm, and all legislation was based not on utilitarian reasoning of cost and benefit, as is the norm in modern societies, but on norms and personal motives of the monarch.  Until the election of Donald Trump, I didn’t think a man similar to Louis XIV could have been elected president of the US. Even though Britain was realizing the futility of mercantilist economics, the major economies of Europe had still not abandoned it in favour of free trade doctrine. But all of this was replaced in the US. There was no monarch, but a democratically elected president. There was no state religion, but freedom to practice whatever beliefs you held. This was something brand-new, and became an experiment that the rest of the Western world watched closely. It ended up, more or less, making liberal political ideals the norm. Eventually, it inspired a similar bourgeoisie insurrection in France, which no-one disputes was a revolution.  Jefferson, Franklin and Adams working on the Declaration of Independence. The Enlightenment credentials held by each of these are indisputable. According to Jefferson, the three greatest men in the world were Locke, Bacon and Newton I’m by no means denying that other motives inspired the revolt as well. It’s widely known that some of the Founding Fathers had grievances with the British about their illegal smuggling of tea, and I doubt every single militiaman cared as much about the separation of church and state, as Jefferson did.  They probably aren’t discussing the works of British empiricists or the virtues of the separation of powers But that doesn’t disqualify it. Revolts everywhere in history aren’t just spontaneous and sudden events, caused by a single grievance. They’re complicated events, with deep roots, stretching back through decades and even centuries of war and peace. But every revolution has it’s leaders, the new elites of the new age, who in Chinese fashion call into question the Mandate of Heaven of their predecessors. In the case of the American Revolution, these new elites were undoubtedly some of the most progressive minds functioning on the planet Earth, and created a state that, in many ways, is more liberal and revolutionary than some current countries. For that reason, I wouldn’t hesitate to call the American Revolution as such, not because I believe King George III was a particularly tyrannical ruler, or because I believe Americans to be “freer” than other nations, but because the leadership of the revolution all had in common, the beliefs of a new age, which their revolt heralded. ",
            "date": "Answered August 16, 2017",
            "views": "16",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Kruszynski",
                    "user_href": "/profile/Daniel-Kruszynski-1"
                },
                {
                    "user_id": "Andre Rodenburg",
                    "user_href": "/profile/Andre-Rodenburg"
                },
                {
                    "user_id": "James Barkley",
                    "user_href": "/profile/James-Barkley-15"
                },
                {
                    "user_id": "Astrid Ingmarsdottir",
                    "user_href": "/profile/Astrid-Ingmarsdottir"
                },
                {
                    "user_id": "Elizabeth Rink",
                    "user_href": "/profile/Elizabeth-Rink"
                },
                {
                    "user_id": "James Curtis",
                    "user_href": "/profile/James-Curtis-15"
                },
                {
                    "user_id": "Sarah Amalie Lerstrøm Margolin",
                    "user_href": "/profile/Sarah-Amalie-Lerstrøm-Margolin"
                },
                {
                    "user_id": "Helga F. Riedel",
                    "user_href": "/profile/Helga-F-Riedel"
                },
                {
                    "user_id": "Nick Drapeau",
                    "user_href": "/profile/Nick-Drapeau"
                },
                {
                    "user_id": "Gia Dinh Hang",
                    "user_href": "/profile/Gia-Dinh-Hang"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Miller",
                "href": "/profile/George-Miller-57"
            },
            "answer_text": "Neither. I think it was a counter-revolution and that’s why it was uniquely successful. Most revolutions fail in the sense that the ideology may be replaced but cultural attitudes are slower to change. For example: France had a new Monarch in Napoleon. Later there was a Bourbon Monarch and then another Napoleon. As late as the 1880’s, there was an attempted to coup to replace the Republic with a monarchy that had the support of much of the population. Russia had a new Tsar in Stalin (and has one today in Putin). Russians have always yearned for a strong hand. China’s revolution resulted in Emperor Mao. Today President for life Xi Jianping is also essentially an emperor. The 13 colonies were largely autonomous until after the 7 years war, when Britain attempted to exert its taxing authority in order to defray the costs of the war which had benefited the colonists. However the colonists had long-established and functioning elected legislatures, no nobility, no enforced national church - America had already evolved into a self-governing democratic society. Britain was attempting to impose the culture and institutions that no longer applied to the colonists. Hence the conflict was essentially a counter-revolution, where the colonists were in a struggle to preserve the institutions and legal rights they already enjoyed against the imposition of an anachronistic older system. They already were citizens. They did not wish to become true subjects. The Americans were essentially rebelling against change, not for it. The democracy that was established was in a sense a federalization of what already existed at the colony level. ",
            "date": "Answered September 22, 2020",
            "views": "110",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Kotopka",
                    "user_href": "/profile/Ben-Kotopka"
                },
                {
                    "user_id": "Duncan Ferguson",
                    "user_href": "/profile/Duncan-Ferguson-20"
                },
                {
                    "user_id": "Joe Mills",
                    "user_href": "/profile/Joe-Mills-23"
                },
                {
                    "user_id": "Jonathan Christensen",
                    "user_href": "/profile/Jonathan-Christensen-12"
                }
            ]
        }
    ]
}