{
    "title": "Was Jesus Christ actually born in the year 1 AD? - Quora",
    "tags": [
        "Birth of Jesus",
        "Jesus in the Old and New Testament",
        "History of Christianity",
        "Jesus",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian Sawyer",
                "href": "/profile/Ian-Sawyer"
            },
            "answer_text": "Original Question: Was Jesus Christ actually born in the year 1 AD? There’s no evidence whatsoever from any non-biblical source that Jesus as described in the Bible actually existed, and ‘Christ’ is a word which comes from the Greeks, not the Jews. Whilst his biblical character was probably based on a radical Jewish preacher who was crucified for sedition and who might have started to gather a following, we don’t even know that; it’s just a guess. All the stories about supposed events in the life of Jesus are nothing more than allegorical tales, rewritten and updated versions of Old Testament stories (a literary process of the time called midrash) designed to attract the Jews of the day to the new religion of Christianity by drawing parallels with stories they already knew, but which emphasised the far more tolerant and compassionate nature of Christianity compared to the then very strict Jewish orthodoxy. Despite popular opinion, the biblical gospel stories were not written by any eye witness disciples/apostles but were written by completely unknown authors many decades after the events they purport to describe - up to 80 or 90 years later. They weren’t even given the names we know them by until the end of the 2nd century. Even allowing for the fact that the gospels are allegorical, they don’t even agree among themselves about the claimed birthdate of Jesus. Whilst it’s true that there was a Roman census around the claimed time of Jesus’s birth, carried out under during the rule of Publius Sulpicius Quirnius in 6 CE, this census did not require people to go to the town where an ancestor had lived, as described in Luke. In any event, this description is entirely contradicted in Matthew, who claims that Jesus was born during the time of the rule of Herod the Great. Given that Herod died in 4 BCE there’s at least a 10 year difference in the two accounts, both purportedly describing the same event and both purportedly written by contemporaries of Jesus - and that’s ignoring the fact that Luke says that Jesus’s family lived in Nazareth and travelled to Bethlehem, but Matthew claims they already lived in Bethlehem. As for Jesus’s supposed date of birth on the 25th of December, this is nothing more than the Christianising of Sol Invictus (“the day of the birth of the unconquered sun”), an ancient Pagan winter solstice celebration, carried out in the 4th century during the rule of the Roman Emperor Constantine following his conversion to Christianity. No matter how much ‘research’ into this is carried out, the real truth is that we don’t even know who the person on whom the biblical character of Jesus was based, let alone when this person was born or might have died. ",
            "date": "Answered March 14, 2020",
            "views": "301",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ebrahim Arendse",
                    "user_href": "/profile/Ebrahim-Arendse"
                },
                {
                    "user_id": "David Black",
                    "user_href": "/profile/David-Black-487"
                },
                {
                    "user_id": "Thomas Ward",
                    "user_href": "/profile/Thomas-Ward-240"
                },
                {
                    "user_id": "Gary Ow",
                    "user_href": "/profile/Gary-Ow-1"
                },
                {
                    "user_id": "Charley Daly",
                    "user_href": "/profile/Charley-Daly"
                },
                {
                    "user_id": "Dick Wimmers",
                    "user_href": "/profile/Dick-Wimmers"
                },
                {
                    "user_id": "Harry Zitzelberger",
                    "user_href": "/profile/Harry-Zitzelberger"
                },
                {
                    "user_id": "Sarah Bowman",
                    "user_href": "/profile/Sarah-Bowman-28"
                },
                {
                    "user_id": "Luis Olavo Dantas",
                    "user_href": "/profile/Luis-Olavo-Dantas"
                },
                {
                    "user_id": "Bonnie Lavigne",
                    "user_href": "/profile/Bonnie-Lavigne-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Gibbs",
                "href": "/profile/Robert-Gibbs-14"
            },
            "answer_text": "No, Jesus was born in 2 B.C.E. based on his age went he died. Luke 3:1-2 Pinpoints the date of 29 C.E. (AD) for the date when John the Baptist began preaching in the wilderness. About 6 months later, in the fall of 30 C.E (AD) Jesus came to John to be baptized at the age of 30. 3 1/2 years later in the spring of 33 C.E. Jesus was executed. So, Jesus was 33 ½ yrs old when he died on April 1st 33 C.E. (AD). Counting back from there his birth would have been in 2 BC.* (Luke 3:1-3, 23) *To do the math remember three things: (1) He was 33 1/2 in April, 33 C.E. (AD), so he became 33 yrs old in October, 32 C.E. (AD) (2) There was no year 0, (3) So, he was 1 year old in October 1 BCE, but his birth was one year earlier in 2 BCE ",
            "date": "Answered March 13, 2020",
            "views": "100",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Roland Rollerdore Jr.",
                    "user_href": "/profile/Roland-Rollerdore-Jr"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Joel Aldrich",
                    "user_href": "/profile/Joel-Aldrich-1"
                },
                {
                    "user_id": "James Emmans",
                    "user_href": "/profile/James-Emmans-1"
                },
                {
                    "user_id": "Percy Carte",
                    "user_href": "/profile/Percy-Carte-1"
                }
            ]
        }
    ]
}