{
    "title": "Was Nazi Germany rich? - Quora",
    "tags": [
        "Nazism",
        "Nazi Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Coxall",
                "href": "/profile/Brian-Coxall"
            },
            "answer_text": "Which period of time was nazi Germany rich? Before the start of WW2, Germany wasn’t that rich, building up yes, but in many false ways, such as the 3,500,000 German citizens forced to “slave labour” in the SS concentration camps. Yet when we into the war, the looting of everything by the nazis. The nazis took all the gold and silver, just to name two things from every country they invaded. In France hitler’s lot took all gold and silver, the jewelers had nothing to work with. The nazis had on paper, yet not all alive at the same time, some 15,000,000 slaves from 24 different nations under SS control, and Speer had a further 1,700,000 slaves under his control. From the slave labour, the nazis took everything, their homes, all that which was in their homes, then when they died, their hair and gold fillings. The “Holocaust” was what, the greatest mass murder to cover up theft, or was it the greatest theft ever covered up by mass murder? In google and WIKI there are lists of things stolen from nations which the nazis invaded, the list alone for Poland, art works of every type, rare books, some interesting pottery and plates. Is a nation really rich, if all they have, has been stolen from others? The resources in nation the nazis invaded, held coal, oil, steel, forced labour manpower and wood/lumber for construction. So was nazi Germany really rich, or was it an illusion of richest? I trust this goes towards an answer. ",
            "date": "Answered September 3, 2018",
            "views": "215",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Adam",
                "href": "/profile/Paul-Adam-13"
            },
            "answer_text": "Germany in the 1920s and 1930s was not a rich country: it had some very successful and productive industries, but a long tail of a lot of unhappy, poorly-off people trapped in manual, unmechanised agriculture or inefficient small businesses. The Ford Motor Company was shocked to discover that the minimum standard of living expected by its factory workers in Dearborn (a four-room apartment with kitchen, electricity and indoor plumbing) was considered a luxurious, elite dwelling in 1930s Germany, costing four times as much as a factory worker could afford to pay. Out in the countyside, small, inefficient farms worked by backbreaking manual labour (harvesting root crops with hand tools is utterly miserable work…) were the rule for over a third of Germany’s population. Diets were poor, food beyond staples like potatoes eyewateringly expensive: an average worker, earning a typical 70 pfennigs an hour, had to labour for half an hour to buy a loaf of bread, half a day to afford a kilogram of bacon, and for over a day to earn a kilogram of butter. Six eggs would be an hour’s work. A pair of shoes would take days to work off, a suit of clothes over a week. Some senior Nazi Germans used their influence, connections and contacts to become very rich indeed - as with most totalitarian states, at the expense of the people they were supposed to be serving. But Germany in the 1930s wasn’t a great place to live, and Nazi economic policies were all about “…and after we’ve conquered the British Empire, the USSR and the US, you’ll all be rich and happy! Until then, more potatoes?” ",
            "date": "Answered September 2, 2018",
            "views": "697",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Philip DelHagen Philip",
                    "user_href": "/profile/Philip-DelHagen-Philip"
                },
                {
                    "user_id": "Andrew Holliday",
                    "user_href": "/profile/Andrew-Holliday-1"
                },
                {
                    "user_id": "Alexander Roelofs",
                    "user_href": "/profile/Alexander-Roelofs-1"
                },
                {
                    "user_id": "Matt Alioto",
                    "user_href": "/profile/Matt-Alioto"
                },
                {
                    "user_id": "Om Herekar",
                    "user_href": "/profile/Om-Herekar"
                },
                {
                    "user_id": "James Tobin",
                    "user_href": "/profile/James-Tobin-2"
                },
                {
                    "user_id": "Justin Kardel",
                    "user_href": "/profile/Justin-Kardel"
                },
                {
                    "user_id": "Anthony de Vries",
                    "user_href": "/profile/Anthony-de-Vries"
                },
                {
                    "user_id": "Jim Davis",
                    "user_href": "/profile/Jim-Davis-210"
                },
                {
                    "user_id": "John Mill",
                    "user_href": "/profile/John-Mill-21"
                }
            ]
        }
    ]
}