{
    "title": "Was there secondhand armour for sale for the less fortunate knights during medieval times? - Quora",
    "tags": [
        "Knights",
        "Middle Ages (era)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Metcalfe",
                "href": "/profile/Bob-Metcalfe"
            },
            "answer_text": "The mediaeval period lasted for a thousand years and armour changed a great deal in that time. Chainmail for instance was far more adjustable than plate. You can just add or subtract rings, which is fiddly but not that difficult. However, a full suit of plate armour would be tailor-made when it first appeared, but in the late mediaeval period in some countries it was being made in circumstances that were close to mass production. But it wasn't the best. The best cost about as much as a Rolls-Royce and took at least a thousand hours to make just the breastplate. However there was a market for second-hand armour, certainly after battles as it was valuable and looted by anyone who could. And you could quite often pick stuff up on the battlefield if you are lucky enough to be on the winning side. And if you are lucky enough to be the same size as the guy it was made for. If the difference in size was minor you could maybe get it adjusted a little by an armourer or even a blacksmith. Of course while armour does last for a long time, it also changed quite a bit for various reasons. Usually to do with the increase in protection needed for the advancement in weapons. But sometimes simply to do with fashion. That might be another source of second-hand/second-grade armour. ",
            "date": "Answered October 23, 2020",
            "views": "102",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "William Lawrenson",
                    "user_href": "/profile/William-Lawrenson-2"
                },
                {
                    "user_id": "Alain Del-Gatto",
                    "user_href": "/profile/Alain-Del-Gatto-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "Yes. Armour is basically indestructible, and may last for centuries, and was inherited from father to son. Although the best armour was always fitted and customized to the measures of the wearer, cheaper “munition” armour made to standard measures also existed and also yesterday’s knightly armour would be today’s mercenary’s armour and tomorrow’s peasant’s armour. Looting the battlefield and the fallen was always an option as well. The result was that by late 1300s, almost everyone had at least some kind of armour to wear. ",
            "date": "Answered October 23, 2020",
            "views": "5",
            "upvotes": " View 230 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Helena Schrader",
                    "user_href": "/profile/Helena-Schrader-1"
                },
                {
                    "user_id": "Sebastian Shulea",
                    "user_href": "/profile/Sebastian-Shulea"
                },
                {
                    "user_id": "Tharein Potuhera",
                    "user_href": "/profile/Tharein-Potuhera"
                },
                {
                    "user_id": "Federico Calcagnotto",
                    "user_href": "/profile/Federico-Calcagnotto"
                },
                {
                    "user_id": "Lucas Kaiser",
                    "user_href": "/profile/Lucas-Kaiser-1"
                },
                {
                    "user_id": "Ashwin Krishna",
                    "user_href": "/profile/Ashwin-Krishna-127"
                },
                {
                    "user_id": "Freddy Jose",
                    "user_href": "/profile/Freddy-Jose"
                },
                {
                    "user_id": "Samuel Joseph",
                    "user_href": "/profile/Samuel-Joseph-14"
                },
                {
                    "user_id": "Nino Casio",
                    "user_href": "/profile/Nino-Casio"
                },
                {
                    "user_id": "Nikolai Mirchev",
                    "user_href": "/profile/Nikolai-Mirchev"
                }
            ]
        }
    ]
}