{
    "title": "Were there once any mighty and very profitable auto manufacturers that no longer exist in any way, shape or form? What went wrong for them to disappear? - Quora",
    "tags": [
        "Car Manufacturing Equipment Maintenance",
        "Automobile Production",
        "Manufacturers",
        "Profitability",
        "Manufacturing",
        "Automotive Industry",
        "Business",
        "Cars and Automobiles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mick Parker",
                "href": "/profile/Mick-Parker-19"
            },
            "answer_text": "Holden. An Australian company, started in the 1800s, bought by GM in 1931 after manufacturing bodies for imported Chevrolet chassis (and other makes too) in the teens and 20s. Many an old Chevrolet can be found with a Holden body badge, and 3/4 of locally sold Chevs were Holden bodied during the 20s. Specials like cabriolets and Landaus were normally fully imported Fisher bodies though. Holden commenced production of the uniquely Aussie 48–215 in November 1948. It looked like a baby 1948 Chev, but smaller, and with a locally manufactured “grey” inline 6 - remarkably similar to the Chevrolet 6 cylinder, but smaller in capacity. Prior to the 48–215 it assembled bodies, and complete cars for GM. It still assembled local versions of the full-size Chevrolet & Pontiac models until the late 1960s, with the ’60s Bel-Airs being somewhat unique in specification, and quite confusing for our US counterparts when visiting Australia and checking out Vintage Chevrolets. At the peak, there were Holden Vehicle Assembly Plants in 5 capital cities in Australia, and another VAP in neighbouring NZ too. Many Holdens were exported, not only to NZ, but across numerous Asian nations, and the Middle East. That number was reduced to 4 in the 70s, then 3 in the early 80s, 2 by the mid 80s, and down to just one by the end of 1989. But that one plant - Elizabeth in South Australia, was a leader in automation. Holden Engine Company at Fishermans Bend in Melbourne cast blocks, heads, and numerous other engine parts, machined, and assembled them. The uniquely Holden red motors, which evolved into blue & black, which ran from ‘63–85. The V8 - which took all the good points of the SBC, and went better again with a weight loss campaign - resulting in the nickname “plastic V8” - but Chevrolet took heed, and many items introduced on the Holden 253 & 308 V8s found their way onto the SBC. That V8 ran from 1969 until 1999, in capacities from 253 to 350ci. HEC also locally cast and produced the 3800 V6 used from 1988–2004, the “Alloytec” HFV6 from 2004–2017 (which was also exported), and the venerable Family 2 4-cylinder, produced locally in a multitude of evolutions for over 15 years, and exported in huge numbers, to many other GM plants around the world. Holden had their ups & downs. From a market dominance of over 50% in the 1950s - with only one model (available in many body styles), to an expanding model range in the 60s & 70s (adding small & mid size models alongside the full-size Holden). They nearly went bankrupt in the mid 80s, then surged back to the #1 sales spot in the 90s again. They were Australia’s # 1 manufacturer for the sheer volume of cars produced locally over the 69 years of local Holden production. Cars produced were world class - as evidenced by the number of exports, the Monaro becoming the Pontiac GTO, the VE Commodore becoming the Pontiac G8, the WM Caprice becoming the US Police PPV Caprice, and the VF swansong going out as the Chevy SS. There were many factors leading to the demise. From market shifts to SUVs, dual-cab utes, and smaller cars, to unions, government policies, winding back (and eventual removal) of tariffs, and numerous other factors. At the end of the day, they were very profitable at certain times, like when they were making over 100,000 VT Commodores a year, and were sending millions of dollars in profit back to GM USA. But when the market moved, and the output slowed to 30,000 units per year, it was only a matter of how long until the vet came with the tranquliser. It was a symbol for the entire Aussie car industry - at it’s peak, over 250,000 cars locally manufactured per year. In 2016, the last full year of production, Toyota still did almost 6 figures, but 70% were exports. Holden barely managed 30% of that, and a huge number of their last year’s sales were V8 sports models - the Aussie public finally woke up and realised they were losing an icon - a rear drive V8, that’s affordable, and offers effortless cruising across this great nation. Holden ceased producing cars locally in October 2017. They switched to becoming a full importer. Mind you, the rest of the range, bar the Commodore, had been fullly imported for 20+ years, except for the Cruze, which had a short lived local production run of several years. The Commodore was replaced by a fully imported Opel - front wheel drive (or a highly specc’d AWD). Locals didn’t take to it, despite it being a pretty good car when looked at objectively. I have a friend who traded a Mazda 6 on one, and is very happy with it, but Aussies who grew up with rear-drive and V8s are hard to convince. When GM sold Opel to PSA, it was the final nail in the coffin for Holden. The brand is being wiped out, supposedly by the end of this year. Once Australia’s largest local car manufacturer, and market dominator for many, many years, reduced to a memory, as GM squeezed the last of the government funding out of it, and tossed it out the back door to the dogs. ",
            "date": "Answered October 18, 2020",
            "views": "221",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Gillen",
                    "user_href": "/profile/Michael-Gillen-14"
                },
                {
                    "user_id": "Nikolay Kosev",
                    "user_href": "/profile/Nikolay-Kosev"
                },
                {
                    "user_id": "Geoff Gogle",
                    "user_href": "/profile/Geoff-Gogle"
                },
                {
                    "user_id": "Bruce A McIntyre",
                    "user_href": "/profile/Bruce-A-McIntyre"
                },
                {
                    "user_id": "Steve Hall",
                    "user_href": "/profile/Steve-Hall-413"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jesse Brook",
                "href": "/profile/Jesse-Brook-3"
            },
            "answer_text": "Packard was, even more than Cadillac, a luxury standard of the world. They built both honest large cars for the middle class, and enormous luxury cars for the rich. They had a simple slogan: “Ask the man who owns one,” and it was as effective as it was simple. They engineered and built vehicles so solid, they can still be found today, in numbers few brass-era and antique automobiles are found. Their cars are treasured for their quality. At one time, they had one of the largest factories in Detroit, Michigan. They employed thousands, and sold all around the world. They engineered their own automatic transmission, and built their own bodies and engines. Their caution was a byword in the automotive world, but it was that caution that would prove to be their undoing. After World War 2, many car companies made a quick buck selling their pre-war cars with little in the way of changes. Packard was one of those. By the standards of the 1940s the cars had been a bit stodgy, but by the standards of the 1950s they were downright dowdy. Packard struggled a bit, but managed to come out with a restyle that brought them in line with the market, 5 years late. The rapid model year changes of the 1950s started to leave them behind, and this wasn’t helped by the company moving it’s factory to a smaller one, and losing their body manufacturer cost them, too. They were still profitable, however, until the merger with Studebaker (who would also qualify for this question, were it not for the STP and Paxton divisions surviving to the present day). Studebaker had been building wagons since the 1860s, and adding motors to them proved profitable in the 1900s. They were known as a value brand, competing in the lower end of the market, and by the 1950s, almost exclusively the low end of the market. As the 1950s wore on, independent manufacturers were being outsold by the Big 3 (Ford, General Motors, and Chrysler), and the only option for staying relevant seemed to be merging. Studebaker was doing worse financially than they were willing to let Packard know, so the merger came as a nasty suprise to Packard. After a year or two, Packards weren’t just sharing parts with Studebakers, they were Studebakers, just with Packard badges where the Studebaker badges would go. Build quality dropped in line with the loss of prestige, and 1959 was Packard’s sad last year. A legendary company disappeared, followed by Studebaker in 1967. ",
            "date": "Answered October 21, 2020",
            "views": "53",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cordell Mathieu",
                    "user_href": "/profile/Cordell-Mathieu-1"
                },
                {
                    "user_id": "Bruce A McIntyre",
                    "user_href": "/profile/Bruce-A-McIntyre"
                },
                {
                    "user_id": "Steve Hall",
                    "user_href": "/profile/Steve-Hall-413"
                }
            ]
        }
    ]
}