{
    "title": "Were North Africa and West Africa always connected? - Quora",
    "tags": [
        "West Africa",
        "North Africa"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Lord Jr DC",
                "href": "/profile/George-Lord-Jr-DC"
            },
            "answer_text": "Geographically? Yes. Look at the map. That’s the thickest part. Where continents have collided, which is usually how land masses become connected, high mountain ranges develop. That’s what caused, and continues to cause, the Himalayas. There are no such features along the line between the Sahara and the Sahel or land south of that. Geologic time is very slow, and with the exceptions of volcanoes, earthquakes and continental glaciation, massive changes in continents tend to take millions of years. Some degree of human society existed during the ice ages, but they were only thousands or tens of thousands of years ago. Anything else like continents colliding or splitting apart would have been too long ago, or over too long a time period, for societies to have noticed any such things happening. So when some humans ventured northward from Africa, the seas may have been lower (with lots of water tied up in glacial ice), but apart from that, the continents that exist now existed then. And Africa was one land mass. ",
            "date": "Answered January 11, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Davis",
                "href": "/profile/Michael-Davis-592"
            },
            "answer_text": "The indigenous/aboriginal north Africans were Africans/Blacks from the south not the caucasoid population that is presently occupying north Africa today Northern Africa: This component of ancestry is associated with the regions north of Africa’s Sahara desert that make up the southern coast of the Mediterranean Sea. For millennia the Mediterranean Sea was one of the most traveled parts of the world, and consequently North Africa saw the constant movement and mixing of peoples and cultures. PREHISTORICALLY, THE EARLIEST PEOPLE TO SETTLE NORTHERN AFRICA CAME FROM THE SOUTH, THE MORE FERTILE BIRTHPLACE OF HUMANITY. For thousands of years this region saw the rise and fall of cultures and empires, including the Carthaginians, the Romans, and eventually the spread of Islam originating farther east. DESPITE THE CONSTANT MOVEMENT OF PEOPLES ACROSS THE MEDITERRANEAN, NORTH AFRICA MAINTAINED A a BIOLOGICAL CONNECTION TO GROUPS FARTHER SOUTH, WHICH IS EVIDENT IN THE REMNANTS OF OLD LINEAGES ASSOCIATED WITH WEST AND CENTRAL AFRICA. TODAY, THIS ANCESTRAL COMPONENT IS SEEN IN PEOPLE OF MOROCCAN, TUNISIAN, ALGERIAN, LIBYAN, AND EGYPTIAN ANCESTRY. IT CAN ALSO BE FOUND IN VARYING DEGREES IN THE MIDDLE EAST, AS WELL AS PORTUGAL, SPAIN, AND MALTA. NATIONAL GEOGRAPHIC GENOME PROJECT ",
            "date": "Answered January 11, 2020",
            "views": "104",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nana Boafo Yeboah",
                    "user_href": "/profile/Nana-Boafo-Yeboah"
                },
                {
                    "user_id": "Israel Aberra",
                    "user_href": "/profile/Israel-Aberra"
                }
            ]
        }
    ]
}