{
    "title": "Were ancient wars fought with more spears or swords? - Quora",
    "tags": [
        "Spears",
        "Swords",
        "Weapons",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Jean Jodoin",
                "href": "/profile/Jean-Jodoin"
            },
            "answer_text": "This is an easy question. Spears or pole arms of all types have war outwreigth swords as a battle weapon for two major reasons. First swords are expensive to make. You need good steel (metal?) to make and you need a good blacksmith to forge it. Then the time required is much greater than spears as the process of making swords requires a guard and handle as well as the blade, all of which has to be integrated well, not to mention take care to 'balance' the weapon just right, usually with a pommel. Otherwise you will strain the swordsman and reduce its capability to fight effectively for extended periods of time. This explains why so few people could afford swordsin the first olace and they became de facto a symbol of power and wealth. Spears are both cheaper and faster to makemaking it into the people's weapon of choice. You bepreak the handle? Save the metal tip and you can recast your spear with emergency shafts if needed. The second reason is range. Swords are relatively short range weapons. Sort of up close and personal. To be a good swordsman you need practice, lots and lots of practice. Can the average person afford this free time? Not really. Spears afford you the luxury to stand off more from the foe and take stabs at exposed parts. True enough that you also need training with spears to be really eff ctive but this training is shorter than for the sword. The combination of cost, training time, and short range makes the sword a weapon for the elite, usually acting as a secondary weapon with the true weapon of the mounted warrior being a bow, a lance, or a variety of spiked weapons, war hammer, and/or axe-type hand weapon. ",
            "date": "Answered June 4, 2018",
            "views": "924",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ordinary-Voice"
                },
                {
                    "user_id": "Michael Lyons",
                    "user_href": "/profile/Michael-Lyons-17"
                },
                {
                    "user_id": "Sushrut Madhavi",
                    "user_href": "/profile/Sushrut-Madhavi"
                },
                {
                    "user_id": "Paul Holloway",
                    "user_href": "/profile/Paul-Holloway-13"
                },
                {
                    "user_id": "Dan Chau",
                    "user_href": "/profile/Dan-Chau-5"
                },
                {
                    "user_id": "Luís Graça",
                    "user_href": "/profile/Luís-Graça"
                },
                {
                    "user_id": "Roger Duwe",
                    "user_href": "/profile/Roger-Duwe"
                },
                {
                    "user_id": "Mordechai Laufer",
                    "user_href": "/profile/Mordechai-Laufer"
                },
                {
                    "user_id": "Tate Jager",
                    "user_href": "/profile/Tate-Jager"
                },
                {
                    "user_id": "Sina Taghva",
                    "user_href": "/profile/Sina-Taghva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ali Zufer",
                "href": "/profile/Ali-Zufer"
            },
            "answer_text": "Spears, always spears Even asides from the fact that swords were rarer thanks to the intricacy and skill required to make them, spears were the superior weapon in a battlefield context. When in a formation, all you really can do effectively is stab, and spears are a lot better at stabbing than swords are, thanks to the leverage they get. Swords were used as side arms, since you easily could carry them in a sheath to draw if you ever managed to lose your primary weapon - a bit like a pistol of modern times.Continuing that allegory, they were also very popular for self-defense outside of battlefield contexts. They’re an all-rounder weapon really, but not the best thing for dealing with armor. Cutting most armor is useless, so swords were mainly used for hitting where the armor did not cover. That would be the face, the arms and legs (if we’re not talking fully armored knights. Even so, they generally preferred to leave their face open for better vision and breathability, which they deemed was far more important than protecting it. It is after all, the area of the body that is easiest to defend yourself). Well to deal with the heaviest armor, even spears aren’t enough. So a variety of different polearms arose, such as poleaxes, halberds, bec-de-corbins et cetera. One thing they all have in common however, is that they’re basically spears with added parts. ",
            "date": "Answered May 29, 2018",
            "views": "372",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sean Karp",
                    "user_href": "/profile/Sean-Karp"
                },
                {
                    "user_id": "Michael Lyons",
                    "user_href": "/profile/Michael-Lyons-17"
                },
                {
                    "user_id": "Richard Cline",
                    "user_href": "/profile/Richard-Cline-6"
                },
                {
                    "user_id": "David M. Prus",
                    "user_href": "/profile/David-M-Prus"
                },
                {
                    "user_id": "Yixin Li",
                    "user_href": "/profile/Yixin-Li-2"
                },
                {
                    "user_id": "Jonathan Shaltz",
                    "user_href": "/profile/Jonathan-Shaltz-1"
                },
                {
                    "user_id": "Hans Widjaja",
                    "user_href": "/profile/Hans-Widjaja"
                }
            ]
        }
    ]
}