{
    "title": "Were there black people in Ancient Greece? - Quora",
    "tags": [
        "Greek Ethnicity and People",
        "Ancient Greece",
        "Greece"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Einstein",
                "href": "/profile/Kevin-Einstein-2"
            },
            "answer_text": "The first Europeans were Black! But please don’t think all African are dark brown skin! Even Princess Diana was about to marry a Black man! And the reason why THEY killed them both! This is what you would called North African now, and they are mixed people!  And they was a matriarch! Their patron was a Goddess called Hera! Hercules is a direct descendant of Hera, and his name means Glory to Hera! When White European started to populate Europe they change much of Europe’s history over night! Most Greek statues you see now were created during the 15th century, and made to look like Blonde hair blue eyes Caucasians! Even with the mixture of white Europeans most Greeks look like this:  “I’m 100 percent Greek, but I look like I could be Indian or Middle Eastern or Hispanic.” Jason Mantzoukas Also Greeks like him can get Sickle Cell! Now lets see who can be affected by Sickle Cell: Sickle cell disease is more common in certain ethnic groups, including: People of AFRICAN descent, including African-Americans (among whom 1 in 12 carries a sickle cell gene) Hispanic-Americans from Central and South America. People of Middle Eastern, Asian, Indian, and ******Mediterranean***** descent. As you can see all Mediterraneans were Africans! Even Muammar Gaddafi considered himself as a Black African: Muammar Gaddafi  So please don’t think all Africans are Dark Brown Skin! Africa has always been Light Brown to Dark Brown, with the mixture of Europeans they came much lighter! There are many Europeans, Asians, Indians & Middle Eastern who can identify as being Black! ",
            "date": "Answered November 6, 2019",
            "views": "55",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marcus DeShown",
                    "user_href": "/profile/Marcus-DeShown"
                },
                {
                    "user_id": "Inger",
                    "user_href": "/profile/Inger-7"
                },
                {
                    "user_id": "Cornelius Johnson",
                    "user_href": "/profile/Cornelius-Johnson-15"
                },
                {
                    "user_id": "Princelawrenz Hamlin",
                    "user_href": "/profile/Princelawrenz-Hamlin-1"
                },
                {
                    "user_id": "Malik Jones",
                    "user_href": "/profile/Malik-Jones-166"
                },
                {
                    "user_id": "Brianna Brickey",
                    "user_href": "/profile/Brianna-Brickey"
                },
                {
                    "user_id": "Dajohnnie Sanders",
                    "user_href": "/profile/Dajohnnie-Sanders"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Drad-D-Vinotn"
                },
                {
                    "user_id": "Renee HenryRoss",
                    "user_href": "/profile/Renee-HenryRoss"
                },
                {
                    "user_id": "Aanchal Kanodia",
                    "user_href": "/profile/Aanchal-Kanodia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Niko Vasileas",
                "href": "/profile/Niko-Vasileas"
            },
            "answer_text": "Probably a few but a tiny amount. We know Greeks were aware of people that we would call “black\" today: they had the word Αιθιοπείς “Ethiopians” and in Hesiod’s Works And Days he describes winter as “when the Sun (Ήλιος) is of making his rounds over the Black-folks lands (Αιθιοπία?) and hardly shines on us Greeks (Έλληνες) at all.” Also the Myth of Phaethon running amok is said to have caused the “Nile to hide in the desert and the people to the south to have been “burned.” The Greeks certainly traded far and wide (some have speculated that the infamous plague of Athens” was a hemerrhogenic fever akin to Ebola, we know at that time Greeks had imported a lot of Ivory from Africa and there are reports of a similar plague having traveled up the Nile via trade) but they mostly encountered and worked with other “Mediterranian” people. ",
            "date": "Answered April 11, 2018",
            "views": "96",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Hutto",
                    "user_href": "/profile/George-Hutto-3"
                },
                {
                    "user_id": "Sandra L",
                    "user_href": "/profile/Sandra-L-19"
                },
                {
                    "user_id": "S. Patrick Maiorca",
                    "user_href": "/profile/S-Patrick-Maiorca"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Alexandru Costache",
                    "user_href": "/profile/Alexandru-Costache"
                },
                {
                    "user_id": "John Doe",
                    "user_href": "/profile/John-Doe-13143"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SaltyShanker"
                },
                {
                    "user_id": "Kyrani Eade",
                    "user_href": "/profile/Kyrani-Eade"
                },
                {
                    "user_id": "Christos Zafiropulos",
                    "user_href": "/profile/Christos-Zafiropulos"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                }
            ]
        }
    ]
}