{
    "title": "Were the Scythians genetically an Iranic people? - Quora",
    "tags": [
        "Scythians",
        "Parthian Empire",
        "Persia and Persians",
        "Iranian Ethnicities and People",
        "Iran",
        "Genetics and Heredity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Xuanzi Zerene (Еремей Сенько)",
                "href": "/profile/Xuanzi-Zerene-Еремей-Сенько"
            },
            "answer_text": "Question does not make sense. Iranic is a linguistic, not a genetic term. Genetically, every people on earth are significantly mixed. There are no discrete “races” the genetic web of the earth is interlaced like spiderweb, and every ethnic group has a diverse past. Scythians, also refer to two groups of people. Scythians proper, and Greater Scythians. In truth, these were catch-all terms. Iranic speakers were the principle, or foremost known, language group of the Scythians, but not every people within the Scythian Realm would have been Iranic speaking, even if their lifeways and culture were inseparable. The modern descendants of the Scythians, the Slavs and Turks/Tatars are both ethnolinguistic groups (who respectively assimilated Iranic speakers.) (An ethnic group most tightly associated to language. Ethnic groups are in-group determined based on various factors.) Themselves with very diverse pasts. Inclusion into these groups is not genetic, but cultural, linguistic and societal. (there are some recurring genetic similarities, but they are not decisive nor absolutive.) ",
            "date": "Updated October 27, 2020",
            "views": "123",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alper Karaca",
                    "user_href": "/profile/Alper-Karaca-4"
                },
                {
                    "user_id": "Gerhard Heinrichs",
                    "user_href": "/profile/Gerhard-Heinrichs"
                },
                {
                    "user_id": "Steven Lisason",
                    "user_href": "/profile/Steven-Lisason"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Clings",
                "href": "/profile/Peter-Clings"
            },
            "answer_text": "Well, that depends. The ancient Scyrhians who bore that name were of proto Iranian origin. Going back in time towards the time of the great Babylonian civilization some of the nomadic people of the same Proto Iranian group joined together to found an opposing force, which eventually conquered the great city of Babylon in 536BC under the great king Cyrus the great. Those who followed him had learned into the Assirian and Babylonian ways to dominate over a more sedentary and agricultural oriented people becoming like them. Those who remained true to their nomadic lifestyle continued to roam the Eurasian landscapes for centuries. Those Scythians were indeed related at least linguistically to the Iranian people. I believe that the last of the early Scythians were the Alans Later people who got called by that name (Huns, Turkic people etc) where actually not related to the Iranians ",
            "date": "Answered October 24, 2020",
            "views": "98",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eddy Blacksmith",
                    "user_href": "/profile/Eddy-Blacksmith"
                },
                {
                    "user_id": "Mustafa Sarafoğlu",
                    "user_href": "/profile/Mustafa-Sarafoğlu"
                },
                {
                    "user_id": "Georgene Wickstrand",
                    "user_href": "/profile/Georgene-Wickstrand-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Branson",
                "href": "/profile/Frank-Branson-2"
            },
            "answer_text": "The Scythians were hordes. This means they almost always contained all kinds of tribes and people speaking various languages. But originally they were speakers of East Iranian languages. ",
            "date": "Answered October 24, 2020",
            "views": "87",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eddy Blacksmith",
                    "user_href": "/profile/Eddy-Blacksmith"
                },
                {
                    "user_id": "Mustafa Sarafoğlu",
                    "user_href": "/profile/Mustafa-Sarafoğlu"
                }
            ]
        }
    ]
}