{
    "title": "Were the original Irish black? - Quora",
    "tags": [
        "Irish History",
        "Irish (language)",
        "Black (color)",
        "Irish Ethnicity and People",
        "The Republic of Ireland",
        "Ireland (island)",
        "Black People",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Kavanagh",
                "href": "/profile/Michael-Kavanagh-53"
            },
            "answer_text": "They were - and a fierce deep shade of black it was. However they also had red hair and liked to grow long beards, even the women had long beards, as well a curly red mop on top and a lot more body hair than would be thought decent nowadays, even outside of Pornhub circles. There were wolves in Ireland then, who developed a great taste for the early Irish, the new humans being much easier to catch than the canny auld deer and very satisfying, nice and juicy by all wolves account, provided you got enough of them in. Catching them was not a problem as the contrast of black skin and red hair made them very visible so there was no keeping the wolf from the door - even auld and doddery wolves ate well. Evolution marches on - a few Irish started to lose the black pigments in favour of none - all due to the lack of sunshine with 364 annual days of rain of course. Various invasions of various furriners with fair, brown and black hair diluted the original red manes and brought fancy furrin practices like shaving to these shores - further reducing the amount of hairy Irish of every colour. This all had the happy side effect of reducing the skin/hair contrast and the wolves could never catch as much dinner as they did before. The wolf population went into decline, relying on the one sunny day a year when the now pale skinned Irish would go outside and start glowing bright red after an hour of sun. The few red-headed Irish left held their own with nobody bothering them except John Hinde to put their pictures on postcards - some redheads said they preferred being predated by the wolves rather than the photographers. The black skin has sadly mostly disappeared - but for the nostalgic a day in the bog at the turf would often return the hue temporarily and many Irish spend happy times there every summer returning to their original state to this very day. ",
            "date": "Answered October 21, 2020",
            "views": "113",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eamon O'Kelly",
                    "user_href": "/profile/Eamon-OKelly"
                },
                {
                    "user_id": "Cherie Saul",
                    "user_href": "/profile/Cherie-Saul-2"
                },
                {
                    "user_id": "Patrice Gillen",
                    "user_href": "/profile/Patrice-Gillen-1"
                },
                {
                    "user_id": "Stephen Gilmore",
                    "user_href": "/profile/Stephen-Gilmore-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yivette Gleeson",
                "href": "/profile/Yivette-Gleeson"
            },
            "answer_text": "All human beings were originally black. It was the African mother’s defect (Albino) + migration + Neanderthals (nonhuman) that changed the dynamics. Two Blacks can make a blonde hair blue eyed baby but two Whites cannot make a Black baby. When African tribes (and I stress tribes as they all had different features—not all of them had wide noses, hips, full lips, the stereotypical rhetoric that people spew) started migrating out of Africa the Albinos were apart of that migration. The Neanderthals (also having different tribes or were of different species) already populated Europe and Asia and they were dying off. At some point, the humans and nonhumans met and interbred. Do you want to know why cancer scientists use rats in their labs for testing of diseases and vaccines? It is because their DNA is the closest to Neanderthals. Do you want to know which human has the Neanderthal gene? Whites. Fast forward, there was a man (whose name I do not recall at this time) decided that whites were prettier and blacks were ugly. And I am talking early horse and buggy days. Fast forward, there was a point in time when archeologists discovered tons of artifacts that linked all proof that Blacks were the original humans and that all humans were Black. Well, those artifacts were and have been destroyed by governments. I mean God forbid if everyone knew the truth. People should be more concerned with having a soul as Neanderthals, according to the Bible are not human. ",
            "date": "Answered October 21, 2020",
            "views": "180",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patrice Gillen",
                    "user_href": "/profile/Patrice-Gillen-1"
                },
                {
                    "user_id": "Gaul McMorna",
                    "user_href": "/profile/Gaul-McMorna"
                }
            ]
        }
    ]
}