{
    "title": "Were the Mayans more succesful as a civilization than the Aztecs or the Incas? - Quora",
    "tags": [
        "The Incas",
        "Maya Civilization",
        "The Aztecs",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Iván Martínez",
                "href": "/profile/Iván-Martínez"
            },
            "answer_text": "Give me more info about what you mean “success” and I will answer with more accuracy. Let’s give some context to find an answer. When we say mayans, aztecs or incas we frequently associate our homogeneous and contemporary definition of nationality to other societies of the past that does not fit to that concept. When we talk about mayans we refer a group of civilizations that lived in a broad range of territories from Mexico to Honduras from II century until today. They shared some cultural and civilization basis as beliefs, architecture, appearance, language but have the same as others in Mesoamerican area, they doesn’t have a national or regional group consciousness such as ours. In fact, the relations between the most famous Mayan cities like Palenque, Cobá, Tikal or Yaxchilán were rather very conflictive.Aztecs was the last big civilization that ruled a great portion of actual Mexico but they were heirs of many other civilizations that preceded them and from which they took the substantial part of their civilization. They were successful in building one of the bigger cities of the Ancient World, in reformulating everything that had preceded them and forming it into a new power that faced an unprecedented invasion. At the time of the Spanish conquest, Mexico-Tenochtitlan was larger than any European city, with unique urban development, agriculture, time measurement and territorial control that allowed comfortable living to a city of 250 thousand inhabitants in the middle of a lake.Mayan groups are totally live. We can’t say the same about aztecs because Mexica society suffered a different process than Maya civilizations. In terms of survival, the Mayan civilization survived to this day, Aztec not precisely.",
            "date": "Answered January 21, 2017",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alfredo Yong",
                    "user_href": "/profile/Alfredo-Yong"
                },
                {
                    "user_id": "Sam De Mayen",
                    "user_href": "/profile/Sam-De-Mayen"
                },
                {
                    "user_id": "Akari Towada",
                    "user_href": "/profile/Akari-Towada"
                },
                {
                    "user_id": "Luca Bertini",
                    "user_href": "/profile/Luca-Bertini"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Peterman",
                "href": "/profile/Nicholas-Peterman-1"
            },
            "answer_text": "Seeing as no one ever from the Old World made contact with them as they had died out or disappeared by other means long before and the Aztecs and Inca were around up till they were more or less exterminated by settlers from the across the Atlantic, it is reasonable to come to the conclusion that the Aztecs and the Inca were the more successful civilizations. Unless the tinfoil hatters who think they were aliens or something turn out to be right. I kind of doubt that though. ",
            "date": "Answered January 15, 2017",
            "views": "890",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melvin Bengtsen",
                    "user_href": "/profile/Melvin-Bengtsen"
                }
            ]
        }
    ]
}