{
    "title": "Were there actually two gay lions on Noah's Ark? - Quora",
    "tags": [
        "Noah's Ark",
        "Lions",
        "Mythology",
        "Homosexuality",
        "The Bible",
        "Christianity",
        "Animals"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frederick Jones",
                "href": "/profile/Frederick-Jones-16"
            },
            "answer_text": "I think it's unlikely that an experienced, circa 535 year old guy building an ark (THE Ark) with a few of his most righteous buddies in order to save life on earth would have “queered” the deal, so to speak, by failing to notice he had a couple of ringers in the two lions (the infamous ‘Serengeti Switcheroo’). And yet, if you're talking a certain pair of Muppets, a very suspect Teletubby desperately searching social websites for a hook-up, or a certain pear shaped purple dinosaur whose forebears must have made it onto the Ark… …well, these corruptors of our youth and of our precious bodily fluids are sneaky sorts, and it may have taken a frothing, net savvy modern Evangelical preacher with the credentials of a duly tariffed made-in-China American flag in one lapel button of his brown polyester suit, and an “I'm with the Donald\" photo tribute button in the other… under divine guidance of a pleased Creator, no doubt… to suss out the Truth before it was too late to deport ‘em! So on the other hand, old Noah, never having seen San Francisco on an Evangelical website, just may not have been up to the job of being nautical engineer, lumberjack, expert builder, explorer of continents / big game “hunter”, AND discerning doorman / bouncer, all at the same time! For some mere 396 year old, maybe… In fact, I'll bet a LOT of those dinosaurs were gay. It's not like you see many of THEM around any more, if you catch my drift! ",
            "date": "Answered August 16, 2019",
            "views": "475",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Mosher",
                    "user_href": "/profile/Ryan-Mosher-9"
                },
                {
                    "user_id": "Perry Lee",
                    "user_href": "/profile/Perry-Lee-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Coury Koutz",
                "href": "/profile/Coury-Koutz-1"
            },
            "answer_text": "No, their manes would have gotten in the way. Jokes aside, the answer is no. If there were, you would not have seen any lions at all. There were two representatives of the cat family on the ark. Whether they were lions or not is something only God knows. If two animals are of the same gender, they can't reproduce. There might not have been lions on the ark. All we know is that there were two cats. These cats clearly were chosen to repopulate the cats, so they would have been different genders. If one of them wanted to reproduce with their own gender, that is biologically impossible, as not only are both genders required, a cat that wants only its own gender doesn't breed with a cat. Since animals can only breed with their own taxonomical family, a cat can only reproduce with a cat. Also, I noticed that one of your tags is Mythology. The ark is true because things like fossils, which require being near or in a body of water to form, have been found in places all over the Earth where there is no water, such as deserts and places of high elevation. Some of these fossils in deserts and at high elevations and some on mountains are fully aquatic, and since there is no water there, there must have been a global flood. A lot of deserts are several hundred feet above sea level. Deserts don't have rivers or lakes or any of that, so there must have been a point in time where the entire Earth was covered in water. This also makes sense from a population growth rate perspective and offers a new more plausible understanding of the Ice Age. Therefore, there was a global flood. Since there was a flood, there would have to be an ark for any non-aquatic life to survive. Please edit your tags. Also, anyone who denies the flood is technically not answering the question. ",
            "date": "Answered July 22, 2019",
            "views": "479",
            "upvotes": "0"
        }
    ]
}