{
    "title": "Were Nazi invaders welcomed in the Baltic states? - Quora",
    "tags": [
        "Invaders",
        "Baltic States"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maris Elerts",
                "href": "/profile/Maris-Elerts"
            },
            "answer_text": "yes, nazi invaders were welcomed in 1941 in the Baltic countries by many people. Historic background: Germans were landlords in Latvia and Estonia between 1300 - 1900. During 1920-ies and 1930-ies Germans were about 15% of the population in Latvia. During 1920-ies and 1930-ies there was a very negative attitude among the population (including the official media) against Germans as 600 years oppressors in Latvia. In 1939 after Ribentrop - Molotov (German - Soviet) pact Hitler called all Germans from the Baltic countries back to Germany. When entering the ships, Latvians waved to them - farewell, do not come back. This attitude was spoiled by soviets themselves, by their activities in Latvia only during one year between June 1940 - June 1941. More than thousand people executed by KGB during one year. More than 15.000 people deported to Siberia in June 14, 1941. When soviet KGB left Riga in June 1941, they have tortured, executed and buried in the prison yard more than 90 people without any court trial. All this just within 1 year changed the attitude in Latvia towards soviets - many people, whose families were deported, hided in the forests and took arms in their hands; and the attitude towards Germans changed - German troops in 1941 were welcome with flowers as liberators from the bloody communist regime. ",
            "date": "Answered October 17, 2020",
            "views": "64",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hannu Mononen",
                    "user_href": "/profile/Hannu-Mononen"
                },
                {
                    "user_id": "László Pál",
                    "user_href": "/profile/László-Pál-1"
                },
                {
                    "user_id": "Jānis Brokāns",
                    "user_href": "/profile/Jānis-Brokāns-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonas Oškinis",
                "href": "/profile/Jonas-Oškinis"
            },
            "answer_text": "Yes, it must be recognized that a significant part of residents at least in Lithuania welcomed German army in June 1941. The country was in shock after fresh Soviet deportation, so there was uprising that cleared the way for approaching army. Also, first pogroms started (in a country that had almost no pogroms in history), so summer of 1941 is a shameful page in Lithuanian history. ",
            "date": "Answered October 17, 2020",
            "views": "126",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "N Maccallan",
                    "user_href": "/profile/N-Maccallan"
                },
                {
                    "user_id": "James Stephan",
                    "user_href": "/profile/James-Stephan-16"
                }
            ]
        }
    ]
}