{
    "title": "Were the Romans the real barbarians? - Quora",
    "tags": [
        "Barbarians",
        "Roman Empire",
        "Ancient Rome",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chase Owins",
                "href": "/profile/Chase-Owins"
            },
            "answer_text": "If they were around today going by their own standards, then yes they would be barbaric! However, for their time they were very sophisticated. They styled their hair, they had running water by aquaducts…. (Big deal) as well as a very mobile army. The later empire spread their army out at permanent bases across the empire to spead up mobilization. Speaking of war…. Yeah the romans were complets savages. Many things about their ancient war style is unknown. Like how they switched their front lines during battles. Though one thing is known about them. Before the romans most casualties of war had died from puncture wounds… arrows, spears, javalins. Then the romans came along… imagine you are walking up to the front lines ready for battle, then you see more and more blood on the warm sand. Then you approach the line to see the Roman enemy has formed a sheild wall and will occasionally lift their sheild and with a might swing would hit your friends foot and step over him only to disappear behind the sheild wall surely hacked to death while he lay helpless on the ground. then all you have left is your friends severed limb…. The real fear behind the romans was their ability to win wars. Especially wars of attrition I might add. Along with Their ability to keep moral up. ",
            "date": "Answered July 21, 2020",
            "views": "190",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emil Perhinschi",
                "href": "/profile/Emil-Perhinschi"
            },
            "answer_text": "Q: “Were the Romans the real barbarians?” Brennus disagrees :-) … you know, the Gaul that sacked Rome once and told them “being defeated is unpleasant” or somesuch. It was a dog-eat-dog world then, and still is now: losing wars (cold or hot or whatever) is not recommended. ",
            "date": "Answered July 28, 2020",
            "views": "235",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrei Stoica",
                    "user_href": "/profile/Andrei-Stoica-65"
                },
                {
                    "user_id": "Felix-Lucian Bejan",
                    "user_href": "/profile/Felix-Lucian-Bejan"
                },
                {
                    "user_id": "Ionut Sabau",
                    "user_href": "/profile/Ionut-Sabau-1"
                }
            ]
        }
    ]
}