{
    "title": "Were battleships obsolete in WWII? - Quora",
    "tags": [
        "Obsolete",
        "Battleships",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Givens",
                "href": "/profile/Andrew-Givens-1"
            },
            "answer_text": "No. There, I’ve said it. Most will disagree, but I’m saying it anyway and with a reason behind it. Where did battleships operate during World War 2? Answer: in all the major oceans and seas. Were they stricken down by aircraft at every turn in all of those theatres? No they were not. Were there many instances during the war when the only realistic counter to a battleship was another battleship? Yes there were. Therefore they were not obsolete. Were they superseded by the aircraft carrier as the preferred means of mounting above-water attacks against the enemy surface fleet? Yes they were, but only in the Pacific theatre. And that only because the US Pacific battleship force had been pre-emptively reduced in size and fighting power by the Pearl Harbor strike. Did they make any useful contribution to the fighting in the Pacific? Yes they did. So they were, at worst, obsolescent in the Pacific. We get a bit free & easy, not to say lazy, with the use of the word ‘obsolete’ sometimes. It describes something which has no longer has any use, or something which is incompatible with the current state of things. If battleships had truly been obsolete in World War 2, they would have been identified as such and brought back to base to swing at their moorings for the rest of the war; a third-line reserve to be used in dire emergencies only when all the carriers had been sunk. But they were not. They were still powerful units in their own right and, used correctly, added a lot of punch to a combined task force of the kind which the USN deployed from late 1942 to 1945. So, were they a waste of resources? Most of them were already in service or well advanced in their construction by the time the war had really ramped up. Scrapping nearly-complete vessels would have been idiocy - a colossal waste of that most precious of all resources - time. Would their materials have been better off poured into more carriers and submarines? Well, what might have happened to a US Navy comprised entirely of aircraft carriers? How many aircraft carriers were lost or disabled by kamikaze strikes? How many battleships to the same cause? Or, slightly less contentious a question, how many heavy hits could a carrier take and still remain operational? How many hits could a battleship take without having to cease all combat operations? In general, the battleships proved to be tougher than their flight-deck equipped capital counterparts. That’s not to gainsay the importance of the aircraft carrier, but the battleships added firepower and resilience to the task forces which they were assigned to. A fleet composed entirely of carriers and cruisers would have been a heavyweight with a glass jaw. Midway was a damned close-run thing; it could easily have gone the other way. Just a handful of Japanese bombs dropped onto the wrong ships, and… But, say the detractors, that’s irrelevant; a ‘what-if’. And anyway, battleships were constantly sunk by air attack. Not quite. Battleships without adequate - or any - air cover were sunk by massed air attacks. Aircraft carriers were also sunk by air attacks, particularly when they were operating with nothing more than some destroyers or a cruiser or two for escort. It happened. Now, wind the clock back to 1939. Roll it on through to the end of 1941. Over two years of intensive naval fighting and not one battleship actually sunk by air power at sea, even when unescorted. In a surface action group, with cruisers and destroyers around? Forget it. Air power in the first two years of the war didn’t frighten battleship captains. Submarines were more of a problem. Having battleships made sense, not just in theory, but in practice. Materially. Battleships were still king until Japan unveiled some very impressive tactics and picked some really vulnerable targets. Frankly, had Force Z had an aircraft carrier, four cruisers and an eight-ship destroyer flotilla with it, those Nells & Bettys would have been driven off with heavy losses and the RN would still have had a powerful squadron in the Far East. British parsimony helped to drive the final nail into the coffin of the battleship’s reputation; a coffin built with the planks of Pearl Harbor. But strategic incompetence doesn’t mean that a weapon no longer has a sharp edge. Frankly, the whole issue of the total redundancy of the battleship is a misconception; a revisionist fiction used to mythologise the gradual scrapping of them during the Fifties and - much more sinister - to whitewash the mishandling of them by both sides, neither of whom should have made the stupid schoolboy errors which they did. Errors which cost a lot of human lives and simply could not be attributed to the incompetence of those in charge. No, it had to be the enemy’s fault, and that meant the supremacy of aircraft in almost all cases. Yet, if that were really true, then why wasn’t it a universal truth? Why didn’t battleships prove to be a waste of effort everywhere? In the Atlantic, the battleship had a profoundly important role to play. Necessary - nay, crucial - in checking several of the most dangerous enemy sorties of the war in that theatre. Aircraft really struggled to do as much damage during those emergencies (Bismarck chase, Channel Dash) as the battleships were able to inflict (Bismarck chase, North Cape). In the Mediterranean, the battleships did the real damage in several key actions; the carriers were useful assets but they were playing a supporting role, because unless there were two hundred aeroplanes available, they couldn’t do very much harm to an enemy fleet under way at sea. No, battleships were not obsolete in World War Two. They got targeted for termination on a number of occasions and got a bad reputation, but remained a potent class of warship to the end. They were worth having at the start, and they were still useful to have around up to the end. By 1945, they were verging on tactical obsolescence as they didn’t have enough targets left and, in the Pacific, a new naval strategy was being perfected. By the time the Cold War really got going, that was when the battleships really stopped being any real use. That was when they became obsolete for real. If you want to talk about a class of warship which was really a massive waste of time, money and steel, take a look at the heavy cruiser. Pointless. Everyone ought to have just built light cruisers instead. 8-inch guns and skimpy armour on 10,000-tons-plus was just pointless. Battleships weren’t. ",
            "date": "Updated October 10, 2018",
            "views": "58",
            "upvotes": " View 122 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Reagan James",
                    "user_href": "/profile/Reagan-James-14"
                },
                {
                    "user_id": "Diego Caramello",
                    "user_href": "/profile/Diego-Caramello-1"
                },
                {
                    "user_id": "Karl Ellison",
                    "user_href": "/profile/Karl-Ellison-3"
                },
                {
                    "user_id": "Benjamin Koch",
                    "user_href": "/profile/Benjamin-Koch-4"
                },
                {
                    "user_id": "Peter Broadmore",
                    "user_href": "/profile/Peter-Broadmore"
                },
                {
                    "user_id": "Nicolás Tampe",
                    "user_href": "/profile/Nicolás-Tampe"
                },
                {
                    "user_id": "Nic McCauley",
                    "user_href": "/profile/Nic-McCauley"
                },
                {
                    "user_id": "Mark Keller",
                    "user_href": "/profile/Mark-Keller-92"
                },
                {
                    "user_id": "Viet Pham",
                    "user_href": "/profile/Viet-Pham-78"
                },
                {
                    "user_id": "Pasha Aulia Muhammad",
                    "user_href": "/profile/Pasha-Aulia-Muhammad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "No. The battleships were perfectly viable throughout the war, the Atlantic was completely a battleship domain, and radar guided fire control made them even more lethal weapons than ever. American aircraft carriers actually sought protection from aerial attacks, especially during the Kamikaze, at the coverage of the battleship AA gunnery. The battleships outlived their two worst menaces: torpedo bombers and dive bombers. Both torpedo and dive bombers became obsolete with the invention of jet engine. TBF Avenger was the last torpedo bomber ever, as was SB2C Helldiver the last dive bomber. Kyle Willibanks did already excellent analysis, and I would like to add here that HMS Repulse and HMS Prince of Wales had that day no effective anti-aircraft gunnery whatsoever. Their AA gunnery fire control system (HACS) had gone out of order in the humidity of the tropics, they had only one functional radar between the two, and to add an insult to injury, the 40 mm QF pom-pom ammunition was defective. They could just as well have thrown rocks at the Japanese bombers. The true downside of the battleships was they were manpower intensive. The weapon systems needed a lot of men to operate, and was viable only as long as there was conscription. But the advent of professional militaries meant also that manpower intensive systems no more were cost effective. But there are two things which are seldom spoken about. The first is that USSR feared more the Iowas than the USN aircraft carriers during the Cold War. They knew perfectly well how well the Iowas could take punishment and yet be able to deal damage with gunnery and Tomahawks. The second is that RN sorely missed the KGV class and HMS Vanguard at Falklands. They analyzed that merely one battleship would have meant complete dominance of the sea, and cost-effective coastal bombardment. The Avro Vulcan raids, as impressive as they were, were complete waste of money, fuel and bombs. Anything which floats can be sunk. The question is only “with difficulty or whith ease?” You might say aircraft carriers became obsolete 17 September 1939, when U-29 torpedoed HMS Courageous, finally proving the superiority of submarines over any other kinds of vessels. Especially anything which is moored on the harbour can be sunk with the slightest ease - you might say the final nail on aircraft carriers’ coffin came on 29 July 1945 when the American aircraft sank IJN carrier Amagi at harbour. There are only two kinds of vessels: submarines and targets. The true waste of money were the heavy cruisers. They were slow and unmanoeuvreable monsters, which could put less steel in the air per time unit than light cruisers, cost horribly, burned fuel like crematoria and were just about as manpower intensive as battleships. ",
            "date": "Answered May 3, 2019",
            "views": "135",
            "upvotes": " View 322 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Ka",
                    "user_href": "/profile/John-Ka-7"
                },
                {
                    "user_id": "Soham Joshua Datta",
                    "user_href": "/profile/Soham-Joshua-Datta"
                },
                {
                    "user_id": "Alex Schmalzried",
                    "user_href": "/profile/Alex-Schmalzried"
                },
                {
                    "user_id": "Len Li",
                    "user_href": "/profile/Len-Li-2"
                },
                {
                    "user_id": "Andrew Givens",
                    "user_href": "/profile/Andrew-Givens-1"
                },
                {
                    "user_id": "Hans Widjaja",
                    "user_href": "/profile/Hans-Widjaja"
                },
                {
                    "user_id": "Mitch Johnson",
                    "user_href": "/profile/Mitch-Johnson-9"
                },
                {
                    "user_id": "Thomas Kissell",
                    "user_href": "/profile/Thomas-Kissell-1"
                },
                {
                    "user_id": "Huy Nguyen",
                    "user_href": "/profile/Huy-Nguyen-557"
                },
                {
                    "user_id": "Vincent A. Bruno",
                    "user_href": "/profile/Vincent-A-Bruno"
                }
            ]
        }
    ]
}