{
    "title": "Were the first nuclear weapons used (ever) during the Manhattan project? - Quora",
    "tags": [
        "The Manhattan Project",
        "Nuclear Proliferation",
        "Nuclear Energy",
        "Nuclear Weapons",
        "Weapons",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Mahoney",
                "href": "/profile/Tim-Mahoney-40"
            },
            "answer_text": "Puh-leez!!! Doesn't ANYONE read a history book anymore? YES! Several nations, including Nazi Germany and Japan made some embryonic efforts to create nuclear weapons during WWII. Fear of such weaponry as espoused by several top physicists like Albert Einstein convinced FDR to create and support the Manhattan Project even before America formally entered the conflict to research the credibility of such unproven technology and to produce them, if possible. Fact! Of the nations interested in such weapons, only America had the economic and industrial resources to prioritize and pursue to a successful conclusion the task at hand and it took the ultra Top Secret Manhattan Project several years and $2B in WWII funding to eventually achieve success. Much of the degree of difficulty involved creating complex and expensive industrial methods to refine things like crude uranium ore into purer fissionable material, something that remains difficult to this day. The first actual atomic detonation was of a plutonium device (a substance that was man made for this purpose, invented as part of the Manhattan Project research) in New Mexico on 16 July 1945. Again, very well documented fact! On that day, both Italy and Germany had been crushed and Japan, the only enemy remaining, was, literally and stubbornly, hanging on by its fingernails and refusing to surrender. It has been argued by revisionist historians that there was no real need to use those atomic weapons on Japan. Since that subject is actively being discussed in other areas of Quora, I'll avoid comment here. The bottom line, clearly documented in the public record, confirms that the very first viable nuclear weapons were the direct result of the Manhattan Project! ",
            "date": "Answered June 30, 2019",
            "views": "222",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carol Adams",
                    "user_href": "/profile/Carol-Adams-141"
                },
                {
                    "user_id": "Stephen Fretz",
                    "user_href": "/profile/Stephen-Fretz"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Walton",
                "href": "/profile/John-Walton-30"
            },
            "answer_text": "The first nuclear weapon that was used in the course of the Manhatten Project was a plutonium implosion device - a “Fat-Man”device. While there was two designs - “Little Boy”, a Uranium-235 Gun Barrel device, and “Fat Man”, a Plutonium-239 device - the science was straight-forward with the Uranium-235 Gun Barrel device, but it was not so straight-forward with a Plutonium-239 device. Additionally, Uranium-235 was hard to come by - it required very resource intensive isotope separation - while Plutonium-239 could easily be chemically separated from breeder reactor “waste”… In combat, the first nuclear weapon deployed was an Uranium-235 Gun Barrel weapon that was dropped on Hiroshima, and the second, and last, deployed in combat, was a Plutonium-239 Implosion device dropped on Nagasaki.. ",
            "date": "Answered June 30, 2019",
            "views": "136",
            "upvotes": "0"
        }
    ]
}