{
    "title": "Were all great human empires built on the backs of slaves? - Quora",
    "tags": [
        "History of Slavery",
        "Slavery",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amir Zargar",
                "href": "/profile/Amir-Zargar"
            },
            "answer_text": "Empires were built on exploitation, which is not limited to slavery, but of course can include it. Slavery has been a part of almost every civilization for much of human history.  However, only in a few cases did it make up a significant part of the labor force.  So we must first dismiss all the instances where even though slavery was wide-spread, it was mainly for domestic purposes.  We should only consider the instances where slave labor has been used to support agriculture and industry. Because the slave gets no value out of their labor, it is often assumed that their labor provides a huge net benefit for the slave owner or to the slave-owning society.  This is not necessarily true.  The slave owner has to spend significant capital up front, and pay for sustenance and security for the life of the slave, and hope that the poor slave's free labor pays for this investment.  And let's remember that the slave rarely has incentive to do good work, they had reason to do good enough work to avoid punishment, but no better.The alternate is that the owner operationalizes his labor costs by actually hiring free workers and paying them for their time.  And let's keep in mind that free workers might be living in conditions of abject poverty, so they will hire out their labor rather cheaply, asking for only enough pay for basic necessities. So back to the slave and the costs associated with slave ownership. Sustenance This is a small cost since slaves were rarely fed well, but it is a cost that the owner wouldn't have at all if he was hiring a bunch of nearly-starving peasants.Security These costs become negligible to the owner only when the free-person society as a whole bears the cost (through entities like the Slave patrol and other volunteer militias and posses).  This is a cheap undertaking only in case of color/race based slavery, where the black person -for instance- is readily identifiable as a slave and all white people participate in keeping all black people in bondage.  In a society where a person's appearance doesn't give him/her away as a runaway, the owner will be constantly losing some of his investment in the form of runaway's.Acquisition - If a person is born into slavery, the owner has to pay for him/her, up until the time he/she can start providing valuable labor.  In these cases the return on investment will take longer to amortize.If the slave is purchased from a slave-producer, then the market economy kicks in and the producer naturally asks for highest possible price that the buyer is willing to pay, which means the seller will make the cost of slave acquisition such that the cost of hiring free-men is only marginally higher.Conquests/raids are the third type of slave acquisition, and the type in which profits can most readily be realized.  The cost of conflict is great, but the returns in the masses of free labor - none of whom had to be raised at the cost of the slave-owner - is often a net gain.  And due to the large numbers acquired through this method, they were often treated even worse than other slaves (the average slave working on the Caribbean sugar plantations lasted around 5 years!!!), i.e. their sustenance costs were lower.Given the above costs, one expects to find few instances where the enterprise undertaken by the slave-owning society was only a possibility if the labor force was enslaved.  I don't have the numbers, so I won't speculate where and when this vile institution has actually ended up propping up empires. ",
            "date": "Answered October 10, 2013",
            "views": "63",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dick Graes",
                    "user_href": "/profile/Dick-Graes"
                },
                {
                    "user_id": "Ashish Das",
                    "user_href": "/profile/Ashish-Das-376"
                },
                {
                    "user_id": "Vilim of Latria",
                    "user_href": "/profile/Vilim-of-Latria"
                },
                {
                    "user_id": "George Stephen Hewitt",
                    "user_href": "/profile/George-Stephen-Hewitt"
                },
                {
                    "user_id": "Siddarth Reddy",
                    "user_href": "/profile/Siddarth-Reddy-9"
                },
                {
                    "user_id": "Jesus Lopez",
                    "user_href": "/profile/Jesus-Lopez-50"
                },
                {
                    "user_id": "Lyte Epps",
                    "user_href": "/profile/Lyte-Epps"
                },
                {
                    "user_id": "Grant Lee",
                    "user_href": "/profile/Grant-Lee-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Grant Lee",
                "href": "/profile/Grant-Lee-1"
            },
            "answer_text": "Yes, I think so. At least they had \"slavery\" in the generic sense – often now known to scholars as unfree labour. That is, a broader sense than chattel slavery (in which slaves are treated as private property). There is less difference between the various forms of unfree labour than there is between them and wage labour or self-employment. I can't think of any historical empires that did not utilise unfree labour, such as serfdom or indenture (a.k.a. debt bondage). Note, also, that the word \"serf\" – which now has implications distinct from chattel slavery – originated with the Latin servus (\"slave\"). For instance, the Inca – an example of a pre-modern empire – employed enslaved prisoners and commonly used mit'a (a form of corvee or “labour tribute”, i.e. a tax paid by compulsory labour). Even the most recent examples of empires, those founded in the late 19th and 20th centuries (e.g. the German Empire/Nazi Germany, the Empire of Japan and the United States) have utilised all or most of the forms mentioned above, including chattel slavery. For more on this, see (e.g.) The Cambridge World History of Slavery. ",
            "date": "Updated October 22, 2016",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dick Graes",
                    "user_href": "/profile/Dick-Graes"
                },
                {
                    "user_id": "Irfan Khan",
                    "user_href": "/profile/Irfan-Khan-390"
                },
                {
                    "user_id": "Uche Ezih",
                    "user_href": "/profile/Uche-Ezih"
                }
            ]
        }
    ]
}