{
    "title": "Were King Louis XVI's predecessors Kings Louis XIV and Louis XV actually more responsible for the French Revolution than he was? - Quora",
    "tags": [
        "French Monarchy",
        "Louis XV",
        "French Monarchs",
        "Louis XIV (historical figure)",
        "Louis XVI (historical figure)",
        "French Revolution",
        "Kings (royalty)",
        "History of France",
        "History of Europe",
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johan Louis De Jong",
                "href": "/profile/Johan-Louis-De-Jong"
            },
            "answer_text": "Without any doubt.  Louis XIV wanted to rule the world but spent bloody wars to get territories that did not matter too much and when it did matter he nearly was obliterated in the War of the Spanish succession.  And setting up costly Versailles as completely isolated from the world was a bad idea.,  And then his four mistresses.  The second was an awful person who dablled in poison and witchcraft. Sorcery does not work of course but on the Black masses babies were killed..  And the fourth he even married was a hypocrite who convinced him to expel the hardworking Huguenots, the French Protestants, once more wrecking the French economy. The man was a narcist, a sex addict and spent most of his life bossing other people around for his own gratification. It was always: Me, Me and Me.  At the time of his death people were so glad there was dancing in the streets of Paris.  Louis XV is a sad case because he had really wanted to do good but had no spine. He knew things were rotten but fled into the arms of too many women, like his predecessor. His soul mate, the Marquise de Pompadour, also had the best intentions but lacked experience. A female Prime Minister in the 18th century was highly unusual. So they both wanted the best but got the worst.  The Seven Year’s War against Britain and Prussia was a disaster, coupled with famine..  Both Kings were far more responsible for the French Revolution then poor Louis XVI who was the gentlest King France ever knew.  If there had been justice Louis XIV should have been executed and Louis XV be exiled to the barren North of Quebec… ",
            "date": "Answered July 7, 2019",
            "views": "22",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thomas Castle",
                    "user_href": "/profile/Thomas-Castle-10"
                },
                {
                    "user_id": "William Chen",
                    "user_href": "/profile/William-Chen-396"
                },
                {
                    "user_id": "Anamaria Borlan",
                    "user_href": "/profile/Anamaria-Borlan"
                },
                {
                    "user_id": "David Sam",
                    "user_href": "/profile/David-Sam-65"
                },
                {
                    "user_id": "Dallas Manning",
                    "user_href": "/profile/Dallas-Manning-2"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                },
                {
                    "user_id": "Jan Keller",
                    "user_href": "/profile/Jan-Keller-7"
                },
                {
                    "user_id": "Aidan Turner",
                    "user_href": "/profile/Aidan-Turner-20"
                },
                {
                    "user_id": "Kevin McGowan",
                    "user_href": "/profile/Kevin-McGowan-42"
                },
                {
                    "user_id": "Annika Karlsson",
                    "user_href": "/profile/Annika-Karlsson-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maurice Frinchaboy",
                "href": "/profile/Maurice-Frinchaboy"
            },
            "answer_text": "In a way yes. The financial situation in France was not just paying for the american revolution. The opulent jewels, chateaux (Versailles anyone??) and general blowing money away for sure did not help. The financial ruin of France was a long time coming. ",
            "date": "Answered July 4, 2019",
            "views": "205",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                },
                {
                    "user_id": "John Gordon",
                    "user_href": "/profile/John-Gordon-43"
                },
                {
                    "user_id": "Michael Criswell",
                    "user_href": "/profile/Michael-Criswell-7"
                }
            ]
        }
    ]
}