{
    "title": "Were swords actually as common as TV depicts? Did peasants own any? Were they expensive? Were there organised and dedicated training programs? - Quora",
    "tags": [
        "Peasants",
        "Sword Fighting",
        "Swords",
        "Middle Ages (era)",
        "Training",
        "Weapons",
        "Military History and Wars ",
        "Television Series"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gavin Rudge",
                "href": "/profile/Gavin-Rudge-1"
            },
            "answer_text": "This depends on what place and period you are talking about. In Medieval England in the immediate post-conquest period, swords would have been uncommon outside of the knightly class on account of their cost. Peasants who were recruited as foot soldiers would have obtained swords as spoils of war from time to time, but as they were untrained in their use, we can suppose they would have been far more inclined to sell them for what would have been substantial amount of money, than to use them. By the fourteenth century edged weapons were probably circulating more freely amongst the peasantry. Following the peasant’s revolt in the early 1380s a series of laws were passed in 1388 including one forbidding the peasantry from carrying edged weapons “Also that no servant, labourer, or servant of any craftsman or victualler shall carry baselard, dagger, or sword upon pain of forfeiture of the same, and that sheriffs, mayors, bailiffs, and constables shall have power to arrest all who contravene these ordinances and to seize and keep until the coming of the justices of the peace the abovesaid baselards, daggers, and swords, together with the names of those who carried them.” In wartime, peasants were usually expected to fight with pole weapons (bills, poll axes spears etc) or longbows. By the early 15th century however contemporary depictions of archers, who would be recruited from the peasantry, frequently showed swords being carried as sidearms. We know that the equipment they were documented as embarking with were just the bows, with spare strings and arrows, so side arms were a matter of personal preference or what could be obtained on campaign. We also have accounts of hatchets and mallets being used by archers when combat turned close and personal. By the end of the french wars we can infer that a large number of edged weapons were probably owned by those peasants who had served in military campaigns. Considering how common swords were amongst the upper (and therefore literate) class, there are relatively few written materials on training from the period. There are a mere handful of known treatises prior to the renaissance, and little consensus as to how to interpret them practically amongst people trying to re-create the fighting techniques of the time. We know that time and money was spent on the martial education of young noblemen and they also practised their skills in tournaments. It was likely there was a (possibly high?) degree of systemisation of training, given that learning to use a sword is a complex business, but this is was largely undocumented and would simply been part of the tradecraft of teachers of swordsmanship. Fencing manuals became increasingly common in the post medieval period, however by this time swords and swordsmanship were much less decisive in warfare. There are few contemporary accounts of sword teachers and some suggestion that the profession was not seen as altogether respectable. An indictment from London court case of 1311 states “Master Roger le Skirmisour was attached, for that he was itdicted for keeping a fencing-school for divers men, and for enticing thither the sons of respectable persons, so as to waste and spend the property of their fathers and mothers upon bad practices: the result being that they themselves became bad men. He appeared, etc. And the jurors said that he is guilty of the trespasses aforesaid. Therefore he was committed to prison, etc.” It would appear the Roger the Skirmisher (!?!) was considered a thoroughly bad lot. ",
            "date": "Answered October 23, 2020",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marko Radaković",
                "href": "/profile/Marko-Radaković"
            },
            "answer_text": "I can give you some answers based on my limited knowledge. It would be easier if you were a bit more time specific, but I’ll try my best. Were swords actually as common as TV depicts? - It depends on when and where we are talking about, but If you mean in their use, generally speaking, then no. TV can over do the use of swords a bit. Swords have almost always been secondary weapons rather than primary weapons especially in a medieval context. The same could be said of some later periods too. Guns first, sword second. The sword is generally a side arm. Not first choice. Did peasants owns any - No, not generally. They were weapons of war, not for the masses who would not have earnt enough to buy a sword. We do know that merchants who travelled could own a sword as they could be quite well off and one is mentioned in “The Canterbury Tales” from the 14th c. There tended to be rules for sword carrying in various countries through various era’s. Eg Some were the non permittance of swords in large towns/cities unless you were upper class, but you were allowed to carry a sword to fight off bandits whilst travelling between towns. Were they expensive? - This is a big question, but in short, some were expensive, some were not so expensive. The not so expensive ones tended to be of inferior quality. The more expensive tend to be better quality. You don’t buy a Mini and expect a Porsche. Eg. Some figures I know from a medieval point of view are from the early 15th c relating to archers. An archer could earn between 6 and 9 pence a day. A very cheap sword of the time could cost around 3 pence. It would be of very low quality though. At the end of the day, you get what you pay for. Were there organised and dedicated training programs? - Yes. From the medieval period onward there have been specific training schools. Earlier period ones tended to be exclusive schools for a select few. There are various manuals or treatises or fight books that cover these, the most well known are Talhoffer, Lichtenauer, Fiore, Meyer, Silver and so on. You can find a list of the Masters here Masters ~ Wiktenauer, the world's largest library of HEMA books and manuscripts ~☞ Insquequo omnes gratuiti fiant ",
            "date": "Answered October 23, 2020",
            "views": "113",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ken Hummel",
                    "user_href": "/profile/Ken-Hummel-2"
                },
                {
                    "user_id": "Michael Orick",
                    "user_href": "/profile/Michael-Orick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Hunter",
                "href": "/profile/Rick-Hunter-46"
            },
            "answer_text": "It depends on the TV show. Most TV shows don’t show any swords at all, especially those depicting 20th and 21st Century life aside from “Highlander.” Maybe someone made a strange show where everyone carries a sword, but I’ve never heard of it. The shows and movies I’ve seen where swords are common would have been more or less accurate in terms of the number of people carrying swords, even in a fantasy setting. Even in these shows, the average person doesn’t carry a sword. You see the knights and men at arms with swords, or maybe samurai or other warriors, but the villagers they pass by on their way to their battles or adventures are usually unarmed. As to price, legality, training, and availability, it really depends on the specific place and time. It is also true that less expensive swords of lower quality existed and would have been more common that the high quality sword. ",
            "date": "Answered October 23, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anthony Johnson",
                    "user_href": "/profile/Anthony-Johnson-324"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Shaw",
                "href": "/profile/John-Shaw-26"
            },
            "answer_text": "no did peasants own them? sometimes, sometimes it was illegal, which lead to the development of sword sized “knives” called messers. in some places being armed was required, but in others carrying a weapon in times of peace was illegal. swords were nearly always sidearms though, like a pistol in the military, and for the most part swords were expensive, prohibitively so, so when non noble or at least wealthy families had them they were family heirlooms. In archaeological finds its not uncommon to find blades types with guard, hilt, and pommel types from centuries later ",
            "date": "Answered October 23, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Art Burnett",
                "href": "/profile/Art-Burnett-3"
            },
            "answer_text": "Howdy, Peasant…was more than a word…WORLD. A cheap knife…hook (for cutting branches/hedges, sickle (small grasses/plants…scythe…for reaping corn (wheat/barley)…if you needed something repaired…off to the blacksmith, tinsmith, fairer (horseshoes), the ever ready Tinker. TREEN! Was a way of life…bowls, cups, doughboats, chairs, tables, spoons, cribs (beds), pegs to hold winter clothing, shelves. ",
            "date": "Answered October 23, 2020",
            "views": "28",
            "upvotes": "0"
        }
    ]
}