{
    "title": "Were the ancient Egyptians closer to Arabs or black Africans? - Quora",
    "tags": [
        "Where the Egyptian Black or White?",
        "Black Africans",
        "Ancient Egyptians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ghali Lalanne",
                "href": "/profile/Ghali-Lalanne"
            },
            "answer_text": "They were closer to “black” Africans...  We all know in terms of ethnic composition, modern Egypt, is much different from ancient Egypt. Contemporary Egypt, is mostly an ethnic admixture between foreign invaders, conquerors and indigenous African people. Autosomally, as a whole, they tend to cluster more with Eurasian especially the Middle East. In the south, populations like Nubians cluster more with Africans (and thus Ancient Egyptians). All this is because of massive immigration from Europe and western Asia which started in the Late New Period. Well after Egypt was ancient. The Hyksos (Aamu) foreign rule during the second intermediate period, as well as during the late periods up to now (Assyrians, Greek, Roman, Arab conquest, British colonization, etc).This is all common knowledge, but it doesn't change the fact that the genisis of Egypt was African. Unlike the later Greco-Romans and later peoples,the foreigners who settled in Ancient Egypt did not change the fundamental character of the culture and society, they adopted it. Neither did they come in sufficient numbers to change the physical characteristics of the people fundamentally. For the most part, they settled in the Delta. If you had ever been to Egypt, you would know that the Delta is not part of the Nile Valley. The ancient Egyptians were not Near Eastern people. If you’re referring to the time preceding the Ptolemaic Period, I’m sure most of those mummies would test as European, Near Eastern. If you’re referring to any time period prior the 26th Dynasty, you couldn’t be more wrong. Many of today’s Egyptians are not necessarily representative of Ancients due to outside migration and admixture from European/Arab sources, particularly in Lower Egypt. Some Coptic claims to be pharanoic descendants not supported by DNA studies or cultural history showing heavy Arabization since 900 AD. Copts are culturally assimilated immigrants (Christian).  Modern Egyptians a mixed population with European and Arab strands-not identical to ancients. Quote(s): “Classical genetic studies show a high degree of genetic heterogeneity in the modern Egyptian population, suggesting that this population is descended from a mixture of African, Asian, and Arabian stock (Mahmoud et al. 1987; Hafez et al. 1986). Genetic heterogeneity within the Egyptian gene pool is also supported by more recent studies using autosomal STR markers (Klintschar et al. 1998; 2001)”. Source: Manni et al 2002. Y-chromosome analysis in Egypt, Hum Biology, 74:5, 645-658. Research paper: Y-chromosome analysis in Egypt suggests a genetic regional continuity in Northeastern Africa. New DNA data suggests that many modern Egyptians are not identical to the ancient Egyptians. While there is some linkage among SOME of today's Egyptians, particularly in the tropical south, (from whence the Dynasties sprung), new data indicates that many Egyptians today are Arabized/Eurasian types or hybrids. This is not necessarily a new finding. Bone studies show that the very late periodEgyptians (600-350BC) have datasets that are not \"typically\" Egyptians, like the earlier tropical African types before. Still, especially in the south, the tropical African influence still shows. Note this is not an \"either/or\" situation- but a matter of degree. MOST modern Egyptians seem Arabized/Eurasian but the DNA data still shows about one-third African, even with the Arabized takeover of Egypt. Quote(s): “Cosmopolitan northern Egypt is less likely to have a population representative of the core indigenous population of the most ancient times”. Source: Keita 2005. History in Africa, 2005, 32(1). 221-246. Interpreting Geographical Patterns of Y Chromosome Variation Modern Egyptians are a heavily Arabized population that are not necessarily closely linked with the ancients. Studies of the very late period show datasets are not typically Egyptian. MODERN EGYPTIANS PRIMARILY ARABIZED AND EURASIAN POPULATION “Outside influence and admixture with extraregional groups primarily occurred in Lower Egypt—perhaps during the later dynastic, but especially in Ptolmaic and Roman times (also Irish, 2006).” Source: Irish 2009. Dental_affinities_of_the_C-group_inhabitants.. Ec Hi Rev. Research paper: Further analysis of the population history of ancient Egyptians Non-African ancestry in Egyptians traced to Islamic invasions and expansions: “Using ADMIXTURE and principal-component analysis (PCA) (Figure 1A), we estimated the average proportion of non-African ancestry in the Egyptians to be 80% and dated the midpoint of the admixture event by using ALDER20 to around 750 years ago (Table S2), consistent with the Islamic expansion and dates reported previously”. Source: Luca Pagani et al. 2015. Tracing the Route of Modern Humans out of Africa by Using 225, Human Genome Sequences from Ethiopians and Egyptians. e American Journal of Human Genetics. American Journal of Human Genetics, Volume 96, Issue 6, p 986–991. Research paper: Tracing the Route of Modern Humans out of Africa by Using 225 Human Genome Sequences from Ethiopians and Egyptians “Their overlap with other Egyptian samples (in PC space, Fig. 2) suggests that although their morphology is distinctive, the pattern does overlap with the other time periods. These results therefore do not support the Petrie concept of a \\Dynastic race\" (Petrie, 1939; Derry, 1956). Instead, the results suggest that the Egyptian state was not the product of mass movement of populations into the Egyptian Nile region, but rather that it was the result of primarily indigenous development combined with prolonged small-scale migration, potentially from trade, military, or other contacts”. Source: Sonia R. Zakrzewski (2007). Research paper: Population continuity or population change: formation of the ancient Egyptian state. Modern Egyptians a mixed population with European and Arab strands-not identical to ancients: “Classical genetic studies show a high degree of genetic heterogeneity in the modern Egyptian population, suggesting that this population is descended from a mixture of African, Asian, and Arabian stock (Mahmoud et al. 1987; Hafez et al. 1986). Genetic heterogeneity within the Egyptian gene pool is also supported by more recent studies using autosomal STR markers (Klintschar et al. 1998; 2001)”. Source: Manni et al 2002. Y-chromosome analysis in Egypt, Hum Bio, 74:5, 645-658. Y-chromosome analysis in Egypt suggests a genetic regional continuity in Northeastern Africa. Saharan-Sudanic inheritance of Nile Valley settlers. Data on the peopling of the Nile Valley do not appear to support earlier historical notions of an initial wave of Caucasoid invaders entering from the North in order to introduce civilization. Mainstream data shows gradual movement and peopling from the south- the Saharan zone and associated parts of the Sudanic region, fusing with indigenous Nilotic elements already in place, leading into the development of the well-known Egyptian kingdoms, not sweeping insertions from the Mediterranean, Mesopotamia or elsewhere.(AMERICAN JOURNAL OF PHYSICAL ANTHROPOLOGY 83:35-48 (1990). See Wiki article Predynastic Egypt for the now discounted Dynastic Race Theory. As to the Saharan movement even Afrocentric critics such as Mary Lefkowitz note: Quote(s): \"Recent work on skeletons and DNA suggests that the people who settled in the Nile valley, like all of humankind, came from somewhere south of the Sahara; they were not (as some nineteenth-century scholars had supposed) invaders from the North. See Bruce G. Trigger, \"The Rise of Civilization in Egypt\". Source: Cambridge History of Africa (Cambridge, Cambridge University Press, 1982), vol I, pp 489-90; S. O. Y. Keita, \"Studies and Comments on Ancient Egyptian Biological Relationships,\" History in Africa 20 (1993) 129-54\". “Elements from both the Sahara and associated Sudanic regions appear to have been involved in the peopling Egypt according to a number of mainstream references. The Khartoum Culture and other zones of the Sudan for example show significant influence as indicated by pottery, jewelry, tools and implements, raw materials such as certain types of stone, and artistic designs”. Source: S. O. Y. KEITA, \"Studies of Ancient Crania From Northern Africa\", AMERICAN JOURNAL OF PHYSICAL ANTHROPOLOGY 83:35-48 (1990). Lefkowitz, Mary \"Not Out of Africa: How Afrocentrism Became an Excuse to Teach Myth as History,\" Basic Books, 1997. Keita states that there is no Scientific evidence in existence which sugguest that the Ancient Egyptians were anything other than Indigenous Northeast Africans.   Above are the plots from the 2009 Craniometric study conducted by Keita which unsurprisingly concludes that Ancient Nubians and Pre-Dynastic Egyptians were almost indistinguishable. Oxford Encyclopedia of Ancient Egypt: Quote(s): “There is now a sufficient body of evidence from modern studies of skeletal remains to indicate that the ancient Egyptians, especially southern Egyptians, exhibited physical characteristics that are within the range of variation for ancient and modern indigenous peoples of the Sahara and tropical Africa.. In general, the inhabitants of Upper Egypt and Nubia had the greatest biological affinity to people of the Sahara and more southerly areas”. Source: \"Nancy C. Lovell, \" Egyptians, physical anthropology of,\" in Encyclopedia of the Archaeology of Ancient Egypt, ed. Kathryn A. Bard and Steven Blake Shubert, ( London and New York: Routledge, 1999) pp 328-332)”. “Populations and cultures now found south of the desert roamed far to the north. The culture of Upper Egypt, which became dynastic Egyptian civilization, could fairly be called a Sudanese transplant”. Source: (Egypt and Sub-Saharan Africa: Their Interaction”. Encyclopedia of Precolonial Africa, by Joseph O. Vogel, AltaMira Press, Walnut Creek, California (1997), pp. 465-472). “Zakrzewski (2007) provided a comprehensive summary of previous Egyptian craniometric studies and examined Egyptian crania from six time periods. She found that the earlier samples were relatively more homogeneous in comparison to the later groups. However, overall results indicated genetic continuity over the Egyptian Predynastic and Early Dynastic periods, albeit with a high level of genetic diversity within the population, suggesting an indigenous process of state formation. She also concluded that while the biological patterning of the Egyptian population varied across time, no consistent temporal or spatial trends are apparent. Thus, the stature estimation formulae developed here may be broadly applicable to all ancient Egyptian populations..” Source: (\"Stature estimation in ancient Egyptians: A new technique based on anatomical reconstruction of stature.\" Michelle H. Raxter, Christopher B. Ruff, Ayman Azab, Moushira Erfan, Muhammad Soliman, Aly El-Sawaf, (Am J Phys Anthropol. 2008, Jun; 136(2):147-55. Research paper: Stature estimation in ancient Egyptians: a new technique based on anatomical reconstruction of stature.  Middle Easterners did not have tropical body proportions like ancient Egyptians: Quote(s): “Results indicate that the Qafzeh-Skhul hominids have African-like, or tropically adapted, proportions, while those from Amud, Kebara, Tabun, and Shanidar (Iraq) have more European-like, or cold-adapted, proportions. This suggests that there were in fact two distinct Western Asian populations and that the Qafzeh-Skhul hominids were likely African in origin - a result consistent with the \"Replacement\" model of modern human origins.. What we can say, however, is that in the Holocene, humans from southwest Asia do not exhibit tropically adapted body shape..” Source: Holliday, T. 2000. Evolution at the Crossroads. Amr Anthr, 102. 54-68. \"There is no archaeological, linguistic, or historical data which indicate a European or Asiatic invasion of, or migration to, the Nile Valley during First Dynasty times. Previous concepts about the origin of the First Dynasty Egyptians as being somehow external to the Nile Valley or less native are not supported by archaeology... In summary, the Abydos First Dynasty royal tomb contents reveal a notable craniometric heterogeneity. Southerners predominate. Source: (Kieta, S. (1992) Further Studies of Crania From Ancient Northern Africa: An Analysis of Crania From First Dynasty Egyptian Tombs, Using Multiple Discriminant Functions. AMERICAN JOURNAL OF PHYSICAL ANTHROPOLOGY 87:245-254)\".  CRANIAL STUDIES Quote(s): “Populations and cultures now found south of the desert roamed far to the north. The culture of Upper Egypt, which became dynastic Egyptian civilization, could fairly be called a Sudanese transplant”. (Egypt and Sub-Saharan Africa: Their Interaction). Source: Encyclopedia of Precolonial Africa, by Joseph O. Vogel, AltaMira Press, Walnut Creek, California (1997), pp. 465-472 ). “Analysis of skeletal and cranial remains reveals that the ancient Egyptians of the early Dynastic and pre-Dynastic phases, link closer to nearby Saharan, Sudanic and East African populations than Mediterranean and Middle Eastern peoples. Greeks, Romans, Hyskos, Arabs and others were to appear later in Egyptian history. Craniometric studies generally place ancient Upper Egyptian populations closer to the range of tropical Africans in the Nile Valley and East Africa than to Mediterraneans, or Middle Easterners”. Source: S. O. Y. Keita, \"Studies and Comments on Ancient Egyptian Biological Relationships,\" History in Africa 20 (1993) 129-54. “Analysis of crania is the traditional approach to assessing ancient population origins, relationships, and diversity. In studies based on anatomical traits and measurements of crania, similarities have been found between Nile Valley crania from 30,000, 20,000 and 12,000 years ago and various African remains from more recent times (see Thoma 1984; Brauer and Rimbach 1990; Angel and Kelley 1986; Keita 1993). Studies of crania from southern predynastic Egypt, from the formative period (4000-3100 B.C.), show them usually to be more similar to the crania of ancient Nubians, Kushites, Saharans, or modern groups from the Horn of Africa than to those of dynastic northern Egyptians or ancient or modern Southern Europeans”. Source: (S. O. Y. Kieta and A.J. Boyce, \"The Geographical Origins and Population Relationships of Early Ancient Egyptians\", in Egypt in Africa, Theodore Celenko (ed), Indiana University Press, 1996, pp. 20-33). “There is no archaeological, linguistic, or historical data which indicate a European or Asiatic invasion of, or migration to, the Nile Valley during First Dynasty times. Previous concepts about the origin of the First Dynasty Egyptians as being somehow external to the Nile Valley or less native are not supported by archaeology... In summary, the Abydos First Dynasty royal tomb contents reveal a notable craniometric heterogeneity. Southerners predominate”. Source: (Kieta, S. (1992) Further Studies of Crania From Ancient Northern Africa: An Analysis of Crania From First Dynasty Egyptian Tombs, Using Multiple Discriminant Functions. Source: AMERICAN JOURNAL OF PHYSICAL ANTHROPOLOGY 87:245-254).  “When the Elephantine results were added to a broader pooling of the physical characteristics drawn from a wide geographic region which includes Africa, the Mediterranean and the Near East quite strong affinities emerge between Elephantine and populations from Nubia, supporting a strong south-north cline”. Source: (Barry Kemp. (2006) Ancient Egypt: Anatomy of a Civilization. p. 54)”. “Over the long run of northeastern African history, what emerges most strongly is the extent to which ancient Egypt's culture grew from sub-Saharan African roots. The earliest foundations of the culture that was to evolve into that of dynastic Egypt were laid, as we have already discovered, by Afrasan immigrants from the general direction of the southern Red Sea hills, who arrived probably well before 10,000 B.C.E. The new inhabitants brought with them a language directly ancestral to ancient Egyptian. They introduced to Egypt the idea of using wild grasses or grains as food. They also introduced a new religion Its central belief, in the efficacy of clan deities, explains the traceability of the ancient Egyptian gods to different particular Egyptians localities: originally they were the deities of the local communities, whose members in still earlier times had belonged to a clan or a group of related clans”. Source: Christopher Ehret. (2002) The Civilizations of Africa: A History to 1800. p. 93. “.. how is it come about that Neolithic Saharan civilizations, ancient Egypt and modern Black African civilizations share cultural features? Today however, essentially autochthonous explanations are preferred based on what we call the substratum theory, whereby all the civilizations in question, even in their differences and peculiarities share a common cultural substratum as occurs in the northern world among Indo-European civilizations”. Source: CERVELLÓ AUTUORI, Joseph, Egypt, Africa and the Ancient World. “The predominant craniometric pattern in the Abydos royal tombs is 'southern' (tropical African variant), and this is consistent with what would be expected based on the literature and other results (Keita, 1990). This pattern is seen in both group and unknown analyses... Archaeology and history seem to provide the most parsimonious explanation for the variation in the royal tombs at Abydos.. Tomb design suggests the presence of northerners in the south in late Nakada times (Hoffman, 1988) when the unification probably took place. Delta names are attached to some of the tombs at Abydos (Gardiner, 1961; Yurco, 1990, personal communication), thus perhaps supporting Petrie's (1939) and Gardiner's contention that north-south marriages were undertaken to legitimize the hegemony of the south. The courtiers of northern elites would have accompanied them”. “Given all of the above, it is probably not possible to view the Abydos royal tomb sample as representative of the general southern Upper Egyptian population of the time. Southern elites and/or their descendants eventually came to be buried in the north (Hoffman, 1988). Hence early Second Dynasty kings and Djoser (Dynasty 111) (Hayes, 1953) and his descendants are not buried in Abydos. Petrie (1939) states that the Third Dynasty, buried in the north, was of Sudanese origin, but southern Egypt is equally likely. This perhaps explains Harris and Weeks' (1973) suggested findings of southern morphologies in some Old Kingdom Giza remains, also verified in portraiture (Drake, 1987). Further study would be required to ascertain trends in the general population of both regions. The strong Sudanese affinity noted in the unknown analyses may reflect the Nubian interactions with upper Egypt in predynastic times prior to Egyptian unification (Williams, 1980,1986)...” Source: (S. Keita (1992) Further Studies of Crania From Ancient Northern Africa: An Analysis of Crania From First Dynasty Egyptian Tombs, Using Multiple Discriminant Functions. AMERICAN JOURNAL OF PHYSICAL ANTHROPOLOGY 87:245-254). Research paper: Further studies of crania from ancient Northern Africa: An analysis of crania from First Dynasty Egyptian tombs, using multiple discriminant functions Native Egyptians speak on the race of “real” Egyptians…  Dr. Muhammad Arabi a Nubian and Egyptian historian explains why the ancient Egyptians and Nubians were “black”. ",
            "date": "Updated November 6, 2018",
            "views": "4",
            "upvotes": " View 33 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jan Dee",
                    "user_href": "/profile/Jan-Dee-20"
                },
                {
                    "user_id": "Elliott Brown",
                    "user_href": "/profile/Elliott-Brown-51"
                },
                {
                    "user_id": "Tanya Tsanakas",
                    "user_href": "/profile/Tanya-Tsanakas"
                },
                {
                    "user_id": "Michael Nurse",
                    "user_href": "/profile/Michael-Nurse-12"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Samirah-wolf"
                },
                {
                    "user_id": "Reginald G. Warren",
                    "user_href": "/profile/Reginald-G-Warren"
                },
                {
                    "user_id": "Albert Mahlaba",
                    "user_href": "/profile/Albert-Mahlaba-1"
                },
                {
                    "user_id": "Michael Davis",
                    "user_href": "/profile/Michael-Davis-592"
                },
                {
                    "user_id": "James Clipper",
                    "user_href": "/profile/James-Clipper"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Aero-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peace Ikharo",
                "href": "/profile/Peace-Ikharo"
            },
            "answer_text": "For sure they were not Arabs!! You can even ask the current day Egyptians. Even they would not ascribe the ancient history of the place they now occupy to their Arab ancestors. The question is answered right on the walls of and numerous monuments and ubiquitous artefacts found in the well preserved great pyramids. The people who built the pyramids and other collosal land marks knew that one day their history and heritage will be “stolen” that was why they built such enduring monuments and used hieroglyphs and pictures depicting both everyday life and sacred rituals and rites even though they had alphabetical writing. The “original” Egyptians were black. But please note that Egypt at its height was much much larger than what you see today which was cut haphazardly by the Europeans when they carved up Africa amongst themselves. It stretched down south all the way into parts of east and central Africa, with tributes coming from all these places making it very rich. To really talk about Egypt you would need to be specific with regards to the time or period as Egypt changed hands since it was conquered by Alexander the great (after who the ancient city of Alexandria is named ). It was the greatest kingdom in the world and also the center of learning of technology, arts and science. People from all over the world came to learn in its sacred places which at some point was off limits for europeans until the “holy pharaoh” allowed them in freely and reduced egypts army as he hated war. There are many ancient accounts that detail the physical descriptions of the teachers and inhabitants of Thebes (wesat in ancient egyptian) and the were black. The longest river in Africa is the Nile with its delta situated in Egypt so its only natural that they lived and bred with other black kingdoms like Ethiopia and what European scholars call Nubian kindoms. Please do not get me wrong, at some point in its history there were many races living and trading in Egypt as it was also a commercial powerhouse. Its position between 2 continents and the natural connectivity provided by the great Nile meant that people and commerce was natural. its current inhabitants conquered it in AD 641 and continue to hold it. Today Africa has many races, black, white, Arab and many versions brought about by long term inter breeding like Berbers. This is not about racism or because I am black African, it is simply the TRUTH!!! ",
            "date": "Answered June 10, 2017",
            "views": "47",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lira Mayne",
                    "user_href": "/profile/Lira-Mayne"
                },
                {
                    "user_id": "Sandra Reigns",
                    "user_href": "/profile/Sandra-Reigns"
                },
                {
                    "user_id": "Key Will",
                    "user_href": "/profile/Key-Will-1"
                },
                {
                    "user_id": "Chase Elliot Franklin Bolling",
                    "user_href": "/profile/Chase-Elliot-Franklin-Bolling"
                },
                {
                    "user_id": "Inigo Mulaisho",
                    "user_href": "/profile/Inigo-Mulaisho"
                },
                {
                    "user_id": "Oluwatomisin Mbas",
                    "user_href": "/profile/Oluwatomisin-Mbas"
                },
                {
                    "user_id": "Lulekal Assefa",
                    "user_href": "/profile/Lulekal-Assefa"
                },
                {
                    "user_id": "Ray Brawn",
                    "user_href": "/profile/Ray-Brawn"
                },
                {
                    "user_id": "Adap Kuria",
                    "user_href": "/profile/Adap-Kuria"
                },
                {
                    "user_id": "True Franck",
                    "user_href": "/profile/True-Franck"
                }
            ]
        }
    ]
}