{
    "title": "Were the Aztecs an advanced civilization? - Quora",
    "tags": [
        "Mesoamerica",
        "Aztec Empire",
        "Maya Civilization",
        "The Aztecs",
        "Archaeology",
        "Civilization",
        "Ancient Civilizations",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Riggsby",
                "href": "/profile/Matt-Riggsby"
            },
            "answer_text": "“Advanced” isn’t really a term social scientists used. It’s undefined and often used to contrast with the pejorative “primitive” (which social scientists also shy away from), so really, no society, from the first cities of Peru and Mesopotamia to the present day, can meaningfully be called “advanced” in a technical rather than casual sense. But we can say some things about the Aztec by comparison with other societies. Aztec metallurgy was a bit less sophisticated than that of early civilizations like the earlier cities of Mesopotamia and the early Egyptian dynasties, but they developed stone blade technology to a remarkable degree. They may have produced more food on less land than even contemporary European societies, given their cultivation of corn and the use of absurdly productive chinampa agriculture, though they didn’t have a large suite of domesticated animals and had essentially no draft animals. Their monumental architecture, primarily pyramids, very closely matches that of Bronze Age civilizations. They had reasonably sophisticated writing and mathematics. And the estimated population of the empire, in the low millions, is on the same order of magnitude for any number of other early empires. So, then, the technological and political sophistication of the Aztec empire doesn’t map 1:1 with any Old World society. There are many aspects where a difference in available natural resources make that sort of comparison very difficult. For example, the New World had teosinte, which was domesticated into corn, while the Old World had an awful lot of animals suitable for domestication. However, in many aspects, it appears more or less equivalent to an early-middle Bronze Age empire. ",
            "date": "Answered January 10, 2019",
            "views": "963",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Lori Dermesrobian",
                    "user_href": "/profile/Lori-Dermesrobian"
                },
                {
                    "user_id": "Erin Kelly",
                    "user_href": "/profile/Erin-Kelly-115"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Sigurd Fjeld Halvorsen",
                    "user_href": "/profile/Sigurd-Fjeld-Halvorsen"
                },
                {
                    "user_id": "Sebastian Stephenson",
                    "user_href": "/profile/Sebastian-Stephenson-1"
                },
                {
                    "user_id": "Alexandre Bueno",
                    "user_href": "/profile/Alexandre-Bueno"
                },
                {
                    "user_id": "Jonathan Shaltz",
                    "user_href": "/profile/Jonathan-Shaltz-1"
                },
                {
                    "user_id": "Anthony Middleton",
                    "user_href": "/profile/Anthony-Middleton-12"
                }
            ]
        }
    ]
}