{
    "title": "Were there gay cavemen? - Quora",
    "tags": [
        "Cavemen",
        "Human Evolution",
        "Homosexuality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Baglieri",
                "href": "/profile/Chris-Baglieri-1"
            },
            "answer_text": "I'm surprised that no one answered this in the following way: As of the 2011 UCLA study on Demographics of Homosexuality, about 3% of adults identify as homosexual or bisexual. As of the beginning of the twentieth century, (1935) Freud reported that, “Many highly respected individuals of ancient and modern times have been homosexual,” and he considered it part of the normal human variation. In eighteenth century England, male prostitution was common, as claimed by Rictor Norton and Samuel Pepys. In the thirteenth century, the Catholic Church instituted harsher penalties for sodomy, which it had previously issued the less punitive acts of penance for. In ancient Rome, homosexual companions were camouflaged with the title “brothers,” and Nero outraged critics by marrying (among others) adult men. Pederasty with slaves and boys was fine, you see, but frowned on when a free adult male was the receptive partner. In ancient Egypt (2500 BCE), clear reference to gay relationships exists in the tombs of kings, depicting (of all things) the relationship of two of the court's male manicurists. Do we have any reason to suppose that this behavior does not go back as far as humans do? Logic would say…No. ",
            "date": "Updated May 23, 2017",
            "views": "54",
            "upvotes": " View 46 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wilson Blythe",
                    "user_href": "/profile/Wilson-Blythe"
                },
                {
                    "user_id": "Helga F. Riedel",
                    "user_href": "/profile/Helga-F-Riedel"
                },
                {
                    "user_id": "Richard Ochberg",
                    "user_href": "/profile/Richard-Ochberg"
                },
                {
                    "user_id": "Marco Salfi",
                    "user_href": "/profile/Marco-Salfi-1"
                },
                {
                    "user_id": "Rob Simpson",
                    "user_href": "/profile/Rob-Simpson-36"
                },
                {
                    "user_id": "Jack Wells",
                    "user_href": "/profile/Jack-Wells-65"
                },
                {
                    "user_id": "Larry Pridgen",
                    "user_href": "/profile/Larry-Pridgen"
                },
                {
                    "user_id": "Nick Trierweiler",
                    "user_href": "/profile/Nick-Trierweiler-1"
                },
                {
                    "user_id": "Ari Sardar",
                    "user_href": "/profile/Ari-Sardar"
                },
                {
                    "user_id": "Laura Schroeder",
                    "user_href": "/profile/Laura-Schroeder-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Preman Tilson",
                "href": "/profile/Preman-Tilson"
            },
            "answer_text": "No doubt there were. But since exclusive homosexuality is relatively rare, and since early humans lived in small groups, the chances of two gay “cavemen” meeting up would have been slim (and of course, meeting someone who shares your sexual orientation is no guarantee of mutual attraction). A gay caveman would probably have had to make do with some fun on the side with all the bisexual and almost-but-not-quite heterosexual cavemen, but their chances of a longer-term partnering would have been low. But then we really don’t know much about early human society and whether or not that sort of pair-bonding was actually going on. If humans were anything like bonobo chimps, there would have been a lot sexual activity going on of all types. ",
            "date": "Answered May 15, 2017",
            "views": "17",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wilson Blythe",
                    "user_href": "/profile/Wilson-Blythe"
                },
                {
                    "user_id": "Richard Ochberg",
                    "user_href": "/profile/Richard-Ochberg"
                },
                {
                    "user_id": "Jack Wells",
                    "user_href": "/profile/Jack-Wells-65"
                },
                {
                    "user_id": "Janis Steins",
                    "user_href": "/profile/Janis-Steins-1"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                },
                {
                    "user_id": "Ygor Coelho",
                    "user_href": "/profile/Ygor-Coelho"
                },
                {
                    "user_id": "Jim Entwisle",
                    "user_href": "/profile/Jim-Entwisle"
                },
                {
                    "user_id": "Alejandro van Rooy",
                    "user_href": "/profile/Alejandro-van-Rooy"
                },
                {
                    "user_id": "Tim Janes",
                    "user_href": "/profile/Tim-Janes-2"
                }
            ]
        }
    ]
}