{
    "title": "Were there atheists during the Middle Ages (or earlier)? - Quora",
    "tags": [
        "History of Religion",
        "Atheists",
        "Middle Ages (era)",
        "History of Europe",
        "Atheism",
        "World History",
        "Islam",
        "Christianity",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ralf En",
                "href": "/profile/Ralf-En"
            },
            "answer_text": "Generally spoken, throughout the history of mankind, it was always crucial to be part of a bigger or smaller group, just in order to survive. Family, Clan, Cottage, Army etc. However, religion always was fascinating to humans, as it made them “in theory” superior than any other group (at least thats what each group thought / thinks) and a massive plus: by convincing others that you have a special connection to a specific god, you were able to claim power over the others, who only want to be on the “right” side. So in the middle ages, due to massive advertising efforts of e.g. christian scholars or islamic teachers etc., these religious groups grew bigger and bigger and by the pure mass of individuals, gained more power and more wealthy. So an atheist would have 2 choices: look for a group of other atheists - which were either very rare or you were not able to tell - or become part of a group (religion) which could make sure you are part of a strong group and by that protect you, as you are a teammember, whcih made you life a lot easier in those times. So I am sure there way atheists in the middle ages or even earlier, it was just too dangerous to let anyone know that you do not belong to a group (!) and by that, you would stand outside all these groups, alone, desperate and seen as an enemy of the “true faith” or “best team”…. ",
            "date": "Answered December 16, 2019",
            "views": "190",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Magzhan Utepbergenov",
                    "user_href": "/profile/Magzhan-Utepbergenov"
                }
            ]
        },
        {
            "author_info": {
                "name": "David LaDeau",
                "href": "/profile/David-LaDeau"
            },
            "answer_text": "A theist is a believer in a god. An a-theist is one who does not believe in said god. As long as there have been what we consider to be humans there have been those that question that which is presented without evidence. There can not be atheist without a belief NOT to believe in. So as long as there has been theism there have been atheist. Theism is something that is taught, not everyone believes in everything one ia told. ",
            "date": "Answered December 18, 2019",
            "views": "76",
            "upvotes": "0"
        }
    ]
}