{
    "title": "Were there any atheists in ancient Greece? - Quora",
    "tags": [
        "Ancient Greece",
        "Greece"
    ],
    "response": [
        {
            "author_info": {
                "name": "Spencer Alexander McDaniel",
                "href": "/profile/Spencer-Alexander-McDaniel"
            },
            "answer_text": "A frequent question I have encountered is the question of whether there were atheists in ancient Greece. This is a question that is surprisingly difficult to answer and I think the most appropriate answer is something along the lines of “sort of, but not exactly.” Although it is certainly possible that there were people in ancient Greece who rejected the existence of all deities, the historical evidence for the existence of such individuals is extremely limited to say the very least. We have solid evidence for the existence of people in ancient Greece who criticized certain aspects of traditional Greek religion and we even have solid evidence for the existence of people in ancient Greece who might be termed “agnostics,” but we have no clear, unambiguous, contemporary historical evidence for the existence of people in ancient Greece who outright denied the existence of all deities altogether. The etymology of the word atheist The modern English word atheist is derived from the Ancient Greek second-declension masculine noun ἄθεος (átheos), which literally means “a person without a deity.” The word comes from the second-declension masculine noun θεός (theós), meaning “deity,” plus the prefix ἀ- (a-), meaning “without.” The way this word was used in classical times, however, does not exactly correspond to the way we normally use the word atheist today in English. Today, the word atheist is normally used in English with the specific meaning of “a person who does not believe in any deities.” In classical times, though, the word ἄθεος was not normally used with this specific meaning; instead, it was normally used as a generic insult against anyone who did not conform to traditional religious practice. Most of the people this word was applied to in ancient times would not be considered atheists today. For instance, the word was routinely applied to early Christians during the early centuries AD, because they refused to worship the Roman emperor or the traditional Greco-Roman deities. From the perspective of the Greeks and Romans, that meant that Christians were ἄθεοι. Obviously, there are very few people today who would consider Christians “atheists.” In spite of this, many modern writers have been swift to interpret the Greek word ἄθεος as meaning “atheist” in the modern sense. The word ἄθεος is commonly, but misleadingly, translated as “atheist,” including in the translations I will quote later in this article. In order to truly understand the ancient Greeks, however, we must look past the contemporary meaning of the word atheist and instead try to understand Greek terms in the way the ancient Greeks would have understood them.  ABOVE: The Christian Martyrs’ Last Prayer, painted in 1883 by the French Academic painter Jean-Léon Gérôme. The main reason why early Christians were sometimes persecuted was because they refused to worship the traditional Greco-Roman deities. Diagoras of Melos, Theodoros of Kyrene, and others commonly known as “ἄθεοι” There are certain people who lived in ancient Greece, such as the lyric poet Diagoras of Melos (fifth century BC) and the philosopher Theodoros of Kyrene (lived c. 340 – c. 250 BC), who are commonly referred to by ancient writers as “ἄθεοι.” There are certainly some late sources that claim that some of these people denied the existence of the gods. The Christian apologist Athenagoras of Athens (lived c. 133 – c. 190 AD), for instance, argues in chapter four of his apologetic treatise A Plea for Christians that Christians are not ἄθεοι, contrasting them with Diagoras of Melos, whom he portrays as a true atheist. Athenagoras writes, as translated by B. P. Pratten: “As regards, first of all, the allegation that we are atheists [i.e. ἄθεοι] — for I will meet the charges one by one, that we may not be ridiculed for having no answer to give to those who make them — with reason did the Athenians adjudge Diagoras guilty of atheism, in that he not only divulged the Orphic doctrine, and published the mysteries of Eleusis and of the Kabeiroi, and chopped up the wooden statue of Herakles to boil his turnips, but openly declared that there was no God at all. But to us, who distinguish God from matter, and teach that matter is one thing and God another, and that they are separated by a wide interval (for that the Deity is uncreated and eternal, to be beheld by the understanding and reason alone, while matter is created and perishable), is it not absurd to apply the name of atheism?” As a result of these reports, some uncritical modern writers have gone so far as to proclaim Diagoras of the Melos “the first atheist.” This label, however, is certainly unwarranted. We actually have two surviving fragments of poems written by Diagoras of Melos that have been preserved through quotation by the Epicurean philosopher Philodemos of Gadara (lived c. 110 – c. 40 BC) in his treatise On Piety. These fragments clearly show that, whatever Diagoras was, he was definitely not an atheist in the sense we think of today. Here is one of Diagoras’s fragments, as it is preserved by Philodemos: “θεὸς θεὸς πρὸ παντὸς ἔργου βροτείου νωμᾶι φρέν’ ὑπερτάταν, αὐτοδαὴς δ’ ἀρετὰ βραχὺν οἶμον ἕρπειν.” Here is my own English translation: “A deity, a deity before every mortal deeddistributes the highest thought,and self-taught virtue creeps along a short path.” This doesn’t sound at all like the sort of thing a modern atheist would write. The other fragment of a poem by Diagoras preserved by Philodemos reads as follows: “κατὰ δαίμονα καὶ τύχαντὰ πάντα βροτοῖσιν ἐκτελεῖται.” Here is my own translation: “In accordance with divinity and fortuneall things for mortals are accomplished.” Once again, this is hardly the sort of thing that we would expect an atheist in the contemporary sense to write. It is also important to point out that the claims about Diagoras of Melos and other individuals known as “ἄθεοι” denying the existence of all deities whatsoever are invariably only found in relatively late sources and the earliest sources we have on these individuals make no clear mention of them having denied the existence of the gods. The earliest known mention we have of Diagoras, for instance, is a brief allusion to him as an impious individual in the comedy The Clouds, which was written by the comic playwright Aristophanes (lived c. 446 – c. 386 BC). Here is the place where Diagoras is mentioned, as rendered in this translation: STREPSIADES: “The Whirlwind has driven out Zeus and is King now.” PHEIDIPPIDES: “What drivel!” STREPSIADES: “You must realize that it is true.” PHEIDIPPIDES: “And who says so?” STREPSIADES: “Socrates, the Melian [i.e. Diagoras], and Chairephon, who knows how to measure the jump of a flea.” The view that Aristophanes attributes to Diagoras here is obviously intended as a parody. This conversation, therefore, hardly constitutes as serious evidence that Diagoras denied the existence of the gods. Even if this were not a parody, the view that Aristophanes attributes to Diagoras here is that the “Whirlwind” has driven out Zeus, not that Zeus does not exist at all. We cannot use this conversation from Aristophanes’s Clouds as evidence that Diagoras was an atheist in the modern sense. Nonetheless, this conversation does indicate that, at the time when this play was written, Diagoras was clearly seen by the general public as someone who defied traditional religious norms and conventions. The later historian Diodoros Sikeliotes (lived c. 90 – c. 30 BC) mentions Diagoras in Book Thirteen, chapter six of his Universal History, stating, as translated by C. H. Oldfather: “While these events were taking place, Diagoras, who was dubbed ‘the Atheist [i.e. ἄθεος],’ was accused of impiety [i.e. ἀσέβεια] and, fearing the people, fled from Attika; and the Athenians announced a reward of a talent of silver to the man who should slay Diagoras.” Once again, Diodoros Sikeliotes says nothing about Diagoras having allegedly denied the existence of the gods. All he says is that Diagoras was accused of ἀσέβεια (asébeia), which means “impiety.” Even in later times, there were still writers who do not seem to have considered thinkers such as Diagoras to have been atheists in the modern sense. For instance, the Christian apologist Clement of Alexandria (lived c. 150 – c. 215 AD) writes in chapter two of his Exhortation to the Greeks that people such as Diagoras and Theodoros only denied the popular opinions concerning the gods; he does not say that they outright denied the existence of all gods altogether. Here is what Clement writes, as translated by William Wilson: “Wherefore (for I must by no means conceal it) I cannot help wondering how Euhemeros of Agrigento, and Nikanor of Kypros, and Diagoras, and Hippon of Melos, and besides these, that Kyrenian of the name of Theodoros, and numbers of others, who lived a sober life, and had a clearer insight than the rest of the world into the prevailing error respecting those gods, were called Atheists [i.e. ἄθεοι]; for if they did not arrive at the knowledge of the truth, they certainly suspected the error of the common opinion; which suspicion is no insignificant seed, and becomes the germ of true wisdom.” Although scholarly debate on the subject of what exactly Diagoras of Melos and other people described in ancient sources as “ἄθεοι” actually believed is still ongoing, several modern scholars have concluded that these people probably did not deny the existence of the gods altogether, but rather merely criticized specific aspects of traditional Greek religion. For instance, in the 2016 book Diagoras of Melos: A Contribution to the History of Ancient Atheism, the Polish historian Marek Winiarczyk concludes that Diagoras of Melos cannot be accurately described as an atheist in the contemporary sense.  ABOVE: Photograph from Wikimedia Commons of the Greek island of Melos as it looks today. Diagoras of Melos was a native of the island. Xenophanes of Kolophon As I discuss further in this other article I wrote, there were certainly people in ancient Greece who openly criticized conventional views about the gods and claimed that the stories associated with traditional religion were not historically true. None of these people, though, are known to have been atheists in the modern sense and many of them are known not to have been. The poet Xenophanes of Kolophon (lived c. 570 – c. 475 BC), for instance, famously ridicules the traditional ancient Greek conception of the gods as anthropomorphic beings capable of immoral actions in the surviving fragments of his writings, which have been preserved through quotation by later writers. For instance, here are three surviving fragments of Xenophanes’s writings, as translated by Kathleen Freeman: “(FRG 14) But mortals believe the gods to be created by birth, and to have their own (mortals’) raiment, voice and body. (FRG 16) Aithiopians have gods with snub noses and black hair, Thrakians have gods with grey eyes and red hair. (FRG 15) But if oxen [and horses] and lions had hands or could draw with hands and create works of art like those made by men, horses would draw pictures of gods like horses, and oxen of gods like oxen, and they would make the bodies [of their gods] in accordance with the form that each species itself possesses.” This is certainly quite a savage critique of the traditional anthropomorphic conception of the gods. Nonetheless, as the other surviving fragments of Xenophanes’s writings clearly indicate, he still believed that the gods existed; he just believed that they were not anthropomorphic and that they were morally perfect. In other words, Xenophanes was certainly not an atheist by the modern definition.  ABOVE: Fictional seventeenth-century engraving depicting how the artist imagined Xenophanes of Kolophon might have looked. No one knows what he really looked like. Anaxagoras of Klazomenai The philosopher Anaxagoras of Klazomenai (lived c. 510 – c. 428 BC) criticized traditional Greek views about the gods as well. For instance, he apparently attracted much unwanted controversy for claiming that the sun was a massive ball of fire and that the moon was a massive rock, rather than upholding the traditional view that the sun and the moon were the chariots of the god Helios and his sister Selene respectively. There is, however, currently no reliable evidence to indicate that Anaxagoras ever denied the existence of the gods altogether. All we can say is that he criticized some traditional Greek beliefs about the gods. The Greek biographer and Middle Platonist philosopher Ploutarchos of Chaironeia (lived c. 46 – c. 120 AD) claims in his Life of Perikles that Anaxagoras was a close friend and associate of the Athenian politician Perikles and that Perikles’s political enemies put Anaxagoras on trial under the charge of ἀσέβεια (i.e. “impiety”) in an attempt to hurt Perikles politically. Here is the passage in question, as translated by Bernadotte Perrin for the Loeb Classical Library: “And Diopeithes brought in a bill providing for the public impeachment of such as did not believe in the gods, or who taught doctrines regarding the heavens, directing suspicion against Perikles by means of Anaxagoras. The people accepted with delight these slanders…” […] “… and he [i.e. Perikles] feared for Anaxagoras so much that he sent him away from the city. And since in the case of Pheidias he had come into collision with the people, he feared a jury in his own case, and so kindled into flame the threatening and smouldering war, hoping thereby to dissipate the charges made against him and allay the people’s jealousy, inasmuch as when great undertakings were on foot, and great perils threatened, the city entrusted herself to him and to him alone, by reason of his worth and power. Such, then, are the reasons which are alleged for his not suffering the people to yield to the Lakedaimonians; but the truth about it is not clear.” Modern historians tend to dismiss this whole story of the prosecution of Perikles’s associates as a fictional creation. For instance, in this paper, Jakub Filonik dismisses Ploutarchos’s accounts of the trials of Pheidias, Anaxagoras, and Aspasia as fictional stories derived from uncritical readings of sensationalistic claims in Attic comedies. In any case, even if Anaxagoras was prosecuted for impiety, that would not mean that he was an atheist in the modern sense, since the Greek word ἀσέβεια as it was used in ancient times simply referred to the act of going against traditional religious practice. Being “impious” in ancient times did not necessary mean being an atheist.  ABOVE: Detail of a fictional portrayal of Anaxagoras from a fresco displayed in the portico of the National University of Athens Protagoras of Abdera Probably the closest person we see in all of classical antiquity to a true atheist in the modern sense is the sophist Protagoras of Abdera (lived c. 490 – c. 420 BC). Protagoras would certainly be described as an agnostic by any modern definition. Protagoras’s treatise On the Gods, in which he espoused his agnostic views, has, unfortunately, not survived to the present day, but its opening sentence is preserved through quotation by the third-century AD Greek biographer Diogenes Laërtios in his biography of Protagoras in his book The Lives and Opinions of Eminent Philosophers. Here are Protagoras’s own words in Ancient Greek: “περὶ μὲν θεῶν οὐκ ἔχω εἰδέναι, οὔθ’ ὡς εἰσὶν οὔθ’ ὡς οὐκ εἰσὶν οὔθ’ ὁποῖοί τινες ἰδέαν· πολλὰ γὰρ τὰ κωλύοντά με εἰδέναι, ἥ τε ἀδηλότης καὶ βραχὺς ὢν ὁ βίος τοῦ ἀνθρώπου.” Here is my own translation of the passage into English: “Concerning deities, I cannot know whether they exist or not, nor can I know of what sort they may be; for indeed, many things prevent me from knowing, namely the obscurity of the subject and the brevity of human life.” The Roman orator Cicero (lived 106 – 43 BC) asserts in his treatise De Natura Deorum that the Athenians were so scandalized by Protagoras’s agnosticism that they banished him from their city and burned all his books. This same statement is echoed by Diogenes Laërtios in his biography of Protagoras in The Lives and Opinions of Eminent Philosophers. Modern historians, however, are extremely skeptical of these accounts, since both Cicero and Diogenes Laërtios were writing hundreds of years after Protagoras’s time and, although Protagoras is written about extensively by contemporaries, such as the Athenian philosopher Plato (lived c. 423 – c. 348 BC), none of them ever mention anything about him having been banished or his writings having been burned.  ABOVE: Democritus and Protagoras, painted between 1663 and 1664 by the Italian Baroque painter Salvator Rosa. Protagoras was what we might describe today as an agnostic. Socrates and his students The Athenian philosopher Socrates (lived c. 470 – 399 BC) was portrayed by Aristophanes in his comedy The Clouds as an impious individual. Socrates was later brought to trial in 399 BC under charges of ἀσέβεια (asébeia) or “impiety,” of which he was convicted. In spite of this, Socrates’s students, the philosopher Plato (lived c. 423 – c. 348 BC) and the historian Xenophon (lived c. 431 – 354 BC), who both knew him much better than his accusers ever did, both consistently portray him in their writings as an extremely devout man. Modern historians generally agree that the charges against Socrates were entirely fabricated; the real reasons for Socrates’s trial were both personal and political. One reason why Socrates was brought to trial was because he was annoying. Socrates was notorious for pestering people in the Agora, asking them questions they did not want to have to answer, and generally being very rude. Plato tells us in his Apology of Socrates that Socrates told a number of very important and influential men that they did not know as much as they thought they did. Therefore, it seems that one of the main reasons why Socrates was brought to trial was because people just got tired of him being so unbearably annoying.  ABOVE: First-century AD Roman marble portrait head of Socrates, probably a copy of an earlier fourth-century BC Greek bronze original made by the sculptor Lysippos There were also political reasons for Socrates’s indictment. Socrates was known to have been the tutor of Alkibiades (lived c. 450 – 404 BC), a much-hated politician and general whose narcissistic behavior had cost Athens greatly in the Peloponnesian War. Even more devastating for Socrates, though, was the fact that he had also once been the tutor to Kritias (lived c. 460 – 403 BC), the ringleader of the Thirty Tyrants, a brutal oligarchic regime that, during its brief rule in 404 BC, had brutally executed roughly one twentieth of the total population of Athens. Socrates showed immense courage in opposing Kritias and his fellow thugs during their reign of terror, but this could not wipe off the stain Kritias’s heinous deeds left on Socrates’s public reputation.  ABOVE: Alcibiades Being Taught by Socrates, painted in 1776 by the French Neoclassical painter François-André Vincent As for Socrates’s own religious views, as far as we can tell, there was nothing particularly unusual about them for the most part. He believed in and worshipped the same gods as everyone else. All our surviving sources written by people who knew Socrates portray him as a deeply pious man, who worshipped the sun, who sacrificed regularly to the gods of the state, who believed the word of the oracle of Apollon, and so on. There was, however, at least one peculiarity about Socrates’s religious beliefs that might have raised a few eyebrows. According to Plato, Socrates believed that he was protected by a personal δαίμων (daímōn). This word means something along the lines of “a divine being lesser than a god believed to protect and guide individual human beings.” It is a similar concept to the modern Christian notion of a “guardian angel.” Many Athenians may have looked upon such claims of having a personal divine protector as warranting suspicion.  ABOVE: Ancient Roman carnelian gemstone engraved with a portrait of Socrates, dating to the first century BC or first century AD Like Xenophanes before him, Socrates’s student Plato criticized the anthropomorphic portrayal of the gods in the Homeric poems, but, again, he still firmly believed in the gods’ existence; he just believed that the gods were non-anthropomorphic and morally perfect. Sisyphos fragment One piece of evidence that has often been interpreted as demonstrating the existence of atheism in ancient Greece is a surviving fragment of a now-lost Athenian play called Sisyphos, which was either a tragedy or a satyr play and which was originally written in around the late fifth century BC. This fragment of the play has been mainly preserved through quotation by the later philosopher Sextos Empeirikos (lived c. 160–c. 210 AD). The author of the play is believed to have been either the Athenian politician Kritias (lived c. c. 460 – 403 BC), who was the cousin of Plato’s mother Periktione, or the Athenian tragic playwright Euripides (lived c. 480 – c. 406 BC). Sextos Empeirikos quotes the entire passage, attributing it to Kritias without saying which of his works it came from. The Stoic philosopher Chrysippos of Soloi and the later doxographer Aëtios, however, both attribute portions of the passage to the satyr play Sisyphos by Euripides. Scholars are still debating which of these two men was the actual author. Regardless of who wrote the play, the relevant portion of the fragment reads, in the original Ancient Greek: “<πρῶτον> πυκνός τις καὶ σοφὸς γνώμην ἀνήρ <θεῶν> δέος θνητοῖσιν ἐξευρεῖν, ὅπως εἴη τι δεῖμα τοῖς κακοῖσι, κἂν λάθρᾳ πράσσωσιν ἢ λέγωσιν ἢ φρονῶσί <τι>.” An English translation of this passage by R. G. Bury reads as follows: “Some shrewd man first, a man in counsel wise, Discovered unto men the fear of Gods, Thereby to frighten sinners should they sin E’en secretly in deed, or word, or thought.” First of all, it is absolutely essential to point out that this passage would have been spoken by one of the characters in the play or by the chorus and that it does not necessarily reflect the actual views of the playwright himself. In fact, it is entirely possible that this passage might have been spoken by the main character Sisyphos, in which case it may have been intended to show the audience what a horrible and impious man Sisyphos was in order to justify his demise at the end of the play. Additionally, it is important to notice that the quotation does not say that this man invented the idea of the gods themselves, but rather the fear of the gods. In other words, this quotation may not even necessarily argue for atheism per se, but might instead be arguing that the gods have no real powers and that the fear of them is something that is promoted merely to keep people in line. It is only through the lens of extreme wishful thinking that we can see this passage as definitive proof of atheism in ancient Greece. Nonetheless, that is how this passage is normally interpreted.  ABOVE: Painting by the Italian Renaissance painter Titian begun in 1548 and completed in 1549 depicting the punishment of Sisyphos in the Underworld Bellerophontes fragment There is only one surviving passage from a classical Greek text that I am currently aware of that makes a clear and unambiguous statement of atheism in the modern sense in a serious, non-comedic context. It is a fragment from the lost tragedy Bellerophontes, which was written by the Athenian tragic playwright Euripides. Although the play itself has been lost, the passage in question has been preserved through quotation by Pseudo-Ioustinos in his treatise On Monarchy. Here is the passage from the play in the original Ancient Greek: “φησίν τις εἶναι δῆτ᾿ ἐν οὐρανῷ θεούς;οὐκ εἰσίν, οὐκ εἴσ᾿, εἴ τις ἀνθρώπων θέλειμὴ τῷ παλαιῷ μῶρος ὢν χρῆσθαι λόγῳ.σκέψασθε δ᾿ αὐτοί, μὴ ᾿πὶ τοῖς ἐμοῖς λόγοιςγνώμην ἔχοντες. φήμ᾿ ἐγὼ τυραννίδακτείνειν τε πλείστους κτημάτων τ᾿ ἀποστερεῖνὅρκους τε παραβαίνοντας ἐκπορθεῖν πόλεις·καὶ ταῦτα δρῶντες μᾶλλόν εἰσ᾿ εὐδαίμονεςτῶν εὐσεβούντων ἡσυχῇ καθ᾿ ἡμέραν.πόλεις τε μικρὰς οἶδα τιμώσας θεούς,αἳ μειζόνων κλύουσι δυσσεβεστέρωνλόγχης ἀριθμῷ πλείονος κρατούμεναι.οἶμαι δ᾿ ἂν ὑμᾶς, εἴ τις ἀργὸς ὢν θεοῖςεὔχοιτο καὶ μὴ χειρὶ συλλέγοι βίον< | > τὰ θεῖα πυργοῦσ᾿ αἱ κακαί τε συμφοραί . . .” Here is the passage, as translated by Christopher Collard and Martin Cropp for the Loeb Classical Library: “Does then anyone say there are gods in heaven? There are not, there are not, if a man is willing not to give foolish credence to the ancient story. Consider for yourselves, don’t form an opinion on the basis of my words! I say that tyranny kills very many men and deprives them of possessions, and that tyrants break oaths in sacking cities; and in doing this they prosper more than those who day by day quietly practise piety. I know too of small cities honouring the gods which are subject to greater, more impious ones because they are dominated by more numerous arms. I think that, if someone lazy were to pray to the gods for a living and not gather it by hand, you would . . . (text lost) . . . they exaggerate divine powers tower-high, and their bad disasters . . .“ There is no denying that the sentiments expressed in this passage are atheistic in the modern sense. Nevertheless, it is absolutely paramount that we remember that this passage would have been spoken by a character in the play (most likely the protagonist Bellerophontes). On account of this fact, we should not interpret this passage as necessarily reflecting the actual opinions of Euripides or anyone else of his time period. It is quite possible—indeed, even quite likely—that this passage is deliberately written to present an extremely radical, unpopular view with the intention to scandalize the Athenian public listening to the play. The likelihood that this passage would have been spoken by the character Bellerophontes makes it seem all the more likely that Euripides wrote this passage with the deliberate intention to scandalize and appall. The mythical hero Bellerophontes was notorious in classical times for his infamous attempt to fly to the top of Mount Olympos on the back of the winged horse Pegasos and proclaim himself a god. This story is one of the most classic examples of hubris. By having Bellerophontes declare that there are no gods, Euripides was probably trying to show how utterly depraved, impious, and hubristic he was. This passage, then, was probably not written with the intention to convince anyone that the gods did not exist, but rather with the intention to demonstrate the sheer impiety of the character speaking.  ABOVE: Attic red-figure epinetron, dating to c. 425 – c. 420 BC, depicting Bellerophon on the back of Pegasos slaying the Chimera Epikouros of Samos The philosopher Epikouros of Samos (lived 341 – 270 BC) has often been wrongly cited as an example of a person from ancient Greece who was an atheist. In truth, Epikouros was not an atheist in the modern sense of the word at all; he firmly believed in the existence of the gods, but he rejected the traditional Greek conception of the gods and maintained that the gods have absolutely no involvement whatsoever in human affairs. In his Letter to Menoikeus, one of the three extant letters that are the main sources for most of what we know about his teachings, Epikouros himself writes, as translated into English by Robert Drew Hicks: “First believe that [a god] is a living being immortal and happy, according to the notion of a god indicated by the common sense of humankind; and so of him anything that is at agrees not with about him whatever may uphold both his happyness and his immortality. For truly there are gods, and knowledge of them is evident; but they are not such as the multitude believe, seeing that people do not steadfastly maintain the notions they form respecting them. Not the person who denies the gods worshipped by the multitude, but he who affirms of the gods what the multitude believes about them is truly impious. For the utterances of the multitude about the gods are not true preconceptions but false assumptions; hence it is that the greatest evils happen to the wicked and the greatest blessings happen to the good from the hand of the gods, seeing that they are always favorable to their own good qualities and take pleasure in people like to themselves, but reject as alien whatever is not of their kind.” The so-called “Epicurean trilemma” is often attributed to Epikouros, but, as I discuss in this article I published in July 2019, the form of the trilemma that we know today is actually a quote from the Scottish Enlightenment philosopher David Hume (lived 1711 – 1776) in his book Dialogues concerning Natural Religion, which was completed in 1776 shortly before Hume’s death and published posthumously in 1779. Hume based his description of the trilemma on a description from the from the early Christian apologist Lactantius (lived c. 250 – c. 325 AD) in chapter thirteen, verses twenty through twenty-one of his treatise De Ira Dei (“Concerning the Wrath of God”). Lactantius attributed the trilemma to Epikouros. No version of the Epicurean trilemma occurs in any of the surviving writings of Epikouros, but this does not necessarily mean anything, since the vast majority of everything Epikouros wrote has been lost. If Epikouros did write some form of the Epicurean trilemma, his version would have been an argument against the idea that the gods are involved in human affairs, not an argument against the existence of deities altogether.  ABOVE: Roman marble portrait head of Epikouros, probably based on an earlier Hellenistic Greek original Euhemeros of Messene The philosopher and mythographer Euhemeros of Messene, who lived in around the third century BC, has often been cited as an example of an atheist who lived in ancient Greece. As with the others I have already mentioned, though, the evidence used to support the argument that Euhemeros was an atheist in the modern sense is shaky at best. Euhemeros wrote a book titled Sacred History, which has been almost entirely lost. According to later writers, however, in this book, Euhemeros claimed that the traditional Greek deities were originally human kings who had died and been posthumously deified by their subjects. Many later writers have taken this argument as proof that Euhemeros was an atheist. This, however, is jumping to conclusions. Euhemeros lived during the Hellenistic Period. During his lifetime, it was widely believed that great kings really could become deities after their deaths. In other words, Euhemeros may not have being claiming that the gods did not exist at all, but rather simply providing a new explanation for the gods’ origins. Conclusion There were people in ancient Greece who challenged certain traditional notions about the gods and there were even people like Protagoras who entertained some doubts regarding the gods’ existence, but we have no reliable, contemporary record of anyone who is known to have outright categorically denied the existence of all deities. When it comes to evidence for what we might call “true atheism” or “strong atheism” in the ancient Greek world, all we have are unreliable claims derived almost exclusively from extremely late, biased sources. It is possible that there may have been “strong atheists” in ancient Greece, but, if there were, they must have been very rare and we have very little surviving evidence of them. (NOTE: I have also published a version of this article on my website titled “What Evidence Is There for Atheism in Ancient Greece?” Here is a link to the full article.) ",
            "date": "Updated February 20, 2020",
            "views": "13",
            "upvotes": " View 349 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gabriel Humphreys",
                    "user_href": "/profile/Gabriel-Humphreys-1"
                },
                {
                    "user_id": "Mikko Kangassalo",
                    "user_href": "/profile/Mikko-Kangassalo"
                },
                {
                    "user_id": "Micah Eric Ottaway",
                    "user_href": "/profile/Micah-Eric-Ottaway"
                },
                {
                    "user_id": "Rob Wanless",
                    "user_href": "/profile/Rob-Wanless-3"
                },
                {
                    "user_id": "Mukesh Kumar",
                    "user_href": "/profile/Mukesh-Kumar-1928"
                },
                {
                    "user_id": "Robin Saunders",
                    "user_href": "/profile/Robin-Saunders"
                },
                {
                    "user_id": "Acacia Hughes",
                    "user_href": "/profile/Acacia-Hughes-2"
                },
                {
                    "user_id": "Benedikt Grammer",
                    "user_href": "/profile/Benedikt-Grammer-1"
                },
                {
                    "user_id": "Zarquon Fillibuster",
                    "user_href": "/profile/Zarquon-Fillibuster"
                },
                {
                    "user_id": "Joseph Xue",
                    "user_href": "/profile/Joseph-Xue-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eleftherios Tserkezis",
                "href": "/profile/Eleftherios-Tserkezis"
            },
            "answer_text": "To begin with, “religious orientation” didn’t exist in ancient Greece the way it does today. Greeks didn’t have a word for “religion” and they certainly didn’t view what we know call “religion” as an independent sector of life outside of art, literature, and culture as a whole. Their “religion” was more about the participation in public festivals like games, sacrifices, and processions than about contemplating the existence of gods. That being said, there were indeed some individuals in ancient Greece who were considered, or even accused of being, atheists. Again, though, that was inside the context of their time, so you shouldn’t expect all of them to explicitly state “There are no gods whatsoever.” Most were what we now call agnostics, deists, or simply indifferent towards the supernatural. Here are some examples: Protagoras, an eminent sophist, famously stated: “Concerning the gods, I have no means of knowing whether they exist or not, nor of what sort they may be, because of the obscurity of the subject, and the brevity of human life.” Our modern mindset would consider him an agnostic.Diagoras of Melos, another sophist, was accused of being an atheist because he criticized the Eleusinian mysteries. It’s said that when someone showed him the pictures dedicated to the gods by sailors who had been saved from storms, he pointed out that there weren’t any images of those who had drowned. It is not known if he believed the gods didn’t exist at all.Socrates was accused of failing to acknowledge the gods of Athens (hous men e polis nomizei theous ou nomizon) and introducing new deities (hetera de daimonia kaina eisegoumenos). Again, that’s not atheism, but rather impiety. It should also be noted that there were political and social reasons behind his trial; the same is true about the said Diagoras.Epicureanism was a materialistic philosophy, but, again, it seems it didn’t deny the existence of deities, but rather their involvement in the world. Modern scholars can’t be certain about their specific views anyway.",
            "date": "Answered April 12, 2018",
            "views": "678",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabriel Humphreys",
                    "user_href": "/profile/Gabriel-Humphreys-1"
                },
                {
                    "user_id": "Bob Gluck",
                    "user_href": "/profile/Bob-Gluck-3"
                },
                {
                    "user_id": "Jeffery Panman",
                    "user_href": "/profile/Jeffery-Panman"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Spencer Alexander McDaniel",
                    "user_href": "/profile/Spencer-Alexander-McDaniel"
                },
                {
                    "user_id": "Shachi Devi",
                    "user_href": "/profile/Shachi-Devi"
                },
                {
                    "user_id": "Shreekant Dhuri",
                    "user_href": "/profile/Shreekant-Dhuri-1"
                },
                {
                    "user_id": "Julian Fejzo",
                    "user_href": "/profile/Julian-Fejzo"
                },
                {
                    "user_id": "Julie Williams",
                    "user_href": "/profile/Julie-Williams-79"
                },
                {
                    "user_id": "Demetres Petropoulos",
                    "user_href": "/profile/Demetres-Petropoulos"
                }
            ]
        }
    ]
}