{
    "title": "Were the Vikings Neanderthals? - Quora",
    "tags": [
        "Prehistoric Humans",
        "Vikings"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lars Eidevall",
                "href": "/profile/Lars-Eidevall"
            },
            "answer_text": "No, that is ridiculous. 50.000 years ago, a Cro Magnon woman had sex with a Neanderthal in the Near East, and since 5–10 generations after that time, around 2% are Neanderthal genes in humans outside Africa (and some Denisovans further East). No one has lived in Scandinavia since 10.000 years ago after the ice age, and the Neanderthals were long gone by then. Scandinavia was populated with dark skinned blue eyed people from the Near East and Ural migrators with different colours. Then the Anatolian brought agriculture, and the Indo European metal workers came with Thor and his hammer and the battle axe culture spreading over Scandinavia from North Europe. And since then we have been traders on boats and rivers all over Europe, and have spread Germanic culture in the same area. It is just from the period when the Norse opposed christianity that christians started calling us barbarians and savages. Alexander the Macedonian was also a barbarian in the eyes of Greek Athens. ",
            "date": "Answered May 22, 2019",
            "views": "15",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay Snead",
                    "user_href": "/profile/Jay-Snead-1"
                },
                {
                    "user_id": "J. Vance Tyree",
                    "user_href": "/profile/J-Vance-Tyree"
                },
                {
                    "user_id": "Tom Valentine",
                    "user_href": "/profile/Tom-Valentine-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Severs",
                "href": "/profile/Mark-Severs-5"
            },
            "answer_text": "No. The Viking era dates from only hundreds of years ago. Neanderthals disappeared tens of thousands of years ago. The main identified settlements of Neanderthal hominids are not geographically within the “main areas” where viking societies originated. ",
            "date": "Answered September 26, 2019",
            "views": "541",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Song Thorsen",
                    "user_href": "/profile/Song-Thorsen"
                },
                {
                    "user_id": "Jay Snead",
                    "user_href": "/profile/Jay-Snead-1"
                }
            ]
        }
    ]
}