{
    "title": "Were Germans aware of the concentration camps for extermination of Jews during times of Hitler, or heard rumor of such? - Quora",
    "tags": [
        "Concentration Camps",
        "Adolf Hitler"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tennille Charlton",
                "href": "/profile/Tennille-Charlton"
            },
            "answer_text": "Some claim that the full extent of what was happening in German-controlled areas was not known until after the war. Many Germans in Germany claimed not to have knowledge of the mass extermination of the Jewish people until after the war or at the least when it was too late and the war was almost over. My grandfather for instance was a young boy during WWII, his father was a Nazi who died in 1945, he was a member of the Hitler Youth and his older brother was also a member of the youth though being he was right on 18 years of age had to fight like a military trained soldier in the end when numbers for Germany dwindled and he did not make it out alive. I asked him of his own personal experience and knowledge at the time and this is what he told me about the situation with the Jews - Being only a young boy at the time he admits that perhaps he was more shielded from things or more naive to things than if he had been older but basically (in the beginning at least) the word used to describe what was happening to the Jews was “relocation.” Even in their own reports, the SS did not reveal what went on in the camps. When mass extermination started in 1941, the Jews were gone from Germany. Where were they? People simply didn’t ask, because “relocation” had an ominous ring, and they were scared to find out, by now they all knew things were bad, or at least expected it. So I guess in a way even he had an idea something was going on, but at first he had been so caught up in his own life and loving it - for young Germans, the 1930s were just wonderful. The red flags with swastikas, the zeppelin Hitler sent to fly all over Germany, the Austrians wanting to become part of it—to them it was just like sunlight and peace and eating again. Things were moving up! Of course, Jews were being eliminated from the professions; the Nuremburg Laws of 1935 prohibited intermarriage between Jews and non-Jews. But until all the Jewish shops were attacked, the violence was off camera. He said he didn't even know what was going on because it wasn't made to seem as bad as it really was. But of course that is just one young boys account of things and when you look through resources on the internet it seems that debate still continues on how much average Germans knew about the Holocaust. Recent historical work has found that the majority of Germans knew about the concentration camps and that Jews were being indiscriminately killed and persecuted in the death camps - “Hitler exterminated the Jews of Europe. But he did not do so alone. The task was so enormous, complex, time-consuming, and mentally and economically demanding that it took the best efforts of millions of Germans... All spheres of life in Germany actively participated: Businessmen, policemen, bankers, doctors, lawyers, soldiers, rail road and factory workers, chemists, pharmacists, foremen, production managers, economists, manufacturers, jewellers, diplomats, civil servants, propagandists, film makers and film stars, professors, teachers, politicians, mayors, party members, construction experts, art dealers, architects, landlords, janitors, truck drivers, clerks, industrialists, scientists, generals, and even shopkeepers—all were essential cogs in the machinery that accomplished the final solution.” Robert Gellately, a historian at Oxford University, conducted a widely respected survey of the German media before and during the war, concluding that there was \"substantial consent and active participation of large numbers of ordinary Germans\" in aspects of the Holocaust, and documenting that the sight of columns of slave laborers were common, and that the basics of the concentration camps, if not the extermination camps, were widely known. So perhaps it depended on how old you were or where in Germany you lived, if it was previously a Jewish populated neighbourhood and you had known Jewish people and been friendly with one and other before. One thing for certain that comes up over and over again is how the Allies knew what was going on with the Jewish people from very early on when they started the extermination camps because since the early years of the war, the Polish government-in-exile published documents and organised meetings to spread word of the fate of the Jews; below is a photo example of the 16 page document sent out by the Polish Government-in-exile -  source: Rape, Murder and Genocide: Nazi War Crimes as Described by German Soldiers - SPIEGEL ONLINE The Holocaust in Poland Jews, Poles & Nazis: The Terrible History ",
            "date": "Answered May 14, 2016",
            "views": "21",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steven Bird",
                    "user_href": "/profile/Steven-Bird-4"
                },
                {
                    "user_id": "Joe Murray",
                    "user_href": "/profile/Joe-Murray-183"
                },
                {
                    "user_id": "Jason Adkins",
                    "user_href": "/profile/Jason-Adkins-18"
                },
                {
                    "user_id": "Robert Salinger",
                    "user_href": "/profile/Robert-Salinger-1"
                },
                {
                    "user_id": "Marty Karaffa",
                    "user_href": "/profile/Marty-Karaffa"
                },
                {
                    "user_id": "Anghelescu Codrut Victor",
                    "user_href": "/profile/Anghelescu-Codrut-Victor"
                },
                {
                    "user_id": "Alex Hensley",
                    "user_href": "/profile/Alex-Hensley"
                },
                {
                    "user_id": "Nessa Potter",
                    "user_href": "/profile/Nessa-Potter"
                },
                {
                    "user_id": "Craig Murray",
                    "user_href": "/profile/Craig-Murray-26"
                },
                {
                    "user_id": "Vrutant M. Shroff",
                    "user_href": "/profile/Vrutant-M-Shroff"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Bird",
                "href": "/profile/Steven-Bird-4"
            },
            "answer_text": "A little of both, I’d say. Plenty of Germans after the war claimed to know nothing of the Holocaust, even Leni Riefenstahl, a famous/infamous filmmaker who was close to Hitler’s inner circle. But German soldiers from all over the country saw things - trains full of Jews and other prisoners destined for the camps, slave laborers at work in hundreds of factories, Einsatzgruppen busy murdering in the east, etc. And those soldiers generally got to go home on leave at some point, and talked to their families and friends. Not to mention that everyone knew about Kristallnacht[1] , and most people (except maybe in small villages) were in a position to notice the disappearance of Jews and other ‘undesirables’ from their communities. Friedrich Kellner, an anti-nazi court official in a very pro-nazi region of Germany, stated specifically in his diary that soldiers home on leave had witnessed some of the horrors of the Holocaust early on, and understood very well that there would be hell to pay for it fairly soon.[2] The argument that ordinary Germans just didn’t know is extremely hard to support. German troops for the most part knew that something very bad was happening to the Jews; and since anti-Semitism was rife in Germany and the Nazis had been fanning those flames for years, well I’m sure there was a range of opinions in the ranks with very few being favorable to the Jews. Daniel Goldhagen’s Hitler’s Willing Executioners [3]is an interesting read on the subject, and Soldaten: On Fighting, Killing and Dying. The Secret World War II Transcripts of German POWs [4] by Sönke Neitzel & Harald Welzer is also very revealing on the question of what Germans and German soldiers knew and thought. Footnotes[1] Kristallnacht - Wikipedia[2] My Opposition - Wikipedia[3] Hitler's Willing Executioners - Wikipedia[4] Soldaten: On Fighting, Killing and Dying. The Secret World War II Transcripts of German POWs",
            "date": "Answered April 10, 2020",
            "views": "288",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Murray",
                    "user_href": "/profile/Joe-Murray-183"
                },
                {
                    "user_id": "William Guest",
                    "user_href": "/profile/William-Guest-4"
                },
                {
                    "user_id": "John Doe",
                    "user_href": "/profile/John-Doe-18224"
                },
                {
                    "user_id": "Harold Piskiel",
                    "user_href": "/profile/Harold-Piskiel"
                },
                {
                    "user_id": "Joseph Griffin",
                    "user_href": "/profile/Joseph-Griffin-8"
                },
                {
                    "user_id": "Tim Larsen",
                    "user_href": "/profile/Tim-Larsen-29"
                },
                {
                    "user_id": "Robert Holmén",
                    "user_href": "/profile/Robert-Holmén"
                },
                {
                    "user_id": "Jason Adkins",
                    "user_href": "/profile/Jason-Adkins-18"
                },
                {
                    "user_id": "Abdullah Salim",
                    "user_href": "/profile/Abdullah-Salim-31"
                },
                {
                    "user_id": "Charles Ganske",
                    "user_href": "/profile/Charles-Ganske"
                }
            ]
        }
    ]
}