{
    "title": "Were Scythians from the ten lost tribes of Israel, or were they Iranic? - Quora",
    "tags": [
        "Scythians",
        "12 Tribes of Israel",
        "Tribalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dean Celiku",
                "href": "/profile/Dean-Celiku"
            },
            "answer_text": "The origins of the Scythians used to be a matter of debate, however today it is believed that they were a group of people or collection of different groups that were of Iranic origin. Map that shows the territories that were inhabited by the Scythians  As we all know, the Scythians were a nomadic group of people. They were masters of horsemanship and made great use of the composite bow. They were known as warlike people and were notoriously known for their mobility in combat. It is widely believed that their language was part of Eastern-Iranic languages. Their religion was a pre-Zoroastrian Iranian religion, not an Abrahamic one. Archeologists have found numerous objects and artifacts that proved that the Scythians also had their own unique art form. The majority of Scythian art depicts animals of all kinds, although later it changed due to Greek and Persian influence (humans were being depicted in art now). The reason why I wrote the paragraph above is to show how much different the Scythians were from the ancient Israelites. They were very different in almost all aspects of life. The claim that the Scythians are one of the lost tribes of Israel isn’t new. Regarding this claim I believe that it is logically wrong to say that the Scythians are one of the lost tribes of Israel. They weren’t. They were different people; however, it is believed that some Israelites became federated with the Scythians.  I took this screenshot form the answer of Yair Davidiy. The question was What are the ten lost tribes of Israel? So, the Scythians weren’t one of the lost tribes of Israel, but it is possible for some ancient Israelites to have become part of the ancient Scythians and thus assimilating into the Scythian culture and way of life. ",
            "date": "Answered August 19, 2020",
            "views": "158",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexandra Wolf",
                    "user_href": "/profile/Alexandra-Wolf-9"
                },
                {
                    "user_id": "Liam Corrigan",
                    "user_href": "/profile/Liam-Corrigan-2"
                },
                {
                    "user_id": "Sierra Sernau",
                    "user_href": "/profile/Sierra-Sernau"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clarence Uhrich",
                "href": "/profile/Clarence-Uhrich"
            },
            "answer_text": "They were from Iran according to the following article Scythian | People, History, & Facts Scythian, also called Scyth, Saka, and Sacae, member of a nomadic people, originally of Iranian stock, known from as early as the 9th century BCE who migrated westward from Central Asia to southern Russiaand Ukraine in the 8th and 7th centuries BCE. The Scythians founded a rich, powerful empire centred on what is now Crimea. The “ten lost tribes of Israel” were likely absorbed into the surrounding peoples of the Mediterranean countries and Central Asia. Resolving what happened to them likely requires finding the actual bones of Jacob (Israel) and doing extensive DNA studies of anyone from the area in the paragraph above. ",
            "date": "Answered August 19, 2020",
            "views": "12",
            "upvotes": " Answer requested by Andreas Rodrigues Bonic"
        }
    ]
}