{
    "title": "What military strategies did the Mongols use for winning wars? - Quora",
    "tags": [
        "Genghis Khan",
        "Strategies",
        "Mongol Empire",
        "World History",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Carter Moore",
                "href": "/profile/Carter-Moore"
            },
            "answer_text": "First and foremost - and this cannot be overstated enough - the Mongols were disciplined and loyal to their leaders. Most armies of the era were made of conscripts or indentured servants who had no real commitment to their commanders. Once things went sour on the battlefield, they were done. Not so with the Mongols. Loyalty was drilled into them from childhood, and any expression to the contrary was a literal death sentence.  This, more than numbers and brutality, gave the Mongols the edge on the battlefield - even against superior forces. You only need to look at how the Iraqi army has performed against ISIS, despite having had better numbers and equipment, to see how disparities in discipline and commitment can shape a military campaign.  Their discipline also allowed them to create a very robust yet flexible organizational structure. The Mongols could either move in a massive army for battles, or break down into smaller, clan-centric groups for hit-and-run ambushes as needed. The other thing to keep in mind with the Mongols is that they were exceptionally well trained with their tools of warfare: horses and bows. Again, from childhood, Mongols were taught to ride and shoot. Their way of life depended on it. Pardon the stereotyping, but the world probably hadn't seen a populace so readily adaptable to weaponry until Americans and our love affair with guns came along. Next, the Mongols were an incredibly fast moving army that could position themselves faster and to more advantageous grounds than their opponents. Moving up to 100 miles per day (unheard of back then, and remaining uncommon until the modern era), they would quickly outflank and encircle their enemies during battles, creating panic that they further exploited. The Mongols also favored whittling down their opponents with barrages of arrows - and, again, being skilled archers, they were devastatingly effective. This was particularly true when facing European armies which relied on formation engagements and melee. Once those formations were cut down and scattered, that's when the Mongols would engage in close-quarters combat. They were also logistical masters, being able to live off their surroundings and supplying enough horses to keep the army moving (and, as importantly, communicating). For starters, the army traveled light, lessening the burden of supplies. Furthermore, each soldier carried the tools necessary to hunt and survive off the land. Finding enough supplies was rarely a problem for Mongol armies. Lastly, but easily as important as everything else, the Mongols were adaptable and thoughtful planners. When they were confronted with siege warfare and walled cities - something not too common in the frozen steppes of Mongolia - they were fast to bring on foreign advisors and adapt technologies to their advantage. This integration of foreign advisors also helped them to understand the tactics of their enemies and build plans to exploit their weaknesses. They were masters of intelligence and communication, sending spies well in advance of the army (by some stories, embedding them with the refugees who fled their armies) and utilising sophisticated communications techniques on and off the battlefield.  In short, when people think of the Mongols, they think of a massive, unorganised mob that tore like hell across Asia and Europe. In fact, they were in every way but their equipment a modern army using smart tactics to their advantage. ",
            "date": "Answered June 23, 2014",
            "views": "231",
            "upvotes": " View 163 Upvoters",
            "upvoters": [
                {
                    "user_id": "Di Te",
                    "user_href": "/profile/Di-Te-4"
                },
                {
                    "user_id": "Usha N",
                    "user_href": "/profile/Usha-N-9"
                },
                {
                    "user_id": "Yixin Li",
                    "user_href": "/profile/Yixin-Li-2"
                },
                {
                    "user_id": "Nick Schutt",
                    "user_href": "/profile/Nick-Schutt"
                },
                {
                    "user_id": "Sumedh Khanolkar",
                    "user_href": "/profile/Sumedh-Khanolkar"
                },
                {
                    "user_id": "João",
                    "user_href": "/profile/João-158"
                },
                {
                    "user_id": "Alper Arıkan",
                    "user_href": "/profile/Alper-Arıkan"
                },
                {
                    "user_id": "Ray Dennis Davis",
                    "user_href": "/profile/Ray-Dennis-Davis"
                },
                {
                    "user_id": "Peter Chan",
                    "user_href": "/profile/Peter-Chan-5"
                },
                {
                    "user_id": "Isai Castaneda",
                    "user_href": "/profile/Isai-Castaneda-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Storey",
                "href": "/profile/Tom-Storey-3"
            },
            "answer_text": "Interesting how the key point is not present in the answers so far. Leadership. Genghis Khan was the primary reason for rapid, successful expansion. Anyone can challenge that conclusion to their heart's content, but, Genghis Khan took what the \"Mongol nation\" of his era had for assets and built the largest empire (by population) faster than anyone else in history. Others speak of tactics and methodologies which are available to ANY leader, Genghis Khan exploited each one beyond what any other empire builder has done since. In a way Napoleon mimicked his predecessor Genghis Khan who employed\"De L'audace, encore de l'audace, et toujours de l'audace.\" In the world of \"tactics and strategies\" this is the only one that matters.  In a broad sense, the above quote teaches us the core tactic employed by Genghis Khan and explains his success. (Remember we live in duality/polarity) The general who moves first with speed and force creates a \"reaction\" on the part of his opponent. Genghis Khan would achieve almost immediate advantage and retain it throughout a battle by putting the opposing forces into a \"reactive mode.\" Genghis Khan almost ALWAYS dictated battle conditions. Once your opponent is in a defensive/reactive mode you are in control. Once you are in control, without pause, you attack again and again until he surrenders. Obviously, Genghis Khan had the ability and assets to employ this core tactic.  Obviously, the fact that he possessed  the most advanced military weapon of his time (high speed, mobile, flexible, expertly lead cavalry) was a key factor.  He also knew that a rewards system and the \"tonic\" of repeated victories should be exploited for continued high speed expansion. These great \"Mongol assets\" would have remained latent without an extraordinary leader to exploit them. ",
            "date": "Answered October 25, 2014",
            "views": "48",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Waris Shah",
                    "user_href": "/profile/Waris-Shah-23"
                },
                {
                    "user_id": "Ray Dennis Davis",
                    "user_href": "/profile/Ray-Dennis-Davis"
                },
                {
                    "user_id": "Mandalia Hardy",
                    "user_href": "/profile/Mandalia-Hardy"
                },
                {
                    "user_id": "Narendra Badam",
                    "user_href": "/profile/Narendra-Badam"
                },
                {
                    "user_id": "Vivek Ramanathan",
                    "user_href": "/profile/Vivek-Ramanathan"
                },
                {
                    "user_id": "David Baldwin",
                    "user_href": "/profile/David-Baldwin-10"
                },
                {
                    "user_id": "Aditya Anaspure",
                    "user_href": "/profile/Aditya-Anaspure"
                },
                {
                    "user_id": "Brandon Wu",
                    "user_href": "/profile/Brandon-Wu-20"
                },
                {
                    "user_id": "Adrian Chow",
                    "user_href": "/profile/Adrian-Chow-6"
                },
                {
                    "user_id": "Abraham Buditama",
                    "user_href": "/profile/Abraham-Buditama"
                }
            ]
        }
    ]
}