{
    "title": "What if the Philippine Revolution happened earlier than when it was supposed to happen? How would it change the course of Philippine history? - Quora",
    "tags": [
        "Government of the Philippines",
        "History of the Philippines",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "The Philippines",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josh Avinante",
                "href": "/profile/Josh-Avinante-1"
            },
            "answer_text": "The Revolution had already began earlier as early as late 1700s with Luis Rodriguez Varela et al. In 1823, Andres Novales, a creole military officer, revolted but was crushed. Thes creole revolts are directly linked to 1872 (GomBurZa). We all know GomBurZa is directly linked to the ilustrado insurections and the Katipunan. There was no way it can happen earlier because the Philippine Revolution (and Latin American Revolutions) are directly linked to tge civil wars in Spain sparked by Napoleon. Had Napoleon not invaded Spain and install tge Bourbon Dynasty, there would be no liberals to revolt in Latin America and the Philippines. Spaniards, Latin Americans and Filipinos would remain royalists and used to theocracy. The Philippine Revolution was a creole revolt. That is why Rizal did not seek independence, he merely wanted reforms. Bonifacio, as a member of La Liga Filipina, did not seek independence either. It was only when the friars deported Rizal to Dapitan that radical elements of La Liga Filipina led by Bonifacio established Katipunan but this time to win independence by means of war. The royalists stalled too much on reforms. The Filipinos was fed up of being Spaniards under a king. There had been earlier revolts to 1896 but were not related to nationaĺism. During the British Invasion, Diego Silang allied himself with the enemy inezchange for Ilocandia independence with Diego Silang as king. Before that, there was also Francisco Dagohoy who was not after independence or against Spanish rule but had personal grudges against the government. There was the Tondo Conspiracy, the earliest revolt against the Spanish rule due to political grievances. However, the leader of this revolt, Agustin De Legaspi, was the grandson of Miguel Lopez de Legaspi or the first governor general of the Philippines. So the revolt was not really anti Spanish, it was due to political grievances or demand for more political power. Now, for the sake of argument that the Philippines won it's independence earlier, the answer depends kn the era. If they won in 1700s, America was still a British colony then so we would not have been an American colony. We would not be a trophy of the Spanish-American War. Philippines was syill a poor colony in 1700s, we would not invite any further immigration from Europe. If we won independence in early 1800s or if Andres Novales succeeded, we would have been a mestizo nation without US intervention. US was still a weak country in 1823. If they won independence in 1600s, let's say Agustin de Legaspi succeeded, the Lakans would have divided the archipelago into their kingdoms. There was no sense of nationhood yet that time. There was no French Revolution yet to enlighten Filipinos about nationhood. Lastly, had Rajah Sulayman won in 1565, obviously, the Philippines would remain as small kingdoms with only 100 huts each kingdom. With that size, the Portuguese or Dutch would have done what Legaspi did anyways. ",
            "date": "Answered May 14, 2020",
            "views": "160",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harvey Asuela",
                    "user_href": "/profile/Harvey-Asuela"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edgar Allan Alcazar",
                "href": "/profile/Edgar-Allan-Alcazar"
            },
            "answer_text": "I think it will only be considered as one of those revolts done by the natives against the Spaniards that failed. A similar large scale rebellion was done by Francisco Dagohoy was crushed although it took the Spaniards 85 years to do so. The only reason the Philippine revolution was somewhat successful is because of American involvement after the Spanish-American War. Without the Americans defeating the Spaniards I think the resources the Spaniards have is enough to defeat the revolution. It may take long before the Spaniards to defeat the Tagalogs but with Dagohoy's rebellion as reference. The revolution will be crushed. ",
            "date": "Answered May 9, 2020",
            "views": "81",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Belderol",
                    "user_href": "/profile/Mark-Belderol"
                },
                {
                    "user_id": "Hampus Cronander",
                    "user_href": "/profile/Hampus-Cronander"
                }
            ]
        }
    ]
}