{
    "title": "What stops a woman from becoming a scientist like Madame Curie? - Quora",
    "tags": [
        "Marie Curie (scientist)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pragya Pandey",
                "href": "/profile/Pragya-Pandey-1"
            },
            "answer_text": "This is such a beautiful question and i wonder what left it unanswered… A woman can be anything she wants to, same goes for a man, rather any human being. Unfortunately the societal bias,restrictions,norms specially for women stop them from achieving what they can, but can’t due to the shackles that are yet to be broken. I won’t say i am a feminist hence support women because i am a female myself, but it is the strength, the beauty of women , that can conquer the world.They have stupendous potential, yet there are ignominious and unwanted boundaries. Even in corporate world, most of them excel, but if the winsome yet serious maternity phase comes up, she’s treated like a burden.(Might sound offending, but this has happened). She is not revered in the same way like before. People look at her differently.It’s not just the baby, but even when she’s just gotten married and entered a new realm, she has too many responsibilities to shoulder and she has the tough job of juggling between her new relationships and her professional responsibilities. Now coming to the main part, Marie curie might have faced many impediments, but she was one resolute and intransigent woman. All women face hardships in some way or the other, but few give up/get used to and continue with the flow. And then there are those few,rarest of their kind, who refuse to give up, are ready to take up extra pressure, do more hard work than needed, and achieve the impossible despite millions of problems coming their way. What stops a woman from becoming what she can, is more than her surroundings, her heart. It stops her from following her dreams because she probably cares more about the dreams of her children. She stops herself from getting a foreseeable Nobel Prize because for her, the relationships in life are of more gravity and she cannot disregard them because she’s too scared of losing it. Her dilemmas, her fears stop her, not that she cannot, but she compromises with life and doesn’t become what she could have. Sad, but then you have real life examples of women, i have them too whom i call family. They are beautiful, they are strong and stalwart, they have faced too many deterrents yet are successful in whatever they chose for themselves. SO it depends on the woman, what she chooses. Her choice can change the world, her choice can make a family, her choice can raise her kids, her choice can satisfy her in-laws, and her choice can make her win a Nobel Prize along with other things too, only if she makes THE CHOICE! ",
            "date": "Updated November 22, 2016",
            "views": "439",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Semsema M",
                    "user_href": "/profile/Semsema-M"
                },
                {
                    "user_id": "Reema Kujur",
                    "user_href": "/profile/Reema-Kujur"
                },
                {
                    "user_id": "Anurag Kale",
                    "user_href": "/profile/Anurag-Kale"
                }
            ]
        }
    ]
}