{
    "title": "What food preservation methods were used in the 18th century? - Quora",
    "tags": [
        "History of Food",
        "Preservation",
        "The 18th Century",
        "Food Preservation",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Taife Thyaba",
                "href": "/profile/Taife-Thyaba"
            },
            "answer_text": "Knowing how to preserve food has been essential throughout our history as humans. Consider that before the advent of refrigeration, which was originally devised in the 18th century but was not perfected and widespread until the 20th century, most of civilization had to make do without refrigeration and freezing.  Many of these techniques are still in place today and are used for preserving the bounty of produce during the summer months. Here is a look at the most common ways of preserving food: Drying The most ancient food of preservation methods, drying is a great way of preserving herbs, fruits, vegetables and meats. Since the beginning of time people have let sun and nature take care of drawing moisture out of foods. This practice is used throughout the world. For example, Southern Italy is known for drying tomatoes while India is known for drying chilies, mangos and a host of spices.  To dry herbs, simply tie them together and hang in a sunny spot away from any humidity. To dry fruits or vegetables, set them out on a clean surface and keep them in the sun for a few weeks (this only works well in dry, warm climates). A more modern method of drying is to use an electric dehydrating machine. Salting Salting is a sub category of the drying method. The main difference here is that salt is added to products, mainly meat and fish, to draw out moisture. This lowers the bacteria content and makes food adaptable for later use. Adding salt to animal protein turns it into a bit leathery. Popular foods made in this tradition are beef jerky and dry salted cod. Canning In order to can foods, you need heat. The canning technique was developed by a French chemist during 1795 and was used to preserve food for Napoleon's army. Canning is a popular way of preserving fruits, vegetables and meats.  Both cans and glass jars are suitable for canning. The important thing will be to sterilize your recipients in simmering water for a few minutes (this includes lids). Then they will be ready to be filled with things like jam. After filling, place the lid on firmly but not too tight. To finalize the process lower the jars into a pot full of water, cover and bring to a boil. Process for about 10 minutes. Pull the jars out of the hot water and let cool. They will vacuum seal as they cool. Cooking times vary per recipe. Pickling The main difference between this category and canning is that you need two things for pickling: salt and acid. Pickling requires you soak your produce, most famously cucumbers, in a brine with salt. When they have pickled for the desired amount of time you transfer them to a jar full of vinegar. At this point you can use the canning method to produce a vacuum seal, if you wish. A bonus of pickling is that it does not change the texture too much. The vegetables undergo a fermentation process, which also results in a vitamin boost. Pickled vegetables are known for having an increased level of vitamin B6.  Freezing In the olden days, people would carry ice down from a neighboring mountain. Of course, now we use electric freezers to preserve our foods. Freezing changes the texture of most fruits and some vegetables but meats and fish fair well. In the summer time, you may want to freeze your berries so that you have them available for smoothies or baking later in the year. The best way to do this is freeze fruit in batches (the same method would apply to vegetables). For instance, scatter fresh berries on a baking tray and put it in the freezer. After they have frozen solid, put them in a bag. This will avoid clumps of berries that are impossible to separate without thawing. Source: finediningglovers ",
            "date": "Answered December 19, 2015",
            "views": "36",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Augustus Hanan Villarama Ramos",
                    "user_href": "/profile/Augustus-Hanan-Villarama-Ramos"
                },
                {
                    "user_id": "Doug Freyburger",
                    "user_href": "/profile/Doug-Freyburger"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fred Apstein",
                "href": "/profile/Fred-Apstein"
            },
            "answer_text": "Salting, sometimes combined with drying. Sometimes in barrels. Fish and meat drying without salt, especially meat and fruit Fermented vegetables like sauerkraut and kimchi,  Some aged meat dishes where the fat on top sealed out bacteria,  Fermented sausages like salami Freezing, in winter Eggs, dipped in wax or waterglass All kinds of dried herbs and spices Smoking, with or without brine dry cracker breads ",
            "date": "Answered December 12, 2015",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jane Price",
                    "user_href": "/profile/Jane-Price-7"
                }
            ]
        }
    ]
}