{
    "title": "What ideas and culture things did China copy from Tibet? - Quora",
    "tags": [
        "Tibet",
        "Asia",
        "Africa",
        "Australia",
        "Europe",
        "China",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Elliott",
                "href": "/profile/Peter-Elliott-29"
            },
            "answer_text": "That’s the China secret. Every part of China adds to the whole. When the Mongol horde conquered China the Chinese simply assimilated it. Used the bits that fitted and went on being China. Same with the parts they expanded into. They took on the parts of Tibet that worked for the Chinese way back in 1240 and ever since then it’s been a cultural mix. You’d be hard pressed to seperate what is Tibetan ideas and culture and what is China after 800 years of shared history. ",
            "date": "Answered October 23, 2020",
            "views": "937",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tem Arbora",
                    "user_href": "/profile/Tem-Arbora"
                },
                {
                    "user_id": "Run Ze Cao",
                    "user_href": "/profile/Run-Ze-Cao-2"
                },
                {
                    "user_id": "JJ Tam",
                    "user_href": "/profile/JJ-Tam-3"
                },
                {
                    "user_id": "Francis Ye",
                    "user_href": "/profile/Francis-Ye-2"
                },
                {
                    "user_id": "Peter Kaye",
                    "user_href": "/profile/Peter-Kaye-24"
                },
                {
                    "user_id": "H Lin",
                    "user_href": "/profile/H-Lin-19"
                },
                {
                    "user_id": "Annie Deford",
                    "user_href": "/profile/Annie-Deford"
                },
                {
                    "user_id": "Richard Kelly",
                    "user_href": "/profile/Richard-Kelly-223"
                },
                {
                    "user_id": "JL Shin (曾靖凌)",
                    "user_href": "/profile/JL-Shin-曾靖凌"
                },
                {
                    "user_id": "Alesand Omigar",
                    "user_href": "/profile/Alesand-Omigar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Guberman",
                "href": "/profile/Norman-Guberman"
            },
            "answer_text": "More like the other way around. China was an old mature civilization at the apogee of it's cultural development when it encountered the Tibetan barbarians back around 6th century CE. They paid tribute and sent a royal princess to Tibet and in the process began to introduce Chinese culture Around the same time, same deal with Nepal, who also paid tribute and sent princess. Although one princess was Chinese and the other of Indian culture, both were Buddhist Long story short, Tibet moved towards and would become the pre-eminent Buddhist country of Asia. But along the way, it would gravitate towards and finally fully embrace Indian Buddhism and Indian culture. And so China, which had started out as such a strong contender for the hearts and minds of Tibetans, took more of a back seat During the Mongol ascension of China, Tibet had more of a central role in Chinese culture. Certain Tibetan elements and rituals were introduced and remain to this day. However, it's my strong sense that they were never well received nor deeply embraced by the Chinese who considered them emblems of their oppression Indeed, Tibet is the indisputable inheritor of high Indian Buddhist culture, and is culturally quite distinct from China. There is an area where the two cultures do combine in Amdo in SW area of China. But it is an outlier ",
            "date": "Answered October 23, 2020",
            "views": "333",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ricky Sng",
                    "user_href": "/profile/Ricky-Sng"
                },
                {
                    "user_id": "Calvin Chik",
                    "user_href": "/profile/Calvin-Chik"
                },
                {
                    "user_id": "Sam Chhetry",
                    "user_href": "/profile/Sam-Chhetry-2"
                }
            ]
        }
    ]
}