{
    "title": "What are the contributions of Yakuza and Triad mafias play in participation during the Sino-Japanese war in WW2? - Quora",
    "tags": [
        "Second Sino-Japanese War",
        "Japan",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Li Jianxi 黎建熙",
                "href": "/profile/Li-Jianxi-黎建熙"
            },
            "answer_text": "During the attack on HK in December 1941, the Japanese use pro-Japanese gangsters in HK to help them as fifth columnist and guides during the invasion. They were of course paid handsomely and were awarded concession in gambling and opium trade after the defeating the British. They were call collectively Shengli you 胜利友。 They would be identify by a white arm band and shout the password or call sign “Shengli” (Victory) to communicate their presence. During the time between the arrival of the Imperial Japanese Army and the departure of the British Army - during this period of power vacuum they would rob the comnon people, extract protection money and rape and pillage without any concern. At the same time there were another group of gangsters. These were generally Pro-Chinese, patriotic gangsters who fight these pro-Japanese “traitors”. Admiral Chen, the one legged Chinese admiral who was in Hong Kong in Dec 1941 as the liaison officer between the Chinese nationalist government and the British in HK utilized these patriotic gangsters to combat these pro-Japanese gangsters. This division is common in all China. One group would be prepared to work with the Japanese and another group would be nationalistic and totally anti-Japanese. The Green Gang of Du Yue sheng (杜月笙）of Shanghai would be one of the more famous pro-China group of gangsters during the second sino japanese period. ",
            "date": "Answered July 12, 2017",
            "views": "502",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lin Xieyi",
                    "user_href": "/profile/Lin-Xieyi"
                },
                {
                    "user_id": "Mike Karp",
                    "user_href": "/profile/Mike-Karp-2"
                },
                {
                    "user_id": "Nor Iman Hiqal",
                    "user_href": "/profile/Nor-Iman-Hiqal"
                },
                {
                    "user_id": "Steven Zoraster",
                    "user_href": "/profile/Steven-Zoraster-1"
                },
                {
                    "user_id": "William Chang",
                    "user_href": "/profile/William-Chang-27"
                }
            ]
        }
    ]
}