{
    "title": "What if Yugoslavia never became communist? - Quora",
    "tags": [
        "Yugoslavia",
        "History of Europe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julien Philippe",
                "href": "/profile/Julien-Philippe-3"
            },
            "answer_text": "A2A, thanks Danijel What if Yugoslavia never became communist? For that, Partizans would have needed to be defeated in the first instance, and Yugoslavia not being liberated then by the Soviet Red Army but freed by the Serbs and other Yugolslavs with the help if the West. If Partizans were defeated by the Axis, Serbia, due to being the successor State of the Kingdom of Yugoslavia, who declared war on Nazi Germany, same as France did. would have after the allies victory been restored in its 1914 borders + Vojvodina and Bosnia, but minus Macedonia because the Serbs wouldn’t have been able to hold it vs Albanians, Greeks, and even Bulgarians claims due lack of manpower and diplomatic prestige. The Chetniks would have quickly turned coat for those who collaborated and rallied the resistance like the French did in France when Nazi Gemany was collapsing.If Partizans were defeated by the Chetniks, then the outcome would be similar, but with a strengthening of Serbian diplomatic position and a stronger position due to less losses and more “conscripts” in the liberated territories previously held by the Partizans, this leading to the realization of 1915 London Treaty Greater Serbia. And hence Makedonia would have been likely kept as well in the Kingdom, as well as Serbian Krajina, Slavonia and Dalmatia. North-Western Croatia and Slovenia being left alone for obvious reasons, Serbs taking Zagreb would have likely led to a abominable carnage after the Ustasa genocide perpetrated against Serbs, this critically damaging Serbian reputation. And Greater Serbia was never bound to expand there.But those 2 scenarii outcomes are unlikely. Without the Partizans seen as the time as staunch allies by Moscow, the Red Army would have entered in force in Yugoslavia to get a wide adriatic access through Albania, Montenegro, Dalmatia, and convert the country to communism, under Serbian widely cleansed leadership from its numerous anticommunists, instead of Tito’s and al. Up to the Serbs then to decide what to do with the Croats in Dalmatia and Slavonia, while the Slovenes and North-Western Croats would have quickly jumped in the West arms if they… had the time to do so in the West/USSR consecutive race for Zagreb, and were allowed to (and they would have been I guess, to block the Soviet expension). ",
            "date": "Updated May 14, 2018",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tanja Subotić",
                    "user_href": "/profile/Tanja-Subotić"
                },
                {
                    "user_id": "Darko Kovacevic",
                    "user_href": "/profile/Darko-Kovacevic-1"
                },
                {
                    "user_id": "Beth Morrison",
                    "user_href": "/profile/Beth-Morrison-8"
                },
                {
                    "user_id": "Zoran Milovanovic",
                    "user_href": "/profile/Zoran-Milovanovic-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Goran Mekota",
                "href": "/profile/Goran-Mekota-1"
            },
            "answer_text": "Would there be a Yugoslavia at all in that scenario? The pre WWII union and it’s power-structure dissolved, who knows what would happen without the communist-backed local resistance and how would the big powers manage the region. It might get under the Soviet influence and still be Communist but more of a puppet soviet regime and those were usually much worse than the ones in Yu. ",
            "date": "Answered August 6, 2016",
            "views": "728",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Khan Ubaid-ur-Rehman",
                    "user_href": "/profile/Khan-Ubaid-ur-Rehman"
                },
                {
                    "user_id": "Jacques Văn Khải",
                    "user_href": "/profile/Jacques-Văn-Khải"
                },
                {
                    "user_id": "Martin Racz",
                    "user_href": "/profile/Martin-Racz"
                }
            ]
        }
    ]
}