{
    "title": "What are the differences between the terms Hebrews, Jews, Israelites, and Israelis? - Quora",
    "tags": [
        "Judaism in Israel",
        "Religion in Israel",
        "Judaism",
        "Jewish Ethnicities and People",
        "Israel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Hill",
                "href": "/profile/Jon-Hill-70"
            },
            "answer_text": "Generally speaking, Hebrews, Jews, and Israelites are all the same, BUT: A Hebrew is technically a descendant of Abraham, although, since he was known as a Hebrew as early as Genesis 14:13, the appellation may predate him. There was a people in the region known as the Habiru (or Apiru) from the 18th to the 12th centuries BC that may be related. Regardless, in the Biblical and common context, Abraham is considered the first Hebrew. Here’s where it gets tricky: Jacob, upon his covenant with God, became known as “Israel”. He had 12 sons; those sons became the progenitors of the 12 tribes of Israel. Collectively, their descendants were known as Israelites. Geographically, they were separated into two “halves”, Judah, Benjamin, and Simeon occupied the southern part of “Israel” (in fact, the territory of Simeon was completely surrounded by Judah). The other 9 tribes occupied the northern part of Israel. After the period of the judges and under Saul and until the death of Solomon, the kingdom was united: One nation, under God, etc. But when Solomon died, the kingdom split into Israel and Judah. Benjamin and Simeon eventually became assimilated into Judah (they didn’t have a lot of choice), while the nine northern tribes retained the name Israel. This is extremely important, because when reading the prophets, there are often prophecies and/or judgments for/against Judah and ones for/against Israel. At other times, BOTH are meant. How do we know the difference? Well, the ones about Judah will mention Judah, the ones about Israel will mention Israel. If both are intended, usually Jacob or the sons of Jacob will be invoked (This can be tricky, though; for example, Isaiah 9:8 mentions Jacob/Israel, but it clearly just means Israel. This is made clear, though, by the context: “The Lord has sent a message against Jacob; it will fall on Israel. All the people will know it—Ephraim and the inhabitants of Samaria—” and further confirmed in vs 21: “Manasseh will feed on Ephraim, and Ephraim on Manasseh; together they will turn against Judah.”) Look at Jeremiah 3:6–11, “During the reign of King Josiah, the Lord said to me, ‘Have you seen what faithless Israel has done? She has gone up on every high hill and under every spreading tree and has committed adultery there. I thought that after she had done all this she would return to me but she did not, and her unfaithful sister Judah saw it. I gave faithless Israel her certificate of divorce and sent her away because of all her adulteries. Yet I saw that her unfaithful sister Judah had no fear; she also went out and committed adultery. Because Israel’s immorality mattered so little to her, she defiled the land and committed adultery with stone and wood. In spite of all this, her unfaithful sister Judah did not return to me with all her heart, but only in pretense,’ declares the Lord. “The Lord said to me, ‘Faithless Israel is more righteous than unfaithful Judah. Go, proclaim this message toward the north…’” He then pronounces judgement on Israel, which continues into chapter 4; but then he switches targets in 4:3–4, “This is what the Lord says to the people of Judah and to Jerusalem: ‘Break up your unplowed ground and do not sow among thorns. Circumcise yourselves to the Lord, circumcise your hearts, you people of Judah and inhabitants of Jerusalem, or my wrath will flare up and burn like fire because of the evil you have done— burn with no one to quench it.’” One reason all this is important is to distinguish between Israelites and Jews. Jews are literally the descendants of the tribe of JUDAH (Judea under Roman rule), with a few exceptions. So, all Israelites and Jews are Hebrews; all Jews are technically Israelites (they are descendants of Jacob, aka “Israel”); but, Israelites (northern kingdom) are NOT technically Jews. As a final note, the Apostle Paul personifies all of this: He is a Hebrew, “If someone else thinks they have reasons to put confidence in the flesh, I have more…a Hebrew of Hebrews…” (Philippians 3:4–5); an Israelite, tribe of Benjamin, same passage, plus…“I ask then: Did God reject his people? By no means! I am an Israelite myself, a descendant of Abraham, from the tribe of Benjamin.” (Romans 11:1); and he considers himself a Jew: “I am indeed a Jew, born in Tarsus of Cilicia, but brought up in this city [Jerusalem] at the feet of Gamaliel, taught according to the strictness of our fathers’ law, and was zealous toward God as you all are today.” (Acts 22:3) BUT, you might say, he was a Benjamite, not of the tribe of Judah. As mentioned earlier, the tribes of Benjamin and Simeon (and many Levites) were eventually assimilated into the tribe of Judah, becoming, for all intents and purposes, Jews. ",
            "date": "Updated April 7, 2019",
            "views": "257",
            "upvotes": " View 68 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Javier Nunez",
                    "user_href": "/profile/Javier-Nunez-3"
                },
                {
                    "user_id": "Crodiegotaim",
                    "user_href": "/profile/Crodiegotaim"
                },
                {
                    "user_id": "Ruth Elias",
                    "user_href": "/profile/Ruth-Elias-12"
                },
                {
                    "user_id": "Oma Reaves",
                    "user_href": "/profile/Oma-Reaves"
                },
                {
                    "user_id": "April Carpenter",
                    "user_href": "/profile/April-Carpenter-10"
                },
                {
                    "user_id": "Robert Anthony Ramos",
                    "user_href": "/profile/Robert-Anthony-Ramos"
                },
                {
                    "user_id": "Rameshraj B",
                    "user_href": "/profile/Rameshraj-B"
                },
                {
                    "user_id": "Hannah Storr",
                    "user_href": "/profile/Hannah-Storr"
                },
                {
                    "user_id": "Rob Davis",
                    "user_href": "/profile/Rob-Davis-376"
                },
                {
                    "user_id": "Ari Einat",
                    "user_href": "/profile/Ari-Einat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angelus Pascal",
                "href": "/profile/Angelus-Pascal-1"
            },
            "answer_text": "The Descendants chart below gives the outline of those terms; as detailed below:  Hebrews start with Eber. All the descendants of Eber were or rather are called Hebrews. This means all the descendants of Peleg, many of whom are not mentioned in the Scriptures (I believe), and all the descendants of Joktan (from those listed and their later generations) are the Hebrews. The descendants of Joktan are known to be the ancient Arabs; so yes the ancient Arabs were indeed Hebrews too. Israelites precisely starts with Jacob. It was Jacob who was named Israel (Genesis 32:28), hence his descendants thereafter became to be the Israelites; even though some people consider Israelites started with Abraham! The Israelites therefore are all the descendants of Jacob (Israel) - the 12 tribes of Israel and their descendants; and they are part of the Hebrews. Later the 12 tribes of Israel were divided into two kingdoms, the Kingdom of Israel or Ephraim (with 10 tribes) in the north and the Kingdom of Judah (with two tribes - Judah and Benjamin) in the south. Out of the Kingdom of Judah, came the Pharisees; which were a social movement and a school of thought. Pharisaic beliefs became the foundational, liturgical and ritualistic basis for Rabbinic Judaism. Therefore, in summary: the Pharisees were a small part of Judahites or Judeans (the inhabitants of the Kingdom of Judah), the Judahites on the other hand were the descendants of the two tribes of Israel, which in turn, were or rather are the wider part of the Israelites and Hebrews. All of those detailed above so far trace back their origin to Shem, hence they are all Semitic. The Jews, on the other hand is an ethnoreligious group, practicing Judaism, as defined above; which means it does not equate to being the whole of Israelites or the whole of Hebrews. Being one of the world’s major religions, it means anyone who wishes to convert to it, can do so easily (I believe), even though the majority of its followers, from the ancient time (circa: 8th century CE), have been the Ashkenazi Jews; who trace back their origin from their ancestor Ashkenaz, the son of Gomer, the son of Japheth - making them precisely to be Japhethitic or Japhetic. See the Descendants map.  Here is a biblical narrative of the ancient (original) Ashkenazi Jews in antiquity. Genesis 10:1-5: {10:1} These are the generations of the sons of Noah: Shem, Ham, and Japheth, and of the sons who were born to them after the great flood. {10:2} The sons of Japheth were Gomer, and Magog, and Madai, and Javan, and Tubal, and Meshech, and Tiras. {10:3} And then the sons of Gomer were Ashkenaz, and Riphath, and Togarmah. {10:4} And the sons of Javan were Elishah, and Tarshish, Kittim, and Rodanim. {10:5} By these were the isles of the Gentiles divided in their lands; every one after his tongue, after their families, in their nations. Lastly, the Israelis are of course the citizens of the country of Israel; who could be blacks, whites, Arabs, etc. ",
            "date": "Updated October 27, 2020",
            "views": "2",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oma Reaves",
                    "user_href": "/profile/Oma-Reaves"
                },
                {
                    "user_id": "James Johnson",
                    "user_href": "/profile/James-Johnson-294"
                }
            ]
        }
    ]
}