{
    "title": "What did computer people do before computers were invented? - Quora",
    "tags": [
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Crosley",
                "href": "/profile/Tom-Crosley-1"
            },
            "answer_text": "By “computer people”, I am answering this from a hardware perspective, and talking about what electrical engineers who now design digital logic circuits did before there were computers. They designed telephone switches. After Alexander Bell invented the telephone in 1876, and both private individuals and business started acquiring telephones, when someone wanted to make a local call, it went through an operator (“Number please”), who would connect your line up to the destination via a manual switchboard. In 1891 Alan Strowger, an undertaker, was motivated to invent an automatic telephone exchange after having difficulties with the local telephone operators, one of whom was the wife of a competitor. Strowger was convinced that she was sending calls meant for him to her husband instead. Thus began automatic telephony. Phones were equipped with dials that would send pulses to a central office that would result in one subscriber’s line being connected to another. The Strowger Automatic Telephone Exchange Company eventually became the Automatic Electric Company, part of the independent General Telephone System, where I worked for several years starting in 1969, helping develop their first electronic telephone exchange. But I’m getting ahead of myself. The Strowger switch, or step-by-step switch as it was generically called, was followed by the Bell System’s panel switch, and then crossbar switches. All three of these used electromechanical relays as their switching devices, even after vacuum tubes had been invented, because the latter were too unreliable (which led to Bell Lab’s invention of the transistor in 1947 as a substitute). Crossbar switches have now been replaced by electronic switches operated by computers. George Boole set forth his rules for what would become known as Boolean Algebra in his first book The Mathematical Analysis of Logic (1847). Boolean algebra is the branch of algebra in which the values of the variables are True and False, usually denoted 1 and 0 respectively. This is why almost all computers operate using binary arithmetic. The three basic logic operations are AND, OR, and NOT. Each of these operations could be performed by telephone relays. A relay has an electromagnet, which when energized, causes one or more electrical contacts to close (or in sometime open). These contacts then can be used in combination to operate other relays. In the diagram below, the contacts A and B are other relays. The first illustrates an AND gate, and the second, an OR gate.A NOT gate is implemented in a relay when a contact is normally closed and opens when the relay is energized.  So telephone engineers were designing logic circuits as part of telephone exchanges long before computers were ever built (and the world first programmable digital computer, the Z3, completed in 1941 was itself made up of 2600 relays). ",
            "date": "Answered June 17, 2018",
            "views": "44",
            "upvotes": " View 53 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhrunad Joshi",
                    "user_href": "/profile/Dhrunad-Joshi"
                },
                {
                    "user_id": "Sumudu Lakmal",
                    "user_href": "/profile/Sumudu-Lakmal"
                },
                {
                    "user_id": "Kosmas Raptis",
                    "user_href": "/profile/Kosmas-Raptis"
                },
                {
                    "user_id": "Dovi Cowan",
                    "user_href": "/profile/Dovi-Cowan"
                },
                {
                    "user_id": "Jiawei Ouyang",
                    "user_href": "/profile/Jiawei-Ouyang"
                },
                {
                    "user_id": "Winston Chen",
                    "user_href": "/profile/Winston-Chen-3"
                },
                {
                    "user_id": "Robert H. Heath",
                    "user_href": "/profile/Robert-H.-Heath"
                },
                {
                    "user_id": "Martin Hauser",
                    "user_href": "/profile/Martin-Hauser"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                },
                {
                    "user_id": "Anthony Becker",
                    "user_href": "/profile/Anthony-Becker-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Wilsbacher",
                "href": "/profile/Jeff-Wilsbacher"
            },
            "answer_text": "Ham radio hobbyists.They went to planetariums.They had model railroad or slot carsThey played tabletop war gamesThey read too much Lovecraft or Howard or Sherlock Holmes or Arthur C Clark or Asimov.They joined clubs/lodges and professional organizations and worked with fellow members to solve problems in their field.Chess, lots of chessModel rocketryPulp fiction (not the movie, actual pulp fiction)Read ancient sagas in icelandic or old norse",
            "date": "Answered June 17, 2018",
            "views": "206",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amey Tambe",
                    "user_href": "/profile/Amey-Tambe-1"
                },
                {
                    "user_id": "Andrew Daviel",
                    "user_href": "/profile/Andrew-Daviel"
                }
            ]
        }
    ]
}