{
    "title": "What is the origin of the phrase 'People of colour'? Which people does it refer to? - Quora",
    "tags": [
        "Phrase Origins",
        "Colors (vision)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Markus Rauscher",
                "href": "/profile/Markus-Rauscher-1"
            },
            "answer_text": "In 1748, the Swedish natural scientist Carl von Linné classified people into four categories, according to their skin colour. His division is based on Aristotle’s concept of skin colours, which refers to the four humores, i.e. body liquids (a very modern concept of contemporary medicine at that time): blood (red), phlegm (white), yellow bile (yellow) and black bile (black). According to Aristotle, people’s characters were based on the surplus of the respective liquid: If you suffered from too much blood in your body, you were a “sanguine person” (sanguis is the Latin word for “blood”)Too much phlegm meant you were a phlegmatic person (phlegma is the Greek word for phlegm or mucus)In case you were diagnosed with an abundance of yellow bile, you were supposed to be a chloreic person (cholera being the Greek word for anger)If you possibly had too much black bile in your body, you were called a melancholic person (melanos = Greek for black, cholera being the Greek word for anger)Due to these colours, Linné e.g. attributed the red color to Native Americans since he considered their temperament to be “fiery” / “fierce”. It was only in the colonial times that skin colours were considered not to express the basic character of a person; instead, these colours were used in a racist way: for the colonialists, white skin colour was synonymous with superiority as you can see in many works of literature (Rudyard Kipling, H. Rider Haggard; The Boy’s Own Paper; Boys of our Empire; The Strange Tale of Ten Little Nigger Boys and many more to kindle the boys’ adventure spirit):  From today’s point-of-view, racist stereotypes in (children’s) literature seem strange and despicable but as so often things have to be seen and judged in their contemporary context. I’m not saying that it was OK to be racist but it was a very wide-spread phenomenon all over the Western world. The term \"person of color\" or “people of color” is used primarily in the US to describe any non-white person, emphasizing common experiences of systemic racism. Person of color was originally equivalent in use to the term \"colored\", but usage of the appellation \"colored\" in the American South gradually came to be restricted to \"negroes\". ",
            "date": "Answered July 26, 2017",
            "views": "216",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jan Fargo",
                    "user_href": "/profile/Jan-Fargo-1"
                },
                {
                    "user_id": "Eduardo G P Fox",
                    "user_href": "/profile/Eduardo-G-P-Fox"
                },
                {
                    "user_id": "Don Mckimm",
                    "user_href": "/profile/Don-Mckimm"
                },
                {
                    "user_id": "Marlene Dublinsky",
                    "user_href": "/profile/Marlene-Dublinsky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marlene Dublinsky",
                "href": "/profile/Marlene-Dublinsky"
            },
            "answer_text": "I really don't know. I guess white is not considered color because when people say “people of color” they especially seem to be referring to African Americans. African Americans have many shades of skin color, is so they would be of color, particularly more than one. I sometimes use the term respectfully instead of saying African American. Because there are people of color that are not necessarily African Americans. Some are directly from Africa or the Islands. I suppose there are a number of ways to refer to people. There's whites or Caucasians. There are different ways to refer to people but most of all, I just don't want to use the wrong term. ",
            "date": "Answered July 26, 2017",
            "views": "44",
            "upvotes": "0"
        }
    ]
}