{
    "title": "What are the sources of history? - Quora",
    "tags": [
        "Sources",
        "Educational Resources"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jayesh Yekala",
                "href": "/profile/Jayesh-Yekala"
            },
            "answer_text": "I To my knowledge there are 5 sources for credible and reasonably accurate history. Books written by the court scribes and other records (obviously). These are comparatively easy to analyse although substantial amount of background and conceptual knowledge is required. For example trade records from Egypt and Rome revealed a lot about Mesopotamia, Indus Valley as the scripts found on the seals and records at Indus Valley till now were not deciphered. So records half a world away helped us to gain what little knowledge we have now. Also books like ‘Harshacharitam’ which are biographies of kings, religious commentaries etc can give a lot of knowledge.Legends and folklore. These are passed orally or written sometimes. The history of Vikings was not adequately recorded when they were the legendary seamen and raiders. They were passed from one generation to another orally as series of stories called sagas. Most of the times these folklores are exaggerated and contain supernatural aspects. But they give us the overall story.Archaeological findings. There are instances when people found bones in their backyard and it turned out that they are living in a place where a thousand years ago a bloody battle took place. Also objects like pottery (like the ones found in Greece) weapons, coins etc shed light on how people lived then. Remember Indiana Jones?Paintings and drawings. Like hieroglyphics of Egypt, they are both a language and art.Anthropology and sociology can also help in understanding history. Although I don't have much knowledge about these two subjects but I have learned that comparative studies have revealed a lot. For example a study of linguistics, geography and culture have given many theories on migration.",
            "date": "Updated May 1, 2020",
            "views": "337",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yadanar Win",
                    "user_href": "/profile/Yadanar-Win-9"
                },
                {
                    "user_id": "Sonam Doelkar",
                    "user_href": "/profile/Sonam-Doelkar"
                },
                {
                    "user_id": "Anshula Agnihotri",
                    "user_href": "/profile/Anshula-Agnihotri-2"
                },
                {
                    "user_id": "Adityanarayan Sharma",
                    "user_href": "/profile/Adityanarayan-Sharma"
                },
                {
                    "user_id": "VisHal SekHar",
                    "user_href": "/profile/VisHal-SekHar-3"
                },
                {
                    "user_id": "Neilmar Gonzales",
                    "user_href": "/profile/Neilmar-Gonzales"
                },
                {
                    "user_id": "Md Zeba",
                    "user_href": "/profile/Md-Zeba-1"
                },
                {
                    "user_id": "Subhashree Priyadarshini",
                    "user_href": "/profile/Subhashree-Priyadarshini-25"
                },
                {
                    "user_id": "Lynell Anas",
                    "user_href": "/profile/Lynell-Anas"
                },
                {
                    "user_id": "Waiswa Nicholas",
                    "user_href": "/profile/Waiswa-Nicholas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Coomber",
                "href": "/profile/Rob-Coomber"
            },
            "answer_text": "Nothing is older than the Old testament of the Bible and the Torah. All prophecy has come true to date. The good seed of Abraham, the bad seed of the slave and the stump of Jesse from the line of king David. Everyone loves being respected and would rather not fight. Which is the way of heavenly law. Matthew 22:36-40 New International Version 36 “Teacher, which is the greatest commandment in the Law?” 37 Jesus replied: “‘Love the Lord your God with all your heart and with all your soul and with all your mind.’[a] 38 This is the first and greatest commandment. 39 And the second is like it: ‘Love your neighbor as yourself.’[b] 40 All the Law and the Prophets hang on these two commandments.” Now we await the final scene told in Revelation 20 4 I saw thrones on which were seated those who had been given authority to judge. And I saw the souls of those who had been beheaded because of their testimony about Jesus and because of the word of God. They[a] had not worshiped the beast or its image and had not received its mark on their foreheads or their hands. They came to life and reigned with Christ a thousand years. 5 (The rest of the dead did not come to life until the thousand years were ended.) This is the first resurrection. 6 Blessed and holy are those who share in the first resurrection. The second death has no power over them, but they will be priests of God and of Christ and will reign with him for a thousand years.. Revelation 22 Epilogue: Invitation and Warning 12 “Look, I am coming soon! My reward is with me, and I will give to each person according to what they have done. 13 I am the Alpha and the Omega, the First and the Last, the Beginning and the End. 14 “Blessed are those who wash their robes, that they may have the right to the tree of life and may go through the gates into the city. 15 Outside are the dogs, those who practice magic arts, the sexually immoral, the murderers, the idolaters and everyone who loves and practices falsehood. 16 “I, Jesus, have sent my angel to give you[a] this testimony for the churches. I am the Root and the Offspring of David, and the bright Morning Star.” 17 The Spirit and the bride say, “Come!” And let the one who hears say, “Come!” Let the one who is thirsty come; and let the one who wishes take the free gift of the water of life. 18 I warn everyone who hears the words of the prophecy of this scroll: If anyone adds anything to them, God will add to that person the plagues described in this scroll. 19 And if anyone takes words away from this scroll of prophecy, God will take away from that person any share in the tree of life and in the Holy City, which are described in this scroll. 20 He who testifies to these things says, “Yes, I am coming soon.” Amen. Come, Lord Jesus. 21 The grace of the Lord Jesus be with God’s people. Amen. Matthew 24 is Jesus telling His disciples signs of the end times. Jesus prophesies the destruction of the temple after the Pharisees desecrated the grounds by doing business there The Destruction of the Temple and Signs of the End Times 24 Jesus left the temple and was walking away when his disciples came up to him to call his attention to its buildings. 2 “Do you see all these things?” he asked. “Truly I tell you, not one stone here will be left on another; every one will be thrown down.” 3 As Jesus was sitting on the Mount of Olives, the disciples came to him privately. “Tell us,” they said, “when will this happen, and what will be the sign of your coming and of the end of the age?” 4 Jesus answered: “Watch out that no one deceives you. 5 For many will come in my name, claiming, ‘I am the Messiah,’ and will deceive many. 6 You will hear of wars and rumors of wars, but see to it that you are not alarmed. Such things must happen, but the end is still to come. 7 Nation will rise against nation, and kingdom against kingdom. There will be famines and earthquakes in various places. 8 All these are the beginning of birth pains. 9 “Then you will be handed over to be persecuted and put to death, and you will be hated by all nations because of me. 10 At that time many will turn away from the faith and will betray and hate each other, 11 and many false prophets will appear and deceive many people. 12 Because of the increase of wickedness, the love of most will grow cold, 13 but the one who stands firm to the end will be saved. 14 And this gospel of the kingdom will be preached in the whole world as a testimony to all nations, and then the end will come. 15 “So when you see standing in the holy place ‘the abomination that causes desolation,’[a] spoken of through the prophet Daniel—let the reader understand— 16 then let those who are in Judea flee to the mountains. 17 Let no one on the housetop go down to take anything out of the house. 18 Let no one in the field go back to get their cloak. 19 How dreadful it will be in those days for pregnant women and nursing mothers! 20 Pray that your flight will not take place in winter or on the Sabbath. 21 For then there will be great distress, unequaled from the beginning of the world until now—and never to be equaled again. 22 “If those days had not been cut short, no one would survive, but for the sake of the elect those days will be shortened. 23 At that time if anyone says to you, ‘Look, here is the Messiah!’ or, ‘There he is!’ do not believe it. 24 For false messiahs and false prophets will appear and perform great signs and wonders to deceive, if possible, even the elect. 25 See, I have told you ahead of time. 26 “So if anyone tells you, ‘There he is, out in the wilderness,’ do not go out; or, ‘Here he is, in the inner rooms,’ do not believe it. 27 For as lightning that comes from the east is visible even in the west, so will be the coming of the Son of Man. 28 Wherever there is a carcass, there the vultures will gather. 29 “Immediately after the distress of those days “‘the sun will be darkened, and the moon will not give its light;the stars will fall from the sky, and the heavenly bodies will be shaken.’[b] 30 “Then will appear the sign of the Son of Man in heaven. And then all the peoples of the earth[c] will mourn when they see the Son of Man coming on the clouds of heaven, with power and great glory.[d] 31 And he will send his angels with a loud trumpet call, and they will gather his elect from the four winds, from one end of the heavens to the other. 32 “Now learn this lesson from the fig tree: As soon as its twigs get tender and its leaves come out, you know that summer is near. 33 Even so, when you see all these things, you know that it[e] is near, right at the door. 34 Truly I tell you, this generation will certainly not pass away until all these things have happened. 35 Heaven and earth will pass away, but my words will never pass away. The Day and Hour Unknown 36 “But about that day or hour no one knows, not even the angels in heaven, nor the Son,[f] but only the Father. 37 As it was in the days of Noah, so it will be at the coming of the Son of Man. 38 For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark; 39 and they knew nothing about what would happen until the flood came and took them all away. That is how it will be at the coming of the Son of Man. 40 Two men will be in the field; one will be taken and the other left. 41 Two women will be grinding with a hand mill; one will be taken and the other left. 42 “Therefore keep watch, because you do not know on what day your Lord will come. 43 But understand this: If the owner of the house had known at what time of night the thief was coming, he would have kept watch and would not have let his house be broken into. 44 So you also must be ready, because the Son of Man will come at an hour when you do not expect him. 45 “Who then is the faithful and wise servant, whom the master has put in charge of the servants in his household to give them their food at the proper time? 46 It will be good for that servant whose master finds him doing so when he returns. 47 Truly I tell you, he will put him in charge of all his possessions. 48 But suppose that servant is wicked and says to himself, ‘My master is staying away a long time,’ 49 and he then begins to beat his fellow servants and to eat and drink with drunkards. 50 The master of that servant will come on a day when he does not expect him and at an hour he is not aware of. 51 He will cut him to pieces and assign him a place with the hypocrites, where there will be weeping and gnashing of teeth. ",
            "date": "Answered September 30, 2020",
            "views": "382",
            "upvotes": " Answer requested by Leisa Ilas"
        }
    ]
}