{
    "title": "What are the current trends in the energy sector for the world, especially in the renewable sector? - Quora",
    "tags": [
        "Energy Sector",
        "Clean Technology",
        "Renewable Energy",
        "Solar Energy",
        "Trends",
        "Sustainable Technology",
        "Alternative Energy",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Roane",
                "href": "/profile/Jerry-Roane"
            },
            "answer_text": "The latest trend in energy is that vehicles will move off of oil and go to photovoltaic solar power mounted to the infrastructure of transportation. This abandonment of oil as something to burn will reduce air pollution by 1/3rd. The other trend is economies of scale will kick in for the production of PV solar cells as they will follow the semiconductor price curve and the current price of $.015671 per kilowatt-hour will drop even further. Gravity storage of energy similar to pumped hydro but more efficient will fill the nighttime gap in energy and home owners will no longer be saddled with paying off a monopoly for their daily electricity. The sun’s radiation will come to match the home energy needs through improvements in both supply and demand. The DOE has this information and their official response was “discouraged” but they really should stop pandering to coal investors and move into this next century for each individual’s energy needs. The problem with the transition to HEFF is “jobs” will need to transition to other more interesting things and the power monopoly must find something else to do that is productive. If you care call the DOE and ask them what the hey. 3D tracking the sun will aid PV solar in obsoleting oil for transportation. Elevated guideway and aerodynamic dual mode electric vehicles will enable this. ",
            "date": "Answered February 8, 2020",
            "views": "26",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Charlie Richmond",
                    "user_href": "/profile/Charlie-Richmond-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Smith",
                "href": "/profile/Paul-Smith-1636"
            },
            "answer_text": "We have the data and studies to show that renewable energy, presently in the form of solar and wind energy, will be the future. They are not the sole technologies needed. They will be assisted by better home insulation tech, electricity storage and improved efficiency. Electrification is growing fast. Last year fossil fuel vehicle sales in Germany dropped 15% while electric vehicle sales climbed to 3.5% In 2020 EV sales are projected to reach 5%. That is fast growth and increasing at exponential rate. The story in the U.K is even better. Globally fossil fueled vehicle sales are down 4.7% in 2019 alone. That is amazingly fast. ",
            "date": "Answered February 8, 2020",
            "views": "11",
            "upvotes": "0"
        }
    ]
}