{
    "title": "What countries are no longer democracies? - Quora",
    "tags": [
        "Politics and Government",
        "Country Comparisons",
        "Political Science",
        "Democracy",
        "Government",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeremy Samuel",
                "href": "/profile/Jeremy-Samuel-17"
            },
            "answer_text": "There are several countries in the world that once had free and fair elections but are now clear-cut authoritarian systems ruled by the people who had once electorally triumphed. I think the clearest example of a country that was democratic but is now authoritarian is Venezuela, where Hugo Chavez was actually elected in a free and fair election in 1999, but established an authoritarian revolutionary state with a cult of personality around the leader. However, political pluralism was never completely stamped out, hence parliament is against Maduro.  Turkey is another example too, although Turkey was never fully consolidated as a democracy. I do NOT consider Hungary to be authoritarian. Hungary should be considered an “illiberal democracy.”  Hungary has a multi-party system, it allows public protests, and Orban is actually very popular. His party Fidesz, won a huge victory in the last parliamentary election in 2018. Given that Hungary allows criticism of the government, it allows other parties to compete for power, and it has public support, I don’t think it should be categorized in the same context as governments that monopolize the public space, aggressively clamp down on dissent, and aren’t seen as legitimate by their own populations.  No, I’m not Hungarian and have no interest in defending Orban. But to use the same word for Hungary that is used for Arab states, Cuba, China, Vietnam etc is nonsense. Hungary’s political system is much freer. ",
            "date": "Answered June 17, 2019",
            "views": "347",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joyfacedown",
                    "user_href": "/profile/Joyfacedown"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mian Hunain Amin",
                "href": "/profile/Mian-Hunain-Amin-1"
            },
            "answer_text": "Democracy isnt the name of conducting so called elections to show the world. its actually the name of the spirit where you respect other people’s view even if you dont agree. I’d say iNDIA is no longer a democracy because under the current regime of Modi, its become a very authoritarian, fascist country, Where people are being murdered for being Non vegetarian, YES ITS TRUE.. You can be killed by a govt funded / supported militia called “ Gau rakshaks” means COW PROTECTORS, merely for eating beef. According to the Human rights watch, india’s extremist hindu govt is targeting Non hindus and iNDIA is unsafe for you if you are: WomanLow caste Hindu; or aNon Hindu.Violent Cow Protection in India | Vigilante Groups Attack Minorities ",
            "date": "Answered June 17, 2019",
            "views": "148",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Khalid Khan",
                    "user_href": "/profile/Khalid-Khan-725"
                }
            ]
        }
    ]
}