{
    "title": "What is the oldest known computer? - Quora",
    "tags": [
        "History of Technology",
        "Oldest",
        "Ancient History",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ernest W. Adams",
                "href": "/profile/Ernest-W-Adams"
            },
            "answer_text": "There are many kinds of computers. The oldest known analog calculating device is probably the Antikythera mechanism, which dates to about 100 BC. It was a single-purpose device for predicting astronomical events, and used gears. The astrolabe was invented around the same time, and was used for solving navigation problems. The first general purpose calculating machine was probably Pascal's calculator, built in 1642. It could do addition and subtraction and was operated by hand. The first programmable computing machine was the Analytical Engine, designed (but never built) by Charles Babbage in 1837. Ada King, Countess of Lovelace, wrote the first program for it. The Analytical Engine was the first device we would regard as a computer today, because it had a memory for storing variables and could accept a sequence of instructions, including conditional branching and loops. ",
            "date": "Answered March 5, 2019",
            "views": "13",
            "upvotes": " View 37 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                },
                {
                    "user_id": "Victor Gao",
                    "user_href": "/profile/Victor-Gao-4"
                },
                {
                    "user_id": "Michael Baker",
                    "user_href": "/profile/Michael-Baker-457"
                },
                {
                    "user_id": "Jerry Mc Kenna",
                    "user_href": "/profile/Jerry-Mc-Kenna"
                },
                {
                    "user_id": "Manolo Okkema",
                    "user_href": "/profile/Manolo-Okkema"
                },
                {
                    "user_id": "Aj Terno",
                    "user_href": "/profile/Aj-Terno-1"
                },
                {
                    "user_id": "Cecilia Bexander",
                    "user_href": "/profile/Cecilia-Bexander"
                },
                {
                    "user_id": "Ethan Jones",
                    "user_href": "/profile/Ethan-Jones-406"
                },
                {
                    "user_id": "Michael Jagger",
                    "user_href": "/profile/Michael-Jagger-1"
                },
                {
                    "user_id": "Göran Lovén",
                    "user_href": "/profile/Göran-Lovén"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernie Jurick",
                "href": "/profile/Ernie-Jurick"
            },
            "answer_text": "The very earliest known computer was the Sumerian abacus, a counting/calculating table of successive columns which allowed counters to be slid among the successive orders of magnitude of their sexagesimal (base 60) number system. It was in common use from around 2600 BCE. In the hands of a skilled operator it, like the more familiar counting-frame abacus could do the kinds of calculations used by merchants and Sumerian astrologers/astronomers.  The Sumerians also used pre-stamped hand-held clay tablets for powers and roots. This is from a classroom: YBC 7289 - Wikipedia ",
            "date": "Answered March 5, 2019",
            "views": "210",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adyn Brenden",
                    "user_href": "/profile/Adyn-Brenden"
                },
                {
                    "user_id": "Varun Anand",
                    "user_href": "/profile/Varun-Anand-28"
                }
            ]
        }
    ]
}