{
    "title": "What happened with the Native Americans? - Quora",
    "tags": [
        "Native American History",
        "Native Americans",
        "American Ethnicity and People",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Thomas",
                "href": "/profile/David-Thomas-735"
            },
            "answer_text": "Diseases, massacres, battles, migration, forced resettlement, enslavement and slavery, confiscation of land, discovery of gold and silver, alcohol (fire water) and drunkenness, broken treaties, cruelty and starvation have reduced many tribes of Natives. Manipulation, deception, deceit and lies weighed heavily against the Natives. Dictates of government have confiscated many of their children. They were legally kidnapped and forced helplessly to live in the homes of white people. The tribes were helpless to reclaim their children. Many years ago, government had enforced deforestation upon their lands. The destruction of trees (timber) altered their way of life in the woodlands. The tribes have endeavoured to persevere and endure under deplorable conditions administered by government. ",
            "date": "Answered May 27, 2020",
            "views": "60",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Johnson",
                    "user_href": "/profile/Aaron-Johnson-155"
                },
                {
                    "user_id": "Rene Rincon",
                    "user_href": "/profile/Rene-Rincon-1"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                },
                {
                    "user_id": "Richard Morris",
                    "user_href": "/profile/Richard-Morris-158"
                },
                {
                    "user_id": "Mario Guerra",
                    "user_href": "/profile/Mario-Guerra-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Mangum",
                "href": "/profile/Geoff-Mangum"
            },
            "answer_text": "Their population was lowest around 1900 and is today around 1% of 320 million Americans. Out west there are tribes and reservations and members not on the reservations. The eastern tribes are largely small remnants overcome before the existence of the American federal government (1781 end of Revolution; 1791 formation of 1st federal government), who today are recognized mostly by states and are seeking administrative recognition by the federal government. ",
            "date": "Answered May 12, 2019",
            "views": "51",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aaron Johnson",
                    "user_href": "/profile/Aaron-Johnson-155"
                }
            ]
        }
    ]
}