{
    "title": "What did the ancient Greeks think of the Macedonians? - Quora",
    "tags": [
        "Greek Macedonians",
        "Ancient Macedonian Empire",
        "Ancient Greece",
        "Greece"
    ],
    "response": [
        {
            "author_info": {
                "name": "Miltiades Bolaris",
                "href": "/profile/Miltiades-Bolaris"
            },
            "answer_text": "The question needs clarification. We need to start by stating that A. The ancient Macedonians were a Greek kingdom and the Macedonians were Greek in language, religion and culture. There were also Thracians and Paeonians living in the kingdom as well as Ionian Greek colonists from the islands but the political control was in the Macedonian landed elite and its royal family. B. The modern Yugoslav Macedonians are a multinational nation, Slavic and Albanian by majority in language and culture and Christian or Muslim in Religion. Modern Greek Macedonians are Greek in language and culture and Christian in religion. The Slavic speaking Macedonians are ethnically Slavomacedonians. What did the southern Greeks think of the Macedonians? Initially as brutish goat herders (which they were). The old Macedonian capital was Aigai, Greek for: ”Goatown”! Increasingly after the Persian wars The kings of Macedonia adopted more and more of the Attic high culture, building theaters To attend Greek drama you needed to know perfect Greek, inviting the most philosophers and writers and artists from around the Hellenic world so by the middle of the 4th c BC Macedonia had nothing to be shamed off, culturally. By the 3rd cBC the wealth accumulated in Macedonia made her the envy of the world and by then the dialects of Greece were in decline since a new common Greek appeared, the Hellenistic or Alexandria Coene, an amalgam of Attic and Macedonians Greeks. When St Paul visits Macedonia he speaks of the population as Greeks, no different than in Corinth, Athens, Cyprus or Smyrna. ",
            "date": "Updated October 15, 2018",
            "views": "769",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yannis Zacharopoulos",
                    "user_href": "/profile/Yannis-Zacharopoulos"
                },
                {
                    "user_id": "Con Mitropoulos",
                    "user_href": "/profile/Con-Mitropoulos"
                },
                {
                    "user_id": "Leroy Smith",
                    "user_href": "/profile/Leroy-Smith-42"
                },
                {
                    "user_id": "Dan Houser",
                    "user_href": "/profile/Dan-Houser-1"
                },
                {
                    "user_id": "Alan Piersonn",
                    "user_href": "/profile/Alan-Piersonn"
                },
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Byzantine-Warrior"
                },
                {
                    "user_id": "Spyros Kallim",
                    "user_href": "/profile/Spyros-Kallim"
                },
                {
                    "user_id": "Porlon Kornes",
                    "user_href": "/profile/Porlon-Kornes"
                },
                {
                    "user_id": "Marios Koskinas",
                    "user_href": "/profile/Marios-Koskinas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Houser",
                "href": "/profile/Dan-Houser-1"
            },
            "answer_text": "Ancient Macedonians were seen as inferior to the majority of Southern Greeks as they where viewed as less civilised and had an inferior/outdated political system with monarchy. These differences resulted in them having a negative perspective. ((Many historians believe that Macedon strived for acceptance from the rest of Greece at the time)) Post Philip II/Alexander The Great a large portion of Greece hated Macedonian rule such as Athens as they were no longer the main powerhouse and where stripped of former glory while others felt like former freedoms where stripped away and where against Macedonian Hegemony. Persia tried to bribe many of these states along with hiring Greek Mercenaries for service, this instability and lack of “trust” so to speak led to Alexander not fully trusting the other city states and kingdoms which made him cautious of them. Even afterwards as shown with the Macedonian Wars the City States/Southerners weren’t keen on Macedon becoming dominant again and sided with the Romans. ((Granted while this was the majority it is important to note that some other Greek states/kingdoms did help Macedon)) Edit: Before someone loses it I do consider Macedon part of the wider Hellenic Identity however the point still stands they where still rather distinct. While it’s true Alexander also considered himself a Hellene and followed Hellenism as shown by many quotes he was at his core a Macedonian and viewed Macedon as superior to the rest of Greece/As the most important. Such distinctions and even connections where common and where made by people and historians alike. ",
            "date": "Updated July 18, 2018",
            "views": "18",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Erick Hoy",
                    "user_href": "/profile/Erick-Hoy"
                },
                {
                    "user_id": "Gerard Galo",
                    "user_href": "/profile/Gerard-Galo"
                },
                {
                    "user_id": "Yannis Zacharopoulos",
                    "user_href": "/profile/Yannis-Zacharopoulos"
                },
                {
                    "user_id": "Con Mitropoulos",
                    "user_href": "/profile/Con-Mitropoulos"
                },
                {
                    "user_id": "Elena Maltidou",
                    "user_href": "/profile/Elena-Maltidou"
                },
                {
                    "user_id": "Tamer Samadoni",
                    "user_href": "/profile/Tamer-Samadoni"
                },
                {
                    "user_id": "Henrique Morais",
                    "user_href": "/profile/Henrique-Morais-4"
                },
                {
                    "user_id": "RoundenBrown",
                    "user_href": "/profile/RoundenBrown"
                },
                {
                    "user_id": "Peter Papas",
                    "user_href": "/profile/Peter-Papas-4"
                },
                {
                    "user_id": "Porlon Kornes",
                    "user_href": "/profile/Porlon-Kornes"
                }
            ]
        }
    ]
}