{
    "title": "What are the biggest changes to the energy industry in 5 to 10 years? - Quora",
    "tags": [
        "Solar Energy",
        "Trends",
        "Sustainable Technology",
        "Alternative Energy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaron Dahlen",
                "href": "/profile/Aaron-Dahlen"
            },
            "answer_text": "Hello Margaret, This is an interesting question. In a world where assets can last 50 or more years, it’s safe to say that the same machinery will still be in place. We will have the same generators, the same power lines, and to a large extent, the same loads in our factory, offices, and homes. I suspect many of the trends we see today will continue. The greatest of which is the increase in natural gas consumption as show in in these two charts.[1][2] We can expect the other generators to continue on their present trajectories: steady nuclear, petroleum, and hydrogen with reducing coal. At the bottom we will see an increase in wind and solar.   You asked about the future and how things will change for the energy industry. May I suggest that the greatest change will be in the conversation we have about energy. Specifically, we will pay more attention to the big three including nuclear, wind, and solar. At the same time, there will be a desire to reduce fossil fuel. If you read about energy, you will see that today’s conversation is slowly shifting. In the past there was a absolute confidence in rewewables such as wind and solar. This is evident in so many proclamations issued by cities, states, and countries who state that they will obtain a certain percentage of clean renewable energy. For example, 50% renewable by 2050… In fairness, there was good reason to confident. The numbers were growing and there was money to be made in wind and solar. Wind and solar were the lowest cost generators we could install. However, there was always this underlying reliance on natural gas which I alluded to earlier. This is where things are getting interesting. In a few location, the total amount of wind and solar generation is becoming a significant percentage of the regional generation. The experiment has progressed far enough that folks have a better understanding of the dynamics. Here the word dynamics includes the economics, physics, and culture. While the picture is still developing, it’s not at all clear that our energy future is as simple as we once thought. For example, just a few weeks ago, in a location that is as good for solar as anywhere on the planet, we see a rejection of large scale solar.[3][4] Also, if you want to read something truly depressing, research the gilets jaunes in France. At the same time, the discussion about nuclear seems to be gaining momentum. There is a growing discussion as folks recognize nuclear as part of the solution to our energy needs. One example is Michael Shellenberger who was recently talking about nuclear on NPR and has written a series of articles in Forbes.[5] May I leave you with my story about nuclear: Aaron Dahlen's answer to Is nuclear energy the hope of the future? Regards, APDahlen Footnotes[1] U.S. Natural Gas Total Consumption (Million Cubic Feet)[2] File:History of energy consumption in the United States.svg[3] San Bernardino County bans large-scale solar, wind in some areas[4] California's San Bernardino County slams the brakes on big solar projects[5] Michael Shellenberger",
            "date": "Answered March 10, 2019",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerome Zoeller",
                "href": "/profile/Jerome-Zoeller"
            },
            "answer_text": "The decline in coal, and the rise of methane. Production of the one is down, and demand for the other is up. ",
            "date": "Answered March 11, 2019",
            "views": "4",
            "upvotes": "0"
        }
    ]
}