{
    "title": "What percent of English comes from Latin? - Quora",
    "tags": [
        "Latin (language)",
        "Linguistics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Ross",
                "href": "/profile/Daniel-Ross-71"
            },
            "answer_text": "About 50%, but it depends on how you calculate ‘percent of English— It’s often said that about 60% of English words come from French, Latin and Greek. Mostly via French (and the Greek words via Latin and French), though some (mostly technical terms) directly from Latin or Greek, some even coined from Greek or Latin roots in English like television (from tele- ‘far’ from Greek and vision ‘sight’ from Latin via French). Given that relatively few words are only from Greek or only from French, and most are also found in Latin (whether borrowed directly into English from Latin, or via French, or originally from Greek and then via Latin), we can say that the figure of 60% is reasonable for latinate words— round down to 50% or so if you wish. However, there are some problematic aspects of this in terms of ‘measuring’ a language. Which words do you count? How many words does English have? Are we talking about words we use every day, or any word ever used, only those found in dictionaries, or just the knowledge of a particular native speaker (far less than found in a dictionary, and also not the same as for any other native speaker)? If everything, then what counts as being ‘used in English’— how about ‘et cetera’ and ‘e pluribus unum’— are those English words? And what counts as a word— what about city names, for example? Similarly, although they are academic ‘big words’ found in a dictionary, do we count all names of elements, chemicals, and even scientific names of species? And do we count just base forms or also those with prefixes and suffixes, most of which come from Latin? (We could argue that -s for plurals was due to the influence of French, even though it was also one of several plural endings in Old English, and many prefixes like re- are from Latin.) Do you count words that have a Latin root but were not directly borrowed from Latin? Does it still count if it originated in Greek or passed through French first? What about words that have changed meanings in English (or via French)? And what about neologisms like television? And must they still be spelled the same way as in Latin (very few), or even have the same plural forms, etc. (even fewer)? And more abstractly, the lexicon (‘dictionary’) of a language shifts over time to fill in gaps and meanings adjust slightly to the needs of conversation. So if we removed all of the latinate words from English, the lexicon would look different. If Latin had never influenced English, we’d have many more non-Latin words, and our current words would mean different things. So in an indirect way, many (or even all?) English words have been influenced by Latin. Related answer: How would a Roman loss in the Punic Wars have changed the English language we see today? A more practical answer might be: about 50%— if you pick any random word in English, there’s about a 50–50 change you could identify a Latin root in that word. But there are many different ways to answer this question. One important point is that the most frequent, shortest, most basic words in the language tend to be Germanic (from Old English, inherited from our common ancestor with German, Swedish, etc.). So your experience will differ greatly if you look at technical terms versus the most frequent words (see How many words do I need add to my vocabulary each day to learn a new language?). Almost no words beyond two syllables are original Germanic words. Finally, given the shared ancestry of the Germanic languages and Latin, both going back to Proto-Indo-European spoken around 6,000 years ago (How did Indo-European languages spread through Western Europe?), we might even say that (almost!) all words in Latin and English have shared origins, even if there was no direct chain of borrowing from Latin to English, because the roots can be traced back several millennia earlier— Latin pater and English father have the same origin (Grimm's law - Wikipedia), even though they developed independently in the two languages (but we did borrow paternal). ",
            "date": "Answered April 20, 2017",
            "views": "33",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Hendrickson",
                    "user_href": "/profile/Eric-Hendrickson-7"
                },
                {
                    "user_id": "Pravar M",
                    "user_href": "/profile/Pravar-M"
                },
                {
                    "user_id": "Sharon Thornton",
                    "user_href": "/profile/Sharon-Thornton-39"
                },
                {
                    "user_id": "Nathan Omane Jnr",
                    "user_href": "/profile/Nathan-Omane-Jnr"
                },
                {
                    "user_id": "Delana Fourie",
                    "user_href": "/profile/Delana-Fourie-1"
                },
                {
                    "user_id": "Fahad Al-Ayoub",
                    "user_href": "/profile/Fahad-Al-Ayoub-1"
                },
                {
                    "user_id": "Muḥammad Ḵẖaṭīb Kāmrān",
                    "user_href": "/profile/Muḥammad-Ḵẖaṭīb-Kāmrān"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kip Wheeler",
                "href": "/profile/Kip-Wheeler-1"
            },
            "answer_text": "That’s tricky because Latin enters English in all sorts of different ways in different centuries. For instance, Latin branched out and evolved to become French, Spanish, and Italian. Do we count words we borrow from French, Spanish, and Italian as being Latin then? Or does it have to come directly from Latin? What about words that existed in both Latin and Norman French variants, and we aren’t sure if we borrowed it from Latin or French? Likewise, many Latin words were borrowed from Greek, such as late Latin democratia from Greek demos + cratia or also the Greek word charisma. Do we count those words as Latin (since we borrowed them from Latin rather than Greek?) Or do we count those words as Greek? What about words that are Old English in their root, but to which we’ve added Latin prefixes and suffixes? Do those count as English or Latin? Or do we count them as half a word and lump a fraction of it under each column? What about words we borrowed twice or thrice from Latin? For instance, the Latin word discus gave us the word dish in Old English, but we later borrowed it again as disc during the Middle English period and again as discus in the Renaissance. Should we count that as one Latin word or three different ones? That’s further complicated by the fact that word-statisticians disagree generally on what “counts” as a separate word. Is the word dog and dogs two different words? Or just two different forms of a single word? If you count plurals as different words from singulars, you basically double the number of nouns in English, which leads to very different percentages and tallies. The same holds true for verb variants like run, ran, running, and runs. That makes it difficult to talk meaningfully about how many words exist in English even before we start looking at etymologies to determine what’s native and what’s a loanword. TLDR: Depending on how you count, you wind up with wildly different percentages. Some say 25% or 60% of our vocabulary is currently Latin, but most fall somewhere in the 40% category. No matter which percentage you use though, it’s probably not very meaningful. ",
            "date": "Answered November 9, 2019",
            "views": "303",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Susan Campbell",
                    "user_href": "/profile/Susan-Campbell-173"
                }
            ]
        },
        {
            "author_info": {
                "name": "H. Chris Ransford",
                "href": "/profile/H-Chris-Ransford"
            },
            "answer_text": "Grammar: none Vocabulary: probably ultimately about 50%, although virtually all of the original Anglo-Saxon vocabulary still exists in modern English in one form or another. You heard the expression ‘lies, lies, and statistics’, and that pretty much applies to how we count these ratios. Here’s an example: to lie (to tell an untruth), is English, but the related adjective ‘mendacious’ and noun ‘mendacity’ are Latin. So right here, you’d say that on that narrow count, the lexicon of English is two thirds Latin and one third native (lie, mendacious, mendacity), but of course it does not work that way at all. Which is the reason why the English lexicon is so huge: it has kept well-nigh all of its original wordstock, plus virtually all of Latin’s, plus a lot more besides: H. Chris Ransford's answer to Which language has the most words? ",
            "date": "Answered June 15, 2018",
            "views": "180",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Herbert Stahlke",
                "href": "/profile/Herbert-Stahlke"
            },
            "answer_text": "About 60% of our vocabulary comes to us from Latin or from Latin through French. Some of that originated in Greek but was borrowed by Latin before it came to us. This does not mean that English is “Latin-based\" in any way. The 30% that is our more basic and grammatical vocabulary comes from Germanic, and our grammar is overwhelmingly Germanic. English is a Germanic, not a Romance language. ",
            "date": "Answered July 24, 2020",
            "views": "53",
            "upvotes": "0"
        }
    ]
}