{
    "title": "What did the Black Hand hope to achieve with the assassination of Archduke Franz Ferdinand? - Quora",
    "tags": [
        "Black Hand (Serbia)",
        "Archduke Franz Ferdinand"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harun Šiljak",
                "href": "/profile/Harun-Šiljak"
            },
            "answer_text": "Under the influence of Chernyshevsky, Proudhon and other revolutionary ideologists the secret society of Mlada Bosna believed in the necessity of the revolution and the vital need for personal examples to lead the way. It was the youngest members of the group who insisted that individual terror is the (only) solution and the way to proceed. The youngsters had a hero of their own, Bogdan Žerajić. Bogdan Žerajić wanted to kill Kaiser Franz Joseph during his Mostar visit in 1910. He had the gun, he was just yards away from the Kaiser, but he gave up. Less than two weeks later, Žerajić fired five bullets in an attempt to kill the Bosnian governor Marijan Varešanin in Sarajevo, killing himself with the sixth one. Dedijer emphasises in his book on the Franz Ferdinand assassination that this attempt and those to follow we should observe through the myth of Kosovo tyrannicide: the idea that Miloš Obilić’s assassination of Sultan Murat is an ideal and that a foreign tyrant occupying the lands is a worthy target (Dedijer elaborates on the role of Njegoš’s poetry in conveying this message). In the years after Žerajić’s death, the members of Mlada Bosna discussed their options. Assassination of Kaiser Franz Joseph was one option, assassination of ministers Berchtold and Bilinski was another. The idea of killing the Bosnian governor, general Oskar Potiorek was a recurring theme. Now, according to Miloš Bogićević quoting Pavle Bastajić, it was in January 1914 in Toulouse when the instruction came to go for Franz Ferdinand first: more assassinations of Austro-Hungarian statesmen would follow (note that this meeting, according to Bogićević, was held with permission of Black Hand’s colonel Apis). However, according to Muhamed Mehmedbašić’s account of the Toulouse meeting, it was again Potiorek who was determined to be a target. Now, it is implied that Danilo Ilić, another person from the Black Hand milieu told Mehmedbašić later to stop preparing the Potiorek assassination since Franz Ferdinand is coming soon (Archduke’s plans were published in the press in mid March 1914). According to Nedeljko Čabrinović’s testimony, they also wanted to kill Bosnian governor Potiorek, Orthodox metropolitan bishop Letica and Bosnian Serb political leaders Jeftanović, Dimović and Jojkić. The other secret organisations among the South Slavs in Austro-Hungary were also in dilemma whether to pursue the path of individual terror or not, and again it was the youngest members who pushed it. Month and a half before assassination of Franz Ferdinand, an attempt to kill archduke Salvador and Croatian ban Škerlec was made in Zagreb. Now, what the hell were they thinking and why am I writing about all these different variants? According to Vlado Gaćinović’s words on the day of assassination, they didn’t think enough and didn’t foresee the consequences. The question whether the Black Hand saw the consequences or not is somewhat unclear as well: taking into account that Danilo Ilić was the common denominator of Mlada Bosna and Black Hand and that he himself was going through a lot of struggle trying to clear up his dilemma about individual terror (see Dedijer’s account of it), it’s very hard to say how well-planned was it all. The paragraphs I started this answer with aimed at showing that Franz Ferdinand assassination was just a part of the big ideas of the secret groups including Mlada Bosna and that it was inspired, at least partially, with what other revolutionary groups were doing throughout Europe. Having that in mind, I’d say the idea was to trigger a revolution (or a series of acts of individual terrorism) in the South Slavic lands under Austro-Hungarian occupation which would probably be supported in various ways by the Kingdom of Serbia. ",
            "date": "Answered June 2, 2017",
            "views": "900",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jerome Sassani",
                    "user_href": "/profile/Jerome-Sassani"
                },
                {
                    "user_id": "Predrag Maksimovich",
                    "user_href": "/profile/Predrag-Maksimovich"
                },
                {
                    "user_id": "Max Singer",
                    "user_href": "/profile/Max-Singer-10"
                },
                {
                    "user_id": "Daniel Ptashny",
                    "user_href": "/profile/Daniel-Ptashny-1"
                },
                {
                    "user_id": "Aleksandar Koprivica",
                    "user_href": "/profile/Aleksandar-Koprivica"
                },
                {
                    "user_id": "Velimir Zivkovic",
                    "user_href": "/profile/Velimir-Zivkovic"
                }
            ]
        }
    ]
}