{
    "title": "What is the Chinese history in a nutshell? - Quora",
    "tags": [
        "History of China",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jamin Chen",
                "href": "/profile/Jamin-Chen-1"
            },
            "answer_text": "Modern humans appear and hunt for food.Then they realize that they have a common interest in not starving to death and so they hunt for food together.Someone discovers how to survive by raising more food from plants. He stops hunting all day and does that instead; when other people discover that he has more food, they join him and agree to work for him in exchange for more food.The person in charge dies, and his authority is passed over to his son.Who then hands it over to his son.Who then hands it to his son. Etc.Until the new person is an idiot who doesn’t know what he’s doing, and someone else violently overthrows him and puts his family in charge.And then his family stays in power until it doesn’t know what it’s doing either and gets violently overthrown by another person and his family.And this cycle continues for another 2,000 years or so before someone gets that having families in charge isn’t cool and overthrows the last family, who are replaced by a bunch of warlords who are then replaced by a bunch of intellectuals with guns.It’s hard to sum up Chinese history “in a nutshell,” but if you want to go TL;DR, then you can think of it as the history of one family killing off another. Which isn’t all that different from histories in a nutshell elsewhere tbh. ",
            "date": "Answered February 27, 2020",
            "views": "22",
            "upvotes": " View 58 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jason Meng",
                    "user_href": "/profile/Jason-Meng-6"
                },
                {
                    "user_id": "Chris Wilson",
                    "user_href": "/profile/Chris-Wilson-1554"
                },
                {
                    "user_id": "Justin Lee",
                    "user_href": "/profile/Justin-Lee-1026"
                },
                {
                    "user_id": "Will Zhang",
                    "user_href": "/profile/Will-Zhang-43"
                },
                {
                    "user_id": "Lu Weijie",
                    "user_href": "/profile/Lu-Weijie"
                },
                {
                    "user_id": "Borna Brlošić",
                    "user_href": "/profile/Borna-Brlošić"
                },
                {
                    "user_id": "Lion Mount",
                    "user_href": "/profile/Lion-Mount-2"
                },
                {
                    "user_id": "George Hooi",
                    "user_href": "/profile/George-Hooi-1"
                },
                {
                    "user_id": "Anton Dambaev",
                    "user_href": "/profile/Anton-Dambaev"
                },
                {
                    "user_id": "James Bao",
                    "user_href": "/profile/James-Bao-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Feifei Wang",
                "href": "/profile/Feifei-Wang-6"
            },
            "answer_text": "”话说天下大势，分久必合，合久必分。“ Those long divided shall be united; those long united shall be divided: such is the way of the universe. This is the first line of Romance of the Three Kingdoms. A grossly over-generalized and oversimplified description of Chinese history. It’s so over-generalized and oversimplified to the point it’s completely meaningless. But hey, sure makes witty one-liners for showing off at a dinner party to impress your other pseudo-intellectual friends, doesn’t it?  There’s no such thing as “<insert country> history” in a nutshell. History isn’t something you can put in a nutshell and still somehow make sense. If you want to learn the history of something, anything, put in the time and effort and actually learn it. ",
            "date": "Answered February 26, 2020",
            "views": "45",
            "upvotes": " View 135 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexia Li",
                    "user_href": "/profile/Alexia-Li"
                },
                {
                    "user_id": "Kumar Swapnil",
                    "user_href": "/profile/Kumar-Swapnil-16"
                },
                {
                    "user_id": "Will Zhang",
                    "user_href": "/profile/Will-Zhang-43"
                },
                {
                    "user_id": "Thomas Colligan",
                    "user_href": "/profile/Thomas-Colligan-2"
                },
                {
                    "user_id": "Sean Xu",
                    "user_href": "/profile/Sean-Xu-56"
                },
                {
                    "user_id": "Patrick Yang",
                    "user_href": "/profile/Patrick-Yang-34"
                },
                {
                    "user_id": "Harvinder Kalsi",
                    "user_href": "/profile/Harvinder-Kalsi-1"
                },
                {
                    "user_id": "Harit Kohli",
                    "user_href": "/profile/Harit-Kohli-2"
                },
                {
                    "user_id": "Ryan Wang",
                    "user_href": "/profile/Ryan-Wang-305"
                },
                {
                    "user_id": "David Liu",
                    "user_href": "/profile/David-Liu-370"
                }
            ]
        }
    ]
}