{
    "title": "What is the most famous submachine gun? - Quora",
    "tags": [
        "Submachine Guns",
        "Machine Guns",
        "Military Weapons",
        "Rifles",
        "Weapons",
        "Guns and Firearms",
        "Fame and Mass Popularity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Kelly",
                "href": "/profile/Bill-Kelly-10"
            },
            "answer_text": "I think that the most famous submachine gun is the Thompson. This gun was developed for WWI although it never saw service there. This gun was used throughout the interwar period. The most famous use was by the gangsters of the 20’s, but government organizations used the Thompson as well. As WWII started, the Thompson remained popular for the military. Ultimately, the Thompson was replaced by other guns that could be made more quickly and more cheaply, but the Thompson was still a popular choice. All of these uses made the Thompson the most famous and iconic of these guns. The second most famous is probably the Uzi. While the Uzi might not be very different from some of the submachine guns developed during WWII, the Uzi was one of the first post-war guns of this style. The Israelis made the Uzi well and then marketed the Uzi well. People can make good arguments that other submachine guns are better for various reasons, but the Uzi still seems to be the most famous aside from the Thompson. When I read the question, the first two guns that came to my mind were the Thompson and the Uzi. Among firearms enthusiasts, a bunch of other guns come to mind. For people who have looked at this entire class of weapons and studied the strengths and weaknesses of all of them, there are good arguments for others being better overall. The manufacturing advantages that made other submachine guns supplant the Thompson during WWII are legitimate arguments for why these guns were “better.” Soldiers work together, so military weapons have to be evaluated by the overall effectiveness of some group whether that group is a squad, platoon, company, or anything else. If the group can function better with three guys having a “grease gun” submachine gun than it can with one guy having a Thompson submachine gun, they are going to prefer having the “grease guns.” The success of the Uzi caused other companies to develop firearms that would do those jobs better than the Uzi does. However, the success of the Uzi as the first of that class give the Uzi more overall fame. Question as asked at the time of my answer: What is the most famous submachine gun? ",
            "date": "Answered June 26, 2020",
            "views": "143",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Phil Petto",
                    "user_href": "/profile/Phil-Petto"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Macera",
                "href": "/profile/Frank-Macera"
            },
            "answer_text": "Thanks for the a2a. There are a number of famous submachine guns. The uzi, Thompson, mp40, mp5, ump, p90, the mac 10, and the sten guns are the most recognizable for sure and the most widely known. I would vote the mp40 is the most well known submachine gun.  The above is just one of many examples captured during the second world war. These photos are etched in the mind of the world. When you think Nazi you think of a soldier wielding an mp40. Its in video games, and cinema to a degree. The mp40 has been used in the movies: Bullet proof monkAustin powers the spy who shagged meAttack on LeningradBand of brothersDawn of the dead (1978)Enemy at the gatesGodzilla vs sea monsterHellboyThe inglorious bastardsM.a.s.hMacGyver (1985)Mr. Beans holidayMonty pythons flying circusRaiders of the lost arkReign of fireSpeed racerStar Trek enterpriseStar Trek the original seriesU-571Miracle at st. AnneThe cobraUniversal soldier: day of reckoningHellsing ultimateSeason 6 of the x filesOnce upon a time in hollywoodJoJo's bizarre adventureSchindler's listHart's warWhere eagles dareJust a few items that the mp40 has shown up in. It is a very recognizable submachine gun. Its all over the place and thats why it has my vote and edges out the Thompson. Quite frankly the Mp40 still is the best submachine gun ever made even today. ",
            "date": "Answered June 26, 2020",
            "views": "315",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Orlando Vega",
                    "user_href": "/profile/Orlando-Vega-2"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "T. H. Nevets",
                    "user_href": "/profile/T-H-Nevets"
                },
                {
                    "user_id": "MIchael Dwyre",
                    "user_href": "/profile/MIchael-Dwyre"
                },
                {
                    "user_id": "James Stainrook",
                    "user_href": "/profile/James-Stainrook"
                },
                {
                    "user_id": "Jason DeLong",
                    "user_href": "/profile/Jason-DeLong-10"
                },
                {
                    "user_id": "Phil Boettge",
                    "user_href": "/profile/Phil-Boettge"
                },
                {
                    "user_id": "Jeff Stahlbaum",
                    "user_href": "/profile/Jeff-Stahlbaum"
                },
                {
                    "user_id": "Brody Leavitt",
                    "user_href": "/profile/Brody-Leavitt"
                }
            ]
        }
    ]
}