{
    "title": "What is the oldest sport in the USA? - Quora",
    "tags": [
        "History of Sports"
    ],
    "response": [
        {
            "author_info": {
                "name": "Colleen McCloskey",
                "href": "/profile/Colleen-McCloskey-3"
            },
            "answer_text": "I would think horse racing.Think about early America - what did they have?Horses and boats. Boats would have been utilitarian, used for transporting goods up and down the river, as rivers were the highways of the colonial days. So a little clumsy for racing.Horses were another matter. There were horses everywhere. Some were farm animals - draft animals. But others would have been riding horses. Get men together with horses and you will have horse races. Boxing could have been a sport amongs the laborers, but sword fighting, and later pistols and rifles would have popular enough to codify into a sport. What do you think? ",
            "date": "Answered September 15, 2019",
            "views": "159",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Akash Agnihotri",
                    "user_href": "/profile/Akash-Agnihotri-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Goodman",
                "href": "/profile/Robert-Goodman-15"
            },
            "answer_text": "Probably a tie between various things children happened to be doing within its boundaries at the instant the US came into existence. So look at the games children play, eliminate those that might not be considered sports, and the odds are overwhelming that there were children playing at many of them in various locations at whatever instant you think the US came into existence, unless the US came into existence when all children were asleep. There might’ve been some adults playing stuff too at that moment, maybe over some drinks. ",
            "date": "Answered September 14, 2019",
            "views": "33",
            "upvotes": "0"
        }
    ]
}