{
    "title": "What are best symbols for tattoo design? - Quora",
    "tags": [
        "Symbolism",
        "Body Art",
        "Symbols"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Bunny",
                "href": "/profile/Alex-Bunny-1"
            },
            "answer_text": "Tattooing has acquired enough recognition all across the globe with an increasing number of individuals indulging in it every year. A few popular designs that you can etch on your bodies include: · Semi-colon symbolising that you might need to stop or take a break sometime but choosing to move on instead of giving up is utterly necessary. · Tribal motifs are huge, intricate, and capable of rejuvenating one’s outer appearance in absolutely no time. They generally indicate strength, resilience, aggression, dominance, and other masculine virtues. · An angel denotes spirituality, faith, devotion, and exhibits one’s intrinsic relationship with God. · Many enthusiasts find Maori patterns to be fascinating. Owing to using bold lines repeatedly, it is considered to be quite exclusive. ",
            "date": "Answered December 31, 2018",
            "views": "544",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Janica Harris",
                "href": "/profile/Janica-Harris-1"
            },
            "answer_text": "1)\"There are nights when the wolves are silent and only the moon howls.\"  2)Viking symbol meaning \"create your own reality.\"  3)'Ohm' tattoo that represents 4 different states of consciousness and a world of illusion: waking (jagrat), dreaming (swapna), deep sleep (sushupti), transcendental state (turiya) and world of illusion (maya).  4)Symbol meaning \"thief\" from \"The Hobbit.\" It was the rune Gandalf etched into Bilbo's door so the dwarves could find his house.  5) A glyph means “explore.\" It was meant as a reminder for me to never stop exploring.  6) The zen (or ensō) circle to me represents enlightenment, the universe and the strength we all have inside of us.  ",
            "date": "Answered March 20, 2019",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swati Soni",
                    "user_href": "/profile/Swati-Soni-70"
                },
                {
                    "user_id": "Sai Kumar S",
                    "user_href": "/profile/Sai-Kumar-S"
                }
            ]
        }
    ]
}