{
    "title": "What are some good dares? - Quora",
    "tags": [
        "Dare",
        "Dares",
        "Truth or Dare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maid Jaqi",
                "href": "/profile/Maid-Jaqi"
            },
            "answer_text": "A2A - So these dares are focused on M2F cross-dressing. If that is not your thing, move on to the next answer. Most will cost money if you don’t have the supplies. The dares where you are shopping, always be respectful and buy something. This will help the transgender community be more accepted. Written responses discussing your feelings and interaction with others are always appreciated. Photos are a plus. Faces are not expected, but at least take a picture of the items laid out on a table. I dare you to be hairless - Get rid of all that ugly hair for 30 days. Cheapest option - get girly shaving cream and a pink razor and shave nose to toes every other day. More expensive option make an appointment for a whole body wax then another one 29 days later.I dare you to wear pantyhose - Shop for at least 5 pairs of pantyhose and one pair or knee highs. Wear them for a week at work or school. Discuss the different styles and what you chose. Describe how they feel on your hairless legs. Extra points if you do not wear socks.I dare you to get a bikini tan line - Put on bikini and sunscreen and lay out in the sun for 30 minutes each side for three days in a row. That should give you a nice bikini tan line. It is fall going on winter in the northern hemisphere so you should be able to keep them covered.I dare you to get a bra fitting - You must by at least one bra. Plan on spending $50. Get the trouser socks and make cheap boobs by filling them with rice to a size that is appropriate for your body size. A nice C cup is what I am thinking. Choose a department store or Victoria Secret and ask for a bra fitting. Did the sale girl smile when she saw your tan lines? Did you smell her perfume when she was wrapping her arms around you with the measuring tape? If you have enough money buy the matching panties. Extra points if you wear the stuffed bra and panties out of the store.I dare you to get a mani/pedi - This will be about $40 for the mani and $40 for the pedi. Pick a nice bright red or pink for your toes. A holiday themed pattern is good too. Clear for your fingers is fine. Extra points if you do this on a Friday afterwork and get long acrylic nails on your fingers and keep them for the weekend. You can cut them off on Sunday evening before going to work.I dare you to shop for girl clothes - The local thrift shop will have lots of choices for inexpensive. Get a nice dress, a casual top and skirt, shoes. Look for a wig. Go to a more retail store to get the pieces you cannot find.I dare you to get a makeup appointment - Call Sephora or Ulta or other store. Tell then you are a cross dresser and are going out tonight and need make up done. Tell them you will be wearing girl clothes when you arrive. It is about $40 for the appointment. Ask for eyelashes to be applied. They will strongly encourage you to buy the products they are putting on you. You should at least buy some makeup remover. Give the person doing it a nice tip.I dare you to go a museum or some other event - Find a museum or play or sporting event and go dressed in all of your glory. If you are driving a car, stop and get gasoline. Go inside to buy a drink.Well that will be an exciting Friday night and Saturday. I dare you to go to a house of worship - Some cities have communities that are 55 years old an older. Look for a house of worship. Cross dress respectfully and conservatively and and attend the service. If they have a mingle session with coffee and cookies attend that and talk to some ladies.I dare you to go to Sunday Brunch - Find a restaurant and have a nice brunch.I dare you to write at least a page about your experience. Talking about the people that accepted you and went out of their way to talk with you. The people that went out of their way to avoid you. The people that did double takes or giggled a little. How did all of this make you feel.For CIS females I dare you to wear yoga pants and roll up a sock and put it in your crotch so it looks like you are a M2F crossdresser with a package that is tucked but not very well. It should not look like a penis, but a noticeable mound that is too big for CIS female. Extra points if does look like a penis laying to one side. Be female in every other way and go about your day. Grocery shopping, clothing shopping. How did you feel? Did you feel like everybody was looking at you? Hugs, Jaqi ",
            "date": "Answered October 15, 2019",
            "views": "47",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fernando Oliveira",
                    "user_href": "/profile/Fernando-Oliveira-33-1"
                },
                {
                    "user_id": "Gary Brantley",
                    "user_href": "/profile/Gary-Brantley-4"
                },
                {
                    "user_id": "Pippa McQueen",
                    "user_href": "/profile/Pippa-McQueen"
                },
                {
                    "user_id": "Jamel Paul",
                    "user_href": "/profile/Jamel-Paul"
                },
                {
                    "user_id": "Billie SissyBoi",
                    "user_href": "/profile/Billie-SissyBoi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frankie Liu",
                "href": "/profile/Frankie-Liu-17"
            },
            "answer_text": "Sing. Obnoxiously loud in the shower. Sing your heart out. The catch here is that there may be neighbors and people in the house.Read a book a week for 5 weeks. See how that feels.If you’re not doing so already, start writing on Quora.Learn to do a cartwheel. Then do cartwheels after cartwheels outside down a street. Watch everyone’s reactions.Walk around outside while playing the musical horror of everyone’s childhood, the recorder. Watch everyone’s reactions.Put on some funny makeup and walk around outside. Watch everyone’s reactions (again).Or learn to do makeup in general.Wear something you really want to wear but have never worn.See how many *insert small piece of fruit here* can fit into your mouth.Water balloon war with your friends. See who gets the least soaked.Have a pool party. Invite all your friends. Then, take out a water gun and start shooting everyone. Find out who your true friends are.Spend an entire day in silence.For those with long hair- cut it short.For those with hair- dye your hair.For those with glasses- get contacts. See how it feels (pun intended).For those with contacts- get glasses. See how it feels (pun intended).Perform. Anything.Wear funny socks. Outside. In public. Even better if you’re attending a formal event. See who notices.Don’t get the coronavirus.",
            "date": "Answered April 6, 2020",
            "views": "19",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "J Perdue",
                    "user_href": "/profile/J-Perdue"
                },
                {
                    "user_id": "Olie Holmes",
                    "user_href": "/profile/Olie-Holmes"
                }
            ]
        }
    ]
}