{
    "title": "What are some of the coolest ancient weapons, and were they effective? - Quora",
    "tags": [
        "Ancient Warfare",
        "Weapons and Warfare",
        "Ancient Civilizations",
        "Weapons",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vojtěch Vrba",
                "href": "/profile/Vojtěch-Vrba"
            },
            "answer_text": "Well, there are a lot of very cool ancient weapons that haven’t been mentioned yet: Let’s start with proto-flamethrowers.  In 7th century, Byzantine empire came up with Greek Fire. Of course, there were similar incendiary weapons before, but the difference Greek Fire was simply on another level. Byzantium then employed ship based flame throwers. And these weapons would dominate naval warfare for centuries to come. Ok, maybe dominate is too strong of a word, but they were widely used, and became new addition to naval tactics of the period which was limited to ramming, boarding and perhaps arrow sweeps. Okay, Greek Fire isn’t really ancient weapon, since it’s seventh century, the first flamethrowers are older than that and was properly ancient - Boeotian Flamethrower. We know far less about that one, though. Okay, let’s go from “cool!!!” to “wait what?!”. Claw of Archimedes  The entirety of Siege of Syracuse (213–212 BC) - Wikipedia was a nightmare for Romans. They came to conquer a city, but for some reason, it felt like they’ve been transported into absolutely another world. Apart from tons of siege engines(probably balistae) that were used to bombard approaching ships, there was so much weird s**t that we still aren’t really sure about what really happened there. Some descriptions of what happened include setting ships on fire with mirrors (very unlikely), steam-powered cannon(unlikely) and a crane like weapon that would turn ships over. What we know is that Romans got beaten, and while they eventually managed to conquer the city, they had to infiltrate it, rather than directly take it by force, because despite their massive militaristic advantage, inventions of Archimedes would always turn them around. I’ll add some other interesting weapons later. ",
            "date": "Answered March 15, 2020",
            "views": "356",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Moore",
                "href": "/profile/Alan-Moore-18"
            },
            "answer_text": "The best bowmen came from the vast steppes of the East, fast nomadic raiders with deadly composite bows designed to be loosed from the back of a galloping horse, combining firepower with mobility. The Composite bow was a truly remarkable weapon and it has seen over 2000 years of use in war. Probably first encountered by the Greeks in the hands of the Scythians, Sarmatian and other steppe dwelling horsemen of the east well over 2,000 years ago whilst it was encountered at late ass the 20th Century when in 1902 Francis Younghusband led an expedition into Tibet and was confronted by Tibetans armed with the bow.  (Master bowman Heon Kim using, a modern Korean Composite Bow, the small size of this bow is evident, making it suitable to be used from the back of a horse. It was extremely powerful and there were reports of its arrows at Carrhae going through Roman shields and armour. Here are some of those riders.The Huns got to the very gates of Rome and the Magyars and Avars ravished on tracks of Europe and the Mongols carved out the largest continental land mass empire in history; all this was done with the Composite bow, described as the most deadly weapon in the ancient world.) It was said of the Huns that… “… the (Huns) had no written language: they governed themselves on the basis of the spoken word alone. Infants could ride on a sheep and could draw a bow to shoot small birds and rats. As they grew up, they would shoot foxes and hares and these are what they used to eat. Their warriors were powerful archers, and all were armoured cavalrymen. Their custom when at peace was to follow their flocks, and thus archery and hunting formed part of their way of life. When war threatened, they practiced battles and attacks so that they could invade or make unexpected attacks. This was just part of their very nature.” (Chinese historian, Sima Qian) It was a small a bow; looking like a children’s toy, but its size belied its power, at Carrhae in 53 BC there were reports of arrows going through Roman shields and pinning legionaries arms to the shields. But what was the Composite Bow and was what the secret to its success and longevity? First encountered in the hands of the Scythians in the 7th Century BC (Though possibly it is much older than that,) it has been estimate to be 119 cm when strong with arrows 50 to 60 cm in length. The boy closely associated with the horse, for its small size made it ideal for the use on horseback. The horse was first domesticated in Russia as various horse-breeding tribes. In the 7th Century BC, the Cimmerians and Scythians appeared on the scene with the Cimmerians giving their name to the Crimea and Scythian activity in the Middle Eat being recorded in Assyrian texts. In 620 BC, the Scythians and Meds even sacked the Assyrian capital of Nineveh; the horse-archer had arrived. To the Scythian his bow and quiver was as indispensable as his horse and sword. All the male graves that had so far been discovered contain a great number of arrowheads but what is surprising is the number of female graves that also contain arrowheads as do some children graves. It is not widely believed that Scythian women often accompanied their men into battle and fought besides them, this could well possibly be the origin behind the Amazon legends. Archaeologists have discovered numerous burial sights southern Russia, many around the Black Sea, all and I the Ukraine tell the same story. It is clear that the Scythians believed that the dead would need their bows and arrows in the afterlife. From the cradle to beyond the grave, the bow was with them; they learned to shot and ride from an early age as did their predecessors, the Huns, Avars, Magyars and Mongols  ((Mongol riding down their foe. Painting by unknown artist) Sadly the material that goes into the make-up of these bows, wood bone and animal tendons erodes quickly in the earth but from studying pictures and sculptures the archaeologists and historians can learn much. We also have several surviving written descriptions to aid us. The Roman historian Ammianus Marcellinus (325/330 to after 391 BC) tells us. “While the bows of all peoples are made of flexible branches, Scythian bows…resemble the crescent moon with both ends curved inwards.” The middle of the bow was said to curve inwards and this was said to be the pattern of the bow for centuries to come. The most powerful bows were stressed to near breaking point and needed to be warmed for an hour before being strung; however, they easily broke and were mostly only used for sport, while more sturdy and reliable bows were used in war. The Roman poet Ovid (43 BC to 17/18 AD) during his exile wrote about the Sarmatians. “Among them there is not one who does not bear quiver and bow and darts yellow with viper bile.” Ovid may have been making up the part about poisoned arrows however being bitter over his exile. The Mongols as they conquered central Asia would have felt just as comfortable using the Scythian bow as their own. It was believed that the Scythians could shoot 10 to 12 arrows in a minute and that they would carry between 30 to 150 arrows into battle. From the time of the Scythians to well after the days of Genghis Khan, we have many accounts of great feats of archery. We have this description of a game called ‘Shooting the Willows.’ “Two lines of willow branches were set into the ground of a polo field. The archers, according to their different ranks, chose their own branch and marked it with a piece of cloth; then they whittled away the bark of the twig a few inches above the ground so that the white wood showed through. Led by one galloping rider, other others followed at full gallop, shooting with unfletched arrow with a horizontal blade for arrowhead. An archer who could cut through the willow branch and catch the top end at full gallop took top marks. Second came the end who could cut through the willow twig but couldn’t catch it. Those who could hit the whittled part but not cut it, who those who missed altogether lost. When they shot, people beat drums to egg them on.” (Official history of the Khitan Liao Dynasty) The manufacture of the bow varied from culture to culture but all very accurate and powerful, the Mongol bow was made from yak horn, sinew and bamboo for instance. Their bow had a draw strength of 166lb which was considerably more that the English long bow. Most Mongols would carry two bows whilst on campaign in case one got damaged and was in need of repair. The arrows were as tough as the bows; they were heated until they were red hot and then they were dipped in salt water; this made them hard enough to piece armour. Another wide user of the bow were the Parthians of what is now Iran. At Carrhae raids on the Parthian horse-archers caused the Roman army to be strung out across the desert where it was cut to ribbons. The Parthians would galloped towards the Romans; shooting arrows as they did so and then they would turn their horses about kicking up clouds of dust and ride away but as they turned they would turn in their saddles and shoot over the rear of their horses at the Romans, giving us the term ‘Parthian shot.” Though later at Praaspa the Parthian met a better prepared Roman army under Marcus Antonius (Mark Antony) lavishly equipped with cavalry, javelin throwers and slingers and were fought to a standstill in a battle that ended with no clear victor. Yet here also the Romans had difficulty engaging the enemy, below follows an account of part of the fight that expresses the frustration that the legionnaries must have felt at not being able to close with the foe. “The horses of the Parthians took fright and gave way, and the Parthians fled without coming to close quarters. ‘Anthony pressed hard upon them in pursuit, and had great hopes that he had finished the whole war, or the greater part of it, in that one battle. ‘His infantry kept up the pursuit, and his cavalry for thrice that distance and yet when he took count of those of the enemy who had fallen or had been captured he found only thirty prisoners and eighty dead bodies. “Despondency and despair therefore fell upon all; they thought it a terrible thing that when victorious they killed so few, and when vanquished they were to be robbed of so many men as they had lost at this wagons.” (Plutarch, life of Antony.) The wooden core of the bow give it its shape and strength; it will have been made of several layers, glued together so that the wood used must be to take glue well. To strength the weapon further a thin layer or horn would be glued onto what would become the belly of the bow, (This was commonly done in the winter when cooler conditions toughed the setting) water buffalo horn was most commonly used for this and layers of sinew socked in animal glue are laid in layers on the back of the bow. Stiffening laths are attached and when finished the bow is put in a dry place and left to dry; this can take up to two months.  (Parthian horse-archers engage a Roman army in 53 BC at Carrhae. The Roman Army was utterly destroyed by a combination of heavy cavalry and horse-archers.) The disadvantage of the bow was the length of time it took to construct when compared to the bows of western Europe like the English Medieval long bow and the animal glue would lose its strength in humid conditions and would be quickly ruined in case of submersion. The advantage of the bow was its incredible accuracy and hitting power and the small size of the weapon made it more suitable to be used from the back of a horse than any other type of bow, therefore combing fire-power with mobility. The bow could outdistance the long bow and could penetrate armour up top 100 yards. The following account gives us an idea of the Mongol style of warfare and of the effectiveness of mass horse archers. It is 1287 and the Mongol Empire under Kublai khan is gripped in the vice of a bitter civil war as Kublai’s uncle, Nayan angry with the Khan’s chose of building a new Mongol capital in China and his adoption of Chinese culture rather than sticking to the Mongol’s traditional ways rose in revolt .\"What shall I say about it? When day had well broken, there was the Kaan with all his host upon a hill overlooking the plain where Nayan lay in his tent, in all security, without the slightest thought of any one coming thither to do him hurt. In fact, this confidence of his was such that he kept no vedettes whether in front or in rear; for he knew nothing of the coming of the Great Kaan, Owing to all the approaches having been completely occupied as I told you. Moreover, the place was in a remote wilderness, more than thirty marches from the Court, though the Kaan had made the distance in twenty, so eager was he to come to battle with Nayan. And what shall I tell you next? The Kaan was there on the hill, mounted on a great wooden bartizan, (a wooden defensive tower) which was borne by four well-trained elephants, and over him was hoisted his standard, so high aloft that it could be seen from all sides. His troops were ordered in battles of 30,000 men apiece; and a great part of the horsemen had each a foot-soldier armed with a lance set on the crupper behind him (for it was thus that the foot-men were disposed of); and the whole plain seemed to be covered with his forces. So it was thus that the Great Kaan's army was arrayed for battle. When Nayan and his people saw what had happened, they were sorely confounded, and rushed in haste to arms. Nevertheless they made them ready in good style and formed their troops in an orderly manner. And when all were in battle array on both sides as I have told you, and nothing remained but to fall to blows, then might you have heard a sound arise of many instruments of various music, and of the voices of the whole of the two hosts loudly singing. For this is a custom of the Tartars, that before they join battle they all unite in singing and playing on a certain two-stringed instrument of theirs, a thing right pleasant to hear. And so they continue in their array of battle, singing and playing in this pleasing manner, until the great Naccara (giant battle drums) of the Prince is heard to sound. As soon as that begins to sound the fight also begins on both sides; and in no case before the Prince's Naccara sounds dare any commence fighting. So then, as they were thus singing and playing, though ordered and ready for battle, the great Naccara of the Great Khan began to sound. And that of Nayan also began to sound. And thenceforward the din of battle began to be heard loudly from this side and from that. And they rushed to work so doughtily with their bows and their maces, with their lances and swords, and with the arblasts of the footmen, that it was a wondrous sight to see. Now might you behold such flights of arrows from this side and from that, that the whole heaven was canopied with them and they fell like rain. Now might you see on this side and on that full many a cavalier and men-at-arms fall slain, insomuch that the whole field seemed covered with them. From this side and from that such cries arose from the crowds of the wounded and dying that had God thundered, you would not have heard Him! For fierce and furious was the battle, and quarter there was none given. But why should I make a long story of it? You must know that it was the most parlous and fierce and fearful battle that ever has been fought in our day. Nor have there ever been such forces in the field in actual fight, especially of horsemen, as were then engaged - for, taking both sides, there were not fewer than 760,000 horsemen, a mighty force! and that without reckoning the footmen, who were also very numerous. The battle endured with various fortune on this side and on that from morning till noon. But at the last, by God's pleasure and the right that was on his side, the Great Khan had the victory, and Nayan lost the battle and was utterly routed. For the army of the Great Kaan performed such feats of arms that Nayan and his host could stand against them no longer, so they turned and fled. But this availed nothing for Nayan; for he and all the barons with him were taken prisoners, and had to surrender to the Kaan with all their arms. Now you must know that Nayan was a baptized Christian, and bore the cross on his banner; but this nought availed him, seeing how grievously he had done amiss in rebelling against his Lord. For he was the Great Kaan's liegeman, and was bound to hold his lands of him like all his ancestors before him.\" (Marco polo) Nayan was eventually defeated and executed by being smothered in a carpet.  (Modern mounted horse archer in Hungray. Thousands of such hard riding men craved huge empires for the Scythians, Parthians, Huns, and Mongols. This man is showing us what a Hun most likely looked like .) In 1903, a dispute over the border province of Sikkim and Tibet and a demand to be allowed to set up a commission in Lhasa followed by fear of Russian expansion in the area led to a temporary British invasion of Tibet. Led by Francis Younghusband the British troops would encounter Tibaten warriors (Mostly Kham) armed with the composite bow and matchlocks. But by the early 20th Century the bow had finally met its match in the shape of magazine fed rifles and belt fed machine-guns. We will now look at some of the peoples who used the Composite bow with great effectiveness.  (First the Scythians. Lords of the Russian Steppes. Paintiing by Angus McBride from Timothy Newark’s Book The Barbarians.  Parthian. Gave their name to the Parthian shot and famously destroyed a whole Roman army at the Battle of Carrhae in 53 BC. Psinting by Angus McBride  The Hun. Under their leader the dreaded Attila they swept like an unstoppable tidal wave of flesh and steel from the steppes of Russia and threatened the capital of the mighty Roman Empire. Their original origins are disputed however popular consent is that they were the ancestors of the Mongols who would terrorise the world in the 13th Century, the Xiongnu, one of the very peoples the Chinese built the Great Wall to keep out. This illustration is from John Warry’s book Warfare in the Classical world.  The Avars, like the Huns they terrorized Europe. Here we see Avar horsearchers clash with Framks in a Painting by Angus McBride. From the book by Timothy Newark The Barbarians. ‘The Avars were a confederation of heterogeneous (diverse or varied) people consisting of Rouran, Hephthalites, and Turkic-Oghuric races who migrated to the region of the Pontic Grass Steppe (an area corresponding to modern-day Ukraine, Russia, Kazakhstan) from Central Asia after the fall of the Asiatic Rouran Empire in 552 CE. They are considered by many historians to be the successors of the Huns in their way of life and, especially, mounted warfare. They settled in the Huns' former territory and almost instantly set upon a course of conquest.’ (From Ancient History Encyclopedia. Avars.}  The Maygays, They gave their name to Hungary (Hungarian name for their country is Magyarország. The ethnonym of the Hungarian tribal alliance is uncertain. According to one view, following Anonymus's description, the federation was called \"Hetumoger\" (Seven Magyars) (\"VII principales persone qui Hetumoger dicuntur\", \"seven princely persons who are called Seven Magyars\"), though the word \"Magyar\" possibly comes from the name of the most prominent Hungarian tribe, called Megyer. The tribal name \"Megyer\" became \"Magyar\" referring to the Hungarian people as a whole. Written sources called Magyars \"Hungarians\" before the conquest of the Carpathian Basin when they still lived on the Steppes of Eastern Europe (in 837 \"Ungri\" mentioned by Georgius Monachus, in 862 \"Ungri\" by Annales Bertiniani, in 881 \"Ungari\" by the Annales ex Annalibus Iuvavensibus). The English term \"Hungarian\" is a derivative of the Latin \"Ungri\" or \"Ungari\" forms. (Wikipedia)  The Mongols. The most feared and most successful of the horse-warrior tribes who favoured the composite bow. They conquered the largest single land mass empire in history under Genghis Khan and his generals such as Subutai, Few could stand in their way. Paintng by Giuseppe Rava. ",
            "date": "Answered February 4, 2020",
            "views": "11",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jon Bourgetti",
                    "user_href": "/profile/Jon-Bourgetti"
                },
                {
                    "user_id": "Bret Harbour",
                    "user_href": "/profile/Bret-Harbour-1"
                },
                {
                    "user_id": "Joshua Osei-Dankwah",
                    "user_href": "/profile/Joshua-Osei-Dankwah-1"
                },
                {
                    "user_id": "Omar Elamin",
                    "user_href": "/profile/Omar-Elamin"
                },
                {
                    "user_id": "Aaron Edward Morris",
                    "user_href": "/profile/Aaron-Edward-Morris"
                },
                {
                    "user_id": "Bill Kerr",
                    "user_href": "/profile/Bill-Kerr-42"
                },
                {
                    "user_id": "William Petrak",
                    "user_href": "/profile/William-Petrak"
                }
            ]
        }
    ]
}