{
    "title": "What happened to people in ancient Egypt if they did not worship the gods and how did others react to these people? - Quora",
    "tags": [
        "Religious Worship",
        "Ancient Egypt"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Law",
                "href": "/profile/John-Law-29"
            },
            "answer_text": "IF they “believed but did not worship” they were punished by the Gods directly in proportion to their lack of reverence (with deference to prior acts of faith, if applicable). IF they “did not believe and did not worship” then they were punished by society in proportion to society’s reverence for the Gods and disdain for the wicked. IF they “did not believe and did not worship and society did not believe and did not worship” then the Gods punished all of them by walking away and leaving them to whatever new, crappier gods they invented to punish themselves. Thus, the more important question? What happened in Ancient Egypt when the Gods no longer believed that the worshipers were worth handing out gifts to? They let Egypt fall into the sands… and under the sway of new Gods and God Kings and atheists and clerics and madmen and scientists and bakers and bottle cleaners. What happened to the Gods though? Dunno. Ask them. But, for anyone, when you let go of the Old Gods, there are always new devils ready to take their throne. Enjoy your day! :) Throneless, John ",
            "date": "Answered December 14, 2017",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexander Castro-Moreno",
                    "user_href": "/profile/Alexander-Castro-Moreno"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Poissant",
                "href": "/profile/Daniel-Poissant-4"
            },
            "answer_text": "I can’t answer for ancient Egypt but we know what happened in Ancient Rome. The reason for the occasional of Christian was not about their beliefs and religious practices as Christian but their refusal to make the sacrifices that were compulsory for subject of the Roman Empire. Christians who accepted to make the required sacrifices were not bothered by Roman authorities but there was conflict between them and the other Christians who had suffered consequences for their refusal. ",
            "date": "Answered December 15, 2017",
            "views": "324",
            "upvotes": "0"
        }
    ]
}