{
    "title": "What are the most expensive items listed on Amazon? - Quora",
    "tags": [
        "Expensiveness",
        "Expensive Things",
        "Online Selling",
        "Pricing",
        "Amazon.com (product)",
        "Amazon (company)",
        "Online Shopping"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kah Seng Tay",
                "href": "/profile/Kah-Seng-Tay"
            },
            "answer_text": "So it appears you can sort by price for each category, so here are a couple of the most expensive items I've found. Many of these can be set by the seller, and thus can be arbitrarily outrageous.  (Note: no affiliate links below, these are just copied directly from the search page.)  1. Under Books, Office of the Holy Spirit: A most necessary study for all churches for $4,000,000. Other books for $2,500,000 and $1,000,000.  2. Under Home & Kitchen, 19th Century Oil Painting Attributed to J. M. W. Turner for $1,000,000.  3. Under Electronics, Dell XPS 17\" L702x Custom (X17L-1399ELS) for $999,999.99.  4. Under Sports & Outdoors, \"The Babe with Kids\" Opie Otterstad Painting for $399,999.99.  5. Under Clothing, Shoes & Jewelry, 53.00 Carat Loose Gemstone Mix Shape for $345,000.  But if you were to filter down to say just Prime Eligible items, as a quick proxy for probable legitimacy because they are sold directly or are fulfilled by Amazon[1], then the most expensive item I've found globally across all categories is this: 4.02 Carat Princess Cut Solitaire Diamond Engagement Ring GIA Certified (G Color VS1 Clarity)  under Clothing, Shoes & Jewelry for $119,010. Which is pretty much what I would have guessed -- jewelry. Footnotes[1] How does Amazon decide which distributors and/or products can be ordered through Amazon Prime?",
            "date": "Updated December 11, 2015",
            "views": "1815",
            "upvotes": " View 219 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akshay Goel",
                    "user_href": "/profile/Akshay-Goel-2"
                },
                {
                    "user_id": "Kannan Ganesan (கண்ணன் கணேசன்)",
                    "user_href": "/profile/Kannan-Ganesan-கண்ணன்-கணேசன்"
                },
                {
                    "user_id": "Sumit Jha",
                    "user_href": "/profile/Sumit-Jha-3"
                },
                {
                    "user_id": "Shreyank Tomar",
                    "user_href": "/profile/Shreyank-Tomar-2"
                },
                {
                    "user_id": "Osllo",
                    "user_href": "/profile/Osllo"
                },
                {
                    "user_id": "Jules Manson",
                    "user_href": "/profile/Jules-Manson-2"
                },
                {
                    "user_id": "Gulshan Gandhi",
                    "user_href": "/profile/Gulshan-Gandhi"
                },
                {
                    "user_id": "Rafael de Souza Mendonca",
                    "user_href": "/profile/Rafael-de-Souza-Mendonca"
                },
                {
                    "user_id": "Ayush Sharma",
                    "user_href": "/profile/Ayush-Sharma-1764"
                },
                {
                    "user_id": "Kristin Butler",
                    "user_href": "/profile/Kristin-Butler-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Elles",
                "href": "/profile/Chris-Elles"
            },
            "answer_text": "I don't know what the most expensive thing is on Amazon today, but I do know what was the most expensive thing for Amazon back in 1999-2000 Christmas season. Big Screen Rear Projection Televisions. Amazon ran a special deal of Free Shipping when it expanded it's product range into electronics, including televisions(pre plasma/LCD/LED flat screens). The TVs were so big they could only fit 1 per shipping pallet, and Amazon was paying the cost of Free Shipping(BOTH ways including returns) as well as a 30 day money back guarantee. Unfortunately, that year the Free Shipping(including 30 day Free returns) offer fell within 30 days of the Super Bowl. So what happened was a considerable number of people purchased Big Screen Rear Projection TVs to watch during the holiday season and finish with the Super Bowl, before returning them at no cost to themselves. I remember seeing a rather large area(approximately the size of a football field as I recall) of returned TVs, one per pallet, in Amazon's now closed McDonough Georgia distribution facility back in early 2000. Amazon couldn't resell them so they had to offload them to a liquidator at pennies on the dollars. Adding up the total cost of inventory sold/returned as well as high shipping costs both ways, I'd say that ranks as \"the most expensive thing\", from Amazon's perspective, back during that particular silly season. Lesson learned? Don't offer a Free Shipping and Returns during the Super Bowl. ",
            "date": "Answered April 4, 2016",
            "views": "54",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jules Manson",
                    "user_href": "/profile/Jules-Manson-2"
                },
                {
                    "user_id": "Kristin Butler",
                    "user_href": "/profile/Kristin-Butler-3"
                },
                {
                    "user_id": "Swateek Jena",
                    "user_href": "/profile/Swateek-Jena"
                }
            ]
        }
    ]
}