{
    "title": "What happened in the Cold War? - Quora",
    "tags": [
        "The Cold War",
        "World History",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Pere Hernández",
                "href": "/profile/Pere-Hernández-1"
            },
            "answer_text": "Cold War is called “Cold” because it supposedly never heated up into actual armed conflict. The Cold War did involve quite a lot of actual war, from Korea to Afghanistan, as the world’s two superpowers, the United States and the U.S.S.R., sought ideological and strategic influence throughout the world. So perhaps it’s best to think of the Cold War as an era, lasting roughly from 1945 to 1990.  You can see the entire article here @http://what-happened.org/2015/09/during-the-cold-war/Many things happened during the cold war, but let start talking about numbers:Cold war in numbersThe world’s first hydrogen bomb had the power of 10.4 million tons of TNT. It was codenamed ‘Mike’275,000 planes dropped 1.5 million tons of supplies into Berlin when Stalin blockaded the city in 1948. One plane landed every three minutes.There were 40,000 nuclear warheads in the world by 1986, which is the equivalent of one million Hiroshima bombs.In 1963, 11 months after the Cuban Missile crisis almost caused nuclear war, JFK proposed a joint US-Soviet mission to the moon. His assassination put an end to the idea.America’s top-secret decoding Project Venona identified 350 Soviet spies in 37 years. It was so secret that even the President wasn’t told about it.There were 90 nuclear bomb tests in the Nevada desert in the 1950s and 1960s.Over 15,000 people have died from cancer caused by nuclear testingThe US secret code for authorizing a nuclear missile launch was 00000000. The code was in use between 1962 and 1977.What happened during the cold war?Discussions of the Cold War tend to center on international and political history and those are very important, which is why we’ve talked about them in the past. This, however, is United States history, so let us heroically gaze–as Americans so often do–at our own navel. (Libertage.) Stan, why did you turn the globe to the Green Parts of Not-America? I mean, I guess to be fair, we were a little bit obsessed with this guy. So, the Cold War gave us great spy novels, independence movements, an arms race, cool movies like Dr. Strangelove and War Games, one of the most evil mustaches in history. But it also gave us a growing awareness that the greatest existential threat to human beings is ourselves. It changed the way we imagine the world and humanity’s role in it. In his Nobel Prize Acceptance Speech, William Faulkner famously said, “Our tragedy today is a general and universal physical fear so long sustained by now that we can even bear it. There are no longer problems of the spirit. There is only the question: When will I be blown up?” So, today we’re gonna look at how that came to be the dominant question of human existence, and whether we can ever get past it.  Screenshot from the movie “Dr. Strangelove” So after WWII the U.S. and the USSR were the only two nations with any power left. The United States was a lot stronger – we had atomic weapons, for starters, and also the Soviets had lost 20 million people in the war and they were led by a sociopathic mustachioed Joseph Stalin. But the U.S. still had worries: we needed a strong, free-market-oriented Europe (and to a lesser extent Asia) so that all the goods we were making could find happy homes.The Soviets, meanwhile, were concerned with something more immediate, a powerful Germany invading them. Again. Germany was very, very slow to learn the central lesson of world history: Do not invade Russia. Unless you’re the Mongols. (Mongoltage.) So at the end of World War II, the USSR “encouraged” the creation of pro-communist governments in Bulgaria, Romania, and Poland–which was a relatively easy thing to encourage, because those nations were occupied by Soviet troops. The idea for the Soviets was to create a communist buffer between them and Germany, but to the U.S. it looked like communism might just keep expanding, and that would be really bad for us, because who would buy all of our sweet, sweet industrial goods? So America responded with the policy of containment, as introduced in diplomat George F. Kennan’s famous Long Telegram. ",
            "date": "Answered October 9, 2015",
            "views": "25",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rana Zain",
                    "user_href": "/profile/Rana-Zain-22"
                },
                {
                    "user_id": "Alister Teow",
                    "user_href": "/profile/Alister-Teow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chaitanya Ramesh",
                "href": "/profile/Chaitanya-Ramesh"
            },
            "answer_text": "Thanks for the A2A. I am not sure what exactly you mean by this question. Do you mean more of simply \"What was the Cold War\" or do you want a summary of the various events that took place during that period? The Cold War generally refers to the period between the end of the Second World War in 1945 and the dissolution of the Soviet Union in 1991.During this period, the world was dominated by 2 superpowers: the USA and the USSR. The two were more or less permanently hostile. However, they were never openly at war, hence the name Cold War. Had the Cold War gone Hot, we would probably remember it (if we were alive) as the Third World War. Instead, the war was mainly fought through proxies throughout most of the developing world. Some Third World countries did try to stay neutral (spearheaded by Nehru among others) but every country in the World eventually ended up on the side of either the US or the USSR. Ironically, many of these proxies (especially the US ones) did not follow the ideology their sides stood for (democracy & communism). Most of them were just dictators who used the support of the superpower to consolidate their grip on power. The US (actually NATO, but the US was the largest contributor) forces faced off against the USSR (again, actually Warsaw Pact) forces all across the world, most famously in Germany (then divided into West & East). The main reason they never went to war against each other was because both sides had nuclear weapons. Thanks to Mutually Assured Destruction, declaring war would have been a suicidal move. Some notables events of the Cold War include: Korean War Korea was divided into a communist North & US aligned South. North Korea invaded South Korea and almost overran the country before US (actually UN) forces intervened. The UN forces in turn threw back the North Koreans into their own country, and almost overran North Korea before China (spooked by the idea of having an US ally on its border) intervened on the North Korean side. The Chinese managed to drive the UN forces back to the old border before the fighting stopped. This stalemate continues to this day (technically, since they never signed a peace treaty, the 2 Koreas are still at war). Vietnam War Similar to Korea, Vietnam was divided into a communist supported North and West-aligned South. The US actually intervened against a communist insurgency in the South, which was supported by the North. The North did eventually invade the South. The US was unable to put down the insurgency, and facing huge domestic criticism, pulled out its troops. The North promptly moved in, and North & South became one country in 1975. Afghanistan War Can be seen as the Soviet Vietnam. The USSR intervened in Afghanistan hoping to keep their preferred regime in charge. 15 years of bloodshed later, they were unsuccessful and pulled out. In this case, the insurgents the Soviets were fighting against, the Afghan Mujaheddin, were funded & equipped by the US and its allies. Cuban Missile Crisis Unlike the events mentioned earlier, this did not devolve into actual fighting. This started when the US found that the USSR had stationed nuclear weapons in Cuba. Cuba is just 100 kms off the US coast and had a new communist government. This was when the Cold War went closest to becoming Hot. There was lots of other fighting too, when a superpower would support insurgencies in one country, the regime of which was friendly with the other superpower. A well-known example would be the Contras of Nicaragua. Finally, the Arab-Israel Wars and the India-Pakistan wars can be seen as extensions of the Cold War (although not directly caused by it) since one of the participants was supported by the West (Israel & Pakistan) and the other by the USSR (the Arabs & India). ",
            "date": "Answered December 9, 2014",
            "views": "67",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emetu James",
                    "user_href": "/profile/Emetu-James"
                },
                {
                    "user_id": "Jasmine Russell",
                    "user_href": "/profile/Jasmine-Russell-34"
                },
                {
                    "user_id": "Manali Lakhotia",
                    "user_href": "/profile/Manali-Lakhotia"
                },
                {
                    "user_id": "Gaurav Agrawal",
                    "user_href": "/profile/Gaurav-Agrawal-41"
                },
                {
                    "user_id": "Prakash Rai",
                    "user_href": "/profile/Prakash-Rai-3"
                }
            ]
        }
    ]
}