{
    "title": "What makes Finland different from other countries? - Quora",
    "tags": [
        "Living in Finland",
        "Finland"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cagla Salmensuu",
                "href": "/profile/Cagla-Salmensuu"
            },
            "answer_text": "Their kind of introvertedness. Let me explain. The Finns are not the only introverted people in the world. But unlike the other introverts, for example the Japanese, the Finns tend to be very straightforward and honest with how they feel and what they think. You never have to second-guess a Finn. Isn’t that so liberating for the mind and the heart? If a Finn says s/he thinks you are cool, that means you are really cool in her/his opinion. If a Finn says you are “welcome to join”, you can rely on that word and show up at their doorstep. They won’t try to find polite excuses to get rid of you while giving you a fake smile. Finns do not typically bother themselves with inefficient hierarchies, statuses or concers of giving the “perfect” impression. You can often hear a Finn quietly asking “but what’s the point? how does that make life better for everyone?” in the US or other parts of Europe. Moreover, they take a “humble” kind of pride in their history and for this reason you can never see them secretly wishing the rest of the world would recognize their “superior” ways of doing things. Unlike the other developed nations, they simply do not feel this way. At first one might confuse their silence and expressionless face with arrogance but soon you learn that this could not be further than truth. They simply do not want to pollute the space between you and them with exaggerated emotions or expressions. They let you have the space and express yourself. The longer I live and work with them, the more I feel liberated from the bullshit of life outside of Finland. No drama. I mean yes of course there is some drama but tiny bit. Lack of judgment. I mean yes of course people are a little bit judgy about one another but nothing that compares to southern Europe for example. If you happen to buy a crap present for your friend because you didn’t have money or the time, no one will talk behind your back about it. Your friend will only appreciate you showed up at all. So much freedom to be who you are. No need to walk on eggshells around sensitive people’s sensitive feelings here. Pure freedom. Freedom to use that energy instead to focus on things that matter. People tend to accept one another the way they are. No one cares if you didn’t have your (hair) root job done on time and it shows. Or that you are not on your best day. If you look a bit withdrawn, they respect that and let you be. If you are having a tough time in your life, you do not have to pretend to be happy or smile. Your mood is acceptable. It won’t be held against you. As people, Finns are humble, quiet and genuinely honest, with no price attached to that honesty. They are not “brutal” in their honesty with an agenda. They will not backstab you or betray your trust in any way. They are just wired differently. So that kind of effortless introvertedness in addition to other things I wrote above makes the Finns very very special in my opinion. This is one of the things that is difficult to get used to in the beginning, however, easy to love once you understand. Indeed, you start looking at the rest of the world a bit differently once you have properly internalized this culture. It becomes harder to go back to the outside world again. Hug a Finn next time you see one.  edit: seriously, if I see one more comment about the “hug a Finn” part, I am going disable the comments on this answer. stop littering the thread, please! :) ",
            "date": "Updated June 2, 2019",
            "views": "499",
            "upvotes": " View 496 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Radheshyam Shukla",
                    "user_href": "/profile/Radheshyam-Shukla-9"
                },
                {
                    "user_id": "Leimu Laine",
                    "user_href": "/profile/Leimu-Laine"
                },
                {
                    "user_id": "Johan Veltheim",
                    "user_href": "/profile/Johan-Veltheim"
                },
                {
                    "user_id": "Saif Aljneibi",
                    "user_href": "/profile/Saif-Aljneibi-1"
                },
                {
                    "user_id": "Danilo Meira",
                    "user_href": "/profile/Danilo-Meira"
                },
                {
                    "user_id": "Ville Välkky",
                    "user_href": "/profile/Ville-Välkky"
                },
                {
                    "user_id": "Eetu Niemi",
                    "user_href": "/profile/Eetu-Niemi-2"
                },
                {
                    "user_id": "Abhishek Dimri",
                    "user_href": "/profile/Abhishek-Dimri"
                },
                {
                    "user_id": "Tuukka Ryyppö",
                    "user_href": "/profile/Tuukka-Ryyppö"
                },
                {
                    "user_id": "Felicity Nefdt",
                    "user_href": "/profile/Felicity-Nefdt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fabian Tîmplaru",
                "href": "/profile/Fabian-Tîmplaru"
            },
            "answer_text": "Well, I have only lived in 3 countries and all in europe , but Finland is different in many ways. To start with Finland is synonymous with freedom to me. You are free to be who you want , to date whom you want , to express yourself how you want, as long as your freedom doesn't interfere with your peers freedom. Concrete examples of differences: ☆ hottest and friendliest cops Few days ago cops pulled me over because one of my lightbulbs didn't work and also cos I was at 4 am driving in a more or less empty area. Some 25 y old woman extremely pretty , short purple hair and some very cool tatoos on her hands warned me that the light was not functioning , asked me to take and alcohol test , chatted some small thing about the fact that I speak Finnish very well and then wished me good luck with my work. You don t feel any fear when cops stop you, you know they just do their job and are always friendly and polite. ☆ there is always lots of nature around Whether you are in some deep countryside or in Helsinki, forest and lakes are always close by. Parks are everywhere, trees nature and people love it. ☆ comfort and simplicity over need to show off your value People like comforters and routine. Sometimes a bit too much since any little thing , like their newspaper didn't come in time or stuff like that make them go berserk (as much as finns rage anyway). On the other hand this is easily seen in the style of houses that are built here, the low amount of sports cars , and the way people choose to spend their free time. ☆friendships and relationships Whether we talk about friendships or any other kind of relationships, people are more or less keeping to themselves, but that doesn't mean is harder than anywher, it just means someone has to be brave and take the first step. Usually people connect through hobbies, common interests, work and such. On the ugly side a lot of people are sad , lonely. We used to have a landscaping business, sometimes it was kinda sad when older people hired us to redo their garden , just so they have someone to chat with. ☆state comes through for you Free healthcare, well relatively free, distribution of wealth, the way taxes are used and so on, are better than in many countries. This doesn't mean that is perfect, just better managed. On the other side, people tend to not want to help someone in need because they think state will take care of it. This is also seen in day to day life. Someone's car broke down on the highway and looked very worried , but didn't knew what to do, must've passed 100 cars until I stopped and called the toe truck and gave them a ride to the near coffee shop. ( their phone was dead and waited the truck inside ) ☆ gender equality Finland was one of the first countries to give to women voting rights, and as I recall the first and only country to have both the president and prime minister women. While some jobs are predominantly done by women or men, it's very common to see women as bus, truck drivers , helicopter pilots , engineering jobs, construction workers. It is also very normal to see men as social workers, kindergarten and nursery workers , nurses and such. There is also very true the fact that men do win slightly better for same job and women are higher educated than men. This has also provoked some phenomenon in which women end up doing all the work and the guy is basically doing nothing, and also some pressure towards women that like the idea of being dependent of their husbands and being mothers of the family in the traditional way. ☆soo much spaaaaaaaaceeeeee Everywhere is lots of space. Even the capital has some of the widest roads I ever seen. Large parking places , and parking spots(30-40% wider than in Romania for ex.) A Chinese couple visited my friend and she owns like 20 hectares of land. They were so impressed with her saying that she must be one of the richest women I the country. (For the record she's not xd) This are all on top of my tongue, and I'm sure there are many others. There are good and bad sides to each country, the trick is in balance. ",
            "date": "Answered December 14, 2017",
            "views": "29",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carlos Martínez Sánchez",
                    "user_href": "/profile/Carlos-Martínez-Sánchez"
                },
                {
                    "user_id": "Suvi Tarvas",
                    "user_href": "/profile/Suvi-Tarvas"
                },
                {
                    "user_id": "Kasha Kröger",
                    "user_href": "/profile/Kasha-Kröger"
                },
                {
                    "user_id": "Ari Rotonen",
                    "user_href": "/profile/Ari-Rotonen"
                },
                {
                    "user_id": "Tina Allen",
                    "user_href": "/profile/Tina-Allen-6"
                },
                {
                    "user_id": "Juhana Seppänen",
                    "user_href": "/profile/Juhana-Seppänen"
                },
                {
                    "user_id": "Mikko Mutru",
                    "user_href": "/profile/Mikko-Mutru-1"
                },
                {
                    "user_id": "Jussi Hurnasti",
                    "user_href": "/profile/Jussi-Hurnasti"
                },
                {
                    "user_id": "Samuli Karjalainen",
                    "user_href": "/profile/Samuli-Karjalainen"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Frosch-Frosch-1"
                }
            ]
        }
    ]
}