{
    "title": "What if Freddie Mercury was still alive today? - Quora",
    "tags": [
        "Freddie Mercury"
    ],
    "response": [
        {
            "author_info": {
                "name": "Randy McDonald",
                "href": "/profile/Randy-McDonald"
            },
            "answer_text": "Everything depends on how Freddie Mercury managed to survive. At least one biography suggests Freddie Mercury might have become HIV-positive as early as 1982, before there was any widespread awareness of AIDS at all and gay promiscuity was thought of as only mildly risky. Some suggest he might have become infected earlier still, even in the 1970s before there was any awareness of the illness at all. How did Mercury avoid infection? Was he in an authentically monogamous relationship, whether with an opposite-sex partner or a same-sex partner, one that lasted at least until the danger of AIDS became clear? Had he the chance to meet an early AIDS victim and be forewarned? This is imaginable, but this would also cause significant changes in Mercury’s lifestyle years beforehand. (I dismiss the possibility that he could have had better treatment. Especially since he seems, as discussed in this thread on a fan forum, to have developed advanced HIV infection in the mid-1980s, with an AIDS-confirming diagnosis of Kaposi’s in 1987, the odds of him surviving to the advent of the first effective anti-retroviral therapies in the mid-1990s are low. He had plenty of money and connections, but treatments just were not there.) The odds are good that Mercury, as a solo artist and with Queen and collaborating with others, would remained a productive artist. We would not have had the songs that he was involved with at least in the decade up to 1991, his music in the 1980s turning out very differently, but we would have different ones. We would not have had the bold genius of “The Show Must Go On”, but that lack and others would have been more than paid for by his survival and by the songs that we would know as classics.  What would the consequences have been for the wider world? Mercury’s survival might have had consequences for LGBTQ visibility and awareness of HIV, but would they have been that big? I wonder. ",
            "date": "Updated August 17, 2019",
            "views": "4",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sam Raven",
                    "user_href": "/profile/Sam-Raven-14"
                },
                {
                    "user_id": "Donna Dotson",
                    "user_href": "/profile/Donna-Dotson-4"
                },
                {
                    "user_id": "Susan Price",
                    "user_href": "/profile/Susan-Price-165"
                },
                {
                    "user_id": "Sharyn Compton",
                    "user_href": "/profile/Sharyn-Compton-1"
                },
                {
                    "user_id": "Josie Maws",
                    "user_href": "/profile/Josie-Maws"
                },
                {
                    "user_id": "Sandy Sims",
                    "user_href": "/profile/Sandy-Sims-17"
                },
                {
                    "user_id": "Joe Elliott",
                    "user_href": "/profile/Joe-Elliott-27"
                },
                {
                    "user_id": "Thomasita Taylor",
                    "user_href": "/profile/Thomasita-Taylor"
                },
                {
                    "user_id": "Darlene Johnson Petry",
                    "user_href": "/profile/Darlene-Johnson-Petry"
                },
                {
                    "user_id": "Pam Clifton",
                    "user_href": "/profile/Pam-Clifton-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arli Cat",
                "href": "/profile/Arli-Cat"
            },
            "answer_text": "Then there would actually be some music worth listening to. Possibly. ",
            "date": "Answered May 29, 2018",
            "views": "25",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emile De Praetere",
                    "user_href": "/profile/Emile-De-Praetere"
                },
                {
                    "user_id": "Shawna L. Sexton",
                    "user_href": "/profile/Shawna-L-Sexton"
                },
                {
                    "user_id": "Dakotah Bruh",
                    "user_href": "/profile/Dakotah-Bruh"
                },
                {
                    "user_id": "Eric Rodgers",
                    "user_href": "/profile/Eric-Rodgers-17"
                },
                {
                    "user_id": "Rob Karwowski",
                    "user_href": "/profile/Rob-Karwowski"
                },
                {
                    "user_id": "Celeste Jackson",
                    "user_href": "/profile/Celeste-Jackson-2"
                },
                {
                    "user_id": "Daniel Imba Pouzankov",
                    "user_href": "/profile/Daniel-Imba-Pouzankov"
                },
                {
                    "user_id": "Samuel Leeks",
                    "user_href": "/profile/Samuel-Leeks"
                }
            ]
        }
    ]
}