{
    "title": "What caused the decline of Elvis Presley? - Quora",
    "tags": [
        "Decline",
        "Elvis Presley (musician, actor)",
        "Music History",
        "Singers",
        "Music Industry",
        "Musicians",
        "Celebrities",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dustin Blythe",
                "href": "/profile/Dustin-Blythe-2"
            },
            "answer_text": "The decline really began in 1971–72 when Elvis had gotten over the initial excitement of the “comeback”, returning to live performing and recording non-soundtrack music. His marriage to Priscilla was falling apart, he was increasingly addicted to pills that were, yes, prescribed but obtained through manipulation of doctors by Elvis. His life was like a self made prison: He always wanted to sing and perform but in the end it was all his life consisted of, due in large part to the demands of his lifestyle and lack of other viable options. Elvis had medical issues that needed medical treatment but were also exacerbated by his overuse of prescription medication. If the end hadn’t come in 1977, it would have been ‘78, ‘79, ‘80. The question was not “if” but “when”. I highly recommend Peter Guralnick’s bio of Elvis for the details and perspective. ",
            "date": "Answered January 15, 2020",
            "views": "21",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Schiavo",
                    "user_href": "/profile/Michael-Schiavo-3"
                },
                {
                    "user_id": "Jim Ghivizzani",
                    "user_href": "/profile/Jim-Ghivizzani"
                },
                {
                    "user_id": "Kathy House",
                    "user_href": "/profile/Kathy-House"
                },
                {
                    "user_id": "Clayton Stone",
                    "user_href": "/profile/Clayton-Stone"
                },
                {
                    "user_id": "Shari Small",
                    "user_href": "/profile/Shari-Small"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lynn Granata",
                "href": "/profile/Lynn-Granata-7"
            },
            "answer_text": "His personal habits. He started to become addicted to drugs, let himself get big and fat, and they say he might have had colon cancer at the time of his death, which went undetected because he never went for an annual physical examination or colonoscopy. And a simple cancer screening could have saved his life. He let his personal hygiene go downhill, drowned his sorrows with booze, had flatulence and farted onstage so that his audience could hear him, literally. They laughed every time he farted! He may have been born with many other physical ailments as it was. Here is Eddie Murphy talking about his farting habit in his old stand up comedy routine.  ",
            "date": "Updated August 6, 2019",
            "views": "12",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Schiavo",
                    "user_href": "/profile/Michael-Schiavo-3"
                },
                {
                    "user_id": "Bobby Sammons",
                    "user_href": "/profile/Bobby-Sammons"
                },
                {
                    "user_id": "Dennis Hauser",
                    "user_href": "/profile/Dennis-Hauser"
                },
                {
                    "user_id": "Shinka Sanada",
                    "user_href": "/profile/Shinka-Sanada"
                }
            ]
        }
    ]
}