{
    "title": "What herbs and spices are commonly used in conjunction with one another? - Quora",
    "tags": [
        "Culinary Herbs",
        "Spices",
        "Cooking"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ti Zhao",
                "href": "/profile/Ti-Zhao"
            },
            "answer_text": "Adding a few more to the list: Herbes de Provence: a mix of herbs from the Provence region of France, the basics which consist of savory, fennel, basil, thyme, and lavender.   The classic Italian spices: garlic, oregano, marjoram, thyme, rosemary, and basil, or a subset thereof.   And here is the classic one from Mom. Whenever I ask for a recipe for something, the instructions (almost) always end with: \"and then add 葱，姜，蒜 (scallion, ginger, garlic).\"  Why do they work well together...? A few months ago, I saw a study published in the Scientific Reports section of Nature that analyzed the particular flavor combinations used in \"Western cuisine\" vs \"Asian cuisine\" [1]. What they concluded is that \"Western cuisine\" tend to pair together things that share a lot of flavor compounds in common, so the combinations of herbs and spices go well together because they complement each other. \"Asian cuisine\" on the other hand likes to combine herbs and spices that don't share as many flavor compounds with each other, so the flavors that go well together there contrast each other. What I gathered from that is that flavors go well together either because they share a lot in common, or a little in common. Not very helpful. But it's an interesting read anyways. You can try to track down the popular combos of flavors on their flavor network and see how many compounds they share in common.   [1] http://www.nature.com/srep/2011/111215/srep00196/full/srep00196.html#/f3 ",
            "date": "Updated July 28, 2012",
            "views": "42",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                },
                {
                    "user_id": "Jayson Block",
                    "user_href": "/profile/Jayson-Block"
                },
                {
                    "user_id": "Linda Bezich-Kumler",
                    "user_href": "/profile/Linda-Bezich-Kumler-1"
                },
                {
                    "user_id": "Calen Dell",
                    "user_href": "/profile/Calen-Dell-2"
                },
                {
                    "user_id": "Peter Harris",
                    "user_href": "/profile/Peter-Harris-226"
                },
                {
                    "user_id": "Komalpreet Brar",
                    "user_href": "/profile/Komalpreet-Brar-1"
                },
                {
                    "user_id": "Katelyn Nienaber",
                    "user_href": "/profile/Katelyn-Nienaber-1"
                },
                {
                    "user_id": "Stijn Hommes",
                    "user_href": "/profile/Stijn-Hommes"
                },
                {
                    "user_id": "Caitlin Gorry",
                    "user_href": "/profile/Caitlin-Gorry"
                },
                {
                    "user_id": "Sharanya Sunderamoorthy",
                    "user_href": "/profile/Sharanya-Sunderamoorthy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evelyn Jane Saungikar",
                "href": "/profile/Evelyn-Jane-Saungikar"
            },
            "answer_text": "This is a huge question, like asking an artist what colors go together! Try different combinations on a bland food, such as crackers with cream cheese, to get the effects. Read regional recipe books to see which ingredients occur again and again, and realize any given seasoning doesn't appear in all dishes from that region. Here are some tricks also: If a fruit is underripe or bitter, sprinkle with a bit of salt. Nutmeg makes a cream sauce taste richer. Mustard helps bind oil and vinegar together in a salad dressing. Mustard also helps a cheese sauce taste like it was made with more expensive cheese. A small amount of anchovy paste, like 1/2 teaspoon, in a pound of ground beef makes your burgers taste meatier. Lemon or lime juice added to spicy dishes makes the spices hotter, especially if left overnight and reheated the next day. A tablespoon of cocoa powder added to any dish cooked in red wine, gives the dish additional oomph, especially if the meat or the wine is on the cheaper side. Think stews, pot roast, cow au vin. Also great in chili. A pinch of ground cloves makes ground meat dishes more interesting. Throw a peeled clove of garlic in with potatoes boiling for mashed potatoes, and mash it in with your potatoes. ",
            "date": "Answered July 26, 2016",
            "views": "457",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Akira Hurley",
                    "user_href": "/profile/Akira-Hurley"
                }
            ]
        }
    ]
}