{
    "title": "What happened to Italy's colonies after WWII? - Quora",
    "tags": [
        "Italy",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kristoffer Harbo",
                "href": "/profile/Kristoffer-Harbo"
            },
            "answer_text": " This map shows the extent of the Italian Empire, beginning from their first acquisition of overseas territory in Assab in 1882 to their conquered domains which lasted until the aftermath of World War Two. Much of their holdings were in no small part due to their membership of the victorious alliance in which they were promised new territory in the aftermath of World War One. Eritrea 1890–1947 Car race held in Eritrea during the 30s Eritrea marked the earliest colonial venture of the Italian kingdom. Though the colony was formally created on 1890, the Italians had begun establishing a commercial presence in the port city of Assab since 1869. At the end of the East Africa Campaign in 1941, Eritrea was placed under British occupation that lasted until 1952 when the country was officially annexed by the Ethiopian federation. The allied decision to accede to Emperor Haile Selassie’s demands has created repercussions to this day because the annexation was supported primarily for strategic reasons without taking the Eritrean people into consideration. 2. Somaliland 1890–1960  The colonization of Somaliland began roughly at the same time as Eritrea. In 1888, the Italians supported the sultan Yusuf Ali Kenadid of Hobyo against his rival, but later removed him when he grew less compliant. For the next few decades Italy would gradually increase their assets in Somalia, much of it given by the British for Italy’s alliance during the First World War. By 1940, there were 30,000 Italians residing in Somalia, representing about 3% of the population. During the East Africa Campaign, Somaliland was occupied by British troops and the Potsdam Conference of 1945 declared that the colony would not be returned to the new post-Mussolini government. But from 1950 to 1960, Somalia was a Trust Territory of Somaliland under Italian administration under the condition that independence was granted within ten years. In 1960, Italian Somaliland was united with the State of Somaliland (a British protectorate) as the Somali Republic. 3. Italian concession of Tientsin 1901–1947  Italy’s most distant holding began in 1901 when the Chinese government granted 46 hectares of land for establishing a trading settlement. During the Russian Civil War, the concession served as headquarters for the Italian troops fighting against the Bolsheviks. During the Second World War, the concession held a garrison of about 600 troops. After the Italian government joined the Allies in 1943, the concession was occupied by Japanese troops who were now officially Italy’s enemy. Mussolini later during his brief Italian Social Republic relinquished the concession to Wang Jingwei’s puppet state. In the peace treaty with Italy signed in 1947, the concession was returned to the Republic of China. 4. Libya 1911–1943  Italian soldiers firing upon Turkish troops Prior to the outbreak of the first World War, Italy waged a successful conflict against Turkey (Italo-Turkish War 1911–1912). Libya, an Ottoman domain, was occupied and annexed as a protectorate, eventually becoming a colony. The Italian rule however, was not popular with many Libyans. The Italians spent several years brutally crushing local rebellions, the most prominent being the Senussi order lead by the legendary Omar Mukhtar. The conflict resulted in the deaths of a quarter of Cyrenaica’s population, many of them to atrocities such as mass executions, disembowelment, chemical weapons, mauling by tanks or thrown out of aircraft. Although Mukhtar’s execution in 1932 was a great setback, the Senussi continued to resist Italian presence until the Allied liberation in 1943. With Italy’s and later Germany’s defeat in North Africa, Libya was occupied by British and French forces until 1951. The United Nations passed a resolution calling for an independent Libya which resulted in the formation of the Kingdom of Libya the following year. 5. The Dodecanese islands 1912–1943 Libya was not the only territory gained in the successful war against Turkey, the 12 islands of the Aegean were occupied as well. Although the Italians intended to return the islands to Turkish administration, Turkey renounced its claims during the 1923 Treaty of Lausanne. After the Italian surrender, the islands were occupied by the Germans (though under de jure administration of Mussolini’s Italian Social Republic). Despite an effort by the British to expel them in 1943, the islands held out as the Wehrmacht’s most distant outpost until Germany’s surrender on May 8th 1945. For the next two years, the islands were a British protectorate before being handed over to Greece, despite Turkish objections. 6. Abyssinia / Ethiopia 1936–1943  Though not one of their most successful acquisitions, the Italian invasion and occupation of Abyssinia was their most infamous. For several decades Italy was the laughing stock of the European colonial club for their defeat at the Battle of Adwa in 1896. About forty years later, Italy fared much better in their second attempt to secure Abyssinia for resources, land and prestige. Though they met inefficient resistance from the Imperial army, Italy’s occupation was costly and counter-productive. The earlier mentioned East Africa campaign by the British army quickly threw out the Italian forces in 1941. 7. Albania 1939–1943  Italian troops on an Albanian street Albania is remembered as the only successful wartime occupation made by Italian forces alone. Despite a friendly relationship during the 20s and 30s, King Zog I of Albania refused to renew the economic and political agreements he had made with Mussolini earlier. In response, Mussolini ordered the invasion of Albania and an army of at least 20,000 soldiers supported by a fleet of seventeen warships successfully defeated the poorly-equipped Albanian military. Albania was then incorporated into a union with both countries being officially ruled by the Italian king and controlled by the fascist party. After the Italian surrender in 1943, Albania was occupied by Germany until their defeat on November 29th 1944 by the communist National Liberation Movement. I think this covers the extent of all Italian colonies. Thanks for reading. ",
            "date": "Answered August 20, 2019",
            "views": "13",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Anderson",
                    "user_href": "/profile/Anthony-Anderson-528"
                },
                {
                    "user_id": "Ксюша Чии",
                    "user_href": "/profile/Ксюша-Чии"
                },
                {
                    "user_id": "Carlo Traverso",
                    "user_href": "/profile/Carlo-Traverso-1"
                },
                {
                    "user_id": "Yemoja Lij",
                    "user_href": "/profile/Yemoja-Lij"
                },
                {
                    "user_id": "Maciek Iwaniuk",
                    "user_href": "/profile/Maciek-Iwaniuk"
                },
                {
                    "user_id": "Fernando Corona",
                    "user_href": "/profile/Fernando-Corona-7"
                },
                {
                    "user_id": "Gianmarco Sechet",
                    "user_href": "/profile/Gianmarco-Sechet"
                },
                {
                    "user_id": "Ross Taylor",
                    "user_href": "/profile/Ross-Taylor-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bartolomeo Bresci",
                "href": "/profile/Bartolomeo-Bresci"
            },
            "answer_text": "Eritrea, the first Italian colony (1890c-1941), was token by Ethiopia, the last Italian colony (1936–1941). “Italian” Somaliland (also occupied around 1900, if I am not wrong), was kept under Italian administration up to 1960, as had been decided by the ONU. All these countries in East Africa were occupied for a while, after WWII, by the British, who had fought against Italy, and won. In Ethiopia, the emperor Hailè Selassiè ruled up to 1975, when a military ‘putsch’ forced him to exile. Eritrea fought against Ethiopia for a long time, then, at the end of the last century, re-gained its independence. Somaliland, now a new state covering the whole area of the former British and Italian colonies, after the 1960s was ruled by a couple of dictators, one after the other (sadly, nothing strange or new in Africa), then entered a (now long and uninterrupted) internal fight among various Warlords. America, Italy and others went there for a “peace mission” in 1992, but had to retire after a couple of years. Libya (occupied by Italy 1911–1942) was conquered by the British during WWII, then was ruled by the Senussi King up to 1969, when the well known colonel Gheddafi (Khadafi), with other young officers, took the power and chased the King, the American and British personnel, and all Italians who had not left the country after WWII. He ruled Libya up to 2011, when… well, it happened a few years ago, so surely you know about the war in Libya and so on. Also Ethiopia (the most powerful state in that area) is in a state of fragile peace with Eritrea, and a not-well-known, low-level war with Somalia. It must be remembered that Ethiopia is largely Christian, Somalia Muslim. And Ethiopia is one of the most important allies of the USA in Africa. ",
            "date": "Answered January 28, 2018",
            "views": "864",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carlo Traverso",
                    "user_href": "/profile/Carlo-Traverso-1"
                },
                {
                    "user_id": "Campbell Garner",
                    "user_href": "/profile/Campbell-Garner"
                },
                {
                    "user_id": "Paul White",
                    "user_href": "/profile/Paul-White-110"
                }
            ]
        }
    ]
}