{
    "title": "What is the rotating process in an oil & gas plant? - Quora",
    "tags": [
        "Oil Vs. Natural Gas",
        "Natural Gas",
        "Oil (fossil fuel)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saami Nasar",
                "href": "/profile/Saami-Nasar"
            },
            "answer_text": "The rotating process is done by equipments installed in plants The market for oil and gas equipment has been classified as static and rotating equipment. These equipment are utilized across all verticals of the hydrocarbons industry: upstream, midstream, and downstream. Within static equipment, we have considered valves, heat exchangers, furnaces, and boilers. Valves are vital for controlling the flow of crude oil or natural gas in oil and gas infrastructure such as wellheads, pipelines, and refineries. Boilers are mostly utilized in the refining industry for steam generation or cooling. In refineries, steam is mostly utilized for steam stripping, steam distillation, process heating, and vacuum distillation. Furnaces are used in the oil and gas industry for combustion of solid, liquid, or gaseous fuels to generate heat. Cracking and reforming furnaces are two of the most common types of furnaces used in the oil and gas or petrochemical industry. Heat exchangers are largely required during the refining process in cracking units. They are often utilized in processes, which separate oil from produced water. In natural gas production, heat exchangers are used in liquefaction. Heat exchangers used in the upstream, midstream, and downstream sectors include air cooled, shell and tube, and plate heat exchangers. Rotating equipment majorly consist of compressors, turbines, and pumps. Compressors are used extensively in the oil and gas industry and are often customized according to different requirements. For instance, reinjection compressors used for product enhancement and artificial lifting are rapidly being deployed in underground storage facilities of natural gas. Apart from these, other compressors that are frequently used in the oil and gas industry include flash gas compressors, gas lift compressors, reciprocating compressors, and screw compressors. Gas turbines, especially aero-derivative gas turbines, are currently being deployed in both onshore and offshore oil and gas facilities for mechanical drive and power generation purposes. Pumps are one of the most vital rotating equipment used in the oil and gas industry. Some major types of pumps utilized include centrifugal pumps and positive displacement pumps. Electrical submersible pumps, a sub-type of centrifugal pumps, are being increasingly deployed in offshore and deep-water wells. These pumps occupied a share of nearly 50% in the global artificial lift market in 2014. ",
            "date": "Answered March 7, 2018",
            "views": "799",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pravin Amarshibhaiy",
                    "user_href": "/profile/Pravin-Amarshibhaiy"
                },
                {
                    "user_id": "Amit Raizada",
                    "user_href": "/profile/Amit-Raizada"
                }
            ]
        }
    ]
}