{
    "title": "What battle, raid, or other operation in World War 2 had the lowest casualties? - Quora",
    "tags": [
        "Casualties",
        "Historic Battles",
        "World War II",
        "Warfare",
        "Military",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Donovan Steel",
                "href": "/profile/Donovan-Steel"
            },
            "answer_text": "I don’t know if this is definitely the lowest, but maybe Operation Claymore, along with lots of other commando raids. Commando raids were usually low casualties, for the British, that is, and Operation Claymore was one of these raids that stood out to me. Know one was killed in it. The raid was on the Lofoten Islands, in Norway. British commandos landed at several points and burned or destroyed multiple objectives such as oil tanks and fish boiling plants. They also captured enigma wheel rotors, probably the most important part of the raid as the rotors later helped scientists decipher the code. Only one British commando was wounded. 228 Germans were captured (I am assuming captured don’t count as casualties). This was just a pick from the many commando raids, and many of those raids were largely bloodless as well (but not all. ",
            "date": "Answered September 27, 2020",
            "views": "75",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anthony Thomas",
                    "user_href": "/profile/Anthony-Thomas-480"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ammar Iskandar",
                "href": "/profile/Ammar-Iskandar-5"
            },
            "answer_text": "Operation Fortitude Operation Fortitude was a deception planned by the Allies to divert German forces away from the Normandy landings. It was divided into two parts - Fortitude North and Fortitude South. It took place from March to June 1944. Fortitude South was a diversionary operation that aimed to fool the Germans into thinking the invasion would occur in Pas de Calais. It was done by putting fake armies in Dover. It included dummy tanks, footprints, and tons of equipment. This way, the Germans would think that the build up in ‘men and equipment’ meant that the invasion would occur right across the Channel to its closest target - Pas de Calais.  Dummy tanks being put in Dover. Double agents were also used to feed the Germans fake information. Most notable double agents include Juan Pujol Garcia. Operation Fortitude North was to make the Germans think that Norway could be a point of interest for the Allies. It had buildups of equipment and men in Northern England and even political ties with Sweden. It was indeed a very successful plan. The Germans were completely fooled and German generals even diverted forces over to Calais and Norway, while the invasion actually took place in Normandy. Allied loss in Operation Fortitude? None. Null. Cero. ",
            "date": "Answered September 27, 2020",
            "views": "27",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Norman Allen",
                    "user_href": "/profile/Norman-Allen"
                },
                {
                    "user_id": "Bill Rogers",
                    "user_href": "/profile/Bill-Rogers-77"
                },
                {
                    "user_id": "Shawn Morris",
                    "user_href": "/profile/Shawn-Morris-35"
                },
                {
                    "user_id": "Seppo Kasurinen",
                    "user_href": "/profile/Seppo-Kasurinen"
                },
                {
                    "user_id": "Noel Ellis",
                    "user_href": "/profile/Noel-Ellis-2"
                },
                {
                    "user_id": "John Howell",
                    "user_href": "/profile/John-Howell-164"
                },
                {
                    "user_id": "Grey Gibson",
                    "user_href": "/profile/Grey-Gibson-5"
                },
                {
                    "user_id": "Charlie Mineau",
                    "user_href": "/profile/Charlie-Mineau"
                },
                {
                    "user_id": "David Eliezer",
                    "user_href": "/profile/David-Eliezer"
                },
                {
                    "user_id": "Robert Kenyon",
                    "user_href": "/profile/Robert-Kenyon-17"
                }
            ]
        }
    ]
}