{
    "title": "What is the basic difference in Plato's The Republic and Aristotle's Politics? - Quora",
    "tags": [
        "The Republic (Plato)",
        "Aristotle",
        "Plato"
    ],
    "response": [
        {
            "author_info": {
                "name": "Isidore Fitzroy",
                "href": "/profile/Isidore-Fitzroy"
            },
            "answer_text": "Plato’s Republic isn’t fundamentally a treatise on political philosophy; it’s more a dialogue about the nature of justice and the human character, using the ideal city state as an illustration. Aristotle’s Politics is a comprehensive treatise on political science, describing the various types of states and their institutions, the nature of citizenship, the ideal state, etc. It treats the organization of the ideal state as its direct object rather than simply being peripheral to the main point. ",
            "date": "Answered May 15, 2018",
            "views": "518",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Lowry",
                    "user_href": "/profile/Richard-Lowry-16"
                },
                {
                    "user_id": "Liz Mathews",
                    "user_href": "/profile/Liz-Mathews-4"
                },
                {
                    "user_id": "Walter Piscanc",
                    "user_href": "/profile/Walter-Piscanc"
                },
                {
                    "user_id": "Louise Petersen",
                    "user_href": "/profile/Louise-Petersen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tamim Taj",
                "href": "/profile/Tamim-Taj-1"
            },
            "answer_text": "Political order of Plato By the time of Plato’s birth, age of democratic Athens was coming to an end. His childhood coincided with the Peloponnesian wars that saw Athens defeated by Sparta and this plunged the city into Chaos that lost its empire later through a brief coup – its democracy. During this time greek city states were fighting with each other and Greek unity was an illusion. This shows us that plato held a negative view of the athenian democracy. Plato identified real problems with democracy and it stays valid to this day. Plato explains politics in three of his works – The Republic, The Statesman and The Laws. Notion of Eudomonia by a commoner can be answered as a life of happiness, healthy success and achieving things that you value however Plato had a demanding view of happy life, he said a happy life comes to those who achieve the best of their abilities such as wisdom, courage and justice. Plato stated that virtue should become the central focal point of ones life. It required of people that they apply reasoning and inquiry to every aspects of their lives. It meant detaching yourself from self entered worries and everyday’s concerns. It meant putting the great good ahead of yourself. It meant death was a favourable option over compromising your values. For Plato the existing forms of government were in odds with Eudomonia. Monarchy, oligarchy and democracy had all fostered power hunger and greed and a general disregard for the common good. Plato philosophised an alternative type of government that would create a society based on Eudomonia. This meant that those in charge should be people who dedicate their lives to virtue so they can rule for the common good. In his mind there were just one class of people capable of ruling and they’re the philosophers as they value knowledge and wisdom over all else. Philosophers should become kings. Plato suggested more practical alternatives such as selecting more rational and intelligent among us and educating them on the subject of philosophy so they become capable rulers. In order to achieve this, Plato divided the society into classes where the lower classes have no say what so ever in how the state was run, their role is to obey. Plato has very little sympathy for the arts like poetry and theatre and called it dangerous as it played with emotions that might be counter productive to moral developments. Plato reveals his distaste for democracy with a metaphor. Imagine a ship which has the owner who is also the strongest man on the ship but unfortunately he doesn’t know how to sail, there are sailors who are quarrelling with each other without coming to a conclusion and then there is navigator who knows the direction but doesn’t have any will for leadership. In Plato’s metaphor, the owner is the citizens, sailors are the politicians and navigator is the philosopher. For Plato, democracy was dangerous because leaders depended on popular favours which meant that they would go for short term results. They would avoid long term strategies and focus on measures that are beneficial to their own kind disregarding other factors which leads to conflicts. According to Plato, democracy transcends into tyranny. Plato didn’t hate democracy but stated its leadership needed a popular consent. He felt the system is doomed because general idea of it gifted people down to the lowest Lebel of shared understanding and marginalised the wise which produced poor leaders who made poor decisions which destroyed the state. Although Athenian democracy is different from modern democracy alot of it still applies today. Plato’s views were later overshadowed by Aristotle and other philosophers who considered Plato’s philosophy very authoritarian. Plato’s criticism of democracy remains a reference whenever we look for shortcomings of democracy. Political order of Aristotle Aristotle’s lifetime coincided with the end of classical Greece, once important and powerful states were weakened by slow eclipse of the rising power of Macedon. Later it was annexed by Alexander the great and it allowed Hellenic culture to flourish. Greek civilisation spread to every corner of Alexander’s massive empire specially arts and literature. In a way Macedonian annexation of Greece was ideal to Aristotle. In his early 40’s he was invited by the king of Macedon to tutor Alexander. Aristotle’s work on politics can be seen from two of his works – Nicomachean Ethics (where he explores morality on a more individual level of human beings) and in The Politics (in which he builds on his conceptions of morality and justice to explore best ways to run a state. Aristotle did not subscribe to the notion put forth by Socrates and Plato that questioning and reasoning are the best way to obtain knowledge. Aristotle believed in the power of observation. Aristotle believed in the power of observation. Aristotle used observation to study things including the natural world of plants and animals. He notices that human settlements such as the Greek Polis was similar to ants nests and he concluded that it was human nature to live in a community. Aristotle said man is by nature a political animal, anyone who lives outside of the Polis is either a beast or a god. Aristotle stated that every being has an aim or purpose and he said for humans purpose of life is Eudomonia (happiness or good life). For Aristotle it meant pursuing two types of virtues – Ethical and Intellectual. Ethical virtues include courage, justice, friendliness and truthfulness while intellectual virtue is basically wisdom acquired by observation and reason. Aristotle identified six forms of government and he did that on the premise of two questions – who rules and who’s interests are ruling. Aristotle provided us with 6 types of governments – Monarchy (when a single ruler rules) that can become Tyranny when ruler aims to satisfy his personal interests. He mentioned Aristocracy (most capable rulers govern in the common interests) can become Oligarchy when ruler only satisfies his interest. He also added Polity (ruled by many in common interest) and Democracy which means the rule of many in the interest of many. Aristotle said Monarchy revolves around honour. Tyranny values his own well being over that of his people pleasure the dominant principle of tyranny. Aristocracy revolves around virtue since most virtuous are selected for the positions of leadership. In Oligarchy the state revolves around wealth and wealthy are rewarded prestige positions of power. Democracy revolves around freedom. Polity is never assigned a dominant principle by Aristotle. Even Aristotle felt like his 6 forms of government are not fully adequate. Out of all 3 types of government, Monarchy was the only good idea if there was a man who was so much virtuous than anyone else. Aristocracy is a bit more likely since it assumes that a group of most virtuous people would be more virtuous than the rest of the citizens and therefore have a valid claim in governance. Aristotle acknowledges that polity is the most likely normal form of government. He said Polity could work because of group wisdom meaning a body of citizens would collectively be wise to rule in. Aristotle approved the election procedures through which citizens will be awarded more challenging posts such as the magistrate. Aristotle warns us of any system of governance where power is held by a single faction which causes the state to derail the common interests. Aristotle’s struggle with finding a balance of power and society remains unsolved to this day but most of his thought is very relevant. ",
            "date": "Answered October 6, 2018",
            "views": "14",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anna Ngo",
                    "user_href": "/profile/Anna-Ngo-6"
                },
                {
                    "user_id": "Jyvi Papatiw",
                    "user_href": "/profile/Jyvi-Papatiw"
                },
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                },
                {
                    "user_id": "Richard Lowry",
                    "user_href": "/profile/Richard-Lowry-16"
                },
                {
                    "user_id": "Tanzil Malik",
                    "user_href": "/profile/Tanzil-Malik"
                }
            ]
        }
    ]
}