{
    "title": "What happened after the Second World War? - Quora",
    "tags": [
        "World War II",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Shubham Nigam",
                "href": "/profile/Shubham-Nigam-40"
            },
            "answer_text": "Plenty of things happened after World War II. Keep in mind that the war was a catalyst in that it shaped the world through all the war efforts involved. The US and the USSR were major superpowers established through the war. Colonies began to push for independence, and plenty of countries in Asia and Africa were released from the control of European countries. Because of the war effort, there was plenty of supplies available after the war that allowed the US to become an economical powerhouse. The Cold War also happened. Plenty of more things happened as a result of the World War so this is just a general outcome of the war. ",
            "date": "Answered May 28, 2018",
            "views": "244",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ryan Sullivan",
                "href": "/profile/Ryan-Sullivan-258"
            },
            "answer_text": "Multiple things have happened after WWII, some immediately and some just a few years after the war such as: Lot’s of Nazi’s flee to ArgentinaThe whole world throws huge parties and celebrationsGermany gets split into East and West as well as its capital of Berlin had been split into East and West.The Berlin Wall is builtMaterials and resources become scarce for a while after the war.The Cold War begins.India and Pakistan become independent from Great BritainChina becomes a country and becomes communistKorea splits into North and SouthThe NATO is established",
            "date": "Answered May 28, 2018",
            "views": "430",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ganesh Ramaswamy",
                    "user_href": "/profile/Ganesh-Ramaswamy-23"
                },
                {
                    "user_id": "Stanley Anderson",
                    "user_href": "/profile/Stanley-Anderson-24"
                }
            ]
        }
    ]
}