{
    "title": "What did Japan gain from the Sino-Japanese War and the Russo-Japanese War? - Quora",
    "tags": [
        "First Sino-Japanese War (甲午戰爭)",
        "Russo-Japanese War (1904-1905)",
        "Sino Japanese Relations",
        "Second Sino-Japanese War",
        "Military History and Wars of Japan",
        "Historical Japan",
        "History of Japan",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Farrell",
                "href": "/profile/Mark-Farrell-23"
            },
            "answer_text": "Japan won both wars. The latter in a surprise attack not unlike the 1941 attack on Pearl Harbor. Japan by defeating China was able to occupy Manchuko, or the Korean peninsula. Japan was able to exploit the territory economically. Japan was able to take the northern islands from Russia in the Treaty of Portsmouth brokered by Teddy Roosevelt. The two victories began propelling Japan toward a militaristic path as Japan was eager to enter WWI on the Allies side. Japan then decided it needed trade for raw materials. It resented the European nations exploiting the Pacific region and began a policy of expansion. By 1931 Japan began the Great Pacific War in Korea, then Manchuria and China, and then South East Asia. The British, Dutch, and French attempted to stop them. Meanwhile Japan entered WWII on the Axis side. The US under FDR began to pressure the Japanese to stop their territrial expansion. When the US gave the Japanese an economic ultimatum in 1941 Japan decided on a surprise attack at Pearl Harbor leading the US into WWII. I TV is clear that Japan's twin victories in 1894 and 1905 brought on the militarism and expansionism leading to conflict with both its neighbors and colonial powers. ",
            "date": "Answered May 3, 2018",
            "views": "446",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew James Wright",
                "href": "/profile/Andrew-James-Wright"
            },
            "answer_text": "By beating China in the “Sino-Japanese War” the Japanese replaced China as the main arbiter of Korean affairs. They also took Taiwan from China and thoroughly humiliated the Chinese armed forces. However, this brought the Japanese more into conflict and tension with the Russians, who more or less dominated Manchuria in the early 20th Century and also had an eye on Korea. Once the Japanese failed to come to come to an agreement with the Russians regarding spheres of influence in Manchuria and Korea they gambled on war to readdress the balance of power in the region. Basically the Japanese struck before the Trans-Siberian railway was done and hoped to destroy the Russian Far East fleets, seize Port Arthur, and kick the Russians out of Manchuria to safeguard their position in Korea and expand more into Manchuria themselves. Against many material odds and expectations the Japanese sunk both the Russian Pacific Fleets and Baltic one, took Port Arthur and beat the Russians in Manchuria to the point that they held the southern part of the Chinese Province. Regarding territory they took Port Arthur, the southern part of Sakhalin island, again safeguarded Korea for Japan, and took defacto control of Manchuria and her railways. Basically the “Russo-Japanese War” saw Japan replace Russia as the dominant power in north East Asia and would not be reversed until the end of WW2. ",
            "date": "Answered May 2, 2018",
            "views": "209",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Severin Vogt",
                    "user_href": "/profile/Severin-Vogt"
                },
                {
                    "user_id": "Caleb Kim",
                    "user_href": "/profile/Caleb-Kim-18"
                }
            ]
        }
    ]
}