{
    "title": "What happened to people in a coma in the past? - Quora",
    "tags": [
        "Comas",
        "Neuroscience",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alan Hall",
                "href": "/profile/Alan-Hall-13"
            },
            "answer_text": "When you are in a coma, you are essentially unconscious and can't wake up. Peoplewill try to wake you up, but you just can’t. When you are unconscious, unlikewhen you are asleep, you can't control your body. If something interferes withyour breathing when you are asleep, you will fight to breathe, including thrashingabout and eventually waking up. An unconscious person, or a person in a comawon't; they will just suffocate passively.  It is impossible to feed or provide water to an unconscious person without devicessuch as feeding tubes and/or an IV. Since they didn't have these in the\"past\", a person in a coma would simply die of thirst. ",
            "date": "Answered March 21, 2016",
            "views": "357",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fernando Pandaro",
                    "user_href": "/profile/Fernando-Pandaro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Deneweth",
                "href": "/profile/Ben-Deneweth"
            },
            "answer_text": "Depends on what you define as the \"past\". Most humans in any sort of recent history could tell when someone had a heart beat and was breathing. However, since they didn't have any life support systems prior to modern times. People who fell into a coma had a very narrow window to regain consciousness, otherwise they would die. So no, they didn't bury people alive. They waited for them to either wake up or die, which usually happened fairly quickly. ",
            "date": "Answered March 16, 2016",
            "views": "664",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kathryn Hedges",
                    "user_href": "/profile/Kathryn-Hedges-1"
                }
            ]
        }
    ]
}