{
    "title": "What is the importance of an historical monument? - Quora",
    "tags": [
        "Historic Preservation",
        "Monuments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Haynes",
                "href": "/profile/Patrick-Haynes-6"
            },
            "answer_text": "Monuments are created as contemporary representations of some individual(s) or event that people want to formally recognize. There’s nothing inherently historic or significant about monuments. Rather, monuments are valued for the embodiment of history. By taking the abstract history, and assigning it to a discrete physical thing in the real world, people feel a connection to that history. Furthermore, people view the formal acknowledgement of history by the creation of monuments as reinforcement of a groups values and public policy. Monuments may also embody multiple roles of power, remembrance, or patriotism, such as Trajan’s Column or the Arc de Triomphe. As an aside, people strangely seem to value monuments, over the places where the history actually happened. For example there have been several civil war battlefields that have been threatened with development, turning the hallowed fields, sanctified by the blood of our dead, into strip malls or suburban housing. Why don’t people come out in force to save these battlefields, rather than only mobilizing when a sculpture is threatened? ",
            "date": "Answered February 9, 2018",
            "views": "66",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tiya Paul",
                    "user_href": "/profile/Tiya-Paul-8"
                },
                {
                    "user_id": "Ololade Lawal",
                    "user_href": "/profile/Ololade-Lawal-2"
                },
                {
                    "user_id": "Roshan Ji",
                    "user_href": "/profile/Roshan-Ji-3"
                },
                {
                    "user_id": "Ashok Kumar",
                    "user_href": "/profile/Ashok-Kumar-10790"
                },
                {
                    "user_id": "Angie Westfall",
                    "user_href": "/profile/Angie-Westfall"
                },
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Raj",
                "href": "/profile/Vincent-Raj-39"
            },
            "answer_text": "As implied in the name, historical monuments act as authentic records of history. Especially in civilizations that lack written records, monuments are the only means that throw light on the past. Apart from being a historical record, the monuments bear witness to the artistic, cultural, technological and economic development of the people who created them. They are also heir looms handed over by the past to be protected by the present generation and passed on to the future . ",
            "date": "Answered June 6, 2018",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruma Sengupta",
                    "user_href": "/profile/Ruma-Sengupta-14"
                }
            ]
        }
    ]
}