{
    "title": "What did the Aztecs do to survive? - Quora",
    "tags": [
        "Aztec Empire"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Martinez",
                "href": "/profile/David-Martinez-37"
            },
            "answer_text": "Well that’s condescending… How do you survive in any big city? Division of labor. The Aztecs weren’t primitive by any stretch of the imagination. It was the second largest city in the world in 1519, and had the logistics to match. You had to go to school. There was philosophy and poetry. Your garbage was picked up. They developed an amazing agricultural system by making plantations on the lake, using wood and earth for planting, called Chinampas, so they were food self-sufficient. They had a market and a taxation system. They had an aqueduct with separation of clean and dirty water and which they cleaned regularly. Your poop and that of your animals was collected, put on canoes and surrounded with flowers before delivery to make compost so it wouldn’t smell. Thousands of city workers swept the streets, daily. It was likely the cleanest large city in earth, with a high level of refinement. The Spanish constantly remarked how everything in Tenochtitlán smelled like flowers. So, which city do you live in? How do you survive? BTW it’s almost a certainty an Aztec citizen, if magically transported next to you (or me, for that matter), would remark about your smell and overall hygiene. ",
            "date": "Answered September 5, 2019",
            "views": "600",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "José Carlos Romero",
                    "user_href": "/profile/José-Carlos-Romero"
                },
                {
                    "user_id": "Saul Guillermo",
                    "user_href": "/profile/Saul-Guillermo-1"
                },
                {
                    "user_id": "Maríaluisa David",
                    "user_href": "/profile/Maríaluisa-David"
                },
                {
                    "user_id": "Eduardo Marqués Collado",
                    "user_href": "/profile/Eduardo-Marqués-Collado"
                },
                {
                    "user_id": "Cassiel Raven",
                    "user_href": "/profile/Cassiel-Raven"
                }
            ]
        }
    ]
}