{
    "title": "What did medieval food taste like? - Quora",
    "tags": [
        "History of Food",
        "Cuisine",
        "Food Science",
        "Foodies",
        "Middle Ages (era)",
        "History of Europe",
        "Taste (sense)",
        "Cooking",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Chevallier",
                "href": "/profile/Jim-Chevallier"
            },
            "answer_text": "Whose? When? What most people think of as “medieval food” was the late medieval food of the upper classes. This used a lot of spices and was often thickened with things like puree of peas or crushed toast. What did that taste like? A lot of like Indian food, which uses a lot of the same spices and often uses slightly thickened sauces. Previous generations of Westerners found this weird, but we’re far more used to these flavors today. Late medieval food was very influenced by the east, which is why it tasted so similar to Indian food. Early (upper class) medieval food was more influenced by the Romans and used a different mix of spices (a lot of pepper, notably, often cumin and then some spices which have virtually disappeared today, like spikenard and costus). Also, the Romans loved a kind of fish sauce called garum, very much like today’s Asian fish sauces, so a lot of the upscale dishes would have tasted very salty/fishy to us. What both had in common was a lack of division between sweet and savory. In the early middle ages, people used honey with vinegar; in the late middle ages sugar was often used either with vinegar or the tart liquid verjuice. So they shared an occasional taste for sweet and sour. As to the less well off, all through the period, they often ate coarse bread with weak beer or sour wine, maybe some cheese and/or greens, often broad beans, and sometimes bacon. (Normally, they probably drank water - beer or wine was exceptional, and mainly for meals.) Very rarely meat, if they were really poor, otherwise, some beef at the start of the period and some pork (which lost its status) at the end. No spices though. They were immensely expensive. ",
            "date": "Answered March 16, 2020",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thy Tran",
                    "user_href": "/profile/Thy-Tran-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shanta Sultana",
                "href": "/profile/Shanta-Sultana"
            },
            "answer_text": "The answer depends on which class we are referring too. The class system was very clear and the working class food was quite different than the ruling class. The food of the ruling class used spices and ingredients brought from Africa and Asia and they tasted quite good. Some recipes seem wired now a days however some English upper class recipes are pretty amazing and I love making them. They were infused with nutmeg, mace, herbs and fragrances. The people who served in the urban area had blend and poor quality food. The bread flour sometimes were mixed with harmful ingredients and they felt lucky to have some bacon. They didn’t have access to spices and herbs. The food in the farms tasted better as they had access to fresh ingredients. They didn’t have access to spices however they had lots of flavours to collect from the nature. Nevertheless this changed during the colonial time when people would save money to buy spices. There are records of Georgian farm cooking using Indian spices and a new class emerged in the urban area who went to adventures in the merchant ships and brought spices, silk and other crafts from the colonies. This class was able to have more interesting food. ",
            "date": "Answered March 31, 2020",
            "views": "119",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-2"
                }
            ]
        }
    ]
}