{
    "title": "What is the origin of my last name, Balul? - Quora",
    "tags": [
        "Surname Etymology",
        "Name Etymology",
        "Genealogy",
        "Origins",
        "Surnames"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marie Neophytou",
                "href": "/profile/Marie-Neophytou"
            },
            "answer_text": "As per Indian Vedic astrology the names which start with the letter 'B', those persons are really intelligent in their own characteristics. Through the help of their intelligence they will able to win many critical phases in their life time. Another key skill is the power of imagination. Due to this skill creative career paths are the best and most suitable options for them. Creative writing, imaginary script creation, painting and many more creative fields are really apt for their carrier path. The persons whose names start with letter 'B' are often careless during their travel time or their road trip. So there is a high possibility that they may be injured due to their carelessness. So please try to be conscious while you are in road. These persons are also very charming at their nature. They are really kind hearted by nature. Distressed people will be benefited by these people in true sense. They love to help the people selflessly. They love to depend on someone. But this feature will show them positive and negative both the aspects. So they are asked to judge several times before to depend on someone, because they may harm you. Name Balul or (no variations) means Powerful; Strong; Mighty. This name comes under number 15. Person born with name Balul are the symbol of ecstasy. Those who have the number 15 as prevailing influence upon them, are born with luck. But this lucky charm does not work always for them. Some of factor always remains there to bar their happiness. These natives are largely peace loving men, who can find their happiness in own way. Because of their jolly nature they are loved by everyone around them. But they cannot rely upon anyone. These people need to recognize the right person among the mass. Sometimes they may be extremely careless about their health. These men are advised to take their food on perfect time. Otherwise they may suffer from malnutrition or other problems related to their stomach or liver. These individuals are mostly concerned with their family members. They share everything with their spouses. No matter how bad things get, they do not hide anything from their life partner. They need to keep a patient mind at this time to resolve the trouble. Baby Name Balul meaning and Astrology ",
            "date": "Answered November 3, 2018",
            "views": "135",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "J Ben Hadfield",
                "href": "/profile/J-Ben-Hadfield"
            },
            "answer_text": "See https://dbs.bh.org.il/familyname/bahlul. It is from the Arabic bahlūl (بهلول) meaning 'a little mad'. See also the excellent article at Bahlool - Wikipedia. So, Liam—-i.e. 'helmet of resolution,' a Germanic name—your surname is Arabic. ",
            "date": "Answered November 3, 2018",
            "views": "44",
            "upvotes": "0"
        }
    ]
}