{
    "title": "What is a great book on the history of Probability Theory? - Quora",
    "tags": [
        "History of Mathematics",
        "History Book Recommendations",
        "History Books",
        "Probability (statistics)",
        "Statistics (academic discipline)",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emad Noujeim",
                "href": "/profile/Emad-Noujeim"
            },
            "answer_text": "Adding to the answers already given , I will provide links to books about the history of probability theory (and statistics) , starting with historical books and ending with more recent books . Pierre-Simon Laplace was a proponent of scientific determinism , but he also worked on the theory of probability, wrinting books such as A philosophical essay on probabilities. A more advanced book by Laplace (in French) is entitled Théorie analytique des probabilités . The following book by Isaac Todhunter is informative (on the Internet Archive): A history of the mathematical theory of probability : from the time of Pascal to that of Laplace, by Todhunter, I. (Isaac). Below are two papers by Louis Bachelier : Théorie de la spéculation (1900) : http://archive.numdam.org/article/ASENS_1900_3_17__21_0.pdf Théorie mathématique du jeu (1901): http://archive.numdam.org/article/ASENS_1900_3_17__21_0.pdf A small interesting book by Andrey Kolmogorov : Foundations of the theory of probability : Kolmogorov, A. N. For a probability book from a Keynesian point of view : A Treatise On Probability, by John Maynard Keynes. More recent books about the history of probability , statistics , and related topics include : A History of Probability and Statistics and Their Applications before 1750, by Anders Hald. The History of Statistics: The Measurement of Uncertainty before 1900, by Stephen M. Stigler. Statistics on the Table: The History of Statistical Concepts and Methods, by Stephen M. Stigler. Games, Gods & Gambling: A History of Probability and Statistical Ideas, by F. N. David. The Emergence of Probability: A Philosophical Study of Early Ideas about Probability, Induction and Statistical Inference, by Ian Hacking. See also : Timeline of probability and statistics ",
            "date": "Updated July 16, 2018",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gary Simon",
                    "user_href": "/profile/Gary-Simon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asad Zaman",
                "href": "/profile/Asad-Zaman-39"
            },
            "answer_text": "In my view, the single best book on history of probability is: Gigerenzer et. al. The Empire of Chance: How Probability Changed Science and Everyday Life. In contrast to the literature on the mathematical development of probablilty and statistics, this book focuses on how technical innovations remade our conceptions of nature, mind, and society. The work is aimed at historians of science and philosophers of science, but it is also directed toward scholars in other disciplines and therefore technical material is kept to a minimum. This makes the book unique, and unlike Todhunter and others which focus on technical aspects. ",
            "date": "Answered December 17, 2019",
            "views": "133",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Muhammad Zain Qasmi",
                    "user_href": "/profile/Muhammad-Zain-Qasmi"
                }
            ]
        }
    ]
}