{
    "title": "What happened in America's history to make individualism such a strong part of their culture? - Quora",
    "tags": [
        "Individualism",
        "Culture of the United States of America",
        "Culture (social science)",
        "History of the United States of America",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Constance Hankey",
                "href": "/profile/Constance-Hankey"
            },
            "answer_text": "When America was first being settled by Europeans in the early 1600’s, people were on their own. America was not even recognized as an independent entity until the 1783 Treaty of Paris was signed on September 3, 1783. The Treaty ended the American Revolutionary War and established the early U.S. boundaries. It was a vast, open, unknown territory for the first Europeans, occupied by an unknown number of Native Americans. By the time Christopher Columbus reached the Caribbean in 1492, historians “estimate” that there were 10 million indigenous peoples living in the entire U.S. territory. To help put that in perspective, New York City alone has a population of about 8 million now. For settlers, towns and neighbors were few and far between, especially in the Midwest and West. Everyone had to take care of themselves and their own families. Neighbors and family helped where and when they could. Ultimately though, families and individuals were on their own to make a go of it. My parents taught me and my siblings to be self-reliant and not to depend on the government or anyone else. My parents were children of the Great Depression in the 1930’s. They learned early on not to expect help because there were no or few social relief programs at that time. During the Great Depression, when emergency relief measures were introduced under President Franklin D. Roosevelt, Roosevelt's New Deal focused predominantly on a program of providing work and stimulating the economy through public spending on projects, rather than on cash payments. ",
            "date": "Answered October 23, 2018",
            "views": "576",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Geoffrey Barans",
                    "user_href": "/profile/Geoffrey-Barans"
                },
                {
                    "user_id": "Alec Martig",
                    "user_href": "/profile/Alec-Martig"
                },
                {
                    "user_id": "Mahmoud Alrayes",
                    "user_href": "/profile/Mahmoud-Alrayes"
                },
                {
                    "user_id": "Julie Meyer",
                    "user_href": "/profile/Julie-Meyer-36"
                },
                {
                    "user_id": "Abby de Visser",
                    "user_href": "/profile/Abby-de-Visser"
                },
                {
                    "user_id": "Anthony Middleton",
                    "user_href": "/profile/Anthony-Middleton-12"
                },
                {
                    "user_id": "Diana Aulicino",
                    "user_href": "/profile/Diana-Aulicino-1"
                },
                {
                    "user_id": "Nicholas Thompson",
                    "user_href": "/profile/Nicholas-Thompson-76"
                },
                {
                    "user_id": "Jennifer Neilson",
                    "user_href": "/profile/Jennifer-Neilson-3"
                },
                {
                    "user_id": "Clay Elam",
                    "user_href": "/profile/Clay-Elam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mack Moore",
                "href": "/profile/Mack-Moore-1"
            },
            "answer_text": "What Happened in America’s History to Make Individualism Such a Strong Part of Their Culture? Is individualism really a strong part of American culture? Or does it only look that way as seen through an extremely collectivist lens? Since America is now less individualistic than it has ever been, this can only be considered a relevant area of focus because the world is becoming progressively more collectivist, not because America’s supposedly-prevalent individualism is anomalous. I find it interesting that so many people on Quora pose questions containing the premises that collectivism is saintly or right, and individualism is wrong, selfish, or anomalous; that one is to be pursued, and the other abandoned; that individualism is dominant and luddite, and we need more collectivism in order to become enlightened or balanced. These premises deserve to be reconsidered, especially in the light of the current overwhelming trend toward collectivism. Is either collectivism or individualism really so holy or bedarkened? What about balance between them—isn’t balance better? In fact, we already have dramatically more collectivism than individualism in the American collective mind, so—assuming we were shooting for the golden mean—which way would we really have to go to achieve balance in this post-911 world? Considering that we have already had most of the civil liberties our grandparents took for granted trampled egregiously, more individualism would be required to achieve balance—a lot more! These pro-collectivist premises are manipulatively engineered, an artificial construct, not a reflection of universal human nature or any other substantial reality. We know they are engineered because: These are themes of an overwhelming number of mass media messages,These are the prevailing themes of academic social “science” advocacy (is real science compatible with advocacy?),The predominant assumption that we need more collectivism is disconnected from the reality that we are already almost exclusively concerned about collectivism (that is, people are noticing individualism as excessive, even though it is dramatically atrophied, and already less prevalent than ever, thus the perception is clearly not determined by the thing observed as much as the lens of the observer),The premises conform to the specialized ideology being advocated by mass media and academia rather than being based in the universal foundation of human nature (discussed further below), or any other reality.A Universal Reality Exists—Do We Know What It Is? The universal human values that already exist (and have been measured) are based upon the substantial foundation of human nature. We know that because all humans value the same things, based on broad surveys asking people from all countries what they consider important, resulting in the lists below. The lists below are derived from anthropological research about which there is no significant disagreement—it is well-supported by evidence that humans value these things shown in the lists below—only these things, really, and all of them—regardless of which country they come from (though various individuals and collectives would prioritize them differently). I don't have a link to offer (as I did the research years ago, and developed my analysis quite a bit since then); but if you study the topic you'll find the research pointing to the same source data. We're all “drinking from the same well” here in terms of the source data (the lists of values, as detailed below). Only interpretations of the data may vary. So the universal human values have been measured, and are already well known to anthropology. Considering the Available Data About Universal Human Values Interestingly, the values neatly fall into collectivist and individualist super-categories. That means that humans from all countries, based upon our human nature (because only our nature surpasses all our cultures and forms the basis of what we share universally as a species), consider both collectivism and individualism vitally important, even the hierarchical top level of our entire value system as a species. Because the two super-categories are present in all countries, apparently all humans find it important to balance collectivism with individualism (though not everyone has thought it through enough to realize the implications).  Between these super-categories of real universal human values, there is no right or wrong! The pursuit of one (either individualism or collectivism) to the exclusion of the other is a false dichotomy. Yet the post-911 world is currently pursuing collectivism to the exclusion of individualism, and it is creating a greater and greater imbalance toward collectivism, which is creating authoritarian states at risk of becoming totalitarian ones. Meanwhile, we apparently don’t realize we are losing freedoms, as we continue paying lip service to freedom values, while collectively opposing them for the sake of safety. Is putting safety above freedom wise? Can our new “guardian” really be trusted to keep us safe? A lot of energy being invested in a false dichotomy to create a greater and greater imbalance toward collectivism, resulting in exploitive authoritarian states, a short step away from totalitarian ones, is another evidence of manipulative engineering leading to an artificial construct. The engineer who owns the entire global mass media apparatus calls this construct “The New World Order”. They have an agenda. We cannot understand the world as it is without understanding their agenda. As you look through the data about what individualism really is (found in the list below), can you really find fault with it? Many people try, under this engineered premise that “individualism is wrong” and “we already have too much individualism”, but when you really consider what individualism is, that premise falls apart. Consider the list of individualist values below and see what you’re really criticizing! Which of these individualist values are really “bad”? Which ones are you personally willing to abandon right now—and for the rest of your life—in order to create your supposed collectivist utopia—and how would your giving up those individualist values help your collective? Can it realistically be done? If it could, would the world be better off? Have you thought it through? Or is this collectivist advocacy a case of unexamined groupthink (aka herd mentality)? If it is unexamined groupthink, then that is another evidence of manipulative engineering. People do not arrive at original conclusions without first thinking it through; though we can be influenced by herd mentality (created by mass media mind control and culture manipulation) that way. Note that original thinking (intellectual sovereignty) is an important individualist value that helps us overcome unexamined groupthink. Are you now suffering intellectual indiscipline because of having renounced this aspect of individualism and having trusted unexamined groupthink too much? Don’t be surprised that intellectual sovereignty is now becoming more and more rare (and unexamined groupthink is becoming more and more common) because of the imbalanced advance of collectivism. Collectivism is not an ultimate good; and individualism is not at all bad. Both are good, both are needed, and the two should be balanced with one another if we hope to ever have a mature, stable, free, and harmonious society. History has already shown us how absolute collectivism (the suppression of individualist values) is sick and harmful, bringing out the worst events and conditions in human history (including totalitarianism and genocide). Shouldn't we learn from history? I think it's liberating to discover that all humans share the same set of values. We do not disagree in any meaningful way about what matters—not really. Rather, we only prioritize the values differently; and that personal or cultural prioritization is an essential factor that makes us unique as individuals and cultures. That uniqueness is a good thing for us as individuals. It enables us to express ourselves authentically, and pursue our true life’s journey. Balancing the collectivist and individualist values is good for us as collectives. See past the manipulatively-engineered premise based on a specialized ideology that is incompatible with universal human nature—the reality beyond the artificial construct. For one is true/valid, and the other false/invalid. The Categories of Values Freedom is an individualist category because individuals seek to protect personal freedoms despite the constraining demands of their collective. Fun, pleasure, and universality are individualist categories because individuals want to have fun, pleasure, and meaningful lives; while collectives aren't affected by the personal experience of fun, pleasure, or meaning. Additionally, universality is an individualist category because individuals have souls that seek meaning; while collectives are easily manipulated by political power mongers (the modus operandi of all political dynamics), making the entire collective more and more alienated from universality. Power is an individualist category because individuals seek to preserve a measure of their personal power in relation to other individuals and the collective, so as to achieve their goals and so as not to become oppressed. Benevolence is a collectivist category because it is concerned with whether individuals are acting benevolently toward other individuals and the collective. Conformity is a collectivist category, because it seeks to restrain potential damage to the collective caused by individuals who might otherwise become loose cannons. Peace and tradition are collectivist categories, because they support the cohesiveness and productiveness of the collective. Performance is a collectivist category because it is concerned with whether individual members of a collective are pulling their weight by performing sufficiently for the benefit of others and the collective. Sometimes freedom is framed as “bad”, but can you really have a good collective that tramples the freedoms of its individuals? Without freedom there can be no civil rights, and oppression of individuals becomes the norm. No one wants that. Freedom is good. Power is sometimes framed as “bad”, but only powerful people can be gentle. Like a cornered bear, those persons who believe themselves powerless tend to be the most vicious and cause the most harm to others. No one is truly powerless. To think of powerlessness as virtue is a mind fuck. Absolute powerlessness means death—definitely not a desirable goal. We have to be confident in our power in order to be kind and loving. We have to be powerful as individuals in order to hold our collectives accountable to democratic will; otherwise, it is just too easy for a powerful collective to steamroll its individual members, trampling our civil rights. So power is not bad, only an excess imbalance of it turns out that way. Too much power corrupts us, yes. But too little kills or enslaves us. As usual, balance should be the goal. Today's collectivists advocate collectivism of course, but do they realize they're advocating conformity and performance demands on individuals for the benefit of the collective? Are those advocates really quick to offer unilateral conformity and performance in all these ways for the benefit of their collective? Or are they not also individuals who want that to be balanced with their own personal individualist needs? Consider carefully before you answer, please. Glib answers without thinking it through are disingenuous and unworthy of credence. Today's collectivists often frame tradition as being unimportant, yet without tradition, the universal reality of human nature tells us that a collective would have no shared group identity or cohesiveness without tradition. So undermining tradition is a very anti-collectivist thing to do. Yet today's collectivists do it with gusto. This incongruency between what turns out to be a specialized ideology and universal human nature is another evidence that manipulative engineering (not alignment with reality or universal human values) is in play. The underlying reality is superior to the artificial construct. One has substance and persistence; and the other is only a symbolic referent. We should thoroughly understand and harmonize ourselves with the substantial persistent reality, for artificial constructs—and especially manipulatively-engineered thinking—changes from year to year, and is likely to be a deception leading us away from upholding our true values. Since the artificial construct is created by political power mongers who care about their own selfish values (particularly imbalanced exploitive power for themselves and oppression for everyone else), the outcome they are trying to engineer is not consistent with our own universal human values. We should see past their machinations if we want the important things for ourselves and our collectives, should we not?____ Source Data: the Universal Individualist Values Themselves Freedom: Freedom as opposed to Frivolous Constraints, Authenticity as opposed to Conformity, Easy Going as opposed to Rigid, Flexibility as opposed to Doggedness, Health as opposed to Disease, Idealism as opposed to Practicality, Independence as opposed to Neediness, Privacy as opposed to Panopticism, Silence as opposed to Talkativeness Fun: Excitement as opposed to Boredom, Challenge as opposed to Too Easy, Humor or Wit as opposed to Dryness, Variety as opposed to Sameness, Vitality as opposed to Reticence Pleasure: Pleasure as opposed to Stoicism, Convenience as opposed to Struggle, Creativity as opposed to Tedium, Intimacy as opposed to Loneliness, Lightheartedness as opposed to Overseriousness, Mind-Expanding Substances as opposed to Narrow-Mindedness, Sophisticated as opposed to Ordinary Power: Prestige or Recognition as opposed to Obscurity, Abundance as opposed to Scarcity, Accomplishment as opposed to Having Nothing to Show, Boldness as opposed to Timidness, Classy as opposed to Crude, Competitiveness as opposed to Aloofness, Confidence as opposed to Self-Doubt, Depth as opposed to Superficiality, Dignity as opposed to Self-Deprecation, Drawing Boundaries as opposed to Overtolerant, Insightful About Ideas as opposed to Limited Awareness, Intellectual Discipline as opposed to Mentally Frivolous, Intelligence as opposed to Weak-Mindedness, Intentionality as opposed to Random or Casual, Knowledge as opposed to Ignorance, Leadership as opposed to Quagmire, Opportunity as opposed to Discrimination, Problem-Solving Ability as opposed to Helplessness, Skillfulness as opposed to Ineptitude, Social Grace as opposed to Awkwardness, Sound Judgment as opposed to Foolishness, Substance as opposed to Flash, Tranquility as opposed to Worry, Transcendance as opposed to Reactionism, Vigor or Physical Strength as opposed to Weakness Universality: Significance or Spirituality as opposed to Meaninglessness, Awareness as opposed to Obliviousness, Balance as opposed to Extremism, Faith as opposed to Fatalism, Frugality as opposed to Waste, Good Will as opposed to Hostility, Gratitude as opposed to Complaint, Justice as opposed to Moral Error, Minimalism as opposed to Materialism, Natural as opposed to Artificial, Open-Mindedness as opposed to Prejudice, Purpose as opposed to Disengagement, Steadfastness or Dedication as opposed to Wavering, Stewardship as opposed to Exploitation Source Data: the Universal Collectivist Values Benevolence: Service as opposed to Egocentrism, Compassion or Warmth as opposed to Detachment, Emotional Self-Mastery as opposed to Savagery, Healing as opposed to Harm, Honesty as opposed to Deception, Honor as opposed to Disgrace, Kindness as opposed to Indifference to Others' Feelings, Loyalty as opposed to Fickleness, Mutuality as opposed to Abuse, Openness as opposed to Secretiveness, Presence as opposed to Distractedness, Remorse as opposed to Sociopathy, Sincerety as opposed to Manipulativeness, Straightforwardness as opposed to Evasiveness, Trustworthiness as opposed to Betrayal Conformity: Unity as opposed to Divisiveness, Acceptance as opposed to Judgmentalism, Civility as opposed to Ill Mannered, Collective Wisdom as opposed to Self-Determination, Cooperation as opposed to Stubbornness, Deference to Others as opposed to Willfulness, Forgiveness as opposed to Holding Grudges, Humility or Respect as opposed to Arrogance, Optimism as opposed to Pessimism, Order as opposed to Chaos, Patience as opposed to Quickness to React, Seriousness as opposed to Frivolously Playful, Tact as opposed to Bluntness, Trust as opposed to Cynicism Peace: Harmony as opposed to Conflict, Caution as opposed to Recklessness, Communicativeness as opposed to Silence, Family Integrity as opposed to Frivolous Break Up, Followership as opposed to Contentiousness, Safety as opposed to Danger, Surrender as opposed to Vigilance Performance: Industriousness as opposed to Laziness, Ambition or Initiative as opposed to Doldrums, Chastity as opposed to Promiscuousness, Competence as opposed to Carelessness, Courage as opposed to Avoidance, Decisiveness as opposed to Equivocation, Determination as opposed to Convenience, Diligence as opposed to Half-Heartedness, Fidelity as opposed to Giving Cause for Jealousy, Generosity as opposed to Stinginess, Modesty as opposed to Seeking Attention, Originality or Uniqueness as opposed to Duplication, Punctuality as opposed to Tardiness, Reliability or Commitment as opposed to Flakiness, Resourcefulness as opposed to Idleness, Responsibility as opposed to Shirking, Simplicity as opposed to Pretenciousness, Sobriety as opposed to Addiction, Supportiveness as opposed to Indifference to Others' Struggles, Tidyness as opposed to Sloppiness, Understanding Toward People as opposed to Limited Perception Tradition: Tradition as opposed to Frivolous Radicalism, Grace or Gestalt Awareness as opposed to Deconstructionism, Law Abiding as opposed to Illegal, Practicality as opposed to Idealism, Realism as opposed to Wearing Rose-Colored Glasses, Simple Clarity as opposed to Obfuscation or Ambiguity, Stoicism as opposed to Indulgence  ",
            "date": "Answered May 4, 2019",
            "views": "96",
            "upvotes": " Not for Reproduction"
        }
    ]
}