{
    "title": "What is France? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Thierry Baudassé",
                "href": "/profile/Thierry-Baudassé"
            },
            "answer_text": "France is an oxymoron. I insist on the “oxy” :) I mean that France is the reunion of apparently opposite and contradictory notions. France is a latinised Germanic country (and Celtic country). Even if we are probably closer genetically to the German tribes that gave their name to our country (the Franks) or to the Celtic tribes that constitute our mythic origin (the Gauls, you know, Asterix, “nos ancêtres les Gaulois”), our culture is basically Latin, which makes us close to the Spaniards, the Italians or the Latin Americans. France is a maritime country with deep agrarian roots. France has currently the biggest maritime area in the world (technically, the biggest EEZ - Exclusive economic zone - Wikipedia, the USA being only the second EEZ), but we are deeply a country of farmers, attached to the land and the agriculture (and France is also the 6th agricultural producing country, after China, the US, Brazil, India and Russia, all very large countries: Top 10 Agricultural Producing Countries in the World). France is a universalist patriotic country. I think it’s obvious enough that we want to keep our culture, our language, and that we don’t like the tendency of a unique english speaking culture throughout the world (that’s also our “Asterix complex”). We are very reserved about globalisation and the loss of cultural diversity. At the same time we are intrinsically globalist and open. When we wrote the “Declaration des droits de l’Homme”, we defined basically the same human rights already defined in the Independence Declaration of the USA a few years before, but we defined them, and that was a big change, not only for our citizens, but for all Human beings, everywhere in the world and whatever is their race or condition. The concept of Humanity was defined in France since the Renaissance, and developed during the Enlightenment by French philosophers like Montesquieu, Condorcet, Diderot, Voltaire or Rousseau. These concepts were defined since the beginning in order to be exported and adopted throughout the world… So we believe in our “global vocation” or “global character”: France is not limited to its frontiers and we must “project” our vision in all the world, thanks to our diplomacy, our “Alliances Françaises”, our “lycées français” etc… France is also an individualist country believing in the State. French individualism differs from American individualism. American individualism opposes the liberty of individual to the existence of the State. That’s why the second amendment allows Americans to carry gun and constitute militias. For the French, the existence of the State, and the strength of the State, is the guarantor of individual liberty. Without a strong State, the liberty would be the liberty of the wolf in the hen house, that is, the law of the strongest. We believe in the State, because we believe the State is the only way to insure individual liberty. I could probably go on and on with this line of thinking. But my response is this one: France is an Oxymoron. ",
            "date": "Updated June 29, 2020",
            "views": "36",
            "upvotes": " View 92 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hooman Sassavid",
                    "user_href": "/profile/Hooman-Sassavid"
                },
                {
                    "user_id": "Allister Sanchez",
                    "user_href": "/profile/Allister-Sanchez"
                },
                {
                    "user_id": "Oliver Sieg",
                    "user_href": "/profile/Oliver-Sieg"
                },
                {
                    "user_id": "Riccardo Sciolti",
                    "user_href": "/profile/Riccardo-Sciolti"
                },
                {
                    "user_id": "Poppy Cotzee",
                    "user_href": "/profile/Poppy-Cotzee"
                },
                {
                    "user_id": "Jack Loup",
                    "user_href": "/profile/Jack-Loup"
                },
                {
                    "user_id": "Olivier Servoise",
                    "user_href": "/profile/Olivier-Servoise"
                },
                {
                    "user_id": "Geneviève Duchêne",
                    "user_href": "/profile/Geneviève-Duchêne"
                },
                {
                    "user_id": "Tanya Petrova",
                    "user_href": "/profile/Tanya-Petrova-1"
                },
                {
                    "user_id": "Clem West",
                    "user_href": "/profile/Clem-West"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurent Decker",
                "href": "/profile/Laurent-Decker-1"
            },
            "answer_text": "Waw. We need to be a group of people to answer this. I modestly try to start it. Seen from my own window :  First, France is a territory, with a good land to grow crops or anything, good climates on different lands (mountains, etc.), thousands kilometers of coasts to open seas (with good harbours) and nearly everything (even metals, coal, sun of course) to make theorically a 100 million people live happy together here. (We are about 65 mi by now). France is situated on main roads relying countries of Europe (Spain to Germany, England to Italy, etc.). Its territory is crossed by trucks and people on holidays - but in the past 2500 years, invaders from everywhere went and indeed established in this territory, which is not easy to defend, above all against motivated hungry people! So, France is also its people (we all come from motivated invaders or migrants), and it's been built by them, to grow happy if possible. Who are the historic natives? We don't know. We know Kelts established there at first, coming from steps of Eastern Europe. Then... Anybody (nowadays report)! \"France\" name even refers to some invaders : the german Francks (very motivated indeed). Of course even early natives were coming from somewhere else (easy, folks: we all come from Africa !). This makes diversity in our people. This brings creativity and diverse good food receps (Romans essentially transmitted our exigency about food). We are good farmers, sailors, smiths, tailors, doctors and so on - even respected in technologies and sciences. We love philosophy, politics, football or snowboard. However, we are not the best in everything - but we know it.This diversity in its people makes France hard to gather. If I exclude world wars and 1998 world football cup, we even don't know each other! Please ask a Breton what he thinks of Alsacians: \"nothing : it's too far from us\" (just a thousand kilometers for great sailors like Bretons!... As you see, it is more a question of culture separation, even if I choose two extremes). E.g. De Gaulle said once: \"it is hard to rule a country that has 480 sorts of cheese\" (he loved cheeses). France has a rich History, made of hard times and good rememberings (even exclusing 1998 cup). This makes it even more complicated, but very interesting because he did influence us ... E.g. Francks made our governments prefering coutrymen interests (and wars on earth), against overseas trade or conquests.Now, we are a laïc country (no particular religion, but everyone is free). In the past, our culture and morals were influenced (deeply, even to exclusion of the others) by one main religion (Catholic). France is an independant country - although we are more and more dependant on Europe's organization, which is planned to become an independant country by itself, but when? Good or bad? It's a point. For the moment, more good than bad. For some, France would better fold on itself, closing frontiers with 4meter-high walls and machine guns spots every 100meters - and throwing away strangers. Strangers? They mean 64,5 million people away (letting only neandertalians...)  ? I don't see :-)There is still a lot to tell....",
            "date": "Answered March 1, 2016",
            "views": "791",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cyril Nadarien",
                    "user_href": "/profile/Cyril-Nadarien"
                },
                {
                    "user_id": "Remi Nebout",
                    "user_href": "/profile/Remi-Nebout"
                },
                {
                    "user_id": "Jake Arthur",
                    "user_href": "/profile/Jake-Arthur-3"
                },
                {
                    "user_id": "Toby David Low",
                    "user_href": "/profile/Toby-David-Low"
                },
                {
                    "user_id": "Shim On Um",
                    "user_href": "/profile/Shim-On-Um"
                },
                {
                    "user_id": "Alankrit Gautam",
                    "user_href": "/profile/Alankrit-Gautam"
                },
                {
                    "user_id": "Kamilija Xotwod",
                    "user_href": "/profile/Kamilija-Xotwod"
                },
                {
                    "user_id": "Amarya Hiamal",
                    "user_href": "/profile/Amarya-Hiamal"
                },
                {
                    "user_id": "Narendranath Nair",
                    "user_href": "/profile/Narendranath-Nair"
                },
                {
                    "user_id": "Christian Benesch",
                    "user_href": "/profile/Christian-Benesch"
                }
            ]
        }
    ]
}