{
    "title": "What does New Song mean in the Bible? - Quora",
    "tags": [
        "The Bible"
    ],
    "response": [
        {
            "author_info": {
                "name": "Happy Riches",
                "href": "/profile/Happy-Riches"
            },
            "answer_text": "Actually, in the Bible, a new song is not just something that suddenly pops into one’s mind, like songs are sometimes wont to do. Although, this is the impression we may get from Psalm 144:9. I will sing a new song to thee, O God; upon a ten-stringed harp I will play to thee. (Psalm 144:9)Music can have sublime qualities. To quote from Four instances of the sublime in music: Possibly more than any other form of art, it is music that lends itself most often and most effectively to feelings of the sublime. Some even ask why should the Devil have all the good music. However, there is music that is more sublime than what we mere mortals at the present time can imagine. Sublime indeed is the song that is sung by those in Heaven, and by those who receive the Kingdom of Heaven within their very being, as a taste of that which is to come. And when he had taken the scroll, the four living creatures and the twenty-four elders fell down before the Lamb, each holding a harp, and with golden bowls full of incense, which are the prayers of the saints; and they sang a new song, saying, “Worthy art thou to take the scroll and to open its seals, for thou wast slain and by thy blood didst ransom men for God from every tribe and tongue and people and nation, and hast made them a kingdom and priests to our God, and they shall reign on earth.” (Revelation 5:8-10)O sing to the Lord a new song, for he has done marvelous things! His right hand and his holy arm have gotten him victory. (Psalm 98:1)He put a new song in my mouth, a song of praise to our God. Many will see and fear, and put their trust in the Lord.hearts of men, (Psalm 40:3)And they sing a new song before the throne and before the four living creatures and before the elders. No one could learn that song except the hundred and forty-four thousand who had been redeemed from the earth. (Revelation 14:3)Praise the Lord! Sing to the Lord a new song, his praise in the assembly of the faithful! (Psalm 149:1)Those who have received the joy of salvation have a new song in their heart, even if they cannot sing. Unfortunately, even those declared to possess angelic voices will not be able to sing if they reject the Heavenly gift. The Salvation Of The Lord Comes With The Gift Of Joy For All Who Receive ",
            "date": "Answered August 7, 2017",
            "views": "35",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Greg McCann",
                    "user_href": "/profile/Greg-McCann-1"
                },
                {
                    "user_id": "Wendy D. Beard",
                    "user_href": "/profile/Wendy-D-Beard"
                },
                {
                    "user_id": "Ashwani Masih",
                    "user_href": "/profile/Ashwani-Masih-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Immistic Emmanuel",
                "href": "/profile/Immistic-Emmanuel"
            },
            "answer_text": "As is evident from the Song of Solomon, a song is basically a beautifully expressive speech emanating from a gracious heart. (see Ps 45:1) Such a song is said to be “new” when expressed with fresh vigour and appreciation on account of the new experiences of the “singer.” Consider what the Scriptures has to say about “new songs:”  Sing to him a new song; play skillfully on the strings, along with shouts of joy. Jehovah has frustrated the schemes of the nations; he has thwarted the plans of the peoples.—Psalms 33:3, 10. He brought me up out of a roaring pit, out of the slimy mire. And he set my feet upon a crag; he made my footing secure. Then he put a new song in my mouth, praise to our God.—Psalms 40:2, 3. Sing to Jehovah a new song. Sing to Jehovah, all the earth! Declare his glory among the nations, his wonderful works among all the peoples.—Psalms 96:1, 3. Sing to Jehovah a new song, for he has done wonderful things. His right hand, his holy arm, has brought about salvation.—Psalms 98:1. O God, I will sing to you a new song. I will sing praises to you, accompanied by a ten-stringed instrument, to the One who gives victory to kings, the One rescuing his servant David from the deadly sword.—Psalms 144:9, 10. Praise Jah! Sing to Jehovah a new song; praise him in the congregation of the loyal ones. Let the loyal ones exult in glory; let them shout for joy upon their beds.—Psalms 149:1, 5. Sing to Jehovah a new song, his praise from the ends of the earth. Jehovah will go out like a mighty man. He will show himself mightier than his enemies.—Isaiah 42:10, 13.  You may already have discerned from these excerpts that “new songs to Jehovah” refer to joyful expressions of praises to Him in appreciation of His grand acts of deliverance. This can also help us identify the new song referred to at Revelation 14:3, as the 144,000 praise Jehovah for the everlasting redemption He has freely granted to them through His Son.—Revelation 5:9, 10. It is entirely fitting, therefore, for the 144,000 ALONE to be singing this new song, since they ALONE have been ‘saved for God's heavenly Kingdom.’—2 Timothy 4:18. ",
            "date": "Answered June 21, 2019",
            "views": "727",
            "upvotes": "0"
        }
    ]
}