{
    "title": "What does nucleotide analog mean? - Quora",
    "tags": [
        "Nucleotide",
        "Analog",
        "Analog Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Can Sonmezer",
                "href": "/profile/Can-Sonmezer-1"
            },
            "answer_text": "Nucleotide analogs are molecules, which structurally resemble nucleotides, the building blocks of RNA and DNA. Often, nucleotide analogs are recognized by the cellular machinery, e.g. DNA Polymerase, meaning that these molecules fit into the “pockets” of given enzymes due to their similarity to nucleotides. In most cases however, nucleotides analogs are significantly different than their nucleotide counterparts, i.e. they fluoresce or possess other biochemical properties. In research and medicine, nucleotide analogs are used to visualize (e.g. cell proliferation) or interfere with (e.g. DNA/RNA synthesis) certain bioprocesses. Blocking DNA/RNA synthesis with nucleotide analogs is especially of interest in development of antiviral therapeutics. Since the structure of viral polymerases differ from eukaryotic ones, scientists managed to synthesize and identify small molecules which are recognized by viral polymerases as nucleotides. Importantly, these molecules neither get recognized by human enzymes, nor carry out their function when bound to viral polymerases. Therefore, nucleotide analogs bring polymerization reactions bring to a halt in a target specific manner; They make for excellent antivirals. Don’t believe me? Go check out your Herpes cream. ",
            "date": "Answered March 4, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reuben Urban",
                    "user_href": "/profile/Reuben-Urban"
                },
                {
                    "user_id": "Sinan Cakmak",
                    "user_href": "/profile/Sinan-Cakmak"
                },
                {
                    "user_id": "Ahmed Elnemaky",
                    "user_href": "/profile/Ahmed-Elnemaky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard Peek",
                "href": "/profile/Bernard-Peek"
            },
            "answer_text": "An analog (analogue in British English) is a molecule that mimics the shape of another molecule. In medicine they are used to disrupt metabolic pathways. The analogue fits into the active site of an enzyme but because it is chemically different it does not react in the same way that the normal substrate does. It’s the biochemical equivalent of stopping a lock from working by filling it with glue. ",
            "date": "Answered March 3, 2017",
            "views": "405",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahmed Elnemaky",
                    "user_href": "/profile/Ahmed-Elnemaky"
                },
                {
                    "user_id": "John Bøgelund Unger",
                    "user_href": "/profile/John-Bøgelund-Unger"
                }
            ]
        }
    ]
}