{
    "title": "What World War II myths are still believed today? - Quora",
    "tags": [
        "Common Misconceptions",
        "World Wars",
        "Myths, Legends and Untruths",
        "Mythology",
        "World War II",
        "Belief and Beliefs",
        "World History",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Joo",
                "href": "/profile/Jerry-Joo-3"
            },
            "answer_text": "1 . D-Day  The Normandy invasion - also known as D-Day - is always remembered as \"the United States that beat back Germany.\" By far, this transoceanic raid was the most massive attack in history. The ambush was a massive operation aimed at taking parts of Nazi-occupied Europe and is widely seen as a turning point in the war. Apart from the allied nations that fought at the Eastern Theater, almost everyone at that time took part in it and considered themselves victorious. Despite being a joint operation, the Normandy Invasion is still referred to as 'belonging' to the US, even in other countries. In fact, although the US contribution to the invasion was important, it did not lead the landings in Normandy at all. There were British who provided combat resources during the invasion. British warships outnumber US warships, namely 4: 1. Thirty-one percent of supplies for the invasion came from Britain, as well as two-thirds of the 12,000 allied aircraft that were deployed. Most of the military leaders who led the entire operation were also British. 2. The Hiroshima and Nagasaki Bombs Are Not the Worst in Japan  There are many myths that grow in the community about the atomic bombs on Hiroshima and Nagasaki at the end of World War II. History has much to say about this controversial attack. Some believe that the dropping of bombs must be done to make Japan surrender. While it is certain that the use of an atomic bomb would have killed many people, especially civilians, there were other bomb attacks in Japan that had the same effect as the atomic bomb. It is an incendiary bomb, the most destructive bomb attack in the history of Sakura Country which is said to have also been aimed at civilians. These attacks were exacerbated by the recent discovery of napalm (thickened gasoline for incendiary bombs). More than 500,000 cylinders full of napalm and petroleum jelly were dropped on wooden and paper houses in the most populous part of the city: Tokyo. According to some estimates, more than 100,000 civilians were deliberately burned to death in one night. In the aftermath of the attacks, more than one million people were reported disabled and another million left homeless. 3. The Polish Cavalry Never Happened  One of the most repeated stories from World War II is about the Polish cavalry at the Panzer Kaserne (US military installation in Boblingen, Germany, part of the US Army Garrison Stuttgart). The cavalry is said to be the last cavalry in military history and is general evidence of the superiority of the Polish cavalry. However, it is said that the Polish cavalry never really existed, even if they were known as one of the best cavalry in the world. The myth about the Polish cavalry was said to have been spread by the Nazis in an attempt to portray Poland as an ugly warrior, far removed from courage and bravery. On the one hand, the Polish resistance played a large role in the emancipation of many Nazi-controlled areas throughout Europe. They also contributed greatly to the allied forces that defeated the Nazis, although their participation is now forgotten. 4. Starting in 1939?  Generally, all are told that World War II began with the Nazi invasion and occupation of Poland in 1939. That is what is taught in schools around the world, except for schools in countries whose wars had raged long before 1939. However, some historians say that placing the onset of the war around 1939 is a somewhat European-centric view. In fact, many other conflicts are considered part of World War II, which began much earlier than 1939. However, it all depends on the expert you ask. Some say the fighting has been going on since 1931, when Japan invaded Manchuria. Others say that World War II took place in 1937, when Italy invaded Ethiopia. However, most non-European and American historians agree that this fighting did not occur later than 1937, when Japan invaded mainland China in one of the most brutal invasions in history. 5. The number of victims of the Holocaust is 6 million  The Holocaust was the most terrible part of World War II. The systematic killing of six million Jews throughout Nazi-controlled territories left the world stunned when the war ended. As a result of the genocide, many international resolutions were formed, promising that such tragedies would never be repeated in the postwar period. However, what we often forget about the \"six million deaths\" tally is that the Jews were not the only targets of Adolf Hitler's regime. The concentration camps were rather inclusive buildings, accommodating a wide variety of people the Nazis didn't like. Holocaust casualties were much higher if you looked at the content of other prisoners in the camp, such as political factions as opposed to the Nazis, Soviet POWs, gypsies (Roma), Poles, homosexuals, and Serbs. According to some estimates, the Romans lost 70 to 80 percent of the population in Europe to the Holocaust. Although they do not have an exact figure for the total number of deaths, historians put the whole number due to the Holocaust in the range of 15 to 20 million. Source ; Translation from 5 Mitos Perang Dunia II yang Masih Dipercaya hingga Hari Ini ",
            "date": "Answered October 20, 2020",
            "views": "1",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Jan Antoni",
                    "user_href": "/profile/Jan-Antoni"
                },
                {
                    "user_id": "Will Wenmohs",
                    "user_href": "/profile/Will-Wenmohs"
                },
                {
                    "user_id": "Ben Fall",
                    "user_href": "/profile/Ben-Fall-2"
                },
                {
                    "user_id": "Zachary Huffman",
                    "user_href": "/profile/Zachary-Huffman-15"
                },
                {
                    "user_id": "Tama Tahana",
                    "user_href": "/profile/Tama-Tahana"
                },
                {
                    "user_id": "Brian Gogarty",
                    "user_href": "/profile/Brian-Gogarty-1"
                },
                {
                    "user_id": "Ivo Alpuim",
                    "user_href": "/profile/Ivo-Alpuim"
                },
                {
                    "user_id": "Jone Orfanakhs",
                    "user_href": "/profile/Jone-Orfanakhs"
                },
                {
                    "user_id": "Rishi Raj",
                    "user_href": "/profile/Rishi-Raj-1902"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brent Cooper",
                "href": "/profile/Brent-Cooper-34"
            },
            "answer_text": " German supply column mired during the Rasputitsa on the Eastern Front. Germany’s Invasion of the Balkans Delayed and Doomed the Invasion of the USSR “This myth has it that Germany’s invasion of the USSR, which supposedly ground to a halt because of Russia’s winter, would have succeeded if it had only started a month or two earlier than its actual launch date of June 22, 1941. The reason it did not start earlier, goes the myth, is because Hitler got entangled in the Balkans, invading Greece and Yugoslavia in April of 1941, which delayed the launch of Operation Barbarossa.“ “The first flaw in the myth’s logic is that it gives winter top billing for stopping the German advance. However, other factors such as fierce Soviet resistance, the over extension of German supply lines to the snapping point as the Wehrmacht plunged ever deeper into the USSR, and autumn rains, had already brought the German advance to a halt before the first snowstorms. The Germans had to regroup, giving the Soviets a needed breather, before resuming the advance on Moscow. Hitler’s soldiers were unprepared for the terrible Russian winter when it arrived, but that was only one factor, and not the main one, for the German advance’s halt.“ “The myth’s main flaw is that, if Barbarossa had been launched two months earlier, in April instead of June, it would have been even less successful and ground to a halt earlier, after advancing a shorter distance. The Germans advanced as rapidly and plunged as deeply into the USSR during the summer of 1941 because the months-long dry weather perfectly suited their Blitzkrieg style of maneuver warfare, of breakthroughs followed by aggressive exploitation via deep armored thrusts, with supplies hurried forward to maintain the advance, and infantry rapidly following to consolidate the gains.” “If the Germans had invaded in April, 1941, their advance would have churned to a standstill after only a few weeks because of the Rasputitsa, the Eastern European mud season when unpaved roads – nearly all of the USSR’s roads – become useless. Caused by rain in the fall and snow melt in the spring, the Rasputitsa would have brought an early Barbarossa to a stop or crawl as attackers and their supply chain struggled to move through a sea of mud, while the Luftwaffe was grounded by the transformation of its dirt airfields into fields of mire. That would have given the Soviets time to regroup while waiting for the roads to dry and the German offense to resume. The need to account for the Rasputitsa dictated the invasion’s start date, not Hitler’s Balkans entanglement.“ 12 World War II Myths That Still Persist Today ",
            "date": "Updated October 23, 2020",
            "views": "673",
            "upvotes": " View 534 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Li Song",
                    "user_href": "/profile/Li-Song-70"
                },
                {
                    "user_id": "Steve Soutar",
                    "user_href": "/profile/Steve-Soutar-3"
                },
                {
                    "user_id": "Przemysław Gawroński",
                    "user_href": "/profile/Przemysław-Gawroński-1"
                },
                {
                    "user_id": "Bill Remer",
                    "user_href": "/profile/Bill-Remer"
                },
                {
                    "user_id": "John P. Gordon",
                    "user_href": "/profile/John-P-Gordon"
                },
                {
                    "user_id": "Mikhail Haurylau",
                    "user_href": "/profile/Mikhail-Haurylau"
                },
                {
                    "user_id": "Richard Modesette",
                    "user_href": "/profile/Richard-Modesette"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "John Taylor",
                    "user_href": "/profile/John-Taylor-883"
                },
                {
                    "user_id": "Werner Zeilinger",
                    "user_href": "/profile/Werner-Zeilinger"
                }
            ]
        }
    ]
}