{
    "title": "What prompted the dramatic change in women's fashion between the Regency era and the Victorian era? I.e. why did fashion become so much more restrictive? - Quora",
    "tags": [
        "Regency Era",
        "History of Fashion",
        "Victorian Era (1837-1901 AD)",
        "Historical Eras",
        "Fashion Trends",
        "History of Great Britain",
        "Women's Fashion and Style",
        "Fashion and Style",
        "Clothing and Apparel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mishla Ke",
                "href": "/profile/Mishla-Ke"
            },
            "answer_text": "Tastes change to reflect the needs of the time. Regency fashion followed the French Revolution, and it represented the political, philosophical and aesthetic antithesis of the Bourbon monarchy (which set the fashion trends for all of Europe during the 18th century). Regency fashion was very much influenced by the philosophy of the Enlightenment and therefore incorporated many things from classical antiquity. There was a pressure and a call for minimalism, ‘natural’ beauty, and egalitarianism, all of which challenged the excess, artifice and hierarchies of pre-revolution French fashion. The latter 19th century was dominated by industrialism, urbanization, globalism/imperialism, etc. This is very different from the pastoral fantasies and the light chemise dresses of Austen and the Regency/Directoire period. Napoleon reinstates a French aristocracy and makes himself an emperor. The grecian country-peasant look is no longer fashionable, and folks want to look distinguished, urban and wealthy. Bright saturated chemical dyes are invented, the new Bessamer process makes mass-produced steel available (and consequently steel-boned corsets and steel cage crinolines), the sewing machine is invented, etc. All of these innovations in technology are reflected in fashion. The technological revolution represented a forward-looking dynamism of mass-production and the power of man triumphing over the power of nature, all of which really negated the classicizing tastes of Regency style. Regency style looked to ancient history and the natural world for its aesthetic and epistemological inspiration. If you think of a woman’s figure when you juxtapose the classical, gauzy, almost see-through dresses of the Regency period and the very tailored and fitted dresses of the Victorian era, it’s not difficult to see which represents nature and which represents ‘civilization’ (or man’s ability to conquer nature). However, it must also be said that fashion is like a pendulum. On one level, there is the socio-cultural influence, but on the other end, there’s a limit to how much garments can change. If a skirt is very long in one period, then it will rise and be short in the next because where else is it gonna go? If dresses are very loose and simple in one era, as they were in the early 19th century, then in the next, they’ll be structured and ornamental. There’s always a back-and-forth with culture and with fashion where we travel so far in one direction that, over time, it begins to lose its novelty; and then we rush back in the opposite direction in search of something radically different. ",
            "date": "Answered May 2, 2019",
            "views": "293",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Will Harper",
                    "user_href": "/profile/Will-Harper-15"
                },
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                },
                {
                    "user_id": "Nawaf Hamad",
                    "user_href": "/profile/Nawaf-Hamad-2"
                },
                {
                    "user_id": "Sara Power",
                    "user_href": "/profile/Sara-Power-1"
                }
            ]
        }
    ]
}