{
    "title": "What are your favorite medieval weapons? - Quora",
    "tags": [
        "Medieval Weaponry",
        "Weaponry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jacob Dorey",
                "href": "/profile/Jacob-Dorey"
            },
            "answer_text": "This is a difficult one. There are so many cool weapons from this time period. However I will choose my favorite weapon from each category. My categorys will be pole arms or primary melee weapons (I will choose one used on foot and one used on horseback.) hand-held ranged weapons, siege weapons, and secondary weapons. Pole arms were the primary melee weapons of this period in history. They were easy to use, had lots of reach, and were great weapons for dealing with armor. My two favorites in this category are the lance, and the halberd.  It should be obvious why the lance is one of my favorites. There is nothing more entertaining to watch mounted knights charge the enemy in films. The lance has been used throughout history in all parts of the world in which cavalry was used. If there is one weapon that you must equip your heavy shock cavalry with it is the lance. While a good counter to the lance was generally to form up your men with pikes, there are many accounts of medieval knights equipped with the lance just steamrolling through formations of men. Used properly the lance could be the most formidable weapon on the battlefield. Next up is the halberd.  Halberds in my opinion were more effective than pikes in many situations. While a formation of pikemen could easily defeat a formation of halberds thanks to their reach, pikemen are also less flexible, and are useless in single combat. The halberd was basically an axe with a spear point, and a hook or hammer on the back side. This was the ultimate anti-cavalry weapon, and possibly the best anti armor weapon you could use. Some actually used hammers too not axe heads for even better armor penetration. Another reason I do not include pikes on this list is I find them to be cowardly weapons. The halberd is just so awesome. They basically took the two handed dane axe which is already a great weapon in its own right, and made it longer, and more effective. Now for hand-held ranged weapons. I was tempted to choose the crossbow but I think I will go with the composite bow.   This was by far the most versatile hand-held ranged weapon in the medieval age. The composite bow changed the planet and was the favored ranged weapon of the Ottoman empire, and the Mongolian empire. Both of these empires were the superpowers of their time using this weapon to great effect. While the longbow, and crossbow were effective weapons in their own right, the composite bow stands out to me. For one thing, it was very hard to craft taking years to complete a single bow. It is also such a flexible weapon. It has the same amount of punch as a long bow, but it is more compact, and easier to carry. This means it can be used on horseback very easily and it has a higher fire rate than a crossbow. The reason I did not choose the crossbow is simply that this weapon had a greater impact on the world as a whole, and even continued to be used by tartars when firearms became more common. Now for siege weapons. This was a tough one because I had to choose between Greek fire, and the Ottoman cannon. However I think I have to go with the Ottoman cannons.  This cannon may look exaggerated but it is not I can assure you. The Ottomans made massive cannons their largest being 23 feet long that shot balls that weighed half a ton. To put this in perspective, even well into the Napoleonic era cannons only fired a maximum of 23 pound balls (Of course bigger cannons existed but they were not the norm.) Even by today’s standards this is a hefty cannon. These cannons were made to destroy the thick walls of Constantinople but sometimes took 3 hours to reload! Still they fired these things in unison causing the ground to shake. I could only imagine the fear experienced by the defending troops at Constantinople seeing these cannons in action for the first time. They obliterated the seemingly impenetrable Theodosian walls of Constantinople, and won the siege for the Ottomans despite set backs. This is my favorite siege weapon because it rendered castle walls near useless, required amazing engineering prowess to create, and it changed the world forever. Cannons in general are just amazing weapons, and are one of the few weapons that are still used today from this time period (obviously they look very different now.) Finally on to secondary weapons. I have to go with the mace.  I was tempted to choose swords because they are also cool but swords suffer from a major problem. And that problem is that they lack the ability to penetrate even basic armor particularly on the late medieval battlefield where everyone had a decent helmet, and good maille armor. This is why they were not primary weapons. Brigandines had also become common along with segmented plate for the arms which meant that swords were difficult to use. The mace also requires little skill to use effectively. You just swing the thing. It is also surprisingly nimble. I was tempted to choose the war hammer but the spike on that weapon can get stuck which is not ideal. I am not suggesting that swords are bad weapons. I think in the right situations they are superior to the mace, there is certainly a reason why swords were more popular secondary weapons. However the mace is a better all around weapon for the battlefield in my opinion. Whether or not the sword is better is certainly debatable. ",
            "date": "Answered June 26, 2018",
            "views": "315",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Will Hampton",
                    "user_href": "/profile/Will-Hampton-3"
                },
                {
                    "user_id": "Lucas Paranos",
                    "user_href": "/profile/Lucas-Paranos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jimmy May",
                "href": "/profile/Jimmy-May-2"
            },
            "answer_text": "My favorite weapon(s) is by far the Halberd, and its first generation descendant the Partisan. The Halberd is a massively versatile weapon.  A rather lovely specimen here. A halberd is a foot and a half long head on the end of a six foot haft, which was normally reinforced with Langets. The halberd is a cutting, chopping, piercing smashing weapon all condensed into one very nasty pole arm. The blade on the end could deliver cuts like any sword, while it’s tip could stab like a spear. The ax blade’s particular shape allowed it to smash into armored foes with a lot of force refusing to slide off the plates, while allowing it to cleave deeply into an unarmored foe. And then there’s that hook. The bottom edge (top in the picture) was normally sharpened to a razors edge. Why? Because you grabbed people in the weak points of their armor with it. If they were wearing cheap armor, or didn’t have proper protection under, it could slice tendons and ligaments apart.  Halberds were fought with like a pole ax, so this video is very relevant. The second video even has some halberd specifics. It’s almost immediate descendant is the Partisan.  The Partisan was fought with in much the same way. It was more streamlined in design, and period articles mention men being cut in half from the crown of the head to the hip. It, like the Halberd was capable of catching on armor, or pulling a man down while hamstringing him. These were some very nasty weapons. ",
            "date": "Answered April 15, 2017",
            "views": "898",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Will Hampton",
                    "user_href": "/profile/Will-Hampton-3"
                },
                {
                    "user_id": "Adam Krajewski",
                    "user_href": "/profile/Adam-Krajewski-11"
                },
                {
                    "user_id": "Tan Song Shun",
                    "user_href": "/profile/Tan-Song-Shun"
                },
                {
                    "user_id": "Matt Johnson",
                    "user_href": "/profile/Matt-Johnson-186"
                }
            ]
        }
    ]
}