{
    "title": "What is the greatest lie ever told? - Quora",
    "tags": [
        "Lies of India",
        "False Advertising",
        "White Lies",
        "Deception",
        "Best of X",
        "Lies and Lying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Farley George",
                "href": "/profile/Farley-George"
            },
            "answer_text": "“History is a pack of lies about events that never happened told by people who weren’t there.” ―George Santayana From personal affairs to financial schemes to events that never happened, the world has been told some enormous lies throughout history. Below are 45 true facts about the biggest lies in history.  45. So He Didn’t Chop Down that Cherry Tree? At one time or another, most children have been told the story about George Washington and the cherry tree. The story is supposed to exemplify Washington’s honesty, but it turns out that it was completely made up by Washington’s biographer.  Amorq 44. A Slight Exaggeration Everyone knows Paul Revere’s famous cry “The British Are Coming! The British Are Coming!” during his midnight ride, but he never said that, or even rode through Concord at all. After his death at age 76, poet Henry Wadsworth Longfellow made Revere famous with his “Midnight Ride” Poem, in which he greatly exaggerated the true events.  amorq 43.We’re Totally Not Building a Wall! On the same day that construction began on the Berlin Wall, German Communist leader Walter Ulbricht publicly claimed that “Nobody has the intention of building a wall.” The wall stood for almost thirty years and separated the city (and families) before it was brought down.  amorq 42. Not for Everyday Use Modern day portraits of Vikings portray them wearing the horned helmets people commonly associate with them, but that’s not the case. While the horned helmets did exist, they were from the Bronze age, and were used for ritualistic religious ceremonies.  factsyoudidntknow Advertisement 41. It Wasn’t for Love The story of Van Gogh’s severed ear is legendary in the art world, but he neither cut it off himself, nor mailed it to his girlfriend. Historians now believe that his friend and fellow painter Paul Gauguin sliced off his ear with his sword when the two got into a fight.  factsyoudidntknow 40. I Am Not a Crook! The Watergate Scandal is famous, largely because of Nixon’s insistence that he wasn’t guilty. When the truth broke, and he got caught in his lie, Nixon broke down on television, wept, and resigned the presidency.  amorq 39. Sure the War Can Be Averted As Prime Minister of Britain in the 1930s, Nevil Chamberlain chose to ignore the threats of Hitler’s Mein Kampf, and his other pronouncements in an effort to maintain peace. Hitler and Chamberlain met twice to discuss reapportionment of Germans under Czech rule, and Hitler assured Chamberlain that the war could be averted if the reapportionment occurred. Hitler had in fact already mobilized the German army to attack Czechoslovakia, and hoped that Chamberlain would prevent the Czechs from mobilizing, thus allowing a surprise German attack.  ulsterguard.us 38. The Unsinkable Ship White Star Line, the owners of the ill-fated ship RMS Titanic, claimed that the ship was unsinkable. In reality, it’s safety features were below the standard of the time, and the iceberg proved that it was definitely sinkable.  Pinterest 37. It Wasn’t That Heavy Most people believe that Knight’s plate armor is extremely heavy, but that wasn’t true. The armor really only weighed between 30-50 pounds, which is pretty light… considering it was designed to stop slashing swords and other deadly weaponry.  mstdn.io 36. Only Good News! During the Vietnam War, Lyndon B Johnson deliberately concealed negative information about the progress of the war as a means of using the “strong support of the American public” as a tool for negotiating peace. Anything that contradicted that image was supressed, and military leaders were forced to report only good news.  Emaze Advertisement 35. An Ingenious Fraudster Han van Meegeren’s art was panned by critics, so to convince them of his talent, he came up with an ingenious scheme. He forged the work of famous artists and passed them off as his own masterpieces. The entire world bought into his scheme and he made millions. Though he was eventually caught, his forgeries are now valuable in their own right.  Times Knowledge 34. Stop Worshiping That! Some historians believed that Napoleon’s soldiers shot off the Sphinx’s nose, but the nose was gone for hundreds of years before he was born. It was religious leader Muhammad Al-Sa’im Ad-Dahr who destroyed the nose when he saw people worshiping the Sphinx. The Muslim religion prohibits worshiping idols.  ThePinsta 33. It’s Under Control! Three days after the Chernobyl accident in 1986, the Soviet government admitted that 32 people had died, but later criticized the Western reaction, saying that it was unnecessary and the radiation was under control. The Communist party officials secretly evacuated their families, while ordering everybody else to stay. The exact number of deaths is still unknown.  Nexofin 32. A Bad Time to Be a Catholic! In 17th century England, the Tudor monarchs had declared Protestantism the national religion, and tension between Protestants and Catholics was running high. A renegade Protestant named Titus Oates masterminded a fake conspiracy called “The Popish Plot” and convinced the English that the Catholics intended to assassinate the king. Many Catholics were executed before Oates’ plot was uncovered.  Amorq 31. They’ve Always Been That Way How Stonehenge was built and by whom is one of the world’s biggest mysteries, but have they really been standing in the same position for 4000 years? The monument has undergone several restorations, and evidence suggests that several stones have been replaced and rebuilt.  Ensonhaber 30. A Modern Ponzi Scheme Bernie Madoff is a former stockbroker and investment advisor who is serving a 150-year prison sentence for executing one of the largest financial Ponzi schemes in history. He defrauded thousands of people out of tens of billions of dollars over a period of 17 years, for no apparent reason. As he testified in court, “I had more than enough money to support any of my lifestyle and my family’s lifestyle. I didn’t need to do this for that.”  factsyoudidntknow Advertisement 29. Don’t Mess with a Sicilian At the height of the Peloponnesian War in 415 BCE, Athenian General Alcibiades (who was himself a compulsive liar and manipulator) decided that conquering Sicily would win the war, and he sold the idea to his fellow Athenians. A wise general named Nicias thought the idea was rash and hopeless, so he deliberately oversold the number of troops required to conquer Sicily, in the hopes of dissuading the Athenians. The lie didn’t dissuade them: it encouraged the Athenians to send almost their entire army into battle. As Nicias had predicted, the campaign was a catastrophic failure. The entire force was killed in battle, with the exception of a few hundred deserters.  Amorq 28. A Fake Discovery In 1912, an unusual skull was discovered in Piltdown, England. It was believed to be the remains of an early human, but decades later, the specimen was proved a fake. It turned out to be an orangutan jaw grafted onto a human skull. Who would go to that kind of trouble just to fool biologists?  amorq 27. Don’t Tell Anyone We Cracked the Code! Back in WWII, Alan Turing successfully cracked the Nazi Enigma code, but the Allies didn’t want the Germans to know that they’d cracked it, so they created ‘Ultra.’ The Ultra campaign was a deliberate series of lies designed to keep the Nazis thinking that the code was intact. The deception continued for several years, and according to Churchill, was the reason they won the war.  factsyoudidntknow 26. It Wasn’t the Potatoes Diseased potatoes is the reason traditionally given to explain the deaths of millions of Irish who starved between 1845-52, but that was the catalyst–not the cause. English overlords turned away boats full of food that were sent to Ireland from charitable nations around the world, and Irish farmers were forced to export their crops.  AwesomeStories 25. Don’t Look a Gift Horse in the Mouth! The most well-known story of the Trojan war is the one about the giant wooden horse that was first mentioned in The Odyssey. In reality, while the war is real, and Troy did in fact burn down, the horse is likely nothing more than a myth, a result of the epic being transmitted orally for many years before eventually being written down.  CrowdStrike 24. Not Just Black and White Pilgrims are frequently depicted as wearing black and white clothing with big black hats, but according to Pilgrim expert Caleb Johnson, Pilgrims actually wore many kinds of styles and colors. The black-and-white idea came from painters in the early 1800s who didn’t know what they wore, and depicted them in more modern, and more familiar clothing.  Haiku Deck Advertisement 22. They Weren’t Burned During the Salem Witch Trials, more than 200 people were accused and tried for being witches, but no American witches lost their lives by being burned at the stake. Burnings were popular in Europe – here, instead, the 19 executed witches were hanged.  Dissolve 21. The Apple Never Hit Him The story of how Sir Isaac Newton formed his theory of gravity usually involves an apple falling on his head while he was sitting under a tree. That’s only partially true. Newton did form his theory after seeing an apple fall in his mother’s garden, but the part about it hitting him on the head is a myth.  Fashion Everyday 20. Not Just a Southern Thing Despite what the history books say, slavery wasn’t unique to the American South. During the 1700s, the colonial North thrived on slavery. In 1740, 1/5 of New York City’s population was slaves. It was only in 1804 that the Northern states abolished slavery, and it didn’t happen all at once. In 1840, Connecticut still had 17 registered slaves.  After Slavery - WordPress 19. Paid Labor There has long been a belief that the Egyptian pyramids were built by slaves (or aliens), but in 2010, archaeologists made a discovery that debunked that myth. Tombs of pyramid builders were discovered in the backyard of the pyramids, and the way they were buried, and their proximity to the pyramids suggested that they were both paid and respected.  Contiki 18. Not a Failure After all. For a long time, it was widely believed that Einstein failed math. In fact, the opposite is true. By the time he was 15, Einstein had already mastered differential and integral calculus, and he came up with an alternative for the Pythagorean theory for fun.  RiseEarth 17. An Ominous Precursor Anti-Semitism was rife in Europe near the end of the 19th century, and decorated French Jewish army captain Alfred Dreyfus was falsely convicted of treason for selling secrets to the Germans. He remained incarcerated on the prison colony Devil’s Island until 1906, when his defenders, led by the author Emile Zola succeeded in exonerating him.  Gazete Duvar 16. He Has Them, I Swear! Sadam Hussein didn’t possess weapons of mass destruction. This information, which is often cited as a lie used to make the case for the war, was directly contradicted by many major sources of intelligence. The WMD threat assessment was largely based on reports by Ahmed Alwan al-Janabi (a man who German intelligence had warned the CIA about, clearly stating he was unreliable) and Muhammad Harith, a former Iraqi intelligence officer. Their information was dismissed by British intelligence as a complete fabrication ten months prior to the war.  Omaha World-Herald 15. I’m Her! When the body of Anastasia Romanov failed to be recovered after her family’s assassination, a story spread that the youngest Romanov daughter had somehow survived. For years after, many women came forward claiming to be Anastasia, the most famous of whom was Ana Anderson. The survival myth was revitalized in 1991 when it was revealed that only nine bodies of Romanov family members and servants were found in a Yekaterinburg grave, but there was no sign of a son or daughter. In 2007, genetic testing put the myth to rest: DNA evidence proved that two bodies found in another Yekaterinburg grave belonged to the Romanov children.  Amorq 14. I Knew He Was Bluffing! In 1962, Soviet leader Nikita Krushchev lied to JFK about planting armed nuclear missiles in Cuba, but Kennedy called his bluff. For 13 days, the world anxiously waited for nuclear war, but thanks to some skilled negotiation on Kennedy’s part, he was able to reach an agreement with the Russians, and a crisis was averted.  ThePinsta 13. A Looting Gone Wrong On July 14, French people celebrate a day of independence to mark the storming of the Bastille to free the unfairly imprisoned and to start a revolution. Or so we’ve been told. By the time the revolutionaries came to the Bastille doors, the prison was mostly empty, and they weren’t there for the prisoners–they were there to get more gunpowder. The raid turned violent, and the revolutionaries ended up beheading the prison officers and freeing the remaining prisoners.  Voces de los Pueblos 12. He Had a Few Flaws Ghandi is revered as a symbol of peace and as a champion for civil rights, but few people know of his not-so-shiny side. When his wife was stricken with pneumonia, British doctors informed Ghandi that a shot of penicillin would cure her. He refused to have alien medicine injected into her body, and she died shortly afterward. Soon after, Gandhi caught malaria and allowed doctors to save his life with quinine. He also tried to get all references to homosexual traditions removed from Indian temples in an act that he called “Sexual Cleansing.”  Taringa 11. It Wasn’t the 4th. While American Independence is celebrated on the 4th of July, the motion to declare independence from Britain was approved by Congress on the 2nd, and it was ratified on the 4th. The document itself wasn’t even signed until August 2, 1776.  ar.pinterest 10. Undue Credit JFK is credited with pushing through Civil Rights legislation, but the credit actually belongs to Lyndon B Johnson. Kennedy tried to stop Martin Luther King Jr’s planned March on Washington, and even sent VP Johnson to Norway because he didn’t like his pro-civil rights policies. After Kennedy’s assassination, Johnson put all of his efforts into passing the civil rights legislation, and in the end, Kennedy got the credit.  Forbes 9. Closer to Equality? Women’s history often revolves around the idea that, with the exception of when they worked in the factories during WWII, women always stayed home while men worked. Before the Industrial Revolution, work was an extension of the household, and men and women split the tasks evenly. Lots of women did stay home, but at the turn of the 20th century, women held a quarter of industrial jobs and half of agrarian jobs.  Viral Trendzz 8. He Never Mentioned it. In 1903, Albert Spalding, the magazine’s publisher and sporting goods kingpin set out to prove that baseball had American origins. He claimed to have been in Cooperstown when future Civil War General Abner Doubleday outlined the diamond in the dirt and wrote up the rules for the game, but his close friend AG Mills didn’t remember ever mentioning it, and Doubleday attended Westpoint–not Cooperstown. Alexander Cartwright was the true inventor, but it’s Doubleday who people remember.  RiseEarth 7. Mass Hysteria In 1938, the Mercury Theatre on the Air program aired Orson Welles’s radio adaptation of H.G. Wells’ War of the Worlds, and the local papers along with the national guard built up a few stories of panic into an incident of mass-hysteria to make the station look bad. In actuality, very few people were fooled by the broadcast, and it turned out that not that many people were even listening in the first place, because they were tuned into ventriloquist Edgar Bergen on NBC.  Viral Trendzz 6. He Didn’t Invent Anything Thomas Edison is credited with inventing the lightbulb, but the truth is that he was not actually the first person to create an electric light. He was part of a very competitive race where he borrowed, some say stole, ideas from other inventors who were also working on an electric incandescent bulb. Invention is a very complex social process where many people tinker and perfect an idea and only the last person gets credit. Edison was a very strong marketer and he was able to deliver the message that he invented the light bulb and it stuck.  Playbuzz 5. The Experiment that Never Was Legend has it that in order to prove his theory that lightning is electricity, Benjamin Franklin conducted an experiment in which he went out in a thunderstorm and released a kite with a lightning rod attached to the top, and a metal key tied to the string. It’s true that Franklin proposed a kite experiment, but he never performed it, and the experiment had nothing to do with lightning.  Fact You Didn't Know 4. You Can’t Do That Here! The famous bra burning during the Women’s Liberation Movement in 1968 always gets brought up in history lessons, but according to one of the organizers of the protest, that’s not quite what happened. The women did want to burn their bras on the boardwalk, but police wouldn’t let them, so they threw their bras and girdles into a garbage can, which they then set on fire.  Pinterest 3. He Was Never There Christopher Columbus is credited with discovering the New World America, but the first explorer to discover America was Norse explorer Leif Ericson. Columbus never set foot on U.S. soil.  2. I Never Had “Relations” with Her! In January 1998, a citizen journalist broke the story that Bill Clinton had been having an affair with intern Monica Lewinsky. Clinton publicly denied the allegations and lied under oath. When Arkansas state employee Paula Jones sued Clinton for sexually harassing her while he was Governor, Prosecutor Kenneth Star subpoenaed Clinton, and he was forced to admit to the relationship. During Bill Clinton’s impeachment hearings, it was actually revealed that Bill used a cigar to pleasure Monica Lewinsky.  Destellosdelcorazon 1. The Big Lie When Hitler rose to power, he created a national sweeping policy to eliminate Jews from the Earth called “The Final Solution.” To accomplish this, he and the Nazis orchestrated what they called “the big lie” where he used the German press to spread lies blaming Jews for all of Germany’s problems, and to convince Germans that Jews were their enemies.  ",
            "date": "Updated February 9, 2019",
            "views": "1081",
            "upvotes": " View 387 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diane Jazz",
                    "user_href": "/profile/Diane-Jazz"
                },
                {
                    "user_id": "Marvin Escobar",
                    "user_href": "/profile/Marvin-Escobar-1"
                },
                {
                    "user_id": "Harsh Baranwal",
                    "user_href": "/profile/Harsh-Baranwal-23"
                },
                {
                    "user_id": "Darara G",
                    "user_href": "/profile/Darara-G"
                },
                {
                    "user_id": "Stefan Hensel",
                    "user_href": "/profile/Stefan-Hensel-2"
                },
                {
                    "user_id": "Chuck Costanza",
                    "user_href": "/profile/Chuck-Costanza"
                },
                {
                    "user_id": "Carri Burgess",
                    "user_href": "/profile/Carri-Burgess"
                },
                {
                    "user_id": "Chakra Simhan",
                    "user_href": "/profile/Chakra-Simhan"
                },
                {
                    "user_id": "Miriam Fabrick",
                    "user_href": "/profile/Miriam-Fabrick"
                },
                {
                    "user_id": "Romeo Salau",
                    "user_href": "/profile/Romeo-Salau"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Donner",
                "href": "/profile/Edward-Donner"
            },
            "answer_text": "This is a three parter. Technically, none of them are actually about \"The Greatest Lie Ever Told,\" so this entire answer is one great big  lie.  However, I am being truthful about it. So what does that make this?  Yeah, I guess B.S. is still B.S. no matter how much you shine it.    ONE A few relevant facts: You are  lied to somewhere between 10 to 200 times a day according to Jerald Jellison of the University of Southern California. An average of 60 percent of adults lie at least once during a ten-minute conversation, according to Robert Feldman of the University of Massachusetts. I don't think I'd say any one lie is the  \"greatest,\" but here are some nominations for the greatest lie ever based on how often they are told and by how many people have said them or heard them. Just as the Grand Canyon was made so grand by the sheer volume and persistence of the flow of water, so too these lies accrue their greatness on the basis of their universal, pan-cultural ubiquity. How many times have you heard or said any of these when it wasn't precisely true?    \"It's not you. It's me.\"   \"I'm five minutes away.\"   \"That's never happened to me before.\"   \"You're the first.\"    \"I'll pay you back next week.\"   \"You can trust me.\"   \"You don't have to if you don't want to.\"   \"I love you.\"   \"Everything I did I did for you.\"   \"I'm sorry.\"   \"Tomorrow will be sunny and warm with no chance of showers.\"   \"It's in the mail.\"   \"I only want what's best for you.\"   \"It's so big!\"   \"I would never do that.\"   \"We're just friends.\"   \"I would never lie to you.\"   \"I didn't do it.\"   \"I'll never do that again.\"   \"My phone died.\" or \"I didn't hear it ring.\"   \"I was only kidding.\"   \"I never said that.\"   \"I'm fine.\"   \"I'm just tired.\"   \"I'd love to but I'm busy that day.\"   \"No, those don't make you look fat.\"   \"...I've been busy\"  often preceeded by               \"I didn't call because...\" or               \"I didn't get to that because...\"   \"I've never watched porn.\"   \"You're a great cook.\"   \"It's not the money. It's the principle.\"   \"This will only take 5 minutes.\"   \"I can't make it; I'm sick.\"   \"That was great.\"   \"I don't know...\" often followed by          \"...how it happened.\"          \"...who did it.\"   \"It's not my fault.\"   \"I have read and agree to the terms of use.\" There's many more....feel free to add your own universal lies in the comments in the comments.    TWO Honorable Mentions from professional liars (i.e., politicians)I love politics, so obviously I enjoy a good lie when I see one. These are not the greatest lies ever told, but they're famous and memorable, so deserve mention if not nominations as the greatest lies ever. \"I am not a crook.\" -Richard Nixon \"I did not have sexual relations with that woman.\" -Bill Clinton \"Read my lips: no new taxes.\"  - George Bush \"The fundamental business of the country, that is, production and distribution of commodities, is on a sound and prosperous basis.\" -Herbert Hoover, four days before the 1929 Stock Market Crash.  THREE The Mass Delusional LieThis is not a particular lie, but an entire class of lies that are so timeless and ubiquitous they deserve mention. Most people would probably say that something is not a lie if the person making the statement believes it to be true, even if it isn't true. If I tell you it's raining, but it turns out that I'm wrong, then you would probably percieve that I was simply wrong and not actually lying.   Likewise if I was delusional and told you that I hail from an alien planet that worships Donald Trump's hair as a deity, you would come to some conclusion about whether or not I was whacked and delusional, or just making shit up and therefore lying. However, in common parlance people will view something as a lie if it is false and it  is hoisted on a large body of others, even if the person stating the non-truth believes it to be true. For example, Quora user Akash Pandey in this very Greatest-Lie thread offers as a great lie:  \"The history of your country that you study in school curriculum, especially in your early years. Some portions of it (like interpretations or the subjective part of it) is often partially or totally manipulated or bended to intensify, justify or glorify the past actions of your fellow countrymen. It often misleads the innocent minds in their forming years thus building a wrong mindset and deprives them from the truth thereby failing the entire purpose of teaching history at first place. \" Also in this Greatest-Lie thread Quora user Ashotosh Goyal describes \"Feminist Myths That Will Not Die\" as a lie, citing what he views as inappropriate use of statistics to create the false impression that there is wage inequality between the genders.  So, do feminists and others of like mind truly believe they are distorting statistics? Do school districts and text-book writers knowingly bend the facts for self-glorification? I  don't think so. People tend to believe the propaganda that is consistsent with their own belief system. And then they present \"the facts\" to others. In their own minds, these people are not bending and distorting, they are presenting their version of truth.  And of course this mental conversion of the erroneous beliefs of others into \"lies\" doesn't occur  just in Quora. Look on the internet. On TV, in film and on radio, in print and in the minds of people everywhere, we commonly conclude that erroneous beliefs held by others are in fact lies. Some people will say the Bible is a lie, and some will say the Warren Commision report is a lie, and some will say that the Republican party lies while others say that the Democratic party lies. Apparently, everybody else is lying.  So, in our mind a person can make an erroneous proclamation and it is simply a wrongly held belief, but at some point some sort of critical mass is reached and we conclude that what we are told is more than an erroneous belief.  It is a lie. What is that tipping point? I believe we tend to consider that an erroneous belief has morphed into a lie at the point when the beliefs of a person or a group of people starts to significantly affect the fate and future of people who don't buy in on the belief.  A false belief becomes an egregious lie once the true believers try to compell the non-believer to accept their beliefs as true, or when the power of their belief system starts to, in our view, adversly affect the rights of others to perceive a truthier truth, or at least adhere to the false beliefs of their choosing.  This all gets very dicey, of course, because we can easily recognize the propaganda of others-- who of course are lying liars who lie--while we are oblivous to the propagandish nature of the drivel gushing out of our own lips (or keyboard).  So, how do we distinguish between mass delusional lies and commonly held, self-evident truths? How can we tell if someone is lying versus simply being wrong? The whole effort is like trying to nail jello to a brick wall.  It's very satisfying to bash the institutionalized, mass delusional lies held by others while basking in the warm, coddling truthiness of our own wisdom, but the fact is, we're all frick'n liars, constantly promulgating our own versions of reality and looking for converts to our no doubt deeply flawed belief system.  Yeah, we'll cite facts and figures and offer quotes from our most cherished sacred texts, but ultimately, it's all a little bit self-congratulatory and self-stimulatory. On the up side, as far as self-stimulatory behavior goes, it's way less creepy than porn.  In conclusion, I believe all of this crap, so I'm not lying.  My name is Edward Donner and I endorse this answer ",
            "date": "Updated February 13, 2016",
            "views": "55",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abubakar Garba",
                    "user_href": "/profile/Abubakar-Garba"
                },
                {
                    "user_id": "James Innes",
                    "user_href": "/profile/James-Innes-18"
                },
                {
                    "user_id": "Noklem Wangsu",
                    "user_href": "/profile/Noklem-Wangsu-1"
                },
                {
                    "user_id": "Rush Dossa",
                    "user_href": "/profile/Rush-Dossa"
                },
                {
                    "user_id": "Htet Aung Linn",
                    "user_href": "/profile/Htet-Aung-Linn-8"
                },
                {
                    "user_id": "Sandy Beshear",
                    "user_href": "/profile/Sandy-Beshear"
                },
                {
                    "user_id": "Molly Levitt",
                    "user_href": "/profile/Molly-Levitt-5"
                },
                {
                    "user_id": "Gourav Mali",
                    "user_href": "/profile/Gourav-Mali-4"
                },
                {
                    "user_id": "Aneesa Stewart",
                    "user_href": "/profile/Aneesa-Stewart"
                },
                {
                    "user_id": "Lauren Kasperski",
                    "user_href": "/profile/Lauren-Kasperski"
                }
            ]
        }
    ]
}