{
    "title": "What are the chances of a global depression triggering another world war? - Quora",
    "tags": [
        "Economic Depression",
        "The Great Depression",
        "World Wars",
        "International Economics",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Shahid Hamid",
                "href": "/profile/Shahid-Hamid-8"
            },
            "answer_text": "Below is an excerpt from Encyclopedia Brittanica about the great depression of the early 20th century. “ Great Depression, worldwide economic downturn that began in 1929 and lasted until about 1939. It was the longest and most severe depression ever experienced by the industrialized Western world, sparking fundamental changes in economic institutions, macroeconomic policy, and economic theory. Although it originated in the United States, the Great Depression caused drastic declines in output, severe unemployment, and acute deflation in almost every country of the world. Its social and cultural effects were no less staggering, especially in the United States, where the Great Depression represented the harshest adversity faced by Americans since the Civil War.” As can be seen the twenty years that the depression lasted, till 1939, there were no major wars. WW2 started in 1939, after the depression had eased out. Probably the reason would be that most nations had their hands full in trying to cater for the needs of their public. Most of the wars that occurred in this period were rebellions, independence wars, border skirmishes but no major conflict. However, some historians feel that the great depression led to the rise of Nazism in Germany which eventually led to WW 2. Wars are also expensive undertakings. With little in your coffers, it is difficult to go to major wars. However, if one country is not effected by a global depression, it might see a golden opportunity to settle scores with its enemy which is beset by the depression. ",
            "date": "Answered June 3, 2020",
            "views": "77",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Rahn",
                    "user_href": "/profile/Jim-Rahn"
                },
                {
                    "user_id": "Bevan Narinesingh",
                    "user_href": "/profile/Bevan-Narinesingh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Wiseman",
                "href": "/profile/Mark-Wiseman-34"
            },
            "answer_text": "I would say chances of WW3, at some point in the future, are almost 100%. I mean, my own country - the USA - has been on a “war footing” for about 60 out of the last 75 years. The big banksters and politicians who are in charge of everything are just like people from the past - heavily invested in defense companies & various corporate interests & investments that will actually benefit greatly if there is a big war. That’s why they keep us fighting all over the place, all of the time. And, the American people are very tired of this B.S. And, they are not the only ones…. I’m sure many nations are out there who would love the opportunity to take the USA down a few pegs. There is sure to be a lot of “blowback” from the past wars that the USA has been waging since WW2. At some point, the US Dollar will collapse and this will weaken the USA. Then, the danger of WW3 will become greater. But, more than anything, I think there are very wealthy “global elites” who can hire private, mercenary armies - they can conduct all kinds of false flag operations and attacks, and try to disguise them as coming from one nation or another. Some “spy” games like this are probably most likely to end up setting off WW3. ",
            "date": "Answered May 24, 2020",
            "views": "101",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonathan Aranda",
                    "user_href": "/profile/Jonathan-Aranda-2"
                },
                {
                    "user_id": "Bevan Narinesingh",
                    "user_href": "/profile/Bevan-Narinesingh"
                }
            ]
        }
    ]
}