{
    "title": "What country is Machu Picchu located? - Quora",
    "tags": [
        "Machu Picchu",
        "Visiting and Travel in Peru",
        "Peru",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tara Smith",
                "href": "/profile/Tara-Smith-267"
            },
            "answer_text": "Machu Picchu is in Peru and one of the top tourist attractions in the country. I went there last year. If you are planning on going most people stay at Augas Calientes the night before which is the closest little town. In the morning you can head to the gates really early (like 4-am) wait for them to open and walk up the steps (1 hour) or you can just take the bus up. I don’t think many people know you can just take the bus. The earlier you go the better as it gets very busy! It’s quite far from Cusco but there are hundreds of ways to get there by shuttle bus, train etc. I did a four-day tour which included biking, rafting and zip lining, it was fantastic! There are also numerous hiking options (Inca Trail) etc which take several days to get there. Depending how much time you have! Hope that’s helpful :) ",
            "date": "Answered February 21, 2018",
            "views": "677",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben Smith",
                "href": "/profile/Ben-Smith-56"
            },
            "answer_text": "Machu Picchu is located in the Andes mountains in south-central Peru.    However when it was built around 1450 CE, it was part of Tahuantinsuyo, the Incan Empire. The general consensus by modern archaeologists is that Machu Picchu could have been a royal retreat for the emperor and his royal court to relax at.  ",
            "date": "Answered July 21, 2015",
            "views": "78",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robby Wille",
                    "user_href": "/profile/Robby-Wille-1"
                },
                {
                    "user_id": "Barry Levy",
                    "user_href": "/profile/Barry-Levy-1"
                },
                {
                    "user_id": "Devry Aldaz",
                    "user_href": "/profile/Devry-Aldaz"
                },
                {
                    "user_id": "Lexi Kaudy",
                    "user_href": "/profile/Lexi-Kaudy"
                },
                {
                    "user_id": "Alfredo Yong",
                    "user_href": "/profile/Alfredo-Yong"
                },
                {
                    "user_id": "Mayra Coral Barrera",
                    "user_href": "/profile/Mayra-Coral-Barrera"
                }
            ]
        }
    ]
}