{
    "title": "What is difference between society and community? - Quora",
    "tags": [
        "The Differences",
        "Community"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mack Moore",
                "href": "/profile/Mack-Moore-1"
            },
            "answer_text": "The difference between these English words is scale. These words point to similar phenomena, but on different orders of magnitude. A “community” was traditionally a village. A society is much larger, such as a nation. A community was once a homeplace in which we felt a sense of belonging among family, friends, and neighbors. Many people no longer feel that way, as community life has unraveled due to having shifted our dependence from each other to far-away corporations, but this is what it once meant. “Community” today seems to mean local special interest groups or networks of local friends. A society is (and always was) a national or supranational political or cultural organization, from which we derive a sense of identity through shared values, shared language, and shared traditions. You can move from one community to another (but not from one society to another) without experiencing a degree of culture shock. Even moving from the US to Canada, even though the societies are quite similar, can produce a degree of culture shock. (What the hell is a “Looney”? How do I figure out prices of common goods and distance on the road? 20 degrees—is that very cold? What is legally permissible in the context of xyz?) Nothing similar happens moving from one community to another within a society. Then only friends, family, and familiar places may be missed. ",
            "date": "Answered February 6, 2018",
            "views": "91",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gaurav Sanwal",
                    "user_href": "/profile/Gaurav-Sanwal"
                },
                {
                    "user_id": "Niraj Timilsina",
                    "user_href": "/profile/Niraj-Timilsina-2"
                },
                {
                    "user_id": "Siddhant Kesharwani",
                    "user_href": "/profile/Siddhant-Kesharwani-1"
                },
                {
                    "user_id": "Andrew Gong",
                    "user_href": "/profile/Andrew-Gong-11"
                },
                {
                    "user_id": "Sarah Morin",
                    "user_href": "/profile/Sarah-Morin-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phil Beaver",
                "href": "/profile/Phil-Beaver-1"
            },
            "answer_text": "Society refers to members of a civilization, ethnicity, association for activity or art; some form of convention to which members are expected to conform. Community is the entirety of people living in a place or people with a common interest but no rules to conform to. Unsatisfied with those two terms, I write about “a civic people.” “Civic” refers to people who collaborate for safety & security in public connections and transactions because they live at the same time in the same place. Thus, in the USA, we the people is divided into a civic people and dissidents. Dissidents are ignorant, criminal, evil or otherwise alien to a civic people. Dissident behavior that causes harm may attract enforcement of statutory law. Hopefully, 2/3 of people in every sub-culture, society, and community willingly collaborate for an overarching civic culture. In a civic culture, every real-no-harm association may flourish. I just now answered a related question at https://www.quora.com/What-do-you-compromise-for-society/answer/Phil-Beaver-1 . ",
            "date": "Answered February 5, 2017",
            "views": "42",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zameer Abass",
                    "user_href": "/profile/Zameer-Abass-1"
                },
                {
                    "user_id": "Siddhant Kesharwani",
                    "user_href": "/profile/Siddhant-Kesharwani-1"
                },
                {
                    "user_id": "Madhumita Singh",
                    "user_href": "/profile/Madhumita-Singh-14"
                }
            ]
        }
    ]
}