{
    "title": "What are some examples of ancient philosophers explicitly building upon or criticizing past works of philosophy in their writings? - Quora",
    "tags": [
        "Ancient Philosophy",
        "History of Philosophy",
        "Philosophers",
        "Ancient History",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelly Head",
                "href": "/profile/Kelly-Head-1"
            },
            "answer_text": "The story goes that a young man named Socrates encountered Parmenides in his old age, along with his pupil and lover, Zeno. This encounter among other experiences shaped Socrates into the gadfly of Athens who would later attract Plato and other bright young men into his entourage. After witnessing Socrates’ trial and execution for “corrupting the youth” of Athens, Plato went on to form a school to educate young men in the way of wisdom. Among his students there arose The Philosopher, Aristotle, who taught us to say “we Platonists” and surpassed his teacher while building on his foundations. Aristotle too carried the torch of educating young men and started his own school. He had many notable students, but one notorious: Alexander the Great. Although Alexander was no philosopher, and indeed ended the great line of succession that had begun with Parmenides, he teamed up with Aristotle to make possible the Library of Alexandria, arguably the greatest repository of wisdom in human history. So, up until Aristotle, philosophers literally dialogue with one another to build on and criticize each other. After Aristotle, there is much more of an emphasis on the texts of the philosophers. This allows for a new reception of Plato by philosophers like Plotinus who had never met the man and yet created a quasi-religious sect based on his interpretation and interpolations of Plato’s ideas. This lays the groundwork for the obsession with Aristotle in the Middle Ages, his works were better preserved at the time than Plato’s. So, when Whitehead says philosophy is footnotes to Plato, he is only half right. It would be more accurate to say it is Aristotle’s library. ",
            "date": "Answered October 26, 2020",
            "views": "79",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lucas Cosolo",
                    "user_href": "/profile/Lucas-Cosolo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Nachaj",
                "href": "/profile/Alexander-Nachaj"
            },
            "answer_text": "Look up virtually any “Church Father” or theologian of early Christianity, like Tertullian, Clement, Athanasius and even Augustine (but countless others). Those guys made knowing the works of other philosophers and theologians (and trashing or building upon them) their bread and butter. ",
            "date": "Answered October 23, 2020",
            "views": "73",
            "upvotes": "0"
        }
    ]
}