{
    "title": "What is the difference between aristocrats, nobles, and royals? - Quora",
    "tags": [
        "Nobles",
        "Aristocracy (form of government)",
        "Aristocrats",
        "Nobility",
        "Social Class",
        "Similarities and Differences",
        "Royalty",
        "British Monarchy",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Christie",
                "href": "/profile/Peter-Christie-39"
            },
            "answer_text": "Aristocrat is a word which is derived from the Greek aristos meaning, “the best,” so in its original sense aristocracy was a meritocratic form of society in which the best or the most able ruled : the Greeks also coined the term kakistos meaning, “the worst,” the most corrupt, or least able and many people in the United States and the United Kingdom would aver that we are presently being ruled by kakistocratic governments. However (to return to the point) in the course of milenia aristocrat has come to change its meaning somewhat : it is now used as a term for a member of the Upper classes, a person who is titled or the son or daughter of someone who is titled (so ironically) it is now possible for someone to be both an aristocrat, in the current sense of the word, and a kakistocrat. To be a royal (as they say in the United States) or royalty, as we say in the United Kingdom, is to be a member of the royal family by birth or marriage. The nobility is the rung below royalty on the social ladder, although there are different grades of nobility in descending order : Dukes and Duchesses, Marquess or Marquis, Earl or Countess, Viscount or Viscountess, Baron or Baroness. There are also Baronets, but strictly speaking Baronets are merely distinguished commoners and not members of the nobility who are eligible to sit in the House of Lords. Former Prime Ministers sometimes choose to be created a Baronet so that they can continue to serve in the House of Commons. Aristocrats as we now understand the term are the rung below the nobles or minor nobility, the distinction has become somewhat blurred over the years. ",
            "date": "Answered October 24, 2020",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kanupriya Tiwari",
                    "user_href": "/profile/Kanupriya-Tiwari-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adish Nair",
                "href": "/profile/Adish-Nair"
            },
            "answer_text": "Royalty are the rulers of the country and their heirs, the monarchy. Nobles or aristocrats are a lower class who are titled but are not part of the monarchy, who do not automatically have claims to the throne. Originally answered in How does royalty and nobility differ from each other? Please upvote!! ",
            "date": "Answered October 24, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bhanu Parashar",
                    "user_href": "/profile/भानू-पाराशर-Bhanu-Parashar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carolyn King",
                "href": "/profile/Carolyn-King-118"
            },
            "answer_text": "Aristocrats and nobles are the same thing: people with titles. They might be in the country’s line of succession, via a royal ancestor, but aren’t members of the royal family. Royals are at the top of the line of succession. They play a role in government. Some of them have noble titles (e.g., “The Duke of Cambridge”) but they are royalty, not aristocrats. ",
            "date": "Answered October 24, 2020",
            "views": "99",
            "upvotes": "0"
        }
    ]
}