{
    "title": "What did people use instead of toilet paper in the 18-1900s? - Quora",
    "tags": [
        "1900s",
        "Bathroom Etiquette",
        "Personal Hygiene",
        "Toilet Paper Roll",
        "Defecation",
        "Toilets",
        "Bathrooms",
        "Hygiene"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Allum",
                "href": "/profile/Keith-Allum"
            },
            "answer_text": "Uh… is this by any chance a trick question? I only ask because the answer is… toilet paper. I mean, come on… it’s been around since the second century, at least it was around in China.* According to an American website (cue weary sigh): modern commercially available toilet paper didn’t originate until 1857, when Joseph Gayetty of New York marketed a \"Medicated Paper, for the Water-Closet,” sold in packages of 500 sheets for 50 cents. Before his product hit the market, Americans improvised in clever ways. -then goes on to talk about corn (maize) and sanitary purposes that make the hair curl… The real answer - obviously - is that in 1800–1900s paper was available, it was used hygienically - usually after being read, learned and inwardly digested… and probably, at least in England, also used to wrap fried fish, which by a huge stretch of the imagination might support a claim to have invented the pre-moistened, kinder sort of toilet tissue that are marketed as ‘wipes’. And before the invention of web paper by William Nicholson (in 1790 he filed a patent for a rotary press. The rotary press itself is an evolution of the cylinder press, also patented by William Nicholson)! Well we sure as shit didn’t use corn cobs. In the UK corn can be wheat, oats, or barley, but maize is only corn the other side of the pond… * Yen Chih-Thui, writing in 589 AD according to the Western calendar: Paper on which there are quotations or commentaries from the Five Classics or the names of sages, I dare not use for toilet purposes… Chinese were manufacturing toilet paper at the rate of 10 million packages of 1,000 to 10,000 sheets annually and in 1393, thousands of perfumed paper sheets were also produced for the exclusive use of the Hongwu Emperor’s imperial family. ",
            "date": "Answered October 18, 2020",
            "views": "11",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "Nigel Hyde",
                    "user_href": "/profile/Nigel-Hyde-11"
                },
                {
                    "user_id": "Pasquale Mancino",
                    "user_href": "/profile/Pasquale-Mancino"
                },
                {
                    "user_id": "Mary Jo Pelanek",
                    "user_href": "/profile/Mary-Jo-Pelanek"
                },
                {
                    "user_id": "Riccardo Nadalini",
                    "user_href": "/profile/Riccardo-Nadalini"
                },
                {
                    "user_id": "Leone Rose",
                    "user_href": "/profile/Leone-Rose-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Fitzpatrick",
                "href": "/profile/James-Fitzpatrick-55"
            },
            "answer_text": "Hello Quinn Smith, What did people use instead of toilet paper in the 18-1900s? China invented specifically made toilet paper in the 6th century CE. Paper became widely available in the 15th century, but in the Western world, modern commercially available toilet paper didn't originate until 1857, when Joseph Gayetty of New York marketed a \"Medicated Paper, for the Water-Closet,” sold in packages of 500 sheets for 50 cents. Who Invented Toilet Paper—and What Came Before - http://HISTORYwww.history.com Regards, James, ",
            "date": "Answered October 18, 2020",
            "views": "12",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sakura Yamaguchi",
                    "user_href": "/profile/Sakura-Yamaguchi-3"
                },
                {
                    "user_id": "Milly Stuchinski",
                    "user_href": "/profile/Milly-Stuchinski"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Penguino and Pg Penguin",
                    "user_href": "/profile/Penguino-and-Pg-Penguin"
                },
                {
                    "user_id": "Thomas Coupez",
                    "user_href": "/profile/Thomas-Coupez"
                }
            ]
        }
    ]
}