{
    "title": "What invention has done the most harm to humanity? - Quora",
    "tags": [
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Kelbell",
                "href": "/profile/Scott-Kelbell"
            },
            "answer_text": "You asked, “What invention has done the most harm to humanity?” There are so many human inventions that have caused harm, it is difficult to point any one of them. That written, lest we feel too badly about the things we’ve created, though with the best intentions; let us acknowledge that many of man’s inventions have reduced much of our suffering. This is only my opinion, but I will answer “money.” Josephus in his Antiquities of the Jews (Book 1) asserts that the use of money caused a detrimental “change in that way of simplicity wherein men lived before.” Josephus tells us that men lived together providing for their neighbors as they had need. A kind of communal living, like the way a modern Israeli kibbutz is operated. Some years earlier, Saint Paul, in one of his pastoral epistles, written that “the love of money [not money itself] is the root of all evil: which while some coveted after [greed], they have erred from the faith, and pierced themselves through with many sorrows [their greed is detrimental to the greedy].” 1 Timothy 6:10. I believe that the notion that money was a bad idea is an old notion. It tends to surface some of our worst vices. However, dispensing with money — or the silly idea of universal wage — cannot possibly work for the world’s societies, having been constructed around the idea of the acquisition of wealth as represented by money. ",
            "date": "Answered December 22, 2018",
            "views": "228",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thanisha Kapur",
                    "user_href": "/profile/Thanisha-Kapur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alistair Riddoch",
                "href": "/profile/Alistair-Riddoch-1"
            },
            "answer_text": "War. Slavery. Climate alarmism. Genocide. Terrorism. Oppressive tyranny. (Some dictatorships are beneficial to the people involved, so not all dictatorships, just the ones that are bad). Religion could be up there, but has had some significant offsetting benefits. —————— Hard to choose. War and slavery had the advantage, having been around for so long, that they have had the opportunity to impact the most lives negatively. But if the measure is a negative impact on the most number of people at the same time or the most negative impact on the most people at the current time, then climate alarmism gets the crown. ",
            "date": "Answered August 5, 2019",
            "views": "195",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "TL Winslow",
                    "user_href": "/profile/TL-Winslow"
                },
                {
                    "user_id": "Mike Rasmusson",
                    "user_href": "/profile/Mike-Rasmusson"
                },
                {
                    "user_id": "Bob Yates",
                    "user_href": "/profile/Bob-Yates-5"
                }
            ]
        }
    ]
}