{
    "title": "What are the similarities between Mahatma Gandhi and Narendra Modi? - Quora",
    "tags": [
        "Mahatma Gandhi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aditya Singh",
                "href": "/profile/Aditya-Singh-7403"
            },
            "answer_text": " Marketing and PR Skills Both Mahatama Gandhi and Modi are brilliant at these two factors. India is the brand and they are the brand ambassadors. Gandhi was a great promoter of everything Indian and so is Modi. India was and is being marketed well and if you have a product or service then you have to market it well to earn profits. Great Leadership Skills When we talk about great leaders, Gandhi and Modi are the first few names which strikes in our mind. Gandhi was a great political and spiritual leader. He led many nationwide campaigns to ease poverty, extend women rights, eliminate injustice of human rights and moreover. People Skills Gandhi invoked people participation in his every movement against the British. Modi, too believes that government alone can’t introduce schemes & rules, and says people participation is the key. Both of them stirred a strong nationwide movement. Hungry for Growth Gandhi always wanted India to grow. He always kept emphasising on wearing clothes made out of Khadi. He had asked people to boycott all the goods which are made outside the country. Small Changes Result in Bigger Impact Like Gandhi, Modi too believes that small changes can bring big differences. He believes that if one start changing at their own level than it will not take much time to change the world. Futuristic Attitude Both Gandhi and Modi have their global presence. Gandhi, during his talks with teachers and students in Birla House, Delhi on 10th December 1947, said “India stand before the world only through imparting education via crafts.” Gandhi used to say only attaining education will not serve the purpose in long term. Modi too believes that if India needs to grow at a rapid pace than its youth should have essential skill training along with the education ",
            "date": "Answered October 24, 2020",
            "views": "136",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Varun Venkatasubramanian",
                "href": "/profile/Varun-Venkatasubramanian-8"
            },
            "answer_text": "Besides the fact that both wear glasses, the one similarity is that both came from Gujarat. Gandhi was what you can call “nobility” since his father and his grandfather before that was what can be called the “ Diwan “ or Minister of the princely state of Porbandar. Gandhi was much like his peers in Congress: British educated, coming from an affluent, politically connected family, having studied law, etc. Modi was born after Indian independence in a much poorer family in what was then Bombay State(but later became Gujarat). He was influenced more by the RSS and the Bharatiya Jana Sangh. He is, in fact, one of the RSS veterans who “graduated” to BJP and is thus different from those Karyakartas who joined BJP directly. Thus , Modi's influences and experiences growing up were different. But he's the only Prime Minister I've seen who saluted Gandhi's Samadhi at Raj Ghat on Gandhi Jayanti(our previous Prime Minister never did that even as a publicity stunt). ",
            "date": "Answered October 24, 2020",
            "views": "66",
            "upvotes": "0"
        }
    ]
}