{
    "title": "What are some strong arguments why government should not be run like businesses? - Quora",
    "tags": [
        "Government Efficiency",
        "Arguments and Argumentation",
        "Government",
        "Business"
    ],
    "response": [
        {
            "author_info": {
                "name": "Randall Reade",
                "href": "/profile/Randall-Reade"
            },
            "answer_text": "Read Jane Jacob’s short book, “The Systems of Survival.” She addresses this very issue and presents strong arguments against running a government like a business. She started with a simple question: Why is it that all governments in all societies, whether they are monarchies, democracies, or local tribal rulers, have a taboo against mercantilism and trading? She starts with the British aristocracy which has always looked down on merchants and would rather study latin than anything practical or business oriented. No one could give her a satisfactory answer, so she sleuthed it herself. She identified that societies operate on two very different systems. There is the system for commerce and business, which she calls the Commerce System. That includes everything from the consumer buying detergent, to the businessman who cashes a check, to multinationals operating all over the world. Then there is the system of government. That includes not just government but also military and other authority, which she calls the Guardian System. Both of these systems have a whole list of attributes the are the exact opposite of each other. So for instance, government and military value loyalty. Loyalty to your country, your brother in arms, the political you work for — all require loyalty. If you are disloyal, it can have major consequences for state or war. But commerce does not — you may be loyal to Tide, but you will switch in a heartbeat if a new detergent is better and cheaper. You may be loyal to your boss, but if you find a better opportunity elsewhere, you jump ship. “Deceive for the sake of the task.” That’s another government/military value. In war, deception is essential oftentimes. The President cannot always tell the truth, but must say that the economy is strong even when it is failing — to say otherwise would only make it worse. Business and commerce — if you lie to consumers, eventually you get caught and there are punishments available for that. the best business is transparent. The job of government is to enact laws that are fair in at least a rudimentary way. They should level the playing field, even if they don’t always succeed. The government enforces the law too. But neither of these are functions or values of business or commerce. There are about 15 values that she identifies for each. At the end of the book, she cautions that when you mix these values, you have what she calls a “dangerous hybrid.” Why doesn’t Apple, the largest company in the world, have it’s own army? It could certainly afford it. It would be able to enforce IP infringement. IT could throw people in jail if they violate their IP. But we would never allow it, because it would put other companies at a huge disadvantage. Plus, there is no accountability to the people or the country. The Mafia is a great example of a dangerous hybrid. They engage in commerce and business, but they also have their own “code” and they enforce it. Violate that code, and you will have your knees capped. Dictatorships are the same thing and Russia and China prove that when you mix commerce and government, you have restricted rights of people and plenty of censorship. Corruption arises when you have people in authority engaging in commerce. A judge or policeman taking a bribe — that’s the definition of corruption. But paying the same amount of money to a lawyer to argue on your behalf, or a lobbyist is perfectly legal. So that last thing we would ever want to do is to mix commerce with government or military. IT would lead us to rampant corruption at first, and eventually to much worse. This is why Trump is so dangerous. He owns a hotel in Washington and Mara lago in Florida, bout of which are businesses. People who want to curry favor with him engage in commerce to enrich Donald Trump, and then he can dole out favors to those who enrich him. There is no accountability. One of the values of government is to avoid even the appearance of impropriety because it undermines the public trust in their leaders. Trump not only doesn’t care about the appearance of impropriety, he celebrates it. He began his recent speech at the UN was an advertisement for his properties. Eventually, the public will just assume that the corruption is rampant, and it will of course rise to that level unless it is stopped soon. The fun part (for me at least) was that it proves how and why government is so inefficient. People always complain about government expenses and how slow it is. It has always been that way, everywhere, and that’s a good thing. You really don’t want an efficient government — Nazi Germany was actually quite efficient in many ways. Not a good thing. Read her book. You can do it in an afternoon, and it will change your view of the world. It’s that good. Jacob’s Moral Precepts Guardian Syndrome Shun tradingExert prowessBe obedient and disciplinedAdhere to traditionRespect hierarchyBe loyalTake vengeanceDeceive for the sake of the taskMake rich use of leisureBe ostentatiousDispense largesseBe exclusiveShow fortitudeBe fatalisticTreasure honorThe Commerce SystemShun forceCompeteBe efficientBe open to inventiveness and noveltyUse initiative and enterpriseCome to voluntary agreementsRespect contractsDissent for the sake of the taskBe industriousBe thriftyInvest for productive purposesCollaborate easily with strangers and aliensPromote comfort and convenienceBe optimisticBe honest",
            "date": "Answered September 27, 2017",
            "views": "19",
            "upvotes": " View 39 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ed Jimenez",
                    "user_href": "/profile/Ed-Jimenez-2"
                },
                {
                    "user_id": "Sharmake Farah",
                    "user_href": "/profile/Sharmake-Farah-4"
                },
                {
                    "user_id": "Christina Z Borland",
                    "user_href": "/profile/Christina-Z-Borland"
                },
                {
                    "user_id": "Manny Jacobowitz",
                    "user_href": "/profile/Manny-Jacobowitz"
                },
                {
                    "user_id": "Eszter Barna",
                    "user_href": "/profile/Eszter-Barna-1"
                },
                {
                    "user_id": "Kenneth Wang",
                    "user_href": "/profile/Kenneth-Wang-42"
                },
                {
                    "user_id": "Mark Noonan",
                    "user_href": "/profile/Mark-Noonan-3"
                },
                {
                    "user_id": "Adam Devita",
                    "user_href": "/profile/Adam-Devita"
                },
                {
                    "user_id": "Karl Walter",
                    "user_href": "/profile/Karl-Walter-1"
                },
                {
                    "user_id": "Siddharth Bhattacharya",
                    "user_href": "/profile/Siddharth-Bhattacharya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pedro Miranda",
                "href": "/profile/Pedro-Miranda-1"
            },
            "answer_text": "That makes as much sense as trying to run a car like boat. Although in states like Florida your drivers license is all you need to drive a boat. The difference is that in business decision making is very simple: which option maximizes profits for stakeholders. This is one of the most interesting points that Former treasury secretary and Goldman Sachs (company) Co-CEO Robert Rubin makes in his book In an uncertain world. He goes into detail about the challenges of moving from the corporate to the government world. In government decision making is much more complex. Even a very large firm has “only” 50,000 employees and maybe about the same number of investors that hold the majority of the shares. In the US there are over 300 million citizens and decisions not only impact these people, but also the world. Every one agrees that smoking is bad, but should the government make it illegal? Many lives could be saved if people could not smoke. On the other hand there are states such as North Carolina where it is a major agricultural product. Should the government take these farmers out of business? What consequences these actions would have on families and the local economy? Prohibition of tobacco would cause a hard impact in North Carolina,Virginia and Kentucky. If cigarettes continue to be legal the deaths are diluted through the US population, but the costs are much higher. Do you inflict major pain on a few states or a smaller pain on the entire population? Not a clear cut decision. To make matters worse in a company that would be the CEO decision to take. In government we have much slower and diluted decision making. So you could end up outlawing tobacco and paying farmers a compensation. This adds to government spending and you bring into the debate the fiscal conservatives versus those that want more social programs. Even if everything is settled at the national level some states choose to enact their own regulations and the story goes. Government should not be run like a business because it is a different animal. ",
            "date": "Updated January 21, 2018",
            "views": "93",
            "upvotes": " View 97 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jude Arney",
                    "user_href": "/profile/Jude-Arney"
                },
                {
                    "user_id": "Adam Robinson",
                    "user_href": "/profile/Adam-Robinson-236"
                },
                {
                    "user_id": "Anthony Kho",
                    "user_href": "/profile/Anthony-Kho"
                },
                {
                    "user_id": "Neilalohith Sharma",
                    "user_href": "/profile/Neilalohith-Sharma"
                },
                {
                    "user_id": "Horst Wahl",
                    "user_href": "/profile/Horst-Wahl-1"
                },
                {
                    "user_id": "Ris Lanz",
                    "user_href": "/profile/Ris-Lanz"
                },
                {
                    "user_id": "Jean Accoh",
                    "user_href": "/profile/Jean-Accoh"
                },
                {
                    "user_id": "Emperor Arya",
                    "user_href": "/profile/Emperor-Arya"
                },
                {
                    "user_id": "Stanyslav Mykhaylenko",
                    "user_href": "/profile/Stanyslav-Mykhaylenko"
                },
                {
                    "user_id": "Alan Davidson",
                    "user_href": "/profile/Alan-Davidson-31"
                }
            ]
        }
    ]
}