{
    "title": "What is the most advanced, top-secret weapon the US military is presently working on? - Quora",
    "tags": [
        "United States Armed Forces",
        "Weapons",
        "Military"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Martin",
                "href": "/profile/Scott-Martin-274"
            },
            "answer_text": "DARPA is working on a replacement for the M4 battle rifle that features lever action and new GPS-guided ammuntion that individual soldiers can direct using a specialized app on their smartphones. The app includes an embedded retina-scan camera that allows the soldier to control the direction and trajectory of each round by simply looking at a satellite image of the battlefield. The image has resolution sufficient to allow soldiers to identify individual enemy soldiers, which allows an American soldier to direct any bullet to strike targeted enemy soldiers. The accuracy of the system has been dialed in enough to allow for a 95% chance of a successful strike. The new rifle will have a 2.4ghz transmitter, and each round will have a mated receiver to ensure one soldier doesn’t accidentally direct another soldier’s rounds to the wrong target. The biggest drawback of the new rifle and targeting system is that an individual weapon weighs 47 pounds and requires a 30-pound rechargeable battery that has enough power to allow a soldier to fire 27–30 rounds per charge (the unit recharges in four hours). The Department of Defense believes the extreme accuracy of the system offsets its inefficiency. Current research is aimed at doubling the rate of fire from two rounds per minute to four rounds per minute. One major problem with the system is that the app works only on Android phones, and the current DOD cell-phone contract is with Apple and isn’t up for renegotiation for three more years. However, individual soldiers can apply for reimbursement if they buy their own Android phone to integrate with the new system. Along with the new rifle, DARPA is developing a new rucksack that allows a soldier to more efficiently carry his or her normal combat equipment, food, water, clothing and and the new rifle targeting system. The normal combat load and the new targeting system weighs about 180 pounds, and DOD hopes the new rucksack will come in at about 2 pounds less than the current combat rucksack, which should lighten the load enough to allow soldiers to carry the full load more easily. Because of the weight of the new targeting system and combat load, DARPA is also developing a new trapezoidal-shaped stealth parachute for airborne troops that allows a slower rate of descent and better directional control than the T-11 parachute. The new parachute is also capable of GPS control through the new targeting app, but soldiers who have tested the new parachute have found that using their cell phones during descent to control the parachute is not practical, and not possible at all for soldiers who don’t own their own Android phone or where there is no cell-phone service. The new targeting system, rucksack and parachute should be with operational military units some time next year. Until then, testing continues at a secret location across from the Dekalb County courthouse in Decatur, Georgia. ",
            "date": "Answered January 4, 2019",
            "views": "36",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tyler Moore",
                    "user_href": "/profile/Tyler-Moore-87"
                },
                {
                    "user_id": "Sten Mazer",
                    "user_href": "/profile/Sten-Mazer"
                },
                {
                    "user_id": "Steven Smith",
                    "user_href": "/profile/Steven-Smith-860"
                },
                {
                    "user_id": "John Shin",
                    "user_href": "/profile/John-Shin-54"
                },
                {
                    "user_id": "Albert Parkes",
                    "user_href": "/profile/Albert-Parkes-1"
                },
                {
                    "user_id": "AllsignsLLC EHT",
                    "user_href": "/profile/AllsignsLLC-EHT"
                },
                {
                    "user_id": "Shade Harris",
                    "user_href": "/profile/Shade-Harris-1"
                },
                {
                    "user_id": "Gary Goodale",
                    "user_href": "/profile/Gary-Goodale-1"
                },
                {
                    "user_id": "Jonathan Arnold",
                    "user_href": "/profile/Jonathan-Arnold-17"
                },
                {
                    "user_id": "Chris Morgan",
                    "user_href": "/profile/Chris-Morgan-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Lourne",
                "href": "/profile/David-Lourne"
            },
            "answer_text": "The Mega-Blast Death Ray!  Borne from the beginnings of the YAL-1; the MBDR no longer simply kills enemies; it removes them from existence! The MBDR is - according to Army spokesman Richard O’Brien - “A laser capable of firing a beam of pure antimatter” - a weapon whose effects on transvestites, tap-dancers and blond monsters has been known since 1975. Now - here’s the thing. I could be bullshitting you here - but have a care. No-one with actual knowledge of this specific topic would EVER discuss it on Quora - there’s this little thing called OPSEC that comes into play. A “Security Clearance” is not an idle, amusing concept for those of us who have/had them. So no matter what you might read; this answer is every bit as valid as any other that may be posted. Short answer: whatever new advanced weapons the military of any country might be developing, you will be the LAST to know. Cheers! ",
            "date": "Answered January 4, 2019",
            "views": "89",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mudabbir Dean",
                    "user_href": "/profile/Mudabbir-Dean"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/BigDaddyDunes"
                },
                {
                    "user_id": "Josh Schneider",
                    "user_href": "/profile/Josh-Schneider-42"
                },
                {
                    "user_id": "Adam Gajewski",
                    "user_href": "/profile/Adam-Gajewski-4"
                },
                {
                    "user_id": "Kalum Kumara",
                    "user_href": "/profile/Kalum-Kumara-2"
                },
                {
                    "user_id": "Anthony Daly",
                    "user_href": "/profile/Anthony-Daly-9"
                },
                {
                    "user_id": "Cd Yong",
                    "user_href": "/profile/Cd-Yong"
                },
                {
                    "user_id": "Diego Calahan",
                    "user_href": "/profile/Diego-Calahan"
                },
                {
                    "user_id": "Joseph Reinemann",
                    "user_href": "/profile/Joseph-Reinemann"
                },
                {
                    "user_id": "Cary Majors",
                    "user_href": "/profile/Cary-Majors"
                }
            ]
        }
    ]
}