{
    "title": "What are some interesting and relatively unknown websites? - Quora",
    "tags": [
        "Website Lists",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yash Gupta",
                "href": "/profile/Yash-Gupta-628"
            },
            "answer_text": "Spoiler:-No need to study whole answer because If you are a student then this is for u..!! Have u ever visited Exambazaar- One of the Largest Coaching, Previous Year and Exam Preparation Website used by most of the new comers ( students ) in every Exam Preparation. Where Do Indians Go Wrong While Planning Their Education And Career? What's Off With The Way We Learn? Why Are Pass and Enrolment Rates In Higher Education So Low? Is There A \"Stress-Minimum\" Way To Prepare For Competitive Exams? How Can Technology Help? See this Our mission is to ensure everybody does well in their Exam Preparation They do this by Helping people discover great coaching classes around them & online Examabazaar’s team gathers information from every coaching class on a regular basis to ensure our data is fresh. Their vast community of students share their reviews and photos, so you have all that you need to make an informed choice. Building amazing experiences around exam preparation Starting with information for over 28,000 coaching classes in India, we're making exam preparation smoother and more enjoyable with services like Exam Question a Day. Enabling coachings to create amazing experiences    With dedicated engagement and management tools, we're enabling coaching classes to spend more time focusing on teaching itself, which translates directly to better exam preparation experiences. Video Introduction  And now, something which will help you a lot- A Current Affairs Page. It is an everyday blog which Exambazaar’s Experts write everyday, including current affairs along with description points of each. You can subscribe to it and receive them in your mail every morning! Check it out below-   It is the most trusted website by students these days for all updates, study material and much more..!! ",
            "date": "Answered March 29, 2019",
            "views": "410",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ayush Jain",
                    "user_href": "/profile/Ayush-Jain-832"
                },
                {
                    "user_id": "Yash Gupta",
                    "user_href": "/profile/Yash-Gupta-1694"
                },
                {
                    "user_id": "Gaurav Parashar",
                    "user_href": "/profile/Gaurav-Parashar-39"
                },
                {
                    "user_id": "Shalini R",
                    "user_href": "/profile/Shalini-R-89"
                },
                {
                    "user_id": "S Maneesha Reddy",
                    "user_href": "/profile/S-Maneesha-Reddy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Gupta",
                "href": "/profile/Yash-Gupta-1694"
            },
            "answer_text": "Spoiler:-No need to study whole answer because If you are a student then this is for u..!! Have u ever visited Exambazaar- One of the Largest Coaching, Previous Year and Exam Preparation Website used by most of the new comers ( students ) in every Exam Preparation. Where Do Indians Go Wrong While Planning Their Education And Career? What's Off With The Way We Learn? Why Are Pass and Enrolment Rates In Higher Education So Low? Is There A \"Stress-Minimum\" Way To Prepare For Competitive Exams? How Can Technology Help? See this Our mission is to ensure everybody does well in their Exam Preparation They do this by Helping people discover great coaching classes around them & online Examabazaar’s team gathers information from every coaching class on a regular basis to ensure our data is fresh. Their vast community of students share their reviews and photos, so you have all that you need to make an informed choice. Building amazing experiences around exam preparation Starting with information for over 28,000 coaching classes in India, we're making exam preparation smoother and more enjoyable with services like Exam Question a Day. Enabling coachings to create amazing experiences    With dedicated engagement and management tools, we're enabling coaching classes to spend more time focusing on teaching itself, which translates directly to better exam preparation experiences. Video Introduction  And now, something which will help you a lot- A Current Affairs Page. It is an everyday blog which Exambazaar’s Experts write everyday, including current affairs along with description points of each. You can subscribe to it and receive them in your mail every morning! Check it out below-  It is the most trusted website by students these days for all updates, study material and much more..!! So what r u waiting for.. Subscribe now at Exambazaar. ",
            "date": "Answered April 12, 2019",
            "views": "159",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kamalika Som",
                    "user_href": "/profile/Kamalika-Som"
                },
                {
                    "user_id": "Shalini R",
                    "user_href": "/profile/Shalini-R-89"
                }
            ]
        }
    ]
}