{
    "title": "What naval battle is considered the turning point of WWII? - Quora",
    "tags": [
        "Battleships",
        "Naval Warfare",
        "Historic Battles",
        "United States Navy (USN)",
        "Naval Forces (non-specific)",
        "World War II",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Art Clack",
                "href": "/profile/Art-Clack-1"
            },
            "answer_text": "The Battle of the Atlantic. Full stop. While Midway was spectacular, the resources available to Japan were insufficient to the requirements for victory. We could have allowed Japan to run riot in the Pacific until after Victory in Europe day, and still beat her handily. Germany was a much more serious threat. Give Germany ten years in possession of the Continent and he would have been much harder to dislodge. Germany united those the Fatherland dominated. Japan merely enslaved those she dominated. After forty years as a Japanese colony Korea remained a maze of social fissures. Rich against poor. Collaborators against Korean nationalists against Chinese colonialists against Soviet colonialists against Allied soon-to-be colonialists. Those who went foreign as refugees and those who stayed behind as slaves. (WW2 Korea sounds like WW2 Italy, doesn’t it.) Because of her feudal society Japan did not value men. Their attitude was that a lost horse was a real loss but a lost man could be replaced for the cost of a draft-notice postcard. Japan squandered her greatest asset, which was her manpower burning with religious devotion. The Japanese did not even exercise and train damage control parties on their ships. To do so would be to entertain the inconceivable possibility that the ship might be hit; that Japan might lose. Banzai attacks were ordered and reported as great successes but the officers doing the reporting did not check and had no way of knowing the effect of an attack. Kamikazes were launched in piloted torpedoes that automatically exploded when they ran out of fuel. The mother submarines heard the explosion and reported the attack as a success. Consider this: If an American army officer is killed, is it acceptable for his subordinate to assume his responsibilities and his authority, at least until such time as the unit regains contact with higher authority. In European culture this is common. (I believe the deepest the chain of command has been exercised in this manner was aboard the Chesapeake. When the Captain was mortally wounded a Midshipman carried him to the Surgeon. During his absence all officers of superior rank were killed. The Midshipman was subsequently Court Martial-ed for deserting his post.) Consider this: In Vietnam attacking soldiers unexpectedly found themselves inside an American base; their attack had succeeded beyond expectation. The attackers had to exfiltrate thru the American wire, report to their superiors, ask for instructions, re-infiltrate the wire and continue the attack. By the time they returned the Americans had plugged the hole. A spectacular victory didn’t happen because the men with the opportunity didn’t have the authority to exploit it. Consider this: A year before the “surprise” attack on Pearl Harbor the captain of the light cruiser Salt Lake City told his officers to consider themselves on a war footing. His words were something like, “If you shoot a mistake, I will take all responsibility at our Court Martial. If we are sunk because you did not shoot, I am just going to shake my head and say, ‘I don’t know what happened.’ “ Consider this: During WW2, at Sevastopol, the German officer detailed to keep the army from being attacked from the rear, saw the Soviets were doing something worse than attacking; they were fortifying across the only supply route. They were “bagging” the entire German army by cutting across the base of the peninsula. The German officer had a choice: He could obey orders and Germany would lose an entire army or he could disobey orders and be shot for it. He disobeyed orders and was shot. His Division was penalized for a year by receiving no promotions and no awards. The lesson is that while Germany did not approve of his soldiers exercising initiative, initiative was a part of the European culture. The Japanese soldiers had no initiative; it was not part of their culture - at least not at the lower levels. There is a story of US Marine unit that heard a Banzai attack coming. What they heard was a couple of hundred drunk Japanese soldiers partying their way down the beach. The Marines moved their machine guns to point toward the assault, waited until they were close, then killed them all. The Japanese officers reported the attack as a glorious victory. And in their culture, it was. In their culture death while obeying orders was religiously equivalent to accomplishing the task assigned. Japan was not a threat. She was President Roosevelt’s straw man. The battle of Midway was spectacular, but not important. The Battle of the Atlantic was won when new weapons, new techniques, and sufficient numbers tipped the balance. Before the spring of 1943 the u-boat ruled. Afterward the life expectancy of a u-boat was reduced to two missions. That was important. ",
            "date": "Answered June 6, 2019",
            "views": "532",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gary Rush",
                    "user_href": "/profile/Gary-Rush-3"
                },
                {
                    "user_id": "Kit Whitfield",
                    "user_href": "/profile/Kit-Whitfield-1"
                },
                {
                    "user_id": "Andrew Holliday",
                    "user_href": "/profile/Andrew-Holliday-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Stratton",
                "href": "/profile/Mark-Stratton-8"
            },
            "answer_text": "There are two very important battles, one in the Pacific campaign, namely the Battle of Midway Island and one in the European theater, the Battle of the Atlantic. At Midway (June 1942), the US Navy sank 4 Japanese aircraft carriers for the loss of one of their own. This battle, following closely from the Battle of the Coral Sea marked the end of the Japanese advance and the beginning of the US fight back. The IJN never truly recovered from the loss of so many highly trained aircrew and never replaced the lost carriers. Meanwhile since the opening of hostilities in September 1939 the Royal Navy, ably assisted by the Royal Canadian Navy and later elements of the US Navy fought a long and bitter battle for supremacy over the German Navy for control of the shipping lanes that supplied the UK with the materials needed to fight the war. The German used surface raiders, mostly capital ships and armed merchant cruisers but mostly relied upon submarines (U-boats) in an attempt to stop the convoys. The Battle ebbed and flowed but the Allies, particularly the UK finally won by mid 1943. The breakthrough being the development of radar that could detect even the periscope of a submerged submarine that could be carried by ships and aircraft meant that the u-boat was no longer safe to operate on the surface. The victory allowed the allies to safely build up the men and materials needed to launch the invasion of Europe in 1944. ",
            "date": "Answered May 31, 2019",
            "views": "152",
            "upvotes": "0"
        }
    ]
}