{
    "title": "What if Japan in WW2 attack the Soviet Union instead? - Quora",
    "tags": [
        "Japan",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Smith",
                "href": "/profile/Joe-Smith-1778"
            },
            "answer_text": "I see two scenarios: 1: Japan launches a surprise offensive through Siberia. The Soviets pull some troops back to defend their borders, allowing the Germans to win the battle for Moscow. Since there is no Pearl Harbor, the US enters much later on (maybe 1943). By now, Japan and Germany have split up the Soviet Union (heavily favoring the Germans), and are free to focus on other offensives. Japan captures all of Southeast Asia and Australia, and Germany kicks the British out of Africa, and operation Sea Lion is attempted. By now America would try to intervene, but it would be too late, and World War 2 is lost. 2. Japan launches a surprise offensive again, but the Soviets realize the region has little value, aside from Vladivostok. The Soviets withdraw a few token divisions back to the east, but the Japanese advance has already ground to a halt. The brutal weather, snow and lack of coordination stops them dead in their tracks. The Soviet Union pushes the Germans back from Moscow, and Japan realizes there is no point in pushing further into Siberia, and decide to withdraw to Manchuria. Weakened, Japan makes no major moves for the rest of the war, until America joins the war in 1944, where they are destroyed by the Americans. After Germany is defeated, the might of the red army turns on Japan, and the Soviets manage to secure some of Manchuria in the final peace. ",
            "date": "Answered May 4, 2017",
            "views": "417",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nope Nope",
                    "user_href": "/profile/Nope-Nope-736"
                },
                {
                    "user_id": "Idk Games",
                    "user_href": "/profile/Idk-Games-1"
                },
                {
                    "user_id": "Błażej Seremak",
                    "user_href": "/profile/Błażej-Seremak"
                },
                {
                    "user_id": "Pedro Motta",
                    "user_href": "/profile/Pedro-Motta-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Pace",
                "href": "/profile/Steven-Pace-11"
            },
            "answer_text": "If japan had decided on russia as a target instead of british territories and indonesia, brunei, etc, then Russia probably would have collapsed. The USSR was not ready for a two front war. During the first winter, the russia europe theater would have had to tranfere troops to asia, instead of receiving troops from the east as happened historically. In the spring, the germans could have renewed their advance. Moscow probably would have fallen in the spring or summer of 42.The western allies could have declared war on japan, but they might not have. Without pearl harbour, the USA would not have acted nearly as decisively. The japanese would have had access to less exotic material such as tin, rubber, and oil, but access to more coal and iron ore. Russian siberia has a lot of resources. The resources available in siberia are actually better for 1940 japan then the places japan siezed from the western powers. Russian mechanised forces would be worth little in asia. The japanese navy could stay closer to home, and would be adquate to defend against US and UK for a fairly long time. China would certainly have been completely conquered. If used effectively, these resources could make japan quite powerful. In summary, the conflict between the USSR and Japan could have escalated, and it would have greatly benefited the axis powers, in my opinion. Japan could have advanced into the soft underside of the soviet union, uzbecistan, etc, and taken out much of the soviet productive capacity and resources. The USSR could have afforded to loose the resources, but not the factories of the Southern USSR. ",
            "date": "Answered May 3, 2017",
            "views": "723",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Idk Games",
                    "user_href": "/profile/Idk-Games-1"
                },
                {
                    "user_id": "Błażej Seremak",
                    "user_href": "/profile/Błażej-Seremak"
                },
                {
                    "user_id": "Julian Fejzo",
                    "user_href": "/profile/Julian-Fejzo"
                },
                {
                    "user_id": "Dmitriy Kotov",
                    "user_href": "/profile/Dmitriy-Kotov"
                },
                {
                    "user_id": "Hsiaoshuang Chen",
                    "user_href": "/profile/Hsiaoshuang-Chen"
                }
            ]
        }
    ]
}