{
    "title": "What strange events were overshadowed by World War I or II? - Quora",
    "tags": [
        "World War I",
        "World War II",
        "World History",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Valentin Viktorov",
                "href": "/profile/Valentin-Viktorov"
            },
            "answer_text": "I do not understand what do you mean by “strange events”, but there is a strange event related to the Hitler’s attack on Soviet Union. It is contained in a legend narrated by Samarkand guides. In this ancient Asian city one of the main tourist attractions is Gur-i-Amir (a Persian for “The Tomb of the King”) Mausoleum - a mosque on the city’s central square; in its crypt was buried famous warrior Tamerlan, head of immense empire conquered by his sword. After the revolution of 1917 and an end of Bokhara khanate they turned the mosque in the museum, but entrance to crypt was restricted in respect to local superstitions spread even between members of Bolshevik party. Just the same, in Samarkand was a rather populous archeologist community, for excavations in the city were numerous and they usually gave many interesting results. For all these archaeologists one cherished dream was common; they ardently desired to open the great conqueror’s grave and explore it: was Tamerlan really buried there, how well preserved were remains; would it be possible to recreate his image by sculpture based on his scull and all that: one thousand and one question so very liked by scientists. But to open a grave a permission was needed, in that case, a permission from a highest places, for Samarkand bosses waited the permission from Uzbekistan's capital, Tashkent; Tashkent bosses needed a benevolent nod from Moscow and it did not came. Years went by but nothing changed. Then, suddenly, news circulated over the city by the word of the mouth: Tashkent got its plead back; in the document stood out Stalin’s instruction: “Open the grave not later than May 1941”. It was easier said than done: one ought to convoke a scientific commission, prepare tools and lights (for not to disturb the local feelings without a need, it was decided to make works during the night). At last works started in the night of 19 June; a strange event occurred: when scientists came to the Gur-i-Amir three old men waited for them; one of them had in hand an old book; the elders tried to explain something, but they spoke language scientists did not understood; they gently waived old men away, entered into the crypt and began to do their job. On the next day they were certain: it was Tamerlan’s entombment; they found a skeleton of a tall man lame in one leg; other details of the burial left no doubt: it was a king’s grave. Works were finished on the next night. Near midnight one of the scientists learned a rumour: some forgotten tradition, people said in Samarkand, held that somewhere in the Gur-i-Amir there was an ancient inscription that told: “The day the tomb of the Master of the World is disturbed, all oikoumene will shudder”. Scientists went out, their job completed, scull of Tamerlan was carefully packed and ready to travel to Moscow. It was an early morning of June, 22 1941. One hour later they knew that a war has just started.  Scientists near Tamerlan’s remains.  Tamerlan’s image restored by Prof. Mikhail Gerasimov.  Interior of the Tamerlan’s crypt.  Gur-i-Amir, modern photo.  Gur-i-Amir’s main dome. Photo by Prokudin-Gorsky, 1910. ",
            "date": "Answered December 27, 2019",
            "views": "117",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Visnevski",
                    "user_href": "/profile/Andrew-Visnevski"
                },
                {
                    "user_id": "Krikor Agopian",
                    "user_href": "/profile/Krikor-Agopian"
                },
                {
                    "user_id": "Steven R. Boniferro",
                    "user_href": "/profile/Steven-R-Boniferro"
                },
                {
                    "user_id": "Alfred Smith",
                    "user_href": "/profile/Alfred-Smith-61"
                },
                {
                    "user_id": "Guillaume Slowik",
                    "user_href": "/profile/Guillaume-Slowik"
                },
                {
                    "user_id": "Jason Cronan",
                    "user_href": "/profile/Jason-Cronan"
                },
                {
                    "user_id": "Pramila Koparkar",
                    "user_href": "/profile/Pramila-Koparkar"
                },
                {
                    "user_id": "Semon Saji Simon",
                    "user_href": "/profile/Semon-Saji-Simon"
                },
                {
                    "user_id": "Dave Mitchell",
                    "user_href": "/profile/Dave-Mitchell-101"
                },
                {
                    "user_id": "Armando Barreto",
                    "user_href": "/profile/Armando-Barreto-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Dugger",
                "href": "/profile/Scott-Dugger"
            },
            "answer_text": "I think the influence of the Occult in both wars has been strongly over looked. In some ways the occult might have even started the wars. In WWI we have Rasputin which strongly urged Nikoli The Bloody to enter and go to the front lines to lead, in which had no idea as to what he was doing. Grigori Rasputin - Wikipedia When WWI ended the occult pick out people like Hitler and other Nazis to enter in and influence WWII When WWII ended, Democratic President Harry S. Truman saved 1600 Nazis and let them enter into the USA. Shortly after we have large occult followings begin, Jim Jones, Charlie Manson etc... We had MKUltra begin by the CIA which focused on occult concepts of remote viewing etc.. Harry S. Truman - Wikipedia List of German aerospace engineers in the United States - Wikipedia ",
            "date": "Answered January 25, 2020",
            "views": "334",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ted Faraone",
                "href": "/profile/Ted-Faraone-1"
            },
            "answer_text": "Einstein & Co. were on the way to proving the Theory of General Relativity by taking photographs of the heavens during a total eclipse of the sun, which they would then compare to pictures taken at night. The First World War got in the way. Off to someplace in someone’s colonial empire due to the path of the eclipse, they were detained by combatants and some of their equipment was ruined. ",
            "date": "Answered January 23, 2020",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Lucky",
                "href": "/profile/Jonathan-Lucky"
            },
            "answer_text": "The problem of how to deal with the government of Ireland was high on the agenda for Britain 1914. The Liberal government relied on Irish votes to get its laws through Parliament, so it had to do something This wasn't helped by the fact that many of the senior army officers based in Ireland, notably those who were based at the curragh refused to obey orders. The king offered allparty talks to discuss the way forward Then Sarajevo happened and nothing was done. Instead it would take a further 7years to propose and implement an agreement which would separate the North from the south. The consequences of this delay yas the EAster rising and increased violence through the the UK but mostly in Ireland, the peace Treaty of 1921separTing the nationalist south and the loyalist North Had the assassination not happened many lives might have been saved. ",
            "date": "Updated December 31, 2019",
            "views": "281",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Allan Muise",
                "href": "/profile/Allan-Muise-1"
            },
            "answer_text": "During World War 1, the “Spanish Flu Epidemic” was ravaging the entire world. Estimates go as high as 30 million killed. P.S. Spain didn’t cause the Spanish Flu. It got the name because only Spanish newspapers reported the flu. Most other nations were locked into WW1, and those governments only wanted to report good news, and hush up the bad news. ",
            "date": "Answered January 24, 2020",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christian Heckmann Engelbrecht",
                "href": "/profile/Christian-Heckmann-Engelbrecht"
            },
            "answer_text": "The miraculous Shackleton rescue was almost not reported at the time, ’cause the Great War had not broken out, when they left for Antarctica.  ",
            "date": "Answered January 23, 2020",
            "views": "225",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony Bartlett",
                "href": "/profile/Tony-Bartlett-3"
            },
            "answer_text": "Probably the worst was the Spanish Flu epidemic of 1918 which killed more worldwide than were killed in the 4 years of war ",
            "date": "Answered December 31, 2019",
            "views": "66",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Pedder",
                    "user_href": "/profile/Tim-Pedder"
                },
                {
                    "user_id": "Bob Dickson",
                    "user_href": "/profile/Bob-Dickson-4"
                }
            ]
        }
    ]
}