{
    "title": "What do you think of table tennis? - Quora",
    "tags": [
        "Table Tennis"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aleksandr Mazo",
                "href": "/profile/Aleksandr-Mazo"
            },
            "answer_text": "In the nutshell, I think of table tennis as one of the greatest games that was ever created. I play table tennis 5 - 6 times a week: workdays during lunch breaks, and Thursdays and Sundays I play at my local club’s tournaments.  To elaborate a little, I’d like to list some of the features of the game that make it so appealing to me: When you really play table tennis on a competitive level, as opposed to the recreational activity, you really get a full body workout. Before you even begin playing, you have to stretch a lot to warm up your muscles; during training and/or competitions, I normally change 2 shirts since they are completely drenched in sweat (sorry for the gross details).Table tennis also provides an excellent training for your eyes. In my work, I have to look at the computer screen for about 8–9 hours a day, and that’s very tough on my eyes. During the table tennis game/training, you have to focus your eyes on the ball, which travels at high speed across the table, so you are forcing your eye muscles to shift focus back and forth very rapidly and that activity strengthens them.The sheer volume of different types of playing styles and variations of equipment available make this sport the most unpredictable and challenging, (especially at competition levels). For more advanced players, the game evolves to a blitz chess type of mental activity, where you have to come up with split second decisions and utilize a strategy to defeat your opponent. Everything comes into play: your equipment, your opponent’s equipment, styles of play, etc…This game requires an enormous amount of skill and “feel” for the ball, which take years to develop. This is the only physical game where a 75 year old veteran can crush a 25 year old rookie without breaking much sweat.Every match resembles a duel, where each player has their own custom and unique weapon. I’ve come from a martial arts background, and table tennis was my cross sport, because it utilizes the same principles of generating power (by rotation of the hip and utilizing the legs and the core muscles in the body), also because it requires very quick reflexes and split-second decision making.It’s also a very fun (and sometimes frustrating) game to play, no matter what your level is.If I think of anything else I will edit the post, however, I hope I was able to capture the beauty of this game to encourage more people to start playing this GREAT sport.  BTW, for those who don’t know, competition/pro players use the term “Table Tennis” not “Ping-Pong”, since the latter is a commercial game trademarked by an English sports company - John Jaques & Son and Table Tennis the name of the actual Sport. Cheers, ",
            "date": "Answered November 24, 2017",
            "views": "32",
            "upvotes": " View 58 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Placido Abajay",
                    "user_href": "/profile/Placido-Abajay"
                },
                {
                    "user_id": "Theetharappan RM",
                    "user_href": "/profile/Theetharappan-RM"
                },
                {
                    "user_id": "Sean O'Neill",
                    "user_href": "/profile/Sean-ONeill-49"
                },
                {
                    "user_id": "Zhu David",
                    "user_href": "/profile/Zhu-David-5"
                },
                {
                    "user_id": "V Sivapragasam",
                    "user_href": "/profile/V-Sivapragasam"
                },
                {
                    "user_id": "Sanket Rout",
                    "user_href": "/profile/Sanket-Rout"
                },
                {
                    "user_id": "Prithviprakash Ramachandran",
                    "user_href": "/profile/Prithviprakash-Ramachandran"
                },
                {
                    "user_id": "Avinash Prabhakar",
                    "user_href": "/profile/Avinash-Prabhakar-10"
                },
                {
                    "user_id": "Alpha Chuks",
                    "user_href": "/profile/Alpha-Chuks"
                },
                {
                    "user_id": "Athreya Narayana Swamy",
                    "user_href": "/profile/Athreya-Narayana-Swamy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nelson Ignacio Reyes",
                "href": "/profile/Nelson-Ignacio-Reyes"
            },
            "answer_text": "Thank you for the A2A. In order to contextualize my answer, I am South American, and I have always loved all racquet sports (both watching AND playing!). Now that the years of my youth are over, I have taken to internal martial arts as well. Playing soccer, as with most other South American boys, was also a big passion earlier in my life … now I watch. Out of all the sports universe, team sports vs. indivivual sports could be construed as a big distinction. A second one would be, contact vs. no contact sports. Table tennis inhabits a particular spot on the sports universe, determined specifically by the conditions in which it is played. The most critical abilities it requires are great stamina, above average flexibility, high agility, extremely quick reflexes, flawless connection between your senses and your body reactions (way past simple eye-hand coordination), a strategic mind, the ability to change course within hundreds of a second depending on many variables, mental fortitude, big endurance. Table tennis is the closest sport to combat sports that doesn’t have actual physical contact; the time available to perceive, react, adapt, strategize, execute, recover on each shot is maybe between 0.5 and 1.5 seconds, depending on your level, and this needs to be sustained over longer rallies, and repeated over and over. Just like in tennis, many dimensions must be taken into account, other than left or right; depth, height, angles relative to your position, the table and where your opponent is plus your and his momentum, “weight” of the shot you are receiving and giving, ball speed, spin, counter spin, style of the opponent, your own style, unpredictable events like nets, ball hitting the borders of the table … I have always liked sports that blend the mind, the body and the spirit and require the interworking of them together in changing conditions. I enjoy enormoulsy the challenge offered by table tennis; it is too bad that it is difficult to find high level players to practice with where I live, so I do more tennis than table tennis these days. Table tennis is one of my top five most favorite activities in the whole world. ",
            "date": "Updated June 24, 2019",
            "views": "608",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Theetharappan RM",
                    "user_href": "/profile/Theetharappan-RM"
                },
                {
                    "user_id": "Prithviprakash Ramachandran",
                    "user_href": "/profile/Prithviprakash-Ramachandran"
                },
                {
                    "user_id": "Alpha Chuks",
                    "user_href": "/profile/Alpha-Chuks"
                },
                {
                    "user_id": "Rohit Gupta",
                    "user_href": "/profile/Rohit-Gupta-3017"
                },
                {
                    "user_id": "Srikant Mahapatra",
                    "user_href": "/profile/Srikant-Mahapatra"
                },
                {
                    "user_id": "Henry Smith",
                    "user_href": "/profile/Henry-Smith-63"
                }
            ]
        }
    ]
}