{
    "title": "What is the oldest country? - Quora",
    "tags": [
        "Oldest",
        "Ancient History",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Beau Ap Gwyddon",
                "href": "/profile/Beau-Ap-Gwyddon"
            },
            "answer_text": "Think I need to revive this old question from a few years ago simply because every reply offered is from a mainstream Euro-centric perspective that chooses to completely ignore the existence of indigenous countries that existed long before the arrival or invasion of their countries and nations by Europeans. So first, define ‘Country’. “A country is a political state, nation, or controlled territory. It is often referred to as the land of an individual's birth, residence, or citizenship.” So given that definition, in Australia there was around 250 separate countries, some of which were divided into regions that you could think of as ‘states’, so altogether there were over 500 autonomous regions. These all go together to form the single Aboriginal Nation. In Australia, the Federal government now recognizes the existence of those countries and at most official events, an indigenous ‘Welcome to Country’ statement or ceremony is conducted to commence proceedings. These indigenous countries are many thousands of years old and were already ancient and respected as individual, self-governing regions with their own languages, totems and lore many thousands of years before places like Mesopotamia existed. But I’m guessing that the original questioner was thinking more in terms of the oldest civilization with a specific recognized political system and set of ‘laws’ (as opposed to ‘lore’). That would have to be the Catalhoyuk civilization in Southern Anatolia (now Turkey), with significant urban settlements and farmlands up to 8,000 years old. ",
            "date": "Answered September 20, 2020",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Venkata Ramakrishna Duvvuri",
                "href": "/profile/Venkata-Ramakrishna-Duvvuri"
            },
            "answer_text": "There could be many older civilizations including Greek, Messapetomia, the North East Sindhu civilization of ancient India etc. But which country was the oldest depends upon reckoning from the day the concept of the ‘Country’ came in. All these civilizations might be existing parallel without entertaining the concept of a ‘country’. The concept of a country can arise only against the concept of another country. It might have taken a long time for the concept of a ‘country’ much later to the existence of these civilizations in different parts of the world. It is quite possible some tribal civilizations also existed parallel without the notice of others say relatively more advanced civilizations ",
            "date": "Updated August 31, 2019",
            "views": "390",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ArcaneVirago19"
                }
            ]
        }
    ]
}