{
    "title": "What other countries besides France do French people consider to be major French-speaking countries? - Quora",
    "tags": [
        "Culture of France",
        "French Ethnicity and People",
        "French (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anna Bomby",
                "href": "/profile/Anna-Than-1"
            },
            "answer_text": "Any country that uses French as daily/administration language. This includes other European countries like Belgium, Luxembourg, Monaco. This also includes countries that have provinces that use French language like Canada, Switzerland.Finally this includes all the countries that kept French after the colonial era (mostly in Africa), I don’t know all of them, but some are Burundi, Algeria, Morocco, Congo, Bénin, Sénégal, etc. Some provinces or cities also have French as historical language, but it’s barely used (in contrast to another language) actually and we don’t consider them important: Puducherry (India), Vatican, Mauritania, etc. There are also countries where French is the daily language or part of the daily language without being official like Mauritius, Andorra, Lebanon, etc, those are considered of mixed languages and cultures and couldn’t be really situated as MAJOR French-speaking countries. Check this link to learn more: List of territorial entities where French is an official language - Wikipedia. Do try to check the French version of the article, it’s more explanatory. ",
            "date": "Answered April 5, 2017",
            "views": "346",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shai Preter",
                    "user_href": "/profile/Shai-Preter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roman de Rafael",
                "href": "/profile/Roman-de-Rafael"
            },
            "answer_text": "Belgium Québec Part of Switzerland Then I’d say : Tunisia Lebanon Algeria Morrocco Ivory Coast Dem. Rep. Congo (Kinshasa is actually the biggest francophone city in the word) Congo Gabon Sénégal Mali (Western africa to sum it up) Madagascar And then” little” countries : Mauritius Islands Luxembourg French Dom-Tom (Antilles, Guyane, New-Caledonia, Polynesia, Réunion Islands) Monaco Now you will oftenly encounter french speaking people in countries such as Italy, Germany, Russian elites, English elites eg. this map : Redirect Notice Overall its the 7th most spoken language. And because of western Africa’s demographic and economic growth it is a growing language. BesT. ",
            "date": "Answered April 6, 2017",
            "views": "293",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shai Preter",
                    "user_href": "/profile/Shai-Preter"
                },
                {
                    "user_id": "Ahmed Jama",
                    "user_href": "/profile/Ahmed-Jama-47"
                }
            ]
        }
    ]
}