{
    "title": "What is the authentic Italian spice that is now becoming a famous spice in the world? - Quora",
    "tags": [
        "Authenticity and Inauthenticity",
        "Spices",
        "Italian Food and Cuisine",
        "Flavors",
        "Italy",
        "Recipes",
        "Cooking"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Bruck",
                "href": "/profile/Don-Bruck"
            },
            "answer_text": ">>Which authentic Italian herb/spice has now become world famous? I am trying to figure out if there are any “authentic Italian spices”. That would mean something in use before Marco Polo and his kind started moving spices from Asia. Let’s look at some traditional Italian herbs to test their authenticity as Italian. Basil, also called great basil, is a culinary herb of the family Lamiaceae. Basil is native to tropical regions from central Africa to Southeast Asia. It is a tender plant, and is used in cuisines worldwide. WikipediaOregano is a flowering plant in the mint family. It is native to temperate Western and Southwestern Eurasia and the Mediterranean region. Oregano is a perennial herb, growing from 20–80 cm tall, with opposite leaves 1–4 cm long. The flowers are purple, 3–4 mm long, produced in erect spikes. WikipediaSalvia rosmarinus, commonly known as rosemary, is a woody, perennial herb with fragrant, evergreen, needle-like leaves and white, pink, purple, or blue flowers, native to the Mediterranean region. Until 2017, it was known by the scientific name Rosmarinus officinalis, now a synonym. WikipediaParsley or garden parsley is a species of flowering plant in the family Apiaceae that is native to the central and eastern Mediterranean region, but has naturalized elsewhere in Europe, and is widely cultivated as an herb, and a vegetable. WikipediaAncient Egyptians used thyme for embalming.The ancient Greeks used it (thyme) in their baths and burnt it as incense in their temples, believing it was a source of courage. The spread of thyme throughout Europe was thought to be due to the Romans, as they used it to purify their rooms and to \"give an aromatic flavour to cheese and liqueurs\".Thyme - Wikipedia",
            "date": "Answered June 17, 2020",
            "views": "66",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Francine Granville",
                    "user_href": "/profile/Francine-Granville"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Balthazar Sforza-Krasinski",
                "href": "/profile/Balthazar-Sforza-Krasinski"
            },
            "answer_text": "Herbs & spices? Hard to say. Pizza, pasta, pesto & polenta now known all over the world, they all originate in Italy. ",
            "date": "Answered June 17, 2020",
            "views": "17",
            "upvotes": "0"
        }
    ]
}