{
    "title": "What are the most famous last words in history? - Quora",
    "tags": [
        "Famous Last Words",
        "Last Words",
        "Fame and Mass Popularity"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Cate",
                "href": "/profile/John-Cate-2"
            },
            "answer_text": " “Pusha da button!” On 20 March 1933, Giuseppe Zangara was executed in the electric chair for the murder of Chicago Mayor Anton Cermak during a public appearance with President-Elect Roosevelt at Bayfront Park in Miami. The incident took place on Feb. 15 of that year, and it is thought that Zangara was trying to assassinate Roosevelt. Zangara somehow failed to hit him even though he had been an expert marksman in the Italian Army (there’s a joke to be made there), but did hit five other people with each one of his bullets. One of them mortally wounded Cermak. Zangara was immediately captured and put on trial for five counts of attempted murder, while Cermak was trying to recover from his injuries. He admitted to the crimes and was sentenced to 80 years in prison, but taunted the judge and asked for an even hundred. When Cermak died on 6 March, Zangara was charged with first-degree murder for his death, and he was re-sentenced to the electric chair. Before he died, Cermak said “I’m glad it was me and not you.” One can only speculate on what might have happened in the years to come if this insane anarchist had hit FDR instead of Cermak. He went to the electric chair without complaint two weeks later. His last words were: “You give me electric chair. I no afraid of that chair! You one of capitalists. You is crook man too. Put me in electric chair. I no care! Get to hell out of here, you son of a bitch [said to the chaplain] … I go sit down all by myself… Viva Italia! Goodbye to all poor peoples everywhere!… Lousy capitalists! No picture! Capitalists! No one here to take my picture. All capitalists lousy bunch of crooks. Go ahead. Pusha da button!” They pusha’d da button… 1933: Giuseppe Zangara, who is not on Sons of Italy posters ",
            "date": "Updated September 10, 2020",
            "views": "234",
            "upvotes": " View 366 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rafael Lopez",
                    "user_href": "/profile/Rafael-Lopez-366"
                },
                {
                    "user_id": "Keith Greenberg",
                    "user_href": "/profile/Keith-Greenberg-9"
                },
                {
                    "user_id": "Richard Morris",
                    "user_href": "/profile/Richard-Morris-158"
                },
                {
                    "user_id": "Debra Furphy",
                    "user_href": "/profile/Debra-Furphy-2"
                },
                {
                    "user_id": "Simona Trubin",
                    "user_href": "/profile/Simona-Trubin"
                },
                {
                    "user_id": "Gabriela Reypet",
                    "user_href": "/profile/Gabriela-Reypet"
                },
                {
                    "user_id": "Wiener Mom",
                    "user_href": "/profile/Wiener-Mom"
                },
                {
                    "user_id": "Mike Tipps",
                    "user_href": "/profile/Mike-Tipps-2"
                },
                {
                    "user_id": "Arla Unger",
                    "user_href": "/profile/Arla-Unger"
                },
                {
                    "user_id": "Annette Solmes",
                    "user_href": "/profile/Annette-Solmes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronald Kimmons",
                "href": "/profile/Ronald-Kimmons"
            },
            "answer_text": "Not really the MOST famous, but certainly some of my favorites… Johann Wolfgang von Goethe is possibly the greatest literary figure in German history.  He was a Christian, but he shied away from the sectarian world, preferring to walk his own path. He frequently wrote on spiritual themes. He was also a scientist. He actually said that he was proud not of his literary accomplishments, but of his scientific accomplishments. His most notable scientific contribution was his work regarding light and colors, which he published in his Theory of Colours. On his deathbed, Goethe was seemingly in delirium when he uttered his last words: “More light!”  Thomas “Stonewall” Jackson was a Confederate general in the American Civil War.  He was a fierce, wily, and inspiring commander who defeated and thoroughly embarrassed numerically superior Union forces on many occasions. He was also known for being a very kind man, especially to those who could give him nothing, such as children and slaves. It seems that he was deeply conflicted about the institution of slavery, though he never said anything of note about it either way. It seems that he disliked it but assumed that God had allowed it for a reason. He chose to fight for the Confederacy simply because he saw Union troops as foreign invaders of his homeland (Virginia). He was also known for being a bit eccentric. He loved to suck on lemons, for which reason people sent him lemons as gifts throughout the war. He also had a tendency of walking down the street with his hand raised to heaven in religious devotion. Unlike his friend General Stuart, who was known for his flamboyance and his penchant for dressing like a dandy, Jackson was rather reserved and tended to dress in a manner more similar to what the average soldier would wear. Jackson had a tendency of leading from the front and scouting enemy positions himself, calmly ignoring the sound of long-range shots landing around him. On the eve of his greatest victory against Union forces, he ventured out too far beyond the main lines of his own army. Upon returning, in the twilight, his own troops mistook him and his attendants for enemy cavalry and opened fire. Jackson was bedridden for a while as a result of his wounds, finally dying a bit later. The doctor who was present at the time recalled his final moments in this way: A few moments before he died he cried out in his delirium, \"Order A.P. Hill to prepare for action! Pass the infantry to the front rapidly! Tell Major Hawks\"—then stopped, leaving the sentence unfinished. Presently a smile of ineffable sweetness spread itself over his pale face, and he said quietly, and with an expression, as if of relief, \"Let us cross over the river, and rest under the shade of the trees.\"  Martin Harris was one of the Three Witnesses of the Book of Mormon.  As it seems that he perceived the record not while in its physical presence as other witnesses did, but rather in a spiritual vision, critics often say that he could not even count as a witness. They will also point to the fact that he spent most of his life estranged from the Church of Jesus Christ of Latter-day Saints and its leadership. However, it is evident that he honestly believed in the Book of Mormon to his dying day. As he lay dying, he testified of the Book of Mormon in this manner: The Book of Mormon is no fake. I know what I know. I have seen what I have seen and I have heard what I have heard. I have seen the gold plates from which the Book of Mormon is written. An angel appeared to me and others and testified to the truthfulness of the record, and had I been willing to have perjured myself and sworn falsely to the testimony I now bear I could have been a rich man, but I could not have testified other than I have done and am now doing for these things are true. ",
            "date": "Answered September 13, 2017",
            "views": "69",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Keith Greenberg",
                    "user_href": "/profile/Keith-Greenberg-9"
                },
                {
                    "user_id": "Simona Trubin",
                    "user_href": "/profile/Simona-Trubin"
                },
                {
                    "user_id": "Arla Unger",
                    "user_href": "/profile/Arla-Unger"
                },
                {
                    "user_id": "David Fatman",
                    "user_href": "/profile/David-Fatman"
                },
                {
                    "user_id": "Mechelle Amodia",
                    "user_href": "/profile/Mechelle-Amodia"
                },
                {
                    "user_id": "Cheryl Marx-Bingham",
                    "user_href": "/profile/Cheryl-Marx-Bingham"
                },
                {
                    "user_id": "Brian Haugh",
                    "user_href": "/profile/Brian-Haugh-1"
                },
                {
                    "user_id": "Kathy Smith",
                    "user_href": "/profile/Kathy-Smith-1245"
                },
                {
                    "user_id": "Andy Sears",
                    "user_href": "/profile/Andy-Sears-2"
                },
                {
                    "user_id": "Christopher Meade",
                    "user_href": "/profile/Christopher-Meade-3"
                }
            ]
        }
    ]
}