{
    "title": "What is the greatest entrance in cinema history? - Quora",
    "tags": [
        "World and Non-U.S. Cinema",
        "Cinematography",
        "Movie Directing",
        "Screenwriting",
        "Fiction",
        "Movie Production",
        "Literature",
        "Movie Business and Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Willie Holmes",
                "href": "/profile/Willie-Holmes-1"
            },
            "answer_text": "Some of my faves: 1. Shaft (1971)-the camera pans over NY's 42ND Street. The drum riff of the movie's iconic (and Oscar-winning) theme song begins. The camera stops over a subway entrance as John Shaft (Richard Roundtree) comes onto the street and begins to walk it like he owns it. Even giving a car that nearly hits him The Finger while still standing in front of it. Now that's a bad mother...(SHUT YO' MOUTH)! 2. Superman (1978)-After the ghost of Jor-El (Marlon Brando) explains the history of everything to young Clark/Kal-El (Jeff East) for several years, they return to the Fortress of Solitude where we suddenly see things from Jor-El's point of view. Kal is now a grown man and wearing the familiar red and blue tights and cape of Superman (Christopher Reeve), who flies towards the camera before veering off to the right. 3. Dr. No (1962)-James Bond (Sean Connery) is standing on a Jamaican beach when he spots a beautiful woman in a white bikini with a knife strapped to her waist walking out of the water like a modern-day Venus. Meet Honey Ryder (Ursula Andress), the first official Bond Girl. 4. Mysterious Island (1961)- In this adaptation of Jules Verne's classic novel, some of the castaways have fought pirates whose ship mysteriously explodes. Others have escaped a hive of giant bees. Suddenly, they see a man in a bizarre wetsuit (keep in mind this is taking place around the time of the U.S. Civil War) with a giant seashell attached to the back of it. This is their Savior, the elusive Captain Nemo (Herbert Lom). ",
            "date": "Answered August 14, 2016",
            "views": "796",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thibaut Oskian",
                "href": "/profile/Thibaut-Oskian"
            },
            "answer_text": "I’m surprised that, despite the high quality of many entries, nobody mentioned anything by Sergio Leone, who is in my humble opinion the master of characters’ entrances. 1 - Blondie (Clint Eastwood) in The Good, The Bad & The Ugly The bad and the Ugly have incredible entrances that are still studied in film schools all around the world to this day, and Eastwood’s character has many top notch intros throughout the film. But nothing beats his entrance (at 0:35 in the following clip, in one of the greatest shot ever):  2 - Frank (Henry Fonda) in Once Upon A Time In The West To get the incredible impact of that scene for 1960’s moviegoers, you have to know that Henry Fonda had never played a baddie at the time. In his own words, the worst thing he had ever done on screen was shooting his friend James Stewart in the foot by accident. Right before Frank’s entrance in OUATITW, a whole family is slaughtered while the murders are hiding from the viewer. I’ll let the film speak for itself from there:  Sergio Leone wanted the audience to think: “Oh my God, this is Henry Fonda!” Well, talk about an effective shot at 1′35. 3 - Cheyenne (Jason Robards) in Once Upon A Time In The West I couldn’t find an online clip for this one, which is a shame as the way it’s told is utterly cinematic: sounds and only sounds for a full minute. Before we get to see Cheyenne, we hear him. The full story of his escape from lawmen, happening right outside the outpost we’re in, is told by sounds (horses, gunshots, footsteps…) while the camera stays inside, scrutinizing the reactions of everybody. Before we get a first glimpse at Cheyenne or even hear about him, we already know he’s dangerous… and that we really, really want to see him. After the last gunshot is fired, a few seconds of silence. Everybody’s starring at the door, desperately wanting to see who did this. A suspens music rises. Suddenly, Cheyenne bursts through the door and stop right there, his face still in the darkness, a ray of light on his eyes. The few notes of his personal theme resonate in the outpost.  He goes to the bar, asks for a bottle and that’s when wee see his handcuffs. His story suddenly becomes clear.  As you can see in the clip, his entrance is followed by Harmonica’s (Charles Bronson) second scene in the movie, which could have make for a great entrance too… but his real entrance was brilliant: 4 - Harmonica (Charles Bronson) in Once Upon A Time In The West At this point, we’ve been waiting with these 3 guys in duster for 10 minutes in real time at the station, and that’s all you need to know.  I’ll stop here, although I’d note that Jill’s (Claudia Cardinale) entrance from the same movie is absolutely magnificent, as is Sean’s (James Coburn) one in Duck, You Sucker. Clint Eastwood has another great first scene in For A few Dollars More, that should get mentioned here but even I have to admit it aged. ",
            "date": "Answered August 14, 2016",
            "views": "14",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bunyamin Burak",
                    "user_href": "/profile/Bunyamin-Burak"
                },
                {
                    "user_id": "Sourav Maji",
                    "user_href": "/profile/Sourav-Maji-11"
                },
                {
                    "user_id": "Jose Aníbal Cárdenas Vera",
                    "user_href": "/profile/Jose-Aníbal-Cárdenas-Vera"
                },
                {
                    "user_id": "Dhandapani Vel",
                    "user_href": "/profile/Dhandapani-Vel"
                },
                {
                    "user_id": "Bill Ness",
                    "user_href": "/profile/Bill-Ness"
                },
                {
                    "user_id": "Gianni Brancazio",
                    "user_href": "/profile/Gianni-Brancazio"
                },
                {
                    "user_id": "Tom Pare",
                    "user_href": "/profile/Tom-Pare"
                },
                {
                    "user_id": "Valentino Gamboa",
                    "user_href": "/profile/Valentino-Gamboa"
                }
            ]
        }
    ]
}