{
    "title": "What is a good book for learning chess strategies? - Quora",
    "tags": [
        "Chess Openings",
        "Chess Thinking Process",
        "Chess Strategies",
        "Chess",
        "Learning New Things"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zachary Brown",
                "href": "/profile/Zachary-Brown-25"
            },
            "answer_text": "Chess is incredible. Even a hundred years later, people still pore over games played by the old masters, trying to understand what they were thinking, and how they saw the wonderful moves they saw. How many games can we say that about? Chess, go, crumble, and what else? Is there even one other? The best chess books, I’d say, are books about the endgame. Those are the books that will do the most to dramatically increase your depth of understanding of the game. There are general-purpose endgame books, that try to cover as many different types of endgames as possible, and there are specialty books that focus on just one particular type of scenario. Of the bazillion that are available, one of my personal favorites is Secrets of Pawn Endings by Muller and Lamprecht. It goes down the rabbit hole of one of the most insane aspects of chess - the twisted dance of kings as they try to one-up each other. Another along the same lines is Secrets of Rook Endings by John Nunn. It takes a more profound look at the topic than any previous effort, to the point of discovering new ideas like reciprocal zugzwang, that no one in history had even obliquely mentioned before. But neither of those books will truly deepen your chess sense. They’re just awesomely amazing. If you just want to quickly improve your game, stick with a general-purpose whopper like Fundamental Chess Endings (also by Muller and Lamprecht). Now that book will change you. The next-best chess books, in my opinion, are middle game books. There’ve been a lot of advances made in chess theory since the 1930s, particularly in the area of dynamic valuation, for example exactly what percentage of a pawn a centralized knight is worth. After Fischer and Karpov, those kind of dynamics really took center stage, and you’ll have grandmasters keeping a straight face while saying things like, “I think I’m ahead by a third of a pawn in this position.” But I doubt you’ll find any book that will teach that kind of subtle ability to compare fractional advantages. For that, you’ll need to get one of the many super-grandmaster-ass-whupping software chess engines, and use it about eight hours a day for five or six years, studying your little heart out analyzing the games of your contemporaries. While you’re doing that, you should probably study positional evaluation in books like Complete Chess Strategy 1, Complete Chess Strategy 2, and Complete Chess Strategy 3 by Pachman, or just get the abridged version, Modern Chess Strategy, translated by Alan Russell. Also study tactics and combinations in books like Chess by Polgar. Also the third member of the triumvirate, (position, tactics, and…) the chess thinking process itself. For that, Alexander Kotov came up with a variety of books, one of which is Think Like A Grandmaster. He lays out a very good approach, though really any book of that type needs to be read critically. There’s no such thing as a ‘proper’ thought process. Everyone just figures out what works for them, and so should you. Finally, you should get some of the books of annotated games by the great masters of their day. Morphy, Capablanca, Alekhine, and Fischer should be first on your list. They all have really great books annotating their games. There are also some amazing collections, like 500 Master Games of Chess, and the sequel, 100 Master Games of Modern Chess, which painstakingly group together some of the best games ever played. You should also not neglect to study certain players like Philidor, Steinitz, Lasker, Frank Marshall, Michail Tal, Tigran Petrosian, Garry Kasparov, and Magnus Carlsen. But I don’t care what anybody says. Capablanca was the greatest chess player of all time. It’s just obvious. Whatever era he’d been born in, he would have wiped everyone off the map as easily as he did in the late 1910’s and early 1920’s. So really, the best way to judge any chess rating system (Elo, Chessmetrics, etc) is by how close it puts Capablanca on top. Seriously. He was the best. Anyway, those are my book recommendations. Conspicuously absent are any openings books. That’s because openings books are a big waste of time at first. How do you know what openings to study? How do you know what moves are going to lead the game into the types of positions you’re good at playing? Are you stronger in dynamic, unbalanced positions? Or maybe you’re better at slow positional games. Or does your true strength lie elsewhere? You have no clue. So you have to put it off. Learn to play the game, and learn your own personal style. Only after you’ve done that, should you start looking into the openings that will allow you to force your opponent onto your turf, or at least off of their own. ",
            "date": "Updated September 19, 2017",
            "views": "72",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Navde Rana",
                    "user_href": "/profile/Navde-Rana"
                },
                {
                    "user_id": "Iacopo Berti",
                    "user_href": "/profile/Iacopo-Berti"
                },
                {
                    "user_id": "Harry Durant",
                    "user_href": "/profile/Harry-Durant"
                },
                {
                    "user_id": "Jay Wayne",
                    "user_href": "/profile/Jay-Wayne-51"
                },
                {
                    "user_id": "Ahmed Asadi",
                    "user_href": "/profile/Ahmed-Asadi"
                },
                {
                    "user_id": "Abdulqader Alabdali",
                    "user_href": "/profile/Abdulqader-Alabdali"
                },
                {
                    "user_id": "Bishal Rai",
                    "user_href": "/profile/Bishal-Rai-118"
                },
                {
                    "user_id": "Rishabh Mendon",
                    "user_href": "/profile/Rishabh-Mendon"
                },
                {
                    "user_id": "Lilly Patty Sulli",
                    "user_href": "/profile/Lilly-Patty-Sulli"
                },
                {
                    "user_id": "Ashu",
                    "user_href": "/profile/Ashu-470"
                }
            ]
        },
        {
            "author_info": {
                "name": "Håkon Hapnes Strand",
                "href": "/profile/Håkon-Hapnes-Strand"
            },
            "answer_text": "Considering there are hundreds of thousands of chess books in existence, it’s hard to give a definitive opinion on which one is the best. The late GM Lothar Schmid had around 50,000 books in his private collection, but I doubt he read them all. My collection is a little smaller, sitting at around 100 books, but I’ve read most of them, enough to give you my highly subjective opinion. The problem with chess books is that the most popular ones are usually written by Grandmasters, and Grandmasters are usually not very good writers, with some exceptions. Your typical chess book is an openings book covering one opening from the perspective of the writer. In my opinion, these books are usually not very interesting. They’re a necessary evil. My favorite chess books are the ones that combine some chess with stories about the people behind the moves. For me, it’s easier to engage with the annotated games and relate with the moves if I have a backstory. That also makes the books much more entertaining to read. My sentimental favorite is The Life and Games of Mikhail Tal (1976) by Mikhail Tal. It’s a very interesting look into the life of one of the true legends of the game. Tal was not only a brilliant player, he was also a very good writer. Zürich International Chess Tournament, 1953 (1979) by David Bronstein is another classic, along with The Sorcerer’s Apprentice (1995) by the same author. Russian Silhouettes (2001) by Russian-Dutch GM Gennadi Sosonko takes it to the extreme, having no annotated game. That book is a nostalgic look at the some of the key players in the golden era of Soviet chess. Sosonko has written four more books like this. I haven’t read them all, but as far as I can tell they’re all excellent if you’re interested in chess history and stories about chess players. Other prolific and well-regarded writers in recent years are Jacob Aagaard, Jonathan Rowson, Raymond Keene and John Nunn. ",
            "date": "Answered September 19, 2017",
            "views": "139",
            "upvotes": " View 138 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Giovanna Cordima",
                    "user_href": "/profile/Giovanna-Cordima"
                },
                {
                    "user_id": "ChessMood",
                    "user_href": "/profile/ChessMood"
                },
                {
                    "user_id": "Swapnil Suman",
                    "user_href": "/profile/Swapnil-Suman-3"
                },
                {
                    "user_id": "Kondapalli Radha",
                    "user_href": "/profile/Kondapalli-Radha"
                },
                {
                    "user_id": "Ashutosh Barkataky",
                    "user_href": "/profile/Ashutosh-Barkataky-1"
                },
                {
                    "user_id": "Gaurav Bindra",
                    "user_href": "/profile/Gaurav-Bindra-4"
                },
                {
                    "user_id": "Vrushabh Naik",
                    "user_href": "/profile/Vrushabh-Naik-6"
                },
                {
                    "user_id": "Gaurav Saini",
                    "user_href": "/profile/Gaurav-Saini-621"
                },
                {
                    "user_id": "Samuel Abera",
                    "user_href": "/profile/Samuel-Abera-2"
                },
                {
                    "user_id": "Rahul Gandhi",
                    "user_href": "/profile/Rahul-Gandhi-31"
                }
            ]
        }
    ]
}