{
    "title": "What is the most likely way humanity will end? - Quora",
    "tags": [
        "Doomsday",
        "Apocalyptic and Post-Apocalyptic Hypothetical Scenarios",
        "The Future",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "K. E. Sizemore",
                "href": "/profile/K-E-Sizemore"
            },
            "answer_text": "So no global warming and no nuclear war, but man made.  That really only leaves a mutated virus, maybe a resistant bacterial plague, or a some sort of mutation to our genes that leaves us less than human (zombie apocalypse scenario I guess).   I think the most likely is something like Ebola.  If it advances just a little more to where it can spread a further without detection as quickly, it could spread very rapidly.  The strengths, lets call them, of the Ebola virus are that it can be spread with no initial symptoms, and newly infected patients may not show symptoms for many days, up to 21 days.  Let's say it evolves and hides it symptoms for a minimum of 21 days, probably not a crazy stretch if it continues running rampant and getting only partially fought off.  If a kid were to catch this somehow and go to a large school in the U.S., let's say around Christmas time so it exposes the whole school and then people travel with it.  Then it would be spread halfway across the country by New Year's Day.  The thing about that is still, people would quickly isolate themselves, if they weren't exposed they'd be locked inside somewhere till the coast is clear and then take extreme precautions after that.  People are paranoid many times because it is a survival instinct, fear keeps us alive, and people are willing to undergo a lot of misery they don't normally undergo here to stay alive.  It would certainly crash economies and change the world as we know it, but I doubt anything man-made could wipe out all of humanity in one shot really.  Even if it could become dormant for months and still spread, some parts of the world are quite isolated and would ensure they remained that way if they found out about a massive disease outbreak. ",
            "date": "Answered June 30, 2015",
            "views": "447",
            "upvotes": "0"
        }
    ]
}