{
    "title": "What is the average salary in Norway? - Quora",
    "tags": [
        "Norway"
    ],
    "response": [
        {
            "author_info": {
                "name": "Knut Holt",
                "href": "/profile/Knut-Holt"
            },
            "answer_text": "The average salary in Norway is around 44000 crowns a month. After taxation this is reduced to around 32000 crowns If you convert this to dollars according to current quote, this will be around 4000 USD. But this equivalence is only effective if you convert the Norwegian currency to dollars and spend the money abroad. But the cost of housing and living costs in Norway are among the highest in the World, if not the highest. Therefore I think the monthly avarage salary in Norway after taxation, corrected for living costs is equivalent to only around 2000 USD,. Also be aware that the avarage salary shown here is an avarage across all salaries from the lowest to the highest. The average salery of ordinary workers are substantially less. Because of the high living costs, Norway has in reality a substantial powerty problem. ",
            "date": "Answered August 6, 2017",
            "views": "76",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dane Lee",
                    "user_href": "/profile/Dane-Lee-13"
                },
                {
                    "user_id": "Loan Phương",
                    "user_href": "/profile/Loan-Phương-4"
                },
                {
                    "user_id": "Edward Ssewanyana",
                    "user_href": "/profile/Edward-Ssewanyana-1"
                },
                {
                    "user_id": "Tejasree Parvatham",
                    "user_href": "/profile/Tejasree-Parvatham"
                },
                {
                    "user_id": "Tahir Celikkol",
                    "user_href": "/profile/Tahir-Celikkol"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johan Barstad",
                "href": "/profile/Johan-Barstad"
            },
            "answer_text": "Not nearly enough! (when was ever the salary big enough? For any of us? ) If you go to national statistics (2020-02-05), you will find a national average in 2019 of 45 610 NOK per month. That would equal pretty close to 4 500 €. This is pre tax, so an average persons take home per month would be around 3400 €. ",
            "date": "Answered June 18, 2020",
            "views": "934",
            "upvotes": "0"
        }
    ]
}