{
    "title": "What selective pressures could have resulted in a species of human that averages 7.5 feet tall? - Quora",
    "tags": [
        "Tall People",
        "Species"
    ],
    "response": [
        {
            "author_info": {
                "name": "Garry Cylon",
                "href": "/profile/Garry-Cylon"
            },
            "answer_text": "I would think being able to see above the savannah would qualify, although good height in past generations with better nutrition helps the next generation or two. Longer arms also means being able to throw better and further. I am a white guy not quite 6 foot tall, but dad was a head shorter, and I have a nephew who is about a foot taller than me. In future, it should be possible to “edit” our genomic material and make bespoke children, not only to try and erase some genetic illnesses, but to also select for traits you would like them to have such as be a basketballer that you were always to short to be. Some SciFi novels also have normal people living in freefall that grew that “tall”, although they could no longer live in gravity. This question also gives a new meaning to that old Star Trek Vulcan phrase, “Live long and prosper” :) ",
            "date": "Answered November 2, 2018",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rhett Winthrop-St.Gery",
                "href": "/profile/Rhett-Winthrop-St-Gery"
            },
            "answer_text": "Inhabitants of low gravity planets are usually taller, easier for them to reach into and climb taller trees. And if there were shorter sentient denizen varieties, perhaps they did not compete as well. Or the tallness genes were dominant. High gravity planets are not suitable for tall beings, one slip or fall, more so on any rocky slope, and you are done for. Avalanches worse there as to results. Short with lungs adapted to high pressure, very strong frame or skeleton, perhaps composed of light elements or compounds, magnesium alloy like Japan scientists developed. Japan High Strength Magnesium Alloy ",
            "date": "Answered November 3, 2018",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pascal Barre",
                "href": "/profile/Pascal-Barre"
            },
            "answer_text": "Early humans have started to walk upright in order to see their predators at the appearance of a new type of grass (C-4), which started to reduce the patches of dense forests our early ancestors lived in. In that respect, if that type of grass could have grown higher, it could have favored early humans to grow taller… But then again, if the grass is too high, early humans might have never thought to stand up in the first place to see its predator coming… So we might just have ended dead meat after all… ",
            "date": "Answered November 3, 2018",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Boernke",
                "href": "/profile/William-Boernke"
            },
            "answer_text": "All humans are members of the same species. The average height of the human species has been increasing over time. “…over the last 150 years the average height of people in industrialized nations has increased approximately 10 centimeters(about four inches).” (Google) ",
            "date": "Answered November 2, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony Stanley",
                "href": "/profile/Tony-Stanley-16"
            },
            "answer_text": "None. They are genetic anomalies. ",
            "date": "Answered November 4, 2018",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Boffey",
                "href": "/profile/David-Boffey"
            },
            "answer_text": "People asking stupid questions. ",
            "date": "Answered November 2, 2018",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ray Salmon",
                "href": "/profile/Ray-Salmon"
            },
            "answer_text": "None Adsm and Eve were the first people  ",
            "date": "Answered November 2, 2018",
            "views": "11",
            "upvotes": "0"
        }
    ]
}