{
    "title": "What is the street light history before electricity? - Quora",
    "tags": [
        "Urban History",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Wong",
                "href": "/profile/Joseph-Wong-30"
            },
            "answer_text": "Way back in history, there was no street light until the law mandated everyone with a window facing the Main Street had to put a light by the window.  People failed to do so would be fined.  Chinese use lanterns lit up with candles.  Then there were the ones manually lit using oil (any kind of animal oil, fish oil, beeswax, even sesame oil). Historical record also found that Chinese even started gas lighting using bamboo pipes 1700 years ago.  Westerner use copper and glass lanterns while Easterners use paper lanterns.   It wasn't until the 14thcentury then they start using gas mostly still manually lit in London. It wasn't the type of gas we have today.  First gas distillers from wood called thermolampe was patent in 1799 in England and coal-gas lighting patent in Germany in 1804.   There were a lot of breakthroughs in the early 1800. London in 1808 and Westminster Bridge was the first bridge on record lit by gas in 1813. Baltimore was the first city to adopt gas street lighting in the U.S in 1816.  1819 in Russia ( not popular until 1839), Paris, France adopted gas street lighting in 1820.   Brighter lamps using illuminating gas (hydrogen and hydrocarbon) was invented by Austrian in 1891.  Throughout the 19th century and into the 20th century, gas lamp was used in varying degrees of improved fuel and equipment.  Gas lamps were slowly replaced by electricity street lamps in late 19th century.  Although the first electric street lighting employed arc lamp was developed by Russia in 1875, reliability did not warrent its replacement of the gas lamp.  Frequent outage of electrical system and maintenance intensive kept gas lamp alive and well into the 19th century.  Today, gas lamp can still be found in some cities for nostalgic reasons as well as memory of the past.  Baltimore has one so are many cities around the world.  There is a gas lamp district in San Diego California.  If you find one in your city.   Please share. ",
            "date": "Answered May 17, 2015",
            "views": "38",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Enrique Reyes",
                    "user_href": "/profile/Enrique-Reyes-10"
                },
                {
                    "user_id": "Michael Dee",
                    "user_href": "/profile/Michael-Dee-28"
                },
                {
                    "user_id": "Jim Parr",
                    "user_href": "/profile/Jim-Parr-4"
                },
                {
                    "user_id": "Raphael",
                    "user_href": "/profile/Raphael-216"
                },
                {
                    "user_id": "Eric Marc Otto",
                    "user_href": "/profile/Eric-Marc-Otto"
                },
                {
                    "user_id": "Tristan Fernandes",
                    "user_href": "/profile/Tristan-Fernandes"
                },
                {
                    "user_id": "Lee Jerry",
                    "user_href": "/profile/Lee-Jerry-1"
                },
                {
                    "user_id": "Ben Wheatall",
                    "user_href": "/profile/Ben-Wheatall"
                },
                {
                    "user_id": "Pinaki Mohanty",
                    "user_href": "/profile/Pinaki-Mohanty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Kumar",
                "href": "/profile/Rahul-Kumar-37757"
            },
            "answer_text": "Lack of natural light during nighttime in the urban environment was always a problem. From basic inconvenience that people cannot see where they are going to the greater chance of being attacked or mugged during the night. Because the problem was there since humans started living together, history of street light is maybe longer than we think. It is known that natural gas was led through bamboo pipes from volcano gas leaks to the streets of Peking to serve as a fuel for street lamps and that as early as 500 years BC. Ancient Romans used oil lamps filled with vegetable oil in front of their houses and had special slaves whose only duty was to take care of those lamps, to light them, extinguish them and watch that they always have oil. First organized method of public lightning was done on 1417, when Mayor of London, Sir Henry Barton first ordained that by law all houses must hang lanterns outside when night falls during the winter months. Paris street were illuminated first time by order in 1524 that said that all houses must have light in the windows at night if they face the streets. One more method to brighten the streets at nights were “link-boys”, children servants that wealthy citizens of London paid to carry torches while accompanying them through the city (practice that was sometimes dangerous because they sometimes led their costumers into dark alleys to be mugged by footpads). Era of more efficient street lightning starts with William Murdock who, for the first time in 1802, lit the outside of the Soho Foundry in a public presentation with a gas light fueled with coal gas. After that, in 1807, London got its first gas lit street. Baltimore was the first city in the United States that started using gas for streetlight in 1816 while Paris started gas illumination of its streets in 1820. Gas was led through pipe installations to the gas lanterns that were placed on poles. Every evening the lamplighters, men whose job was to take care of the gas streetlights, were lighting the lanterns and every morning they were putting them off. This was done until the invention of the mechanism that lit the lamps when the gas was released in the lamp. After that came electricity and made street lightening even more efficient. First electric streetlight used arc lamps, namely “Yablochkov candle”. It was first used in 1878 in Paris. By 1881, some 4000 were in use, replacing gas lanterns on the poles. After the spreading of the arc lamps in the United States, by 1890 there were more than 130,000 arc lamps installed as streetlights. Most of them were installed on the tops of so-called “moonlight towers” - tall, metal constructions that illuminated more city blocks at once. Arc lights had two major flaws: they made strong, harsh light and they did not last long. So in time they were replaced with incandescent lamps that were cheaper, brighter and lasted longer, while arc lamps remained useful on industrial sites. Today, streetlights use high-intensity discharge lamps, mostly HPS high-pressure sodium lamps. ",
            "date": "Answered July 27, 2020",
            "views": "118",
            "upvotes": "0"
        }
    ]
}