{
    "title": "What are the common traits of highly intelligent people? - Quora",
    "tags": [
        "Personality Traits and Characteristics",
        "Understanding Character and Personality",
        "Smart People",
        "Social Psychology",
        "Character and Personality",
        "Psychology",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Estes",
                "href": "/profile/Steve-Estes"
            },
            "answer_text": "Building on Seb and Steve Stofka's answers, the people I think of as \"scary smart\" tend to share these abilities: Immediate drill-down to the essentials.  When I worked for Roger Ehrenberg at IA Ventures, he could listen to an entrepreneur for ~5 minutes and immediately ask, at most, 4 questions that would either validate or entirely blow up that entrepreneur's credibility or business model.  Given enough time, practice or attempts, many other people could eventually arrive at those same questions, but he would, without hesitation, always ask what we'd later realize to be the most important questions that added the most signal, or decision-making value, to further consideration.  To do that in a chosen area of your own expertise is not that uncommon, with some practice.  To do that in what is, often, an entirely new subject matter, in front of a specialist expert (in this case, an entrepreneur), is brilliance.Parsimony of words; economy of thought.  One habit that tends to jump out at other people is someone who is quiet.  We all have a natural human desire to get attention, be appreciated, be listened to.  Many people converse as if they're just waiting for their turn to talk.  Scary-smart people usually have no such insecurity, will frequently listen a lot (if it's a good use of their time), and when they open their mouth it's usually to ask a question.  But their time is so important to them that their rare statements usually have a minimum of words, and phrase things with elegant simplicity.  They'll choose the words that have the precise shade of meaning they intend, and won't repeat themselves or say more than is necessary.  Many of them are great teachers, because they know how to phrase things for maximum clarity and leave minimum room for misunderstanding.  Those who are best at it - say, George Bernard Shaw - get their pronouncements enshrined as quotes or proverbs.  The ability to dispense wisdom, and little else, requires scary smarts.Inability to suffer fools.  A common - though perhaps unflattering - characteristic of all the scary-smart people I've had the pleasure to know, is that the one thing they cannot abide is someone who is wasting their time.  Someone who doesn't know when to shut up, someone who acts as if they have knowledge that they don't - any form of BS is the antithesis of what's important to them and their minds.  Because they have often met with unbridled success in their lives, they have never been in a position where they have had to suffer fools - so nearly all of them don't, or do so very poorly.  Bill Gates and Steve Jobs are canonical examples.  Many politicians are not, even if a few of them are themselves scary-smart.Lightning-fast assimilation of new information.  Just as readily observed in academia as it is in the business world, a scary-smart person will pick things up in a new subject faster than you probably thought possible.  They will read between the lines, flip through the textbook with a \"yeah, yeah, let's move on\" attitude, use terms-of-art confidently in conversation moments after learning their meaning.  They will identify the gaps in knowledge in an area, the exceptions or edge cases, because those are interesting to them - and because the mental tool of defining the boundaries of knowledge helps them understand what's inside those boundaries, get confident that they've learned what's important, and land on the implications or their next steps as a result.Dramatic leaps in logical reasoning.  Smart people can reason, out loud or internally, step by step, from what they know towards what must consequently be.  Very smart people will skip a few steps in explaining their reasoning, particularly to other smart people, because (again) time is important and the intermediate steps are obvious.  Scary-smart people will cite a few givens, state a conclusion whose origins are impenetrable to the rest of us, and then just move on.  They will show you exactly how they got there, or what factors they're considering and how they're weighing them, only upon being pressed to do so.They end up being right, or being proven right, a remarkably high percentage of the time.  Some of this can be illusory, because they're substituting an ability to win the argument (by obfuscating bad assumptions) for an ability to more deeply perceive what the future is likely to hold.  They will almost never lose an argument conducted on rational grounds, and commonly are very driven by a need to be right all the time.  The better-socialized ones will respect anyone who can argue them down about something; those with more insecurities will move goalposts or over-weight factors in order to win anyway, or just plain resent someone capable and confident enough to do so on the rare occasions that it happens.They don't take the time to write overly-long answers on Quora :)Good Will Hunting is a good portrait.  At any sufficiently competitive college, or at sufficient levels of success in a highly competitive field, you'll meet plenty of people who fit that description. Finally, I'll note that there's a distinction between people who are \"scary-IQ-smart\" and people who are \"scary-EQ-smart\".  I've focused on the former because I think that was the intent of the question.  But the latter group of people - say, Bill Clinton or Jon Stewart - are equally interesting, and often more subtle about their abilities. ",
            "date": "Updated June 11, 2015",
            "views": "294",
            "upvotes": " View 250 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devin Clary",
                    "user_href": "/profile/Devin-Clary"
                },
                {
                    "user_id": "Tim Ruhlen",
                    "user_href": "/profile/Tim-Ruhlen"
                },
                {
                    "user_id": "Delores Rockett",
                    "user_href": "/profile/Delores-Rockett"
                },
                {
                    "user_id": "Roy Tapio Kosonen",
                    "user_href": "/profile/Roy-Tapio-Kosonen"
                },
                {
                    "user_id": "Ranim Jarrar",
                    "user_href": "/profile/Ranim-Jarrar"
                },
                {
                    "user_id": "Sweta Sharrma",
                    "user_href": "/profile/Sweta-Sharrma"
                },
                {
                    "user_id": "John Himuka",
                    "user_href": "/profile/John-Himuka-日向-ジョン"
                },
                {
                    "user_id": "Addison Finley",
                    "user_href": "/profile/Addison-Finley-1"
                },
                {
                    "user_id": "Zechariah Stammer",
                    "user_href": "/profile/Zechariah-Stammer"
                },
                {
                    "user_id": "David Isaac",
                    "user_href": "/profile/David-Isaac-64"
                }
            ]
        }
    ]
}