{
    "title": "What are Nazca lines? - Quora",
    "tags": [
        "Nazca Lines"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manish Mamgai",
                "href": "/profile/Manish-Mamgai-3"
            },
            "answer_text": "Nazca lines are a group of giant geoglyps (land pictures or motifs) in the Nazca desert of Southern Peru. Some pictures of Nazca lines :    These lines were created between 500 BC and 500 CE. These lines are created by the ancient nazca culture of South America. They depict various plants, animals and other shapes. The 2000 year old nazca lines can only be fully appreciated when viewed from the air given their massive size. These geoglyps are 10 - 15 cm deep and are between 0.4-1.1 km wide. Their combined length is 1300 km. They cover an area of 50 Sq. Km. They were made by scrapping off the top layer of reddish brown - iron oxide - coated pebbles to reveal a yellow grey sub soil. There are three basic types of Nazca lines - straight lines, geomatric lines and pictorial representations. These lines were designated as UNESCO's world heritage site in 1994. But despite of being studied for 80 yrs these lines are still a mystery for researchers. Some associate these lines with religious beliefs and some with aliens. But the real purpose of these lines is still mysterious. Footnotes: Nazca Lines - Wikipedia The Nasca Lines Are One of Peru's Mysteries Nazca Lines | HISTORY Thank you. ",
            "date": "Answered December 23, 2018",
            "views": "205",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Agbondiwmin Ọyáwálé",
                    "user_href": "/profile/Agbondiwmin-Ọyáwálé-1"
                },
                {
                    "user_id": "Kunsang Bhutia",
                    "user_href": "/profile/Kunsang-Bhutia-7"
                },
                {
                    "user_id": "Devendra Singh Mehra",
                    "user_href": "/profile/Devendra-Singh-Mehra-1"
                },
                {
                    "user_id": "Harsh",
                    "user_href": "/profile/Harsh-748"
                }
            ]
        },
        {
            "author_info": {
                "name": "Somanyu",
                "href": "/profile/Somanyu"
            },
            "answer_text": "The Nazca Lines in southern Peru are a group of pre-Columbian geoglyphs etched into desert sands. Covering an area of nearly 1,000 sq. kilometers, there are about 300 different figures, including animals and plants. Composed of over 10,000 lines, some of which measure 30 meters wide and stretch more than 9 kilometers, the figures are most visible from the air or nearby hilltops. ",
            "date": "Answered December 24, 2018",
            "views": "89",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brindha U",
                    "user_href": "/profile/Brindha-U-1"
                }
            ]
        }
    ]
}